[{"id": "8cb1138f-3d08-4bcc-bdf6-72478f85cb03", "title": "Hezbollah reveals military muscle in clashes with Israel", "date": "2024-08-17 04:30", "url": "https://dunyanews.tv/en/World/831311-hezbollah-reveals-military-muscle-in-clashes-with-israel", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah reveals military muscle in clashes with IsraelWorld World Hezbollah reveals military muscle in clashes with IsraelHezbollah has gradually revealed its military capabilities in cross-border clashes with Israel.\nSince Israel and Hezbollah last went to war in 2006, the pro-Iran militant group has increased its military strength, according to analysts.\nHezbollah likely released the video to \"deter\" Israel from a major operation against it, he said.\nThe group has released three videos purportedly showing drone footage over military and other facilities in northern Israel including the port city of Haifa, and the annexed Golan Heights.\nKahwaji also said that Hezbollah wants to \"avoid provoking Israel into an all-out war\"."}, {"id": "5b7dbe18-f39e-4266-a603-484f1de2e854", "title": "IAF strike in Lebanon kills 9 , Hezbollah hesitant to respond amid Doha summit", "date": "2024-08-17 06:30", "url": "https://www.ynetnews.com/article/rjtl7htqr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Media outlets aligned with Hezbollah in Lebanon reported 9 fatalities on Friday night in an airstrike targeting a residential building in Nabatieh, southern Lebanon.\nIDF spokesperson confirmed this morning the strike targeted a Hezbollah weapons depot in the Nabatieh area.\nOther strikes in southern Lebanon focused on military facilities of the militant group.\nIAF strikes in southern Lebanon ( Video: IDF Spokesperson's Unit )In Lebanon, the attack has been referred to by some as the \"Wadi al-Khufur Massacre.\"\nLocal reports from southern Lebanon indicated that the strike targeted a family home with 12 members, with some victims being children."}, {"id": "4ab81127-b537-4bcd-b0c4-38cb82d01212", "title": "Hezbollah footage shows  underground rocket launch site - Newspaper", "date": "2024-08-17 04:30", "url": "https://www.dawn.com/news/1852827/hezbollah-footage-shows-underground-rocket-launch-sites", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Lebanese group Hezbollah published footage on Friday that appeared to show its fighters driving trucks with rocket launchers through a maze of tunnels to an apparent underground launch site.\nThe footage, four minutes and 35 seconds long, is the latest in a series of videos by the group showing its purported military capabilities.\nThe newest video depicts fighters riding motorcycles, working on laptops and driving around a dozen trucks through the rocky tunnels.\nThe video identified the facility as being named “Imad 4”, an apparent reference to Imad Mughniyeh, a shadowy Hezbollah commander killed in 2008.\nShortly after Hezbollah published its video, the Iranian embassy in Beirut said Iran had its own underground missile stations that could strike Israel."}, {"id": "e20383de-7244-4a7a-9ee6-377a78f61ea0", "title": "Blinken heading to Israel to press Gaza truce", "date": "2024-08-17 05:15", "url": "https://www.rte.ie/news/2024/0817/1465405-gaza/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "US Secretary of State Antony Blinken will travel to Israel this weekend to push forward a Gaza ceasefire deal as the United States tries to bridge the gaps in talks in the region, the State Department said.\nMr Biden and the two key Arab leaders had publicly urged Hamas and Israel to join the talks.\nIran has threatened to retaliate against Israel after the assassination of Hamas leader Ismail Haniyeh in Tehran on 31 July.\nThe US has dispatched warships, submarines and warplanes to the region to defend Israel and deter potential attackers.\nThe strike came after ceasefire talks between PalestinianIslamist group Hamas and Israel in Doha paused yesterday with negotiators due to meet again next week."}, {"id": "436e78ea-af5b-4605-981d-d22d19021da5", "title": "Deadly suicide attack in southern Yemen kills 14 soldiers", "date": "2024-08-17 06:30", "url": "http://www.china.org.cn/world/2024-08/17/content_117372482.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器A suicide bomber suspected to be affiliated with Yemen-based al-Qaeda branch killed at least 14 soldiers in the country's turbulent southern province of Abyan on Friday morning, a security official said.\nThe explosion caused significant casualties, with initial medical reports indicating that at least 14 soldiers lost their lives in the attack.\nThe local Yemeni security official said the death toll may rise as medical teams continue to treat the severely wounded soldiers.\nThe Yemen-based branch of al-Qaeda has not yet claimed responsibility for the attack.\nThe incident marked the latest in a series of violent attacks against the STC forces and pro-government forces in Yemen which has been embroiled in a civil war since 2014."}, {"id": "b7f0764a-73f9-45f9-8d95-4b31489a30e4", "title": "Lebanon says nine killed in Israeli strike , fear of wider war in Middle East persists", "date": "2024-08-17 08:00", "url": "https://www.firstpost.com/world/lebanon-says-nine-killed-in-israeli-strike-fear-of-wider-war-persists-13805514.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "ReutersLebanon’s health ministry reported that an Israeli air strike on Saturday in southern Lebanon resulted in the deaths of nine people, including a woman and her two children, with five others wounded, two of them critically.\nThe strike occurred in the Nabatieh area, approximately 12 kilometres from the Israeli border.\nAdvertisementThe Iran-backed Hezbollah and Israeli forces have been engaged in near-daily exchanges of fire across the border since the conflict in Gaza between Palestinian Hamas militants and Israeli forces escalated last October.\nThe Israeli military had said back then in a statement that its air force had “struck Hezbollah military structures” including in the Blida area.\nTen months of cross-border violence between Hezbollah and Israeli forces has killed senior commanders and several hundred fighters from the Iran-backed group, causing destruction and displacing tens of thousands on both sides."}, {"id": "92a7026b-15d6-401c-bba8-3a531dbf2229", "title": "Hamas : Gaza rescuers say Israeli strike kills 15 from same family", "date": "2024-08-17 09:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/gaza-rescuers-say-israeli-strike-kills-15-from-same-family/articleshow/112585602.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGaza's civil defence agency said an Israeli air strike in the early hours of Saturday killed 15 people from a Palestinian family , including nine children and three women.The strike hit the home of the Ajlah family in Al-Zawaida neighbourhood of central Gaza, civil defence spokesman Mahmud Bassal told AFP.\nThe Israeli military did not offer an immediate comment.\n\"The toll from the Israeli strike on the Ajlah family home and their warehouse in Al-Zawaida is 15 dead,\" Bassal said.Bassal gave a list of those killed, including nine children and three women.A witness said the strike took place shortly after midnight.\n\"Three rockets hit the house directly,\" Ahmed Abu al-Ghoul told as rescuers pulled bodies from the rubble of the flattened house.\n\"There were a lot of children and women inside... What have they done to deserve this?"}, {"id": "a2118855-d16e-49b9-a9fc-98834d9ba499", "title": "At least 9 killed in Israeli strike on Southern Lebanon", "date": "2024-08-17 06:00", "url": "https://www.rappler.com/world/middle-east/israel-strike-lebanon-updates-august-17-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The victims were all Syrian citizens, NNA said, adding that a final toll of the strike would be announced after DNA tests were conducted to determine the identity of the victims.\nThe Israeli military said the airstrike targeted a weapons depot used by Hezbollah militants.\nThe strike came after ceasefire talks between Palestinian Islamist group Hamas and Israel in Doha paused on Friday with negotiators due to meet again next week.\nTensions have soared in the region in recent weeks, after a deadly rocket strike in the Israeli-occupied Golan Heights that Israel blamed on Hezbollah.\nIsrael responded with the killing of a top Hezbollah commander in the suburbs of Beirut."}, {"id": "688ca266-caf4-4ee5-8fee-967ff9a6995b", "title": "Israeli strike in south Lebanon kills 10 , injures 5 , state news agency says", "date": "2024-08-17 09:15", "url": "https://www.marketscreener.com/news/latest/Israeli-strike-in-south-Lebanon-kills-10-injures-5-state-news-agency-says-47677880/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "BEIRUT (Reuters) -Around 10 people were killed, including two children, and five were wounded by an Israeli strike on a residential building in the city of Nabatieh city in south Lebanon, state news agency NNA said on Saturday.\nThe Israeli military said the airstrike targeted a weapons depot used by Hezbollah militants.\nThe strike came after ceasefire talks between Palestinian Islamist group Hamas and Israel in Doha paused on Friday with negotiators due to meet again next week.\nTensions have soared in the region in recent weeks, after a rocket strike blamed on Hezbollah killed 12 children and teens in the Israeli-occupied Golan Heights.\nHezbollah has vowed to retaliate against Israel, as has Iran for the killing in Tehran of the political chief of the Palestinian Hamas group, Ismail Haniyeh."}, {"id": "b7e96d89-e75e-4197-8ff5-573846596631", "title": "At least six killed in Israeli strike on south Lebanon", "date": "2024-08-17 07:00", "url": "https://www.yahoo.com/news/least-six-killed-israeli-strike-062618991.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At least six killed in Israeli strike on south LebanonCows stand near a fire that started as a result of missile and drone attacks from Lebanon into Israel.\nIlia Yefimovich/dpaAt least six people were killed in an airstrike on a residential building in southern Lebanon, the Lebanese Health Ministry said on Saturday.\nThree others were injured in the Israeli strike, the ministry said in a statement.\nOn Friday, at least one person was killed and another wounded in an Israeli strike that hit the village of Aitaroun in southern Lebanon, the Lebanese Health Ministry said.\nHezbollah in Lebanon and Israel have been engaged in daily firefights since the Gaza war began in October."}, {"id": "5c5c44b2-ca13-41c6-9bd2-547ed2d38d8e", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:30", "url": "https://www.yahoo.com/news/woman-two-children-among-10-081301663.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A woman and her 2 children are among 10 killed in an Israeli strike in southern LebanonA man reacts at an industrial area destroyed by an Israeli airstrike, in Wadi al-Kfour, Nabatieh province, south Lebanon, Saturday, Aug. 17, 2024.\n(AP Photo/Mohammed Zaatari)NABATIEH, Lebanon (AP) — An Israeli strike in southern Lebanon early Saturday killed at least 10 Syrian nationals, according to Lebanon’s Health Ministry.\nAn Arabic-language spokesperson for the Israeli military, Avichay Adraee, said the strike in the southern province targeted a weapons depot belonging to Hezbollah.\nAn Israeli strike last month in southern Beirut killed Hezbollah’s top commander, whom Israel accused of leading a rocket attack on the Israeli-occupied Golan Heights that killed 12 youths.\nHours later, an explosion widely blamed on Israel killed Hamas political leader Ismail Haniyeh in the Iranian capital."}, {"id": "d214c9eb-2d7a-4251-a972-4d47298760b1", "title": "Terrorist or mentally ill ? The impossible decision dividing our police , spies and judges", "date": "2024-08-17 05:30", "url": "https://www.yahoo.com/news/terrorist-mentally-ill-impossible-decision-050000471.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Is it personal grievance, is it mental health, is it a combination of all three?’ Which is another reason why declaration early is less than straightforward.”Reaching a decision and publicly declaring it is a race against time.\nOne of the most controversial decisions not to declare an attack terrorism was a mass shooting in the Devon city of Plymouth in August 2021.\n“For a long time, there was this kind of assumption that attacks were either mental health or terrorism,” she says.\n“A lot of people across the general population suffer with poor mental health, and it doesn’t affect their behaviour,” Corner says.\nA 2020 study commissioned by the Home Office came to a similar conclusion, finding the way mental health problems combine with other factors during radicalisation are “poorly understood”."}, {"id": "309f61f6-45bb-4530-9018-ed3d8c5eea39", "title": "At least nine killed in Israeli strike on south Lebanon", "date": "2024-08-17 07:00", "url": "https://www.yahoo.com/news/least-nine-killed-israeli-strike-062615304.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At least nine killed in Israeli strike on south LebanonCows stand near a fire that started as a result of missile and drone attacks from Lebanon into Israel.\nFive others were injured in the Israeli strike, the ministry said in a statement.\nThe Israeli army said the air force had attacked a Hezbollah militia weapons depot in the Nabataea area.\nThe military also struck with artillery to eliminate a threat in other areas of southern Lebanon, the army said.\nOn Friday, at least one person was killed and another wounded in an Israeli strike that hit the village of Aitaroun in southern Lebanon, the Lebanese Health Ministry said."}, {"id": "8e5b6e04-8fc9-450d-ae4b-8e8dbcaa6db3", "title": "Hezbollah reveals military muscle in clashes with Israel – Ya Libnan", "date": "2024-08-17 03:30", "url": "https://yalibnan.com/2024/08/17/hezbollah-reveals-military-muscle-in-clashes-with-israel/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Hezbollah has gradually revealed its military capabilities in 10 months of cross-border clashes with Israel, analysts say, including footage of purported underground missile facilities released Friday amid fears of all-out war.\nSince Israel and Hezbollah last went to war in 2006, the pro-Iran militant group has increased its military strength, according to analysts.\nHezbollah likely released the video to “deter” Israel from a major operation against it, he said.\n“Hezbollah began firing Katyusha rockets, drones and guided missiles at the same time to overwhelm the Iron Dome,” Helou said.\nKahwaji also said that Hezbollah wants to “avoid provoking Israel into an all-out war”."}, {"id": "c9822334-1d01-4794-b0fe-90cd3492422e", "title": "Drug - crazed son who stabbed his mother to death in front of shocked paramedics discovers his fate", "date": "2024-08-17 01:00", "url": "https://www.dailymail.co.uk/news/article-13751973/callum-cameron-carol-cameron-perth-stabbing.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A web developer has been found guilty of murder after stabbing his own mother to death in front of paramedics while affected by a cocktail of drugs.\nThe court heard how Ms Cameron, a 63-year-old nurse, had called paramedics in the early hours of the morning concerned her son had overdosed.\nAmbulance officers arrived and found Ms Cameron helping him drink water in his bed and he became agitated when they attempted to take him to hospital.\nHowever, when Ms Cameron further pressed him to go with the ambulance officers he went to the kitchen where he retrieved a knife and she followed him.\nHe was taken to hospital in an ambulance in which he repeatedly asked paramedics if his mother was going to be alright."}, {"id": "49d5dfbb-b6b7-4972-97a6-d68ac5f52469", "title": "Nine killed , five wounded in Israeli airstrike in southern Lebanon : Health Ministry", "date": "2024-08-17 08:15", "url": "https://www.presstv.ir/Detail/2024/08/17/731498/Health-Ministry--Eight-killed,-four-wounded-in-Israeli-airstrike-in-southern-Lebanon", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "At least ten people were killed and five others seriously wounded when Israeli military aircraft carried out an airstrike on a residential building in southern Lebanon, the Health Ministry says.\nLebanon’s al-Mayadeen television news channel reported that the victims of the Israeli attack in southern Lebanon were Syrian nationals.\nIsraeli military forces also struck the villages of Maroun al-Ras, Hanine, Aitaroun, Kfar Kila and Ayta ash Shab, as well as the town of Khiam.\nThe ministry added that 1,765 people have also been wounded, with over 100,000 internally displaced.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts."}, {"id": "b5abde4e-7d1c-4321-8fbb-620409d6a1f1", "title": "Russia says Ukraine uses Western - made missiles to attack civilians", "date": "2024-08-17 09:15", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66c05e80a31060630b9239a0.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The photo taken on August 12, 2024 shows the fighting going on in the border area of Kursk region.\n[Photo/Defense Ministry of Russia]MOSCOW -- Ukrainian troops launched their first strike using Western-made missiles on civilian targets in Russia's Kursk region Friday, said Russian Foreign Ministry Spokesperson Maria Zakharova.\n\"Notably, this is the first time that civilian objects in the Kursk Region have been struck by Western-made rockets, likely American HIMARS,\" Zakharova said.\nShe said a bridge over the Seym River in the Glushkovsky District of Kursk was destroyed and \"volunteers helping civilians were killed in the strike.\"\nShe said all those responsible for such acts would face severe punishment from Russia."}, {"id": "d06e1dd0-dc74-438a-b3c4-302341d8baea", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike", "date": "2024-08-17 01:00", "url": "https://us.cnn.com/2024/08/16/europe/israel-uk-france-iran-retaliation-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nThe Foreign Ministers of France and Britain, Stephane Sejourne and David Lammy, meet with their Israeli counterpart Israel Katz at the Ministry of Foreign Affairs in Jerusalem on August 16, 2024.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "641f28da-0897-4509-8f81-0303a04182bc", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike", "date": "2024-08-17 01:00", "url": "https://www.cnn.com/2024/08/16/europe/israel-uk-france-iran-retaliation-intl-latam/", "domain": "cnn.com", "domain_classification": "International", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nThe Foreign Ministers of France and Britain, Stephane Sejourne and David Lammy, meet with their Israeli counterpart Israel Katz at the Ministry of Foreign Affairs in Jerusalem on August 16, 2024.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "cafc6dc9-f2bc-41cf-9a2e-50696fba4f61", "title": "Filipinos in Lebanon urged : Leave country immediately as tensions escalate", "date": "2024-08-17 04:45", "url": "https://www.philstar.com/headlines/2024/08/17/2378561/filipinos-lebanon-urged-leave-country-immediately-tensions-escalate", "domain": "philstar.com", "domain_classification": "Unknown", "message": "Filipinos in Lebanon urged: Leave country immediately as tensions escalateFire sweep over the Marjayoun plain in southern Lebanon near the border with Israel after being hit by Israeli shelling on August 16, 2024, amid the ongoing cross-border clashes between Israeli troops and Hezbollah fighters.\nMANILA, Philippines — The Philippine Embassy in Lebanon has urged all Filipino citizens to evacuate the country immediately while the Beirut airport remains operational amid fears of all-out war between Iran-backed group Hezbollah and Israel.\n\"The Philippine Embassy in Lebanon strongly urges all Filipino citizens to leave Lebanon immediately while the airport remains operational,\" the agency's advisory released on late Friday night (Manila time) read.\n\"We advise all Filipino nationals to prioritize their safety and depart the country as soon as possible,\" it added.\n“If you are unable to leave Lebanon, we strongly recommend that you evacuate to safer areas,” the embassy said."}, {"id": "bda893a0-9c93-4712-86ef-d5e5a67f02b4", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike - LocalNews8 . com", "date": "2024-08-17 04:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/08/16/muted-response-from-uk-and-france-after-israeli-fm-calls-for-retaliation-to-any-iran-strike/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nFrench Foreign Minister Stéphane Séjourné told a press conference in Jerusalem that it would be “inappropriate” to speak of “a retaliation or preparation for an Israeli retaliation” whilst diplomatic talks are underway.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "edb25640-8141-42d6-88f1-2b9f77cd4c66", "title": "Only Gaza ceasefire can delay Iran Israel response , say Iranian officials", "date": "2024-08-17 06:00", "url": "https://www.rappler.com/world/middle-east/gaza-ceasefire-delay-iran-israel-response/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Iran has vowed a severe response to Haniyeh’s killing, which took place as he visited Tehran late last month and which it blamed on Israel.\nThree regional government sources described conversations with Tehran to avoid escalation ahead of the Gaza ceasefire talks, due to begin on Thursday in either Egypt or Qatar.\nIn Israel, many observers believe a response is imminent after Supreme Leader Ayatollah Ali Khamenei said Iran would “harshly punish” Israel for the strike in Tehran.\nIran’s mission to the United Nations in New York told Reuters that Tehran would not have a representative present on the sidelines of the ceasefire talks.\nA ceasefire in Gaza would give Iran cover for a smaller “symbolic” response, one of the sources said."}, {"id": "0c142494-3936-478e-bb15-e57db622be09", "title": "  Radicalised  boy ( 16 ) who allegedly stabbed army chaplain at barracks had come to garda attention for online terror reposts", "date": "2024-08-17 03:00", "url": "https://www.independent.ie/irish-news/crime/radicalised-boy-16-who-allegedly-stabbed-army-chaplain-at-barracks-had-come-to-garda-attention-for-online-terror-reposts/a2058205876.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Boy (16) due in court over army chaplain barracks stabbing in GalwaySuspect was being monitored by gardaí before attack on Fr Paul Murphy (52), who is recovering in hospital'Radicalised’ boy who stabbed army chaplain had previously come to garda attention for online terror repostsKen Foy and Robin Schiller Today at 11:53A 16-year-old boy has been charged in relation to the stabbing of an army chaplain in Galway."}, {"id": "2e3e62dd-fbb4-439e-960e-8f61628f2081", "title": "China Expresses Alarm Over U . S . Mid - Range Missile Deployment in the Philippines", "date": "2024-08-17 04:30", "url": "https://www.devdiscourse.com/article/politics/3054010-china-expresses-alarm-over-us-mid-range-missile-deployment-in-the-philippines", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "China has raised significant concerns regarding the deployment of a U.S. mid-range missile system to the Philippines, describing the situation as 'very dramatic' and capable of destabilizing the region.\nFilipino Foreign Secretary Enrique Manalo, however, sought to placate these concerns by confirming that the missile system is only a temporary measure.\nDespite China's stance that the missile system could be 'destabilizing,' Manalo firmly disagreed, reiterating the temporary nature of the deployment.\nThe U.S. Army had transported the missile system, which can fire the Standard Missile-6 and Tomahawk Land Attack Missile, to the northern Philippines in April as part of joint military exercises with Philippine forces.\nThe situation remains tense as the U.S. and the Philippines condemn China's expanded assertions in the South China Sea, where multiple nations have overlapping territorial claims."}, {"id": "a1dfef6b-c3b1-4591-9ff9-df6437364979", "title": "Behind Ukraine Russia invasion : Secrecy , speed and electronic jamming", "date": "2024-08-17 05:15", "url": "https://www.livemint.com/news/world/behind-ukraine-s-russia-invasion-secrecy-speed-and-electronic-jamming-11723868418487.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Two weeks before the operation began, Ukrainian drones destroyed Russian observation systems at a border post on the road to Kursk.\nBut in Kursk, Ukrainian mechanized troops raced down Russian roads with little resistance.\nWithin hours, they had advanced miles into Russian territory, driving past towns and villages rather than attacking them head-on.\nHours after the initial barrage, the artillery crew moved their M777 across the border and took up a position about 4 miles inside Russian territory.\nLightly armed Russian soldiers were still scattered in small groups, mounting localized resistance."}, {"id": "698fbc3d-9541-4524-953c-6376b1bf69ed", "title": "Ukraine destroys key Russian bridge in Kursk | World | News", "date": "2024-08-17 06:15", "url": "https://www.express.co.uk/news/world/1937173/ukraine-obliterates-key-russia-bridges", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "A key Russian bridge has been destroyed by what is believed to be a HIMARS strike.\nUkraine used missiles to down key bridges inside Russia today to thwart Vladimir Putin’s war supply lines.\nPictures show the result of a HIMARS missile strike over the Seim River in the Kursk region, which Kyiv’s forces partially occupy.\nThe bridge in Glushkovsky district was blown apart in a second strike, after the first attempt holed the structure but left it intact.\nThe downed bridge now prevents Putin from transferring personnel and supplying reinforcements to his troops at the frontline, now inside Russia."}, {"id": "372b8186-6d4f-4322-9cf4-c6053e4f7398", "title": "Israel Stuns By Saying US , united kingdom , France Will Assist In Offensive Strikes On Iran", "date": "2024-08-17 03:00", "url": "https://www.zerohedge.com/geopolitical/israel-stuns-saying-us-uk-france-will-assist-offensive-strikes-iran", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Foreign Minister Israel Katz said Friday that he expects not only the US but also its allies Britain and France to assist in offensive operations against Iran if it attacks.\nWhen on April 13 Iran fired hundreds of ballistic missiles and drones on Israel, US fighter jets helped intercept many of the inbound projectiles.\nBut US involvement was only defensive, and ultimately there was no direct counterstrike on targets inside Iran.\nBREAKING: A senior @WhiteHouse National Security Council official warns Iran of \"cataclysmic\" consequences if the Islamic Republic attacks #Israel.\nCertainly, Israel's goading the US into direct attacks on Iran will be met with displeasure at least behind close doors at the White House, State Dept, and Pentagon."}, {"id": "37109c46-bde5-4c5c-be66-c794da329dbb", "title": "Gaza ceasefire talks paused with resumption planned next week", "date": "2024-08-17 02:45", "url": "https://www.rappler.com/world/middle-east/gaza-ceasefire-talks-paused-august-16-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "On Thursday, Israel and mediators began the latest round in months of talks to end the war in Gaza, which has killed tens of thousands of Palestinians.\nA senior Hamas official, Izzat al-Rishq, told Reuters Israel “did not abide by what was agreed upon” in earlier talks, citing what mediators had told them.\nBiden says deal ‘much, much closer’In Washington, Biden said a deal was “much, much closer” than before the talks began.\nAn Israeli official said its delegation in Doha was heading home and Israeli Prime Minister Benjamin Netanyahu was expected to meet Blinken on Monday.\nWashington hopes a ceasefire agreement in Gaza can defuse the risk of a wider war."}, {"id": "e7aef489-72c9-43b2-bbac-c5a964fc603f", "title": "Irish authorities investigating stabbing of Catholic chaplain as possible terror incident", "date": "2024-08-17 04:45", "url": "https://www.catholicworldreport.com/2024/08/16/irish-authorities-investigating-stabbing-of-catholic-chaplain-as-possible-terror-incident/", "domain": "catholicworldreport.com", "domain_classification": "Unknown", "message": "In 2019, Pope Francis issued an apostolic letter on the meaning and importance of the Christmas nativity scene.\nThe choice of Greccio was significant, because it was there in 1223 that St. Francis of Assisi created history’s first nativity scene.\nThe nativity scene invites everyone who contemplates it “on a spiritual journey, drawn by the humility of the God who became man in order to encounter every man and woman.”The Vatican Nativity scene.\nPope Francis writes that nativity scenes resonate so deeply because they show God’s tender love.\nThe nativity scene reminds us that Joseph “entrusted himself always to God’s will, and put it into practice,” encouraging us to do the same."}, {"id": "93b5fe09-9280-4bdb-aa5e-f54117838f04", "title": "Gaza ceasefire talks paused with resumption planned next week", "date": "2024-08-17 09:00", "url": "https://www.timeslive.co.za/news/world/2024-08-17-gaza-ceasefire-talks-paused-with-resumption-planned-next-week/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "e9cd2ecb-936c-45a4-8a50-7a6d4d0f111f", "title": "Iran may be making calculations before retaliatory attack on Israel", "date": "2024-08-17 03:30", "url": "https://www.wglt.org/2024-08-16/iran-may-be-making-calculations-before-retaliatory-attack-on-israel", "domain": "wglt.org", "domain_classification": "Unknown", "message": "Iran blamed the killing on Israel and has vowed revenge.\nNPR's Jackie Northam looks at the calculations Iran may be making ahead of any such move.\nNORTHAM: Israel has been bracing for some sort of attack since the assassination, unclear if or how it will happen.\nNORTHAM: Four months ago, Iran had to make the same calculations after its diplomatic compound in Syria was attacked, killing seven people.\nNORTHAM: One off-ramp for Iran could be the cease-fire talks between Hamas and Israel that resume this week."}, {"id": "e8ffe9f9-5d0a-4b29-ab08-992072352893", "title": "Iran may be making calculations before retaliatory attack on Israel", "date": "2024-08-17 03:45", "url": "https://www.wxxinews.org/npr-news/2024-08-16/iran-may-be-making-calculations-before-retaliatory-attack-on-israel", "domain": "wxxinews.org", "domain_classification": "Unknown", "message": "Iran blamed the killing on Israel and has vowed revenge.\nNPR's Jackie Northam looks at the calculations Iran may be making ahead of any such move.\nNORTHAM: Israel has been bracing for some sort of attack since the assassination, unclear if or how it will happen.\nNORTHAM: Four months ago, Iran had to make the same calculations after its diplomatic compound in Syria was attacked, killing seven people.\nNORTHAM: One off-ramp for Iran could be the cease-fire talks between Hamas and Israel that resume this week."}, {"id": "90a193df-c4e6-4503-9992-46f9c0736b1c", "title": "PH says China  dramatically alarmed  over US missile system deployed to its north", "date": "2024-08-17 05:15", "url": "https://www.manilatimes.net/2024/08/17/news/ph-says-china-dramatically-alarmed-over-us-missile-system-deployed-to-its-north/1964682", "domain": "manilatimes.net", "domain_classification": "Unknown", "message": "MANILA, Philippines — China expressed its \"very dramatic\" alarm over a mid-range missile system that the US military recently deployed to the Philippines, and warned it could destabilize the region.\n\"They're not destabilizing\" and the missile system was only in the Philippines temporarily, Manalo said he told Wang.\nAdvertisementThe US Army said in April it transported the mid-range missile system, a land-based weapon that can fire the Standard Missile-6 and the Tomahawk Land Attack Missile, from the US to the northern Philippines as part of combat exercises with Philippine troops.\nThe missile system, however, was not fired during the joint combat exercises of the longtime treaty allies and the Philippine military has said the missile system may be transported out of the country next month.\nChina has strongly opposed increased US military deployments to the region, including to the Philippines, and warned these could endanger regional stability and peace."}, {"id": "ab6d84dd-a1c6-40f9-897e-b4dd6009c3f9", "title": "Imad 4 : The Pride of Lebanese Industry – جريدة البناء", "date": "2024-08-17 08:00", "url": "https://www.al-binaa.com/archives/410336", "domain": "al-binaa.com", "domain_classification": "Unknown", "message": "مديرية بئر حسن – الأوزاعي في «القوميّ» أحيت عيد مولد سعاده وافتتحت مكتباً لها عميد التربية والشباب إيهاب المقداد: حزبنا ارتقى بأبناء شعبنا من رعايا طوائف إلى مواطنين متساوي الحقوق والواجبات ممثل «القيادة العامة» أبو أيمن البشير: الحزب القومي من أعمدة محور المقاومة لتحرير كل شبر من أرضنا المحتلة.\nمدير مديرية بئر حسن – الأوزاعي شكري القادري: رصّ صفوف حزبنا أولوية .. ولن يستطيع أحد النيل من حزب أنطون سعاده"}, {"id": "ea0512d3-9183-4bf4-96dd-7d02feacbf06", "title": "Proposal for Gaza truce said to be in works | The Arkansas Democrat - Gazette", "date": "2024-08-17 08:45", "url": "https://www.arkansasonline.com/news/2024/aug/17/29fd8376/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Israel issued a vague statement saying it appreciated the mediators' efforts, and a statement from Hamas did not sound enthusiastic about the latest proposal to end the devastating 10-month war and free Israeli hostages held in Gaza.\nThe U.S. official said the latest proposal is the same as Biden's with some clarifications based on ongoing talks.\nThe war began when Hamas-led militants stormed across the heavily guarded border Oct. 7, killing around 1,200 people, mostly civilians, and abducting 250 to Gaza.\nOn Friday it dropped leaflets asking civilians to evacuate from areas in northern Khan Younis and eastern Deir al-Balah, saying forces plan to respond to rocket fire that targeted Israel.\nHezbollah started attacking Israel on Oct. 8 and says it will stop only when the Gaza war ends."}, {"id": "349f2358-0f26-422d-8a82-e11fa7430b0f", "title": "Rajasthan Shocker : Communal Tension Grips Udaipur After Class 10 Student Stabs Another At Govt School", "date": "2024-08-17 00:45", "url": "https://www.freepressjournal.in/india/rajasthan-shocker-communal-tension-grips-udaipur-after-class-10-student-stabs-another-at-govt-school", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "Rajasthan Shocker: Communal Tension Grips Udaipur After Class 10 Student Stabs Another At Govt School | FileCommunal tension erupted in the lake city of Udaipur, Rajasthan after a class 10 student stabbed another at a government school on Friday.\nThe accused absconded after the incident, while the injured student was rushed to the Maharana Bhupal (MB) Hospital, where he is undergoing treatment.\nAs the tension escalated shops in Chetak Circle, Hathipole, Ashwini Bazaar, Bapu Bazaar and Ghantaghar area of ​​the city were shut down.\nUdaipur ASP City Umesh Ojha said that police forces are deployed in almost all areas of the city.\nNotably, two years ago, the Udaipur Citybhad witnessed the beheading incident of tailor Kanhiya Lal by two radical Muslim men."}, {"id": "dee5828e-a1ef-4481-a2d4-639718202d03", "title": "Russia says Ukraine used Western rockets to destroy bridge in Kursk region", "date": "2024-08-17 09:15", "url": "https://dunyanews.tv/en/World/831386-russia-says-ukraine-used-western-rockets-to-destroy-bridge-in-kursk-re", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Russia says Ukraine used Western rockets to destroy bridge in Kursk regionWorld World Russia says Ukraine used Western rockets to destroy bridge in Kursk region\"Kursk region was hit by Western-made rocket launchers, probably American HIMARS,\" Maria ZakharorovaFollow on Published On: Sat, 17 Aug 2024 13:46:26 PKTMOSCOW (Reuters) – Russia's foreign ministry said Ukraine had used Western rockets, likely U.S.-made HIMARS, to destroy a bridge over the Seym river in the Kursk region, killing volunteers trying to evacuate civilians.\n\"For the first time, the Kursk region was hit by Western-made rocket launchers, probably American HIMARS,\" Maria Zakharova, spokeswoman for the Russian foreign ministry, said late on Friday on the Telegram messaging app.\nUkrainian army chief Oleksandr Syrskyi said on Friday that Kyiv's forces were advancing between 1 and 3 kilometres (0.6 to 1.9 miles) in some areas in the Kursk region, 11 days since beginning an incursion into Russia.\nKyiv has claimed to have taken control of 82 settlements over an area of 1,150 square kilometres (440 square miles) in the region since Aug. 6.\nRussia has accused the West of supporting and encouraging Ukraine's first ground offensive on Russian territory and said Kyiv's \"terrorist invasion\" would not change the course of the war."}, {"id": "0dbe6389-aec1-4a61-9a27-d0c4d629d6c3", "title": "Russian strike on Sumy : windows smashed , cars ablaze – photo", "date": "2024-08-17 05:30", "url": "https://www.yahoo.com/news/russian-strike-sumy-windows-smashed-035826562.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Dmytro Drozdenko, Head of Sumy City Military Administration, has reported that the area of Svobody Avenue in Sumy has been struck.\nSource: Drozdenko on Telegram; Sumy City Military AdministrationQuote: \"A lot of windows have been damaged, and many cars are on fire.\"\nQuote from Drozdenko: \"The search for those affected continues; so far, one person has been provided with assistance.\nSumy Oblast Military Administration reported that the Russians launched a missile attack on the civilian infrastructure in Sumy on the morning of 17 August.\nThe aftermath of the Russian attack on the city of SumyPhoto: Dmytro Drozdenko on TelegramBackground: On the morning of 17 August, a loud explosion occurred in Sumy during an air raid."}, {"id": "21780ef7-af5e-48f3-964e-821ef371afdd", "title": "Israel - Hamas War day 315 : What happening in Israel and West Bank ? ", "date": "2024-08-17 04:15", "url": "https://www.jpost.com/israel-hamas-war/2024-08-17/live-updates-815086", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Ghazi Hamad, member of Hamas Political Office, delivers remarks on the ongoing conflict between Israel and Hamas, during a press conference in Beirut, Lebanon, October 28, 2023.\n(photo credit: REUTERS/AMR ALFIKY)Senior Hamas official Ghazi Hamad lashed out at Prime Minister Benjamin Netanyahu for 'undermining' the current hostage and ceasefire negotiations in a Friday interview with the Hezbollah-affiliated Al-Mayadeen.\nHamad told Al-Mayadeen that Netanyahu was \"practicing deception\" and claimed that he was \"setting new conditions and undermining what was previously agreed upon.\"\nHamad pushed the idea that Netanyahu was not interested in a deal and was actively preventing the conclusion of negotiations.\n\"Netanyahu undermined the agreement from the ground up,\" he said."}, {"id": "02dd86d8-712f-48e4-9c06-ed4663552a8e", "title": "Russian diplomat sees US  approval  behind attack on gas pipelines - Newspaper", "date": "2024-08-17 04:30", "url": "https://www.dawn.com/news/1852832/russian-diplomat-sees-us-approval-behind-attack-on-gas-pipelines", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "MOSCOW: Russia’s ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\nThe Wall Street Journal reported on Thursday that Ukraine’s top military commander approved the 2022 attack on the gas pipelines despite a warning from the US Central Intelligence Agency to Ukrainian President Volodymyr Zelensky not to carry out the attack.\n“They seek to shift all responsibility to their Ukrainian puppets,” Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n“We will seek to identify the real perpetrators of the bombing and punish them.”Russia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and The Wall Street Journal have reported that Ukraine — which has repeatedly denied involvement — was behind the attack."}, {"id": "fb5a3e62-8b61-4907-adcc-0a53995f63f6", "title": "Bolton skeptical about cease - fire talks : Israel still  really far apart  ", "date": "2024-08-17 06:15", "url": "https://www.yahoo.com/news/bolton-skeptical-cease-fire-talks-031735738.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Former National Security Advisor John Bolton said he is skeptical that the end of cease-fire negotiations are near, following an announcement from the White House that talks will continue into next week.\nAn anonymous U.S. official told the Associated Press Friday that mediators are preparing for a cease-fire and hostage-swap deal.\n“The real question is, exactly what is going to come in addition to the hostage exchange, and this is the place where Hamas and Israel, I think, are really far apart,” Bolton told NewsNation Friday afternoon.\nBolton’s remarks come as mediators from the U.S., Israel, Qatar, Egypt, and Hamas concluded two days of talks in Doha, Qatar.\nBolton noted that the proposal could prove less productive for the negotiations than the officials let on."}, {"id": "3f010d5e-907f-43b1-a588-7e41a6eb5040", "title": "US official says Mideast mediators are preparing for implementation of cease - fire deal in advance - Boston News , Weather , Sports", "date": "2024-08-17 04:45", "url": "https://whdh.com/news/us-official-says-mideast-mediators-are-preparing-for-implementation-of-cease-fire-deal-in-advance/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "It was unclear what measures were being taken, but the official said a new “implementation cell” was being established in Cairo in advance.\nThe comments came hours after mediators expressed hope that a deal was within reach.\nBlinken was expected to meet with Netanyahu on Monday to discuss the new deal, said an Israeli official who spoke on the condition of anonymity in line with official requirements.\nIn a clear message to Israel, Hezbollah released a video, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will stop only when the Gaza war ends."}, {"id": "ecb32b8f-2447-4832-92e4-d1ff8b2bc74a", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:30", "url": "https://www.mymotherlode.com/news/middle-east/3409522/woman-and-two-children-among-10-killed-in-israeli-strike-in-southern-lebanon.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Woman and two children among 10 killed in Israeli strike in southern LebanonWoman and two children among 10 killed in Israeli strike in southern Lebanon View PhotoBEIRUT (AP) — An Israeli strike in southern Lebanon early Saturday killed at least 10 Syrian nationals, according to Lebanon’s Health Ministry.\nAvichay Adraee, an Arabic-language spokesperson for the Israeli military, said the strike in the southern province targeted a weapons depot belonging to Hezbollah.\nAn Israeli strike last month in southern Beirut killed Hezbollah’s top commander, whom Israel accused of leading a rocket attack on the Israeli-occupied Golan Heights that killed 12 youths.\nHours later, an explosion widely blamed on Israel killed Hamas political leader Ismail Haniyeh.\nHezbollah Israel fought a six-week war in the summer of 2006 that ended in a draw."}, {"id": "94786f16-b48d-4c62-bf7b-316ee78be857", "title": "US official says Mideast mediators are preparing for implementation of cease - fire deal in advance", "date": "2024-08-17 01:15", "url": "https://www.13abc.com/2024/08/16/us-official-says-mideast-mediators-are-preparing-implementation-cease-fire-deal-advance/", "domain": "13abc.com", "domain_classification": "Unknown", "message": "It was unclear what measures were being taken, but the official said a new “implementation cell” was being established in Cairo in advance.\nThe comments came hours after mediators expressed hope that a deal was within reach.\nBlinken was expected to meet with Netanyahu on Monday to discuss the new deal, said an Israeli official who spoke on the condition of anonymity in line with official requirements.\nIn a clear message to Israel, Hezbollah released a video, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will stop only when the Gaza war ends."}, {"id": "cd7b9b9b-62d7-44ac-9d48-cb49aceece5b", "title": "Russia says Ukraine used Western rockets to destroy bridge in Kursk region", "date": "2024-08-17 06:30", "url": "https://www.swissinfo.ch/eng/russia-says-ukraine-used-western-rockets-to-destroy-bridge-in-kursk-region/87034475", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia says Ukraine used Western rockets to destroy bridge in Kursk regionreuters_tickers2 minutesMOSCOW (Reuters) -Russia’s foreign ministry said Ukraine had used Western rockets, likely U.S.-made HIMARS, to destroy a bridge over the Seym river in the Kursk region, killing volunteers trying to evacuate civilians.\n“For the first time, the Kursk region was hit by Western-made rocket launchers, probably American HIMARS,” Maria Zakharova, spokeswoman for the Russian foreign ministry, said late on Friday on the Telegram messaging app.\nKyiv has claimed to have taken control of 82 settlements over an area of 1,150 square kilometres (440 square miles) in the region since Aug. 6.\nRussia has accused the West of supporting and encouraging Ukraine’s first ground offensive on Russian territory and said Kyiv’s “terrorist invasion” would not change the course of the war.\n(Reporting by Guy Faulconbridge and Olzhas Auyezov; Editing by William Mallard)"}, {"id": "08d303fb-8c82-47cb-b5a7-eb3aaff8b69c", "title": "NATO steps up naval presence in Western Pacific to counter China", "date": "2024-08-17 05:45", "url": "https://www.japantimes.co.jp/news/2024/08/17/asia-pacific/nato-navies-indopacific-china/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "NATO is bolstering its presence in the Western Pacific by sending warships to more places, a move that risks stoking tensions with China, which is worried about the alliance’s growing influence in the region.\nThe latest entrant is the Italian aircraft carrier Cavour, the first time Rome has deployed its lone carrier to the Pacific.\nThe Cavour and an Italian frigate recently held exercises with the U.S. carrier USS Abraham Lincoln near the island of Guam.\nA day later, F-35 stealth jets and AV-8B Harriers launched from the Cavour practiced shooting down airborne targets.\n\"This is a demonstration, above all, of our ability to project power anywhere,” said Rear Adm. Giancarlo Ciappina, the commander of the Cavour carrier strike group."}, {"id": "db6b218a-8b84-4cf5-baa7-685ef09a3941", "title": "Filipinos advised to leave Lebanon immediately over war fear", "date": "2024-08-17 08:15", "url": "http://usa.chinadaily.com.cn/a/202408/17/WS66c055a8a31060630b923987.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Xinhua]MANILA -- Filipinos staying in Lebanon have been advised to leave the Middle East country as early as possible as tension escalates due to the threat of an all-out war between the Iran-backed group Hezbollah and Israel.\nIn a social media advisory Friday night, the Philippine Embassy in Lebanon urged Filipinos to leave when the airport remains operational.\nTo Filipinos who cannot leave Lebanon, the Embassy \"strongly recommended\" that they evacuate to safer areas outside capital Beirut, south of Lebanon, and the Bekaa Valley.\nThere are approximately 17,500 Filipinos staying in Lebanon, and around 3,000 are in southern Lebanon.\nAlert level 3 or voluntary repatriation is issued \"when violent disturbances or external aggression occur in a limited area.\""}, {"id": "5484f3b9-0b68-4604-a799-9f766ee871bd", "title": "Filipinos advised to leave Lebanon immediately over war fear", "date": "2024-08-17 09:15", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66c055a8a31060630b923987.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Xinhua]MANILA -- Filipinos staying in Lebanon have been advised to leave the Middle East country as early as possible as tension escalates due to the threat of an all-out war between the Iran-backed group Hezbollah and Israel.\nIn a social media advisory Friday night, the Philippine Embassy in Lebanon urged Filipinos to leave when the airport remains operational.\nTo Filipinos who cannot leave Lebanon, the Embassy \"strongly recommended\" that they evacuate to safer areas outside capital Beirut, south of Lebanon, and the Bekaa Valley.\nThere are approximately 17,500 Filipinos staying in Lebanon, and around 3,000 are in southern Lebanon.\nAlert level 3 or voluntary repatriation is issued \"when violent disturbances or external aggression occur in a limited area.\""}, {"id": "121b65ba-6acc-4c0d-bd56-8c1f3de32d1e", "title": "Ukraine destroys key Russian bridge as Kyiv incursion into Kursk region continues", "date": "2024-08-17 08:15", "url": "https://www.lbc.co.uk/news/ukraine-destroys-key-russian-bridge-kyivs-incursion-kursk-region/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Ukraine destroys key Russian bridge as Kyiv's incursion into Kursk region continuesUkraine’s air force has destroyed a key Russian bridge over the river Seym.\nPicture: Alamy & TelegramBy Will ConroyUkraine’s air force has destroyed a key Russian bridge over the river Seym as president Volodymyr Zelenskyy says Kyiv is “strengthening” its position in the Kursk region.\nThe bridge linked areas of Kursk still controlled by Russia and areas where Ukraine has made advances.\nIt came after the Ukrainian president insisted that the frontline is still the country's \"top priority,\" despite Kyiv's forces’ incursion into the Kursk region.\nPicture: AlamyLocal officials said on Telegram that Russian forces were \"advancing at a fast pace\"."}, {"id": "1c196039-a43d-4c6a-8aa7-dd57ab49dda3", "title": "The day Bawumia family hosted Kwame Nkrumah at their home in 1962", "date": "2024-08-17 09:15", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/The-day-Bawumia-s-family-hosted-Kwame-Nkrumah-at-their-home-in-1962-1946128", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "The latest sighting involves the family of the current Vice President, Dr. Mahamudu Bawumia, meeting Ghana's first president, Dr. Kwame Nkrumah, in 1962.\nAt that time, a young baby named Abdulai Bawumia, who is the brother of Dr. Bawumia, was introduced to Dr. Kwame Nkrumah by his parents, Mumuni Bawumia and Mrs. Bawumia, at their residence at Tamale in the Northern Region.\nThe fascinating image was taken after a failed assassination attempt through a bomb attack was orchestrated against Dr. Kwame Nkrumah by his political opponents on August 1, 1962.\nWhile in recovery, he visited Mumuni Bawumia, who is not only the father of the current Vice President Dr. Mahamudu Bawumia, but was also a prominent figure in Ghana's political landscape.\nThe image shared by the Daily Graphic showed the Bawumia family dressed in traditional Ghanaian attire, reflecting the style of that era, with Dr. Nkrumah interacting with baby Abdulai Bawumia as they all shared smiles."}, {"id": "631addf8-871b-48ec-8453-c2d39969f038", "title": "Rajasthan : Internet suspended , section 144 imposed in Udaipur after school stabbing incident sparks communal tensions", "date": "2024-08-17 03:00", "url": "https://www.livemint.com/news/rajasthan-internet-suspended-section-144-imposed-in-udaipur-after-school-stabbing-incident-sparks-communal-tensions-11723855067665.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "The Rajasthan government has imposed a 24-hour internet shutdown in Udaipur following communal tensions that erupted after a Class 10 student allegedly stabbed another boy at a government school on Friday.\n#WATCH | Udaipur, Rajasthan: Force deployed in the city after a clash broke out between two children, earlier todaySection 144 has been imposed in the city by Arvind Poswal, District Collector of Udaipur to maintain law and order here.\npic.twitter.com/z0k2FgFGxt — ANI MP/CG/Rajasthan (@ANI_MP_CG_RJ) August 16, 2024Here's what happened in Udaipur school According to reports from news agency PTI, the reason behind the stabbing at the government school in Bhattiyani Chohatta is not yet clear.\nHowever, giving details on the incident, Arvind Poswal, District Collector Udaipur told news agency ANI, \"This incident took place in the early hours.\nIt is our duty to maintain peace in the city.”#WATCH | Rajasthan: Arvind Poswal, District Collector Udaipur says, \"This incident took place in the early hours today."}, {"id": "004663d5-4395-46cc-a283-430a55265ad1", "title": "Lebanese Reports : 6 Killed , 3 Wounded in Israeli Attributed Strike in Southern Lebanon - Israel News", "date": "2024-08-17 04:45", "url": "https://www.haaretz.com/israel-news/2024-08-17/ty-article-live/.premium/lebanese-reports-6-killed-3-wounded-in-israeli-attributed-strike-in-southern-lebanon/00000191-5e13-d180-a9fd-dffb39660000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "Haaretz | Israel News Israel-Hamas War Day 316 | Lebanese Reports: 10 Killed in Israeli Strike; IDF Orders Evacuation of Gaza Neighborhood Aug 17, 2024 Updated: 12:59 p.m. IST Share in Twitter Gift this article Save Save article to reading list Send in e-mail Send in e-mail Share in Facebook Share in Twitter Share in WhatsApp Send in e-mail Send in e-mail Gift this article Save Save article to reading list Zen Read Print article LIVEPalestinian reports: 12 killed in Israeli strike in refugee camp in central Gaza ■ Biden says he directed negotiating team in Doha to put forward proposal presented on Friday ■ Hamas senior official: 'No major issue was agreed upon in the latest round of talks' ■ Gaza health ministry says it has detected first case of polio in the strip"}, {"id": "05afa949-d65c-4ec0-a1b1-fae1ee5dbd28", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:00", "url": "https://www.wgauradio.com/news/world/woman-two-children/O7AG6R7QNJD6ZNTOL4L5ZEBFRQ/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "83a34811-61d6-4c78-be28-0e6d88a8b519", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:30", "url": "https://www.times-series.co.uk/news/national/24524747.woman-two-children-among-10-killed-israeli-strike-southern-lebanon/", "domain": "times-series.co.uk", "domain_classification": "Unknown", "message": "The strike on Wadi al-Kfour in Nabatieh province is among the deadliest in Lebanon since the Hezbollah militant group and Israeli military started trading strikes on October 8, a day after Hamas attacked southern Israel and sparked the Israel-Hamas war in Gaza.\nAmong the dead were a woman and her two children, the ministry said.\nAvichay Adraee, an Arabic-language spokesperson for the Israeli military, said the strike in the southern province targeted a weapons depot belonging to Hezbollah.\nAn Israeli strike last month in southern Beirut killed Hezbollah’s top commander, whom Israel accused of leading a rocket attack on the Israeli-occupied Golan Heights that killed 12 youths.\nHours later, an explosion widely blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "aacf5925-14e8-4847-8d6b-99797119b88a", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:30", "url": "https://www.surreycomet.co.uk/news/national/24524747.woman-two-children-among-10-killed-israeli-strike-southern-lebanon/", "domain": "surreycomet.co.uk", "domain_classification": "Unknown", "message": "The strike on Wadi al-Kfour in Nabatieh province is among the deadliest in Lebanon since the Hezbollah militant group and Israeli military started trading strikes on October 8, a day after Hamas attacked southern Israel and sparked the Israel-Hamas war in Gaza.\nAmong the dead were a woman and her two children, the ministry said.\nAvichay Adraee, an Arabic-language spokesperson for the Israeli military, said the strike in the southern province targeted a weapons depot belonging to Hezbollah.\nAn Israeli strike last month in southern Beirut killed Hezbollah’s top commander, whom Israel accused of leading a rocket attack on the Israeli-occupied Golan Heights that killed 12 youths.\nHours later, an explosion widely blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "b43ef1aa-3d1c-431c-bdeb-41b6975513c3", "title": "Woman and two children among 10 killed in Israeli strike in southern Lebanon", "date": "2024-08-17 09:30", "url": "https://www.tivysideadvertiser.co.uk/news/national/24524747.woman-two-children-among-10-killed-israeli-strike-southern-lebanon/", "domain": "tivysideadvertiser.co.uk", "domain_classification": "Unknown", "message": "The strike on Wadi al-Kfour in Nabatieh province is among the deadliest in Lebanon since the Hezbollah militant group and Israeli military started trading strikes on October 8, a day after Hamas attacked southern Israel and sparked the Israel-Hamas war in Gaza.\nAmong the dead were a woman and her two children, the ministry said.\nAvichay Adraee, an Arabic-language spokesperson for the Israeli military, said the strike in the southern province targeted a weapons depot belonging to Hezbollah.\nAn Israeli strike last month in southern Beirut killed Hezbollah’s top commander, whom Israel accused of leading a rocket attack on the Israeli-occupied Golan Heights that killed 12 youths.\nHours later, an explosion widely blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "595da66a-e0d8-4339-b8ab-b1581d896016", "title": "What the papers say : Saturday front pages - Clonmore", "date": "2024-08-17 09:15", "url": "https://www.carlow-nationalist.ie/your-community/clonmore/what-the-papers-say-saturdays-front-pages_arid-28718.html", "domain": "carlow-nationalist.ie", "domain_classification": "Unknown", "message": "The stabbing of an army Chaplin in Galway dominates the headlines on Saturday's papers.\nThe Irish Times and the Irish Examiner lead with the incident as links to terrorism are investigated by gardaí.\nThe Irish Daily Mirror claims the teenager was radicalised online in the lead up to the incident.\nBritish papersPlanned train strikes across England and Scotland take centre stage on several of Saturday’s front pages.\nGPs say the scramble to secure a doctor’s appointment won’t end without extra Government funding, according to the iweekend."}, {"id": "ed637d3d-5296-4129-8214-69edb8172a77", "title": "Kolkata doctor rape - murder : Select Mumbai private hospitals to halt OPD services in protest", "date": "2024-08-17 03:45", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/kolkata-doctor-rape-murder-select-mumbai-private-hospitals-to-halt-opd-services-in-protest-23376341", "domain": "mid-day.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTThe attack took place as doctors were protesting the rape and murder of a trainee doctor on the hospital premises.\nA representative from Jaslok hospital confirmed that the facility will shut down routine outpatient services in accordance with the IMA’s call but will keep emergency services operational.\n“Patients who visit the hospital will be referred to emergency services,” the spokesperson said.\nRoutine outpatient services at the hospital will be affected, though emergency and casualty departments will continue to function.\nOur hospital sees about 500 patients daily for routine outpatient services, and we estimate that our absence will impact at least half of them,” said Miet Shah, a third-year resident at the hospital."}, {"id": "7b88d3f9-0409-430a-a327-661867b9160b", "title": "A Florida couple won $3 , 300 at the casino . Two men then followed them home and shot them . ", "date": "2024-08-17 03:45", "url": "https://www.yahoo.com/news/florida-couple-won-3-300-205739288.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Florida couple won $3,300 at the casino.\nA Florida couple is grateful to be alive after two masked men attacked, robbed and shot them as they returned home from a date night at a casino, according to authorities.\nI was hysterical, I screamed and cried,\" Chambliss told the TV station about what she thought when the robbers shot Delacruz.\n\"We don't get to do it often just because we both work extremely hard,\" Chambliss told the station.\nThis article originally appeared on USA TODAY: Florida couple ambushed, shot after winning $3,300 at Hard Rock casino"}, {"id": "09dfe103-a6a2-482c-b628-80245dd71a5a", "title": "Homeless man indicted for stabbing spree in Ozone Park that left two men injured : DA – QNS", "date": "2024-08-17 00:15", "url": "https://qns.com/2024/08/homeless-man-indicted-stabbing-spree-ozone-park-two-injured/", "domain": "qns.com", "domain_classification": "Unknown", "message": "A homeless man was arraigned on attempted murder charges for allegedly stabbing a grandfather at an Ozone Park subway station, moments after he allegedly stabbed a motorist pumping gas at a Mobil station on North Conduit Avenue.\nSign up for our QNS email newsletter to get news, updates, and local insights delivered straight to your inbox!\nA homeless man from Brooklyn was indicted by a Queens grand jury for a stabbing spree that left two men wounded in Ozone Park during the evening of Wednesday, Aug. 7.\nHe walked up to a 67-year-old grandfather and allegedly stabbed him once in the neck before entering the subway tracks.\nHe was apprehended minutes later by police from the 106th Precinct in Ozone Park after they found him hiding beneath the platform along the Rockaway-bound tracks."}, {"id": "cde8c061-350f-4872-bb30-3e6b29724a40", "title": "China got  very dramatic  after the US military flew a new missile system out to the Western Pacific , ally says", "date": "2024-08-17 04:30", "url": "https://news.yahoo.com/news/china-got-very-dramatic-us-171019607.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "China got 'very dramatic' after the US military flew a new missile system out to the Western Pacific, ally saysChina had a \"very dramatic\" reaction to the US deploying a new missile system in the Western Pacific, the Philippines' top diplomat said.\nThe weapon in question is the Mid-Range Capability, or Typhon, missile system, a new US military asset that was deployed in April during a joint US-Philippines training.\nManalo said that while he and Yi discussed the situation, \"they made it very dramatic\" but that he reassured Yi he shouldn't be worried.\nThe Mid-Range Capability system is ground-based and versatile, capable of firing both the Standard Missile 6 and Tomahawk Land Attack Missile.\nThe USS Savannah fires a Standard Missile 6 from a containerized launching system during a test in the eastern Pacific Ocean."}, {"id": "d754cc09-7ad8-424c-97ce-82120c8abdf2", "title": "Six killed in alleged Israeli strike in Lebanon , health ministry says", "date": "2024-08-17 01:00", "url": "https://www.jpost.com/breaking-news/article-815081", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF revealed on Saturday morning that Israeli air force fighter jets had struck a Hezbollah weapons warehouse and a military building belonging to the terror group in southern Lebanon overnight.\nThe IDF said the fighter jets attacked Hezbollah's military buildings in the areas of Hanin and Marun al-Ras in southern Lebanon and a weapons warehouse in the Nebatia area.\nThe IDF also said it fired artillery fire in the areas of Ramish, Lavona, Kfar Shoba and Aita al-Sha'ab in southern Lebanon.\n\"حزب الله\" يمنع مراسل mtv من دخول الموقع الذي تعرّض للقصف الإسرائيلي في وادي الكفور — MTV Lebanon News (@MTVLebanonNews) August 17, 2024Stay updated with the latest news!\nSubscribe to The Jerusalem Post Newsletter Subscribe NowLebanon's MTV complained that Hezbollah forces were preventing journalists from accessing the sites of the strike."}, {"id": "aacd6011-6944-4143-947c-ff4ebccaa235", "title": "Army chaplain remains in serious condition after Galway stabbing", "date": "2024-08-17 08:45", "url": "https://www.newstalk.com/news/army-chaplain-remains-in-serious-condition-after-galway-stabbing-1755975", "domain": "newstalk.com", "domain_classification": "Unknown", "message": "Army chaplain Fr Paul Murphy remains in serious condition in hospital after suffering multiple stab wounds outside Renmore Barracks in Galway on Thursday night.\nMembers of the Defence Forces fired warning shots and restrained the teenager at the scene, who Gardaí then arrested.\n\"A serious line of inquiry is being pursued and at this time it is important to allow Gardaí to work to establish all the facts.\n\"I have also spoken to the Tánaiste and Minister for Defence Mícheál Martin on the quick action of Defence Forces personnel who intervened during the attack.\n\"My thoughts remain with Defence Forces Chaplin, Fr Paul Murphy, and on behalf of the Government I wish him a speedy recovery and want to thank the officers of the Gardaí and Defence Forces for their response,\" he added."}, {"id": "2588fd0d-ea19-42ab-8d81-7684f72b5ccf", "title": "The secret channels Britain could use to stop Iran attacking Israel", "date": "2024-08-17 08:45", "url": "https://inews.co.uk/opinion/the-secret-channels-britain-could-use-to-stop-iran-attacking-israel-3230609", "domain": "inews.co.uk", "domain_classification": "Unknown", "message": "Iran has made threats of retaliation following the killing by Israel of Hamas’s top political leader, Ismail Haniyeh, in Tehran on 31 July.\nCan the UK influence what the Tehran regime does next?\nThe UK certainly has good reasons to want to influence Iran.\nBritain can still boast some unique and hugely influential assets that can make a real difference to what happens next in the Middle East.\nGiven the UK’s unique influence over both Washington and the Middle East, we could make no better contribution to the cause of peace."}, {"id": "bfebce41-d6b1-43af-ae3b-3ee9fca14582", "title": "Violent Israeli Colonization Surges in Gaza , as Peace Talks Hang in Balance", "date": "2024-08-17 03:00", "url": "https://sputnikglobe.com/20240817/violent-israeli-colonization-surges-in-gaza-as-peace-talks-hang-in-balance-1119799188.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240817/violent-israeli-colonization-surges-in-gaza-as-peace-talks-hang-in-balance-1119799188.htmlViolent Israeli Colonization Surges in Gaza, as Peace Talks Hang in BalanceViolent Israeli Colonization Surges in Gaza, as Peace Talks Hang in BalanceSputnik InternationalLeila Hatoum, a Lebanese-based journalist, economist, and geopolitical analyst joined Sputnik’s Fault Lines on Friday to discuss the tension in the Middle East as well as the colonization of Israeli settlers on Palestinian land.\n2024-08-17T00:39+00002024-08-17T00:39+00002024-08-17T00:39+0000analysispalestiniansdohaisraelhamaswest bankmiddle eastusmilitaryisrael-gaza conflicthttps://cdn1.img.sputnikglobe.com/img/07e8/08/10/1119799745_0:160:3072:1888_1920x0_80_0_0_d27689bc27291ee65935571f3fa41ffd.jpgOn Tuesday, it was reported that a senior Iranian security official had warned that if Israel’s ceasefire talks with Hamas fell through then Iran would attack Israel.\nThe attack would be in response to the assassination of Hamas political chief Ismail Haniyeh who was visiting Iran at the time of his killing.\nThe riot, which occurred in the village of Jit, resulted in the killing of one Palestinian and the serious injuries of others, Palestinian health officials said.\n\"Anybody who was kicked out of the United States basically 300 years ago can come now to the US, start shooting people and killing them and telling them, 'this is my land.'\""}, {"id": "d3fe751a-1337-4d99-955e-8faf205fb7d4", "title": "There one theatre of war where Russia is in total collapse", "date": "2024-08-17 04:45", "url": "https://www.telegraph.co.uk/news/2024/08/17/russia-ukraine-war-rocket-satellite-drone-intelligence/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "GPs are the last people to deserve a pay rise – but they’ll get one anyway"}, {"id": "376c4f56-a561-4e2b-a337-b07e864843d6", "title": "Apparent lone - wolf terror - related attack at Galway barracks underlines Garda worst fears – The Irish Times", "date": "2024-08-17 06:00", "url": "https://www.irishtimes.com/ireland/2024/08/17/apparent-lone-wolf-terror-related-attack-at-galway-defence-forces-barracks-underlines-gardas-worst-fears/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "The far right has become emboldened and violent.\nRecent arrests over the alleged harassment and intimidation of politicians by the far right have been designed to reduce the comfort zone around targeting elected representatives.\nREAD MOREThe knife attack on Fr Murphy has all the hallmarks of that feared dynamic; a lone actor, radicalised to the point of extreme violence.\nDuring the incident Fr Murphy was stabbed several times and appears to have been targeted simply because he happened to be on his way into the barracks.\nWhen two Defence Forces personnel intervened to stop the attack, five warning shots being fired."}, {"id": "53d46f88-232e-47e5-92e3-3cc5255a353a", "title": "Farage revealed as highest - earning MP , receiving £98 , 000 a month from GB News", "date": "2024-08-17 09:15", "url": "https://www.aol.co.uk/farage-revealed-highest-earning-mp-084900014.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Reform UK leader Nigel Farage has been revealed to be the highest-earning MP.\nThe MP for Clacton said he is receiving almost £98,000 a month for presenting GB News, for a reported 32 hours a week, as a full list of MPs’ registered financial interests was published on Friday.\nIn addition to his work with GB News, Mr Farage received £16,597.22 from the paid video app Cameo and £4,000 for writing articles for The Telegraph.\nThe cost of flights and accommodation for Mr Farage and one staffer is listed as £32,836.\nOn the visit to Brussels, Mr Farage spoke at the National Conservatism conference, where Conservative MP Suella Braverman and Hungarian Prime Minister Viktor Orban were also in attendance."}, {"id": "0ad630f6-5ae0-4e12-a98c-da3926500fda", "title": "Farage revealed as highest - earning MP , receiving £98 , 000 a month from GB News", "date": "2024-08-17 09:15", "url": "https://www.aol.co.uk/farage-revealed-highest-earning-mp-084900553.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Reform UK leader Nigel Farage has been revealed to be the highest-earning MP.\nThe MP for Clacton said he is receiving almost £98,000 a month for presenting GB News, for a reported 32 hours a week, as a full list of MPs’ registered financial interests was published on Friday.\nIn addition to his work with GB News, Mr Farage received £16,597.22 from the paid video app Cameo and £4,000 for writing articles for The Telegraph.\nThe cost of flights and accommodation for Mr Farage and one staffer is listed as £32,836.\nOn the visit to Brussels, Mr Farage spoke at the National Conservatism conference, where Conservative MP Suella Braverman and Hungarian Prime Minister Viktor Orban were also in attendance."}, {"id": "1ede3084-ec7e-4d96-be8d-c7dcf5eb8fa7", "title": "Bombs away : more accurately , more destructive than ever", "date": "2024-08-17 05:00", "url": "https://www.budapesttimes.hu/books/bombs-away-more-accurately-more-destructive-than-ever/", "domain": "budapesttimes.hu", "domain_classification": "Unknown", "message": "World War Two rages on, 80 years after the fact – death and derring-do, resistance versus occupation, sabotage and torture.\nThe public’s love for the Mosquito grew mostly from a series of remarkable low-level pinpoint bombing missions.\nWhite doesn’t use the term “human shields” but the Gestapo had put Danish prisoners in the attic of the Shellhus.\nSome bombers accidentally targeted a school and more than 120 people were killed in total, 86 of them Danish children.\nWhen RAF crews were briefed on a target they might be told it had to be destroyed “at all costs”."}, {"id": "d2d454dc-4197-4b05-b572-49b7eb3c5108", "title": "Other days | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-17 08:45", "url": "https://www.arkansasonline.com/news/2024/aug/17/other-days/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "The shooting occurred shortly after 2 o'clock this morning on Musset Road, between here and Fort Smith.\nTeletype is a wholly owned subsidiary of Western Electric.\nA countrywide strike of telephone company employees was averted two weeks ago when AT and T settled its labor dispute.\nBut employees of Western Electric, a division of AT and T, did not agree to the settlement.\nIn 2014-15, thousands and thousands of the state's public school students in grades three through 11 will take all new, state-required math and English-language arts/ literacy exams on computers."}, {"id": "c1cf6b35-9862-4a09-8956-374617d92b04", "title": "Russia says Western rockets used to destroy bridge", "date": "2024-08-17 09:00", "url": "https://www.rte.ie/news/2024/0817/1465410-ukraine-russia/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Russia's foreign ministry has said Ukraine had used Western rockets, likely US-made HIMARS, to destroy a bridge over the Seym river in the Kursk region, killing volunteers trying to evacuate civilians.\n\"For the first time, the Kursk region was hit by Western-made rocket launchers, probably American HIMARS,\" MariaZakharova, spokeswoman for the Russian foreign ministry, said late yesterday on the Telegram messaging app.\nUkrainian army chief Oleksandr Syrskyi said yesterday that Kyiv's forces were advancing between one and three kilometres in some areas in the Kursk region, 11 days since beginning an incursion into Russia.\nKyiv has claimed to have taken control of 82 settlements over an area of 1,150 sq kms in the region since 6 August.\nRussia has accused the West of supporting and encouraging Ukraine's first ground offensive on Russian territory and said Kyiv's \"terrorist invasion\" would not change the course of the war."}, {"id": "cee1c35d-279c-42d2-98ec-de26bad1be7c", "title": "Irish authorities investigating stabbing of Catholic chaplain as possible terror incident", "date": "2024-08-17 01:00", "url": "https://www.myspiritfm.com/News?view=post&blogid=Catholic%2DNews&articleid=278151", "domain": "myspiritfm.com", "domain_classification": "Unknown", "message": "Military authorities in Ireland are investigating the stabbing of a Catholic chaplain as a potential terrorist attack, according to media reports on Friday.\n\"I want to thank defence forces personnel & Gardai for their action and response,\" the prime minister said.\nI have been briefed on the shocking incident outside Renmore Barracks last night & my thoughts are with the member of the defence forces in hospital.\nI want to thank defence forces personnel & Gardai for their action and response.\n— Simon Harris TD (@SimonHarrisTD) August 16, 2024The Irish Independent, meanwhile, reported that the incident is being investigated as a possible terror attack."}, {"id": "3f5c1f2a-2a11-41bc-b3e7-0a1b1f772307", "title": "Israeli Strike Leaves Casualties in Southern Lebanon", "date": "2024-08-17 04:45", "url": "https://www.devdiscourse.com/article/health/3054538-israeli-strike-leaves-casualties-in-southern-lebanon", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "An Israeli strike on a residential building in Nabatieh city, southern Lebanon, early on Saturday led to the deaths of at least six people and left three others wounded, according to the Lebanese health ministry.\nThe attack has sparked outrage and concern among residents and officials alike amid heightened tensions in the region.\nLocal authorities are currently assessing the extent of the damage and are expected to release more information as the situation develops.\n(With inputs from agencies.)"}, {"id": "ade6d59c-e016-4e7c-ab88-0be4b587b111", "title": "Father of Floyd Mayweather grandson faces ten years in jail", "date": "2024-08-17 09:15", "url": "https://www.worldboxingnews.net/2024/08/17/floyd-mayweathers-grandson-father-nba-youngboy-faces-jail/", "domain": "worldboxingnews.net", "domain_classification": "Unknown", "message": "The father of Floyd Mayweather’s grandson, NBA Youngboy, is facing a ten-year jail sentence for federal gun charges after intending to plead guilty.\nThis situation will have a knock-on effect on Mayweather, who will have to step up further to look after NBA Youngboy’s son.\nIyanna was charged previously with a 2020 stabbing attack on a female victim linked to NBA Youngboy.\nNBA Youngboy also faces several charges in Cache County and Weber County for unrelated incidents.\nFloyd Mayweather returns to the ring on August 24 in Mexico, days before NBA Youngboy’s next day in court."}, {"id": "60090e66-1733-48fe-b34a-df875753aa25", "title": "At least six killed in latest Israeli attack on southern Lebanon", "date": "2024-08-17 05:15", "url": "https://www.aljazeera.com/news/2024/8/17/at-least-six-killed-in-latest-israeli-strike-on-southern-lebanon", "domain": "aljazeera.com", "domain_classification": "International", "message": "An Israeli air strike in southern Lebanon has killed at least 10 people, Lebanon’s Ministry of Health has said, as the Israeli military reported hitting a Hezbollah weapons storage facility.\nHezbollah and other armed groups were responsible for 1,500 attacks that killed at least 23 Israelis.\nIsrael then killed Fuad Shukr, a top Hezbollah commander, in a missile attack in the suburbs of Beirut.\nHezbollah likely released the video to “deter” Israel from launching a major operation against it in Lebanon, he said.\nHezbollah has repeatedly said that only a Gaza ceasefire deal will stop its attacks on Israeli forces in northern Israel."}, {"id": "81a85910-108c-4dd6-8256-d5e2ec32184d", "title": "New picture of Trump shooter Thomas Matthew Crooks just before assassination attempt emerges", "date": "2024-08-17 07:30", "url": "https://nypost.com/2024/08/17/us-news/new-picture-of-trump-shooter-thomas-matthew-crooks-just-before-assassination-attempt-emerges/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "An new image of Donald Trump’s would-be assassin sitting on a wall looking and at his phone emerged Friday, showing the moments before he took a shot at the ex-president’s life.\nThomas Matthew Crooks can be seen perched on a wall in a grassy area of the Butler Farm Show Grounds in Butler, Pa., on July 13 as he waited for Trump, 78, to take the stage.\n4 Thomas Matthew Crooks can be seen perched on a wall in a grassy area of the Butler Farm Show Grounds in Butler, Pa., on July 13 as he waited for Trump, 78, to take the stage.\n4 Officers surround the body of Thomas Matthew Crooks after he was killed at former President Donald Trump’s campaign rally in Butler, PA on July 13, 2024.\nDespite suspicions, Crooks was able to whip out his gun and squeeze off eight shots at Trump before he was killed."}, {"id": "5433c57a-e539-4f53-bf26-cdb0c63b8f9f", "title": "National Award has validated my personal vision : Mukesh Gautam | Punjabi Movie News", "date": "2024-08-17 04:30", "url": "https://timesofindia.indiatimes.com/entertainment/punjabi/movies/news/national-award-has-validated-my-personal-vision-mukesh-gautam/articleshow/112570203.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Filmmaker Mukesh Gautam , and his family, including daughter Yami Gautam , are celebrating yet another addition of National Film Awards in the Gautam household.\nMukesh’s film Baghi Di Dhee has bagged Best Punjabi Film in the 70th National Film Awards announced on Friday.\n“Someone was mentioning that first my son-in-law won the National Award, next I did, and perhaps Yami too may be in line for the award next year for Article 370,” laughs Mukesh.He adds, “Of course, it feels wonderful at winning the award.\n“When I made Ek Noor, it was a period in Punjabi film history that wasn’t as commercial and bereft of stars like Diljit (Dosanjh) and Gippy (Grewal).\nI have made at least four docudramas, including on Sufi poets like Waris Shah, which also won the National Radio and TV award,” he says."}, {"id": "7609c2a8-e651-4843-a8d4-793f657fbf19", "title": "India : National strike held over doctor rape and murder", "date": "2024-08-17 06:00", "url": "https://www.bbc.co.uk/news/articles/c89wgzkdw1vo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Doctors in India have begun a national strike, escalating the protest against the rape and murder of a female colleague in the West Bengal city of Kolkata.\nThe Indian Medical Association (IMA), the country's largest grouping of doctors, said all non-essential hospital services would be shut down across the country on Saturday.\nThe IMA described last week's killing as a \"crime of barbaric scale due to the lack of safe spaces for women\" and asked for the country's support in its \"struggle for justice\".\nProtests against the attack and calling for the better protection of women have intensified in recent days after a mob vandalised the hospital where it happened."}, {"id": "436c6e7a-0e0b-4546-8ac7-bcac27900325", "title": "Russia says Ukraine used Western rockets to destroy bridge in Kursk region", "date": "2024-08-17 06:30", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Russia-says-Ukraine-used-Western-rockets-to-destroy-bridge-in-Kursk-region-47676666/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) -Russia's foreign ministry said Ukraine had used Western rockets, likely U.S.-made HIMARS, to destroy a bridge over the Seym river in the Kursk region, killing volunteers trying to evacuate civilians.\n\"For the first time, the Kursk region was hit by Western-made rocket launchers, probably American HIMARS,\" Maria Zakharova, spokeswoman for the Russian foreign ministry, said late on Friday on the Telegram messaging app.\n\"As a result of the attack on the bridge over the Seym River in the Glushkovo district, it was completely destroyed, and volunteers who were assisting the evacuated civilian population were killed.\"\nUkrainian army chief Oleksandr Syrskyi said on Friday that Kyiv's forces were advancing between 1 and 3 kilometres (0.6 to 1.9 miles) in some areas in the Kursk region, 11 days since beginning an incursion into Russia.\nKyiv has claimed to have taken control of 82 settlements over an area of 1,150 square kilometres (440 square miles) in the region since Aug. 6."}, {"id": "562822f1-d976-4e93-86c9-d67d398ff2f0", "title": "Secret Service pulls from Biden protective team to guard Trump", "date": "2024-08-17 03:00", "url": "https://timesofindia.indiatimes.com/world/us/secret-service-pulls-from-bidens-protective-team-to-guard-trump/articleshow/112579985.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "But the increased threat of violence against Trump, combined with Biden's recent reduced travel schedule, made the step both necessary and feasible, the official added.A White House spokesperson had no immediate comment, and a Trump campaign spokesperson declined to comment.The Secret Service has been under a cloud since July 13, when an assailant was able to fire, unimpeded, on Trump at an outdoor campaign rally in Butler, Pennsylvania.\nThe attack grazed Trump's ear, killed a spectator and seriously wounded two others.\nThe FBI is investigating, and congressional leaders have also opened inquiries.The Secret Service has taken responsibility for the security lapses that made the shooting possible.\nThe steps the Secret Service is taking are a natural part of its asymmetrical approach to assure their no-fail mission is fulfilled.\n\"We're going to go back in October,\" he said in an interview with billionaire entrepreneur Elon Musk this week."}, {"id": "d207a256-4822-463f-b85e-9cdc473c63cc", "title": "Ukraine war : as Russian troops close in , Kyiv urges civilians to evacuate Pokrovsk", "date": "2024-08-17 07:00", "url": "https://www.scmp.com/news/world/europe/article/3274859/ukraine-war-russian-troops-close-kyiv-urges-civilians-evacuate-pokrovsk", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Ukrainian troops have been trying to divert the Kremlin’s military focus away from the front line in Ukraine by launching a bold cross-border incursion into Russia’s Kursk region.\nThe Kremlin’s forces have had battlefield momentum and superior forces in eastern Ukraine’s Donetsk region since the spring.\nCivilians, evacuated from the Kursk Region border, receive humanitarian aid as they arrive in downtown Kursk, Russia, on August 16.\nUkrainian troops have taken full control of Sudzha, Zelensky said on Thursday.\n09:43 Ukraine war two years on: disease, displacement and demands for aid Ukraine war two years on: disease, displacement and demands for aid“At the turn they were shooting, there were mines, we drove around the mines."}, {"id": "79c3ce60-66cc-4730-bb19-8c1c65867cb9", "title": "Police Officer Who Shot & Killed Family Dog Rehired in Ohio", "date": "2024-08-17 02:45", "url": "https://www.yahoo.com/news/police-officer-shot-killed-family-010000193.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Lorain police officer hit the headlines last year after he shot and killed a dog named Dixie.\nThe tragic incident sparked a public outcry in Ohio as they demanded justice for the dog, a 3-year-old Labrador mix.\nMellenie explains although she got a hold of two of the dogs, Dixie started running because of the officer screaming.\nThe pup was “in the middle of the street on the yellow lines” and “no way near him or charging him” when the officer fatally shot Dixie.\nThe 3-year-old pup had no biting incidents and was “one of the most lovable dogs ever possible.”The post Police Officer Who Shot & Killed Family Dog Rehired in Ohio appeared first on DogTime."}, {"id": "65a8aeb4-6571-45b4-8827-76cba10cce36", "title": "Ukraine says Russia incursion  advanced  ", "date": "2024-08-17 09:30", "url": "https://www.hurriyetdailynews.com/ukraine-says-russia-incursion-advanced-199618", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Ukraine says Russia incursion 'advanced'KIEVKiev said Friday its incursion into Russian territory had advanced, claiming it aimed to force Russia to negotiate on \"fair\" terms, as Moscow's troops announced new gains in eastern Ukraine.\nZelensky's aide Mykhailo Podolyak said earlier Friday that Ukraine wanted to negotiate \"on our own terms\" by inflicting \"significant tactical defeats on Russia.\"\nUkraine has ruled out any talks with Russia if Russian troops do not leave its territory.\nThe governor of the Kursk region said on Monday that Ukraine had seized 28 settlements.\nBut the incursion appears to have had little impact on the larger battles raging in Russian-occupied parts of eastern Ukraine."}, {"id": "e31aad6e-78c1-4f08-8a26-1bd5d896316d", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities - New Delhi Times - India Only International Newspaper", "date": "2024-08-17 06:00", "url": "https://www.newdelhitimes.com/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "d9adbb73-e2e9-44f3-98ab-6cfc6a2b8668", "title": "Robert Kennedy assassin Sirhan Sirhan , inmate at Donovan prison , rejected for parole", "date": "2024-08-17 03:00", "url": "https://www.nbcsandiego.com/news/local/robert-kennedy-assassin-sirhan-sirhan-inmate-at-donovan-prison-rejected-for-parole/3599647/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Sirhan Sirhan, the man convicted of assassinating Sen. Robert F. Kennedy in 1968 at Los Angeles' Ambassador Hotel, was denied Friday in his latest bid for parole.\nIt marks the 17th parole hearing for Sirhan.\nIn 2021, a two-person state parole panel recommended that Sirhan be granted parole, but Gov.\n\"After decades in prison, Mr. Sirhan has failed to address the deficiencies that led him to assassinate Senator Kennedy,\" the governor said in a statement rejecting the parole grant.\n\"Mr. Sirhan lacks the insight that would prevent him from making the same types of dangerous decisions he made in the past.\""}, {"id": "c0f5cf93-4e78-4e81-b4f8-73bb1c5efefe", "title": "Robert Kennedy assassin Sirhan Sirhan , inmate at Donovan prison , rejected for parole", "date": "2024-08-17 07:00", "url": "https://www.nbcbayarea.com/news/national-international/robert-kennedy-assassin-sirhan-sirhan-inmate-at-donovan-prison-rejected-for-parole/3627742/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Sirhan Sirhan, the man convicted of assassinating Sen. Robert F. Kennedy in 1968 at Los Angeles' Ambassador Hotel, was denied Friday in his latest bid for parole.\nIt marks the 17th parole hearing for Sirhan.\nIn 2021, a two-person state parole panel recommended that Sirhan be granted parole, but Gov.\n\"After decades in prison, Mr. Sirhan has failed to address the deficiencies that led him to assassinate Senator Kennedy,\" the governor said in a statement rejecting the parole grant.\n\"Mr. Sirhan lacks the insight that would prevent him from making the same types of dangerous decisions he made in the past.\""}, {"id": "f2cb9674-ce08-43f6-b82d-fac7d89071e2", "title": "Woman behind names listed on A - bomb cenotaph dies of cancer | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-17 07:30", "url": "https://www.asahi.com/ajw/articles/15391834", "domain": "asahi.com", "domain_classification": "Unknown", "message": "Kazuko Ikegame writes names in the list of deceased atomic bomb victims on July 24 in Hiroshima.\nThis year marked the 79th anniversary of the atomic explosion that leveled Hiroshima on Aug. 6, 1945.\nOf that number, she wrote about 100,000 names, one by one, over the years.\nThis year’s list, which she completed on the evening of Aug. 5, the day before the ceremony, while she was fighting cancer, was her 35th.\nOn Aug. 15, she received a letter of appreciation from the city of Hiroshima for her achievement."}, {"id": "1a97561e-fd13-4bd0-892b-7414d4f9db9d", "title": "Udaipur Class 10th Student Stabbing Incident : Schools , Colleges to Remain Closed Today ; Internet Suspended", "date": "2024-08-17 08:15", "url": "https://www.india.com/news/india/udaipur-class-10th-student-stabbing-incident-schools-colleges-to-remain-closed-today-internet-suspended-at-bedla-badgaon-balicha-debari-eklingpura-7172086/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNewsUdaipur Class 10th Student Stabbing Incident: Schools, Colleges to Remain Closed Today; Internet SuspendedUdaipur Class 10th Student Stabbing Incident: Schools, Colleges to Remain Closed Today; Internet SuspendedDivisional Commissioner Rajendra Bhatt has ordered a 24-hour shutdown of internet services in the areas of Bedla, Badgaon, Balicha, Debari, Eklingpura, Kanpur, Dhikali, and Bhuwana in Udaipur, starting from Friday.\nSection 144 Imposed in UdaipurMeanwhile, the district administration has also implemented a 24-hour suspension of internet services, beginning at 10 PM on Friday and continuing through Saturday.\nDivisional Commissioner Rajendra Bhatt has ordered a 24-hour shutdown of internet services in the areas of Bedla, Badgaon, Balicha, Debari, Eklingpura, Kanpur, Dhikali, and Bhuwana in Udaipur, starting from Friday.\nUdaipur Class 10th Student Stabbing Incident: What Happened?\nAccording to the District Collector Arvind Poswal, the accused student who fled soon after attacking his classmate has been detained."}, {"id": "e4d5b262-9d46-48ca-b02e-482ebe4c0e24", "title": "Loud explosion rocks Sumy", "date": "2024-08-17 05:30", "url": "https://www.yahoo.com/news/loud-explosion-rocks-sumy-031040110.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A loud explosion occurred in the city of Sumy during an air raid on the morning of 17 August.\nSource: Suspilne Sumy, a Sumy-related branch of Ukrainian public broadcaster SuspilneDetails: Suspilne reported a loud explosion in Sumy at 06:05.\nPrior to that, Ukraine's Air Force reported activity by Russian tactical aircraft in the northeastern and southeastern areas.\nAn explosion was also heard in the city at night after 02:00.\nNotably, an air-raid warning has been in effect in Sumy Oblast since 03:26."}, {"id": "86b69132-2b2b-4ec3-b809-62a0d374d1b3", "title": "15 killed in Israeli strike on central Gaza Al Jazeera", "date": "2024-08-17 07:30", "url": "https://tass.com/world/1830293", "domain": "tass.com", "domain_classification": "Unknown", "message": "At least 15 people were killed in an Israeli attack in the Az-Zawayda area of the central Gaza Strip, the Qatari television channel Al Jazeera reported.\nAccording to it, the strike hit a warehouse where displaced Palestinians were located.\nThe TV channel footage shows rescue teams sorting through the debris of the destroyed building and removing the bodies of the dead.\nThe situation has escalated dramatically once again after the killing of Hamas leader Ismail Haniyeh in Tehran and Hezbollah senior commander Fuad Shukr in Beirut.\nHamas and Hezbollah blamed Israel for the killings and warned of their reaction."}, {"id": "0dab4f7c-d9c0-4afc-8426-7038cd3d605f", "title": "Texas jurors are deciding if a student parents are liable in a deadly 2018 school shooting", "date": "2024-08-17 03:00", "url": "https://www.wsbradio.com/news/national/texas-jurors-are/KIUMJ53NVBBJ7IQFKRMWEUDSC4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "c8946dca-1190-46d9-af23-c46966b4f1b0", "title": "US watches closely as Ukrainian forces push into Russia with US - provided arms", "date": "2024-08-17 01:00", "url": "https://www.yahoo.com/news/us-watches-closely-ukrainian-forces-234559335.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The US has watched closely as Ukrainian forces pushed deeper into Russian territory, powered in part by US-provided arms and equipment that have raised questions about whether Kyiv has abided by the Biden administration’s restrictions on the use of American weaponry.\nUS-made Humvees were seen entering Russia’s Kursk oblast through the Ukraine-Russia border crossing near Sudzha, Russia, on Tuesday in a Reuters photograph.\nUkraine has also used HIMARS rocket launchers as part of the operation, officials said, but the vehicles appear to have remained in Ukrainian territory, using the range of its GMLRS missile to hit Russia.\nUkraine has used the missiles to strike Russian air defense systems in Russian-occupied Crimea.\nUkraine says it has seized approximately 400 square miles of territory inside Russia, forcing Russian authorities to declare emergencies and carry out large-scale evacuations."}, {"id": "3c8b9798-c5a3-42c2-8010-0d3400a84297", "title": "US watches closely as Ukrainian forces push into Russia with US - provided arms", "date": "2024-08-17 01:00", "url": "https://www.cnn.com/2024/08/16/politics/us-watch-ukraine-push-into-russia/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —The US has watched closely as Ukrainian forces pushed deeper into Russian territory, powered in part by US-provided arms and equipment that have raised questions about whether Kyiv has abided by the Biden administration’s restrictions on the use of American weaponry.\nUS-made Humvees were seen entering Russia’s Kursk oblast through the Ukraine-Russia border crossing near Sudzha, Russia, on Tuesday in a Reuters photograph.\nUkraine has also used HIMARS rocket launchers as part of the operation, officials said, but the vehicles appear to have remained in Ukrainian territory, using the range of its GMLRS missile to hit Russia.\nUkraine has used the missiles to strike Russian air defense systems in Russian-occupied Crimea.\nUkraine says it has seized approximately 400 square miles of territory inside Russia, forcing Russian authorities to declare emergencies and carry out large-scale evacuations."}, {"id": "ad86ad0e-7ffc-4f7b-893c-f654b2d9647f", "title": "National strike held over India doctor murder", "date": "2024-08-17 04:15", "url": "https://www.yahoo.com/news/national-strike-held-over-india-034552609.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Indian doctors on strike over rape and murder of colleagueProtests demanding justice for the murdered woman and greater protection for women in general have been held across India [Reuters]Doctors in India have begun a national strike, escalating the protest against the rape and murder of a female colleague in the West Bengal city of Kolkata.\nThe Indian Medical Association (IMA), the country's largest grouping of doctors, said all non-essential hospital services would be shut down across the country on Saturday.\nIn a statement, the IMA said emergency and casualty services would continue to run and that the strike would last for 24 hours.\nIf such a crime can happen in a medical college in a major city, it shows \"everywhere doctors are unsafe\", he said.\nProtests have also been held in many other Indian cities like Delhi, Hyderabad, Mumbai and Pune."}, {"id": "b06a2544-c19a-49f7-80d1-6b52be47381a", "title": "What the Heck Was Zelenskyy Thinking ? - The Daily Reckoning", "date": "2024-08-17 00:15", "url": "https://dailyreckoning.com/what-the-heck-was-zelenskyy-thinking/", "domain": "dailyreckoning.com", "domain_classification": "Unknown", "message": "What the Heck Was Zelenskyy Thinking?\nThe soldiers will be killed or captured, and the equipment will wind up in Russian war museums.\nThe Russian Way of WarBy Byron KingWith over a thousand years of history behind them, Russians definitely know a few things about fighting wars on their own territory.\nThink of the Spanish-American War, World War I, World War II, Korea, Vietnam, the Cold War in Europe and serial wars in the Middle East since the 1990s.\nIn other words, Russian military power is the first derivative of Russia’s national energy and industrial economy."}, {"id": "51f04e72-95b4-4a8e-ac95-677b02c1f1d6", "title": "World War II : Secrets from Above - National Geographic Channel HD", "date": "2024-08-17 09:30", "url": "https://www.tvguide.co.uk/schedule/3f52bbf7-aa8b-559c-9c80-e9927b7d7f9f/world-war-ii-secrets-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War II: Secrets from AboveNational Geographic Channel HD 3:00 PM to 4:00 PM Saturday 17 August Share Add toCalendar +Battle of the Atlantic Season 2 Episode 2 of 6 S Subtitles Audio DescriptionThe story of the Battle of the Atlantic, the longest military campaign of the Second World War as the Nazis attempted to starve BritainWorld War II: Secrets from Above airs on National Geographic Channel HD at 3:00 PM, Saturday 17 August .\n(Subtitles, audio description.)\nLearn more about World War II: Secrets from Above and other education/science/factual topics on our factual page"}, {"id": "4f5b9e20-8812-433b-ac0d-c20552399681", "title": "World War II : Secrets from Above - National Geographic Channel HD", "date": "2024-08-17 08:45", "url": "https://www.tvguide.co.uk/schedule/1ecda4cb-d3a2-585e-ba8d-7e0f2dbc75d3/world-war-ii-secrets-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War II: Secrets from AboveNational Geographic Channel HD 2:00 PM to 3:00 PM Saturday 17 August Share Add toCalendar +Battle of Britain Season 2 Episode 1 of 6 S Subtitles Audio DescriptionThe Battle of Britain from a unique aerial perspective, as over 1500 British and German planes engage in a duel to the death above EnglandWorld War II: Secrets from Above airs on National Geographic Channel HD at 2:00 PM, Saturday 17 August .\n(Subtitles, audio description.)\nLearn more about World War II: Secrets from Above and other education/science/factual topics on our factual page"}, {"id": "f9730876-f456-4804-944b-e1c21e71f1ef", "title": "Japan to survey Alaskan island in hopes of recovering WWII dead", "date": "2024-08-17 02:45", "url": "https://english.kyodonews.net:443/news/2024/08/0c2fb1a7e69e-japan-to-survey-alaskan-island-in-hopes-of-recovering-wwii-dead.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "Some 2,600 Japanese soldiers died on Attu Island in May 1943, according to the Ministry of Health, Labor and Welfare, in a doomed attempt to hold the northern Pacific island, captured in June 1942, from over 10,000 U.S. personnel.\nRemains of around 320 soldiers were recovered in 1953, but later inspections in 2007 and 2008 did not culminate in the collection of any remains.\nThe United States will provide a boat for the upcoming five-day survey that will include the inspection of roads and runways and confirmation of the location of remains of the Japanese war dead.\nDuring the trip next week, the participants plan to also visit a U.S. military base in Alaska and offer prayers at a cenotaph to Japanese soldiers.\nYamazaki's grandfather, Yasuyo Yamazaki, commanded the Japanese forces on Attu Island and led the men to their death under orders from the headquarters."}, {"id": "a3aa057a-7f24-40f3-a786-53472f7aa2e0", "title": "Book review : New eyes on an old battle", "date": "2024-08-17 06:15", "url": "https://journalstar.com/life-entertainment/local/book-review-new-eyes-on-an-old-battle/article_49ff9004-4843-11ef-ac29-77e984b16d90.html", "domain": "journalstar.com", "domain_classification": "Unknown", "message": "“Voices From Gettysburg: Letters, Papers, and Memoirs From the Greatest Battle of the Civil War” by Allen C. Guelzo, Citadel Press, 352 pages, $29.\nAllen C. Guelzo’s bestselling 2013 book, “Gettysburg: The Last Invasion,” is the favorite of three weighty tomes on this battle which occupy this reviewer’s shelf of literature on the American Civil War.\nThe author’s recent book, “Voices From Gettysburg,” serves as a worthy coda for that excellent book and provides a window into how future historians may shape the public’s perception of any cataclysmic event.\nThis book is composed of eyewitness descriptions of the prelude, details and aftermath of the battle, which was crucial to deciding the war’s outcome.\nThe material provided includes letters, memoirs and official records from both military and civilian survivors of the bloody confrontation."}, {"id": "ceba141c-8eb7-49c2-a245-f4cc2bf23f68", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-08-17 03:30", "url": "https://gamingbolt.com/page/5496?action_type_map=fp781524", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "There would be only a few people who don't know anything about video games and those who know even a bit about games the few of the very first name they'll be able to recall would be street fighter .\n... Read More"}, {"id": "e1ed09c7-7dd5-4919-8982-0a9fbd88b522", "title": "US sanctions comparable to  war crime  ", "date": "2024-08-17 02:45", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66bfd6ada31060630b923844.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The letter said the unilateral application of certain economic sanctions by Washington constitutes collective punishment, \"which is considered a war crime\" and prohibited by the Geneva Conventions.\nCollective punishment has become a standard practice of US foreign policy through sanctions, and the US imposes them more than any other country, the letter said.\nHundreds of millions of people currently live under the sanctions, and notable cases include Cuba, Iran, Syria and Venezuela.\nIt cited comments by Mike Pompeo, former US secretary of state, about the effectiveness of the Donald Trump administration's sanctions against Iran.\nEconomic crisis\"I saw firsthand how unilateral coercive measures in the form of economic sanctions have constrained the government's fiscal ability to implement their social protection programs and deliver basic public services,\" Fakhri wrote in his report."}, {"id": "573c712c-1cfa-451e-98b8-3f9e339e1407", "title": "US sanctions comparable to  war crime  ", "date": "2024-08-17 04:45", "url": "http://africa.chinadaily.com.cn/a/202408/17/WS66bfd6ada31060630b923844.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The letter said the unilateral application of certain economic sanctions by Washington constitutes collective punishment, \"which is considered a war crime\" and prohibited by the Geneva Conventions.\nCollective punishment has become a standard practice of US foreign policy through sanctions, and the US imposes them more than any other country, the letter said.\nHundreds of millions of people currently live under the sanctions, and notable cases include Cuba, Iran, Syria and Venezuela.\nIt cited comments by Mike Pompeo, former US secretary of state, about the effectiveness of the Donald Trump administration's sanctions against Iran.\nEconomic crisis\"I saw firsthand how unilateral coercive measures in the form of economic sanctions have constrained the government's fiscal ability to implement their social protection programs and deliver basic public services,\" Fakhri wrote in his report."}, {"id": "89b759ee-ecdb-406e-b11e-5a7786b9dc96", "title": "US sanctions comparable to  war crime  ", "date": "2024-08-17 03:00", "url": "https://global.chinadaily.com.cn/a/202408/17/WS66bfd6ada31060630b923844.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The letter said the unilateral application of certain economic sanctions by Washington constitutes collective punishment, \"which is considered a war crime\" and prohibited by the Geneva Conventions.\nCollective punishment has become a standard practice of US foreign policy through sanctions, and the US imposes them more than any other country, the letter said.\nHundreds of millions of people currently live under the sanctions, and notable cases include Cuba, Iran, Syria and Venezuela.\nIt cited comments by Mike Pompeo, former US secretary of state, about the effectiveness of the Donald Trump administration's sanctions against Iran.\nEconomic crisis\"I saw firsthand how unilateral coercive measures in the form of economic sanctions have constrained the government's fiscal ability to implement their social protection programs and deliver basic public services,\" Fakhri wrote in his report."}, {"id": "910f7e0b-7a9b-4ec9-bfbd-d3f1df88bb44", "title": "Logistics : NATO Creates Training Operation For Ukraine", "date": "2024-08-17 04:45", "url": "http://www.strategypage.com/htmw/htlog/articles/202408170043.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "Ukraine is the first war that NATO has been involved in since NATO was founded in 1949.\nThe continued fighting in Ukraine has forced NATO nations to confront the formerly potential but now actual threat from Russia.\nRussia does not want to fight NATO because NATO forces are more numerous, better armed and supplied.\nNaval forces of NATO nations are seven times that of Russia NATO nations are increasing the percentage of their GDP devoted to defense.\nWorse, NATO military trainers are increasingly training Ukrainian soldiers to use the NATO supplied weapons and fight more effectively."}, {"id": "296ea0db-278c-48a8-afc1-a026907d28d1", "title": "Sharpe - ITV4 | TV Guide", "date": "2024-08-17 08:45", "url": "https://www.tvguide.co.uk/schedule/ce4649bf-e1ad-5b97-83c8-7106009e6b25/sharpe", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "SharpeITV4 2:45 PM to 5:00 PM Saturday 17 August Share Add toCalendar +Sharpe's Sword Season 3 Episode 3 of 3 S SubtitlesDespatched by Munro to kill a French colonel, Sharpe is wounded in battle and hovers at death's door - but Harper and a mute nun nurse him back to health.\nOnce recovered, he sets out in search of vengeance with a newly forged sword.\nPeriod adventure, starring Sean Bean and Daragh O'MalleySharpe airs on ITV4 at 2:45 PM, Saturday 17 August .\n(Subtitles.)\nLearn more about Sharpe and other movie/drama on our drama pageTopics Movie ➝ Drama Adventure ➝ War Historical ➝ Period Drama"}, {"id": "dd0c1024-85e6-4ec2-ac39-28951121e505", "title": "RIGHT SPEAK : 99 C - Clashes in F - Line , Pokrovsk Sec Repelled 28 Attacks , 9 More are Still Ongoing ; Frontline Update as of August 16 ; UKR Keeps Advancing ,  strengthening position in Kursk Reg and Controls 82 Settlements There ; UKR Destroys 1 ...", "date": "2024-08-17 07:30", "url": "http://www.rightspeak.net/2024/08/99-c-clashes-in-f-line-pokrovsk-sec.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Aug 2024 (85) Jul 2024 (155) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "d00ea49f-0c67-411b-9692-41b851f68bfa", "title": "Turkey wildfires threaten homes and war memorials", "date": "2024-08-17 08:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/turkey-wildfires-threaten-homes-and-war-memorials/articleshow/112584097.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Some people forced to evacuateGallipoli battle site graves affectedWildfires fanned by strong winds threatened parts of northwestern Turkey , including World War I memorials and graves at the Gallipoli battle site .A forest fire in the west coast province of Izmir, which started late on Thursday in the Karsiyaka district, forced some people to flee their homes due to the imminent threat to residential areas.Izmir Governor Suleyman Elban said the fire in the Karsiyaka district continued despite efforts to contain it using planes, helicopters, and other vehicles, adding that a village had been evacuated.More than 1,000 firefighters were battling the blaze.\n\"The intervention is becoming difficult as it is very close to residential areas.\nThere is no loss of life until now,\" Elban said.\n\"We have information that some houses burned.\nSince there are winds of up to 80 kilometers (49.71 miles) per hour now, we often have to stop the aerial intervention,\" he said, adding efforts would intensify if and when winds eased.Fires were also burning in the northwestern provinces of Canakkale, Manisa and Bolu."}, {"id": "cdc5d722-9e6e-4207-b43f-ae738b9f44cd", "title": "The Kursk attack has humiliated Putin – and changed the narrative over how the war is fought | Orysia Lutsevych", "date": "2024-08-17 06:30", "url": "https://www.theguardian.com/commentisfree/article/2024/aug/17/ukraine-kursk-attack-vladimir-putin-russia", "domain": "theguardian.com", "domain_classification": "International", "message": "First, at the very start of the war in 2022, its forces repelled a Russian assault on the capital, Kyiv.\nNow, their tanks are rolling in to Russian territory.\nKyiv’s territorial gains, in contrast to the size of Russia’s territory, are, of course, small.\nNow, with Kursk, there are enemy forces occupying Russian territory for the first time since the second world war.\nKursk also dispels the narrative that this war should only be fought on Ukrainian soil, and that, somehow, Ukraine could prevail by attacking Russian positions only inside its own borders."}, {"id": "d10b330d-77e9-42fc-9b45-2fc443474cad", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | The Standard", "date": "2024-08-17 02:45", "url": "https://www.standard.net.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "3deca64a-af88-4c48-9196-22f674400f74", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | The Examiner", "date": "2024-08-17 03:45", "url": "https://www.examiner.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "7acf7375-f2d6-4706-b0b1-b7cc23bd23b7", "title": "Gallipoli peninsula : ﻿Wildfire threatens ANZAC war graves in Turkey", "date": "2024-08-17 00:15", "url": "https://www.9news.com.au/national/gallipoli-peninsula-wildfire-threatens-anzac-war-graves-in-turkey/f7ec2326-ac73-40f2-8f7c-3a62ab2eb985", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Wildfires that threatened the graves of Australian soldiers at ANZAC Cove in Gallipoli, Turkey , have been brought under control, though the threat remains.\nDry, hot, and windy weather conditions sparked a series of fires that quickly spread across the Gallipoli Peninsula , affecting several commemorative and operational sites.\nIt has not yet been confirmed whether Australian war graves and memorials have been damaged.\nAn aerial shot shows part of the extinguished wildfire area at the Anzac Cove beach.\nWe understand there are efforts underway to control fires that are burning on the Gallipoli Peninsula,\" Albanese said."}, {"id": "619bd837-1628-439c-9360-3d476a73d1f0", "title": "Kremlin accuses the West of helping Ukraine attack Russia", "date": "2024-08-17 05:15", "url": "https://www.asiaone.com/world/kremlin-accuses-west-helping-ukraine-attack-russia", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Ukraine said the incursion was needed to force Russia, which sent its forces into Ukraine in February 2022, to start \"fair\" peace talks.\nInfluential veteran Kremlin hawk Nikolai Patrushev dismissed the Western assertions in an interview with the Izvestia newspaper.\nKremlin says Ukraine will pay for US involvement\"Washington's efforts have created all the prerequisites for Ukraine to lose its sovereignty and lose part of its territories,\" Patrushev said.\nUkraine said on Thursday that it had installed a military commandant in the area it controlled, even as Russia intensified its offensives in Ukraine's east.\nKursk regional governor Alexei Smirnov said Ukraine had destroyed a road bridge over the Seym river in the region's Glushkovsky district."}, {"id": "728c0a2d-f69d-4890-9c0d-0925d5d7aa2d", "title": "17 | August | 2024 | Windows to Russia", "date": "2024-08-17 04:45", "url": "https://windowstorussia.com/2024/08/17", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The AFU losses amounted to up to 3,450 Ukrainian troops, six tanks, 18 armoured fighting vehicles, including nine U.S.-made M113 armoured personnel carriers, and 34 motor vehicles.\nThe AFU losses amounted to up to 3,825 Ukrainian troops, nine armoured fighting vehicles, 29 motor vehicles, and 50 field artillery guns.\nAs a result of active actions, units of the Tsentr Group of Forces liberated Lisnichnoye, Ivanovka, and Sergeyevka (Donetsk People’s Republic).\nLosses were inflicted on formations of four AFU mechanised brigades, one infantry brigade, two assault brigades, and one territorial defence brigade.\nThe AFU losses amounted to up to 770 Ukrainian troops, 34 motor vehicles, and 19 field artillery guns."}, {"id": "1a2ae452-e8fa-46dc-850f-9247beeaa1cb", "title": "Does the Trump camp really want to question Walz military record ? | LETTER | Letters", "date": "2024-08-17 06:00", "url": "https://www.reviewjournal.com/opinion/letters/letter-does-the-trump-camp-really-want-to-question-walzs-military-record-3130773/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "I’m also a combat veteran of Vietnam’s Mekong Delta, so I think I have some credibility regarding military service.\nApparently, the former president’s “bone spurs” and “PTSD” issues don’t seem to be especially bothersome to Mr. Joecks.\nBut Mr. Walz’s military service is.\nBut Mr. Joecks already knew that.\nBone Spurs” Donald Trump."}, {"id": "826ca9bb-6480-464f-a2e6-06660760da74", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | Bendigo Advertiser", "date": "2024-08-17 00:00", "url": "https://www.bendigoadvertiser.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "0189bf07-a917-4308-a2e2-98e0e80bd6f3", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | Bendigo Advertiser", "date": "2024-08-17 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "e80f0c37-6609-4c9d-af86-9268590a0403", "title": "Ukrainian forces advance southeast of Sudzha in Russia Kursk Oblast – ISW", "date": "2024-08-17 07:45", "url": "https://www.yahoo.com/news/ukrainian-forces-advance-southeast-sudzha-005630599.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: ISWQuote: \"Ukrainian forces continued to marginally advance southeast of Sudzha on 16 August amid continued Ukrainian operations in Kursk Oblast.\"\nThey also added that fighting continued north of Sudzha near Russkoye Porechnoye, east of Sudzha near Agronom and southeast of Sudzha along the Giri-Kamyshnoye-Krupets-Spalnoye line.\nDetails: Ukrainian officials reported ongoing advances by Ukrainian forces in Kursk Oblast and suggested that this incursion has increased Russia's willingness to consider a prisoner-of-war exchange.\nTo quote the ISW’s Key Takeaways on 16 August:Ukrainian forces continued to marginally advance southeast of Sudzha on 16 August amid continued Ukrainian operations in Kursk Oblast.\nUkrainian officials reported that Ukrainian forces continued to advance in Kursk Oblast and suggested that the incursion has forced Russia to more readily consider prisoner-of-war (POW) exchanges."}, {"id": "87bf3716-2dfc-43e6-8ffe-eaaad1dc1f31", "title": "Ukraine Destroys Key Bridge In Kursk Region Using US - Supplied HIMARS", "date": "2024-08-17 06:15", "url": "https://www.zerohedge.com/geopolitical/ukraine-destroys-key-bridge-kursk-region-using-us-supplied-himars", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Regardless of which side's narrative of events are more accurate amid the fog of war, the biggest end of week development has involved the destruction of a key Russian bridge on Friday.\n\"Later on Friday, the bridge collapsed after being struck by a U.S.-supplied HIMARS rocket, the Kremlin-aligned Mash Telegram news channel reported, publishing images of the destroyed structure,\" the report continued.\nAerial images and videos have been circulating throughout the day, and Acting Kursk region governor Alexei Smirnov has since confirmed that the bridge collapsed.\nThe Seym River bridge, via MashThe specific targeting of the bridge may be a move by Ukraine to solidify control of the Glushkovsky district, which leaves the protection of the Seym River a significant geographical barrier for Russian troops.\nUkraine's air force boasted that it took out the bridge...Ukraine’s Air Force Commander Lieutenant General Mykola Oleschuk claims responsibility for the destruction of a bridge in Russia’s Kursk region today."}, {"id": "664c59ec-f9bc-4cbe-90cc-00f10d588989", "title": "Ukraine could deliver a killer ideological blow to Putin", "date": "2024-08-17 05:45", "url": "https://www.spectator.co.uk/article/ukraine-could-deliver-a-killer-ideological-blow-to-putin/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin called it an ‘important terrorist provocation’ and ordered a state of emergency in the Kursk Province.\nIt could break the impasse of the last two years, and open up the possibility of striking a decisive blow.\nProlonged fighting on Russian territory is bound to cause political trouble in Russia for both Putin and the army command.\nHumiliation, even on a local scale, will blow a hole in their empty assurances that ‘all is going to plan’.\nBefore his invasion of Ukraine, Putin distributed a pseudo-historical essay to his troops, the essence of which misappropriates to Russia the legacy of everything from Kievan Rus to the Great Patriotic War."}, {"id": "0e28a95b-2ac4-4a62-92ec-8a7290b0d499", "title": "Stop mass layoffs at Warren Truck ! Mobilize the international working class against job cuts ! ", "date": "2024-08-17 06:00", "url": "https://www.wsws.org/en/articles/2024/08/17/pers-a17.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "IYSSE members distribute statements opposing Gaza genocide to Stellantis workers at Warren Truck Assembly Plant in Warren, Michigan on December 21, 2023The mass layoffs at Stellantis’ Warren Truck Assembly Plant are a threat to autoworkers all over the world.\nThe global character of the layoffs underscores the need for an internationally-unified response by the working class.\nThe intervention of the working class is also needed to put a stop to war.\nIt has also created a working class which is far larger and interconnected than ever before, creating the possibility of a new, international movement against exploitation.\nThe global jobs massacre must be opposed and resisted, and Warren Truck is now a critical battleground in the working class counter-offensive."}, {"id": "4a08bc0c-019b-4d0a-ba27-1e1ba6053927", "title": "Russia alleges NATO hidden hand in Ukraine Kursk offensive", "date": "2024-08-17 02:45", "url": "https://tribune.com.pk/story/2488726/russia-alleges-natos-hidden-hand-in-ukraines-kursk-offensive", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A key aide to Russian President Vladimir Putin alleged on Friday that the West, particularly the US-led NATO alliance, had a hand in planning Ukraine's recent surprise attack on Russia's Kursk region.\nUkraine justified the incursion as necessary to compel Russia, which had invaded Ukraine in February 2022, to engage in \"fair\" peace talks.\nHis comments implied that Ukraine's first acknowledged incursion into sovereign Russian territory carries a significant risk of escalating the conflict.\nDespite the relatively small scale of the incursion, for Putin, it represents a significant escalation and crosses a critical red line.\nRussia's defense ministry released footage that it claimed showed a Russian drone destroying a US-made Stryker armored combat vehicle in the Kursk region."}, {"id": "ba1d79b3-2ee5-4ac5-8174-3876fac3ceb4", "title": "The Crown Jewel Of American Socialism", "date": "2024-08-17 03:00", "url": "https://www.zerohedge.com/political/crown-jewel-american-socialism", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "I have a right to get my money back.”President Roosevelt signs the Social Security Bill on August 14, 1935.\nThe money also does not go into a Social Security retirement fund or a food-stamp emergency fund that earns interest.\nThe money that is being used to fund Social Security today is being seized by the IRS from their children and grandchildren and their peers.\nProponents of Social Security claim that their support of this socialist program demonstrates their care and compassion.\nToday, so many people are convinced that if Social Security were repealed today, there would be people dying in the streets tomorrow."}, {"id": "55cadf0c-124e-4d49-91a3-cda8c10c55e1", "title": "What to watch on TV and streaming today : Emily in Paris , Saving Private Ryan and Girls Aloud at the BBC", "date": "2024-08-17 04:30", "url": "https://www.independent.ie/entertainment/television/what-to-watch-on-tv-and-streaming-today-emily-in-paris-saving-private-ryan-and-girls-aloud-at-the-bbc/a440553964.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Attack on Pearl Harbor: Minute by Minute RTÉ2, 7.30pm New three-part documentary focusing on the Japanese raid that led to America entering World War II.\nGirls Aloud at the BBCGirls Aloud at the BBC BBC Two, 9.10pm Clips from the archive featuring Sarah Harding, Kimberley Walsh, Nadine Coyle, Cheryl Tweedy and Nicola Roberts.\nEmily in Paris Netflix, streaming now Emily might be technically single, but her heart and mind are still intertwined with two love interests.\nThe Union Netflix, streaming now Brace yourselves.\nHalloween Ends Netflix, streaming now And now for something completely different — a summer blockbuster that’s Halloween-themed!"}, {"id": "acd87c60-0dce-4f0a-ab8c-8140ec01467c", "title": "Crackdown on cross - border crime urged", "date": "2024-08-17 02:45", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66bfe643a31060630b92388c.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The informal discussion between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug 16, 2024.\nThe pledge was made at an informal discussion among foreign ministers from the four countries in Chiang Mai, Thailand.\nStatistics showed that under cooperation among the four countries, more than 50,000 criminals involved in gambling-related fraud have been arrested since the joint efforts were launched a year ago.\nOnly through increased joint efforts by regional countries can the trend of high incidences of these illegal activities be effectively countered and reversed, Wang said.\nThailand and Laos have both expressed hope that Myanmar will realize peace and stability, saying they are willing to provide assistance to the country."}, {"id": "834df268-390a-491b-b722-c16fe2506933", "title": "Streaming : Furiosa : A Mad Max Saga and the best post - apocalyptic films", "date": "2024-08-17 08:15", "url": "https://www.theguardian.com/film/article/2024/aug/17/streaming-furiosa-a-mad-max-saga-and-the-best-post-apocalyptic-end-of-the-world-films", "domain": "theguardian.com", "domain_classification": "International", "message": "You have to hand it to George Miller’s Mad Max franchise, now five films in: it has kept the end of the world going for the better part of half a century.\nA big, busy, ornately designed prequel to 2015’s delirious series peak Mad Max: Fury Road, the new-to-streaming Furiosa: A Mad Max Saga (2024) isn’t exactly meant to be cosy or comforting.\nView image in fullscreen Viggo Mortensen and Kodi Smit-McPhee in The Road (2009).\nIt’s set in much the same drought-ravaged Australia as Mad Max, though kitted out with more gaudily fluorescent pop shrapnel.\nView image in fullscreen Doomsday scenario… Clive Owen and Clare-Hope Ashitey in Alfonso Cuarón’s Children of Men (2006)."}, {"id": "9a668a69-5d1f-4eda-8d4f-973872a9454c", "title": "Crackdown on cross - border crime urged", "date": "2024-08-17 04:15", "url": "http://usa.chinadaily.com.cn/a/202408/17/WS66bfe643a31060630b92388c.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The informal discussion between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug 16, 2024.\nThe pledge was made at an informal discussion among foreign ministers from the four countries in Chiang Mai, Thailand.\nStatistics showed that under cooperation among the four countries, more than 50,000 criminals involved in gambling-related fraud have been arrested since the joint efforts were launched a year ago.\nOnly through increased joint efforts by regional countries can the trend of high incidences of these illegal activities be effectively countered and reversed, Wang said.\nThailand and Laos have both expressed hope that Myanmar will realize peace and stability, saying they are willing to provide assistance to the country."}, {"id": "896be640-002c-41e3-bf32-e2fe8438b85a", "title": "Crackdown on cross - border crime urged", "date": "2024-08-17 04:45", "url": "http://africa.chinadaily.com.cn/a/202408/17/WS66bfe643a31060630b92388c.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The informal discussion between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug 16, 2024.\nThe pledge was made at an informal discussion among foreign ministers from the four countries in Chiang Mai, Thailand.\nStatistics showed that under cooperation among the four countries, more than 50,000 criminals involved in gambling-related fraud have been arrested since the joint efforts were launched a year ago.\nOnly through increased joint efforts by regional countries can the trend of high incidences of these illegal activities be effectively countered and reversed, Wang said.\nThailand and Laos have both expressed hope that Myanmar will realize peace and stability, saying they are willing to provide assistance to the country."}, {"id": "7de7a22f-3b0d-4a79-a9a1-c47acac8594f", "title": "The 20 questions wed ask Harris and Trump", "date": "2024-08-17 04:45", "url": "https://www.yahoo.com/news/20-questions-d-ask-harris-030000963.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Recently, several journalists have responded by conducting an exercise: what questions would I ask Harris and Trump if I sat down with them?\nThe Biden-Harris administration is on track to add more to the national debt than any four-year term in history.\nHow large of a threat do you view the national debt to be to our country’s future?\nYou oversaw the largest single-term increase to the national debt in U.S. history, in part because of the response to COVID-19.\nHow large of a threat to you view the national debt to be to our country’s future?"}, {"id": "31a754c2-fe8b-490f-a61b-e44ed5f3e48d", "title": "A major war is planned by the united states : Blinken does Not want any successful negotiation to end the slaughter hood in Gaza . The wait for response to assassinations in Tehran and Beirut had confused all parties . ", "date": "2024-08-17 08:15", "url": "https://adonis49.wordpress.com/2024/08/17/a-major-war-is-planned-by-the-usa-blinken-does-not-want-any-successful-negotiation-to-end-the-slaughter-hood-in-gaza-the-wait-for-response-to-assassinations-in-tehran-and-beirut-had-confused-all-par/", "domain": "adonis49.wordpress.com", "domain_classification": "Unknown", "message": "A major war is planned by the USA: Blinken does Not want any successful negotiation to end the slaughter hood in Gaza.\nThe wait for response to assassinations in Tehran and Beirut had confused all parties.\nThe covered genocide in Gaza is a warning that more genocides are planned this decade and will be ignored as common phenomena.\nDoes that mean that Blinken of the USA is dead resolute on targeting Hezbollah badly?)\n45.000 pregnant Palestinian women were displaced several times in Gaza to “safer more dangerous locations50 Palestinians were assassinated in Israeli prisons."}, {"id": "c4e8b7a8-e806-49e4-b87b-0267e5371dd7", "title": "Newsom signs package to curb smash - and - grab robberies , car thefts", "date": "2024-08-17 09:30", "url": "https://www.yahoo.com/news/newsom-signs-package-curb-smash-064840735.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gavin Newsom signed a bipartisan package of 10 bills on Friday in an effort to reduce smash-and-grab robberies and property crimes, creating stricter penalties for repeat offenders and people running professional reselling schemes.\n\"Let's be clear, this is the most significant legislation to address property crime in modern California history,\" Newsom said on Friday.\nGavin Newsom signed a bipartisan package of 10 bills on Friday in an effort to reduce smash-and-grab robberies and property crimes.\nEarlier this year, Newsom and fellow state Democrats worked for months on an unsuccessful effort to keep Proposition 36, a tougher-on-crime initiative, off the ballot for November's election.\nOriginal article source: Newsom signs package to curb smash-and-grab robberies, car thefts"}, {"id": "d08f8331-3c59-4142-860f-ff820c0e6655", "title": "Battle Star Wars - Legend Xtra", "date": "2024-08-17 04:15", "url": "https://www.tvguide.co.uk/schedule/17e36c9e-e4fe-5dc8-a4d7-4192a17be18e/battle-star-wars", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Battle Star Wars (2019)Legend Xtra 10:00 AM to 11:50 AM Saturday 17 August Share Add toCalendar +Battle Star WarsWhen the leader of the evil Coalition threatens to destroy a Rebel planet for its resources, his daughter has no choice but to join the Rebel side and fight for what is right.\nSci-fi drama, starring Alyson Gorske, Aimee Stolte and Justin BertiBattle Star Wars airs on Legend Xtra at 10:00 AM, Saturday 17 August .\nCertificate PGTopics Movie ➝ Drama Science Fiction"}, {"id": "871291be-3b59-4c05-86d8-0d8383c0e4de", "title": "RMT seeks to rein in strike action by Royal Fleet Auxiliary seafarers to aid Labour government war agenda", "date": "2024-08-17 01:00", "url": "https://www.wsws.org/en/articles/2024/08/16/wcqr-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The RMT leader is acting to rein in his members based on support for the Labour government’s war agenda.\nThis is based on a transactional agreement to support war.\nThe RMT represents 500 members at the RFA from deckhands, engine, communications, catering staff and security staff.\nThe first day of strike action was used by Nautilus to warn the Labour government it was sitting on wider opposition.\nLynch in a July 11 update to members at RFA members described meeting with the MOD and new Armed Forces Minister Luke Pollard MP, as a breath of fresh air."}, {"id": "05133b82-261c-416b-9c72-08aa97760b06", "title": "Kotaku Weekend Guide : 5 New And Old Games We Cant Wait To Play", "date": "2024-08-17 00:45", "url": "https://www.kotaku.com.au/2024/08/kotakus-weekend-guide-5-new-and-old-games-we-cant-wait-to-play/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "We’ve got pigskins flying, mysteries that need solving, and games we simply adore that we’d like to return to.\nIf you’re unsure what to play this weekend, fear not.\nThe Crimson DiamondThe Crimson Diamond is AVAILABLE NOW!!\nThe Crimson Diamond is perhaps most reminiscent of Sierra adventures, especially the Clara Bow games which saw their plucky heroine tossed into murder mysteries during the roaring ‘20s.\nOr it could be that the more melancholy, blue-tinted mashup of chill vibes and menacing macabre undertones is more my style than the other Persona games."}, {"id": "dbe5b089-4f8e-4778-bf4a-5c9e53b32887", "title": "Where Is Celeborn In  The Rings Of Power  season 2 ? ", "date": "2024-08-17 01:00", "url": "https://www.themarysue.com/where-is-celeborn-in-the-rings-of-power-season-2/", "domain": "themarysue.com", "domain_classification": "Unknown", "message": "Is Celeborn dead in The Rings of Power season 1?\nWith the mystery box structure of The Rings of Power season 1, there’s a lot that’s just deceptive and hiding in plain sight, and some that’s intentionally misleading.\nSo, will we see Celeborn in The Rings of Power season 2?\nThere’s a chance that we could see Celeborn in The Rings of Power season 2.\nThe destruction of Eregion is possibly going to be THE big battle that ends The Rings of Power season 2."}, {"id": "a9971518-d6d0-4f9e-9abb-c1644b23956f", "title": "Ukrainian troops trained in united kingdom before attacking Kursk", "date": "2024-08-17 06:00", "url": "https://www.wsws.org/en/articles/2024/08/17/jgir-a17.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "A destroyed Russian tank lies on a roadside near Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nThe list of NATO-provided military hardware confirmed to be deployed in the Kursk offensive is growing.\nVladislav Seleznyov, a former spokesman for the Ukrainian armed forces’ general staff, told Voice of America that HIMARS were “critical to the stunning advance.\nDozens were probably killed.”Nick Patton Walsh, the chief international correspondent of CNN, appeared to have walked into Russia without obtaining permission during a broadcast this week alongside Ukrainian military forces.\nIt’s also remarkable the freedom with which the Ukrainian military are moving around here."}, {"id": "12005d7c-6e8e-4cc6-917e-620091bb1c9d", "title": "What on events in and around Hereford published August 15", "date": "2024-08-17 06:30", "url": "https://www.herefordtimes.com/news/24505540.events-around-hereford-published-august-15/", "domain": "herefordtimes.com", "domain_classification": "Unknown", "message": "We've compiled some upcoming events to keep all the family busy in Herefordshire, including a concert at Hereford Cathedral.\nThese are three of the events published in the what's on section of the Hereford Times this week (August 15).\nJohn Challenger(Image: Ben Tomlin)Hereford Cathedral will welcome back former chorister John Challenger for a very special Gala Organ Concert this September.\nJohn received his early musical education as a chorister at Hereford Cathedral from 1996 to 2001 under Dr Roy Massey, Geraint Bowen and Peter Dyke.\nJohn Challenger’s performance of The Planets will take place at Hereford Cathedral on Tuesday, September 17 at 7pm."}, {"id": "5479d3f4-5824-451e-9a5e-05c9413c8c5c", "title": "Taliban rule : IRR commended for extending humanitarian services to high - risk families - Pakistan", "date": "2024-08-17 03:00", "url": "https://www.brecorder.com/news/40317937/taliban-rule-irr-commended-for-extending-humanitarian-services-to-high-risk-families", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Marking three years since the Taliban seized power in Afghanistan, IRR, in collaboration with SADAAH and the Rehman Malik Foundation, hosted an event at Soho House London.\nSpeakers, including Baroness Hussein-Ece, Elham Ehsas, Mandy Sanghera, Tim Walker, Sarah Sands, and Anil Qasemi, highlighted the ongoing gender apartheid in Afghanistan under Taliban rule.\nSpeaking on behalf of IRR and the Rehman Malik Foundation, Ali Rehman Malik highlighted the devastating impact of terrorism, particularly from the Taliban, on the social and economic fabric of Pakistan and Afghanistan.\nExpressing grave concerns over the new wave of terrorism in Pakistan, Ali Rehman Malik commended Pakistan’s resolve and continued efforts to eliminate terrorism.\nMalik vowed to continue his father’s legacy of serving humanity through IRR International and the Rehman Malik Foundation."}, {"id": "673ad6be-2095-46e6-834f-bf7501d32f96", "title": "Israel , Gaza and Josh Shapiro : What to watch for during the DNC", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/american-politics/article-815076", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Harris’ Jewish husband, Doug Emhoff, is also expected to take a primetime turn.\nThe Democratic convention will run Monday through Thursday in Chicago, with marquee speakers — including Harris, Walz and former presidents Barack Obama and Bill Clinton — speaking in the evening.\n​Jim Zogby, the president of the Arab American Institute and a longtime Democratic Party operative, said progressive protesters are showing up in large numbers at the Democratic convention because they feel betrayed by the Democratic administration.\n“Israel’s genocidal war in Gaza has become central to the agenda of progressives in the Democratic Party,” he said in his most recent weekly newsletter.\nIf either — or both — mention the war, Jewish organizations will closely scrutinize the differences, as will pro-Palestinian activists."}, {"id": "a1c586ff-0821-4118-a5ba-6e14f3e0576a", "title": "Defence spending conundrum", "date": "2024-08-17 06:00", "url": "https://www.thestar.com.my/business/business-news/2024/01/18/defence-spending-conundrum", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "Quite how the government will continue to invest in defence and security needs under the Defence White Paper (DWP) published in 2019 without any actual figure being stated is interesting, although there is acknowledgement that defence spending is long-term and lasts beyond the allocations of a five-year Malaysia Plan (MP).\nWhat the DWP really reveals is the government’s commitment to trimming the national debt, which will have to be balanced with defence spending aims that are long-term and stable, as well as affordable and sustainable.\nMilitary spending under Budget 2024 is approximately 1% of GDP compared to 0.98% of GDP under Budget 2023.\nCAP-55 envisions two multirole combat aircraft squadrons and three light combat aircraft squadrons, with defence analysts estimating that a total of around 100 aircraft will comprise these squadrons.\nThis is the ideal and is unlikely given the historic military spending and the country’s current economic prospects."}, {"id": "e2648384-e095-4011-9c1c-0b6143e96350", "title": "Rooster crowing", "date": "2024-08-17 00:45", "url": "https://www.cbc.ca/player/play/audio/9.6483147", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "When search suggestions are available use up and down arrows to review and enter to select."}, {"id": "10e98c09-3e02-4e72-b5a5-5401e37fe66e", "title": "The Challenge : Jonna Mannion says Season 40 castmate has a  bad reputation  and she  terrified  to face her", "date": "2024-08-17 03:00", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-jonna-mannion-says-season-40-castmate-has-a-bad-reputation-and-shes-terrified-to-face-her/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Unsurprisingly, Jonna revealed one teammate she particularly fears having to go against: Tori.\nShe admitted that their elimination battle on USA 2 was not good for her, but also said she is cool with Tori.\nJonna revealed how she spent her All Stars prize moneyWhile on Zach’s podcast, Jonna admitted being surprised to get a call for the first season of The Challenge: All Stars.\n“I spent some on paying off my house,” Jonna revealed, adding that she also bought her husband a truck.\nThe Challenge: Battle of the Eras airs Wednesdays at 8/7c on MTV."}, {"id": "c695c8d5-04ea-47a0-9165-34d22a7b6b69", "title": "Church of Jesus Christ makes donation to combat child malnutrition in rural Mexico", "date": "2024-08-17 06:30", "url": "https://www.ksl.com:443/article/51102742/church-of-jesus-christ-makes-donation-to-combat-child-malnutrition-in-rural-mexico", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 1-2 minutesSALT LAKE CITY — The Church of Jesus Christ of Latter-day Saints and the nonprofit Un Kilo de Ayuda are working together on a project to combat child malnutrition in rural Mexican communities.\nUn Kilo de Ayuda will deliver nutritional packages geared to children under the age of 5 because of a donation from the Church of Jesus Christ, according to a release.\nMore than 43,000 people, including 23,000 children and 20,000 mothers or caregivers, will benefit from the donation.\nThe donation to Un Kilo de Ayuda also includes equipment that can be used to detect anemia.\nThis is another instance of the Relief Society of the Church of Jesus Christ's initiative to combat child malnutrition and improve access to nutrition and educational materials for both women and children around the world."}, {"id": "0e18ed6f-4679-450e-9894-8c465ab2aee8", "title": "China , Laos , Myanmar , Thailand agree to step up joint efforts to combat cross - border crimes", "date": "2024-08-17 06:30", "url": "http://www.china.org.cn/world/2024-08/17/content_117372584.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器The Informal Discussion Between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug. 16, 2024.\n[Photo/Xinhua]China, Laos, Myanmar and Thailand discussed cross-border crimes Friday at the Informal Discussion Between the Foreign Ministers of China, Laos, Myanmar and Thailand in Chiang Mai, Thailand.\nOnly when countries in the region step up their joint efforts to combat these crimes can the high incidence of criminal offenses be effectively reversed, said Wang.\nHe said the China-proposed Global Security Initiative has received positive responses from countries including Laos, Myanmar and Thailand.\nTaking the Global Security Initiative as a guide, China is willing to work with other countries to increase joint efforts to crack down on cross-border crimes and safeguard the tranquility of their homelands."}, {"id": "aa217bc8-37ff-437f-a589-67da224eb50a", "title": "Kyle Walker living in  Man City - owned flat  after being kicked out by wife", "date": "2024-08-17 08:45", "url": "https://www.standard.co.uk/showbiz/manchester-city-affair-kyle-walker-annie-kilner-lauryn-goodman-wife-b1177024.html", "domain": "standard.co.uk", "domain_classification": "Unknown", "message": "* FIRST NAME* LAST NAME* EMAIL Your email address* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906* Required fieldsI would like to be emailed about offers, events and updates from Evening Standard.\nRead our privacy noticeCREATE ACCOUNTI'LL TRY LATERAlready have an account?\nSIGN INBy clicking Create Account you confirm that your data has been entered correctly and you have read and agree to our Terms of use , Cookie policy and Privacy policy .\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."}, {"id": "d31d519b-fdee-417f-b639-e70e6f431274", "title": "Newsom condemns prosecutor ballot measure as he signs anti - theft laws", "date": "2024-08-17 00:15", "url": "https://www.yahoo.com/news/newsom-condemns-prosecutors-ballot-measure-234927298.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "He described the ballot measure as a return to the 1980s tough-on-crime era and contended that the legislative package actually addresses the retail theft issue.\nShe signaled that her group, which is still officially supporting Prop 36, will likely reconsider its position.\nMichelin told POLITICO afterward that the association’s board could vote to remove its support for Prop 36 in the coming weeks.\nMahan held a press conference outside San Jose City Hall on Friday to respond to Newsom’s public statements.\nHe argued Prop 36 would give courts a crucial tool to compel more repeat offenders into addiction treatment, though he also supported the anti-theft bills Newsom signed."}, {"id": "6ae52961-3430-41ed-8edf-d9ca3096aa75", "title": "AI deepfake : San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 04:15", "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/san-francisco-goes-after-websites-that-make-ai-deepfake-nudes-of-women-and-girls/articleshow/112580949.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"These images are used to bully, humiliate and threaten women and girls,\" he said in an interview with The Associated Press.\n\"And the impact on the victims has been devastating on their reputation, mental health, loss of autonomy, and in some instances, causing some to become suicidal.\nThe is not naming the specific apps being sued in order to not promote them.\n\"And we will certainly utilize our powers in the course of this litigation.\n\"Many of the tools are being used to create realistic fakes that \"nudify\" photos of clothed adult women, including celebrities, without their consent."}, {"id": "c213924b-9a8b-44f3-882f-c3952a0165f2", "title": "San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 02:00", "url": "https://abcnews.go.com/Business/wireStory/san-francisco-after-websites-make-ai-deepfake-nudes-112905802", "domain": "abcnews.go.com", "domain_classification": "International", "message": "“These images are used to bully, humiliate and threaten women and girls,\" he said in an interview with The Associated Press.\nBut it can be hard to determine who runs the apps, which are unavailable in phone app stores but still easily found on the internet.\nThe AP is not naming the specific apps being sued in order to not promote them.\nShe applauded San Francisco's action but said more efforts are needed, including from bigger companies like California-based Meta Platforms and its subsidiary WhatsApp, which was used to circulate the images in Spain.\nOrganizations that have been tracking the growth of AI-generated child sexual abuse material will be closely following the San Francisco case."}, {"id": "3a155bfb-d910-452c-b2ca-8e632d5dfaf1", "title": "Boys are using AI to deepfake nude photos - a lawsuit could stop it", "date": "2024-08-17 00:45", "url": "https://fortune.com/2024/08/16/ai-nude-deepfakes-boys-social-media-classmates-school/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Nearly a year after AI-generated nude images of high school girls upended a community in southern Spain, a juvenile court this summer sentenced 15 of their classmates to a year of probation.\n“These images are used to bully, humiliate and threaten women and girls,” he said in an interview with The Associated Press.\nThe AP is not naming the specific apps being sued in order to not promote them.\nBut they’ve also popped up in schools around the world, from Australia to Beverly Hills in California, typically with boys creating the images of female classmates that then circulate widely through social media.\nOrganizations that have been tracking the growth of AI-generated child sexual abuse material will be closely following the San Francisco case."}, {"id": "e6644cd0-932e-4885-ba68-289a0f8c7b6d", "title": "Spark Bird - This American Life", "date": "2024-08-17 05:00", "url": "https://www.thisamericanlife.org/754/spark-bird", "domain": "thisamericanlife.org", "domain_classification": "Unknown", "message": "Writer Tobias Wolff reads his story \"Bullet in the Brain\" from his collection of stories The Night in Question, about a bank robbery and a man who's shot, and what he thinks about before he dies."}, {"id": "11544108-d686-4989-afa2-acf0877ffca9", "title": "Govt urged to take steps to keep print media alive", "date": "2024-08-17 00:45", "url": "https://www.thestar.com.my/news/nation/2024/08/17/govt-urged-to-take-steps-to-keep-print-media-alive", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KUALA LUMPUR: The government has been urged to take proactive measures to ensure print media remains relevant amid the proliferation of online media, even suggesting that ministries, government agencies and departments be required to purchase advertising space in newspapers.\n“This could help boost newspaper sales and revitalise print newspaper subscriptions in the country,” he told Bernama.\nHe added that print media also serves as a reference for readers seeking verified news in a physical form.\nHe also urged local media companies with print platforms to intensify their efforts and be more creative in attracting more advertising from private companies, government agencies and non-governmental organisations.\nShe added that this would be a win-win effort to foster the reading culture among the people, while also boosting demand for print media."}, {"id": "37698ecc-2389-4b25-84e7-95f2e5f3979d", "title": "San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 02:45", "url": "https://www.wfmz.com/business/san-francisco-goes-after-websites-that-make-ai-deepfake-nudes-of-women-and-girls/article_3681f5f3-ccc1-555d-b120-f751be500fc9.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "San Francisco goes after websites that make AI deepfake nudes of women and girlsNearly a year after AI-generated nude images of high school girls upended a community in southern Spain, a juvenile court this summer sentenced 15 of their classmates to a year of probation"}, {"id": "6b93a564-8366-4e85-b8df-39d90ad78345", "title": "Opinion : Novelist and professor Saikat Majumdar on humanities education in a post - truth world", "date": "2024-08-17 06:45", "url": "https://scroll.in/article/1072043/opinion-novelist-and-professor-saikat-majumdar-on-humanities-education-in-a-post-truth-world", "domain": "scroll.in", "domain_classification": "Unknown", "message": "The bitterest battles in the world today are being fought in the humanities and the imaginative social sciences.\nA rational appraisal of reality shaped many things that we take for granted today – from positivism in the social sciences to realism and interiority in literature.\nBoth events were a backlash against the liberal world order, and its faith in reason, knowledge, and expertise.\nEverything that is in the domain of the humanities and the softer social sciences.\nAnd the most urgent versions of this war are being fought in the spaces of the humanities and the soft social sciences."}, {"id": "0ba95bb8-215e-4434-950d-27de48fbc670", "title": "Married At First Sight expert Mel Schilling shares major health update amid cancer battle", "date": "2024-08-17 06:45", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13752453/Married-Sight-expert-Mel-Schilling-shares-update-cancer.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Married At First Sight relationship expert Mel Schilling took to Instagram on Friday to share a major health update amid her battle with colon cancer.\nSchilling looked absolutely radiant in the precious photo, which showed her looking healthy and upbeat while posing up a storm.\nIt comes after Mel told of the agony she was left in before her cancer diagnosis.\nMAFS expert Mel Schilling (pictured) took to Instagram on Friday to share a major health update, amid her battle with colon cancer.\nThe reality TV host revealed her shock health battle in December and underwent colon surgery just before the end of the year."}, {"id": "6da1dbf4-2657-4ec6-a504-6eafda3b2853", "title": "Harris vs . Trump : Tax Cuts Take Spotlight in Battle to Win Swing State Votes", "date": "2024-08-17 00:45", "url": "https://www.bloomberg.com/news/articles/2024-08-13/harris-vs-trump-tax-cuts-take-spotlight-in-battle-to-win-swing-state-votes", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "0ff43884-e722-4a0a-905c-6182f0346777", "title": "Dutton strident Gaza digression drowns out Liberal epic election blunder in NSW | Karen Middleton", "date": "2024-08-17 01:15", "url": "https://www.theguardian.com/australia-news/article/2024/aug/17/duttons-strident-gaza-digression-drowns-out-liberals-epic-election-blunder-in-nsw-ntwnfb", "domain": "theguardian.com", "domain_classification": "International", "message": "In that day’s question time, Dutton followed through, making it the subject of every opposition question, drowning out all else.\nAt the last NSW local government elections, Liberal candidates could lodge their own forms but this time the party had decided to do it centrally and online.\nIt’s understood a relatively junior party staffer called the NSW president, Don Harwin, on Tuesday night with the bad news.\nIt’s not clear exactly when the federal Liberal party was alerted but its senior figures have since made their extreme displeasure known.\nBoth incidents saw federal Liberal candidates affected by the NSW brawls and administrative failures."}, {"id": "5e37132b-6508-4a02-b50d-9dc8099fdae7", "title": "San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 07:00", "url": "https://www.thehindu.com/sci-tech/technology/san-francisco-goes-after-websites-that-make-ai-deepfake-nudes-of-women-and-girls/article68535478.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Nearly a year after AI-generated nude images of high school girls upended a community in southern Spain, a juvenile court this summer sentenced 15 of their classmates to a year of probation.\n“The proliferation of these images has exploited a shocking number of women and girls across the globe,” said David Chiu, the elected city attorney of San Francisco who brought the case against a group of widely visited websites based in Estonia, Serbia, the United Kingdom and elsewhere.\n(Unravel the complexities of our digital world on The Interface podcast, where business leaders and scientists share insights that shape tomorrow’s innovation.\n“These images are used to bully, humiliate and threaten women and girls,\" he said in an interview with The Associated Press.\nOrganisations that have been tracking the growth of AI-generated child sexual abuse material will be closely following the San Francisco case."}, {"id": "51603220-b300-4daa-a86f-fea5a2d17a6a", "title": "Total Dramarama - Pop | TV Guide", "date": "2024-08-17 06:30", "url": "https://www.tvguide.co.uk/schedule/89fd4149-63d0-5c17-983a-d3bd2fa236a0/total-dramarama", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Total DramaramaPop 12:30 PM to 12:45 PM Saturday 17 August Share Add toCalendar +WaterHose-Five Season 3 Episode 13It's the hottest day of the year and a broken air conditioner leads to a water battle of epic proportions to determine who controls the garden hoseTotal Dramarama airs on Pop at 12:30 PM, Saturday 17 August ."}, {"id": "78d93dd6-6c83-438a-b639-67cd88afd4b6", "title": "Tom Aspinall Fight Lab - TNT Sports 1 HD", "date": "2024-08-17 09:30", "url": "https://www.tvguide.co.uk/schedule/c5d2a1da-ee52-5c8c-ba0e-5aef0365834c/tom-aspinalls-fight-lab", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Tom Aspinall's Fight LabTNT Sports 1 HD 3:15 PM to 4:15 PM Saturday 17 August Share Add toCalendar +UFC 305 Season 2024 Episode 6 S SubtitlesA review of Tom's title defence at UFC 304, with special guest Ugo Monye, and a preview of the battle between Israel Adesanya and Dricus Du Plessis at UFC 305Tom Aspinall's Fight Lab airs on TNT Sports 1 HD at 3:15 PM, Saturday 17 August .\n(Subtitles.)"}, {"id": "ef20c78f-5a34-45bf-be0e-52006275fa6f", "title": "Am I The Only One Who Thinks There Are Too Many Soulslikes Coming Out These Days ? ", "date": "2024-08-17 08:00", "url": "https://n4g.com/news/2616518/am-i-the-only-one-who-thinks-there-are-too-many-soulslikes-coming-out-these-days", "domain": "n4g.com", "domain_classification": "Unknown", "message": "40°Am I The Only One Who Thinks There Are Too Many Soulslikes Coming Out These Days?\nHanzala from eXputer: \"Recently, Soulslikes and Soulslike mechanics in games have become a little too frequent, to the point that I wish for something different.\""}, {"id": "5d45470c-7b8d-44f1-a92c-5c788cbc8d81", "title": "Friday ( pt 1 of 2 ): Today Playhouse is  Animal Control  | 96 . 3 ROV", "date": "2024-08-17 01:00", "url": "https://rovrocks.iheart.com/featured/john-boy-and-billy/content/2024-08-16-1119-the-john-boy-billy-big-sh-friday-pt-1-of-2-todays-playhouse-is-animal-/", "domain": "rovrocks.iheart.com", "domain_classification": "Unknown", "message": "Friday (pt 1 of 2): On today’s Late Riser’s Podcast, TGIF!..\n- JD’s 24-Hour Stores are geared up for back to school.. - It’s Randy’s birthday so it’s roasting time!\n- first up his Chipmunk story.. - then a verbal battle with British Comedian Scott Angrave.. - We’ll jump into the playhouse for a new script called “Animal Control”.. - We’ll talk sports with Tom Sorenson.. - and we’ll finish up with how romantic Randy is..℗®© 2024 John Boy & Billy, Inc.See omnystudio.com/listener for privacy information."}, {"id": "a9c69d1b-dd98-4590-bb79-d9cd982ef829", "title": "Friday ( pt 2 of 2 ): Today Playhouse is  Animal Control  | 96 . 3 ROV", "date": "2024-08-17 01:00", "url": "https://rovrocks.iheart.com/featured/john-boy-and-billy/content/2024-08-16-1119-the-john-boy-billy-big-sh-friday-pt-2-of-2-todays-playhouse-is-animal-/", "domain": "rovrocks.iheart.com", "domain_classification": "Unknown", "message": "Friday (pt 2 of 2): On today’s Late Riser’s Podcast, TGIF!..\n- JD’s 24-Hour Stores are geared up for back to school.. - It’s Randy’s birthday so it’s roasting time!\n- first up his Chipmunk story.. - then a verbal battle with British Comedian Scott Angrave.. - We’ll jump into the playhouse for a new script called “Animal Control”.. - We’ll talk sports with Tom Sorenson.. - and we’ll finish up with how romantic Randy is..℗®© 2024 John Boy & Billy, Inc.See omnystudio.com/listener for privacy information."}]