[{"id": "c476433c-a835-45c5-9df6-47fc46fa7f08", "title": "Trudeau and Ford condemn shooting attack on Jewish school", "date": "2024-05-30 19:00", "url": "https://www.wellandtribune.ca/politics/provincial/they-need-to-be-thrown-in-jail-doug-ford-and-justin-trudeau-condemn-shooting-attack/article_537a2975-0a30-5cef-b42e-2eaa407674ad.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "14a2766e-8d61-4b7a-a0af-bf1e73631e02", "title": "Trudeau and Ford condemn shooting attack on Jewish school", "date": "2024-05-30 19:00", "url": "https://www.niagarafallsreview.ca/politics/provincial/they-need-to-be-thrown-in-jail-doug-ford-and-justin-trudeau-condemn-shooting-attack/article_d60598af-d789-5ef9-a381-d742e0f8813a.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "0dff90ee-5a49-41b3-8c06-94fd6983a1af", "title": "Doug Ford suggests immigrants behind Jewish school shooting – Winnipeg Free Press", "date": "2024-05-30 16:15", "url": "https://www.winnipegfreepress.com/uncategorized/2024/05/30/doug-ford-suggests-immigrants-behind-jewish-school-shooting", "message": "TORONTO – Ontario Premier Doug Ford suggested immigrants are to blame for the shooting of an empty Jewish school in Toronto over the weekend, despite police saying they have little information on the suspects.\nOntario Premier Doug Ford has suggested immigrants are to blame for the shooting of an empty Jewish school in Toronto over the weekend despite police saying they have no information on the suspects.\nPolice said its hate crime unit is involved in the school shooting investigation, but that it is too early to say if the shooting was motivated by hate or antisemitism.\nFord said the province will throw “every single resource” at fighting antisemitism and all other forms of hate.\n“He hasn’t learned anything since his comments about Umar Zameer, and how much that affected that man and that family,” Fraser said."}, {"id": "efa14f11-5d4b-421c-90bd-350de620ac24", "title": "Join marchers in Celebrate Israel Parade in NYC take a stand for freedom", "date": "2024-05-30 21:30", "url": "https://nypost.com/2024/05/30/opinion/join-marchers-in-celebrate-israel-parade-in-nyc-take-a-stand-for-freedom/", "message": "Each year on a late spring Sunday, tens of thousands of people from all walks of life gather in New York to march in the Celebrate Israel Parade.\nThe array of elected officials and cultural icons who’ve marched to celebrate Israel is truly remarkable to behold.\nTragically, this is the narrative of Jewish and Israeli history: a constant onslaught of intimidation, manipulation and existential threats.\nHowever, the Celebrate Israel Parade is not just a celebration of good times, but a powerful statement of solidarity in darker ones.\nRecent polling affirms that four out of five Americans continue to support Israel in its war to eliminate Hamas and bring home the hostages."}, {"id": "17c70f3b-2729-4599-a0c6-8b35a442fd37", "title": "  Never again  urgent promise of Yom HaShoah commemoration : Larchmont Chronicle", "date": "2024-05-30 18:00", "url": "https://larchmontchronicle.com/never-again-urgent-promise-of-yom-hashoah-commemoration/", "message": "Even when innocent people die in the process, they are not innocent victims of Israeli aggression.\nThe latter program promotes music by composers whose careers were affected by the Nazis.\nOne of them was 96-year-old Mary Bauer, who was born in Hungary and survived Auschwitz-Birkenau death camp, the Death March and Ravensbrück concentration camp.\nAfter the war, when Bauer reached the United States, she remembered what people said to her in the camps.\nMuseums like this must stand as reminders of what happens when we hate each other.”Category: Real Estate"}, {"id": "12a02a81-4e72-42b6-be68-7dd6f7349da7", "title": "Denial , bewilderment , and the American Dream", "date": "2024-05-30 10:30", "url": "http://www.israelnationalnews.com/news/390801", "message": "As a result American Jews are questioning many former assumptions and uncontested givens that have been valid for many years.\nThe American Jews that I met were equally represented by the full spectrum of Orthodox-traditional-reform Jews.\nThose in denial were mainly found among the progressive Jews who seemed unable and unwilling to take off their progressive life jackets, holding on with dear life.\nThey admit and are aware of these Muslim mobs who freely vent their rage against the Jews, Israel, and anyone else who stands in their way.\nMaybe, this is where it should begin for all American Jews, making it not “cool” to express Jew hatred and demanding accountability for those that abuse their first amendment rights."}, {"id": "d935febe-0be3-4cb8-aaeb-b81f8730a655", "title": "Jewish American Heritage Month : 87 - year - old Meyerland woman Edith Jucker shares her Holocaust survival story", "date": "2024-05-30 01:30", "url": "https://abc13.com/post/jewish-american-heritage-month-87-year-meyerland-woman/14888332/", "message": "'My world changed overnight': 87-year-old Edith Jucker shares her Holocaust survival storyHOUSTON, Texas (KTRK) -- Edith Jucker was only 2 years old when the Nazis invaded Poland, triggering the start of World War II on Sept. 1, 1939.\nJucker and her mom stayed there for three years in what she described as deplorable conditions.\nJucker and her mother stayed at a temporary shelter until they could find an apartment.\n\"That's proof that Hitler cannot win and only love can survive the hate,\" Jucker said.\nNot just to Jewish people, but to any human beings in the world.\""}, {"id": "1f111800-c5eb-4162-8d00-d3cedb4515db", "title": "In conversation with Oxford Action for Palestine ( OA4P ) ", "date": "2024-05-30 05:00", "url": "https://www.cherwell.org/2024/05/29/an-interview-with-oxford-action-for-palestine-oa4p/", "message": "A member of the Oxford Action for Palestine (OA4P) press team spoke exclusively to Cherwell at the protest outside the Sheldonian Theatre on Tuesday afternoon.\nThe interview covered topics including OA4P’s response to last week’s arrests, their demands for the University, and their future plans.\nWhen asked about the organisation’s future plans, the spokesperson told Cherwell OA4P demands that: “the Vice-Chancellor meets our demands and meets us for negotiations.\nThat is our number one priority.” They explained that future actions by the group will “all depend on her [the Vice-Chancellor’s] complicity and her silence…if she responds, we’re willing to meet with her.”The spokesperson continued: “OA4P is not just the encampment…we’re not stopping until we meet,” explaining that the organisation has long-term plans in place “because we do want our demands to be met in part of our tenures here.”Regarding the University’s response to their protests, the spokesperson told Cherwell: “It’s very clear that we have not been satisfied with any of the responses from the University, particularly the University calling the police on our protestors last week.” Speaking more directly in relation to the arrests of 16 students last week after a sit-in in University offices, they described the police’s response as “brutalisation”, calling the University “ignorant, complicit, and scapegoating [the protestors].” The spokesperson said that this response has “only fueled the fire in terms of how we [OA4P] act [going] forward.”Focusing on the reasons for the protest this afternoon, the spokesperson described how “there are no universities left in Gaza while congregation meets… our aim today is to support the faculty members who are bravely standing up against the genocide in Gaza.” They continued: “a lot of the questions being asked in the congregation has to do with divestment, not only in the genocide in Gaza, but largely in illgeal arms manufacturing”, describing the event as “a continuation against the genocide in Gaza.”In response to the arrests of OA4P protestors during their occupation of the Oxford University offices last week, they said that “protestors did not go into a peaceful sit-in expecting to be arrested.” However, she acknowledged the risks some protestors face, saying: “we have continuously advocated for people to assess their own risk levels, and whilst doing so acknowledge that we are the privileged ones, and that we are willing to use our time and resources if it means that we can help alleviate the genocide in Gaza.”The spokesperson declined to comment on the allegations that some members of the encampment had used antisemitic language towards some Jewish Oxford Students, in relation to the St Hugh’s JCR Vice-President’s resignation a few days prior.\nHowever, another member of OA4Ps press team pointed out that an open letter was sent by “senior Jewish professors” at the University, describing a “disapproval in the way Irene Tracey has been weaponising antisemitism against the student protests”."}, {"id": "ac0f29b1-98b5-4270-8554-9e91f584f19f", "title": "Claudia Sheinbaum widens lead in Mexican presidential polls", "date": "2024-05-30 19:45", "url": "https://www.jpost.com/international/article-804421", "message": "Claudia Sheinbaum vaulted to the top of the Mexican presidential polls last year when she was selected as the candidate for the left-wing Morena party, which has been led by the country’s popular outgoing president, Andrés Manuel López Obrador.\nA former mayor of Mexico City, Sheinbaum is a respected scientist and political liberal who has taken credit for beating back crime.\nSheinbaum’s Jewish background has barely come up on the campaign trail.\n“What has been said about Claudia Sheinbaum on some occasions is very close to antisemitism,” Juan Pablo Pardo-Guerra, a Mexican sociologist at the University of California San Diego, told JTA last year.\n(The country is home to an estimated 30,000 Palestinians; pro-Palestinian protesters set fire outside the Israeli embassy in Mexico City this week.)"}, {"id": "441531df-5aa5-4364-9854-7c8371677c5f", "title": "Iran Hires Swedish Criminal Gangs for Proxy War With Israel in Scandinavia , Intelligence Officials Say", "date": "2024-05-30 23:15", "url": "https://www.nysun.com/article/iran-hires-swedish-criminal-gangs-for-proxy-war-with-israel-in-scandinavia-intelligence-officials-say", "message": "The Swedish security agency accuses the Iranian regime of using criminal networks in Sweden to carry out violence against Israeli targets.\nSweden’s national intelligence agency is accusing Iran of recruiting Swedish gang members to extend its terror regime against Israel into Scandinavia.\nThe two gangs at the helm of the gang violence, Foxtrot and Rumba, were initially believed to be involved in the drug business.\nHowever, during the press conference, Mr. Stenling assured Israelis and Jews living in Sweden that they would be well protected.\n“We are working hard to ensure a secure environment for everyone in Sweden, including Israeli and Jewish interests in Sweden,” he said."}, {"id": "b42fc832-b559-4afa-bf96-2e609bfb0d92", "title": "TAU awards honorary degree to 1st Jewish woman appointed to Canada Sup - Israel News", "date": "2024-05-30 13:15", "url": "https://www.jpost.com/israel-news/article-804381", "message": "Credit: Tel Aviv UniversityThe Hon.\nRosalie Silberman Abella, the first Jewish woman appointed to the Supreme Court of Canada, will also be honored.\nThe field of law and economics will see Prof. Lucian Bebchuk recognized for his influential scholarship and contributions to Israeli legislation and policymaking.\nThese honorary degrees are a testament to Tel Aviv University's commitment to recognizing global leaders who excel in their fields and positively impact society.\nThis article was written in cooperation with Tel Aviv University."}, {"id": "c6eb8b31-340d-4175-9f06-dbf1335502a5", "title": "Column : My college graduation was anything but  normal  this year – Daily News", "date": "2024-05-30 21:45", "url": "https://www.dailynews.com/2024/05/30/column-my-college-graduation-was-anything-but-normal-this-year/", "message": "Column: My college graduation was anything but ‘normal’ this year"}, {"id": "ca95cfdd-5ca5-4e3b-9eb3-fb832724f5ef", "title": "What did Diane Abbott say ? Inside her controversial Labour career | united kingdom News", "date": "2024-05-30 16:15", "url": "https://metro.co.uk/2024/05/30/diane-abbott-say-inside-controversial-labour-career-20928607/", "message": "Suspended from the Labour Party 13 months ago for a letter to The Observer described as downplaying antisemitism, Abbott was finally readmitted this week.\nWho is Diane Abbott?\nDiane Abbott arriving at a rally by her supporters in Hackney (Picture: Guy Smallman/Getty Images)Abbott’s fall from grace has been rather swift.\nDiane Abbott is the longest serving Black MP in British history (Picture: Chris J Ratcliffe/Getty Images)But taxi drivers hit back at Abbott’s claim.\nSteve McNamara, a spokesman for the Licensed Taxi Drivers Association, branded it ‘a typically silly comment by Diane Abbott’."}, {"id": "96391528-b4a5-4ae3-ac8e-4d4557926f4a", "title": "Big stars come out for Biden – but much of Hollywood wrestles with 2024 endorsements in a polarized world", "date": "2024-05-30 09:45", "url": "https://us.cnn.com/2024/05/30/politics/celebrity-endorsements-2024-election/", "message": "In the meantime, Biden campaign officials are in discussions behind the scenes to prepare for those rollouts, stressing that they carry more influence closer to Election Day.\nThis year, getting younger voters out to the polls is crucial – and they’re top of mind for the Biden campaign.\n“It will be the usual suspects” getting involved in the political process, one celebrity publicist told CNN.\n“People know who Biden is,” Adrienne Elrod, a senior advisor and spokesperson for the Biden campaign told CNN.\n“Celebs feel, more than ever, that the perceived cost is higher,” a political strategist who advises Hollywood stars added."}, {"id": "e2a28810-fc16-44ca-a740-6c6ad9047890", "title": "Keir Starmer is told to show Diane Abbott some  respect  amid Labour civil war over  shambolic  handling of race - row - as 37 - year veteran MP defies leader and says she will stand and not be  intimidated  ", "date": "2024-05-30 02:15", "url": "https://www.dailymail.co.uk/news/article-13474159/Diane-Abbott-Sir-Keir-Starmer-Labour-civil-war.html", "message": "The Labour Party was embroiled in a civil war last night as Sir Keir Starmer was warned he must show Diane Abbott 'respect' amid the 'shambolic' handling of the row.\nAsked whether he believed Sir Keir was trying to purge the left of the Labour Party, he said: 'It looks like it.'\nMr Starmer is now facing anger from even his allies at Labour's treatment of Ms Abbott.\nMr Starmer later told reporters that 'no decision has been taken to bar Ms Abbott'.\nHis playful trip came as Sir Keir continued his own campaign for No 10 by hosting a Q&A session."}, {"id": "10de2886-0d3f-4409-b702-4985a250f5f8", "title": "Big stars come out for Biden – but much of Hollywood wrestles with 2024 endorsements in a polarized world", "date": "2024-05-30 11:15", "url": "https://abc17news.com/politics/national-politics/cnn-us-politics/2024/05/30/big-stars-come-out-for-biden-but-much-of-hollywood-wrestles-with-2024-endorsements-in-a-polarized-world/", "message": "In the meantime, Biden campaign officials are in discussions behind the scenes to prepare for those rollouts, stressing that they carry more influence closer to Election Day.\nThis year, getting younger voters out to the polls is crucial – and they’re top of mind for the Biden campaign.\n“It will be the usual suspects” getting involved in the political process, one celebrity publicist told CNN.\n“People know who Biden is,” Adrienne Elrod, a senior advisor and spokesperson for the Biden campaign told CNN.\n“Celebs feel, more than ever, that the perceived cost is higher,” a political strategist who advises Hollywood stars added."}]