[{"id": "7cee68e7-8282-4c9c-afb5-156b5490fd16", "title": "Diplomacy takes center stage as Iran holds off retaliation against Israel", "date": "2024-08-16 03:30", "url": "https://www.cbsnews.com/news/diplomacy-takes-center-stage-as-iran-holds-off-retaliation-against-israel/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "U.S. assessments are that Iran will not seek to disrupt ongoing cease-fire negotiations in Doha aimed at ending the Hamas-Israel war.\nThose technical talks could stretch into the weekend, but it is unclear how long Iran and its proxies may hold off.\nA U.S. official confirmed to CBS News that Israel was responsible for Haniyeh's killing, though Israel has not publicly acknowledged it.\nA U.K. official told CBS News, \"Our core focus is diplomatic efforts and de-escalation.\nA French official also told CBS News, \"We've been calling on all actors in the region to de-escalate."}, {"id": "6bc88dc2-31b8-4ffe-901b-2c17afd19b37", "title": "Washington bias a major cause of rising tensions in the Middle East - united states ", "date": "2024-08-16 01:30", "url": "http://usa.chinadaily.com.cn/a/202408/16/WS66be8be1a3104e74fddba372.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "This photo taken on Oct 11, 2023 shows the US Capitol building in Washington, D.C., the United States.\nBut it's time these Western leaders accepted that their double standard and hypocrisy are the major cause of the escalating hostilities and tensions in the Middle East.\nWhile most of the UN Security Council members condemned Haniyeh's assassination, the representatives of the US and the United Kingdom exposed their bias against Iran by blaming Teheran for the killing.\nOn Tuesday, US Ambassador to the UN Linda Thomas-Greenfield told the Security Council that Washington aims \"to turn the temperature down\" in the Middle East.\nBut she should know that the US' biased policy in the Middle East, its hypocrisy and double standard are a major stumbling block to peace and stability in the region."}, {"id": "8e8040d3-efc8-4d5e-a24f-d3734f06f706", "title": "Washington bias a major cause of rising tensions in the Middle East", "date": "2024-08-16 01:45", "url": "http://africa.chinadaily.com.cn/a/202408/16/WS66be8be1a3104e74fddba372.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "This photo taken on Oct 11, 2023 shows the US Capitol building in Washington, D.C., the United States.\nBut it's time these Western leaders accepted that their double standard and hypocrisy are the major cause of the escalating hostilities and tensions in the Middle East.\nWhile most of the UN Security Council members condemned Haniyeh's assassination, the representatives of the US and the United Kingdom exposed their bias against Iran by blaming Teheran for the killing.\nOn Tuesday, US Ambassador to the UN Linda Thomas-Greenfield told the Security Council that Washington aims \"to turn the temperature down\" in the Middle East.\nBut she should know that the US' biased policy in the Middle East, its hypocrisy and double standard are a major stumbling block to peace and stability in the region."}, {"id": "c7654f8b-8b02-48fd-81cd-c62baf296b33", "title": "Casualty Toll Of Russian Attack On Enterprise In Kharkiv Region Rises", "date": "2024-08-16 01:30", "url": "https://menafn.com/1108560797/Casualty-Toll-Of-Russian-Attack-On-Enterprise-In-Kharkiv-Region-Rises", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The number those as a result of a Russian on a civil enterprise in the village of Prylokotne of the Kupiansk district in Kharkiv region has increased to six.\nThat's according to the press service of the Kharkiv Regional Prosecutor's Office , Ukrinform reports.\n\"The number of injured has increased to six.\nA 47-year-old man - also an employee of the enterprise that was hit by the enemy airstrike - sought medical assistance,\" the update reads.\nRussian strike kills two in, Donetsk regionAs Ukrinform reported earlier, on August 15, at around 15:20, the Russian invasion forces launched airstrikes on the village of Prykolotne in the Kupiansk district, hitting a civil enterprise."}, {"id": "d642a73d-4311-4708-a9ab-05b47a653f0c", "title": "", "date": "2024-08-16 03:45", "url": "https://www.israelnationalnews.com/news/394709", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "White House National Security Council spokesman John Kirby told CNN on Thursday that US intelligence indicates that Iran has not backed down from its threat to attack Israel.\nThere have been conflicting reports as to whether Tehran will attack Israel in retaliation for the elimination of Hamas political leader Ismail Haniyeh on July 31.\nOn Tuesday, three senior Iranian officials told Reuters that Iran could delay or cancel its planned attack against Israel if this week's ceasefire talks between Israel and Hamas are successful.\nLater in the day, US President Joe Biden said that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week.\n“That’s my expectation,” Biden told reporters when asked if he believes Iran will not strike if a deal is signed."}, {"id": "08bcc29c-4773-433a-984d-5a2204a4f015", "title": "Ukraine surprise advance into Russia a dilemma for Biden", "date": "2024-08-16 00:30", "url": "https://www.bbc.co.uk/news/articles/cql365ld002o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The same goes for White House policy on Ukrainian attacks into Russian territory.\nFor many months President Zelensky pleaded for permission to strike at military targets in Russia that facilitated attacks into Ukraine.\n\"We're not authorising strikes 200 miles into Russia and we're not authorising strikes on Moscow, on the Kremlin.\"\nSince then, Mr Zelensky, along with some European allies and some Democrats in Washington, have urged the US to further “untie” Ukraine’s hands.\nThe words he used in June suggested that Ukraine’s limits were “in proximity to the border”."}, {"id": "cda5162a-5823-499b-a128-eb5fc80ebb29", "title": "A closer look at Hezbollah tunnel threat", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/a-closer-look-at-hezbollahs-tunnel-threat", "domain": "10news.com", "domain_classification": "Unknown", "message": "Some Israeli analysts say Hezbollah's tunnel network is even more extensive than the one built by Hamas.\nThis could prove significant because it could help Hezbollah maintain resupply routes from Iraq and Syria in the event of an all-out war.\nThe tunnel network would make it very difficult to preemptively attack Hezbollah's stock of rockets and missiles, which is far larger than that of Hamas.\nIt has spent much of the last two decades preparing for a potential war, with assistance from Iran, Syria and Russia.\n\"We're not counting on anything when it comes to Iran and the possibility of some sort of an attack,\" Kirby said."}, {"id": "2057636c-1aa0-4a31-83fa-55d2cbc639a4", "title": "Russian attack on Sumy Oblast kills 1 , injures 3", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/russian-attack-sumy-oblast-kills-235000089.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked 11 communities in Sumy Oblast on Aug. 15, killing one and injuring three people, the Sumy Oblast Military Administration reported.\nThe security situation in Sumy Oblast became more tense with the start of Ukraine's cross-border incursion into neighboring Kursk Oblast in Russia, which began on Aug. 6.\nSumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts.\nCivilians in Sumy Oblast within 20 kilometers (12 miles) of the border with Kursk Oblast are now subject to restrictions on movement due to increasing Russian attacks, according to the General Staff of Ukraine's Armed Forces.\nRead also: Russia partially deploying its forces to Kursk Oblast, exact number is unknown, White House saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "cd45c930-69b9-41b2-98de-b2c6aeb1067b", "title": "Fed - Up With Games , Hamas Reportedly Sits Out Talks", "date": "2024-08-16 03:15", "url": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out Talks'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out TalksSputnik InternationalDan Kovalik, a human rights activist and author joined Political Misfits on Thursday to discuss the ongoing tensions in the Middle East.\n2024-08-16T01:00+00002024-08-16T01:00+00002024-08-16T01:01+0000analysismiddle eastbenjamin netanyahujoe bidenisraelhamasirangenocidewar crimesethnic cleansinghttps://cdn1.img.sputnikglobe.com/img/07e8/08/10/1119786720_0:170:3072:1898_1920x0_80_0_0_27452c654fabdad4d9ba27d0aacfa8a0.jpgCeasefire talks in the Middle East have resumed with the US, Israel, Egypt and Qatar reportedly making an appearance without representation being made from Hamas.\nSo, obviously, the people of Gaza need a ceasefire,” Kovalik explained.\nAccording to one report, the practice became so common amongst Israeli soldiers that it could be considered a “protocol”.\nUS President Joe Biden acknowledged the influence that the ceasefire deal will have on Iran’s threats and admitted that the process to a ceasefire deal is “getting harder” but said he is “not giving up”.“Again, Iran acts in very constrained ways."}, {"id": "2d565301-535b-49e2-998b-5b14da9fdccf", "title": "Ex - Israeli min . mocks Netanyahu , urges him to  be brave  ", "date": "2024-08-16 00:30", "url": "https://www.dailysabah.com/world/mid-east/ex-israeli-min-mocks-netanyahu-urges-him-to-be-brave", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "A new round of Gaza cease-fire and prisoner swap talks began Thursday in the Qatari capital Doha to reach an agreement between Israel and Hamas.\nHamas said on Wednesday that it will participate in the upcoming Gaza cease-fire and hostage swap talks if Israel provides a clear commitment to implement U.S. President Joe Biden's proposal.\nBut mediation efforts have been stalled due to Netanyahu’s refusal to meet Hamas’ demands to stop the war.\nFlouting a U.N. Security Council resolution demanding an immediate cease-fire, Israel has faced international condemnation amid its continued brutal offensive on Gaza since an Oct. 7, 2023 attack by Hamas.\nOver 10 months into the Israeli onslaught, vast tracts of Gaza lie in ruins amid a crippling blockade of food, clean water and medicine."}, {"id": "6bf09d56-717b-47c2-a3be-456ae4121845", "title": "Mediators hold new Gaza cease - fire talks and hope to head off a wider war - Boston News , Weather , Sports", "date": "2024-08-16 04:30", "url": "https://whdh.com/news/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "2a1814dc-16fd-4ae7-b704-7615da41f1d7", "title": "Mediators hold new Gaza cease - fire talks", "date": "2024-08-16 03:30", "url": "https://www.sunstar.com.ph/network/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.\nIsraeli and Palestinian media said that masked settlers stormed the village of Jit in the northern West Bank, setting homes and cars on fire."}, {"id": "26b385a3-aa8e-4ef6-b89c-f13e3c197e34", "title": "Secret Service OKs plan for Trump to continue outdoor rallies", "date": "2024-08-16 01:00", "url": "https://thesun.my/world/secret-service-oks-plan-for-trump-to-continue-outdoor-rallies-CN12867713", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WASHINGTON: The U.S. Secret Service has approved a new plan for Republican presidential candidate Donald Trump to continue outdoor rallies in the wake of a July assassination attempt, the Washington Post reported on Thursday.\nThe Secret Service did not immediately respond to a request for comment on the Washington Post report.\nFBI officials have yet to identify a motive for the suspected shooter, 20-year-old Thomas Crooks, who was shot dead by a Secret Service agent after opening fire.\nFollowing the attack, the Secret Service recommended that Trump avoid large outdoor events.\nTrump subsequently said he would continue outdoor rallies and that the Secret Service had “agreed to substantially step up their operation” to protect him."}, {"id": "e1391450-8b8a-4a8a-a454-fab655f6d92a", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.smh.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "61e89f14-d720-460f-80ba-47db573717d2", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.theage.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "d5736269-ea9b-400b-8774-673d2f23132f", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.brisbanetimes.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "84fdd129-0a7d-4b09-9236-73bb8eec00ef", "title": "He Was Looking For HIMARS Near Pokrovsk : SSU Detains Taxi Driver Who Spied For Russians", "date": "2024-08-16 00:45", "url": "https://menafn.com/1108560792/He-Was-Looking-For-HIMARS-Near-Pokrovsk-SSU-Detains-Taxi-Driver-Who-Spied-For-Russians", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Security Service of Ukraine (SSU) has detained a Russian informant who, under the guise of a taxi driver, was collecting intelligence for the invaders in Donetsk region, in particular, tracking the basing points of HIMARS missile systems in the Pokrovsk direction.\nAccording to Ukrinform, this was reported by the SSU .\nThe Russians needed the intelligence to prepare new offensive operations and missile strikes in this area of the frontline.\nTo collect the information needed by the invaders, the man travelled around the area under the guise of a taxi driver, asking his passengers for information in the dark.\nHe was an active user of a Russian telegram bot that collects information about the deployment of the Ukrainian Armed Forces on the eastern front."}, {"id": "82180695-2596-4e22-83dc-97af26e59b78", "title": "Mediators hold cease - fire talks , hope to prevent wider war", "date": "2024-08-16 01:15", "url": "https://www.stltoday.com/news/nation-world/mideast-gaza-israel-cease-fire-talks/article_8586cbe3-c81f-5e6e-a0d4-c7ea3f6e5e60.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to extend into Friday.\nHe said a lot of work remains given the complexity of the agreement and that negotiators were focusing on its implementation.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "00ceffdb-bb10-4876-a135-cf0787e69467", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 02:00", "url": "https://www.nbcnews.com/politics/2024-election/secret-service-approves-bulletproof-glass-shield-trump-outdoor-rallies-rcna166822", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "WASHINGTON — The Secret Service will use ballistic glass to protect former President Donald Trump so he can resume outdoor campaign events, according to two sources familiar with the planning and a Trump campaign official.\nThe official said the Secret Service is also increasing staffing and technology to mitigate threats around Trump during outdoor rallies, as well as more increasing threat analysis and prevention for all protective details, including deploying counter-snipers and countersurveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally in Butler, Pennsylvania, on July 13, wounding him and two rallygoers and killing another person.\nFormer Secret Service Director Kimberly Cheatle said after the shooting, which led to her resignation, that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "3d69e4d2-844e-472b-a824-2b28892284da", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbclosangeles.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3489411/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "81906918-9cb6-4e65-9258-c48230f6681b", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 02:00", "url": "https://www.nbcconnecticut.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3364405/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "4101f6d0-5c56-4c16-bcec-42b42bfdd0bf", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbcphiladelphia.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3945228/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "b7f1d94c-2f64-4137-bcc6-c94e0590ba63", "title": "Report points at Kyiv role in Nord Stream blasts ; Ukraine denies", "date": "2024-08-16 01:15", "url": "https://timesofindia.indiatimes.com/world/europe/report-points-at-kyiv-role-in-nord-stream-blasts-ukraine-denies/articleshow/112554076.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Ukrainian presidential adviser Mykhailo Podolyak Thursday denied his country's involvement in explosions which damaged the Nord Stream 2 gas pipeline .\nThe pipelines, transporting gas under the Baltic Sea, were ruptured by explosions in Sept 2022.\nHowever, Ukraine blamed Russia.\n\"Such an act can only be carried out with extensive technical and financial resources ... and who possessed all this at the time of the bombing?\nOnly Russia,\" Podolyak said."}, {"id": "c0950d6c-e57f-42fa-a30b-a9abc3f4881a", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 03:00", "url": "https://www.nbcmiami.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3393631/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "31f8d39b-46c4-49d3-ac04-5be419100d8c", "title": "Lebanon Is Two States for One People – and Both of Them Are Waiting for Hezbollah - Middle East News", "date": "2024-08-16 03:45", "url": "https://www.haaretz.com/middle-east-news/2024-08-16/ty-article/.premium/lebanon-is-two-states-for-one-people-and-both-of-them-are-waiting-for-hezbollah/00000191-57e5-db91-a7dd-77edf0330000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "\"Journey, we're embarking on a journey, let's do the whole world in a single day.\nTo the west, to the east, perhaps there's no difference.\nIt doesn't matter where we go.\nWhat matters is that we're on a journey and we'll do the whole world in a single day.\""}, {"id": "b9065edd-6557-4798-aefd-cbbc03ce423c", "title": "Ukraine Pivot Changes the Narrative in Russia war ; Outcome Remains Unclear | United States Institute of Peace", "date": "2024-08-16 00:00", "url": "https://www.usip.org/publications/2024/08/ukraines-pivot-changes-narrative-russias-war-outcome-remains-unclear", "domain": "usip.org", "domain_classification": "Unknown", "message": "Three Questions to WatchCan Ukraine’s strike into Russia’s Kursk region force Russia to slow its attacks in Ukraine’s Donbas?\nIn recent weeks, Russia has made slow, steady advances in Ukraine’s eastern Donbas region, threatening the towns of Niu-York, Pokrovsk and Chasiv Yar.\nUkraine’s latest conscription efforts have proven unpopular and a weary population has questioned whether continuing the war makes sense.\nThe Russian illegal annexation of Donetsk and Luhansk (and Ukraine’s Kherson and Zaporizhia provinces) codified this reality in Russian minds.\nUkraine’s recent attack into Russia’s internationally recognized territory may seem less distinct or new to those Russians who have fully imbibed Putin’s worldview."}, {"id": "83e4b0f5-e12f-49c8-b62d-582c112705c3", "title": "Lamine Yamal father was stabbed after being  tricked  into meeting", "date": "2024-08-16 01:00", "url": "https://www.dailymail.co.uk/news/article-13748711/lamine-yamal-dad-stabbing-tricked-meeting-men-claims.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Barcelona star Lamine Yamal's father was stabbed after being tricked into meeting up with four men who fooled him into thinking they wanted to 'make peace' following a confrontation hours earlier, it was claimed last night.\nThe four members of the same family surrounded the Spanish international's father and started to punch and kick him before one allegedly stabbed him, the paper reported.\nWednesday night's stabbing in a car park in Mataro north of Barcelona followed an incident around 3pm earlier the same day.\nMounir spent a night in intensive care at Germans Trias i Pujol Hospital in Barcelona before being transferred to a normal ward.\nBarcelona president Joan Laporta was among those who visited him on Wednesday night in hospital following the stabbing."}, {"id": "96a210a2-25e2-40cf-b849-5779a34bf8d7", "title": "The Latest Biden - Harris Betrayal of Israel Will Make Your Blood Run Cold", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-latest-biden-harris-betrayal-of-israel-will-make-your-blood-run-cold/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "The Biden-Harris regime is supposed to be an ally of Israel and occasionally sends signals to that effect, but its real loyalties are not hard to figure out.\nThe Biden-Harris regime is all about holding and increasing its power, and Israel is in the way of that aspiration right now.\nTo a regime that has never shown good faith and has repeatedly vowed the destruction of America as well as Israel?\nThe State Department was quick to deny the accuracy of the Kuwaiti report, and as damning as it is, that’s no surprise.\nAre those two dozen people suffering unimaginable horrors in Iranian prisons today because of the Biden-Harris regime’s anxiousness to betray Israel?"}, {"id": "b02fd274-9183-4ac5-b29b-ef76f94f8c32", "title": "Palestinian death toll in Gaza exceeds 40 , 000 as peace talks renew", "date": "2024-08-16 01:45", "url": "http://en.people.cn/n3/2024/0816/c90000-20206452.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Palestinian death toll in Gaza exceeds 40,000 as peace talks renewXinhua) 08:09, August 16, 2024People mourn victims killed in an Israeli airstrike in the southern Gaza Strip city of Khan Younis, on Aug. 14, 2024.\n(Photo by Rizek Abdeljawad/Xinhua)GAZA, Aug. 15 (Xinhua) -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has surpassed 40,000 as of Thursday, at a time when the Gaza ceasefire talks were set to resume in Qatar.\nIt took only five and a half months for the Palestinian death toll in the Gaza Strip to rise from 30,000 to 40,000.\nA man stands among the rubble after an Israeli airstrike in the Nuseirat refugee camp, central Gaza Strip, on Aug. 12, 2024.\nThe Israel Defense Forces (IDF) said in a statement on Thursday that it is continuing operational activity in the Gaza Strip, \"eliminating terrorists and dismantling terrorist infrastructure.\""}, {"id": "0856a07c-04cf-43f2-91c6-7200041afaf0", "title": "Watch : Russian Strategic Bomber Crashes In Siberia", "date": "2024-08-16 00:30", "url": "https://www.zerohedge.com/military/watch-russian-strategic-bomber-crashes-siberia", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "A Russian long-range strategic bomber has crashed over the Siberian region of Irkutsk in what was described as a routine flight.\nRussian state media was the first to report and confirm the crash, citing military officials.\n\"The plane crashed in an uninhabited area.\nIdentified as a nuclear-capable Tu-22M3 bomber, military officials say that the crash was due to technical malfunction.\nMore footage shows a plummeting plane which is on fire in Russia's far east...Reports that a Russian Tu-22M3 bomber crashed in Irkutsk Oblast, Russia tonight."}, {"id": "73836e0c-fed1-41b2-9b1d-d0a26611cb3d", "title": "Court of Appeals reverses conviction for former Lexington High School student found guilty in 2014 deadly stabbing", "date": "2024-08-16 01:30", "url": "https://www.wistv.com/2024/08/15/court-appeals-reverses-conviction-former-lexington-high-school-student-found-guilty-2014-deadly-stabbing/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS) - The South Carolina Court of Appeals reversed the conviction of a man who was found guilty in the deadly stabbing of a Dutch Fork High School student.\n“A mistrial is the equivalent of no trial and leaves the cause pending in the circuit court,” the South Carolina Court of Appeals said in court documents.\nIn reversing his conviction, the South Carolina Court of Appeals ordered the trial court to give Dennis a new immunity hearing.\nUltimately, the South Carolina Court of Appeals found the proper course was to remand for a new immunity hearing.\n“The circuit court is in the best position to assess witness credibility and make the necessary findings of fact,” said the South Carolina Court of Appeals in the court documents."}, {"id": "86e05153-d57a-450a-bedd-b31e9249d026", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "10news.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "61adad35-acdd-4b2e-bc59-69b5646724b8", "title": "Call of Duty next set up of updates will shrink the game file size", "date": "2024-08-16 00:45", "url": "https://www.windowscentral.com/gaming/the-roadmap-to-black-ops-6-includes-new-optimizations-to-the-call-of-duty-experience-including-smaller-downloads-and-streamlined-menus", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "A new series of updates is set to deploy ahead of the launch of Call of Duty: Black Ops 6 in October.\nThe road to Black Ops 6 starts with MW3 Season 5.5Activision and the Call of Duty Team have shared a roadmap of updates to the Call of Duty HQ experience.\nPreparing for the Black Ops 6 Open BetaThe Call of Duty: Black Ops 6 open beta begins on August 30.\nCall of Duty: Black Ops 6 is available for preorder now.\nOur helpful guide can help you choose between the Vault Edition and Standard Editions of Black Ops 6."}, {"id": "66352644-85fe-497e-9d2a-5ace2fed31b9", "title": "China military AI detects secret radar links between South China Sea , Alaska and Guam", "date": "2024-08-16 02:30", "url": "https://www.scmp.com/news/china/science/article/3274610/chinas-military-ai-detects-secret-radar-links-between-south-china-sea-alaska-and-guam", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Chinese electronic warfare AI has detected mysterious signals that repeatedly show up in the South China Sea, Guam , the Marshall Islands and the Aleutian Islands near Alaska – and they appear to be coordinated.\nThey published their findings in a peer-reviewed paper in the Journal of Terahertz Science and Electronic Information Technology in May.\nThis information helps the Chinese military better plan electronic warfare tasks such as electromagnetic suppression, deception, and jamming.\nThe electronic warfare AI works with other intelligence platforms, such as imaging satellites, to cross-check its findings.\nThe PLA’s electronic warfare equipment has made rapid progress in recent years, and its electronic warfare strategy has become proactive, while the United States sometimes finds itself on the defensive."}, {"id": "c0a43aad-00cd-4e17-bc5f-9b020d819de4", "title": "Supercarrier USS George H . W . Bush Now Has First Of its Kind Drone Control Center", "date": "2024-08-16 02:15", "url": "https://www.yahoo.com/news/supercarrier-uss-george-h-w-011616791.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Bush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nBush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nNaval Air Systems Command (NAVAIR) announced the completion of George H.W.\nFurthermore, “CVN 77’s UAWC lays the foundation for how the U.S. Navy will operate and control unmanned aircraft, and perhaps other unmanned vehicles, with UMCS,” Capt.\nThe Navy has now taken a major step forward toward its larger uncrewed naval aviation vision with the completion of the new drone control center on the USS George H.W."}, {"id": "dabbf36f-b9b1-4437-8e5b-2840eaa37368", "title": "Ottawa : Ukraine can use military equipment in Russia", "date": "2024-08-16 01:45", "url": "https://www.ctvnews.ca/politics/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-1.7002779", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "OTTAWA -The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement comes after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4 billion in military assistance to Ukraine through 2029."}, {"id": "67ec946d-d0bf-43d5-b3a0-34b3cfd3adf9", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:00", "url": "https://www.theglobeandmail.com/canada/article-ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.David Smith/The Canadian PressThe federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence said Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement was issued after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4-billion in military assistance to Ukraine through 2029."}, {"id": "74d9e85d-a859-4a0c-82bb-47c855316b70", "title": "Fortnite update 31 . 00 patch notes - New content and fixes for Chapter 5 , Season 4 | Gaming | Entertainment", "date": "2024-08-16 01:00", "url": "https://www.express.co.uk/entertainment/gaming/1936741/fortnite-update-3100-patch-notes-chapter-5-season-4", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Fortnite fans are counting down to the release of Chapter 5, Season 4 on PS5, PlayStation 4, Xbox, PC, Android and Switch.\nThe new Fortnite season will make its debut on the morning of August 16, but only after a lengthy period of server downtime on all platforms.\nOn the plus side, while the servers are down, you can at least download and install update 31.00.\nAnd judging by all the hype from Epic Games , the Season 4 update will be well worth checking out.\nYou can check out the Fortnite update 31.00 patch notes below."}, {"id": "dd01f807-619c-4e3c-9e94-5c4511d33a13", "title": "The Lies of Tim Walz | Frontpage Mag", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-lies-of-tim-walz/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Vance and Democrat Tim Walz marks the biggest controversy of its kind in 20 years.\nThe Swift Boat controversy of 20 years ago hurt Kerry politically, but there’s a big difference between his situation and that of Tim Walz.\nBut apparently, Walz wasn’t sufficiently proud of his achievement, so he lied about it in his curriculum vitae.\nValor describes courage or conspicuous gallantry, and I have not seen anything suggesting that Walz lied about receiving medals he did not earn.\nTim Walz did lie often."}, {"id": "85373ad2-c065-435d-b48d-50c3a223186f", "title": "Hyped Modern Warfare 2 Remastered Multiplayer Mod Killed One Day Before Launch", "date": "2024-08-16 01:15", "url": "https://www.kotaku.com.au/2024/08/hyped-modern-warfare-2-remastered-multiplayer-mod-killed-one-day-before-launch/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nFor many players, this was extremely disappointing ,as MW2’s online multiplayer is considered by many CoD fans to be the best in the franchise’s history.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam."}, {"id": "eac6bc91-9f43-4e58-a3c3-c75492d1fe96", "title": "Ukraine Recap : Kursk Offensive Turns The Fortunes Of War On Their Head For Now At Least", "date": "2024-08-16 00:00", "url": "https://menafn.com/1108560780/Ukraine-Recap-Kursk-Offensive-Turns-The-Fortunes-Of-War-On-Their-Head-For-Now-At-Least", "domain": "menafn.com", "domain_classification": "Unknown", "message": "You can also subscribe to our fortnightly recap of expert analysis of the conflict in Ukraine.\nRead more: Ukraine war: Kursk offensive has taken the war into Russia and put Putin on the back foot – for nowPressure on PutinVladimir Putin, meanwhile, has been quick to label the operation as a“provocation requiring a counter-terrorist response”.\nUK prime minister, Keir Starmer, has made it clear that, apart from the long-range Storm Shadow cruise missiles, Ukraine is free to use the weapons supplied by Britain in any way it chooses.\nEPA-EFE/Gavril Grigorov/Sputnik/Kremlin poolThroughout the course of the war, Putin has reacted to any talk of the use of western weapons inside Russia with threats of escalation.\nThis will reportedly involve Tomahawk cruise missiles, SM-6 ballistic missiles and a new generation of hypersonic systems currently under development."}, {"id": "cb9fb19b-651f-432e-95a1-5e604094628b", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 04:00", "url": "https://www.kjrh.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "10fb9cf8-5b87-45f4-b83b-70926b9ae9ab", "title": "The Ukrainian August 2024 offensive : Some initial thoughts", "date": "2024-08-16 01:30", "url": "https://smallwarsjournal.com/jrnl/art/ukrainian-august-2024-offensive-some-initial-thoughts", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "It is the most significant development in the Ukraine war in over a year.\nSome observations of the Ukrainian August offensive:The Ukrainians practiced good OPSEC – The offensive came as surprise to many observers in the West (including myself) and that’s good.\nIn this “You Tube” war where truth is hard to discern due to the exaggerated claims of everyone posting, the current Ukrainian offensive does appear to have done well in this regard.\nThe Ukrainians now hold Russian territory as a bargaining chip for negotiations – This is a huge development.\nProvides morale boost for Ukrainian forces, nation and international supporters – The success of this offensive has been a huge shot in the arm for Ukraine."}, {"id": "3f5a7a38-e2e7-4618-b07a-5bbeb918d730", "title": "The Underwater Pipelines That Supplied Fuel For The Allied Invasion Of Normandy", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/underwater-pipelines-supplied-fuel-allied-232237301.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This pipeline network, known as the Government Pipeline Storage System (GPSS) pipeline, formed the backbone of the PLUTO pipelines.\nThe PLUTO pipelines were not, it should be said, the main means by which petroleum was to be supplied to the continent in this scenario.\nLibrary of Congress via Wikimedia Commons A map of the PLUTO pipelines.\nWork on the PLUTO pipeline relied on the Allies capturing Cherbourg harbor intact in only eight days.\nIn May 1945, Churchill himself suggested that Operation PLUTO was “a wholly British achievement and a piece of amphibious engineering skill of which we may well be proud.”Ultimately, Operation PLUTO was less successful than the British authorities envisioned in 1942 and 1943."}, {"id": "19966d88-1a1d-44b7-8524-00c0ae2a8fbd", "title": "The Challenge star Theo Campbell claims he and castmate  wanted to fight  during Season 40", "date": "2024-08-16 03:45", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-star-theo-campbell-claims-he-and-castmate-wanted-to-fight-during-season-40/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Each squad would lose one man and one woman, based on the worst-performing competitors and whoever the daily challenge winners opted to send in against them.\nNurys and Theo finished last in the daily challenge, so they would automatically compete in their team’s eliminations.\nSince Horacio Gutierrez and Michele Fitzgerald were the Era 4 daily challenge winners, they decided who went against Nurys and Theo.\nLater, Paulie and Theo got in one another’s faces at The Challenge house, including that infamous kiss Paulie planted on Theo.\nViewers last saw Paulie on The Challenge: USA 2 on CBS, and Theo finally returned for The Challenge: World Championship on Paramount+."}, {"id": "3b1e156d-22bd-43c3-a76e-4fe73444f768", "title": "Hyped Modern Warfare Remastered Mod Killed 1 Day Before Launch", "date": "2024-08-16 02:15", "url": "https://kotaku.com/mw2-h2m-mod-activision-cease-and-desist-killed-steam-pc-1851623649", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish view video This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam.\nCurrently, MW Remastered has a “mostly negative” review status on Steam."}, {"id": "5231e13e-e132-4249-9833-086c902e9033", "title": "Massive new Navy ship leaves San Diego Bay for its first sea trials", "date": "2024-08-16 00:00", "url": "https://www.sandiegouniontribune.com/2024/08/15/massive-new-navy-ship-leaves-san-diego-bay-for-its-first-sea-trials/", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "The USNS Robert E. Simanek, a 784-foot expeditionary sea base, left the General Dynamics-NASSCO shipyard in San Diego Bay on Wednesday for its first sea trial, considered an important step in preparing a vessel for full service.\nThe Simanek is the fifth ESB that NASSCO has built for the Navy, which intends to use the vessels to help deploy troops and equipment in areas of the world where the U.S. doesn’t have easy access to land bases and seaports.\nThe ship carries the designation USNS because it is a non-commissioned vessel that will be operated for the Navy by a civilian crew under the Military Sealift Command.\nNASSCO said the ship was named in honor of the late Robert Ernest Simanek, a private first class Marine who was awarded the Medal of Honor for shielding fellow Marines during a grenade attack in the Battle of Bunker Hill during the Korean War."}, {"id": "78a642f5-2c43-4775-bc5d-55825a9f5063", "title": "War Stocks Still a Buy $LMT $NOC $RTX $BA", "date": "2024-08-16 02:15", "url": "https://www.livetradingnews.com/225647-225647.html", "domain": "livetradingnews.com", "domain_classification": "Unknown", "message": "Stable Revenue Streams: Unlike many sectors, defense companies enjoy a relatively predictable revenue stream due to government contracts.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nMarket Sentiment:Recent posts on X (formerly Twitter) highlight a mixed sentiment but a clear trend towards defense stocks.\nAs long as geopolitical tensions persist, defense stocks are likely to remain a strategic choice for investors looking for resilience amidst global uncertainty."}, {"id": "87ce8936-26e5-4cd5-96ac-61f71a2dea94", "title": "JD Vance Joins Fellow Veterans to Torch Tim Walz for Stolen Valor at Pennsylvania VFW Post", "date": "2024-08-16 01:15", "url": "https://www.breitbart.com/politics/2024/08/15/jd-vance-joins-fellow-veterans-to-torch-tim-walz-for-stolen-valor-at-pennsylvania-vfw-post/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Tim Walz for lying about his military service at a Veterans of Foreign Wars (VFW) post in Pennsylvania on Thursday.\nJD Vance summarizes Freakish Timothy Walz's history of Stolen Valor🔥 Tim Walz said that he carried a weapon in war — he never went to war.\nWhile he was promoted provisionally to command sergeant major, he did not finish the requirements to retain or retire at that rank.\nAs then-command sergeant major of his unit, he was responsible for the enlisted troops in his battalion, about 100 soldiers.\nThis is not about disparaging anybody’s services, including Tim Walz."}, {"id": "0151e9d8-3344-4a38-8d5a-d88ced0cb991", "title": "Zelenskyy says Ukrainian troops are consolidating control of Russian territory", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/europe/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha", "domain": "10news.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy said Thursday that his country's troops had taken full control of Sudzha, the largest Russian town to fall to Ukraine's forces since the start of their cross-border incursion more than a week ago.\n“The more Russian military presence is destroyed in the border regions, the closer peace and real security will be for our state.\nMeanwhile, Russian forces are keeping up the pressure on the southern and eastern front lines, according to Ukrainian military officials.\nAs of Thursday, the Ukrainian military claims to be holding more than 80 towns and settlements in the Kursk region.\nRussian military bloggers reported that small Ukrainian mechanized groups have continued to probe Russian defenses."}, {"id": "2aa36620-62a3-4ebd-979d-e8ceefcbfcbd", "title": "Cyber - attack could trigger ANZUS treaty , Australia , NZ leaders say", "date": "2024-08-16 03:15", "url": "https://www.9news.com.au/national/anthony-albanese-chris-luxor-affirm-australia-new-zealand-defend-each-other-cyber-attacks/b703d900-9ef3-480e-9d37-ede8feb6dee1", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ \"sufficiently severe\" cyber attack on either country could trigger a combined Australia-New Zealand defence response, the prime ministers of both countries said today.\nNew Zealand Prime Minister Christopher Luxon.\n(9News)Luxon confirmed ﻿that the alliance could \"come into play\" in the face of a \"sufficiently severe cyber attack\".\nA \"severe\" cyber attack could provoke a joint Australia-NZ defence response.\n\"Prime Minister Albanese and I agreed to engage closely on this,\" he said."}, {"id": "dc183932-8910-419c-9587-37f9f4530341", "title": "What does Chicago represent for the Democratic National Convention ? ", "date": "2024-08-16 00:30", "url": "https://www.aljazeera.com/news/longform/2024/8/15/what-does-chicago-represent-for-the-democratic-national-convention", "domain": "aljazeera.com", "domain_classification": "International", "message": "But for all the ways Chicago represents Democratic ideals, critics say it has also exemplified the party’s failings and divisions.\nLooming large over the upcoming Democratic National Convention is the spectre of an earlier convention in Chicago that ended in unrest and violence.\nStill, the party assembled in Chicago for its 1968 Democratic National Convention.\nHundreds of demonstrators are expected to gather outside the 2024 convention site to protest Democratic support for Israel’s war in Gaza.\nStill, Cowan said the current optimism surrounding the Harris-Walz campaign may overshadow any protests outside this year’s convention in Chicago."}, {"id": "2b72d0ba-691d-4265-8c9e-a0dacffc3ff7", "title": "Vicky McClure fans  blown away  as family story aired on Who Do You Think You Are  saddest episode  ", "date": "2024-08-16 01:15", "url": "https://www.nottinghampost.com/news/celebs-tv/vicky-mcclure-fans-blown-away-9487052", "domain": "nottinghampost.com", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nOverwhelmed by emotion, the actress broke down, saying: \"It's horrible, horrible, horrible.\"\nAnother shared their admiration: \"Wow, what a man Harry Millership was Rest easy, Harry.\nRIP Harry Millership."}, {"id": "9a9ee749-3335-4481-b175-ab42e67f6ce0", "title": "Zelenskyy says Ukrainian troops have taken full control of the Russian town of Sudzha", "date": "2024-08-16 02:30", "url": "https://www.smdailyjournal.com/news/world/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha/article_8af1c98a-5b47-11ef-b620-93f23494d8d2.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "246f5981-02c6-4ea3-8630-21b095c21b71", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 03:00", "url": "https://wset.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wset.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "8c984611-07af-4697-90f5-8decbb3ee62f", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wlos.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "0ce051ac-5056-4e70-8f9d-58569d691c40", "title": "Israel has hit a wall in Gaza , some US officials say , as civilian deaths mount", "date": "2024-08-16 03:45", "url": "https://www.yahoo.com/news/israel-hit-wall-gaza-us-231345752.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel has hit a wall in Gaza, some US officials say, as civilian deaths mountWASHINGTON − Israel has achieved most of its battlefield aims against Hamas in Gaza, but is unlikely to eliminate the militant movement by continuing combat operations that have cost an estimated 40,000 lives, current and former U.S. officials say.\nIranian officials have said a Gaza cease-fire would temper their promised response to the assassination, which they blame on Israel.\nWhile U.S. arms sales continue, some officials are questioning whether Israel’s military has hit a wall in Gaza.\n“There is no such thing as total victory in the context of the Gaza war.\"\nThis article originally appeared on USA TODAY: Israel has hit a wall in Gaza, US officials say; deaths hit 40,000"}, {"id": "773ac2b2-ac1c-427c-9c0f-9d0ba376400a", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 03:00", "url": "https://ktul.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "f74eedc0-14ba-48ff-be41-ac0aa81573e4", "title": "Echoes of  68 as Chicago convention looms for Democrats", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/echoes-68-chicago-convention-looms-013600799.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"It's not a twin, but an echo,\" David Farber, a University of Kansas history professor and author of the book \"Chicago '68,\" said of circumstances connecting the two conventions.\nHe pointed to the choice of Chicago as a way for Democrats to exorcise the demons of the past.\n\"I thought, 'Oh, the ghost of '68 is really over' -- and then all the protests broke out on university campuses over the Gaza-Israel situation\" and word came that massive demonstrations await the upcoming convention, Farber told AFP.\nAs AFP reported from Chicago just before the 1968 convention opened on August 26, the Democratic Party \"appears more divided than ever.\"\n\"It's more a story of contrasts,\" said historian Frank Kusch who wrote \"Battleground Chicago,\" a book about the 1968 convention."}, {"id": "f7e56ea4-f698-4d39-83af-d7d0f612abbc", "title": "Mastering Threats Beneath Waves", "date": "2024-08-16 02:00", "url": "https://www.miragenews.com/mastering-threats-beneath-waves-1297291/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "To help counteract this threat, two Royal Australian Navy sailors recently participated in the Royal Navy's advanced mine warfare course at HMS Collingwood in England.\nWarrant Officer Lockard and Chief Petty Officer Cochrane learned planning considerations, including how to identify areas likely to be mined, best patterns of search to identify targets and best available disposal methods.\n\"The course is designed for us to conduct practical planning for the execution of mine warfare operations,\" Warrant Officer Lockard said.\nBoth sailors are now qualified to work as mine warfare planners within maritime task groups.\n\"I am looking forward to using my new knowledge and skills to overcome challenges with mine countermeasures operations,\" Chief Petty Officer Cochrane said."}, {"id": "933eff7a-414b-45fa-afb2-8b4e27a94b94", "title": "Ukraine cross - border incursion challenges Moscow war narrative – but will it shift Russian opinion ? ", "date": "2024-08-16 00:30", "url": "http://www.econotimes.com/Ukraines-cross-border-incursion-challenges-Moscows-war-narrative--but-will-it-shift-Russian-opinion-1684128", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nUkraine’s invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude “rally around the flag” effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "8ff9ceba-0546-4ed0-9a53-52ff8078119e", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:30", "url": "https://fox11online.com/news/nation-world/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "47ec7f11-dbff-432d-8a5c-9cca1d3c9365", "title": "Kyodo News Digest : Aug . 16 , 2024", "date": "2024-08-16 03:00", "url": "https://english.kyodonews.net:443/news/2024/08/090e6cfcd394-kyodo-news-digest-aug-16-2024.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 6 hours ago - 07:21 | All, World, JapanThe following is the latest list of selected news summaries by Kyodo News.\nReal gross domestic product marked the first increase in two quarters, rebounding from a sharp contraction in the first three months of 2024.\nOn a nominal basis, Japan's GDP topped 600 trillion yen ($4 trillion) for the first time, amid persisting inflation caused by a weakening yen.\n----------Thai coalition parties to nominate Thaksin's daughter as PM candidateBANGKOK - Thailand's ruling coalition on Thursday decided to nominate Paetongtarn Shinawatra, daughter of former Prime Minister Thaksin Shinawatra, as its candidate for prime minister, her party said.\nThe decision to endorse the leader of the Pheu Thai Party for a parliamentary vote scheduled on Friday follows a Constitutional Court ruling dismissing Prime Minister Srettha Thavisin over an ethical violation related to his appointment of a minister."}, {"id": "72b7705e-db2e-4526-98ac-fb31349b337e", "title": "Biden still believes he would beat Trump if hed stayed in the race : report", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/biden-still-believes-beat-trump-220005136.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At the time he dropped out of the 2024 presidential race, President Biden believed he could beat former President Trump.\nThe Biden administration would support the elimination of taxes on tipped wages, an idea first proposed by former President Trump, the White House said.\nPresident Biden during the White House Creator Economy Conference in the Indian Treaty Room of the White House in Washington, DC, US, on Wednesday, Aug. 14, 2024.\nFox News Digital reached out to the White House for comment, but did not immediately receive a response.\nOriginal article source: Biden still believes he would beat Trump if he'd stayed in the race: report"}, {"id": "72960fe1-0b12-42f6-bdb1-47f023c5d736", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:00", "url": "https://kval.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "kval.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "dcd53ad1-d212-4c3d-b943-ad3952b21d8b", "title": "Six Jews Youths Arrested Trying to Mark 19 Years Since Expulsion from Gaza | The Jewish Press - JewishPress . com | Jewish News Syndicate ( JNS ) | 12 Av 5784 – Friday , August 16 , 2024", "date": "2024-08-16 01:30", "url": "https://www.jewishpress.com/news/israel/settlements-israel/six-jews-youths-arrested-trying-to-mark-19-years-since-expulsion-from-gaza/2024/08/16/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Israeli security forces arrested six youths after dozens tried to breach the border with the Gaza Strip to conduct a Jewish prayer service there on Thursday morning.\nAdvertisementThe six who were detained were part of a group of some 40 people who tried to enter the Strip from the Erez Crossing with northern Gaza.\nThe attempt to enter the enclave came as resettlement activists marked 19 years since the military carried out Israel’s disengagement from the Gaza Strip, in which more than 8,000 Jews were forcibly removed from their homes.\n“Only a Jewish Gaza will remove the threats of missiles and hostage-taking from Gaza and bring security to the residents of the south and the entire country,” the anonymous Israeli worshipper continued.\n“If you mean resettling Gaza, … it was never in the cards, and I said so openly."}, {"id": "52a37e02-e380-4bc5-b232-f6586e227984", "title": "Global corporations versus nation - states", "date": "2024-08-16 01:00", "url": "https://www.dailysabah.com/opinion/columns/global-corporations-versus-nation-states", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "In today’s interconnected world, the influence of monopolistic corporations has grown to staggering levels, especially through global communication channels.\nEven after it was confirmed that the attacker was a Christian, the unrest continued to escalate, fueled by the unchecked spread of inflammatory content on social media.\nCurrently, China dominates the global market in lithium processing and battery production, but this supply chain is vulnerable.\nMusk, often lauded for his efforts to champion “free speech” on X, is clearly intoxicated by the vast opportunities presented by the global lithium race.\nIf he, with all his wealth and power, is so consumed by this pursuit, one can only imagine the lengths to which other global media magnates might go to secure their share."}, {"id": "6e0faa28-2bc9-4ad6-bfb6-fcbb3a58fd15", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 03:15", "url": "https://www.nbcmontana.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "b9e05bbb-1180-4f76-9ad6-f52794c1a288", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 02:30", "url": "https://www.princegeorgecitizen.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358100", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nOTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil."}, {"id": "b94e1d50-f485-46c8-b3f1-703455ff409f", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 02:30", "url": "https://www.airdriecityview.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358096", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\n- With files from the Associated PressThis report by The Canadian Press was first published Aug. 15, 2024.\nThe Canadian Press"}, {"id": "ff89371d-53e0-4295-9295-c3d5cfbd9d38", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:30", "url": "https://www.stalbertgazette.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358096", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\n- With files from the Associated PressThis report by The Canadian Press was first published Aug. 15, 2024.\nThe Canadian Press"}, {"id": "dd9e2ac0-76ad-4ee9-9b8b-5cd0202f504d", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:15", "url": "https://www.piquenewsmagazine.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358100", "domain": "piquenewsmagazine.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nOTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil."}, {"id": "5de00022-9d5d-4651-a8d1-d11f4ea78013", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:45", "url": "https://www.coastreporter.net/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358100", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nOTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil."}]