[{"id": "e9f7e6a4-a317-4099-81cf-3502d16bc4b2", "title": "2 hurt as Hezbollah shells north launches explosive drones", "date": "2024-06-03 00:45", "url": "https://muslimnews.co.uk/news/syria/2-hurt-as-hezbollah-shells-north-launches-explosive-drones/", "message": "Over 120 people attended a landmark conference on the media reporting of Islam and Muslims.\nIt was held jointly by The Muslim News and Society of Editors in London on September 15."}, {"id": "b8dc446c-52d9-4545-8c44-990c3d8a8449", "title": "2 Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287040/2-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- IANS) Beirut, June 3 (IANS) Two people were killed and four others in an Israeli on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said on Sunday that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders, Xinhua news agency reported.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "a641b48f-189e-4988-b9ff-1368a157b4bd", "title": "Ukraine deploys Neptune missiles as tactical weapons for first time expert", "date": "2024-06-03 09:15", "url": "https://www.yahoo.com/news/ukraine-deploys-neptune-missiles-tactical-080800438.html", "message": "Ukraine deploys Neptune missiles as tactical weapons for first time — expertAftermath of attack on terminals in Russia's Krasnodar TerritoryUkraine used Neptune missiles as tactical weapons rather than anti-ship missiles for the first time, former Deputy Chief-of-Staff of the Ukrainian Navy and strategic expert with Sonata Company, Andriy Ryzhenko, said in an interview with NV Radio on May 30.\nThe Ukrainian Navy targeted a ferry crossing and an oil terminal at Port Kavkaz in Russia's Krasnodar Krai with missiles launched from a Neptune coastal missile system, Ukraine's General Staff said.\n\"This might be the first such strike, and we see Neptune being used exclusively against coastal targets as a tactical strike missile rather than an anti-ship missile for the first time,\" Ryzhenko said.\nThe missile launches likely originated not from Odesa Oblast but from a closer location, he said.\nWhen asked if this could be considered the first mass strike of Neptune missiles on ground targets, Ryzhenko confirmed."}, {"id": "b08574e3-c880-48af-9867-3330e1e2fd71", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan – Winnipeg Free Press", "date": "2024-06-03 08:00", "url": "https://www.winnipegfreepress.com/world/2024/06/03/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nISRAELI STRIKES KILL 11 IN GAZADEIR AL-BALAH, Gaza Strip — Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others."}, {"id": "e4ea6cc9-6f4f-42d3-84e1-76d2221fb35a", "title": "The Israeli army says it investigates itself", "date": "2024-06-03 00:30", "url": "https://www.chicagotribune.com/2024/06/02/israeli-army-investigates-itself/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nArmy officials initially said dozens of Palestinians were killed in a stampede when huge crowds tried to grab supplies off the pre-dawn convoy of 30 army trucks carrying flour toward hard-hit northern Gaza.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military."}, {"id": "22c9a7d7-2b4c-4b66-83b3-2d6342bbbd19", "title": "Where do the IDF internal investigations stand ? ", "date": "2024-06-03 04:15", "url": "https://www.ctvnews.ca/world/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand-1.6910783", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "fba5f845-0d29-4b5f-8950-34e51c0508e5", "title": "Russian Forces Launch Rockets at Ukrainian Military - Linked Energy Facilities", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240601-sputnik01.htm", "message": "Russian Forces Launch Rockets at Ukrainian Military-Linked Energy Facilities - MoDSputnik News20240601MOSCOW (Sputnik) - The Russian armed forces over the past 24 hours have launched a group rocket strike against Ukrainian energy facilities working for the military-industrial complex in response to Kiev's attempts to damage Russian energy and transportation facilities, the Russian Defense Ministry said on Saturday.\nRussian forces also hit an expert center responsible for developing flight missions for Ukrainian drones, the ministry added.\n\"The Ukrainian armed forces lost up to 450 soldiers, a tank, two IFVs, nine vehicles, two 152-mm D-20 howitzers, and a 122-mm Gvozdika self-propelled artillery unit,\" the ministry stated.\n\"Ukrainian forces lost up to 240 servicepeople, a tank, an infantry fighting vehicle, six vehicles, an Osa anti-aircraft missile system and a Nota electronic warfare station,\" the ministry added.\nUkraine's armed forces lost over 120 servicepeople, an armored combat vehicle, four vehicles, and a 122 mm D-30 howitzer,\" the ministry added."}, {"id": "b13a28d3-cca7-41a4-8d2d-d508832afa4a", "title": "Real target of Dalston shooting says  I wish it was me  ", "date": "2024-06-03 00:15", "url": "https://www.thetimes.co.uk/article/real-target-of-dalston-shooting-says-i-wish-it-was-me-h7lgn2tmp", "message": "The target for the gangland shooting which left a schoolgirl fighting for her life survived a previous assassination attempt and wishes the bullet had hit him rather than the innocent child.\nBeytullah Gunduz, who has been linked to the Turkish underworld, was with friends outside a restaurant in Dalston until 15 minutes before a gunman opened fire on diners last week.\nHe returned to the restaurant to find three of his friends with gunshot wounds.\nThe girl, who had been sitting with her family inside, was on the floor after being shot in the head.\nThe attack has led to concerns that the shooting will reignite a bloody gang war between Tottenham Turks and their rivals, the Hackney Turks."}, {"id": "16cb7d82-16e2-4f3a-8e84-f49c08575384", "title": "What the status of Israeli army investigations into itself ? ", "date": "2024-06-03 01:30", "url": "https://www.nbcbayarea.com/news/national-international/israeli-army-investigates-itself/3554840/", "message": "Israel’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army’s chain of command.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "5b97f005-0ddc-4048-abe4-ef24c894bdaf", "title": "Israeli army investigating itself : Where do those investigations stand ? ", "date": "2024-06-03 13:00", "url": "https://naharnet.com/stories/en/305663-israeli-army-investigating-itself-where-do-those-investigations-stand", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "aeee44d4-30c7-4bec-b8a8-0df80a703640", "title": "Israeli army investigating itself : Where do those investigations stand ? ", "date": "2024-06-03 13:15", "url": "https://www.naharnet.com:443/stories/en/305663-israeli-army-investigating-itself-where-do-those-investigations-stand", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "94dedf04-f0c4-4db2-92ef-803cde73b84a", "title": "Hezbollah strikes Israeli bases as clashes intensify - Newspaper", "date": "2024-06-03 04:15", "url": "https://www.dawn.com/news/1837460/hezbollah-strikes-israeli-bases-as-clashes-intensify", "message": "BEIRUT: Hezbollah said on Sunday its fighters had bombarded two army bases in the Israeli-annexed Golan Heights within hours, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hezbollah annou­nce­ment came several hours after Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hezbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "05bc7a77-23be-4128-9ba2-51983e75447b", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 04:45", "url": "https://www.yahoo.com/news/german-police-officer-injured-mannheim-032959235.html", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died."}, {"id": "311d930e-70f2-44e5-89cf-fc9307d4240e", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 03:45", "url": "https://www.upi.com/Top_News/World-News/2024/06/02/germany-Mannheim-injured-police-officer-dies/5531717382085/", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died."}, {"id": "a64a9392-e2a4-4a3a-95ba-ab7b3ffca217", "title": "Vladimir Putin Strikes Ukraine Largest Hydro - Electricity Plant : Photos", "date": "2024-06-03 01:15", "url": "https://radaronline.com/p/vladimir-putin-missiles-russian-strike-ukraine-hydro-electricity-plant/", "message": "The Dnipro plant, situated on a bridge in Zaporizhzhia, was struck by the 600-mph rocket despite having been targeted by Russian forces previously on March 22.\nUkrainian workers were still in the process of repairing the plant from the previous attack when the missiles hit, exacerbating the damage caused.\nThe assault, part of an overnight blitz employing KH-101 missiles, marks the second major attack on the Dnipro Hydro-electric Power Plant since March.\nThe plant's generating capacity has been severely crippled, with any breach of the 200ft dam posing a significant risk of flooding downstream."}, {"id": "72413d05-fe67-4320-b29c-3225c726e948", "title": "Should the Royal Navy join the US in the exclusive SSGN club ? Good idea , but expensive", "date": "2024-06-03 11:30", "url": "https://www.telegraph.co.uk/news/2024/06/03/us-navy-royal-submarine-ssgn-missiles-special-operations/", "message": "Ohio-class SSGN USS Florida transits the Suze Canal into the Red Sea last November.\nReportedly the sub fired Tomahawk cruise missiles at Houthi targets, and made use of the Dry Deck Shelter (DDS) mini-sub docking bay visible fitted to her casingCredit : Mass Communication Specialist 1st Class Jonathan Word/US Navy"}, {"id": "fbd3ce6f-6598-4a3e-9b90-2902f9fe2b3f", "title": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease - fire plan", "date": "2024-06-03 14:00", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/the-latest-israeli-strikes-in-central-gaza-kill-at-least-11-as-the-us-pushes/article_46195767-a19f-5e66-9b3e-f8881ec919c3.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "8c784f8d-b585-45b3-8da6-8c896c73ef15", "title": "12 martyred , dozens injured in Israeli airstrikes targeting Khan Younis , Rafah", "date": "2024-06-03 14:15", "url": "https://www.gulf-times.com/article/683965/region/12-martyred-dozens-injured-in-israeli-airstrikes-targeting-khan-younis-rafah", "message": "At least 12 Palestinians, including children and women, were martyred in a series of Israeli airstrikes that targeted Khan Younis and Rafah in the southern Gaza Strip early Monday.\nTen citizens, including three children, were martyred and others were injured in an Israeli bombardment that targeted two homes in Al-Rumaydah east of Khan Younis city, the Palestinian News Agency (WAFA) reported, citing health sources.\nAdditionally, two citizens were martyred and others were injured in an Israeli bombardment that targeted a home in Khan Younis in the southern Gaza Strip.\nAn Israeli airstrike targeted the vicinity of the European Gaza Hospital near Khan Younis in the southern Gaza Strip.\nEarlier today, ten citizens were martyred in Israeli strikes on the Al-Bureij and Nuseirat refugee camps in central Gaza."}, {"id": "0065f0b1-24d9-44ed-baf0-c81782dff28e", "title": "Russian forces down 62 Ukrainian drones , 14 HIMARS rockets", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240602-presstv01.htm", "message": "Russian forces down 62 Ukrainian drones, 14 HIMARS rocketsIran Press TVSunday, 02 June 2024 5:15 AMRussian air defense forces have downed 62 Ukrainian drones, 14 HIMARS rockets and three Hammer bombs, according to a report by the Russian Defense Ministry.\nRussian forces dealt a heavy retaliatory blow to Ukraine's power facilities as the Kiev forces had planned to strike Russian energy infrastructure, the report reads.\nThe ministry also said that Russia's Battlegroup South took up better forward-edge positions, causing Ukrainian forces to sustain roughly 660 casualties.\nRussia's Battlegroup East units seized vantage points in the past day, inflicting over 120 casualties on the Ukrainian forces.\nAlso, Ukrainian forces lost an armored combat vehicle, four cars and a 122mm D-30 howitzer, it said."}, {"id": "a55a46d4-90fc-447c-9282-a8e2aca04a8d", "title": "2 killed in Israeli airstrike on Lebanese village - Xinhua", "date": "2024-06-03 00:15", "url": "https://english.news.cn/20240603/c0ed96de293c409db1b811108e34086b/c.html", "message": "BEIRUT, June 2 (Xinhua) -- Two people were killed and four others injured on Sunday in an Israeli airstrike on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 airstrikes on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "23d916fe-95ea-4570-9685-ed0a647cd289", "title": "12 Iranian Militiamen Killed in Israeli Attack near Aleppo , Syria | The Jewish Press - JewishPress . com | David Israel | 26 Iyyar 5784 – Monday , June 3 , 2024", "date": "2024-06-03 09:00", "url": "https://www.jewishpress.com/news/middle-east/syria/12-iranian-militiamen-killed-in-israeli-attack-near-aleppo-syria/2024/06/03/", "message": "Photo Credit: SOHR ScreenshotThe official Syrian news agency SANA on Monday morning reported that “several civilians were martyred at dawn on Monday in an Israeli missile aggression that targeted several points in the vicinity of Aleppo city.”“At approximately 00:20 AM on Monday, the Israeli enemy launched an aerial attack with missiles from a direction southeast of Aleppo, targeting several points in the vicinity of Aleppo city, and the army air defenses intercepted the aggression’s missiles and shot down some of them,” SANA reported, citing a military source.\nThe source added that “the aggression led to the martyrdom of several civilians and some material losses to property.”AdvertisementThe opposition Syrian Observatory for Human Rights reported that “12 members of pro-Iranian militias of Syrian and non-Syrian nationalities” were killed (a preliminary toll), as a result of “an Israeli air strike on a site in the town of Hayyan in the northern countryside of Aleppo, where the targeting resulted in successive explosions in the copper factory in the area.”The Syrian Observatory indicated that “successive strong explosions occurred in the town of Hayyan in the northern countryside of Aleppo, resulting from a missile targeting of the copper factory, as the town is controlled by Iranian militias of Syrian and non-Syrian nationalities, while ambulances and fire brigades rushed to the area to put out the fires and transport injured people.”“The explosions followed a bombardment with high-explosive Volcano missiles that were launched from the western countryside of Aleppo on the positions of Hay’at Tahrir al-Sham (Organization for the Liberation of the Levant, or Levant Liberation Committee) and its factions in Kafarama and Nuran in the western countryside of Aleppo,” the SOHR added.\nThe Burkan-2H, or Volcano-2H, is a mobile short-range ballistic missile made in Iran and used by the Houthis militants in Yemen."}, {"id": "e96b89e9-bcf4-41ef-8eca-69ef240cc335", "title": "Columbia Submarine Fleet Production Should Be Radically Expanded", "date": "2024-06-03 14:15", "url": "https://www.heritage.org/defense/report/columbia-submarine-fleet-production-should-be-radically-expanded", "message": "As planned, the United States will replace the 14 Ohio-class SSBNs with 12 Columbia-class SSBNs, which will carry fewer missiles than the current Ohio-class boats.\nThe fundamental question facing the U.S. Navy is how the current ballistic missile submarine program of record, conceptualized in 2010, can be amended to ensure that we have a fleet of ballistic missile submarines that is sufficient to maintain that credible deterrent.\nIt is nevertheless possible that each ballistic missile submarine on patrol could carry additional warheads—probably no more than 20 per submarine.\nThe first modified Columbia SSBNs should begin to arrive in the fleet at about this time.\nSuch an assumption would envision a fleet of Columbia-class submarines that includes 16 as ballistic missile submarines and six as conventional arsenal ships in SSGN configurations."}, {"id": "28395c4b-8d80-4e8c-8ba3-b2cef92445a7", "title": "World - HITS FM", "date": "2024-06-03 11:45", "url": "https://hitsfm.net/world/28669c72d49b7fc6e538d08744553497", "message": "The crossing has been closed since Israeli forces took control of the Gaza side during their offensive toward Rafah in May.\n-ABC News' Anna BurdMay 31, 1:10 PMIsraeli forces operating in central Rafah, IDF saysThe Israeli army is now operating in central Rafah, the IDF said Friday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "2f76b13a-3d7e-4689-ba62-291372ecc98b", "title": "Israel - Gaza live updates : 1 million have fled Rafah , UNRWA says - WEIS | Local & Area News , Sports , & Weather", "date": "2024-06-03 13:15", "url": "https://weisradio.com/2024/06/03/israel-gaza-live-updates-1-million-have-fled-rafah-unrwa-says/", "message": "All times Eastern:Jun 03, 3:57 AM1 million have fled Rafah, UNRWA saysMore than 1 million people have fled Rafah in the weeks since Israel issued evacuation orders, the local U.N. agency said Monday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "d59f96d7-1615-4cae-b0ea-ba1630b2a749", "title": "Israel - Gaza live updates : 1 million have fled Rafah , UNRWA says", "date": "2024-06-03 14:30", "url": "https://www.k101fm.net/syndicated-article/?id=1567182", "message": "All times Eastern:Jun 03, 3:57 AM1 million have fled Rafah, UNRWA saysMore than 1 million people have fled Rafah in the weeks since Israel issued evacuation orders, the local U.N. agency said Monday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "740b85a6-5dae-47d3-b3e9-a9aa3301faa6", "title": "Houthis Attack US Aircraft Carrier , Destroyer in Red Sea", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-sputnik04.htm", "message": "Houthis Attack US Aircraft Carrier, Destroyer in Red Sea - Military SpokesmanSputnik News20240602MOSCOW (Sputnik) - Yemen's Ansar Allah movement, also known as Houthis, attacked a US aircraft carrier, destroyer and a number of ships in the Red Sea, Houthi military spokesman Yahya Saree said.\n\"The US aircraft carrier Dwight Eisenhower was attacked in the northern Red Sea with several missiles and drones,\" Saree said, adding that a US destroyer was also attacked in the Red Sea.\nThe movement's forces struck ships in the Red Sea, the Arabian Sea and the Indian Ocean that \"belong to companies that violated the decision to ban passage to [Israeli] ports,\" the spokesman added.\nHouthis vowed in November 2023 to attack any ships associated with Israel until it halts military actions in the Gaza Strip.\nAmid the Houthi attacks, some companies suspended shipments through the Red Sea."}, {"id": "27398e98-65fd-4402-8f76-878eea965006", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 00:15", "url": "https://www.2news.com/news/national/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/article_96e5df36-e35a-5b27-9cdf-5d9f3bd7b84d.html", "message": "FILE - Palestinians look at the destruction after an Israeli strike where displaced people were staying in Rafah, Gaza Strip, Monday, May 27, 2024.\nThroughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly events in which its military forces are suspected of wrongdoing.\nThe commitment comes in the face of mounting claims — from human rights groups and the International Criminal Court's chief prosecutor — that the country's leaders are committing war crimes in Hamas-ruled Gaza.\n(AP Photo/Jehad Alshrafi, File)"}, {"id": "18d7c510-21ab-4dea-9ccf-c7c1991f6c12", "title": "Israel has pledged to investigate a series of events where its military has been suspected of wrongdoing", "date": "2024-06-03 06:30", "url": "https://www.newstalkzb.co.nz/news/world/israel-has-pledged-to-investigate-a-series-of-events-where-its-military-has-been-suspected-of-wrongdoing/", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "7f9706eb-9677-45a0-87d1-b116f8b4e191", "title": "Over 20 killed in Israeli strikes on Gaza refugee camps , homes", "date": "2024-06-03 08:45", "url": "http://www.presstv.ir/Detail/2024/06/03/726762/Palestinians-killed-Israeli-strikes-Gaza-Bureij", "message": "Israeli warplanes have conducted fresh air raids on several areas across the Gaza Strip, killing at least 22 Palestinians.\nA separate Israeli airstrike in Khan Younis hit the home of Abu Khater family, killing two Palestinians and injuring others, the report added.\nIt also said that an Israeli attack targeted the vicinity of Gaza’s European Hospital near Khan Yunis.\nEarlier, similar attacks by Israeli warplanes killed 10 civilians at Bureij and Nuseirat refugee camps in central Gaza.\nSo far, the Tel Aviv regime has killed at least 36,439 Palestinians, mostly women and children, and injured 82,627 others in the Gaza Strip."}, {"id": "ac78f08a-c815-437e-94f0-caa24e20fdd4", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan", "date": "2024-06-03 08:00", "url": "https://www.whec.com/national-world/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan/", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nBiden last week announced what he called an Israeli offer that includes an “enduring cease-fire” and Israeli withdrawal from Gaza if Hamas releases all hostages it is holding.\nISRAELI STRIKES KILL 11 IN CENTRAL GAZADEIR AL-BALAH, Gaza Strip — Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others."}, {"id": "4cc563a5-c84b-43b8-af2f-9de6239b2a94", "title": "Israel airstrike on Syria Aleppo causes casualties , material damage", "date": "2024-06-03 03:45", "url": "http://www.presstv.ir/Detail/2024/06/02/726747/israel-attack-syria-aleppo-material-damage", "message": "The Israeli regime has launched a new act of aggression against Syria’s northwestern city of Aleppo, causing casualties and some material damage.\nSyria’s official SANA news agency, quoting an unnamed military source, said the new airstrike came from the direction of southeastern of Aleppo shortly after the midnight on Monday.\nThe report added that the Israeli strike targeted several locations in the vicinity of Aleppo, leaving a number of people dead while causing some material damage.\nThe statement by the Syrian military source did not specify the number of those killed in the attack and whether they were military personnel or civilians.\nThe regime’s attacks targeted a central site and a residential building in Baniyas city in Syria’s coastal region, as well as the countryside of the eastern Syrian city of Homs."}, {"id": "dbabc77e-f6d4-4dab-99bc-deefb1f84407", "title": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease - fire plan", "date": "2024-06-03 10:30", "url": "https://www.mymotherlode.com/news/middle-east/3368592/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan.html", "message": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease-fire planThe Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease-fire plan View PhotoPalestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nISRAELI STRIKES KILL 11 IN GAZADEIR AL-BALAH, Gaza Strip — Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others."}, {"id": "03bbefc3-cddc-4ca2-a669-3777bb218099", "title": "Israeli Strikes In Central Gaza Kill At Least 11 As The US Pushes A Cease - Fire Plan – 710am KURV", "date": "2024-06-03 14:30", "url": "https://www.kurv.com/israeli-strikes-in-central-gaza-kill-at-least-11-as-the-us-pushes-a-cease-fire-plan/", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ‘ to Hamas in Gaza.\nISRAELI MILITARY REPORTS SHOOTING DOWN MISSILE OVER RED SEATEL AVIV, Israel — The Israeli military says it shot down a surface-to-surface missile fired toward southern Israel from the Red Sea.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others."}, {"id": "f6b8aa0d-22db-4a16-9fd2-d8b589c6e9fb", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan", "date": "2024-06-03 09:15", "url": "https://www.news-gazette.com/news/nation-world/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a/article_c19b7cb1-dd15-5fdc-be9e-ab36412d761c.html", "message": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease-fire planThe Israeli military says the body of a presumed hostage was found in a community near the Gaza border that Hamas militants had attacked on Oct. 7"}, {"id": "8dc9bf4f-a508-46c4-9b94-d3b6f632c2f7", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:30", "url": "https://japantoday.com/category/world/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure", "message": "(AP Photo/Alexander Zemlianichenko)By SAMYA KULLAB and ELISE MORTONUkraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "2b86d725-b4ef-4ee8-a3eb-615c3e4eef28", "title": "Lebanon Hizbollah says strikes Israeli bases as clashes intensify", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/region/lebanons-hizbollah-says-strikes-israeli-bases-clashes-intensify", "message": "It said the attack was in retaliation for Israeli strikes in eastern Lebanon's Bekaa Valley.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hizbollah announcement came several hours afer Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hizbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hizbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "feb1dd8b-9b64-42b1-87c6-7b21f7f8f99e", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:15", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-energy-shutdowns-w05563", "message": "KYIV, Ukraine — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "43ebc480-f618-48c5-aec4-2f9da5f82762", "title": "Hezbollah carries out rocket barrage against Israeli settlement", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-irna04.htm", "message": "Hezbollah carries out rocket barrage against Israeli settlementIRNA - Islamic Republic News AgencyJun 2, 2024Tehran, IRNA -- Lebanon's Hezbollah resistance movement says it has launched dozens of rockets at the Israeli settlement of Kiryat Shmona in northern occupied Palestine.\nMedia reports said on Sunday that the northern regions of occupied Palestine, especially the Galilee area, saw intense missile attacks from Hezbollah across the border from southern Lebanon.\nThe Israeli Channel 12 television network claimed that the Iron Dome system had intercepted 14 of the rockets fired towards Kiryat Shmona.\nIsraeli media have admitted that Hezbollah is only using a fraction of its military capabilities, but its operations have been highly successful and precise in hitting their targets.\nThe resistance group and Israeli forces have been exchanging fire in an almost daily basis since the occupying regime invaded the Gaza Strip in early October."}, {"id": "c6654707-cf49-4964-b2f6-3ca598f24104", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 02:30", "url": "https://www.foxnews.com/us/knife-wielding-florida-teen-allegedly-murders-boy-sleepover-injures-adult-violent-premeditated-attack", "message": "A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff's Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack."}, {"id": "6ad0c46c-7bf6-46f7-8a3e-e54791a0c14a", "title": "Suspected Israel airstrikes kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536379.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike."}, {"id": "7ba9c9c4-f1dc-4b2e-8ec5-38b83fdf2a3c", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536380.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike."}, {"id": "38e24eaa-f8d3-468d-a9a5-83e4ca797f5e", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 06:45", "url": "https://www.thestatesman.com/world/suspected-israel-airstrike-kill-several-people-in-syria-1503306289.html", "message": "An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria’s Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria’s second city of Aleppo is burning following an airstrike.\nAdvertisementSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike.\nThe Israel side did not make any comments to confirm."}, {"id": "bfdf9ebb-f06e-439f-a3e8-98d1b511b5cd", "title": "Israel strikes deeper in south , targets al - Rihan , car in Kawthariyat al - Rez", "date": "2024-06-03 12:45", "url": "https://www.naharnet.com/stories/en/305647-israel-strikes-deeper-in-south-targets-al-rihan-car-in-kawthariyat-al-rez", "message": "As tensions escalated on the Lebanese-Israeli border, the Israeli army shelled Alma al-Shaab and the outskirts of the southern border towns of Mhaybib and al-Naqoura.\nHezbollah, a Hamas ally, has traded regular cross-border fire with Israel since the Palestinian militant group's October 7 attack on southern Israel which triggered the war in the Gaza Strip.\nHezbollah's fighters had bombarded two army bases in the Israeli-annexed Golan Heights Sunday, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said \"approximately 15 projectiles\" had been fired from Lebanon at the Golan Heights and \"fell in open areas\", causing no injuries but starting fires.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "08d2f108-7f2d-4904-aa17-c7bcba6c8272", "title": "Israeli Prime Minister Benjamin Netanyahu accepts invitation to address joint meeting of US Congress", "date": "2024-06-03 05:00", "url": "https://freerepublic.com/focus/f-news/4241834/posts", "message": "Israeli Prime Minister Benjamin Netanyahu accepts invitation to address joint meeting of US CongressCNN ^ | 06/02/2024 | Annie GrayerPosted on by SeekAndFindIsraeli Prime Minister Benjamin Netanyahu has accepted an invitation from US congressional leaders to address a joint meeting of Congress, his office said in a statement Saturday.\nThe top four US congressional leaders on Friday formally invited Netanyahu to address a joint meeting of Congress.\nby 8 posted onby Ciaphas Cain (If they can do that to Trump then they can do that to YOU.\nby 9 posted onby Liz (This then is how we should pray: Our Father who art in heaven, Hallowed be thy name . )\nby 10 posted onby Liz (This then is how we should pray: Our Father who art in heaven, Hallowed be thy name . )"}, {"id": "3fb817c1-08fb-4098-adf8-ce498bedd882", "title": "The Jewish video Obama doesnt want on the web", "date": "2024-06-03 05:00", "url": "https://freerepublic.com/focus/f-news/4241831/posts", "message": "I told you not to drink so much and smoke three blunts on that long plane trip over here.”To: SunkenCivThat’s right.\nIsrael used 26.3% of US aid on its own global defense industry (not on US-made weapons).\n<><>-will allow Israel to update “the lion’s share” of its fighter aircraft,<><>includes purchasing additional F-35 Joint Strike Fighters.\n<><>Israel is to initially receive thirty-three F-35 aircraft,<><>the first two F-35’s will be delivered in December.\nIsrael already has these US munitions in its inventory, and will have no difficulty absorbing the additional US munitions into its armed forces."}, {"id": "33c0293a-fa88-455f-a2cb-51d48b962fdb", "title": "Hezbollah strikes Israel as clashes intensify", "date": "2024-06-03 07:45", "url": "https://www.naharnet.com/stories/en/305647-hezbollah-strikes-israeli-bases-as-clashes-intensify", "message": "As tensions escalated on the Lebanese-Israeli border, the Israeli army shelled Alma al-Shaab and the outskirts of the southern border towns of Mhaybib and al-Naqoura.\nHezbollah, a Hamas ally, has traded regular cross-border fire with Israel since the Palestinian militant group's October 7 attack on southern Israel which triggered the war in the Gaza Strip.\nHezbollah's fighters had bombarded two army bases in the Israeli-annexed Golan Heights Sunday, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said \"approximately 15 projectiles\" had been fired from Lebanon at the Golan Heights and \"fell in open areas\", causing no injuries but starting fires.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "a9f37775-41b5-4fa2-bdd2-6a239126f3eb", "title": "Ukraine war briefing : Kyiv mourns prominent combat medic and journalist killed in action", "date": "2024-06-03 01:00", "url": "https://www.theguardian.com/world/article/2024/jun/03/ukraine-war-briefing-kyiv-mourns-prominent-combat-medic-and-journalist-killed-in-action", "message": "Almost 1,000 mourners gathered in central Kyiv on Sunday for the funeral of a high-profile journalist and volunteer combat medic who was killed in action last week .\n“I am not sorry to die, because I am finally living the life I would like,” it read in part.\nZelenskiy added: “Regrettably, Russia, using Chinese influence on the region, using Chinese diplomats also, does everything to disrupt the peace summit.\nUkraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure.\nIgor Nechiporenko, deputy head of Korochansky district administration, was killed as a result of ammunition detonating, said Belgorod governor Vyacheslav Gladkov on Telegram."}, {"id": "e433355c-db0c-438f-bf8f-f5454a6b5036", "title": "Man stabs 2 foreign residents  for no reason  ", "date": "2024-06-03 07:00", "url": "http://www.koreaherald.com/view.php?ud=20240603050545", "message": "A 37-year-old man has been indicted for attempted murder of two foreign residents in Incheon, local prosecutors said Monday.\nHe told officials that he was drunk and there was \"no particular reason\" for his actions.\nIt is unclear whether the stabbings were part of a random attack against anyone, or against foreigners specifically.\nWhile the suspect launched an attack against four foreigners, Hambak Maeul is a rare village where the majority of its residents are non-Koreans.\nAs of 2023, about 61 percent of its 12,000 residents had foreign nationality."}, {"id": "62853a56-b87b-493b-9607-ecf8cb57563f", "title": "Man stabs 2 foreign residents  for no reason  ", "date": "2024-06-03 07:45", "url": "https://www.koreaherald.com/view.php?ud=20240603050545", "message": "A 37-year-old man has been indicted for attempted murder of two foreign residents in Incheon, local prosecutors said Monday.\nHe told officials that he was drunk and there was \"no particular reason\" for his actions.\nIt is unclear whether the stabbings were part of a random attack against anyone, or against foreigners specifically.\nWhile the suspect launched an attack against four foreigners, Hambak Maeul is a rare village where the majority of its residents are non-Koreans.\nAs of 2023, about 61 percent of its 12,000 residents had foreign nationality."}, {"id": "abce1ab3-1235-4df0-a778-a5e7a55fb375", "title": "Ukraine goes dark following attacks | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-06-03 12:00", "url": "https://www.arkansasonline.com/news/2024/jun/03/ukraine-goes-dark-following-attacks/", "message": "KYIV, Ukraine -- Ukraine imposed emergency power shutdowns in most of the country Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine after Saturday's drone and missile attacks on energy targets that injured at least 19 people.\nUkraine's state-owned power grid operator Ukrenergo said the shutdowns affected industrial and household consumers.\nSustained Russian attacks on Ukraine's power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "d1b23e51-4338-4b27-83c2-397431aefbc3", "title": "Surface - to - surface missile shot down over Red Sea", "date": "2024-06-03 07:45", "url": "https://www.jpost.com/breaking-news/article-804757", "message": "The IDF said it used the Arrow ballistic interceptor on Monday to shoot down a surface-to-surface missile launched in the Red Sea area, after sounding sirens in the port city of Eilat to send residents to shelters.\nThere was no word of any damage or casualties.\nThe military statement did not say who might have launched the missile.\nEilat has come under repeated long-range attack by Yemen's Houthi terrorists in solidarity with the Hamas war in Gaza."}, {"id": "abdbcb86-9164-4552-99e1-3c77fa7685f7", "title": "Donald Trump will be a  loser president  and bring an end to the US as a global  player  if he wins US election and tries to impose peace deal on Ukraine , Zelensky warns", "date": "2024-06-03 09:15", "url": "https://www.dailymail.co.uk/news/article-13487959/donald-trump-loser-president-election-peace-deal-ukraine.html", "message": "Donald Trump will be a 'loser president' and bring about an end to America's status as a global leader should he decide to end aid to Ukraine if he is elected president, Volodymyr Zelensky has declared.\n'Ukraine, barehanded, without weapons, will not be able to fight a multimillion [Russian] army,' Zelensky told the Guardian in an interview in Kyiv last week.\nHe said that failure to continue providing Ukraine with aid and military support would degrade America's reputation as a powerful world leader.\nThe US will not be the leader of the world any more... in terms of international influence it will be equal to zero,' the Ukrainian president declared.\nTrump has previously said he could end the war in Ukraine 'in 24 hours', but never specified how he planned to do so."}, {"id": "8fbc5e52-eb2f-43e7-83db-726e8f111350", "title": "16 - year - old forces way into home , fatally stabs 15 - year - old at sleepover : police", "date": "2024-06-03 03:15", "url": "https://nypost.com/2024/06/02/us-news/16-year-old-forces-way-into-home-fatally-stabs-15-year-old-at-sleepover-police/", "message": "A 16-year-old boy forced his way into a Florida home and fatally stabbed a 15-year-old who was hosting a sleepover with friends, according to police.\nThe 15-year-old victim, Connor Michael Gill, opened the door, and Hernandez fought his way inside and allegedly stabbed him.\nSumter County Sheriff's OfficeThe two victims were airlifted to an area hospital.\nPolice said Hernandez ordered the weapons online Thursday before walking 6 miles and stabbing Sumter County Sheriff\u0092s OfficeThe teen told detectives he ordered the two weapons last Thursday online.\nBoth of the teens were homeschooled, according to police, but it’s not clear how they knew each other."}, {"id": "a749a6ed-4c52-408a-8797-cb8584b986b7", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 13:45", "url": "https://wmmbam.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "1480eed2-ab73-4b7a-a1b2-6bc87f638a21", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 13:45", "url": "https://kste.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "f005f20b-1bf1-4237-826c-f56c06842fbd", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:00", "url": "https://newsradio1170.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "9d939d45-0fd5-4eb2-b2e6-4a8d136c16ed", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:00", "url": "https://knst.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "d6021b18-d5e0-49f1-9f57-fb20074fe705", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:00", "url": "https://590kqnt.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "e87ffbdd-d5be-43e4-9a92-b8fedbf68f7b", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops | 96 . 3", "date": "2024-06-03 14:15", "url": "https://wflapanamacity.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "ba2a710e-f817-422e-9543-44af7230340c", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:15", "url": "https://klvi.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "a802be14-7f16-41e4-8bab-c64e246e57ad", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:30", "url": "https://realradio.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident."}, {"id": "b25e170d-61b3-4a2f-9edd-7a13c5853672", "title": "Teenager denies GBH over 2021 Norwich knife attack", "date": "2024-06-03 07:45", "url": "https://www.edp24.co.uk/news/24358971.teenager-denies-gbh-2021-norwich-knife-attack/", "message": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalised with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year."}, {"id": "15f56045-9b6a-4e84-96ee-23c8997c32f6", "title": "Russia claims capture of village in Ukraine Donetsk region", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/world/russia-claims-capture-village-ukraines-donetsk-region", "message": "File photo of a Soviet-era World War II monument near a destroyed cultural centre near Avdiivka, in Ukraine's Donetsk region taken on March 21 (AFP photo)MOSCOW — Russia's defence ministry claimed on Sunday to have captured a tiny village in the Donetsk region of eastern Ukraine, where it has been on the offensive making territorial gains.\nRussian troops \"have managed to liberate the village of Umanskoye in the popular republic of Donetsk\", the ministry said in reference to the Ukrainian village of Umanske.\nUmanske is a tiny village that had fewer than 180 inhabitants before Russia launched its military offensive in Ukraine in February 2022.\nIt lies about 25 kilometres to the northwest of Donetsk, which is the main city of the region and is under Russian control.\nMeanwhile, a Ukrainian drone attack “on a car this morning” in the Kursk region “wounded three” people, who were taken to hospital, Governor Alexei Smirnov said."}, {"id": "43a48fa6-47b3-4191-bcab-55eb33ccc722", "title": "Hezbollah Targets Israeli Iron Dome Battery With UAVs Day After Downing IDF Drone", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-sputnik03.htm", "message": "Hezbollah Targets Israeli Iron Dome Battery With UAVs Day After Downing IDF DroneSputnik News20240602Ilya TsukanovThe Lebanese militia and political movement has downed three multi-million dollar IDF drones since February amid raging border tensions in the face of Israel's war in Gaza.\nAir raid sirens sounded over northern Israel and the Israeli-occupied Golan Heights on Sunday morning as Hezbollah drones flew across the border undetected and proceeded on to their target - an IDF Iron Dome battery.\nThe Israeli military deployed forces to the area to search for debris.\nThe fighting between Hezbollah and the IDF forced Israel to keep a substantial portion of its military in the north, and has caused hundreds of casualties on both sides.\nNearly 200,000 Lebanese and Israeli civilians have been displaced from border areas by the fighting, with at least 89 Lebanese, 10 Israeli, and 15 Syrian civilians killed to date."}, {"id": "ebb2ac6d-a1b2-4675-8037-6f0229995de7", "title": "  Islamism is a murderous ideology that has nothing in common with our democracy  German minister declares after police officer stabbed by Afghan knife attacker loses his fight for life", "date": "2024-06-03 11:45", "url": "https://www.dailymail.co.uk/news/article-13488551/Islamism-murderous-ideology-common-democracy-German-minister-declares-police-officer-stabbed-Afghan-knife-attacker-loses-fight-life.html", "message": "Chancellor Scholz said he was 'deeply saddened' by the death of the officer.\nThe attacker has been identified as Sulaiman Ataee, 25, who immigrated to Germany from Afghanistan in 2014 when he was just 15.\nMichael Stuerzenberger, an anti-Islam campaigner who was stabbed at the rally organised by Pax Europa, described the attack as an 'absolute nightmare'.\nHe added: 'Every attack is an attack against all of us, against our free democratic state and those who ensure our security.\nThe aftermath of the stabbing is seen in the German city of MannheimDuring the attack bystanders attempted to drag the knifeman away."}, {"id": "7d8edc9c-dfba-4f0c-96b2-00824abf88b2", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 00:15", "url": "https://www.columbian.com/news/2024/jun/02/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure/", "message": "KYIV, Ukraine (AP) — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday’s drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nWithout adequate air defenses to counter assaults and allow for repairs, though, the shortages could still worsen as need spikes in late summer and the bitter-cold winter."}, {"id": "415b3369-778e-4e95-a1a4-c18ac03128ef", "title": "Proposed missile testing , tracking on Guam draws alarm from defense watchdog group", "date": "2024-06-03 12:00", "url": "https://www.guampdn.com/news/proposed-missile-testing-tracking-on-guam-draws-alarm-from-defense-watchdog-group/article_16c0699c-2166-11ef-92d4-3bbfb7d752f4.html", "message": "In a newly released 378-page document from the Missile Defense System, the proposed action on Guam would include launching a standard missile or SM-3 or interceptor against a medium-range ballistic missile or target.\n“Everybody talks about a missile attack on Guam, but it’s ironic that the first missile attack will be by a U.S. missile,” Underwood said, referring to the proposed twice-a-year missile testing and tracking out of Andersen.\n“The immediate concern is how much disruption will this cause...first we’re talking about missile defense.\n‘It’s disturbing’Military leaders previously confirmed there could be up to 20 sites across Guam for the proposed 360-degree missile defense system.\nThe proposed action on Guam would include launching a standard missile or SM-3 or interceptor against a medium-range ballistic missile or target."}, {"id": "e66ce21e-7628-485b-aed9-e30c19dd20bd", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:00", "url": "https://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel."}, {"id": "353a8370-f4bc-4618-a58f-2b51109c0f77", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:30", "url": "http://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel."}, {"id": "9c23df79-273d-4459-99d0-ccf3d8b48697", "title": "At least 12 killed in Israeli attack on Syria Aleppo region", "date": "2024-06-03 08:15", "url": "https://www.thenationalnews.com/news/mena/2024/06/03/at-least-12-killed-in-israeli-attack-on-syrias-aleppo-region/", "message": "An overnight Israeli attack on Syria's northern province of Aleppo has caused several deaths and damage, with a war monitor saying at least 16 people were killed.\nIsrael launched the attack after midnight from a position south-east of Aleppo, a Syrian military source told state news agency Sana on Monday.\nIts missiles pounded areas around Aleppo city, leading to “several martyrs and some damage”, the source said.\nA military source in Aleppo told The National that among the dead and wounded were fighters from Iraqi and other Iranian-backed factions.\nAttacks have increased since Israel launched its war on Gaza in response to an attack by Iran-backed Palestinian militant group Hamas on October 7."}, {"id": "3abcd473-7d1d-4939-b788-c1f6bfdd67fa", "title": "At least 12 killed in Israeli attack on Syria Aleppo region", "date": "2024-06-03 09:15", "url": "https://www.thenationalnews.com/news/mena/2024/06/03/aleppo-israel-syria/", "message": "An overnight Israeli attack on Syria's northern province of Aleppo has caused several deaths and damage, with a war monitor saying at least 16 people were killed.\nIsrael launched the attack after midnight from a position south-east of Aleppo, a Syrian military source told state news agency Sana on Monday.\nIts missiles pounded areas around Aleppo city, leading to “several martyrs and some damage”, the source said.\nA military source in Aleppo told The National that among the dead and wounded were fighters from Iraqi and other Iranian-backed factions.\nAttacks have increased since Israel launched its war on Gaza in response to an attack by Iran-backed Palestinian militant group Hamas on October 7."}, {"id": "c5410118-41f9-47e9-87bc-7d70902989d4", "title": "Yemen Houthis launch 2nd strike on U . S . aircraft carrier in less than 24 hours", "date": "2024-06-03 07:15", "url": "http://en.people.cn/n3/2024/0603/c90000-20177274.html", "message": "Yemen's Houthis launch 2nd strike on U.S. aircraft carrier in less than 24 hoursXinhua) 11:04, June 03, 2024SANAA, June 2 (Xinhua) -- Yemen's Houthi group said Saturday night it had launched fresh attacks on the U.S. aircraft carrier Eisenhower, another U.S. warship and four commercial cargo vessels in the Red Sea and Arabian Sea.\nThat marked the group's second strike against Eisenhower in less than 24 hours, Houthi military spokesman Yahya Sarea said on Houthi-run al-Masirah TV.\nThere was no immediate comment from the U.S. Navy or the targeted shipping companies.\nThe targeted ships included MAINA, ALORAIQ, and ABLIANI.\nIn response, the U.S.-British naval coalition stationed in the waters has since January conducted air raids and missile strikes against Houthi targets."}, {"id": "9f1f13ad-0810-4e40-8394-a96b893a3b78", "title": "  Nowhere in Gaza is safe  for Palestinians in Rafah - Asia News NetworkAsia News Network", "date": "2024-06-03 03:00", "url": "https://asianews.network/nowhere-in-gaza-is-safe-for-palestinians-in-rafah/", "message": "June 3, 2024RAFAH – The intensifying Israeli military offensive in Rafah, a southern city in the Palestinian territory of Gaza, has left displaced Palestinians who had been sheltering there in even more of a predicament as food supplies and safe areas become scarce.\nThe airstrike hit a neighborhood adjacent to Al-Mawasi, a coastal district the Israeli military had designated as a “humanitarian zone.” The area was packed with basic tents erected by displaced Palestinians.\n“Enough is enough.”In May, the Israeli military warned people in eastern Rafah to evacuate to coastal areas such as Al-Mawasi.\nRelief and Works Agency for Palestine Refugees in the Near East (UNRWA), about 945,000 people have been displaced from Rafah since the Israeli military operation there began.\nThe situation in Rafah is chaotic as people seek shelter, and getting food and water there is becoming increasingly difficult."}, {"id": "d62f75e3-22f7-4e4c-9c0d-394c24f78234", "title": "Teenager denies GBH over 2021 Norwich knife attack | Norwich Evening News", "date": "2024-06-03 06:00", "url": "https://www.eveningnews24.co.uk/news/24358971.teenager-denies-gbh-2021-norwich-knife-attack/", "message": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalised with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year."}, {"id": "1cf3d027-6752-4675-88f4-5d880775507f", "title": "LIVE UPDATES : Families mourn another night of deadly attack in Gaza", "date": "2024-06-03 11:45", "url": "http://thepeninsulaqatar.com/article/03/06/2024/live-updates-families-mourn-another-night-of-deadly-attack-in-gaza", "message": "Palestinian men walk past damaged buildings after an overnight Israeli strike in al-Bureij camp in the central Gaza Strip on June 3, 2024.\n(Photo by Eyad Baba / AFP)Doha, Qatar: Fresh strikes were reported across Gaza Strip overnight as mediators urged for a truce deal.\nThe situation continues to be difficult also in the far south of the Gaza Strip.\nAn Israeli airstrike targeted the vicinity of the European Gaza Hospital near Khan Younis in the southern Gaza Strip.\nSarhan pleaded for the UN and other international organisations to “intervene immediately to deliver aid to the Gaza Strip”."}, {"id": "5c52c2c9-b2a5-4cef-a563-7ea2694339af", "title": "Several killed by suspected Israeli strikes in Syria – Report", "date": "2024-06-03 10:30", "url": "https://punchng.com/several-killed-by-suspected-israeli-strikes-in-syria-report/", "message": "“The death toll of the Israeli strike on a factory in Hayyan in western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters,” said the Syrian Observatory for Human Rights.\nThe Britain-based Observatory, which relies on a network of sources inside Syria, had initially reported 12 dead.\nWhile Israel rarely comments on individual strikes in Syria, it has repeatedly said it will not allow arch-enemy Iran to expand its presence there.\nAccording to the Observatory, Israeli strikes on Wednesday in western and central Syria killed a girl and six fighters working with Hezbollah, including three Syrians.\nIn March, the Observatory said Israeli air strikes near Aleppo airport killed 52 people — 38 government soldiers, seven Hezbollah members and seven Syrian pro-Iran fighters."}, {"id": "622edf7c-95e3-4ed3-bba1-0ee54e691b39", "title": "Ukrainian Drones Attack Lukoil Refinery In Komi", "date": "2024-06-03 07:30", "url": "https://charter97.org/en/news/2024/6/3/597439/", "message": "Ukrainian Drones Attack Lukoil's Refinery In Komi 8 3.06.2024, 7:4620,294It is 1800 kilometres from the enterprise to the border with Ukraine.\nRussian propagandists said that on the afternoon of June 2, an explosion was heard in the town of Ukhta in the Republic of Komi near the Lukoil oil refinery.\nThen the Russian Ministry of Emergency Situations published a photo of the damaged tank and claimed about the deaths, liga.net writes.\nTwo Russians died of gas poisoning and burns, while three others were injured in the incident, Russian authorities claim.\nIt is about 1,800 kilometres from here to the Ukrainian border."}, {"id": "51b8e6a5-99dc-4da3-a1d7-d59fa1aa16fe", "title": "US Air Force awards first Joint Strike Missile contract - Australian Defence Magazine", "date": "2024-06-03 03:15", "url": "https://www.australiandefence.com.au/news/news/us-air-force-awards-first-joint-strike-missile-contract", "message": "Kongsberg Defence and Aerospace has been awarded a US$141 million (~$212 million) contract by the US Air Force (USAF) to provide the service with an initial lot of the Kongsberg-Raytheon Joint Strike Missile (JSM).\nThe contract, which covers work through the end of August 2026, is for an undisclosed number of all up JSM rounds, containers, and test equipment for the missile.\nBAE Systems Australia is a key supplier on the JSM as it provides a passive radio frequency sensor to all up rounds.\nDespite this, Australia is yet to order the missile, which can be carried internally by Block 4 F-35As and Cs.\nThe recently released 2024 Integrated Investment Plan (IIP) states simply that \"Defence is also investigating the integration of the Joint Strike Missile for the F‑35A.\""}, {"id": "d4f598cb-d73b-4890-a76a-fba80f04f55c", "title": "Israeli Aggression on Positions in Vicinity of Aleppo Claims Number of Civilian Martyrs", "date": "2024-06-03 12:45", "url": "https://english.almanar.com.lb/2124828", "message": "A number of civilians were martyred at dawn on Monday in an Israeli missile aggression that targeted a number of points in vicinity of Aleppo city.\n“At approximately 00:20 a.m. at dawn on Monday, the Israeli enemy launched an aerial attack with missiles from a direction of southeast Aleppo, targeting a number of points in the vicinity of Aleppo city, and the army air defenses intercepted the aggression’s missiles and shot down some of them.” a military source told SANA reporter.\nThe source added that the aggression led to the martyrdom a number of civilians, and some material losses to the property.\nSource: SANA"}, {"id": "943fef90-ffe2-4422-b96f-02d0786080a5", "title": "الوكالة الوطنية للإعلام - Security update : One dead in enemy motorcycle strike in Naquora", "date": "2024-06-03 13:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/699043/security-update-one-dead-in-enemy-s-motorcycle-str", "message": "NNA - The Israeli enemy airstrike, which targeted a motorcycle in the southern Lebanese town of Al-Naqoura earlier on Monday, resulted in one fatality and another injury.\nAdditionally, enemy artillery shelling on the eastern side of Alma Al-Shaab caused fires in the region.\n==================R.H."}, {"id": "c91d78b0-ef47-4e1e-827f-0c3f650bbab2", "title": "الوكالة الوطنية للإعلام - Security update : One dead in enemy motorcycle strike in Naquora", "date": "2024-06-03 13:00", "url": "https://www.nna-leb.gov.lb/en/security-law/699043/security-update-one-dead-in-enemy-s-motorcycle-str", "message": "NNA - The Israeli enemy airstrike, which targeted a motorcycle in the southern Lebanese town of Al-Naqoura earlier on Monday, resulted in one fatality and another injury.\nAdditionally, enemy artillery shelling on the eastern side of Alma Al-Shaab caused fires in the region.\n==================R.H."}, {"id": "8022d949-7aa1-45be-bddd-9c7cb52f748c", "title": "Major War Maneuvers in Europe Under US Command , by Manlio Dinucci", "date": "2024-06-03 08:15", "url": "https://www.voltairenet.org/article220978.html", "message": "At the same time, Poland announced its purchase of long-range missiles from the United States and declared that it was ready to host NATO nuclear weapons.\nSweden did the same: as soon as it joined NATO, it stated that it was available to host US nuclear weapons in the event of war.\nFrance has tested a new air-launched nuclear missile and has allocated 13% of its military budget to upgrading its nuclear weapons.\nThe ones carrying out attacks of this type against Russia are US forces and NATO forces under US command.\nCountries like Italy, which “host” US nuclear weapons, violating the Non-Proliferation Treaty, are therefore transformed into the front line of a nuclear confrontation with Russia, more dangerous than that of the Cold War."}, {"id": "c7e735e4-9aaa-427b-b7c0-ca67b0841b1f", "title": "Russian Army Advances In Kharkiv , As Western Nations Permit Ukraine To Strike Targets In Russia", "date": "2024-06-03 06:30", "url": "https://menafn.com/1108285490/Russian-Army-Advances-In-Kharkiv-As-Western-Nations-Permit-Ukraine-To-Strike-Targets-In-Russia", "message": "Russian forces are now advancing west towards Chasiv Yar, aiming to control the high ground to approach the strategic city of Kramatorsk.\nBoth Russian military bloggers and Ukraine's DeepStateMap report minor Russian advances into recaptured Ukrainian territory.\nWestern nations permit Ukraine to strike targets in Russia, sparking nuclear concernsIn a significant policy shift, Germany has joined several NATO members in allowing Ukraine to use German-supplied weapons against targets within Russia's borders.\nFrench President Emmanuel Macron argued that Ukraine should be able to target specific Russian military sites, while Poland and Denmark have also authorised the use of their weapons against Russian targets.\nPreviously, Russian President Vladimir Putin had threatened“serious consequences” if Western countries allowed Ukraine to strike targets within Russia."}, {"id": "19982581-3282-42d9-bf45-f683add9c9ca", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo : NGO", "date": "2024-06-03 07:00", "url": "https://www.bssnews.net/international/192788", "message": "BEIRUT, June 3, 2024 (BSSAFP) - At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defence said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests."}, {"id": "6b4f1224-dc91-4d3f-a1b9-6d69dc4b962a", "title": "Israeli Hermes 900 drone downed by Hezbollah missile over south Lebanon", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240601-presstv06.htm", "message": "Lebanon's al-Manar television channel, citing a brief Hezbollah statement, reported that the group targeted and downed an Israeli Hermes 900 drone with appropriate weapons over Lebanese territory on Saturday afternoon.\nIt says the Hermes 900 drone was hit by a surface-to-air missile while operating in the area.\nIt marks the fourth Israeli drone to be shot down by Hezbollah over southern Lebanon.\nIn all, two Hermes 450 drones and two Hermes 900 models have been downed in recent months.\nEarlier on Saturday, an Israeli drone targeted a motorcycle on a road in Majdel Selm village of the Marjeyoun district in southern Lebanon."}, {"id": "ea0a67a8-1079-4a94-ba5c-daa9741ea3a9", "title": "1 arrested after stabbing a man in northeast Atlanta", "date": "2024-06-03 06:30", "url": "https://www.wsbtv.com/news/local/1-arrested-after-stabbing-man-northeast-atlanta/OJ5CFV6Y2FHUZPBNZBXHVCVUGY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "9b2c0562-fc45-4b47-8688-e128199d2eb5", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 00:30", "url": "http://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel."}, {"id": "a72ad96f-e372-4b41-b4e9-d45b4cdcb880", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 01:00", "url": "https://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel."}, {"id": "961a20f6-01e9-4223-916e-7b6cd5765e61", "title": "Man stabbed to death by armed thugs in Nakuru , police launch probe", "date": "2024-06-03 10:00", "url": "https://www.the-star.co.ke/news/realtime/2024-06-03-man-stabbed-to-death-by-armed-thugs-in-nakuru-police-launch-probe/", "message": "Detectives are investigating the tragic death of a man who was attacked and fatally stabbed by suspected thugs in the Kaptembwo area of Nakuru.\nThe incident occurred on the night of Friday, May 31, as the man and a woman were walking home.\nThe victim was rushed to the local hospital where he succumbed to the injuries, police said.\nElsewhere, police are investigating the murder of a 33-year-old man whose body was found in his house in Kikuyu Town, Kiambu County.\nHe was rushed to a local hospital where doctors pronounced him dead."}, {"id": "846d11f1-1154-4b06-965d-4708f3c83b1a", "title": "Man stops officer , arrested for allegedly stabbing another man in downtown Portland", "date": "2024-06-03 00:15", "url": "https://www.yahoo.com/news/man-stops-officer-arrested-allegedly-213635555.html", "message": "PORTLAND, Ore. (KOIN) — After flagging down police, a man was arrested for allegedly stabbing another man moments earlier in downtown Portland early Saturday morning.\nAccording to PPB, a man – identified as 41-year-old Basir Noorzai – grabbed the attention of an officer near Southwest 4th Avenue and Main Street just after midnight, claiming he was being chased by three other men.\nPortland woman jumps from car, man faces kidnapping, sex abuseHowever, officers reportedly found out one of the men chasing Noorzai had been stabbed by him during an earlier fight on the waterfront near the Hawthorne Bridge.\nNoorzai then tried to run from police with the knife in his possession, but was soon arrested for assault, unlawful use of a weapon and a parole violation.\nThe stabbing victim then went to the hospital with non life-threatening injuries, authorities say."}, {"id": "e5bea519-a800-457d-a96b-3d10f8f75924", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo", "date": "2024-06-03 10:00", "url": "https://www.naharnet.com/stories/en/305648-12-pro-regime-fighters-killed-in-israeli-strike-near-syria-s-aleppo", "message": "At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defense said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests."}, {"id": "49864827-405a-4224-97b9-f0213f74f3e3", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo", "date": "2024-06-03 08:30", "url": "https://www.naharnet.com:443/stories/en/305648-12-pro-regime-fighters-killed-in-israeli-strike-near-syria-s-aleppo", "message": "At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defense said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests."}, {"id": "821cd75f-1a0b-4417-a764-c912de209de2", "title": "Man arrested after 2 women killed , man injured in Springfield", "date": "2024-06-03 01:15", "url": "https://www.bostonglobe.com/2024/06/02/metro/man-arrest-2-women-killed-man-injured-springfield-stabbings/", "message": "Upon arrival, officers found two women, whose identities have not been released, suffering from stab wounds.\nBoth died at the scene, according to the statement.\nA suspect is in custody after two women were killed and a man was seriously injured in a series of stabbings at a Springfield home on Sunday morning, officials said.\nA third victim, a man, was later found and taken to Baystate Medical Center in Springfield with serious injuries, according to the statement.\nMembers of the Springfield Police Homicide Unit and the Hampden district attorney’s office are investigating the stabbings, according to the statement."}, {"id": "87b29d8e-9789-45e6-922e-a4612e1ec59e", "title": "Iran supreme leader Khamenei says Israel headed for  destruction  ", "date": "2024-06-03 12:30", "url": "https://92newshd.tv/about/iran-s-supreme-leader-khamenei-says-israel-headed-for-destruction", "message": "Iran's supreme leader Khamenei says Israel headed for 'destruction'TEHRAN (AFP) - Iran's supreme leader Ayatollah Ali Khamenei on Monday praised Hamas's unprecedented October 7 attack against Israel and predicted the ‘destruction’ of their common enemy.\nWhile Israel and Iran have long fought a shadow war of killings and sabotage, Iran's armed allies across the Middle East have formed a so-called \"Axis of Resistance\" alliance.\nAs the Gaza war has raged, Iran and Israel came to the brink of war in mid-April when Tehran launched a barrage of rockets and missiles at Israel, most of which were intercepted.\nIran has said it had no advance knowledged of Hamas's October 7 attack but has praised it since.\nThe Gaza war was sparked by Hamas's October 7 attack, which resulted in the deaths of 1,190 people, mostly civilians, according to an AFP tally based on Israeli official figures."}, {"id": "18121dc0-3956-440a-a189-cd53b3c29651", "title": "Rafah Battles Intensify As Israel Takes Over Gaza - Egypt Border Strip", "date": "2024-06-03 04:30", "url": "https://menafn.com/1108287494/Rafah-Battles-Intensify-As-Israel-Takes-Over-Gaza-Egypt-Border-Strip", "message": "The Israeli forces launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken \"operational control\" of the narrow border area, where he said troops had \"discovered around 20 tunnels\".\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nWitnesses also said Israeli forces had demolished several buildings in the city's eastern areas where the Israeli incursion began on May 7, initially focusing on the vital Rafah border crossing, a key entry point for humanitarian aid.\nA steady stream of civilians have fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts."}, {"id": "fe7b254b-b693-4927-a100-41da7170a043", "title": "Real target of Hackney shooting says he wishes he had been shot in the head instead of little girl still fighting for her life in hospital", "date": "2024-06-03 00:45", "url": "https://www.dailymail.co.uk/news/article-13486937/Real-target-Hackney-shooting-said-wished-shot-head-instead-little-girl-fighting-life-hospital.html", "message": "The real target of the Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nBeytullah Gunduz, 37, who has links to the Turkish criminal world, attended a restaurant in Dalston, east London on May 29.\nOfficers were called at around 9.20pm on May 29 to reports of a shooting near Evin restaurant on Kingsland High Street.\nThe real target of Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nHe is reported as saying 'that little girl is an innocent person'."}, {"id": "6543da5d-9838-43bd-b635-a88cda6dcaad", "title": "Man accused of waterfront stabbing arrested after seeking police help", "date": "2024-06-03 07:15", "url": "https://katu.com/news/local/man-accused-of-waterfront-stabbing-arrested-after-seeking-police-help-hawthrone-bridge-portland-multnomah-county-oregon", "message": "A man accused of stabbing another man during a fight near the waterfront last night has been arrested.\nPortland Police say the suspect waived down a police officer after the stabbing for help.\nOfficers determined that one of the men chasing Noorzai had been stabbed by him during a fight near the Hawthorne Bridge.\nNoorzai then reportedly tried to run from the officer, but she caught up to him.\nAccording to Portland Police, the officer saw Noorzai had a knife in his hand and ordered him to set it down."}, {"id": "0d9a574f-d5dc-435d-9dc0-dd79ac6e342a", "title": "Palwal firing incident :  Around 10 - 15 individuals fired at my residence , says BJP MLA Jagdish Nair", "date": "2024-06-03 06:15", "url": "https://news.webindia123.com/news/Articles/India/20240603/4202857.html", "message": "Bharatiya Janata Party MLA from Hodal Assembly, Jagdish Nair, has responded to the firing incident that took place at his residence, stating that unidentified bikers arrived and abused his staff.\nWhen his staff attempted to stop them, the accused opened fire on his residence.\nJagdish Nair, the MLA allegedly targeted in the attack, asserted, \"Approximately 10-15 individuals arrived on motorcycles and began abusing my staff.\nMeanwhile, a team of police officials inspected Nair's residence on Sunday, following the alleged shooting incident.\nThe Investigation Officer (IO) Sanjay Kumar said, \"The incident took place on June 1, at around 5.30 pm, when 10-15 individuals arrived on bikes and fired shots at the MLA's residence."}, {"id": "ab99288b-e1a1-41f7-9694-8754681a1427", "title": "A New Kind of Volcano Just Dropped : the Stomp - Rocket Eruption", "date": "2024-06-03 12:45", "url": "https://www.popularmechanics.com/science/environment/a60963332/kilauea-stomp-rocket-eruption-discovery/", "message": "The 12 back-to-back explosions at the Kilauea volcano in Hawaii in 2018 might be in a new category of volcanic eruption.\nPressurized magmatic gas forced gas and rock to erupt in this “rare” event akin to a stomp-rocket toy.\nFinding that volcanic eruptions can now go off just like a stomp rocket ... well... that isn’t so dandy.\nAs researchers studied the situation—a process known as “hindcasting” in the volcanic world—there was also no evidence for significant groundwater in the volcanic event.\nAnd with the U.S. Geological Survey’s Hawaiian Volcano Observatory blanketing Kilauea with scientific instruments, there was plenty of data to mine."}, {"id": "7e334918-7e3f-45e1-8cb6-dfc5e23bcfd2", "title": "Israeli army investigates deadly events", "date": "2024-06-03 06:00", "url": "https://www.postcourier.com.pg/israeli-army-investigates-deadly-events/", "message": "In one of the highest-profile cases, an attack on a World Central Kitchen convoy that killed five foreign aid workers, the Israeli army promptly published its findings, acknowledged misconduct by its forces and dismissed two soldiers.\nIsrael’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe military refused to disclose the full list of investigations and told the AP it could only respond to queries about specific probes.\nSunday’s strike killed at least 45 people and caused widespread destruction.\nHagari said the destruction may have been caused by secondary explosions, possibly from Palestinian militants’ weapons in the area."}, {"id": "7e86d6c6-b7e9-413f-ab53-348d60ae3dd2", "title": "Russia attacks Ukraine energy grid", "date": "2024-06-03 01:30", "url": "https://www.bostonherald.com/2024/06/02/russia-attacks-ukraines-energy-grid/", "message": "KYIV, Ukraine — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nFollowing Saturday’s barrage, Ukraine’s air force said Sunday that air defenses had shot down all 25 drones launched overnight.\nRussia claimed Sunday that it had taken control of the village of Umanske in the partially Russian-occupied Donetsk region."}, {"id": "479f30ea-94be-4d39-9a12-95410a177434", "title": "Two Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287310/Two-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- Nam News Network) BEIRUT, Jun 3 (NNN-NNA) – Two people were killed and four others yesterday, in an Israeli on the south-eastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that, an Israeli warplane bombed a house in central Houla, with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region, and fired 70 shells on 13 villages and towns, in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group, Hezbollah, said, it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.– NNN-NNA"}, {"id": "fb48edd0-0491-4c0f-a45a-f9cf98608f0d", "title": "Mob boss of gang targeted in drive - by restaurant shooting in Dalston which left girl , nine , fighting for her life was  linked to hit in Spain  weeks earlier", "date": "2024-06-03 11:45", "url": "https://www.dailymail.co.uk/news/article-13488359/Mob-boss-gang-targeted-drive-restaurant-shooting-Dalston.html", "message": "The kingpin of the gang targeted in a drive-by restaurant shooting which left a nine-year-old girl fighting for her life was linked to a hit in Spain just weeks earlier, it has emerged.\nThree men with ties to the drugs gang 'Bombacilar' - also known as the Hackney Bombers - were injured in the shooting in Dalston, north east London, on May 29.\nBut a leading gangster in Baybasin's old mob was the intended target of the Dalston shooting, sparking fears it could have been a revenge hit.\nBaybasin, who uses a wheelchair after being shot by a rival, was released from prison in Turkey in 2017.\nThe target in Dalston escaped unharmed but a stray bullet left a nine-year-old girl in a critical condition."}, {"id": "87f92b18-7814-4a3c-b5fe-3652f694536b", "title": "Energy shutdowns hit Ukraine after attacks | News , Sports , Jobs", "date": "2024-06-03 09:30", "url": "https://www.thealpenanews.com/news/international-news-apwire/2024/06/energy-shutdowns-hit-ukraine-after-attacks/", "message": "KYIV, Ukraine (AP) — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday’s drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "adc8c9f5-f5a0-4e2f-8cd4-96bc0db1076b", "title": "Russia warns US against  fatal  miscalculation in Ukraine", "date": "2024-06-03 09:15", "url": "https://www.yahoo.com/news/russia-warns-us-against-fatal-084737006.html", "message": "MOSCOW (Reuters) - Russian Deputy Foreign Minister Sergei Ryabkov said on Monday the United States could face \"fatal consequences\" if it ignored Moscow's warnings not to let Ukraine use weapons provided by Washington to strike targets inside Russia.\nRyabkov was commenting on President Joe Biden's decision last week to approve the use of U.S.-supplied weapons to hit targets inside Russia that were involved in attacks on Ukraine's Kharkiv region.\nPutin said the West would be directly involved in any use of its weapons by Ukraine to strike deep inside Russia, because such attacks would require its satellite, intelligence and military help.\nUkraine has long argued that restrictions on the way it can use Western-supplied weapons are seriously limiting its ability to defend itself.\nA Kyiv intelligence source said last week that a Ukrainian drone had targeted a long-range radar deep inside Russia that is part of Russia's early-warning system to detect whether it is under nuclear attack."}, {"id": "bfcfa9e5-22ab-4d90-bbc1-d0ac5e822742", "title": "Russia warns US against  fatal  miscalculation in Ukraine", "date": "2024-06-03 12:15", "url": "https://www.thestar.com.my/news/world/2024/06/03/russia-warns-us-against-039fatal039-miscalculation-in-ukraine", "message": "MOSCOW (Reuters) - Russian Deputy Foreign Minister Sergei Ryabkov said on Monday the United States could face \"fatal consequences\" if it ignored Moscow's warnings not to let Ukraine use weapons provided by Washington to strike targets inside Russia.\nRyabkov was commenting on President Joe Biden's decision last week to approve the use of U.S.-supplied weapons to hit targets inside Russia that were involved in attacks on Ukraine's Kharkiv region.\nPutin said the West would be directly involved in any use of its weapons by Ukraine to strike deep inside Russia, because such attacks would require its satellite, intelligence and military help.\nUkraine has long argued that restrictions on the way it can use Western-supplied weapons are seriously limiting its ability to defend itself.\nA Kyiv intelligence source said last week that a Ukrainian drone had targeted a long-range radar deep inside Russia that is part of Russia's early-warning system to detect whether it is under nuclear attack."}, {"id": "323454f9-5de8-4e5a-8b36-5b6e55f74953", "title": "Egypt urges Israeli withdrawal from Rafah crossing amid Gaza ceasefire talks", "date": "2024-06-03 08:45", "url": "https://www.dailynewsegypt.com/2024/06/03/egypt-urges-israeli-withdrawal-from-rafah-crossing-amid-gaza-ceasefire-talks/", "message": "The tripartite Egyptian-American-Israeli meeting in Cairo concluded with Egypt maintaining its stance on the necessity of Israeli withdrawal from the Rafah crossing, according to Egyptian media reports.\nThe official Israeli Broadcasting Authority announced that an Israeli security delegation would travel to Cairo on Sunday to discuss the reopening of the Rafah border crossing, to facilitate humanitarian aid into the Gaza Strip.\nDuring these security meetings, Israeli and American officials will engage in discussions.\nIsrael has reportedly informed Egypt of its readiness to withdraw Israeli army forces from the crossing, relocating them to another position based on operational considerations.\nFurthermore, CBS News quoted an Israeli official who revealed that the War Council and Israeli Prime Minister Benjamin Netanyahu have agreed to a hostage exchange proposal."}, {"id": "bf97c193-a695-44bc-aaca-83dac273d98f", "title": "Inside united kingdom chilling nuclear deterrent as Keir Starmer makes national security vow", "date": "2024-06-03 11:45", "url": "https://www.mirror.co.uk/news/politics/inside-uks-chilling-nuclear-deterrent-32946290", "message": "Labour leader Keir Starmer has committed to a nuclear deterrent 'triple lock' as he declares Labour as the 'party of national security' in a General Election campaign speechKeir Starmer has kicked off the next week of the election campaign with an iron-cast guarantee to secure the UK's nuclear deterrent.\nThe Labour leader has committed to a nuclear deterrent \"triple lock\" as he seeks to switch the election campaign's attention to defence.\nAs the world faces increasing global threats, Mr Starmer pitched Labour as the \"party of national security\" in contrast with 14 years of Tory chaos.\nThe Mirror has taken a dive into Labour's nuclear deterrent plans.\nThe continuous at sea deterrent is \"the most capable, resilient, and cost-effective platform on which to deploy our independent nuclear deterrent\", it adds."}, {"id": "f7494439-4ba4-40a6-83e7-b69d5199cba8", "title": "Teen girl killed in Reserve shooting | Crime / Police", "date": "2024-06-03 00:45", "url": "https://www.theadvocate.com/baton_rouge/news/crime_police/teen-girl-killed-in-reserve-shooting/article_d52ce074-2f93-593d-8d3e-0458e85bcf31.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "7f0e0f5c-eef0-44f9-aabf-a2aad95989fe", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 03:45", "url": "https://wfin.com/fox-national-news/knife-wielding-florida-teen-allegedly-murders-boy-at-sleepover-injures-adult-violent-premeditated-attack/", "message": "​A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff’s Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack."}, {"id": "f107e2a7-fd1e-49ce-83c2-fd092fb29bed", "title": "Teen girl killed in Reserve shooting | Crime / Police", "date": "2024-06-03 02:15", "url": "https://www.nola.com/news/crime_police/teen-girl-killed-in-reserve-shooting/article_3c4489f8-2127-11ef-9389-3f6bba69f1e7.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "081af46d-1854-42b1-9d41-9730239b2018", "title": "Tension Escalates : Deadly Israeli Airstrikes Hit Syria Again", "date": "2024-06-03 00:30", "url": "https://www.devdiscourse.com/article/law-order/2959004-tension-escalates-deadly-israeli-airstrikes-hit-syria-again", "message": "A number of people were killed in an Israeli air attack targeting sites in the vicinity of the Syrian city of Aleppo on Monday, Syrian state media said citing a military source, the second reported attack on the country in less than a week.\nThe strikes at around 12:20 a.m. (2120 GMT on Sunday) \"led to a number of fatalties and some material damage\", the source said, without elaborating.\nIsrael launched air attacks on May 29 on Syria's central region as well as the coastal city of Baniyas,killing a child and injuring ten civilians, according to Syrian state media.\nIn April, Iran retaliated by firing missiles at Israel after a presumed Israeli strike that destroyed a building in Iran's embassy compound in Damascus and killed several Iranian officers including a top general.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "7036032e-032f-46dc-9546-a2b771918826", "title": "Israeli strikes on refugee camps in central Gaza kill at least 11", "date": "2024-06-03 14:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/03/israeli-strikes-on-refugee-camps-in-central-gaza-kill-at-least-11/", "message": "Israeli strikes have killed 11 people overnight, including a woman and three children, in central Gaza, Palestinian health officials said.\nA strike on a home in the built-up Bureij refugee camp late on Sunday killed four people, including the three children.\nThe second strike in the early hours of Monday killed seven people, including a woman, in the Nuseirat refugee camp.\nThe country launched its war in Gaza after Hamas’ October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people – mostly civilians – and abducted about 250.\nIsrael says around 100 hostages are still being held in Gaza, along with the bodies of around 30 more."}, {"id": "b71a6c37-8734-4328-95b0-83dd8ee7d091", "title": "Russia warns US against  fatal  miscalculation in Ukraine", "date": "2024-06-03 12:45", "url": "https://www.rappler.com/world/europe/russia-warns-united-states-fatal-miscalculation-ukraine/", "message": "A member of a drone unit of Ukraine's 58th Motorized Brigade takes cover from drones in a forest near the front line in the Donetsk region, amid Russia's attack on Ukraine, Ukraine April 9, 2024.\nRyabkov was commenting on President Joe Biden’s decision last week to approve the use of US-supplied weapons to hit targets inside Russia that were involved in attacks on Ukraine’s Kharkiv region.\nPutin said the West would be directly involved in any use of its weapons by Ukraine to strike deep inside Russia, because such attacks would require its satellite, intelligence and military help.\nUkraine has long argued that restrictions on the way it can use Western-supplied weapons are seriously limiting its ability to defend itself.\nA Kyiv intelligence source said last week that a Ukrainian drone had targeted a long-range radar deep inside Russia that is part of Russia’s early-warning system to detect whether it is under nuclear attack."}, {"id": "267efa42-8ef3-450d-9626-eff84cfccabf", "title": "Breakthrough : Israel Accepts Biden Gaza Plan - Novinite . com", "date": "2024-06-03 13:30", "url": "https://www.novinite.com/articles/226431/Breakthrough:+Israel+Accepts+Biden", "message": "Israel has agreed to the proposed ceasefire framework presented by US President Joe Biden to end the conflict in Gaza.\nBiden's ceasefire proposal garnered support from Egypt and Qatar and encompasses three stages.\nThe initial phase, lasting six weeks, entails a comprehensive ceasefire, the withdrawal of Israeli forces from Gaza settlements, and the release of hostages and prisoners.\nHumanitarian aid will be significantly increased, with Israel gradually withdrawing from Gaza as Hamas releases hostages and returns bodies of prisoners.\nDespite this, Biden remains optimistic about the proposal's potential to create a better future for Gaza without Hamas in power."}, {"id": "e991eabd-8756-4090-8a79-e5a1f24cb664", "title": "Hezbollah Says Launched Series Of Retaliatory Attacks On Israel", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108286880/Hezbollah-Says-Launched-Series-Of-Retaliatory-Attacks-On-Israel", "message": "(MENAFN- Khaleej Times) Published: Sat 1 Jun 2024, 4:19 PMLebanese Hezbollah said it launched a series of on Israeli military positions on Saturday after state reported Israel had stepped up its own strikes the night before.\nSince the start of the war in the Gaza Strip between Israel and Hamas on October 7, Hezbollah has exchanged almost daily fire with the Israeli army.\nThe Israeli military said in a statement that \"two Hezbollah terrorists operating in the region of Majdal Selm were struck by an aircraft\".\nHezbollah, which has increased its use of drones in recent weeks, has also claimed responsibility for several attacks against Israeli military positions \"in response to Israeli aggression against southern localities and civilian homes\".\nOn the Israeli side, at least 14 soldiers and 11 civilians have been killed in the violence, according to Israeli authorities."}, {"id": "6713f3aa-e4f7-4320-acaa-8516dc3a56c7", "title": "Price of victory : How Allied D - Day bombs killed French civilians", "date": "2024-06-03 14:30", "url": "https://www.digitaljournal.com/world/price-of-victory-how-allied-d-day-bombs-killed-french-civilians/article", "message": "Within 24 hours, 3,000 civilians had died in the firestorm unleashed by 1,500 bombers, including 700 in the town of Lisieux alone.\nThe number is comparable with the more than 4,600 Allied military personnel killed on D-Day, according to Commonwealth War Graves Commission figures.\nBut then, to the dismay of the civilians, the bomb bay doors opened over their heads and the explosives dropped.\nAt the family home, “the windows were broken, doors were unhinged and rain was falling into the house”, she recalled.\nIt was to take “several years” before Mignon and her family managed to get back to a “normal life”, she said."}, {"id": "2677e12b-db9d-48a1-bfd0-6ff81da2fbb1", "title": "Israeli Airstrikes Rattle Aleppo : Casualties Reported", "date": "2024-06-03 04:30", "url": "https://www.devdiscourse.com/article/law-order/2959034-israeli-airstrikes-rattle-aleppo-casualties-reported", "message": "Israeli airstrikes around Aleppo, Syria, early Monday resulted in multiple fatalities, Syrian state media reported.\nThe state-run SANA news agency did not specify the toll, stating only that the strikes targeted the southeastern edge of Aleppo.\nSANA termed the attack as an 'aggression' that resulted in casualties and material damage.\nIsrael has not confirmed the strikes, a typical approach when dealing with Syria.\nIsrael and Syria have been in a state of war since Israel's establishment in 1948, with recent Israeli strikes often aimed at Iranian assets supporting Syrian President Bashar Assad in the prolonged conflict."}, {"id": "3726084b-b5ac-4b6d-a863-e9296e105353", "title": "Two Lebanese shepherds killed in Houla amid ongoing escalation", "date": "2024-06-03 07:45", "url": "https://www.naharnet.com/stories/en/305646-two-lebanese-shepherds-killed-in-houla-amid-ongoing-escalation", "message": "Two Lebanese shepherds were killed in an Israeli strike that hit their house in the town of Houla near the Lebanon-Israel border on Sunday, state media reported.\nAlso Sunday, the Lebanese militant group Hezbollah claimed a drone attack on an Israeli military facility in the Golan Heights.\nIt said the strike had hit a radar system for Israel's Iron Dome air defense system, as well as forces operating it.\nClashes between Israeli forces and the Lebanese militant group Hezbollah, which have taken place near-daily since October, have escalated in recent weeks.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them militants with Hezbollah and allied groups but also including more than 70 civilians."}, {"id": "4d115b0a-ee82-4736-8c69-16a37f2f99dd", "title": "Medvedev warns West of final stage in war , repeats nuclear option", "date": "2024-06-03 03:45", "url": "http://www.presstv.ir/Detail/2024/06/01/726613/Russia-Medvedev-Nuclear-Threat-Over-Ukraine-No-Bluff", "message": "Senior security official Dmitry Medvedev says Russia is not bluffing when it speaks of the possibility of using tactical nuclear weapons against Ukraine.\nHis warning came after the US and Germany became the latest allies to let Ukraine's military use Western-supplied weapons to strike targets inside Russia.\nHe said giving Kiev permission by the Western countries to use provided long-range weapons and ammunition to strike targets inside Russia will escalate the Ukraine war to its final stage.\nRead More:London and Paris had already signaled that they were open to easing restrictions on Ukraine striking targets inside Russia.\nFollowing the decision, Germany also gave Ukraine the green light to use German-supplied weapons against Russian targets."}, {"id": "2c1bb075-81c6-48e7-a687-41e1569289c7", "title": "stabbing", "date": "2024-06-03 00:15", "url": "https://billingsgazette.com/news/local/stabbing/article_23ae5ef0-212c-11ef-a70d-13911ac29ef6.html", "message": "“The place where parents go, and where the community goes, when they are in need of help was turned into an active shooting situation,” said J…"}, {"id": "a2127014-4b3c-4255-9f91-1ab22e1c28fa", "title": "Biden secretly gave Ukraine permission to strike inside Russia with U . S . weapons – CLG News", "date": "2024-06-03 00:30", "url": "https://legitgov.org/index.php/2024/06/02/biden-secretly-gave-ukraine-permission-to-strike-inside-russia-with-u-s-weapons/", "message": "Trolling for WWIII to avoid an election loss: Biden secretly gave Ukraine permission to strike inside Russia with U.S. weapons | 30 May 2024 | The Biden regime has quietly given Ukraine permission to strike inside Russia -- solely near the area of Kharkiv -- using U.S.-provided weapons, three U.S. officials and two other people familiar with the move said Thursday.\nThe policy of not allowing long-range strikes inside Russia \"has not changed, one of the U.S. officials said.\nIn effect, Ukraine can now use American-provided weapons, such as rockets and rocket launchers, to shoot down launched Russian missiles heading toward Kharkiv, at troops massing just over the Russian border near the city, or Russian bombers launching bombs toward Ukrainian territory.\nIt's a stunning shift the administration initially said would escalate the war by more directly involving the U.S. in the fight."}, {"id": "b2030280-d308-4d2c-bcda-b7bb9979fdb4", "title": "Are China Big , Bad , Gun - Slinging Robot Dogs the Future of Warfare ? ", "date": "2024-06-03 09:15", "url": "https://www.thedailybeast.com/are-chinas-big-bad-gun-slinging-robot-dogs-the-future-of-warfare", "message": "The American military first used robots as a tool for combat in the war in Afghanistan.\nEven then, those robots were able to hold a grenade launcher and a 12-gauge shotgun, in addition to 12 cameras.\nExamples of unmanned aircraft systems (drones) abound and have already changed how wars are fought, including the conflict in Ukraine.\nBut China, or any other military, for that matter, likely won’t have an entirely robotic People’s Liberation Army (PLA), warned Jensen.\nCybersecurity questions abound for militaries with unmanned, uncrewed, and robotic systems in times of crisis."}, {"id": "6e18677e-52b1-44b0-bfa4-c8bef51f21c5", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-03 03:30", "url": "https://www.tvguide.co.uk/schedule/317e51b7-dc57-5633-89f7-d830958c1f7e/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 3 June Share Add toCalendar +Battle of Britain Season 3 Episode 7 of 10 S Subtitles Audio DescriptionAt Biggin Hill, south-east London, military equipment collector Bruce Crompton views a collector's haul of Second World War Spitfires.\nPlus, the twins prepare some wartime artillery guns to export to Australia - but it's no easy featCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 3 June .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "1678f9e3-9d6c-4e85-b3df-9baab57d8dae", "title": "Hometown Patriot : Remembering D - Day", "date": "2024-06-03 05:00", "url": "https://www.ktbs.com/community/hometown-patriot-remembering-d-day/article_14f037c6-2136-11ef-8ca6-ab0ee3e893eb.html", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "905cbe35-bf02-423d-89ce-76ad8a58d08d", "title": "Adapting Russian Tactics : Enhancing the Indian Army T - 90 Fleet – Indian Defence Research Wing", "date": "2024-06-03 07:00", "url": "https://idrw.org/adapting-russian-tactics-enhancing-the-indian-armys-t-90-fleet/", "message": "Adapting Russian Tactics: Enhancing the Indian Army’s T-90 Fleet| BySOURCE: AFIThe Indian Army, with its robust fleet of T-90 tanks, stands at a critical juncture where adopting innovative tactics and upgrades could significantly enhance its combat effectiveness.\nRecent developments in Russia’s own handling of the T-90 tanks present valuable lessons and opportunities for India.\nThe dual armor plates have demonstrated superior resilience against these threats compared to the cope cage.\nThe additional weight of the cope cage can impede the tank’s mobility, a critical factor in combat scenarios.\nBy replacing the cope cage with armor plates, the overall weight of the tank is better managed, enhancing its maneuverability."}, {"id": "12bc95cd-37b0-405d-96bf-8c72117397f4", "title": "Germany hosts NATO air force training exercises", "date": "2024-06-03 07:00", "url": "https://www.yahoo.com/news/germany-hosts-nato-air-force-045604840.html", "message": "A NATO flag flies in the wind during the \"National Guardian 2024\" exercise as part of the \"Quadriga\" series of Bundeswehr exercises at the Oberlausitz military training area.\nRobert Michael/dpaSome 60 fighter jets and other combat aircraft are set top participate in NATO tactical air force exercises at a German airbase from Monday.\nThe squadron in Jagel is also due to mark its 30th anniversary as part of the NATO manoeuvre.\nEach day, the host nation issues a fictitious scenario that becomes increasingly complex as the exercise progresses, the Bundeswehr said.\nThe gathering is one of the largest exercises for joint air warfare operations in Europe and offers particularly valuable experience for the participating aircrews, the army added."}, {"id": "b01dce75-cbdd-4c09-b771-128ead398f47", "title": "Corsairs : Battle of the Caribbean delayed , first trailer", "date": "2024-06-03 13:00", "url": "https://nintendoeverything.com/corsairs-battle-of-the-caribbean-delayed-to-2025-on-switch-first-trailer/", "message": "Microids finally provided an update on Corsairs: Battle of the Caribbean following last year’s announcement.\nCorsairs: Battle of the Caribbean is now coming to consoles in 2025 rather than this year – which includes Switch.\nRemember that Corsairs: Battle of the Caribbean is an updated version of the 1999 pirate-themed strategy game.\nConsidered as one of the top pirate-themed strategy games back in 1999, Corsairs – Battle of the Caribbean now seamlessly blends tactical combat and management-oriented gameplay.\nThe first trailer Corsairs: Battle of the Caribbean can be found below."}, {"id": "36e09a8a-34eb-4934-9bd7-d72fbd7aec75", "title": "Guardians Of Gaia Windows game", "date": "2024-06-03 06:15", "url": "https://www.indiedb.com/games/guardians-of-gaia", "message": "Choose from a diverse set of characters with unique abilities.\nExchange your spoils from battle to unlock new skills and master new weapons.\nDiscover different weapon styles, character traits and the use of Gaia elements.\nUse team work and mobility to control the arena.\nBecome Gaia."}, {"id": "1fb7b829-ca2f-4fe3-84be-3c82bbd5b9be", "title": "OSINT analysts identify war criminal who abused Ukrainian prisoners of war", "date": "2024-06-03 12:45", "url": "https://www.yahoo.com/news/osint-analysts-identify-war-criminal-120800752.html", "message": "War criminal who abused Ukrainian prisoners of war identified by Bdzholy (Bees) and evocation.info OSINT analysts team, it is Russian Lieutenant Alexei Kiprin, journalist Andriy Tsaplienko reported on Telegram on June 3.\nRead also: Ukrainian POWs abused on Kharkiv front: Local prosecutor’s office investigatesAbuse of Ukrainian prisoners of war in Kharkiv OblastOn June 2, a video showing Russian abuse of Ukrainian prisoners of war was posted online.\nThe occupiers demand that Ukrainian prisoners sing the Soviet national anthem, then beat the prisoners and order the fallen Ukrainian soldier to get up.\n\"Unfortunately, such treatment of Ukrainian POWs is not an exception to the rules, but a common tactic for the occupiers.\"\nRead also: Russian forces execute unarmed Ukrainian POWs near Krynky footholdWe’re bringing the voice of Ukraine to the world."}, {"id": "b1e0a122-d1a3-4aa2-893f-ca2912104ceb", "title": "Tensions Soar as North Korea Balloon Warfare Escalates", "date": "2024-06-03 10:30", "url": "https://www.deccanchronicle.com/world/tensions-soar-as-north-koreas-balloon-warfare-escalates-897073", "message": "South Korea warns its residents to not touch any of these balloons and to inform authorities if they come in contact.\nThe balloons, discovered in eight out of nine provinces in South Korea, are currently undergoing analysis as tensions simmer between the neighboring nations.\nJust days prior, North Korean officials had issued warnings of impending retaliation, vowing to inundate South Korean territory with mounds of wastepaper and filth.\nCondemning the act as a clear violation of international law, South Korea's military has held North Korea accountable for the safety risks posed by the balloons.\nSouth Korea's parliament's decision to criminalize the launch of anti-Pyongyang leaflets in December 2020 has sparked debate over the balance between national security concerns and fundamental rights."}, {"id": "2b74b8a0-57f6-4afa-8895-b8703c94cf3a", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:45", "url": "https://www.smh.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "95155067-5b94-4e8a-8f79-25ab53d38583", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:15", "url": "https://www.theage.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "2bc4bcf7-4317-4c34-a9fd-d6edda168724", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 07:00", "url": "https://www.brisbanetimes.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "7329f9ca-eab1-49be-a3cb-c0df78ba83e4", "title": "Riveting speech , rousing concert mark ceremony in Laguna Woods", "date": "2024-06-03 01:45", "url": "https://www.ocregister.com/2024/06/02/riveting-speech-rousing-concert-mark-ceremony-in-laguna-woods/", "message": "The All-American Boys Chorus of Santa Ana sings the armed forces medley during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\n(Photo by Frank D’Amato, Contributing Photographer)The Laguna Woods Korean American Association Choir sings “God Bless America” during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\n(Photo by Frank D’Amato, Contributing Photographer)Kathy Rath of the Laguna Woods American Legion Post 257 sings the national anthem at the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\nPark during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\nThe ceremony opened with a moment of silence and an invocation by Alan Clark, chaplain of Laguna Woods’ American Legion Post 257."}, {"id": "cf6b1004-264a-4a66-8231-2cecb4bc8a68", "title": "Salvation Hours Windows game", "date": "2024-06-03 09:15", "url": "https://www.moddb.com/games/salvation-hours", "message": "Salvation Hours is a Single Player - Tactical - First Person Shooter developed by Wolf Wire Studios, a one man game studio.\nThis game is based on the 2012 Benghazi Incident that involved the American Consulate, the CIA Base called the \"Annex\" and the GRS Operators posted there.\nYou step into the shoes of one of the GRS Operators, Jack Sanders, who was deployed to Benghazi GRS in early September of 2012.\n- Paradoxical95 (Founder - Wolf Wire Studios)Note : The game's combat may be difficult for some people.\nThere might be small bugs here and there, I'd request you to notify me about them in the official Discord server."}, {"id": "e58f82bf-6937-404c-a3a5-4cc9104ded72", "title": "Salvation Hours Windows game", "date": "2024-06-03 11:15", "url": "https://www.indiedb.com/games/salvation-hours", "message": "Salvation Hours is a Single Player - Tactical - First Person Shooter developed by Wolf Wire Studios, a one man game studio.\nThis game is based on the 2012 Benghazi Incident that involved the American Consulate, the CIA Base called the \"Annex\" and the GRS Operators posted there.\nYou step into the shoes of one of the GRS Operators, Jack Sanders, who was deployed to Benghazi GRS in early September of 2012.\n- Paradoxical95 (Founder - Wolf Wire Studios)Note : The game's combat may be difficult for some people.\nThere might be small bugs here and there, I'd request you to notify me about them in the official Discord server."}, {"id": "b65c689e-0de1-4ace-88ba-2f9d920c2706", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461201/new-zealand-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 991 Viewsby, posted 17 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "80d97847-91b3-4643-87e0-4548cda7da0b", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461201/paper-mario-the-thousand-year-door-debuts-in-2nd-on-the-new-zealand-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 993 Viewsby, posted 17 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "408ca37e-db83-48da-bb7d-1a1e2f991f93", "title": "Navy Seals are accused of going woke after pride post sparks backlash", "date": "2024-06-03 01:00", "url": "https://www.dailymail.co.uk/news/article-13486927/Navy-Seals-pride-month-facebook-woke.html", "message": "Defense bosses found themselves in hot water with Navy Seals vets after marking the start of June with a Facebook post celebrating the beginning of Pride Month.\nThe post on the official page of Naval Special Warfare Command was also posted to the US Navy Seals and SWCC page, according to Libs of TikTok.\nThe controversial post came on the day the Department of Defense made an embarrassing gaffe with a Facebook post that appeared to confuse Pride Month with Post Traumatic Stress Disorder Month.\nBut the post was illustrated with a 'Progress Pride Flag' and attached to a picture captioned 'Celebrate Pride Month 2024'.\nThe Pentagon deemed June to be PTSD Awareness Month in June 2014, a year before it recognized June as Pride Month."}, {"id": "fb48d0da-f1af-40ab-acdd-7f1b9b9200c5", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461200/australia-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 923 Viewsby, posted 17 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "9a16d16f-6786-4344-8288-f5f1f01e180b", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461200/paper-mario-the-thousand-year-door-debuts-in-1st-place-on-the-australian-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 925 Viewsby, posted 17 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "10b54ff4-e07a-434f-a084-e07c9d2db805", "title": "Daly Bread : Battling in Opposition space ; can Paray or Mickela articulate feasible crime plan ? ", "date": "2024-06-03 02:15", "url": "http://wired868.com/2024/06/02/daly-bread-battling-in-opposition-space-can-paray-or-mickela-articulate-feasible-crime-plan/", "message": "It was published after the contest for Opposition space intensified during the immediately preceding days and was extensively covered in all media.\nThe contest between the Kamla slate and the Paray slate will take place soon, on 15 June.\nI link both the UNC internal and external battles with the paramount issue of violent crime for a specific reason.\nThe current People’s National Movement (PNM) Government is widely seen as incapable of inhibiting the assault of violent crime on our oppressed population and, perhaps, even indifferent to it.\nHowever, in light of our electoral history, Paray and The Patriotic Front may soon have to share what their plans and policies are to combat violent crime."}, {"id": "58fcae3d-9f51-49a1-aa75-8c5bb029a774", "title": "Why did North Korea bombard the South with trash balloons ? ", "date": "2024-06-03 00:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/why-did-north-korea-bombard-the-south-with-trash-balloons/articleshow/110648842.cms", "message": "SEOUL: North Korea launched 720 balloons across the world's most heavily armed border overnight Saturday, hitting South Korea with their payloads: plastic bags full of cigarette butts and other trash.Since last Tuesday, North Korea has sent roughly 1,000 of these trash balloons across the Demilitarized Zone separating the two Koreas.\nOn Sunday, the office of President Yoon Suk Yeol accused North Korea of \"dirty provocations no normal country would think of.\"\nIt said South Korea would start taking \"steps that North Korea would find unbearable.\nIt has accused North Korean defectors living in South Korea of \"scattering leaflets and various dirty things\" over its border counties in recent days.Here's what to know about the unusual offensive.When South Korea reports objects launched from North Korea, they are usually rockets carrying satellites or ballistic missiles of a kind the North says is capable of delivering nuclear warheads.\nOn social media, people posted pictures of the North Korean balloons in trees, on farmland or on urban side streets bursting with trash."}, {"id": "530163e4-7c44-4cbd-aead-ce9a40df89d9", "title": "Pine Nuts : Church of Divined Connections", "date": "2024-06-03 01:30", "url": "https://www.carsonnow.org/story/06/02/2024/pine-nuts-church-divined-connections", "message": "Inspired by Carson City’s, “Connections,” a friend of mine, Baobab, is constructing an emerging theology, and has agreed to an interview.\nQuestion: “So how does one welcome folks into a brand-new religion?”Baobab: “We welcome everybody to The Church of Divined Connections, Epicenter of Engagement in Empathy Toward Earth.\nAn improved attitude and resulting engagement will help us repair our sick atmosphere.”When intreated for thoughts on violence, Baobab intimated, “Violence never solves problems, only intensifies them.\nOne wag indicated to me that The Church of Divined Connections was going viral and quite possibly could put a lid on violence as a problem solver for today and ever after.\nIt seems where most religions are built upon the past, the Church of Divined Connections is building upon the future, and that is appealing to a new generation of thinkers."}, {"id": "49dc514b-3f12-4740-a63d-4df9fc19a411", "title": "Pine Nuts : Church of Divined Connections", "date": "2024-06-03 00:45", "url": "https://carsonnow.org/story/06/02/2024/pine-nuts-church-divined-connections", "message": "Inspired by Carson City’s, “Connections,” a friend of mine, Baobab, is constructing an emerging theology, and has agreed to an interview.\nQuestion: “So how does one welcome folks into a brand-new religion?”Baobab: “We welcome everybody to The Church of Divined Connections, Epicenter of Engagement in Empathy Toward Earth.\nAn improved attitude and resulting engagement will help us repair our sick atmosphere.”When intreated for thoughts on violence, Baobab intimated, “Violence never solves problems, only intensifies them.\nOne wag indicated to me that The Church of Divined Connections was going viral and quite possibly could put a lid on violence as a problem solver for today and ever after.\nIt seems where most religions are built upon the past, the Church of Divined Connections is building upon the future, and that is appealing to a new generation of thinkers."}, {"id": "f1cf593b-026b-46df-9cff-d6fd90e10ddc", "title": "Iran an invincible power , any military option against it off the table : IRGC chief", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240602-presstv02.htm", "message": "Iran an invincible power, any military option against it off the table: IRGC chiefIran Press TVSunday, 02 June 2024 4:14 PMThe chief commander of the Islamic Revolution Guards Corps (IRGC) says Iran is now an invincible power, and that an any possible military option against the country is null and off the table.\nHe added that Iran has turned into an invincible power in the world which is determined to achieve its goals.\nThe IRGC chief commander said the enemies have resorted to various policies and strategies to make Iran surrender and compromise, however, the Islamic Republic's independence has disrupted the global balance of power.\nThis is a sign of our power,\" the IRGC chief commander pointed out.\nBy conducting the military operation, he said, Iran managed to bring the war into the enemy's territory and overcome it."}, {"id": "9164d747-d505-4824-a87f-f99adacada74", "title": "Local WWII veteran celebrates 100th birthday", "date": "2024-06-03 02:45", "url": "https://www.wbay.com:443/2024/06/02/local-wwii-veteran-celebrates-100th-birthday/", "message": "WAUPACA, Wis. (WBAY) - A local veteran who served in World War II and was a prisoner of war celebrated his 100th birthday on Sunday.\nThey say that during the battle, Gilles’ unit was overrun and he suffered shrapnel injuries to his back and ankle.\nHe became a prisoner of war and was moved from one prison to another, often in extreme winter conditions.\nHe would survive, crediting his faith for guiding him through the ordeal, and was liberated at Moosburg on April 29, 1945.\nIn June of 1945, Gilles returned to the U.S. and eventually married his sweetheart Elaine Kleist on Thanksgiving 1947."}, {"id": "fb892a10-b93b-481c-980d-a817e83ac22b", "title": "Mining : FG to expand Marshal Corps to 100 per state", "date": "2024-06-03 07:45", "url": "https://tribuneonlineng.com/mining-fg-to-expand-marshal-corps-to-100-per-state/", "message": "THE Minister of Solid Minerals Development, Dr Dele Alake, says that plans sre ongoing to increase the number of Mining Marshal Corps from 60 to 100.\nHe said that the move was part of efforts of the Federal Government to secure the mining operating environment aimed at attracting Foreign Direct Investments (FDIs) to boost the economic profile of the country.\nNAN reports that the Mining Marshal Corps inaugurated on March 21, were drawn from the Nigeria Security and Civil Defence Corps (NSCDC) to combat illegal mining.\nThe minister said that the insecurity situation at mining sites across the federation prompted the president to establish an inter-ministerial committee on Jan.17.\n“And recently, two foreign nationals were jailed, convicted of operating illegally in the mining sector in Nigeria”, he said."}, {"id": "ae15b950-767e-4782-8ceb-b4522ed35beb", "title": "Welcome to World War III , where truth is the first casualty", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804356", "message": "In fact, I believe that we have already entered a Third World War.\n(credit: AFP VIA GETTY IMAGES)Like most wars – World War II is a perfect example – it is fought on two fronts.\nA war of ideologiesWHILE THIS world war revolves around the acquisition of land and partisan belief systems, it is also a War on Freedom, a War on Justice, and a War on Truth.\nIn this war, as in most wars, truth is the first casualty.\nWho will win this Third World War?"}, {"id": "6ecc2884-0515-4d41-8b1d-5f0caa54df15", "title": "AI regulators fear getting drowned out by hype of wars", "date": "2024-06-03 10:00", "url": "https://www.c4isrnet.com/global/europe/2024/06/03/ai-regulators-fear-getting-drowned-out-by-hype-of-wars/", "message": "Weapons that can decide for themselves whom or what to target — and even when to kill — are entering military arsenals.\n“It’s the most competitive race for advantage that we’ve seen since the race for nuclear weapons,” she added.\nThe appetite for more autonomy in weapons, fanned by combat in Ukraine and Gaza, has drowned out long-standing calls for limits on AI in military applications.\nUnintended consequencesFor all their military appeal, AI-enabled weapons come with the flaws of a technology still in its infancy.\nIn the coming years, experts expect to see an accumulating number of autonomous weapons on the battlefield with increasingly sophisticated abilities."}, {"id": "e7daae6a-9fdd-4d59-aae0-5710e8ee48dc", "title": "National WWII Museum to mark 80th anniversary of D - Day | Entertainment / Life", "date": "2024-06-03 12:00", "url": "https://www.nola.com/entertainment_life/national-wwii-museum-to-mark-80th-anniversary-of-d-day/article_5b4b45a2-1e99-11ef-abff-cbcf91a93fb6.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "c1b226b8-6d4c-4061-af3a-0bd2bd05f18e", "title": "All Eyes on Rafah : sharing images of war comes with a moral responsibility . What can we make of this AI - generated anomaly ? ", "date": "2024-06-03 12:45", "url": "http://www.econotimes.com/All-Eyes-on-Rafah-sharing-images-of-war-comes-with-a-moral-responsibility-What-can-we-make-of-this-AI-generated-anomaly-1678703", "message": "Critics contend the AI image sanitises the horrors, and call into question the virtue of people who would share this image, but not others.\nIn a post-truth era, the weaponising of images to deliberately spread misinformation has made AI images particularly contentious.\nIn assessing it as a war image, we must ask the question: what is an image of conflict supposed to do, and does it do this?\nOr, it might be more productive to instead think of this AI image as a symbol, or a new form of graphic storytelling.\nMaybe this is a better way to approach AI images in the context of war, by untethering them from photography’s connection to “the real” spectacle of war."}, {"id": "24e09675-1595-41f9-972c-3dc5122a7cb2", "title": "The call for renegotiation must go on - Kaieteur News", "date": "2024-06-03 06:45", "url": "https://www.kaieteurnewsonline.com/2024/06/03/the-call-for-renegotiation-must-go-on/", "message": "The call for renegotiation must go onKaieteur News – We have been at the forefront of the calls for renegotiation of the criminal oil contract that enslaves Guyana to ExxonMobil.\nWhen there were few other voices calling for renegotiation of the lopsided American oil company contract with this country, we were there, and we have been loud and persistent.\nRenegotiation affords some relief, some reversal, of this unspeakable crime that ExxonMobil has committed on the Guyanese people, and the ones unborn as of today.\nRenegotiation of the contract is not just leadership duty, a nice thing to preside over, a mere corrective measure.\nRenegotiation of the oil is more than to improve the state of Guyanese."}, {"id": "a4fa0e06-f7a4-48de-a012-8879315e9327", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II – Winnipeg Free Press", "date": "2024-06-03 06:00", "url": "https://www.winnipegfreepress.com/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii", "message": "WHO TOOK PARTFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "c83a5f29-dd84-49b4-8e52-1200d7adc755", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 09:00", "url": "https://isp.netscape.com/news/story/0001/20240603/b02d03fa11f66767a521a3b01357a89a", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIOMAHA BEACH, France (AP) — The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler's defenses in western Europe and change the course of World War II.\nWHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive."}, {"id": "3e21316b-1a9e-41b3-9065-2e3986be6610", "title": "Remembering D - Day", "date": "2024-06-03 12:00", "url": "https://www.sunstar.com.ph/network/remembering-d-day", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive."}, {"id": "48ea16c2-891c-45c5-b9c5-2c33ca1135bc", "title": "D - Day : 80th anniversary ceremonies kick off with parachute jump over Normandy", "date": "2024-06-03 01:15", "url": "https://www.kiro7.com/news/trending/d-day-80th-anniversary-ceremonies-kick-off-with-parachute-jump-over-normandy/Q2H36UYEURDGPD722XNGJVB3GA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "2b28b129-887e-4037-bc36-2f04e313dfbe", "title": "Royal Regina Rifles statue to be unveiled at Juno Beach to mark D - Day 80th year", "date": "2024-06-03 10:00", "url": "https://www.timescolonist.com/national-news/royal-regina-rifles-statue-to-be-unveiled-at-juno-beach-to-mark-d-days-80th-year-8957700", "message": "REGINA — A statue depicting the Canadians who fought Nazi Germany 80 years ago will have a permanent home near the beaches they stormed on D-Day.\nREGINA — A statue depicting the Canadians who fought Nazi Germany 80 years ago will have a permanent home near the beaches they stormed on D-Day.\nThe Royal Regina Rifles statue is to be unveiled Wednesday at Juno Beach in France, a day ahead of the milestone anniversary of the invasion that launched the beginning of the end of the Second World War.\nThe Regina Rifles were among the first Canadians to storm Juno Beach on June 6, 1944, also known as D-Day.\nNick Kazuska, a 104-year-old veteran who landed on Juno Beach that day, was at the ceremony in Regina."}, {"id": "e713f004-e602-44cd-a416-654bd2efa9c8", "title": "NATO greenlights Ukraine use of weapons to target Russia , threatening nuclear war", "date": "2024-06-03 04:30", "url": "https://www.wsws.org/en/articles/2024/06/03/hphh-j03.html", "message": "The International Committee of the Fourth International (ICFI) condemns the latest escalation of the US-NATO war against Russia, which is rapidly spiraling into full-scale war between nuclear-armed states.\nAs for its European allies, their collaboration in this escalation is rivaled in its recklessness only by their catastrophic launching of World War I in 1914 and World War II in 1939.\nThe global capitalist system, whose insoluble global crisis is the underlying cause of genocide and war, is descending into barbarism.\nIt is the first time since the end of the Second World War that the US and its allies are directly targeting Russian territory.\nThe escalation against Russia therefore will entail a morphing of the conflict in Ukraine into a truly global war."}, {"id": "5b8b484e-c964-41d7-b684-267c7bd266a2", "title": "DFL delegates condemn antisemitism , call for cease - fire in Gaza", "date": "2024-06-03 03:45", "url": "https://www.twincities.com/2024/06/02/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war/", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone."}, {"id": "886b91da-999d-4056-a25b-7e5071caa6ad", "title": "Royal Regina Rifles statue to be unveiled at Juno Beach to mark D - Day 80th year – Winnipeg Free Press", "date": "2024-06-03 13:15", "url": "https://www.winnipegfreepress.com/arts-and-life/entertainment/celebrities/2024/06/03/royal-regina-rifles-statue-to-be-unveiled-at-juno-beach-to-mark-d-days-80th-year", "message": "The Royal Regina Rifles statue is to be unveiled Wednesday at Juno Beach in France, a day ahead of the milestone anniversary of the invasion that launched the beginning of the end of the Second World War.\nA soldier stands next to the Royal Regina Rifles statue in this April 6, 2024 handout photo during a previewing ceremony at the Saskatchewan War Memorial in Regina.\nIt's to be unveiled Wednesday at Juno Beach at la place des Canadiens in France.\nTHE CANADIAN PRESS/HO - Brandt Industries Media Team, *MANDATORY CREDIT*The Regina Rifles were among the first Canadians to storm Juno Beach on June 6, 1944, also known as D-Day.\nNick Kazuska, a 104-year-old veteran who landed on Juno Beach that day, was at the ceremony in Regina."}, {"id": "dcb7b348-7285-4272-8b88-9c1df9ede8c1", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.yahoo.com/news/remembering-d-day-key-facts-052335249.html", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone."}, {"id": "624a78a9-95fc-4c54-926f-6a3f771823c9", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://apnews.com/article/dday-wwii-france-invasion-military-b02d03fa11f66767a521a3b01357a89a", "message": "(AP Photo, File)Nearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nSURVIVORSFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II."}, {"id": "ef551e52-3e64-43f8-ac7f-d9c00d9b3755", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.ksat.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "e5f51df4-425d-413e-bede-65ab8e095009", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.clickondetroit.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "85b61b24-a62e-4857-a803-e7b81570163d", "title": "India joins U . S . Red Flag air and RIMPAC naval exercises", "date": "2024-06-03 02:30", "url": "https://www.thehindu.com/news/national/india-joins-uss-red-flag-air-and-rimpac-naval-exercises/article68243619.ece", "message": "Indian Air Force (IAF) and Indian Navy are taking part in two mega multinational war games hosted by their U.S. counterparts.\nThe IAF has deployed Rafale fighter jets for the two-week multinational air exercise Red Flag which commenced in Alaska on May 30.\nAn IAF contingent arrived today at the Eielson AF Base of US airforce, at Alaska, US, to participate in the upcoming edition of the multi-national exercise Red Flag 24.\nAimed to integrate aircrew in a multinational environment, Ex Red Flag is a two-week advanced aerial combat training exercise, it added.\nIndia has taken part in Ex Red Flag in the past which even saw the deployment of Russian SU-30MKI fighter jets."}, {"id": "fa4070ce-1549-4d72-a521-6c0f87e2503a", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.click2houston.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "cd07eca1-572d-41c1-bd71-667bc5daf639", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 09:45", "url": "https://www.local10.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "526a2214-580b-43b1-8e77-dd37bbd60bf8", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.kiro7.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "1f24bb8d-f1fd-470d-a343-c953e70efa51", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.news4jax.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "592977db-c721-41b7-8a0d-041f419e0f26", "title": "  He was a very , very good man : Son of D - Day medic talks about dad war legacy in Nat Geo series", "date": "2024-06-03 03:45", "url": "https://www.news24.com/life/arts-and-entertainment/tv/he-was-a-very-very-good-man-son-of-d-day-medic-talks-about-dads-war-legacy-in-nat-geo-series-20240603", "message": "For Stephen Woodson, son of World War 2 medic Waverly Woodson, telling his father's story of being part of the Battle of Normandy on 6 June 1944 was emotional but cathartic.\nStephen featured in National Geographic's (DStv 181) new series Erased: WW2's Heroes of Colour, which started airing on 26 May and ends on 16 June."}, {"id": "898c283d-ce18-47ce-90c4-707d773edb50", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 08:15", "url": "https://www.kob.com/news/us-and-world-news/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive."}, {"id": "4446e30b-241b-4dac-8256-28b34bda4d7a", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:30", "url": "https://www.clickorlando.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "6ac93e7c-3f64-49cc-b039-7af1a2ae9871", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 07:00", "url": "https://www.wfmz.com/news/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of/article_70d7f7c9-0ef5-551f-998b-9460578e8a71.html", "message": "There might be a stray shower lingering early in the morning, primarily east.\nA couple showers or a thunderstorm will also be possible later in the afternoon into the early evening.\nWinds light and variable..TonightPartly cloudy.\nThere is a very low chance for an early evening shower or thunderstorm however most if not all should remain dry.\nWinds light and variable."}, {"id": "87ea8710-dd66-4e8c-925b-7e45107f0029", "title": "Defense Secretary meets Chinese counterpart amid rising tensions , robotic military tests", "date": "2024-06-03 14:15", "url": "https://wlos.com/news/nation-world/defense-secretary-meets-chinese-counterpart-amid-rising-tensions-robotic-military-tests-china-robot-dogs-ccp-defense-secretary-lloyd-austin-armstrong-williams", "message": "Defense Secretary Lloyd Austin met with his Chinese counterpart in Singapore for the first time since 2022, as tension in the Pacific continues escalating.\nThis also comes as videos online show China's military testing out robots mounted with guns.\nThe alarming videos of the robots highlight the extreme danger and ever-evolving changes to modern warfare with China.\nIn the two-minute video, the robot dog is seen doing a series oof maneuvers under the control of a remote operator.\n“If they don't get that under control and back down, it could lose lead to further tensions and strain of relationships between the two nations,” Williams said."}, {"id": "5af69005-e43c-4354-b3d4-2824d30646d1", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 08:30", "url": "https://www.news-gazette.com/news/nation-world/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of/article_2c5155ae-3748-5d6b-9b2f-2e4c8965b9b1.html", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIThe June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler’s defenses in western Europe and change the course of World War II"}, {"id": "53012a51-7077-48f8-8eb6-6a18be5583a5", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II | iNFOnews", "date": "2024-06-03 06:15", "url": "https://infotel.ca/newsitem/d-day-80th-anniversary-by-the-numbers/cp2019097038", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIOMAHA BEACH, France (AP) — The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler's defenses in western Europe and change the course of World War II.\nWHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive."}, {"id": "7440af0a-34dd-4f27-9875-f457c1281a51", "title": "Israel army  stretched  as fighting rages on multiple fronts", "date": "2024-06-03 14:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-army-stretched-fighting-rages-multiple-fronts", "message": "Israel also has as many as 26,000 reservists currently mobilised in active combat roles, with most of them deployed in the West Bank, the account's owner said.\nThe Israeli army declined to comment on the specific numbers of its forces.\n- 'Brewing crisis' -With its forces distracted on other fronts, analysts say the military faces a brewing crisis in the West Bank, which Israel has occupied since 1967.\nBut we risk losing sight of a potentially brewing crisis in the West Bank,\" said Dajani of ICG.\nThe army provides protection to about 490,000 Israelis who live across the West Bank in settlements that are considered illegal under international law."}, {"id": "5cda14d6-056b-4040-adff-a4728e1c90e8", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsls.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "9340b620-ab4e-446f-bf11-3658e1470edb", "title": "Who Killed the British Army ? ", "date": "2024-06-03 11:45", "url": "https://www.americanthinker.com/articles/2024/06/who_killed_the_british_army.html", "message": "In the omnipresent murky world of public-private 'consultancy' there exists a British firm called 'Capita' what is known as 'consultancy.'\nLarge swathes of British and Irish institutions 'outsource' the jobs that they should be providing themselves, to companies like 'Capita.'\nIn 2000 the British army numbered 110,000.\nShakespeare wrote of the Battle of Agincourt in 1415, where the English, outnumbered by the French, hungry and decimated, defeated a French army.\nNo more rallying calls from Henry V, no poppies blowing in the red-blood skies of the Somme."}, {"id": "c4890208-aa21-4956-9d67-9c53e0d2e229", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsbradio.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "8418f0c8-d09b-424d-a4ce-045ef7f49ed1", "title": "Thales and PT Len sign JV to advance Indonesia defence capabilities", "date": "2024-06-03 11:30", "url": "https://www.airforce-technology.com/news/thales-and-pt-len-sign-jv-to-advance-indonesias-defence-capabilities/", "message": "Representatives from PT Len and Thales have signed an agreement on 30 May 2024, to launch a joint venture that will take Indonesia’s defence capabilities to the next level by reinforcing joint local industrial activities in manufacturing, engineering and services.\nThe multi-national defence group Thales and Indonesian defence supplier PT Len have established a joint venture that will advance the archipelago’s defence capabilities.\nIn addition, guided by a bilateral collaboration agenda, the US approached India to build closer defence industrial ties in June 2023.\nSince then the two nations have shared knowledge and technology across government, industry and academia to advance their respective defence industries.\nAs supply chains and geopolitical security become more uncertain, nations such as India and Indonesia have an unprecedented opportunity to adapt their defence industrial capabilities to meet the new global demand for defence products."}, {"id": "63e5f430-0a2a-46b6-97e2-2d4126afbdc4", "title": "MoD of Russia Report for June 2nd , 2024 … – Windows to Russia", "date": "2024-06-03 06:30", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-2nd-2024.html", "message": "MoD of Russia Report for June 2nd, 2024…Russian Defence Ministry report on the progress of the special military operation (2 June 2024)The Armed Forces of the Russian Federation continue the special military operation.\nSeven counter-attacks launched by units of the AFU 42nd Mechanised Brigade, 71st Jaeger Brigade, 82nd Assault Brigade were repelled near Glubokoye, Liptsy, and Volchansk (Kharkov region).\nThree counter-attacks launched by assault detachments of the AFU 63rd Mechanised Brigade were repelled near Chervonaya Dibrova (Lugansk People’s Republic).\nThe AFU losses amounted to 465 Ukrainian troops, one tank, three armoured fighting vehicles, and five pick-up trucks.\nThe AFU losses amounted to up to 290 Ukrainian troops, two armored fighting vehicles, and two motor vehicles."}, {"id": "27eef349-d4f6-469b-8473-9dabd94ad46d", "title": "Al Murray writes another WWII book : News 2024 : Chortle : The united kingdom Comedy Guide", "date": "2024-06-03 14:00", "url": "https://www.chortle.co.uk/news/2024/06/03/55737/al_murray_writes_another_wwii_book", "message": "Al Murray as written a second factual history book a bout the Second World War.\nArnhem: Black Tuesday aims to offer a new perspective on the daring but thwarted attempt to secure a vital bridgehead across the Rhine as the Allies swept across France and Belgium in the aftermath of D-Day.\nIt is Murray’s second fully serious military history book following Command, published in 2022, which analysed the key Allied leaders in the Second World War.\nHere’s an episode of Murray’s 2004 Discovery channel series Road To Berlin which examined Arnhem:•​ Arnhem: Black Tuesday is available from Amazon priced £23 in hardback, £10.99 on Kindle or £7.99 as an audibook, or from bookshop.org, which supports independent retailers, below:Thanks for reading.\nIf you find Chortle’s coverage of the comedy scene useful or interesting, please consider supporting us with a monthly or one-off ko-fi donation."}, {"id": "b06cd5e9-1ae0-40e7-8c0f-df168ce90ffb", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem", "date": "2024-06-03 08:00", "url": "https://abcnews.go.com/International/wireStory/2-japanese-35-fighter-jets-make-emergency-landings-110766614", "message": "Two Japanese F-35A stealth fighter jets have made emergency landings at a commercial airport in northern Japan on Monday, but there are no injuries or damageBy The Associated PressTOKYO -- Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan's Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan's military."}, {"id": "044d9f30-2871-4041-8e80-a498dec5ee87", "title": "Israeli reservists fight in Gaza but question what comes after the war", "date": "2024-06-03 07:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-02/israel-reservists-gaza-ceasefire-14062383.html", "message": "Golan, a reserve tank instructor and student at Tel Aviv University, says she is troubled by the toll the uncertainty of the Gaza war is taking.\n(Heidi Levine/The Washington Post)ISRAEL-GAZA BORDER — As Israel’s war in Gaza rages, it’s leaning on a backbone of reservists to fight - soldiers who say they are committed to serve but who are also divided over what comes next.\nSince Israel launched its ground invasion of Gaza in late October, 293 Israeli troops have been killed, according to the military.\nThe official tally does not identify which casualties were reservists, and the Israel Defense Forces declined to comment.\nThen he added: “We can’t leave without an absolute victory.”But not everyone believes Israeli military control is the answer - even if they want to see Hamas defeated."}, {"id": "c6e8162d-7c08-40ca-94b1-5a830b8d8195", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem", "date": "2024-06-03 08:15", "url": "https://www.startribune.com/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem/600370546/", "message": "TOKYO — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan's Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan's military."}, {"id": "4b093934-0f1c-456b-9fc3-99c8c2d6fbec", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem", "date": "2024-06-03 09:30", "url": "https://japantoday.com/category/national/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem-1", "message": "Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan's Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan's military."}, {"id": "69ad59d3-5b2f-4c1a-8c12-fc39927255f4", "title": "  We have no other country : new immigrants gear up for IDF service", "date": "2024-06-03 10:30", "url": "https://www.ynetnews.com/magazine/article/s1crkzoer", "message": "The young Olim received valuable guidance and hands-on assistance with everything related to the army recruitment process at this unique and special event.\n\"It's very exciting to see these young Olim embark on their new path in the IDF.\nIDF service instead of working in hi-techEvery year, thousands of young men and women make Aliyah and contribute to the country by fulfilling their mandatory army service.\nUnlike Israelis who prepare for their army service several years in advance and receive support and guidance from older siblings and extended family members, the army is a new and unfamiliar world for these soon-to-be lone soldiers.\nThese young Olim could work in hi-tech positions but instead are choosing to enlist in the IDF."}, {"id": "fd7ea81b-df86-45fd-afac-4d361d3a2f42", "title": "Hundreds celebrate unveiling of Tubman monument in Beaufort | Beaufort County", "date": "2024-06-03 11:45", "url": "https://www.postandcourier.com/beaufort-county/harriet-tubman-monument-beaufort/article_353812f4-2110-11ef-affa-17802263f723.html", "message": "BEAUFORT — Harriet Tubman set out from Beaufort aboard one of three Union gunboats on June 1, 1863, intent on freeing as many enslaved people as the troops, scouts and spies embarking with her could find behind Confederate lines.\nKenneth Hodges, pastor of Tabernacle Baptist Church.\n“All the time that Harriet Tubman was here and all the years after she left, there was a silence,” Hodges said as he addressed the crowd.\nThe program included a libation ceremony by Queen Quet, chieftess of the Gullah Geechee Nation; choir performances by the Huspah Baptist Church B.J.\nScott Choir; and comments from Edda Fields-Black, author of “COMBEE: Harriet Tubman, the Combahee River Raid, and Black Freedom during the Civil War.”"}, {"id": "6825c923-19c7-491d-8148-6f3dea508c96", "title": "My Hero Academia Epilogue Debuts Deku Post - War Makeover", "date": "2024-06-03 06:45", "url": "https://comicbook.com/anime/news/my-hero-academia-manga-epilogue-deku/", "message": "Massive spoilers for My Hero Academia Chapter 424 to follow!\nMy Hero Academia has officially kicked off the epilogue for the manga series with its newest chapter, and with it has debuted Izuku Midoriya's new look after the war!\nMy Hero Academia has been spending the last few years fighting through the final battles against All For One and Tomura Shigaraki, and with the previous chapter officially brought these fights to an end with the final blow against All For One.\nMy Hero Academia has ushered in an official epilogue following the end of the fight against the villains, but it's clear that the manga is far from over.\n(Photo: Shueisha / Viz Media)My Hero Academia 424: Deku Begins His Post-War LifeMy Hero Academia Chapter 424 confirms that the fight against All For One has ended, and heroes from all over the world have come to Japan to help with the recovery efforts."}, {"id": "dd4ff421-d4cf-4d96-afde-107c297e3f3f", "title": "The IAF Quest for 126 Mirage 2000 - 5 : A Tale of Bureaucracy , Costs , and Lost Opportunities – Indian Defence Research Wing", "date": "2024-06-03 07:00", "url": "https://idrw.org/the-iafs-quest-for-126-mirage-2000-5-a-tale-of-bureaucracy-costs-and-lost-opportunities/", "message": "The IAF’s Quest for 126 Mirage 2000-5: A Tale of Bureaucracy, Costs, and Lost Opportunities| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIn the late 1990s and early 2000s, the Indian Air Force (IAF) was on a quest to enhance its fighter jet fleet with a proven performer, particularly the upgraded Mirage 2000-5.\nThis quest was fueled by the superior performance of the Mirage 2000H during the Kargil War.\nThe French Dassault Mirage 2000-5 was an upgraded variant, boasting advanced avionics, radar systems, and improved combat performance.\nConsequently, the original Mirage 2000H procurement plans were shelved to save money, setting a precedent that would influence future decisions.\nFast forward to 2024, the acquisition of the Mirage 2000-5 or its equivalent remains unresolved."}, {"id": "07701b3e-05e3-4304-b563-d386c6f28368", "title": "FReeper Canteen ~ Hall of Heroes : SSG Robby Miller ~ 03 June 2024", "date": "2024-06-03 00:30", "url": "https://freerepublic.com/focus/f-news/4241798/posts", "message": "~ Hall of Heroes ~ SSG Robby Miller Medal of Honor: Colleagues recall heroics of 'happy warrior' The ambush started with a shout of \"Allah akbar!\"\nRobby Miller's Special Forces team and the Afghan soldiers with it.\nThe two went through Special Forces training together, so McGarry was glad to see him when he arrived for duty with Company A, 3rd Battalion, 3rd Special Forces Group at Fort Bragg.\nSpecial Forces soldiers train to work with military forces in foreign countries.\n\"Without him doing what he did, there would be seven less Special Forces soldiers on the face of the Earth right now.\""}, {"id": "912203b3-2225-4c5a-904c-dfa379d0bc04", "title": "Iran cyber attacks threaten the world - The Jerusalem Post", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804713", "message": "This warning, later confirmed by UK Minister for Security Tom Tugendhat, underscores the persistent and evolving threat posed by Iran’s cyber operations.\nIran’s cyber operations are not limited to state infrastructure; they also target the Jewish Diaspora.\nCYFIRMA’S report highlights that Iran’s cyber capabilities are among the most advanced globally.\nEnhancing cybersecurity measures and fostering a culture of vigilance are crucial to mitigating the risks posed by Iranian cyber operations.\nBy focusing on resilience and preparedness, the Jewish Diaspora, GCC countries, and Western societies can better protect themselves from the ever-growing threat of Iranian cyber warfare."}, {"id": "d745955a-5cc0-457f-a0c2-e324be82c42f", "title": "On This Day : Ayatollah Khomeini died in 1989", "date": "2024-06-03 03:45", "url": "https://in-cyprus.philenews.com/international/on-this-day-ayatollah-khomeini-died-in-1989/", "message": "1965: Astronaut Edward H. White II became the first American to perform a spacewalk during the Gemini 4 mission.\n1989: Ayatollah Ruhollah Khomeini, the Supreme Leader of Iran and a key figure in the 1979 Iranian Revolution, died.\n1989: Edward H. White II, the first American to walk in space, was posthumously awarded the Congressional Space Medal of Honor.\n1998: A high-speed train derailed near the town of Eschede, Germany, resulting in the deadliest railway accident in German history with 101 fatalities.\n2013: The trial of Chelsea Manning (formerly Bradley Manning), a US soldier who leaked classified documents to WikiLeaks, began at Fort Meade, Maryland."}, {"id": "89d54c71-c688-44ef-84c4-8f6909582a45", "title": "AI and War Top Agenda as Globalist Elites Gather for Bilderberg Meeting", "date": "2024-06-03 01:45", "url": "https://www.breitbart.com/politics/2024/06/02/future-of-warfare-tops-agenda-as-globalist-elites-gather-for-secretive-bilderberg-meeting-in-spain/", "message": "Founded in 1954 with a meeting hosted by Prince Bernhard of The Netherlands in the Hotel de Bilderberg in the Dutch village of Oosterbeek, the annual meeting of the Bilderberg Group is believed to be a driving force behind numerous globalist projects.\nUnlike similar institutions such as the World Economic Forum (WEF), the Bilderberg Meeting is conducted strictly behind closed doors with participants bound by the Chatham House Rule, which prohibits the disclosure of the identity of those behind any idea mentioned within the meeting.\nOfficially intended to allow for the free flow of discourse, the back-room nature of the meeting of global elites has fostered many theories about the influence the conference may exert on international policy.\nOther noteworthy participants include former Google CEO Eric Schmidt, Pfizer CEO Albert Bourla, Google DeepMind CEO Hassabis Demis, Microsoft AI CEO Mustafa Suleyman, and failed Georgia gubernatorial candidate Stacey Abrams.\nThe Guardian reports that security for this year’s conference was “intense… even by Bilderberg standards”, noting that protection featured “police drones hovering over the hotel”."}, {"id": "b5d0b15c-8b36-4cfa-a970-759701bd2128", "title": "Why America loses wars", "date": "2024-06-03 06:15", "url": "https://tribune.com.pk/story/2469489/why-america-loses-wars", "message": "“Do we still understand how wars are won?” was the headline of an article written by Bret Stephens for his newspaper, The New York Times.\nAmerica withdrew in humiliation from Saigon in 1975, Beirut in 1984, Mogadishu in 1993 and Kabul in 2021.\n“If you’re on the left, you’d probably say that most if not all of these wars were unnecessary, unwinnable, or unworthy.\nScholars and policymakers in Pakistan should follow the conduct of America’s little wars across the globe.\nThe newspaper studied America’s 20-year involvement in Afghanistan by investigating thousands of cases that left a poor legacy for America in this critical country."}, {"id": "3d2eb40d-f582-4d9b-91e5-2e3ad08de3b8", "title": "Field Marshal Montgomery grandson reveals the British war hero rallying letters to troops and his  completely illegal  beret in emotional Antiques Roadshow D - Day special", "date": "2024-06-03 14:00", "url": "https://www.dailymail.co.uk/news/article-13488767/Field-Marshal-Montgomerys-grandson-reveals-British-war-heros-rallying-letters-troops.html", "message": "Field Marshal Montgomery's grandson has explained why the British war hero rallied letters to troops and the reason behind his 'completely illegal' beret.\nIn another emotional Antiques Roadshow clip, a daughter spoke of her father Reginald Steele's experience as a Staff Sergeant in the Gilder Pilot Regiment.\n'I cried my eyes out watching last night's Antiques Roadshow special from the D-Day beaches,' one viewer said on X.\n'Just watched Antiques Roadshow commemorating D-Day and I now appear to have a bit of dust in my eyes,' another wrote.\nA third said: 'Not one normally for the Antiques Roadshow, but the D-Day special that was on tonight was incredible."}, {"id": "7bc11987-4b07-46db-bb66-3f0f9f9ca44e", "title": "Hundreds Bid Farewell to Ukrainian Volunteer Medic Killed on Front Lines", "date": "2024-06-03 06:15", "url": "https://www.kyivpost.com/post/33674", "message": "Almost 1,000 mourners gathered in central Kyiv on Sunday for the memorial service of a high-profile journalist and volunteer combat medic who was killed in action last week.\nAt her funeral service at the Saint Michael's Golden-Domed Monastery on Sunday, hundreds wore colourful Ukrainian vyshyvankas -- embroidered national shirts -- and carried Ukrainian flags and flowers.\nPart of the Hospitallers volunteer battalion, Tsybukh was credited with saving the lives of many soldiers, often risking her own life to evacuate injured servicemen from the front lines.\nOther Topics of Interest Sport Gives Maimed Ukrainian Veterans 'New Goals', Says Shevchenko Some of those veterans are in the Ukrainian squad currently taking part in the Euro 2024 football amputee championship in France.\nLast year while serving on the front lines in the eastern Donetsk region, she wrote a farewell letter to be published in the case of her death."}, {"id": "c2e7ce10-65d8-4753-914d-cea16dcf5af1", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 12:00", "url": "https://www.news-herald.com/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive."}, {"id": "2f0ee9ad-2f89-4bf9-bf50-dfa8e3e6d57b", "title": "BBC Countryfile fans fume  what happened  as show shake - up sparks huge backlash", "date": "2024-06-03 08:30", "url": "https://www.dailystar.co.uk/tv/bbc-countryfile-fans-fume-whats-32945469", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up for the Daily Star TV newsletter for the biggest TV newsSomething went wrong, please try again later.\nX, formerly known as Twitter, became the platform for their displeasure, with one user posting: \"What's happened to @BBCCountryfile?\nSign up for our free Daily Star Showbiz newsletter"}, {"id": "220de3e3-8b02-469e-8024-b6c474effda7", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 05:00", "url": "https://www.inforum.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "e0e45984-a4bf-4acd-a6fa-5ec0256552be", "title": "Letter : Were not Vegas weve got our own focus", "date": "2024-06-03 09:30", "url": "https://www.yakimaherald.com/opinion/letter-were-not-vegas-weve-got-our-own-focus/article_b358f70a-187f-11ef-92aa-9bb0d25493ed.html", "message": "If you are sending a Letter To the Editor, please be sure to follow these rules:Letters have a firm 200-word limit and will be edited for grammar, clarity and accuracy.\nThe person who signs the letter must be the author.\nWe will not print form letters, libelous letters, business promotions or personal disputes, poetry, open letters, letters espousing religious views without reference to a current issue, or letters considered in poor taste.\nThe Yakima Herald-Republic cannot verify the accuracy of all statements made in letters.\nWriters are limited to one published letter per calendar month."}, {"id": "943e66b8-7cf7-457f-977f-df0c8cfa7f02", "title": "Major victory in war against Asian hornets thanks to  Dad Army  ", "date": "2024-06-03 13:15", "url": "https://www.walesonline.co.uk/news/uk-news/major-victory-war-against-asian-29284384", "message": "A major victory has been declared in the war against Asian hornets after a 'Dad's Army' on Britain's frontline saw the number of queens plummet.\nAfter a battle that has now been raging for eight years, Jersey has now seen a significant drop in the number of Asian hornet queens spotted so far in 2024 compared to last year.\nThe announcement has provided a major boost for the Jersey Asian Hornet Group that has been helped by a surge in locals helping to trap queens before nests are made.\nHe said the north-easterly winds that have typically brought Asian hornets across from Normandy in the last couple of years have been 'less evident in 2024'.\nThis led to calls for new \"people's army\" to help fight off an impending invasion of killer hornets onto mainland Britain."}, {"id": "457643ad-f828-43ad-b347-f46a93129229", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem – Winnipeg Free Press", "date": "2024-06-03 07:45", "url": "https://www.winnipegfreepress.com/world/2024/06/03/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem", "message": "TOKYO (AP) — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nFILE - This photo shows Japan Air Self-Defense Force's F-35A stealth jet in Misawa Air Base in Misawa, northeastern Japan, on May 28, 2018.\nTwo Japanese F-35A stealth fighter jets made emergency landings on Monday, June 3, 2024, at a commercial airport in northeastern Japan, but there were no injuries or damage, officials said."}, {"id": "1a18d942-4ede-43d3-81ff-47910ca18d8f", "title": "Remaining Spitfires all have a story to tell , says restoration engineer", "date": "2024-06-03 09:00", "url": "https://www.salisburyjournal.co.uk/news/national/24361165.remaining-spitfires-story-tell-says-restoration-engineer/", "message": "Biggin Hill Heritage Hangar, nestled outside of London, is believed to be the world’s largest Spitfire restoration and passenger flight hangar, and the team are currently working to revive their 17th Spitfire to an airworthy condition since opening in 2011.\n“They all have a story to tell and it humanises it all,” Mr Monk said.\nThe Spitfire MK1a P9372 flew in the Battle of Britain and was shot down near Biggin Hill.\nThere’s probably less than 10 that I know of that have got genuine D-Day history.”Chief engineer Franco Tambascia is also working on the D-day Spitfire as the latest in his 33-year-career of working with old warplanes.\nHe goes to France every year for the commemoration, where his great, great uncle came ashore and was killed taking the Hillman bunker complex on June 6 1944."}, {"id": "608f150b-c5c4-4590-bd5c-991de93f6c75", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 02:15", "url": "https://www.duluthnewstribune.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "1abeb140-b71c-4e9c-9dbe-206e7684533d", "title": "Major victory in war against Asian Hornets as  Dad Army  sees numbers plummet", "date": "2024-06-03 11:45", "url": "https://www.mirror.co.uk/news/uk-news/major-victory-war-against-asian-32948193", "message": "Fears have been growing for many years among experts that the invasive Asian Hornet will use the Channel Islands as a launching pad to dig trenches in mainland BritainA major victory has been declared in the war against Asian Hornets after a 'Dad's Army' in Britain's frontline saw the number of queens plummet.\nAfter a battle that has now been raging for eight years, Jersey has now seen a significant drop in the number of Asian hornet queens spotted so far in 2024 compared to last year.\nThe announcement has provided a major boost for the Jersey Asian Hornet Group that has been helped by a surge in locals helping to trap queens before nests are made.\nHe said the north easterly winds that have typically brought Asian hornets across from Normandy in the last couple of years, have been \"less evident in 2024.\"\nThis led to calls for new \"people's army\" to help fight off an impending invasion of killer hornets onto mainland Britain."}, {"id": "fc8e42bf-061f-457f-8a47-e71d19812476", "title": "FG to deploy technology for surveillance of mining sites", "date": "2024-06-03 07:30", "url": "https://dailytrust.com/fg-to-deploy-technology-for-surveillance-of-mining-sites/", "message": "Dr Dele Alake, the Minister of Solid Minerals Development, says the Federal Government will deploy technology for the surveillance of mining sites across the country.…Dr Dele Alake, the Minister of Solid Minerals Development, says the Federal Government will deploy technology for the surveillance of mining sites across the country.\nHe said that the technology would be in addition to the 2,220 personnel of the Mining Marshal Corps drawn from the Nigeria Security and Civil Defence Corps (NSCDC) to combat illegal mining.\n“We are introducing some technology, we are not just relying on men and materials alone.\n“The satellite surveillance gadgets we are putting in there is to enable us see in real time in all mining sites in Nigeria.\n“But the mine marshals are just the face of the security apparatus that we are putting in place to combat illegal mining,” he said."}, {"id": "f402316a-d34c-4e00-a052-5350f3cc0383", "title": "Despicable tactics", "date": "2024-06-03 08:00", "url": "https://www.koreatimes.co.kr/www/opinion/2024/06/202_375864.html", "message": "Prepare strategic responses to North Korea’s provocationsNorth Korea announced its decision, Monday, to cease releasing balloons filled with trash into South Korea.\nHowever, North Korea cautioned that it would resume launching balloons if South Korean activists persisted in sending leaflets.\nThe North’s abrupt decision came just hours after the South Korean government indicated the possibility of resuming loudspeaker broadcasts across the border in retaliation.\nOf particular concern are the missiles boasting a range of 350 km, capable of reaching major cities and air bases in South Korea.\nIn light of this, South Korean authorities must adopt tailored measures to effectively address the evolving security landscape."}, {"id": "557c3b46-2152-46c0-bdd6-edd8af4ec995", "title": "Despicable tactics", "date": "2024-06-03 09:30", "url": "https://www.koreatimes.co.kr:443/www/opinion/2024/06/202_375864.html", "message": "Prepare strategic responses to North Korea’s provocationsNorth Korea announced its decision, Monday, to cease releasing balloons filled with trash into South Korea.\nHowever, North Korea cautioned that it would resume launching balloons if South Korean activists persisted in sending leaflets.\nThe North’s abrupt decision came just hours after the South Korean government indicated the possibility of resuming loudspeaker broadcasts across the border in retaliation.\nOf particular concern are the missiles boasting a range of 350 km, capable of reaching major cities and air bases in South Korea.\nIn light of this, South Korean authorities must adopt tailored measures to effectively address the evolving security landscape."}, {"id": "a9982b3e-2852-4451-9d6a-dd1467aee3d4", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 01:30", "url": "https://www.postbulletin.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war-2", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "01c93da8-bb65-46b7-99a2-66cc041129b5", "title": "2025 Toyota LandCruiser Prado v GWM Tank 500 : Spec battle", "date": "2024-06-03 06:00", "url": "https://www.examiner.com.au/story/8650462/2025-toyota-landcruiser-prado-v-gwm-tank-500-spec-battle/?cs=34616", "message": "The Tank 500 is new for 2024 so there are no previous generations to compare against.\nEven in its most expensive variant, however, it's cheaper than the entire Prado range after on-road costs are applied."}, {"id": "8828e816-44fa-4f42-94dd-097bfe7b142b", "title": "Haikyu : The Dumpster Battle Posts Official Clip : Watch", "date": "2024-06-03 06:45", "url": "https://comicbook.com/anime/news/haikyu-dumpster-battle-movie-watch-clip/", "message": "The Dumpster Battle has shared the first official clip from its theatrical debut!\npic.twitter.com/0OIDqmG6Fl — Crunchyroll (@Crunchyroll) June 1, 2024What Is Haikyuu!!\nThe Dumpster Battle?\nThe Dumpster Battle is now available in theaters in the United States and Canada.\nThe Dumpster Battle as such:\"Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant.'"}, {"id": "d678ea54-ea5b-4eae-9bd0-572def08066b", "title": "  A Death Trap for the Kremlin Force – Ukraine at War Update for June 3", "date": "2024-06-03 01:15", "url": "https://www.kyivpost.com/post/33672", "message": "After Russia conducted waves of drone and missile attacks on Ukraine’s energy infrastructure over the weekend, the nation’s grid operator announced daily energy restrictions, as its largest energy company specified how much power each major municipality would require.\nIt said that if the imposed limits are exceeded, regional distribution companies may reinstate hourly outage schedules as necessary.\nIn addition to power infrastructure, the attacks also hit civilian infrastructure and cultural heritage centers.\nAt present, Ukraine can import no more than 1,700 MWh of electricity from the EU at a time.\n“The video showing Russian soldiers abusing Ukrainian prisoners of war is spreading online,” Lubinets wrote."}, {"id": "358570de-4f3c-47e9-a8a1-52769b766642", "title": "OpTic Texas loses CDL match after players die to feature devs said they disabled", "date": "2024-06-03 08:00", "url": "https://www.dexerto.com/call-of-duty/optic-texas-loses-cdl-match-after-players-die-to-feature-devs-said-they-disabled-2755713/", "message": "OpTic Texas has lost a CDL match after Anthony “Shotzzy” Cuevas-Castro and Brandon “Dashy” Otell died as a result of an environmental explosion Modern Warfare 3 devs said they disabled in Season 4 on Highrise.\nWhen Season 4 came in, changes were made to several maps to fix a number of bugs, most importantly for Ranked Play and CDL match types, wherein environmental explosions were disabled on Highrise specifically.\nIt turns out, the feature was still working on June 2 as OpTic Texas learned the hard way, going on to die thanks to the supposedly removed explosion.\nAlthough the players themselves weren’t too pressed about the “removed” environmental explosion, OpTic Texas’ Twitter account used the opportunity to poke fun at the moment by retweeting one of their old posts praising the removal.\nArticle continues after adOpTic Texas’ next match will be on June 9 against Minnesota Røkkr."}, {"id": "5b109c6f-af55-439c-8ff4-4ca51076dbb0", "title": "Remaining Spitfires all have a story to tell , says restoration engineer", "date": "2024-06-03 09:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24361165.remaining-spitfires-story-tell-says-restoration-engineer/", "message": "Biggin Hill Heritage Hangar, nestled outside of London, is believed to be the world’s largest Spitfire restoration and passenger flight hangar, and the team are currently working to revive their 17th Spitfire to an airworthy condition since opening in 2011.\n“They all have a story to tell and it humanises it all,” Mr Monk said.\nThe Spitfire MK1a P9372 flew in the Battle of Britain and was shot down near Biggin Hill.\nThere’s probably less than 10 that I know of that have got genuine D-Day history.”Chief engineer Franco Tambascia is also working on the D-day Spitfire as the latest in his 33-year-career of working with old warplanes.\nHe goes to France every year for the commemoration, where his great, great uncle came ashore and was killed taking the Hillman bunker complex on June 6 1944."}, {"id": "199a1cac-2e81-4a0e-bc74-a798142f1a1f", "title": "Israel battles Hamas as mediators urge both to accept Gaza truce plan", "date": "2024-06-03 04:30", "url": "https://economictimes.indiatimes.com/news/defence/israel-battles-hamas-as-mediators-urge-both-to-accept-gaza-truce-plan/articleshow/110649613.cms", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "a8922afa-37c3-4e8f-a3dd-cf188df44371", "title": "Iraq Kataib Hezbollah vows resolute support for Yemen after US - British aggression", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240601-presstv04.htm", "message": "Iraq's Kata'ib Hezbollah vows resolute support for Yemen after US-British aggressionIran Press TVSaturday, 01 June 2024 4:02 PMIraq's anti-terror group Kata'ib Hezbollah has assured Yemeni people and fellow Ansarullah resistance movement that it will continue to give its unwavering support for the Arab nation in the struggle against the US-British maritime coalition.\n\"The latest US-British aggression against the Yemeni nation came in light of the arrogant powers' disappointment at breaking the maritime blockade of Israel [in the Red Sea and the Arab Sea].\nWe will not hesitate to give unwavering support to our Yemeni brethren in the battle between the truth and falsehood,\" Kata'ib Hezbollah pointed out.\nThe Yemeni Armed Forces have staged numerous pro-Palestinian strikes since October 7, when the Israeli regime began the Gaza war.\nThe US has been the main supporter of Israel, providing it with munitions and political support in its brutal war on Gaza."}, {"id": "11ccf3be-06b8-4dfa-8495-cf59b276a038", "title": "A mass parachute jump over Normandy kicks off commemorations for the 80th anniversary of D - Day", "date": "2024-06-03 10:15", "url": "https://www.ajc.com/news/nation-world/a-mass-parachute-jump-over-normandy-kicks-off-commemorations-for-the-80th-anniversary-of-d-day/B3NNADM6FRGFFFYFDZ55QWKRSQ/", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "6b5b0bbf-013a-41c2-ac3d-8769c9ad2fa0", "title": "Massive drug haul in Chaibasa , Police recover Doda worth Rs 3 . 15 crores", "date": "2024-06-03 04:15", "url": "https://www.nyoooz.com/news/ranchi/1722494/massive-drug-haul-in-chaibasa-police-recover-doda-worth-rs-315-crores/", "message": "Doda is often called \"the poor mans heroin\" because its a narcotic derived from the same plant: the opium poppy.\nHe emphasized that such operations are crucial in the ongoing fight against drug trafficking in the region.\nThe recovered doda has been taken into police custody and further investigations are underway to identify the individuals involved in this large-scale drug operation.\nAuthorities have also urged the public to remain vigilant and report any suspicious activities to help in the fight against drug trafficking.\nThis substantial seizure of doda underscores the persistent efforts by the Chaibasa police to combat drug trafficking in the region."}, {"id": "46ccee5f-4391-4b14-9f30-fdb6803e977d", "title": "Taiwan Air Force to upgrade C - 130s starting 2025 : Source", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240602-cna01.htm", "message": "Taiwan Air Force to upgrade C-130s starting 2025: SourceROC Central News Agency06/02/2024 03:56 PMTaipei, June 2 (CNA) Taiwan's Air Force is planning to spend billions of Taiwan dollars to upgrade its existing C-130 military transport aircraft fleet starting next year to enhance its collision avoidance and sea rescue capabilities among other systems, a source familiar with the matter told CNA Sunday.\nThe planned overhaul of the Air Force's existing 20 C-130s is scheduled to take place from 2025 to 2030.\nTaiwan's Air Force first bought 20 C-130Hs and another C-130HE, a modified electronic warfare aircraft, from the United States in the early 1980s.\nThe force lost one of its 20 C-130H, serial number 1310, in a 1997 crash at Taipei Songshan Airport.\nThe Air Force C-130 fleet currently has a total of 20 such models that serve as the main transporter aircraft for the nation's armed forces."}, {"id": "6264ee4b-065d-4dca-9e44-6ffad913f933", "title": "Mass parachute jump over Normandy kicks off commemorations for 80th anniversary of D - Day", "date": "2024-06-03 01:30", "url": "https://japantoday.com/category/world/a-mass-parachute-jump-over-normandy-kicks-commemorations-for-the-80th-anniversary-of-d-day", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,\" he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nLooping around one after another, the C-47s dropped strings of jumpers — 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history's force as she exited her plane into the Normandy skies."}, {"id": "967e4c71-3673-49d1-bb25-80707178d3f9", "title": "Remembering D - Day , RAF veteran Gilbert Clarke recalls the thrill of planes overhead", "date": "2024-06-03 08:15", "url": "https://www.yahoo.com/news/remembering-d-day-raf-veteran-072158024.html", "message": "Gilbert Clarke a D-Day veteran smiles as he is interviewed near his home in east London, Wednesday, May 15, 2024.\nClarke, now 98, is one of more than 3 million men and women from South Asia, Africa and the Caribbean who served in the British military during World War II.\n“You couldn’t have seen the blue sky,” Clarke recalled, his voice tinged with awe eight decades later.\nIt also reminds the world that men who look like him came to Britain’s aid in its hour of need.\nWhile he sidesteps questions about any racism he may have faced over the years, Clarke recognizes that Black people still face discrimination in Britain."}, {"id": "6328cc95-5197-402a-9d7b-b5f91064e0bc", "title": "A mass parachute jump over Normandy kicks off commemorations for the 80th anniversary of D - Day", "date": "2024-06-03 03:45", "url": "https://www.cp24.com/news/a-mass-parachute-jump-over-normandy-kicks-off-commemorations-for-the-80th-anniversary-of-d-day-1.6910767", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,\" he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nLooping around one after another, the C-47s dropped strings of jumpers — 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history's force as she exited her plane into the Normandy skies."}, {"id": "271bd97e-5e98-49bd-a2db-599cbd24720c", "title": "2025 Toyota LandCruiser Prado v GWM Tank 500 : Spec battle", "date": "2024-06-03 06:15", "url": "https://www.illawarramercury.com.au/story/8650462/2025-toyota-landcruiser-prado-v-gwm-tank-500-spec-battle/?cs=34616", "message": "The Tank 500 is new for 2024 so there are no previous generations to compare against.\nEven in its most expensive variant, however, it's cheaper than the entire Prado range after on-road costs are applied."}, {"id": "8a5ddec3-60ca-4156-91c9-530bc45fd650", "title": "Israel battles Hamas as mediators urge both to accept Gaza truce plan", "date": "2024-06-03 06:00", "url": "https://dunyanews.tv/en/World/815999-Israel-battles-Hamas-as-mediators-urge-both-to-accept-Gaza-truce-plan", "message": "Israel battles Hamas as mediators urge both to accept Gaza truce planWorld World Israel battles Hamas as mediators urge both to accept Gaza truce planHamas has said it \"views positively\" what Biden described as an Israeli proposal.\nPalestinian militant group Hamas, meanwhile, has said it \"views positively\" what Biden described as an Israeli proposal.\nMediators the United States, Qatar and Egypt later said they \"call on both Hamas and Israel to finalise the agreement embodying the principles outlined by President Joe Biden\".\nIn the besieged territory's north, Israeli helicopters fired at Gaza City's Zeitun and Sabra areas, AFP reporters said.\nThe Hamas government media office said that at least 32 people, many of them children, have died of malnutrition in Gaza since the war began."}, {"id": "9acbd140-03c3-4fba-88b8-db1622369d2d", "title": "Indian Maoists summon masses to … vote for big business Congress Party Part 1", "date": "2024-06-03 04:30", "url": "https://www.wsws.org/en/articles/2024/06/02/qqwq-j02.html", "message": "A section of the platform at the Maoist CPI (M-L) Liberation's Feb. 2023 Patna \"Save Democracy, Save India\" rally.\nIts campaign has been fronted by Congress Party leader Rahul Gandhi, the son, grandson and great grandson of Indian prime ministers.\nThe Trinamool Congress is nominally part of the INDIA alliance but rejected any “seat-sharing” with the Congress and the CPM-CPI led Left Front.\nThe CPI (M-L) Liberation election Charter was clearly drafted with a view to not embarrassing or offending its big business political allies.\nThrough this partnership, and with the full complicity and support of the Congress Party, the Indian bourgeoisie has harnessed the Indian people to US imperialism’s war drive, particularly against China."}, {"id": "6ed090f8-6592-4efc-9fca-e517bc407900", "title": "Remembering D - Day , RAF veteran Gilbert Clarke recalls the thrill of planes overhead", "date": "2024-06-03 09:00", "url": "https://www.pressdemocrat.com/article/trending/remembering-d-day-raf-veteran-gilbert-clarke-recalls-the-thrill-of-planes/", "message": "“You couldn’t have seen the blue sky,” Clarke recalled, his voice tinged with awe eight decades later.\nCross, who died in 2013, was awarded the Distinguished Flying Cross and was promoted to squadron leader before he left the RAF.\n“And (I’m) proud to know I did my little bit.”Still, there was a “flood of tears” when Clarke went home to say goodbye.\nIt also reminds the world that men who look like him came to Britain’s aid in its hour of need.\nWhile he sidesteps questions about any racism he may have faced over the years, Clarke recognizes that Black people still face discrimination in Britain."}, {"id": "c1fe76bb-8d60-4881-96fa-296af1912aba", "title": "Mediators press Israel , Hamas to agree to truce proposal", "date": "2024-06-03 06:00", "url": "https://www.ewn.co.za/2024/06/03/mediators-press-israel-hamas-to-agree-to-truce-proposal", "message": "RAFAH - Fresh strikes were reported in the Gazan city of Rafah overnight into Monday, as mediators urged Israel and Hamas to agree to a truce and hostage release deal outlined by US President Joe Biden.\nHamas has said it \"views positively\" what Biden described as an Israeli proposal.\nIn the calls, Blinken \"commended\" Israel on the proposal and \"emphasised that Hamas should take the deal without delay\".\nProtesters backing an immediate hostage release, who rallied again Saturday in Tel Aviv, want him to strike a truce deal, but his far-right allies are threatening to bring down the government if he does.\nMediators the United States, Qatar and Egypt later said they called \"on both Hamas and Israel to finalise the agreement embodying the principles outlined by President Joe Biden\"."}, {"id": "7e99bcc9-e8ce-46f3-95bc-2b96b34b5a20", "title": "  A chilling effect on the exercise of free speech rights : University of California issues vindictive interim suspensions to student protesters", "date": "2024-06-03 08:45", "url": "https://www.wsws.org/en/articles/2024/06/03/jucd-j03.html", "message": "Meanwhile, universities have carried out academic interim suspensions as part of a two-pronged strategy to exert the maximum pressure and make an example out of protestors.\nThe number of interim suspensions have skyrocketed in the last two months and are coupled with the denial of due process.\nUniversity of California, San Diego (UCSD)Last month, UC San Diego began issuing interim suspensions to students for simply being seen at the encampments.\nThe previous person who held that position, Cristian Fuentes Hernandez, received notice of interim suspension soon after, on May 5.\nIn contrast, only 16 interim suspensions were handed out all of last year."}, {"id": "4f2b0c75-2415-4a8b-ad83-f9936c05291c", "title": "US , South Korean medics train to treat patients wounded in chemical , biological attacks", "date": "2024-06-03 07:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-03/south-korea-medics-cbrn-attacks-14063301.html", "message": "U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes)DAEJEON, South Korea — Soldiers with the 2nd Infantry Division recently joined South Korean army officers for a team-building and barrier-busting exercise in combat first aid.\nU.S. and South Korea medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes) U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\nU.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024."}, {"id": "cf4a6ce2-7bb5-45d0-a5da-3cbd7da5d27a", "title": "Remembering D - Day , RAF veteran Gilbert Clarke recalls the thrill of planes overhead", "date": "2024-06-03 08:15", "url": "https://www.clickorlando.com/news/world/2024/06/03/remembering-d-day-raf-veteran-gilbert-clarke-recalls-the-thrill-of-planes-overhead/", "message": "Gilbert Clarke a D-Day veteran smiles as he is interviewed near his home in east London, Wednesday, May 15, 2024.\nClarke, now 98, is one of more than 3 million men and women from South Asia, Africa and the Caribbean who served in the British military during World War II.\nRecommended Videos“You couldn’t have seen the blue sky,” Clarke recalled, his voice tinged with awe eight decades later.\nIt also reminds the world that men who look like him came to Britain’s aid in its hour of need.\nWhile he sidesteps questions about any racism he may have faced over the years, Clarke recognizes that Black people still face discrimination in Britain."}, {"id": "52623a8c-4c9f-43bb-a55f-2dce1f99110c", "title": "In photos : The future of Saskatchewan pilots prepare for the sky", "date": "2024-06-03 00:15", "url": "https://globalnews.ca/news/10540615/in-photos-the-future-of-saskatchewan-pilots-prepare-for-the-sky/", "message": "She is one of several students enrolled at the Regina Flying Club, as demand for pilots across Canada continues to grow.\nRegina Flying Club General Manager James Topinka said the pilot shortage comes from increased demand rather than a lack of interest.\nAndrew Benson / Global NewsAt the club’s open house Sunday, they unveiled their new ‘Stratus Flight Academy’ to expand their reach to students.\nAndrew Benson / Global NewsView image in full screen Some of the instruments used by pilots.\nAndrew Benson / Global News"}, {"id": "f8fac20b-aa33-45f4-856f-dc72b530eac0", "title": "Remembering D - Day , RAF veteran Gilbert Clarke recalls the thrill of planes overhead – Winnipeg Free Press", "date": "2024-06-03 07:45", "url": "https://www.winnipegfreepress.com/world/2024/06/03/remembering-d-day-raf-veteran-gilbert-clarke-recalls-the-thrill-of-planes-overhead", "message": "“You couldn’t have seen the blue sky,” Clarke recalled, his voice tinged with awe eight decades later.\nWell, boys, it’s started.’’’Gilbert Clarke a D-Day veteran looks on, as he is interviewed near his home in east London, Wednesday, May 15, 2024.\nCross, who died in 2013, was awarded the Distinguished Flying Cross and was promoted to squadron leader before he left the RAF.\n“And (I’m) proud to know I did my little bit.”Still, there was a “flood of tears” when Clarke went home to say goodbye.\nWhile he sidesteps questions about any racism he may have faced over the years, Clarke recognizes that Black people still face discrimination in Britain."}, {"id": "19a865a2-5524-4432-b83a-7655ee07be9e", "title": "Remembering D - Day , RAF veteran Gilbert Clarke recalls the thrill of planes overhead", "date": "2024-06-03 09:15", "url": "https://www.news-gazette.com/news/nation-world/remembering-d-day-raf-veteran-gilbert-clarke-recalls-the-thrill-of-planes-overhead/article_3dbc7817-1701-5133-be9e-15f1f317557c.html", "message": "Gilbert Clarke leans back on the seat of his mobility scooter, cranes his neck and gazes into the bright blue skies over East London, remembering the moment 80 years ago when he knew the invasion of France was under way"}, {"id": "dde8a5b0-0255-4f4d-b416-8baeae5a4172", "title": "Biden brand is weakness at home and abroad", "date": "2024-06-03 11:45", "url": "https://www.theblaze.com/columns/opinion/bidens-brand-is-weakness-at-home-and-abroad", "message": "The Biden presidential brand is life beyond his control, and that does not bode well for his re-election prospects.\nWinston Churchill was strong-willed during World War II.\nJust a few months before the 2024 election, events appear to be out of control for Biden.\nRussia invaded Ukraine on Biden’s watch, and there is no evidence that American influence will decide the issue as it did in World War I and World War II.\nThe college protests reinforce the Biden brand of weak leadership."}, {"id": "0eea374a-81ba-4201-9398-ffca779b1720", "title": "Dumelo donates motorbikes , streetlights to UG Security Department", "date": "2024-06-03 05:30", "url": "http://www.businessghana.com/site/news/entertainment/307883/Dumelo-donates-motorbikes,-streetlights-to-UG%E2%80%99s-Security-Department", "message": "The donation was made personally by Mr. Dumelo on Tuesday, May 28, 2024.\nIn a post on X on Wednesday, May 29, John Dumelo expressed hope that this contribution would help combat incidents of phone snatching and petty thefts on both the Legon and UPSA campuses.\n“Yesterday I presented 2 brand new Motorcycles and streetlights to the security department of the University of Ghana.” The actor cum Politician said.\n“I hope this kind gesture will aid them to combat incidents of phone snatching and petty thefts on Legon and Upsa Campuses.\nThe Students need to be protected.” He added"}, {"id": "380e5b25-8edc-4cad-bdd0-b348af3cd845", "title": "A mass parachute jump over Normandy kicks off commemorations for the 80th anniversary of D - Day", "date": "2024-06-03 06:15", "url": "https://www.pressherald.com/2024/06/02/a-mass-parachute-jump-over-normandy-kicks-off-commemorations-for-the-80th-anniversary-of-d-day/", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,” he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nAdvertisementLooping around one after another, the C-47s dropped strings of jumpers – 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history’s force as she exited her plane into the Normandy skies."}, {"id": "394de002-cc42-4f08-8513-0d243e874926", "title": "Russia - Ukraine War : Negotiating With Putin Now Is a Mistake", "date": "2024-06-03 10:45", "url": "https://foreignpolicy.com/2024/06/03/russia-ukraine-peace-kharkiv-zelensky-putin-negotiate/?tpcc=recirc_trending062921", "message": "Ukraine’s ability to negotiate a postwar settlement that it can live with depends on its military performance over the next 18 months or so.\nDespite their good intentions, the “negotiate now” camp skirts a critical question: Who will (or should) initiate the talks?\nIndeed, the greater the firepower Putin directs at Ukraine, the greater Ukrainians’ hatred of Russia becomes, and with it their resolve to keep resisting.\nIn September 2022, following a bogus referendum, Putin announced that four Ukrainian provinces—Donetsk, Luhansk, Kherson, and Zaporizhzhia—were irrevocably part of the Russian Federation.\nThe war becomes a stalemate, which both adversaries conclude cannot be broken, but Putin has enough leverage to ensure Ukraine’s neutrality."}, {"id": "6d89bec2-742d-43e3-8551-92b763e24867", "title": "Doubts grow over Gaza truce plan as Israel - Hamas battles rage", "date": "2024-06-03 13:15", "url": "https://www.naharnet.com:443/stories/en/305649-doubts-grow-over-gaza-truce-plan-as-israel-hamas-battles-rage", "message": "But for now, the bombardments and combat showed no sign of easing in the Gaza war soon entering its ninth month that has devastated the Palestinian coastal territory of 2.4 million people.\nOn Monday the Israeli military said that over the past day its forces had struck \"over 50 targets in the Gaza Strip\".\nMilitants also took about 250 hostages, 120 of whom remain in Gaza, including 37 the army says are dead.\nIsrael's retaliatory bombardments and ground offensive have killed at least 36,439 people in Gaza, mostly civilians, the Hamas-run territory's health ministry said on Sunday.\nCairo refuses to coordinate with Israel humanitarian deliveries through Rafah, but has agreed to send some aid via Israel's Kerem Shalom crossing."}, {"id": "da3e5c7c-bc5f-42b7-880a-2d09f84c0776", "title": "Links 6 / 4 / 2024 | naked capitalism", "date": "2024-06-03 12:00", "url": "https://www.nakedcapitalism.com/2024/06/links-6-4-2024.html", "message": "The Global Loss of the U-Shaped Curve of Happiness After BabelClimateWaterBurst pipes in Atlanta leads to water outages, boil water notices The HillSyndemicsChina?\nAmong the consequences of Trump being in New York’s criminal justice system would be a complete physical and mental examination, among other things; see Water Cooler here.\nThe deck: “The fusion of Lidar, radar, and cameras can be fooled by stuff from your kids’ craft box.”HealthcareZeitgeist WatchDoctor Who, the Traveling Time Lord JSTOR.\nIt Might Not Be The Reason You Think Science AlertAntidote du jour (H. Zel):Go for that yacht, buddy!\nSee yesterday’s Links and Antidote du Jour here."}, {"id": "43420674-1487-4e23-b907-c95cda1e7aab", "title": "Grimsby bridge crucial role in the D - Day landings being commemorated 80 years on", "date": "2024-06-03 04:30", "url": "https://www.grimsbytelegraph.co.uk/news/grimsby-news/grimsby-bridges-crucial-role-d-9318586", "message": "Invalid email Something went wrong, please try again later.\nSomething went wrong, please try again later.\nA Grimsby bridge played a crucial role in the D-Day landings in Normandy 80 years ago to liberate Europe from the Nazis.\nArmed Forces Champion for North East Lincolnshire, Alex Baxter, said the bridge in Grimsby served as an important preparation for D-Day.\nHe said organisers also hope to broadcast the first radio bulletin confirming the D-Day invasion had started successfully on June 6, 1944, led by General Eisenhower and General Montgomery."}, {"id": "4f5bb098-1b24-44bf-94c6-d145bdde4b60", "title": "Colm ORegan :  I wish I had a trade or proper skill I could use instead of fluting around with word – The Irish Times", "date": "2024-06-03 06:00", "url": "https://www.irishtimes.com/life-style/people/2024/06/01/colm-oregan-i-wish-i-had-a-trade-or-proper-skill-i-could-use-instead-of-fluting-around-with-words/", "message": "I am the wrong person to take a country to war but once it’s been agreed we are going to war I’m probably good to have around the camp.\nI think I’m named after Padre Pio.\nThe Inch on the farm I grew up in, an old river meadow which has never been ploughed in my memory.\nAll the vital signs of my life are in good nick, health, relationships, community, family, I’m good at some things and the things I’m not good at I’m looking forward to getting better at.\nHonestly I wish I had a trade or proper skill that I could use at home instead of fluting around with words."}]