[{"id": "a22a1312-215a-467b-a8ca-e0f086c3e708", "title": "Israeli residents brace for Iranian attack – DW – 08 / 13 / 2024", "date": "2024-08-14 06:00", "url": "https://www.dw.com/en/israeli-residents-brace-for-iranian-attack/a-69932855", "domain": "dw.com", "domain_classification": "International", "message": "People in Israel are worried about Iran launching a possible retaliation attack.\nSome are also concerned about whether the Israeli government will be able to come to their aid in an emergency.\nThe residents there have felt Israel's conflict with Hamas in the Gaza Strip in their own way.\nMore than 60,000 Israelis have been evacuated from their homes in Israel's north since the war in Gaza began 10 months ago.\n\"Our fear is not from Iran, but from the Israeli government and the country's infrastructure not functioning properly,\" Lerer-Shaib says."}, {"id": "2354c74b-9d32-48c9-bbdd-f09458bed2af", "title": "UK ministers are drawing up plans to evacuate 60 , 000 Britons from Israel amid fears Iran could launch an attack - with the Navy already on stand - by for a  Dunkirk - style  rescue mission to save 16 , 000 Brits stranded in Lebanon", "date": "2024-08-14 00:30", "url": "https://www.dailymail.co.uk/news/article-13740979/uk-ministers-plans-evacuate-israel-iran-hezbollah.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "UK ministers are drawing up plans to evacuate British nationals from Israel amid fears of an attack from Iran.\nThe British Foreign Office is advising against all but essential travel to Israel, amid the war in Gaza, and is now looking at emergency plans to support some 60,000 Brits believed to be in the country, the Mirror reports.\nMasoud Pezeshkian, the newly-elected Iranian President, has insisted his country has the 'right to respond' to the attack on Iranian soil, without specifying details.\n'In essence, I think Iran and Israel would both prefer to avoid escalation out of control,' he said.\nSir Keir Starmer attempted to relay such concerns to Iran through a 'rare' phonecall to the new Iranian president on Monday."}, {"id": "44cb4fb7-9dcd-43a3-8659-ab020aed774c", "title": "GAZA LIVE BLOG : US Approves Huge Arms Deal | Massacre in Al - Maghhazi | Thousands of Soldiers Wounded - Day 313", "date": "2024-08-14 12:30", "url": "https://www.palestinechronicle.com/gaza-live-blog-us-approves-huge-arms-deal-massacre-in-al-maghhazi-thousands-of-soldiers-wounded-day-313/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "AL-JAZEERA: An Israeli airstrike targeted two houses in the south and east of Khan Yunis, south of the Gaza Strip, leaving a number of martyrs and wounded.\nBREAKING: Four-year-old Lina Sheikh Khalil has died from malnutrition amid the ongoing Israeli genocide and blockade of Gaza.\nGAZA HEALTH MINISTRY: 39,965 Palestinians have been killed, and 92,294 wounded in Israel’s ongoing genocide in Gaza starting on October 7.\nThe lsraeli aggression on Gaza Strip continues for the 312th day in a row.\nWednesday, August 14, 01:00 am (GMT+2)AL-JAZEERA: Sirens sounded in the settlement of Holit, in the Gaza Strip envelope."}, {"id": "710b9f98-2c0b-4dfe-9851-9496610c6951", "title": "BBC , Sky News blasted over titles on twins killed by Israeli strike in Gaza", "date": "2024-08-14 07:15", "url": "https://www.albawaba.com/node/bbc-sky-news-blasted-over-titles-twins-1581346", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Social media was blasted and filled with sorrow over the killing of twins in Gaza along with their mother in an Israeli airstrike.\nBBC, Sky News blasted over headlines on twins killed by Israeli attack in GazaWestern media was heavily blasted by activists and pro-Palestinians over their coverage of the story of the twins who were killed in an Israeli airstrike on Tuesday.\nBBC and Sky News, both British, have covered the story of the newborn twins however they received heavy backlash on social media.\nBBC wrote: \"Baby twins killed in Gaza as father registered births,\" meanwhile, Sky News also posted the news under the headline: \"Gaza: Four-day-old twins killed in airstrike as father went to get birth certificates.\"\nA person commented: \"What is a Gaza airstrike @SkyNews?"}, {"id": "b411a696-b2a3-4c90-bf62-096b159c79a4", "title": "Pentagon spokesman : Iran attack on Israel is certainly possible this week", "date": "2024-08-14 06:15", "url": "http://www.israelnationalnews.com/news/394591", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Pentagon spokesperson Pat Ryder told reporters on Tuesday that an attack by Iran on Israel is \"certainly possible\" this week, adding that the threat needs to be taken seriously so more resources are being maneuvered to the region, Fox News reported.\nAsked about the Iranian threat against Israel, Ryder replied, \"Is an attack possible this week?\nAsked by Fox News what circumstances would lead to US forces launching an attack on Iran, Ryder responded that the US military is focused on de-escalating the situation in the region.\nOn Tuesday, three senior Iranian officials told Reuters that Iran could delay or cancel its planned attack against Israel if this week's ceasefire talks between Israel and Hamas are successful.\nLater in the day, US President Joe Biden said that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week."}, {"id": "e99a8dbe-5410-45c8-90a8-e868f977a56a", "title": "This is how Israel would defend itself against new missile attacks", "date": "2024-08-14 01:15", "url": "https://www.10news.com/world/israel-at-war/this-is-how-israel-would-defend-itself-against-new-missile-attacks-from-iran-or-others", "domain": "10news.com", "domain_classification": "Unknown", "message": "Tensions between Iran and Israel continue to climb following the killing of Hamas political leader Ismail Haniyeh in Tehran.\nIran also said it would not send delegates to revived cease-fire talks between Hamas and Israel.\nOn Monday, White House officials said it was likely Iran would strike Israel in some fashion this week.\nFor medium- to long-range rockets, Israel deploys the David's Sling system, which it jointly developed with the U.S.\nRELATED STORY | Amid heightened tensions, US deploys additional military resources to Middle EastTo combat longer-range missiles, Israel uses the Arrow system."}, {"id": "1782fab6-fb4d-405f-8eb5-d5f4b17357d7", "title": "Iran threatens to  wipe out  U . S . bases in Middle East amid tensions with Israel – NaturalNews . com", "date": "2024-08-14 10:45", "url": "https://www.naturalnews.com/2024-08-13-iran-threatens-us-bases-in-middle-east.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "Iran threatens to “wipe out” U.S. bases in Middle East amid tensions with IsraelMohammad Marandi, a senior member of Iran's nuclear negotiating team, has threatened to \"wipe out\" every American military base in the Middle East if the United States were to join Israel in an attack on Iran.\nIran's regional proxies in Yemen and Iraq have a history of targeting U.S. positions across the Middle East, with hundreds of strikes in recent years, particularly escalating after the Hamas attack on October 7.\n(Related: U.S. to boost military presence in Middle East following rocket attack on Al-Asad Airbase in Iraq.)\n\"We've been engaged in intense diplomacy with allies and partners, communicating this message directly to Iran and Israel.\"\nAnother world war unfolding after Israel \"assassinates\" Hamas chief in airstrike: \"We have a duty to avenge him,\" vows Iran."}, {"id": "f0a03a4a-8c0b-45b9-9c0f-f126e2c82f76", "title": "Analysis : High - wire diplomacy on possible Iran retaliation in Israel - Hamas war draws in world", "date": "2024-08-14 03:30", "url": "https://www.theday.com/nation/20240813/analysis-high-wire-diplomacy-on-possible-iran-retaliation-in-israel-hamas-war-draws-in-world/", "domain": "theday.com", "domain_classification": "Unknown", "message": "in Tehran, Iran, Thursday, Aug. 1, 2024.\nIt could also free the Israeli hostages who remain captive there since Hamas' Oct. 7 attack on southern Israel that killed 1,200 people and began the conflict.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu's hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nIts first complex attack on Israel in April caused little damage, raising the risk of it needing to go larger this time in response.\nIt also has backed efforts mediated by Egypt and Qatar to reach a cease-fire in the wider war."}, {"id": "53d5db74-6fb7-480b-8219-7df97a2fae29", "title": "High - wire diplomacy on possible Iran retaliation in the Israel - Hamas war draws in world", "date": "2024-08-14 08:30", "url": "https://www.smdailyjournal.com/news/world/high-wire-diplomacy-on-possible-iran-retaliation-in-the-israel-hamas-war-draws-in-world/article_0bfefeba-59ba-11ef-a976-bf02694f52f8.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "5c7ba72a-5f8e-4858-9dce-d729ce25ad9d", "title": "High - wire diplomacy on possible Iran retaliation in the Israel - Hamas war draws in world", "date": "2024-08-14 09:30", "url": "https://www.voanews.com/a/high-wire-diplomacy-on-possible-iran-retaliation-in-the-israel-hamas-war-draws-in-world/7742085.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Iran's threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers into a high-wire act of diplomacy Tuesday.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu's hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea.\nIran for years has asked for Sukhoi Su-35 fighter jets.\nTehran has also sought Russia's S-400 surface-to-air missile defense system, a possible deterrent for the American-made F-35 fighter jets flown by the U.S. and Israel."}, {"id": "1ddfd938-c479-4d5a-bd78-38be362ff8b5", "title": "UK tells UN  Palestinians have nowhere safe to turn  after Israel bombs Gaza school", "date": "2024-08-14 03:15", "url": "https://www.mirror.co.uk/news/uk-news/uk-tells-un-palestinians-nowhere-33458103", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Speaking before the UN Security Council, August 13, the UK's Ambassador James Kariuki said: \"The UK is appalled by the Israeli military strike on al-Tabeen school where Palestinian civilians were sheltering.\nThe UN tells us this strike killed dozens of Palestinians, many of whom are reported to be women and children.\nAmbassador Kariuki continued to express the UK Government's anger at Israel's recent military actions, saying: \"Palestinians have nowhere safe to turn.\n\"We have also heard completely unacceptable rhetoric from Israeli Ministers relating to the mistreatment of detainees and starvation of civilians in Gaza.\nInternational law could not be more clear – systemic mistreatment of detainees and the intentional starvation of civilians are war crimes.\""}, {"id": "2622ad61-0fce-4b95-99d8-2b30bb30da46", "title": "This is how Israel would defend itself against new missile attacks", "date": "2024-08-14 00:15", "url": "https://www.kjrh.com/world/israel-at-war/this-is-how-israel-would-defend-itself-against-new-missile-attacks-from-iran-or-others", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tensions between Iran and Israel continue to climb following the killing of Hamas political leader Ismail Haniyeh in Tehran.\nIran also said it would not send delegates to revived cease-fire talks between Hamas and Israel.\nOn Monday, White House officials said it was likely Iran would strike Israel in some fashion this week.\nFor medium- to long-range rockets, Israel deploys the David's Sling system, which it jointly developed with the U.S.\nRELATED STORY | Amid heightened tensions, US deploys additional military resources to Middle EastTo combat longer-range missiles, Israel uses the Arrow system."}, {"id": "18e7fcfb-8eac-4968-b1be-e8ea90ebacc5", "title": "President Joe Biden believes Iran could scrap plans to strike Israel if it agrees to ceasefire with Hamas in Gaza - 14 - Aug - 2024", "date": "2024-08-14 00:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404614&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "US President Joe Biden believes a Gaza ceasefire could be enough to convince Iran not to launch retaliatory air strikes against Israel, after the assassination of Hamas' top official in Tehran in late July.\nPresident Biden was asked whether he expected Iran to shelve plans, if a ceasefire and hostage deal between Israel and Hamas was agreed to after talks on Thursday.\nHamas has said fresh negotiations would only serve to delay a ceasefire, and allow Israel to continue its bombardment of the war ravaged Gaza Strip.\nIran and Hezbollah planning strikes after assassinations on home soilIran and Iranian-backed Lebanese group Hezbollah are furious with Israel for two assassinations last month.\nHamas said close to 40,000 Palestinians have been killed in Gaza since the war began, after around 1,100 Israelis were killed during Hamas led attacks on October 7."}, {"id": "9f4f147b-dacb-42d7-b134-d3743825343c", "title": "President Joe Biden believes Iran could scrap plans to strike Israel if it agrees to ceasefire with Hamas in Gaza - 14 - Aug - 2024", "date": "2024-08-14 00:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404614&fm=psp,tst", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "US President Joe Biden believes a Gaza ceasefire could be enough to convince Iran not to launch retaliatory air strikes against Israel, after the assassination of Hamas' top official in Tehran in late July.\nPresident Biden was asked whether he expected Iran to shelve plans, if a ceasefire and hostage deal between Israel and Hamas was agreed to after talks on Thursday.\nHamas has said fresh negotiations would only serve to delay a ceasefire, and allow Israel to continue its bombardment of the war ravaged Gaza Strip.\nIran and Hezbollah planning strikes after assassinations on home soilIran and Iranian-backed Lebanese group Hezbollah are furious with Israel for two assassinations last month.\nHamas said close to 40,000 Palestinians have been killed in Gaza since the war began, after around 1,100 Israelis were killed during Hamas led attacks on October 7."}, {"id": "2dcc08de-d9d0-425a-ac63-a4634ff9e9f5", "title": "Kyiv bombards Russian air base 400 miles from the border", "date": "2024-08-14 13:45", "url": "https://www.yahoo.com/news/kyiv-bombards-russian-air-400-125608500.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine has launched a long-range attack against three Russian air bases, including one 400 miles from the border, in Kyiv’s largest drone strike since the beginning of the war.\nOn Wednesday morning, the Russian defence ministry claimed it had downed 117 drones launched at military targets across the country.\nFighter Bomber, a Russian military blogger with links to the country’s air force, wrote on Telegram that the Ukrainian attacks had been “effective on some, unfortunately”.\nLocals reported at least 10 explosions around the Savasleyka airfield, in Russia’s Nizhny Novgorod region, about 400 miles from the border with Ukraine.\nKyiv has repeatedly targeted Russian air bases with its long-range drone attacks."}, {"id": "b3ce84c5-be38-4cea-9046-1ac94c117ceb", "title": "Kyiv bombards Russian air base 400 miles from the border", "date": "2024-08-14 13:30", "url": "https://www.aol.co.uk/news/kyiv-bombards-russian-air-400-125608640.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Ukraine has launched a long-range attack against three Russian air bases, including one 400 miles from the border, in Kyiv’s largest drone strike since the beginning of the war.\nOn Wednesday morning, the Russian defence ministry claimed it had downed 117 drones launched at military targets across the country.\nFighter Bomber, a Russian military blogger with links to the country’s air force, wrote on Telegram that the Ukrainian attacks had been “effective on some, unfortunately”.\nLocals reported at least 10 explosions around the Savasleyka airfield, in Russia’s Nizhny Novgorod region, about 400 miles from the border with Ukraine.\nKyiv has repeatedly targeted Russian air bases with its long-range drone attacks."}, {"id": "339ac653-74b2-4828-af8d-f0239aba14a2", "title": "Hezbollah bombs Israel Mount Neria base", "date": "2024-08-14 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240813-presstv02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah bombs Israel's Mount Neria baseIran Press TVTuesday, 13 August 2024 10:19 PMThe Lebanese resistance movement Hezbollah says it has bombed Israel's Mount Neria base with a barrage of Katyusha rockets.\nHezbollah said in a statement that it attacked \"the 'Mount Neria' base (a battalion headquarters currently occupied by forces from the Golani Brigade) with barrages of Katyusha rockets,\" on Tuesday evening.\nAccording to Hezbollah, the rocket attack was aimed at showing the Lebanese movement's support for Palestinians in Gaza.\nAccording to the Israeli regime's media, Israel's Iron Dome air defense system was unable to intercept most of Hezbollah's missiles.\nHezbollah has been responding with strikes aimed both at retaliating against the regime and supporting the war-hit Gazans."}, {"id": "edf5e177-284d-4b88-8485-6d4992980d1b", "title": "Red Sea tanker attacked 3 times | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-14 10:45", "url": "https://www.arkansasonline.com/news/2024/aug/14/red-sea-tanker-attacked-3-times/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates -- A Liberian-flagged oil tanker in the Red Sea came under attack three times on Tuesday, including in an assault using a bomb-carrying drone boat, likely the latest in a campaign by Yemen's Houthi rebels over the Israel-Hamas war, officials said.\nA small ship \"flashing lights\" at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nSeveral people gathered outside the hospital to perform a funeral prayer for the baby and his uncle whose bodies were wrapped in white shrouds.\nFootage showed a small crowd of people gathering inside the morgue with the dead as they were placed in white bags.\nUnder a longstanding, informal arrangement known as the status quo, Jews are allowed to visit the site but not pray there."}, {"id": "20d825fc-dd73-47fd-85fd-83a11ea223db", "title": "Palestinian death toll in Gaza nears 40 , 000 : Health authorities", "date": "2024-08-14 02:15", "url": "http://www.china.org.cn/world/2024-08/14/content_117365984.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People prepare to bury victims killed in an Israeli airstrike in Gaza City, on Aug. 12, 2024.\n[Photo/Xinhua]The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to nearly 40,000, the Gaza-based health authorities said in a statement on Tuesday.\nMeanwhile, seven people were killed on Tuesday after an Israeli bombing of a house in the Al-Bureij refugee camp in the central Gaza Strip.\nFour people were killed in an Israeli bombing on Deir al-Balah, also in the central Gaza Strip, the Palestinian official news agency WAFA reported.\nOn Saturday and Sunday, the Israeli military issued two new evacuation orders, primarily for areas that were previously placed under evacuation."}, {"id": "b70cde0e-9bd5-4823-a37b-f15c96946317", "title": "Baby twins killed in Gaza as father registered births", "date": "2024-08-14 01:15", "url": "https://www.myjoyonline.com/baby-twins-killed-in-gaza-as-father-registered-births/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Newborn twins were killed in an Israeli airstrike in Gaza while their father was at a local government office to register their birth.\nThe strike also killed his wife and the twins' grandmother.\nAn Israeli military spokesman said the school \"served as an active Hamas and Islamic Jihad military facility\", which Hamas denied.\nHamas-led gunmen killed about 1,200 people in an attack on Israel on 7 October, taking 251 others back to Gaza as hostages.\nThat attack triggered a massive Israeli military offensive on Gaza and the current war."}, {"id": "895bcfb4-15b6-4133-b4d0-4594c37635de", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:30", "url": "https://www.breakingnews.ie/world/israeli-airstrikes-kill-at-least-17-in-gaza-overnight-palestinians-say-1661151.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Israeli airstrikes across the Gaza Strip overnight and into Wednesday killed at least 17 people, including five children and their parents, Palestinian health officials say.\nThe latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nAdvertisementTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nAdvertisementUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "8cad63c0-9bdd-4045-9afa-de4bc9fa6235", "title": "A ship in the Red Sea is targeted in a third attack by suspected Houthis", "date": "2024-08-14 02:30", "url": "https://www.timesfreepress.com/news/2024/aug/13/a-ship-in-the-red-sea-is-targeted-in-a-third-attack-by-suspected-houthis/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "The ship was first attacked as an explosive was detonated near it, the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis have targeted more than 70 vessels with missiles and drones since the start of the war in Gaza in October.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "5f3e7b39-c180-45d3-83fe-e2442e9e7da7", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:45", "url": "https://www.lbc.co.uk/world-news/fb64487d4b6544e2a59d63b5b056f2b1/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The Israeli strike on Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThree-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "48a28352-4d83-4b91-8069-26162239a14c", "title": "Baby twins killed in Gaza as father registered births", "date": "2024-08-14 07:30", "url": "https://saudigazette.com.sa/article/644813/World/Mena/Baby-twins-killed-in-Gaza-as-father-registered-births", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "GAZA — Newborn twins were killed in an Israeli airstrike in Gaza while their father was at a local government office to register their birth.\nThe strike also killed his wife and the twins' grandmother.\nAn Israeli military spokesman said the school \"served as an active Hamas and Islamic Jihad military facility\", which Hamas denied.\nHamas-led gunmen killed about 1,200 people in an attack on Israel on 7 October, taking 251 others back to Gaza as hostages.\nThat attack triggered a massive Israeli military offensive on Gaza and the current war."}, {"id": "a735c3f5-2d5b-4410-bf85-174bae9d116c", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/14/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe Health Ministry in Gaza said 115 newborns have been killed in the territory since the war began.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "5602459b-94ee-4164-ab93-46290fde5014", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:30", "url": "https://www.oxfordmail.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "d78da3b6-9db3-4ed0-914f-cba55e8a0994", "title": "Biden says Gaza ceasefire could stop Iran attacking Israel", "date": "2024-08-14 05:00", "url": "https://www.ewn.co.za/2024/08/14/biden-says-gaza-ceasefire-could-stop-iran-attacking-israel", "domain": "ewn.co.za", "domain_classification": "Unknown", "message": "PALESTINIAN TERRITORIES - US President Joe Biden said Tuesday that a ceasefire deal in Gaza could deter Iran from attacking Israel in retaliation for the killing of a Hamas leader that sent regional tensions soaring.\nAsked if a truce between Israel and Hamas could stave off an Iranian assault, Biden said: \"That's my expectation\".\nFAR-RIGHT MINISTER OPPOSES TALKSThe United States and its European allies also called for a ceasefire between Israel and Hamas in Gaza, with truce talks to resume on Thursday.\n\"We must win and not go to the talks in Doha or Cairo,\" the minister said, referring to the truce talks planned for Thursday.\nBABY PULLED FROM RUBBLEDespite more than 10 months of fighting in Gaza, Hamas has still on occasion been able to fire rockets into Israel."}, {"id": "19029ecc-7347-45d1-838d-8fbc345ae2a0", "title": "Gallant reveals from northern intelligence base :  We took out Hezbollah military ch", "date": "2024-08-14 01:15", "url": "https://www.ynetnews.com/article/hyvvcrt5r", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Gallant reveals from northern intelligence base: 'We took out Hezbollah's military chief from here'Defense minister says IDF intelligence personnel in north preparing for any potential scenario, focused on eliminating threats, all while readying all to strike wherever Israel chooses"}, {"id": "82084ea3-453a-4384-a65f-8b1316d8e9a3", "title": "Israel pounds Gaza ahead of ceasefire talks - World", "date": "2024-08-14 13:45", "url": "https://www.brecorder.com/news/40317505/israel-pounds-gaza-ahead-of-ceasefire-talks", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Israeli air strikes targeted Gaza on Wednesday ahead of ceasefire talks that the United States hopes will stop Iran striking Israel in retaliation for the killing of a Hamas leader.\nAhead of Thursday’s ceasefire talks, a Hamas official said the Islamist movement was “continuing its consultations with the mediators”.\nBiden said on Tuesday that a Gaza ceasefire deal could deter Iran from attacking Israel.\n39,897 Palestinians killed in Israel’s aggression in Gaza since Oct.7The Palestinian group also seized 251 people, 111 of whom are still held captive in Gaza, including 39 the military says are dead.\nIn the past 24 hours, the army said it had “struck over 40” sites across Gaza, including structures from which fighters fired anti-tank missiles."}, {"id": "eb0f2309-e433-4d67-8006-a60c5a5f6933", "title": "Biden says Gaza ceasefire could stop Iran attacking Israel", "date": "2024-08-14 01:15", "url": "https://www.al-monitor.com/originals/2024/08/biden-says-gaza-ceasefire-could-stop-iran-attacking-israel", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "US President Joe Biden said Tuesday that a ceasefire deal in Gaza could deter Iran from attacking Israel in retaliation for the killing of a Hamas leader that sent regional tensions soaring.\nAsked if a truce between Israel and Hamas could stave off an Iranian assault, Biden said: \"That's my expectation\".\n- Far-right minister opposes talks -The United States and its European allies also called for a ceasefire between Israel and Hamas in Gaza, with truce talks to resume on Thursday.\n\"We must win and not go to the talks in Doha or Cairo,\" the minister said, referring to the truce talks planned for Thursday.\n- Baby pulled from rubble -Despite more than 10 months of fighting in Gaza, Hamas has still on occasion been able to fire rockets into Israel."}, {"id": "05532ca2-aeb4-46d1-95d7-e2d753e96056", "title": "Nasrallah Adopts A  Slow And Steady  Strategy In Response To Israeli Strikes", "date": "2024-08-14 08:15", "url": "https://menafn.com/1108551934/Nasrallah-Adopts-A-Slow-And-Steady-Strategy-In-Response-To-Israeli-Strikes", "domain": "menafn.com", "domain_classification": "Unknown", "message": "He remarked that Israel's preparedness and its week-long wait for the anticipated strikes represent a significant form of punishment.\nEven before the events of October 7 and the Israeli incursion into Gaza, visible disagreements had emerged between President Biden and Israeli Prime Minister Benjamin Netanyahu.\nBiden has managed, to some extent, to rein in Netanyahu and has succeeded on several occasions, particularly concerning the conflict with Iran.\nThere are several reasons for this timing: first, Israel has largely completed its military operations in Gaza, significantly diminishing Hamas's capabilities.\nHowever, the“slow and steady” strategy may have emerged to restore calm to the atmosphere, at least temporarily."}, {"id": "4ce1e88e-767d-46a9-9e20-172cd947d012", "title": "Israel - Hamas war news : Strikes kill 7 in Gaza", "date": "2024-08-14 12:30", "url": "https://www.ctvnews.ca/world/israeli-strikes-kill-at-least-17-in-gaza-overnight-palestinians-say-1.7000109", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Palestinian health officials say Israeli strikes across the Gaza Strip overnight and into Wednesday killed at least 17 people, including five children and their parents.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nHealth authorities in Gaza do not say whether those killed in Israeli strikes are militants or civilians.\nIsraeli military bulldozers demolish 6 more homesJERUSALEM -- Residents of a beleaguered Bedouin hamlet in the southern reaches of the occupied West Bank say Israeli military bulldozers demolished six more homes in the community on Wednesday, leaving 28 people homeless.\nCOGAT, the Israeli military body in charge of civilian matters in the West Bank, did not immediately respond to a request for comment."}, {"id": "78b71a6c-0707-4a3a-888f-512fa36c2da7", "title": "Israel - Hamas war latest : Israeli strikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.clickondetroit.com/news/world/2024/08/14/israel-hamas-war-latest-israeli-strikes-kill-at-least-17-in-gaza-overnight-palestinians-say/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)Palestinian health officials say Israeli strikes across the Gaza Strip overnight and into Wednesday killed at least 17 people, including five children and their parents.\nHealth authorities in Gaza do not say whether those killed in Israeli strikes are militants or civilians.\nIran and Hezbollah say they are committed to their retaliatory attack.\nIsraeli military bulldozers demolish 6 more homes in occupied West Bank, residents sayJERUSALEM — Residents of a beleaguered Bedouin hamlet in the southern reaches of the occupied West Bank say Israeli military bulldozers demolished six more homes in the community on Wednesday, leaving 28 people homeless.\nCOGAT, the Israeli military body in charge of civilian matters in the West Bank, did not immediately respond to a request for comment."}, {"id": "50e4a03d-c8ec-4392-aaa1-4a0da4eb1198", "title": "8 US Troops Treated for TBI , Smoke Inhalation After Syria Attack , Pentagon Says", "date": "2024-08-14 02:15", "url": "https://www.military.com/daily-news/2024/08/13/8-us-troops-treated-tbi-smoke-inhalation-after-syria-attack-pentagon-says.html", "domain": "military.com", "domain_classification": "Unknown", "message": "Eight U.S. service members were treated for traumatic brain injury and smoke inhalation after a one-way drone attack in Syria over the weekend, a Pentagon spokesperson confirmed Tuesday.\nRyder stressed that \"none of the injuries are life-threatening,\" but provided no other details on the condition of the service members or the severity of the brain injuries.\nThe drone strike in Syria is the second time in recent weeks that U.S. troops in the Middle East have been injured.\nEarlier this month, the Pentagon announced the USS Abraham Lincoln carrier strike group was heading to the region to replace the USS Theodore Roosevelt strike group.\nRelated: As Tensions Simmer in the Middle East, Pentagon Redirects Carrier Strike Group to the Area"}, {"id": "2cae10a2-8ef1-4085-8705-4643d2db72ee", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:45", "url": "https://www.breakingnews.ie/world/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike-1661090.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nAdvertisementMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nAdvertisementThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nAdvertisementHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "ea24509e-63e9-41e5-b07f-bf6ba365b4f0", "title": "Erdan at UN :  You convened for these terrorists , but not for the children of Majdal Shams  ", "date": "2024-08-14 06:00", "url": "https://www.israelnationalnews.com/news/394598", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Israel's ambassador to the UN, Gilad Erdan, presented the Council with images of the Hamas terrorists who were eliminated in the school.\nStrongly criticizing the Council, he remarked: “You convened for these terrorists who used a school as their terror base, but for the children of Majdal Shams, murdered by Hezbollah’s rocket fire, you couldn’t find the time for an urgent session!\nShame on you!”Erdan presented the UN with images of the Hamas terrorists who were the target of the strike in Gaza, as well as images of the Israeli children who were murdered in Majdal Shams, and sharply criticized the Security Council: “The Council convened today to discuss Hamas’ false claims.\nThese are the people you called an emergency session for!”He also displayed a board with the faces of the children who were murdered by a Hezbollah missile in Majdal Shams: “While those terrorists used a school as their terror base, these children will never see their school again.\nBut for them, you couldn’t find the time for an urgent session!"}, {"id": "b496a49d-4f27-4dfb-9272-ffdede487979", "title": "Biden expects Iran not to attack if a ceasefire is reached", "date": "2024-08-14 01:15", "url": "http://www.israelnationalnews.com/news/394582", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "US President Joe Biden said Tuesday that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week.\n“That’s my expectation,” Biden told reporters when asked if he believes Iran will not strike if a deal is signed.\nWe believe getting to a ceasefire deal is the best way to de-escalate the tensions that we’re seeing,” Jean-Pierre told reporters.\nIran has threatened for the last two weeks to retaliate for the assassination of Hamas leader Ismail Haniyeh in Tehran on July 31.\nIsraeli and US officials have stated that they believe an Iranian attack on Israel could happen in the coming days."}, {"id": "45fd8d90-8b78-4e0c-9aec-318e1d33d156", "title": "Latest Israeli Attacks on Gaza Kill 32 Palestinians ; Hamas Says Hostages Killed , Wounded", "date": "2024-08-14 01:00", "url": "https://havanatimes.org/news/latest-israeli-attacks-on-gaza-kill-32-palestinians-hamas-says-hostages-killed-wounded/", "domain": "havanatimes.org", "domain_classification": "Unknown", "message": "By Democracy NowHAVANA TIMES – Israel’s assault on the Gaza Strip continues, with at least 32 more Palestinians killed in the past 24 hours, according to the Health Ministry in Gaza.\nOne overnight strike by Israel on a home in Khan Younis killed 10 Palestinians and wounded several others.\nAnother Israeli attack leveled a residential building in Gaza City, burying residents in their homes.\nWe came to see what had happened, and we found that the Israeli military had hit the building.\nMeanwhile, the United Nations Security Council is set to meet today in the wake of Saturday’s devastating Israeli airstrike on a school in Gaza City that killed over 100 Palestinians."}, {"id": "d8de08f7-0d7e-4460-b5f9-eb37561aebaa", "title": "The Largest Attack : Ukraine Struck Four Russian Airfields At Night", "date": "2024-08-14 13:15", "url": "https://charter97.org/en/news/2024/8/14/606739/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "The Largest Attack: Ukraine Struck Four Russian Airfields At Night 14.08.2024, 14:426,038The raid involved drones from the SSU and various branches of the Defense Forces.\nUkraine launched the largest attack on Russian airfields since the full-scale war started, hitting Voronezh, Kursk, Savasleyka, and Borisoglebsk air bases.\nMeanwhile, the Russian so-called war propagandists are already saying that the strike was effective, as the Russian air defense failed to protect these facilities.\nLocal Telegram channels report 10 explosions at the Savasleyka air base, where MiG-31K fighters regularly take off and terrorize all of Ukraine with air alert raids.\n“The SSU continues to methodically weaken the aviation component of the Russian military machine."}, {"id": "fc4a786b-a95b-4523-be1a-50b075a27c91", "title": "Iran Knows It Cannot Win a War Against Israel | The Jewish Press - JewishPress . com | Gatestone Institute | 10 Av 5784 – Wednesday , August 14 , 2024", "date": "2024-08-14 05:00", "url": "https://www.jewishpress.com/indepth/opinions/iran-knows-it-cannot-win-a-war-against-israel/2024/08/14/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Tensions between Iran and Israel have risen considerably since Israel was accused of carrying out the assassination of Hamas Political Bureau leader Ismail Haniyeh in Tehran shortly after the swearing in ceremony for Iran’s President Masoud Pezeshkian last month.\nA senior Hezbollah commander, Fuad Shukr, was assassinated in Beirut the previous day, in an operation for which Israel took credit.\nThat assessment has now been scaled down, with US officials reporting that Hezbollah is likely to carry out its own attack against Israel independent of whatever action Iran may be considering.\nAfter days of waiting for Iran to launch an attack, Israeli officials also believe that the initial assault will not originate from Iran.\nIran has previously played a key role in supporting Russia’s military campaign in Ukraine, where Iranian attack drones are regularly used to target key Ukrainian infrastructure."}, {"id": "21209908-fdcd-4a2a-8c9c-8b37a40002d4", "title": "Ilhan Omar wins primaries in Minnesota", "date": "2024-08-14 04:00", "url": "https://www.israelnationalnews.com/news/394592", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Rep. Ilhan Omar (D-MN) fended off several primary challengers and won the Democratic nomination for the House of Representatives in Minnesota's 5th Congressional District, NBC News projected.\nOmar defeated former Minneapolis City Councilman Don Samuels, who lost to the congresswoman by just 2 percentage points in the 2022 primary, and two other challengers.\nIn late June, group member Jamaal Bowman lost his Democratic primary in New York to Westchester County Executive George Latimer.\nOmar did not face an onslaught of attack ads from outside groups as did the other candidates from “The Squad” who were defeated in their primaries.\nOmar has recently come under fire again for her condemnation of Israel’s actions in the war against Hamas."}, {"id": "cea5f3f5-ae99-4194-aef3-413d8108145c", "title": "Ilhan Omar wins primaries in Minnesota", "date": "2024-08-14 06:15", "url": "http://www.israelnationalnews.com/news/394592", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Rep. Ilhan Omar (D-MN) fended off several primary challengers and won the Democratic nomination for the House of Representatives in Minnesota's 5th Congressional District, NBC News projected.\nOmar defeated former Minneapolis City Councilman Don Samuels, who lost to the congresswoman by just 2 percentage points in the 2022 primary, and two other challengers.\nIn late June, group member Jamaal Bowman lost his Democratic primary in New York to Westchester County Executive George Latimer.\nOmar did not face an onslaught of attack ads from outside groups as did the other candidates from “The Squad” who were defeated in their primaries.\nOmar has recently come under fire again for her condemnation of Israel’s actions in the war against Hamas."}, {"id": "d2e54bba-f736-4761-aada-112afff6408d", "title": "Pentagon says an attack by Iran on Israel is  certainly possible  this week :  We need to take it seriously  ", "date": "2024-08-14 01:00", "url": "https://www.yahoo.com/news/pentagon-says-attack-iran-israel-223037844.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pentagon says an attack by Iran on Israel is 'certainly possible' this week: ‘We need to take it seriously'A Pentagon spokesperson told reporters on Tuesday that an attack by Iran on Israel is \"certainly possible\" this week, adding that the threat needs to be taken seriously, so more resources are being maneuvered to the region.\n\"Is an attack possible this week?\nThat’s certainly possible,\" Ryder said.\nUS MILITARY EXPANDS PRESENCE IN MIDDLE EAST, REPOSITIONS FORCES AS REGIONAL TENSIONS SIMMERPentagon Press Secretary Maj. Gen. Pat Ryder said an attack by Iran is \"certainly possible\" this week.\nOriginal article source: Pentagon says an attack by Iran on Israel is 'certainly possible' this week: ‘We need to take it seriously'"}, {"id": "3e6a84ca-53f5-4b4f-a730-1818d0bdcefc", "title": "Officials head to Middle East for Gaza ceasefire talks in race to stop conflict from spreading", "date": "2024-08-14 04:00", "url": "https://www.theglobeandmail.com/world/article-officials-head-to-middle-east-for-gaza-ceasefire-talks-in-race-to-stop/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The ceasefire talks, which are set to take place in Doha, Qatar, or Cairo, were expected to include top intelligence officials from Egypt, Israel and the United States, as well as the Qatari Prime Minister.\nHamas leaders have not met directly with Israeli officials throughout the war, relying on Qatar and Egypt to act as intermediaries.\nBut Mr. Netanyahu has added new conditions to Israel’s demands that his own negotiators fear have created obstacles to a deal, according to unpublished documents reviewed by The New York Times.\nThey said they were willing to present a “final bridging proposal” to close a deal between Israel and Hamas.\nIsrael has not acknowledged that it was behind the explosion, but U.S. officials have privately assessed that it was."}, {"id": "5544844c-8978-4b2d-80ab-7426651e1b95", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 06:15", "url": "https://www.edp24.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "ac7a6615-7914-4797-8600-1f6453cc90e3", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:30", "url": "https://www.bournemouthecho.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "6dc942e4-0dc3-455e-9aac-53d0b0acd8a9", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:15", "url": "https://www.theargus.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "ad8bb4d2-5121-46b9-9325-ce61c9c6c6f4", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:00", "url": "https://www.echo-news.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "5f9ff1d1-3b90-4e2b-b829-fe2e34980e34", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.salisburyjournal.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "3ce8c563-c4e5-4916-8b5a-5d839e529392", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "ae3abbee-0575-4c29-8121-bd167305c5cd", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:45", "url": "https://www.eadt.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "4cc8a473-0b60-4112-9119-8b091c85005f", "title": "Fearing Iran attack , Israeli museum hides top artworks", "date": "2024-08-14 04:00", "url": "https://www.khaleejtimes.com/world/mena/fearing-iran-attack-israeli-museum-hides-top-artworks", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "A sign leads visitors to a \"protected space\" at the Tel Aviv Museum of Art in Tel Aviv on Tuesday.\n-- AFPPublished: Wed 14 Aug 2024, 7:16 AMAn Israeli museum that hid some of its most valuable artworks after the October 7 attack has now stashed away even more, fearing a strike by Iran.\nPaintings by Pablo Picasso and Gustav Klimt are among the treasures moved by Tel Aviv Museum of Art to the \"safe\" -- a secured basement meant to shield them from missiles.\nMuseum staff moved many of the masterpieces at the start of the Gaza war, which was triggered by the Palestinian group Hamas's unprecedented attack on Israeli soil on October 7.\n\"So we took down several other works of art and the ones we felt that were most in danger."}, {"id": "3b8a939c-e328-4b63-abea-3f68d885a5cf", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:30", "url": "https://www.theboltonnews.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "3e3ea609-2e91-4d76-a098-a275f4b8bd60", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:00", "url": "https://www.thenorthernecho.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "13d24ad2-0956-4c2e-9e39-0c036b34d0a4", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 06:15", "url": "https://www.bucksfreepress.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "a2ea155e-7e9a-4b93-bb3f-4ebf7c42ee01", "title": "WATCH : Possible lightning bolt causes spark , dirt explosion outside Florida home", "date": "2024-08-14 03:45", "url": "https://www.fox4news.com/news/lightstrike-strikes-tree-florida-home", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "Earlier this week, a Florida homeowner's security camera appeared to capture a powerful lightning strike, causing a loud boom, and apparently sending dirt flying into the air.\nDavid Houghton, who lives in Ocoee, Florida, shared the video with FOX 35.\nThey assumed it was a lightning strike.\nFOX 35 went through frame by frame.\nHe said it also signifies the importance that there is no safe spot outside when lightning is around and that lightning can strike anywhere."}, {"id": "f048706e-e843-4f67-aeeb-7b2e3e54f0d1", "title": "Four - day - old twins killed in Gaza by Israeli airstrike as father registered births", "date": "2024-08-14 08:45", "url": "https://www.theguardian.com/world/article/2024/aug/14/twin-babies-killed-gaza-israeli-airstrike", "domain": "theguardian.com", "domain_classification": "International", "message": "Four-day-old twins have been killed in an Israeli airstrike in Gaza while their father went to register their birth, he has said, as Israel continued its bombardment of the territory.\n1:09 Newborn twins killed in Gaza as father went to collect their birth certificates – video“I don’t know what happened,” he told the AP while sitting at the hospital where their bodies were taken, holding the twins’ birth certificates.\nThe strike late on Monday also killed Reem Abu Hayyah’s parents and the parents of three other children.\nPhotograph: Abdel Kareem Hana/APThe health ministry in Gaza said 115 newborns had been killed in the territory since the war began.\nAlmost 40,000 people have been killed in Israeli attacks on Gaza since 7 October; thousands more are believed to be buried under the rubble."}, {"id": "2c2f2177-644c-4170-b314-d1f8ecb18e85", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.eveningnews24.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "5e54ab8d-4eb6-427e-aefe-6b2b41128d9d", "title": "Israeli strikes on Gaza leave orphans , childless parents", "date": "2024-08-14 02:00", "url": "https://www.mercurynews.com/2024/08/13/israeli-strikes-on-gaza-leave-orphans-childless-parents/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents or siblings.\nThe Israeli strike late Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "2151a9ba-8604-48fb-857b-1556de502267", "title": "Israeli strikes on Gaza leave orphans , childless parents", "date": "2024-08-14 01:30", "url": "https://www.eastbaytimes.com/2024/08/13/israeli-strikes-on-gaza-leave-orphans-childless-parents/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents or siblings.\nThe Israeli strike late Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "818471f7-9501-4e5a-81b7-fba9281cf481", "title": "Hamas Fired Rockets From Humanitarian Corridor | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 10 Av 5784 – Wednesday , August 14 , 2024", "date": "2024-08-14 12:30", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/hamas-fired-rockets-from-humanitarian-corridor/2024/08/14/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: COGATHamas fired rockets towards Israel from a location adjacent to the Khan Yunis humanitarian corridor, prompting an Israeli airstrike on the source of the launch, the Israel Defense Forces said on Wednesday morning.\n“The Hamas terrorist organization continues to deliberately embed its military assets used to carry out attacks against Israel next to humanitarian infrastructure and the civilian population inside the Gaza Strip,” the IDF said of Tuesday’s rocket fire.\nAdvertisementOver the past day, the Air Force struck over 40 Hamas sites throughout Gaza, including structures from which terrorists fired anti-tank missiles, and terrorists who posed a threat to soldiers.\nIn central Gaza, troops dismantled Hamas terror infrastructure, as well as sniper and observation posts.\nHamas has also been holding captive two Israeli civilians since 2014 and 2015, and the bodies of two soldiers killed in 2014."}, {"id": "b8c91a61-cd8d-4b23-b31b-b82c3e593a0d", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 02:30", "url": "https://www.news-gazette.com/news/nation-world/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children/article_8c7fd72b-32b9-5f4e-8a83-6d9782c03831.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Champaign, IL (61820)TodaySunshine to start, then a few afternoon clouds.\nWinds SE at 5 to 10 mph..TonightPartly cloudy early followed by cloudy skies overnight.\nSlight chance of a rain shower.\nWinds SE at 5 to 10 mph."}, {"id": "b45792dd-15c4-4ab1-a99b-54006f244666", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 00:15", "url": "https://13wham.com/news/nation-world/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children-08-13-2024", "domain": "13wham.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents, brothers or sisters.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nIsraeli Prime Minister Benjamin Netanyahu has often said that “they killed parents in front of their children and children in front of their parents” to illustrate the brutality of the attack, most recently in his address to the U.S. Congress last month.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "6f16f161-ec9d-41fe-985e-7a9a38036059", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.oxfordmail.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "f97e57c8-bd5a-47d8-82d0-e7b8002dc594", "title": "WATCH : Possible lightning bolt causes spark , dirt explosion outside Florida home", "date": "2024-08-14 11:00", "url": "https://www.fox5dc.com/news/lightstrike-strikes-tree-florida-home", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "Earlier this week, a Florida homeowner's security camera appeared to capture a powerful lightning strike, causing a loud boom, and apparently sending dirt flying into the air.\nDavid Houghton, who lives in Ocoee, Florida, shared the video with FOX 35.\nThey assumed it was a lightning strike.\nFOX 35 went through frame by frame.\nHe said it also signifies the importance that there is no safe spot outside when lightning is around and that lightning can strike anywhere."}, {"id": "dd042cc1-e02d-4ad3-ac99-f5daf3d7095e", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 01:45", "url": "https://isp.netscape.com/news/world/story/0001/20240814/36c11d9bb2c01b094e4301bf4e197f0b", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli strikes on Gaza leave children without parents and parents without childrenDEIR AL-BALAH, Gaza Strip (AP) — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday.\nIt has left parents without children and children without parents or siblings.\nThe dead included Abu Hayyah's parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza's territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "54119475-aecd-4024-9458-be7823a6eb6e", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.ledburyreporter.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "ledburyreporter.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "fa22adcc-31e2-4264-ba41-d8ac5e0fb716", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.timesandstar.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "timesandstar.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "6a621dcb-4ea7-4478-ad5e-9f6479893fae", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.heraldseries.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "heraldseries.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "58fd1de0-cafe-45ed-9589-60c1e593af22", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.sloughobserver.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "sloughobserver.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "463af4fd-a4ba-4d3e-a0e3-abc2af3d99df", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:00", "url": "https://www.harrowtimes.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "harrowtimes.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "db0b6554-5213-4536-9f86-8f154f57befb", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:30", "url": "https://www.tivysideadvertiser.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "tivysideadvertiser.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "4524f523-d32f-41f9-95e3-6bb27f4fc910", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:30", "url": "https://www.burytimes.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "burytimes.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "f04173b6-2f64-43c7-8b48-b953a96ccdef", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:30", "url": "https://www.northwalespioneer.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "northwalespioneer.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "ca0e446a-01c9-4b75-b0ec-9b7aa0be5976", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:45", "url": "https://www.eastlothiancourier.com/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "eastlothiancourier.com", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "f2652221-d4a0-4497-9eb6-f408aacf926e", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:45", "url": "https://www.leaderlive.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "leaderlive.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "fdae767e-d30f-4d1f-9c2e-e37ef6ba1b0b", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:45", "url": "https://www.times-series.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "times-series.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "a9d9a17b-bee8-4311-bcb4-eda1d7de43b1", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:45", "url": "https://www.barryanddistrictnews.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "barryanddistrictnews.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "e0df573c-9082-4c7e-ace5-70be25b63332", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:30", "url": "https://www.clactonandfrintongazette.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "clactonandfrintongazette.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "a3ccfadd-1c53-4e46-87ac-7f3ffae42d3c", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:00", "url": "https://www.bridgwatermercury.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "bridgwatermercury.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "35f0d2cc-09f5-4035-a49d-4efc7076ca97", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:00", "url": "https://www.watfordobserver.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "watfordobserver.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "03c53753-4691-4312-90a1-e0e3075f7ae3", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:00", "url": "https://www.ludlowadvertiser.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "ludlowadvertiser.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "c89c081a-607a-4436-948c-2cfc9ed08680", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:30", "url": "https://www.borehamwoodtimes.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "borehamwoodtimes.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "a3362247-8913-488e-a540-fc405a9475a7", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:30", "url": "https://www.bridportnews.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "bridportnews.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "410133a1-14f0-44dd-875a-451fe5a6ca2c", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:30", "url": "https://www.hampshirechronicle.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "hampshirechronicle.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "4b596cb9-8904-48c8-a9ca-0a500bc62cfa", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:15", "url": "https://www.newsshopper.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "newsshopper.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "ff6acdf5-77cf-457e-9b36-8f163826c3f9", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 11:15", "url": "https://www.wiltshiretimes.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "wiltshiretimes.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "28a2c139-2c27-4ef4-a5a2-daad65948e38", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 10:15", "url": "https://www.hillingdontimes.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "hillingdontimes.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "4d5f59fd-f04a-41bf-84d7-72a0b9797b4e", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:00", "url": "https://www.guardian-series.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "guardian-series.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "61b2755d-b317-49ed-a6f3-f8defbe30164", "title": "Israeli airstrikes kill at least 17 in Gaza overnight , Palestinians say", "date": "2024-08-14 09:00", "url": "https://www.rhyljournal.co.uk/news/national/24517103.israeli-airstrikes-kill-least-17-gaza-overnight-palestinians-say/", "domain": "rhyljournal.co.uk", "domain_classification": "Unknown", "message": "The latest strikes came on the eve of new talks aimed at reaching a ceasefire between Israel and Hamas in the 10-month-long war.\nOne strike hit a family home late on Tuesday in the built-up Nuseirat refugee camp in central Gaza, which dates back to the 1948 war surrounding Israel’s creation.\nTwo more people were killed in an Israeli strike on a house in the northern town of Beit Lahiya, according to the emergency service.\nUN Security Council members have called for a Gaza ceasefire deal.\nUS ambassador Linda Thomas-Greenfield told the Security Council her country is prepared to make “a final bridging proposal: one that resolves the remaining implementation issues in a manner that meets the expectations of all parties”."}, {"id": "7254cb68-1ff5-451e-9507-c72f256ce871", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 04:15", "url": "https://www.adn.com/nation-world/2024/08/13/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children/", "domain": "adn.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)DEIR AL-BALAH, Gaza Strip — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday.\nIt has left parents without children and children without parents or siblings.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nMohammad Abu Al-Qumsan, Center, prays next to the bodies of his 4-day-old twin children, killed in the Israeli bombardment of the Gaza Strip, at a hospital in Deir al-Balah, Tuesday, Aug. 13, 2024.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "76a6d931-4307-445f-8b4d-76c03de8c9b7", "title": "US Navy newest air - to - air missile could tilt balance in South China Sea", "date": "2024-08-14 14:00", "url": "https://www.timeslive.co.za/news/world/2024-08-14-us-navys-newest-air-to-air-missile-could-tilt-balance-in-south-china-sea/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "19292908-d875-4e4c-88d3-b127fabe1a91", "title": "Hezbollah launches rockets towards N . Israel", "date": "2024-08-14 07:15", "url": "http://global.chinadaily.com.cn/a/202408/14/WS66bc17bca3104e74fddb9eb9.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched over 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on Oct 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "632d85c2-dc25-4edd-b7f6-7e2cde113ac7", "title": "Hezbollah launches rockets towards N . Israel", "date": "2024-08-14 05:00", "url": "https://global.chinadaily.com.cn/a/202408/14/WS66bc17bca3104e74fddb9eb9.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched over 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on Oct 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "d7201701-46d2-40dc-9322-400b16408b55", "title": "Hezbollah launches rockets towards N . Israel - World News", "date": "2024-08-14 04:00", "url": "http://english.sina.com/world/2024-08-14/detail-inciqnpq7835402.shtml", "domain": "english.sina.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched over 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "ee0fc550-0561-451a-aa67-c7468b4bd3fe", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 02:30", "url": "https://www.prokerala.com/news/articles/a1555747.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "15b4085d-d206-4a36-ad1d-af4388f98f03", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 02:30", "url": "https://www.prokerala.com/news/articles/a1555748.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "494a1cfd-5814-424d-bb23-809e4fb13755", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 08:15", "url": "https://www.thestatesman.com/world/hezbollah-launches-rockets-towards-israel-1503331545.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Hezbollah attacked the Mount Neria base, a battalion leadership headquarters of Israel’s Golani Brigade forces, with volleys of Katyusha rockets late Tuesday night, according to state media.\nEarlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "5ae4398a-93e5-4088-9402-712bf6d62427", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 04:15", "url": "https://www.siasat.com/hezbollah-launches-rockets-towards-israel-3078636/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Beirut: Hezbollah attacked the Mount Neria base, a battalion leadership headquarters of Israel’s Golani Brigade forces, with volleys of Katyusha rockets late Tuesday night, according to state media.\nEarlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "dd44ffac-4d73-411c-85f0-40e0d44e4fe8", "title": "Pakistan : Three dead , ten wounded in Quetta violence", "date": "2024-08-14 08:15", "url": "https://news.webindia123.com/news/Articles/World/20240814/4225012.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "This explosion caused extensive damage in the area, raising concerns among residents about their safety.\nThe explosion at the shop caused severe damage and injured seven people, including the shop owner and his brother.\nEarly in the morning, another grenade attack occurred near a girls' high school on Munir Mengal Road.\nThis attack injured the school watchman and caused damage to a portion of the school building.\nSimilarly, a grenade attack on a security forces checkpost in Panjgur also caused no casualties."}, {"id": "6ef175e8-b7f3-491e-bd6b-e1671ddd6121", "title": "Chinese Scientists Publish Skipping - Stone Technique for Hypersonic Missiles", "date": "2024-08-14 10:00", "url": "https://www.businessinsider.com/china-hypersonic-missiles-skip-gliding-strike-deeper-us-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewA team of scientists in China believe they've found a way to make hypersonic missiles more potent — by extending their range via \"skipping\" on the atmosphere.\nSkip-gliding missiles may also be harder to track and intercept, she added.\nKavanagh noted that a future skip-gliding missile would likely still be detectable from hundreds of miles away.\nAdvertisementKearn believes the issue is being overblown since China has the ability to launch nuclear strikes regardless of its hypersonic missiles.\nAdvertisementTheir next step, they said, would be to research how easily a skip-gliding missile can maneuver and navigate laterally."}, {"id": "65d2c242-2c0d-486e-a240-cd4c5e392c4e", "title": "Gaza ceasefire : Hamas says again it wants implementation , not more talks", "date": "2024-08-14 03:45", "url": "https://www.asiaone.com/world/gaza-ceasefire-hamas-says-again-it-wants-implementation-not-more-talks", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Two rockets had been fired from Gaza, the Israeli military said, one of which fell in the sea and the other had not reached Israeli territory.\nIsraeli airstrikes killed 19 Palestinians in the central and southern Gaza Strip on Tuesday, medics said.\nThe Israeli military and Islamic Jihad and Hamas said they were fighting in several areas of Gaza.\nCeasefire talksThe US said on Monday that it expected Gaza ceasefire talks slated for Thursday to go ahead as planned, and that an agreement was still possible.\nBut Hamas is demanding a workable plan to implement the proposal, presented by US President Joe Biden in May — rather than more talks."}, {"id": "d07d2355-94e5-4282-8c59-ef381ba320e9", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:45", "url": "https://guernseypress.com/news/world-news/2024/08/14/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike/", "domain": "guernseypress.com", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe Health Ministry in Gaza said 115 newborns have been killed in the territory since the war began.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "847bf8c7-bd5e-445c-b09b-ff383be31072", "title": "Woman violently attacked at Pasadena Metro station faces  long - term disfigurement , officials say", "date": "2024-08-14 00:00", "url": "https://www.yahoo.com/news/woman-violently-attacked-pasadena-metro-231858358.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The woman violently attacked at a Pasadena Metro station and dragged onto the 210 Freeway is facing \"long-term disfigurement,\" officials said Tuesday.\nThe victim was at the Allen Metro station near Pasadena City College early Wednesday morning when a man approached her and, out of the blue, struck her in the face, authorities said.\nThe damage to her head and face was severe enough that \"there is potential for long-term disfigurement,\" the department said.\nJuan Pablo Flores, 33, was arrested Wednesday around 5:45 a.m., shortly after the attack occurred, the L.A. County district attorney's office said Monday.\nSign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week."}, {"id": "53c4efe3-5fb2-41e0-9030-8de38ef49c92", "title": "Over 1 , 000 arrested following united kingdom disorder : police", "date": "2024-08-14 01:00", "url": "https://www.geo.tv/latest/559109-over-1000-arrested-following-uk-disorder-police", "domain": "geo.tv", "domain_classification": "Unknown", "message": "—ReutersRiots started following death of three girls in stabbing.\nUK police have arrested over 1,000 people in connection with riots that took place over the last two weeks in England, officials said on Tuesday.\n\"Forces across the country have now made more than 1,000 arrests in connection with the recent violent disorder,\" the National Police Chiefs’ Council (NPCC) said on X.\nFar-right riots took place after misinformation spread about the identity of the alleged perpetrator of the knife attack, with multiple people being jailed for spreading hate online in recent days.\nOne man, John Honey, pleaded guilty to helping attack a car with three Romanian men in it and assaulting police during riots in Hull, northeast England."}, {"id": "e737208e-a388-4b5b-b61a-4893c75d5bdb", "title": "High - stakes Gaza ceasefire talks resume this week . Here are the main obstacles to a deal", "date": "2024-08-14 09:30", "url": "https://edition.cnn.com/2024/08/13/middleeast/gaza-ceasefire-talks-resume-main-obstacles-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "The deal was proposed by US President Joe Biden in May – but unresolved differences have left the path forward unclear.\nLast month, the prime minister reversed on a key Israeli concession in ceasefire negotiations, demanding that armed men be barred from returning to northern Gaza during an eventual ceasefire, an Israeli source familiar with the talks told CNN.\nThere were concerns that the assassination would throw a wrench in the negotiations between Israel and Hamas.\nThe militant group replaced Haniyeh with Yahya Sinwar, the hardline Hamas leader in Gaza who is one of Israel’s most wanted men.\nThere have been some indications that Iran may abandon plans to attack Israel if a ceasefire deal is reached."}, {"id": "ba719ff5-dc69-4f6f-a5a0-71887a520ece", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 05:00", "url": "https://www.dorsetecho.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "dorsetecho.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "6607a68f-48c7-42bb-989b-ad3bec5aeaed", "title": "Only Gaza ceasefire can delay Iran Israel response", "date": "2024-08-14 02:15", "url": "https://economictimes.indiatimes.com/news/defence/only-gaza-ceasefire-can-delay-irans-israel-response/articleshow/112509086.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Three regional government sources described conversations with Tehran to avoid escalation ahead of the Gaza ceasefire talks, due to begin on Thursday in either Egypt or Qatar.\n\"We hope our response will be timed and executed in a way that does not harm a potential ceasefire,\" Iran's mission to the U.N. said on Friday in a statement.\n\"Iran's foreign ministry and its Revolutionary Guards Corps did not immediately respond to questions for this story.\n\"Laylaz said Iran had not previously been involved in the Gaza peace process but was now ready to play \"a key role.\n\"Iran wants its response to be much more effective than the April 13 attack,\" said Farzin Nadimi, senior fellow with the Washington Institute for Near East policy."}, {"id": "f319998b-b15d-4b22-a67d-e5a52dd2c7e7", "title": "Iran Rejects Western Plea to Drop Israel Retaliation Threats", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/13/iran-rejects-western-plea-to-drop-israel-retaliation-threats/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Iran on Tuesday categorically refused Western calls to drop its threat to retaliate against Israel for last month’s killing of Hamas terrorist leader Ismail Haniyeh in Tehran.\nIsrael has been blamed for Haniyeh’s killing on July 31 during a visit to the Iranian capital for the swearing-in of President Masoud Pezeshkian.\nIran has since been publicly vowing revenge and on Monday key Western allies urged it to reconsider, as Breitbart News reported.\nThe United States has deployed an aircraft carrier strike group and a guided missile submarine to the region in support of Israel.\n“Such a request lacks political logic, flies in the face of the principles and rules of international law, and constitutes public and practical support” for Israel."}, {"id": "1b21eae2-b0fa-40f5-adfc-9ad4bce06ae4", "title": "Leicester Square stabbing : Suspect charged with 11 - year - old girl attempted murder appears in court", "date": "2024-08-14 09:00", "url": "https://www.independent.co.uk/news/uk/crime/leicester-square-stabbing-suspect-ioan-pintaru-london-b2596018.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A man has appeared in court charged with attempted murder after an 11-year-old girl was stabbed in Leicester Square.\nIoan Pintaru was also charged with possession of a bladed article early on Tuesday and was remanded in custody.\nThe 32-year-old appeared at Westminster Magistrates’ Court later on Tuesday morning, wearing a grey prison-issue sweatshirt.\nProsecutor David Burns said the girl and her mother were in Leicester Square as tourists when the child was stabbed eight times with a steak knife, leaving her with wounds to the face, neck, shoulder and wrist."}, {"id": "b5fd1f89-65c1-4edb-b822-b1337b46279b", "title": "Israel attack on a sheltering school decried", "date": "2024-08-14 06:00", "url": "http://europe.chinadaily.com.cn/a/202408/14/WS66bc1584a3104e74fddb9ea6.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's envoy to the United Nations on Tuesday \"strongly condemned\" Israel's attack on a school sheltering displaced people in Gaza City.\nThree Israeli rockets struck the Al-Taba'een School on Saturday, where many displaced Palestinians were seeking shelter and participating in dawn prayers.\nIsrael said it targeted the school because Hamas fighters were sheltering there.\n\"Civilians and civilian infrastructure should never be targets of military action — this is a red line defined by international humanitarian law.\nSaturday's strike was one of the deadliest on a school sheltering displaced people since the conflict began, said Doughten."}, {"id": "a4623f3f-875c-408f-9d63-00ef195ba1d6", "title": "Israel attack on a sheltering school decried", "date": "2024-08-14 07:30", "url": "http://usa.chinadaily.com.cn/a/202408/14/WS66bc1584a3104e74fddb9ea6.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's envoy to the United Nations on Tuesday \"strongly condemned\" Israel's attack on a school sheltering displaced people in Gaza City.\nThree Israeli rockets struck the Al-Taba'een School on Saturday, where many displaced Palestinians were seeking shelter and participating in dawn prayers.\nIsrael said it targeted the school because Hamas fighters were sheltering there.\n\"Civilians and civilian infrastructure should never be targets of military action — this is a red line defined by international humanitarian law.\nSaturday's strike was one of the deadliest on a school sheltering displaced people since the conflict began, said Doughten."}, {"id": "a98d5930-e673-4df7-b3f0-58eff02cf57a", "title": "Newborn twins killed in Gaza as father registered births", "date": "2024-08-14 07:15", "url": "https://www.rte.ie/news/middle-east/2024/0814/1464890-gaza-twins/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Two men supported the bereaved father as he wept outside the morgue where the infants' corpses had been brought.\nMr al-Qumsan waved the laminated documents, which should have signified a rare moment of joy in the besieged Palestinian enclave.\nIsrael struck back with an offensive that has killed nearly 40,000 people and wounded more than 92,000, according to Gaza health authorities, and reduced much of the enclave to rubble.\nThe latest figures from the health ministry in Gaza put the number of injured at more than 92,000.\nIsraeli authorities said 1,200 people were killed and about 250 taken hostage in the 7 October attack."}, {"id": "dae1bd1d-e0d3-47a3-864f-cfd41516588f", "title": "Only Gaza ceasefire will delay retaliation , say Iranian officials", "date": "2024-08-14 05:30", "url": "https://www.thedailystar.net/news/world/news/only-gaza-ceasefire-will-delay-retaliation-say-iranian-officials-3676851", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "A billboard with a picture of newly appointed Hamas leader Yahya Sinwar is displayed on a building in a street in Tehran, Iran, August 12, 2024.\nThree regional government sources described conversations with Tehran to avoid escalation ahead of the Gaza ceasefire talks, due to begin on Thursday in either Egypt or Qatar.\nIran, two of the sources said, was considering sending a representative to the ceasefire talks.\nIran's mission to the United Nations in New York told Reuters that Tehran would not have a representative present on the sidelines of the ceasefire talks.\nA ceasefire in Gaza would give Iran cover for a smaller \"symbolic\" response, one of the sources said."}, {"id": "ab06eb41-4583-4af2-a585-b4f32178a816", "title": "Russo - Ukraine War - 13 August 2024", "date": "2024-08-14 01:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-13.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe blogger has appealed to Russian water producing companies to supply Russian military bases with additional water in Rostov, Voronezh and Crimean air bases.\nIn the Sívers велиkomu direction, Ukrainian troops led nanívec С five attempts of the opponent to improve the tactical position near Verkhnyokamiansky and Spirny.\nUp to fifteen AFU personnel, two armoured fighting vehicles, and two motor vehicles were neutralised."}, {"id": "82927ce1-45ab-4e98-b410-7b96499729af", "title": "Where Is The USS Abraham Lincoln Homeport & How Many People Are Usually On Board ? ", "date": "2024-08-14 00:15", "url": "https://www.slashgear.com/1641180/uss-abraham-lincoln-aircraft-carrier-where-stationed-homeport-how-many-aboard/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "Since its deployment over 30 years ago, the USS Abraham Lincoln (CVN 72) has traveled much of the globe, having transited from the Atlantic to the Pacific around South America and patrolled the waters of the Western Pacific, South China Sea, and Persian Gulf.\nWhen the ship isn't at sea — such as when it recently went under some crew-focused renovations — the USS Abraham Lincoln is typically moored in its homeport of San Diego.\nAdvertisementSpecifically, the USS Abraham Lincoln is stationed at Naval Air Station North Island, which covers 2,800 acres and is one of eight naval installations that make up the larger Naval Base Coronado in San Diego.\nThe station has been in service since 1917 and is officially recognized as the \"Birthplace of Naval Aviation.\"\nThe USS Abraham Lincoln alone has a large crew that consists of 5,500 members, currently led by its Commanding Officer, Captain Pete \"Repete\" Riebe."}, {"id": "1b28f7e9-f564-46be-95c0-d5b0a51a42de", "title": "Leicester Square stabbing : Girl , 11 , knifed 8 times by stranger will need plastic surgery", "date": "2024-08-14 04:00", "url": "https://www.perthnow.com.au/news/world/leicester-square-stabbing-girl-11-knifed-8-times-by-stranger-will-need-plastic-surgery-c-15698698", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "A girl of 11 stabbed eight times in a random attack in Leicester Square will need plastic surgery, a court has been told.\nRomanian Ioan Pintaru, 32, appeared at Westminster Magistrates’ Court charged with attempted murder and possession of a bladed article in a public place.\nDistrict Judge Michael Snow described the stabbing as a “random attack on a child in public”, leaving her seriously injured.\nProsecutor David Burns said: “The complainant and her daughter, who were tourists, were in the Leicester Square area.\n“I understand she will require plastic surgery for the injuries she sustained.”Camera Icon Ioan Pintaru is a long-distance lorry driver."}, {"id": "28f05b79-c6f2-4d09-8d4b-d1edbe38df1b", "title": "Israel Weapons Sale : US approves $20 billion weapons sale to Israel despite rights activist concerns", "date": "2024-08-14 02:00", "url": "https://timesofindia.indiatimes.com/world/us/us-approves-20-billion-weapons-sale-to-israel-despite-rights-activists-concerns/articleshow/112508742.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The Biden administration approved more than $20 billion package for new weapons sales to Israel, defying the pressure from rights activists to halt arms deliveries due to the death toll in Gaza.\nThe F-15 jets, equipped with advanced radar and secure communications gear, will significantly upgrade Israel's existing fleet when they begin arriving in 2029.\n\"Congress retains the authority to block weapons sales, but doing so is challenging.\nHuman rights groups and some progressive members of Biden's Democratic Party have urged the administration to halt arms sales to Israel, condemning the high number of civilian casualties in the Gaza conflict .\nJosh Paul, who resigned from the state department last year over Gaza policy, criticised Israel's actions."}, {"id": "5d413b82-fd44-4bbb-b69f-5538d7a38efd", "title": "Israelis should be thankful for US , Biden , and Austin support", "date": "2024-08-14 05:00", "url": "https://www.jpost.com/opinion/article-814595", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Israelis have many reasons to say “God bless America” – especially this month.\nAnd, this week, let’s thank Defense Secretary Lloyd Austin for mobilizing the USS Georgia guided missile submarine, the USS Abraham Lincoln aircraft carrier strike group – and Marines.\n“There are thirty million Arabs on one side and about 600,000 Jews on the other,” Harry Truman’s defense secretary James V. Forrestal scoffed in 1948, Truman’s aide Clark Clifford recalled.\nAmerican generals watched Israeli soldiers – especially pilots – use American weapons creatively.\nThat’s why, on February 13, 1979, Harold Brown became the first American defense secretary to visit Israel."}, {"id": "fec17f2b-8734-4494-b6ee-75738db9772c", "title": "Bombing Putin palace or seizing an even greater prize : Ukraine invasion of Russia puts the end within reach , writes MARK ALMOND", "date": "2024-08-14 02:00", "url": "https://www.dailymail.co.uk/debate/article-13739933/Bombing-Putins-palace-seizing-greater-prize-Ukraines-invasion-Russia-puts-end-reach-writes-MARK-ALMOND.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "In the last few weeks, Kyiv had been signalling it was open to peace talks with Moscow; not to surrender but to arrange an honourable settlement that preserves the country’s independence and recovers as much ground as possible.\nA week ago, an elite Ukrainian unit stormed the border and its forces have since seized some 400 square miles of Russian territory in the Kursk region.\nIt appears that the Ukrainians have adopted the great Soviet art of ‘maskirovka’ – deception in warfare – and taught Putin a lesson in over-confidence.\nThe invasion of Kursk in particular, the first foreign incursion into Russia since the Second World War, will have hurt Putin.\nThat war ended in total victory, but this war will end with a messy compromise."}, {"id": "c00aebe6-9999-421a-9040-ebc2ffcaec5e", "title": "Space Marine 2 Analyses Tactical , Sniper Classes from Aboard Imposing Gothic Battle Barge", "date": "2024-08-14 10:45", "url": "https://www.pushsquare.com/news/2024/08/space-marine-2-analyses-tactical-sniper-classes-from-aboard-imposing-gothic-battle-barge", "domain": "pushsquare.com", "domain_classification": "Unknown", "message": "Subscribe to Push Square on YouTube 147kWarhammer 40,000: Space Marine 2 is powering towards a 9th September launch on PS5, and the wait is proving difficult for the Emperor's faithful.\nIn Space Marine 2, Titus' squad of Ultramarine battle-brothers consists of various named characters, each assigned a different combat role or class.\nThat's in the campaign, of course; prospective players will be able to create and outfit their own characters in multiplayer.\nThe ever-adaptable Tactical marine is equipped for ranged combat, drawing from a well-stocked armoury of Adeptus Astartes gear, which includes variants of the iconic Bolter.\nFinally, we got a glimpse at the Battle Barge, which will serve as your base in Space Marine 2."}, {"id": "6ec1ebab-452a-4da5-9013-30341e9ca53e", "title": "DRDO Successfully Tests Indigenous Man - Portable Anti - Tank Guided Missile In Rajasthan", "date": "2024-08-14 05:45", "url": "https://menafn.com/1108552002/DRDO-Successfully-Tests-Indigenous-Man-Portable-Anti-Tank-Guided-Missile-In-Rajasthan", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- AsiaNet News) The Defense Research and Development Organization (DRDO) has successfully tested an indigenously developed Man-Portable Anti-Tank Guided Missile (MP-ATGM), showcasing India's advancements in military technology.\nThe test, conducted in Jaisalmer, Rajasthan, on August 14th, demonstrated the missile's capability to destroy enemy tanks with precision.\nThis lightweight and sophisticated missile system is shoulder-launched, making it highly portable for ground forces.\nDRDO confirmed that the missile met all predefined criteria during the test, marking a significant milestone in India's defence capabilities.\nEXCLUSIVE: NSG inducts Indian-made ASMI Submachine Pistol, designed by DRDO (WATCH)In another major development, India has unveiled a new homegrown kamikaze drone with a range of up to 1,000 kilometres."}, {"id": "764aa2f7-dced-48cd-9030-45a7bd8de929", "title": "Air Force acquisition chief talks drone wingmen , supply chains , and the B - 21", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/air/2022/06/27/air-force-acquisition-chief-talks-drone-wingmen-supply-chains-and-the-b-21/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Air Force is arguing with a key contractor over a program that continues to be delayed.\nAnd the Air Force is watching the corporate unrest at Aerojet Rocketdyne following its failed acquisition by Lockheed Martin and open conflict between the company’s executive chairman and chief executive.\nAerojet is a key supplier of solid rocket motors used by the Air Force.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "da0b2a7d-1146-4c6d-bc67-cc542d8c7b30", "title": "Former member of Japanese germ - warfare unit exposes war crimes in China - China . org . cn", "date": "2024-08-14 02:15", "url": "http://www.china.org.cn/china/2024-08/14/content_117365389.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "With black background and white characters, the inscription on the monument reads: \"The Japanese Army's Unit 731 committed unprecedented national crimes in world history in China.\"\nStanding in front of the monument, Shimizu put his palms together and bowed deeply.\nOn Tuesday afternoon, Shimizu visited the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "b5bfa601-5649-45c7-9f96-4acf68b1d331", "title": "Kennedy confirmed as Air Force cyber boss", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/cyber/2022/06/27/kennedy-confirmed-as-air-force-cyber-boss/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "WASHINGTON — The Senate confirmed a new leader for the U.S. Air Force’s information warfare branch, the latest move in a shuffling of cybersecurity leadership in the military.\nAir Force Maj. Gen. Kevin Kennedy was approved by voice vote to head up the 16th Air Force (Air Forces Cyber) and receive his third star on June 23, roughly one month after President Joe Biden nominated him.\nThe 16th Air Force was created in late 2019, after the service combined and deactivated the 24th Air Force and the 25th Air Force.\nThe 16th Air Force is an amalgam of cyber, electronic warfare, intelligence and weather disciplines.\nSenators this year also confirmed a new head for Army Cyber Command as well as a new chief of Navy Fleet Cyber Command."}, {"id": "a9206601-6826-4e18-bcce-d1c08f9ac66a", "title": "Japanese veteran testifies to Unit 731 crimes , apologizes", "date": "2024-08-14 02:00", "url": "http://www.ecns.cn/news/society/2024-08-14/detail-ihefeyrz1375381.shtml", "domain": "ecns.cn", "domain_classification": "Unknown", "message": "\"I would like to express my sincere apologies and repentance to the Chinese victims, the victims of Unit 731, and the deceased,\" he said.\nShimizu was about 14 years old and among the last batches of Unit 731 Youth Corps members when he was sent to Harbin in March 1945.\nHe spent more than four months witnessing the war crimes committed by his unit, including the cultivation of pathogens, human dissections and experiments on humans.\nAt least 3,000 people were used for human experiments by Unit 731, and more than 300,000 people across China were killed by Japan's biological weapons.\nBefore leaving China, Unit 731 tried to gun down all survivors and destroy incriminating evidence of the atrocities it committed."}, {"id": "f2d33928-dd49-4790-843c-9bb5089e4eb2", "title": "Russia T - 72 Tank Is No Piece of Junk", "date": "2024-08-14 02:45", "url": "https://nationalinterest.org/blog/buzz/russias-t-72-tank-no-piece-junk-212316", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Despite Western claims about Russia's reliance on older equipment and the impact of sanctions, the T-72 Main Battle Tank remains a key asset for Moscow.\nSummary and Key Points: Despite Western claims about Russia's reliance on older equipment and the impact of sanctions, the T-72 Main Battle Tank remains a key asset for Moscow.\n-Russia is not only continuing to use the cost-effective T-72 but is also innovating by developing a new infantry fighting vehicle (IFV) based on the T-72 chassis.\nYes, Russia has had to rely on older equipment, such as the Soviet era T-72 Main Battle Tank.\nThey are now building a new tracked infantry fighting vehicle (IFV) based on the T-72’s chassis."}, {"id": "1458057b-0eef-4e93-9a02-c9c918b476dd", "title": "Russia Aspirational Grom Combat Drone Design Totally Changes , Ditches Stealth For Speed", "date": "2024-08-14 01:30", "url": "https://www.yahoo.com/news/russia-aspirational-grom-combat-drone-005226338.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A new Russian design for a ‘loyal wingman’-type supersonic drone has been unveiled, marking the country’s latest foray into unmanned combat air vehicles (UCAVs).\nA new Russian design concept for a ‘loyal wingman’-type drone has been unveiled, marking the country’s latest aspirational foray into unmanned combat air vehicles (UCAVs).\nA mockup of the new Grom drone is on display at the Army 2024 defense exhibition that is taking place in the Moscow region from August 12 to 14.\n@MuxelAeroOverall, the design of the new-look Grom appears to be optimized for high speed and maneuverability, rather than low observability and endurance.\nNonetheless, the dramatic changes in the appearance of the drone concept are interesting in themselves and may well reflect broader changes in Russia’s concept of how future advanced unmanned combat air vehicles should be employed."}, {"id": "4a71e9cf-2d48-4c8b-b511-13f37427bd0e", "title": "Germany seals off army base over suspected sabotage of water supplies", "date": "2024-08-14 13:45", "url": "https://www.yahoo.com/news/germany-seals-off-army-over-130959911.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "German military police have sealed off an army barracks near Cologne amid suspicions that the drinking water supplies have been sabotaged.\nSoldiers have been ordered not to drink the tap water in the barracks, which houses about 4,000 soldiers and is close to a regional airport.\nThere has been a string of suspected Russian sabotage attacks in Germany, Poland and Britain, targeting arms factories and Ukraine-linked businesses.\nIn May, a major fire broke out at an arms factory in Berlin operated by Diehl, a key German defence company which is supporting the war effort in Ukraine.\nIn a recent interview with The Telegraph, a senior German intelligence figure warned that the country was a key target for Russian sabotage efforts."}, {"id": "b387a463-1ac3-45b5-a278-f3e77d665a21", "title": "Jon Ossoff says there progress in efforts to bring a new fighter squadron to Moody Air Force Base", "date": "2024-08-14 01:30", "url": "https://www.ajc.com/news/jon-ossoff-says-theres-progress-in-efforts-to-bring-a-new-fighter-squadron-to-moody-air-force-base/RVVEBFL2PVBDRCDK2LDBZ3CAEI/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "02c31cde-19b9-46a7-8a6a-57ab51d8626b", "title": "Strengthening America Defense : Six Steps", "date": "2024-08-14 02:00", "url": "https://www.heritage.org/defense/report/strengthening-americas-defense-six-steps", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Seven years ago th e Reagan Administration embarked on a military modernization program to rectify nearly a decade of neglect of U.S. military forces.\nThe Reagan Administration has improved C31 capabilities for strategic and conventional forces, but the job is by no means over.\nThe challenge is to ensure that the c ost of developing and building advanced technology weapon systems is worth the resulting capability.\nWhat the U.S. needs is a comprehensive program to bring together all of the potential uses of advanced technologies for conventional defense.\nh) that NATO develop and deploy an anti-tactical ballistic missile defense force for protection against Soviet shorter-range ballistic missiles."}, {"id": "31365e00-3d18-4743-9a38-b7cac2adcd43", "title": "Clarence Page : Why  stolen valor  political fights are so intense – and misplaced", "date": "2024-08-14 08:45", "url": "https://www.pressherald.com/2024/08/14/clarence-page-why-stolen-valor-political-fights-are-so-intense-and-misplaced/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Tim Walz, out of her mouth before the Republican vice presidential nominee, Sen. JD Vance from Ohio, raised allegations of “stolen valor” against Walz.\nHe also was a prominent backer of legislation to put an end to stolen valor claims.\n”From the LEGAL standpoint, there is no Stolen Valor here” in the examples regarding Walz, he wrote in an email exchange.\nOne person’s “stolen valor” can be another person’s “war stories,” in which fact-checking is almost nonexistent.\nVance volunteered for military service in a time of war and he should be proud of that."}, {"id": "b8e99b4b-b852-4a2d-8a87-5ff84ae521b9", "title": "Purple Heart recipients recognized in Mercer County", "date": "2024-08-14 00:15", "url": "https://www.yahoo.com/news/purple-heart-recipients-recognized-mercer-222054399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "About a dozen Purple Heart recipients came together at the Michael Marzano Outpatient Clinic in Hermitage.\nThe Purple Heart is a military decoration, awarded for being wounded or killed while serving our country.\nHe wanted to talk with other Purple Heart recipients and share stories.\nThe memories, the honor, the stories — the Butler VA Health Care System wanted to honor the Purple Heart recipients.\nMercer County has 40 registered Purple Heart recipients."}, {"id": "2f24b2ca-4078-4eb4-a01f-6adbfb1acd24", "title": "Ukraine five - point plan to pummel Russia , ex - soldier reveals | World | News", "date": "2024-08-14 08:30", "url": "https://www.express.co.uk/news/world/1935534/Ukraine-russia-invasion-expert", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "At this stage it remains unclear and Ukraine have naturally not unveiled their grand strategic plan.\nBut this surprise assault changes perceptions on the progress of the war and Ukraine’s ability to strike back against their aggressors.\nInitial reports coming from western media and military bloggers inside Russia indicate that Russia’s C2 has been thrown into chaos.\nDisplay ability to fight to foreign aid providers Ukraine knows that it finds itself at a critical juncture.\nDestablise Putin Putin likes to portray himself as a strong leader but his strength is paper thin."}, {"id": "e517f93e-0e0f-45da-aac4-1db6fdfd7cc7", "title": "Moving Soldier Monument is city latest bad idea", "date": "2024-08-14 00:45", "url": "https://www.santafenewmexican.com/news/local_news/moving-soldiers-monument-is-citys-latest-bad-idea/article_80622006-5975-11ef-83f4-335138ffab6c.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "cf3d9356-6b16-4540-9d19-25496a289c7f", "title": "Harris Campaign Rips Trump Interview with Musk Despite Kamala Hiding from Media for 22 Days", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/13/harris-campaign-rips-trumps-interview-with-musk-despite-kamala-hiding-from-media-for-22-days/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris’s presidential campaign attacked former President Donald Trump’s interview with Elon Musk on Monday despite her avoiding an unscripted interview for 22 straight days.\nThe lack of interviews runs counter to the multitude of interviews the media typically conduct when candidates enter presidential races.\nThe media have not interviewed Harris on television since June 24, 2024.\n“Happy to host Kamala on an X Spaces too,” Musk posted on X Tuesday morning.\nHappy to host Kamala on an Spaces too — Elon Musk (@elonmusk) August 13, 2024"}, {"id": "a0257489-97bc-4700-955d-3fa69f52aaf4", "title": "Georgia Sen . Jon Ossoff says there progress in efforts to bring a new fighter squadron to Moody Air Force Base", "date": "2024-08-14 04:00", "url": "https://www.stripes.com/branches/air_force/2024-08-13/fighter-squadron-moody-air-force-base-14857262.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "“It is a big deal to have the Chief of Staff of the United States Air Force in Georgia,” Ossoff said during a press conference at Moody.\nTen other bases already operate the model, as the Air Force moves from legacy systems to new systems, phasing out the A-10 “Warthog” model designed for close air support.\nThe A-10 “has been part of the backbone of the Air Force since the Cold War, but the reality is that the air defense threats that our Air Force will face moving forward put the A-10 at risk, and so the Air Force has to innovate,” Ossoff said.\nThe Southern Georgia base employs approximately 5,000 military and civilian personal, according to a DOD website.\n“The airmen, the service members and the Department of Defense, civilians and contractors who work here at Moody Air Force Base are 100% committed to our national security — they’ve given their careers to it,” Ossoff said."}, {"id": "ee74c956-8894-4e29-81f6-7a91c48b850c", "title": "India develops indigenous Kamikaze drones ahead of 78th Independence Day : Report", "date": "2024-08-14 03:15", "url": "https://www.moneycontrol.com/news/india/india-develops-indigenous-kamikaze-drones-ahead-of-78th-independence-day-report-12795955.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "d9ee330e-56ec-43ad-91fb-f6e3b14e6ae9", "title": "Ukrainian drone tactics make their way to Kursk region , Russian military bloggers suggest", "date": "2024-08-14 08:45", "url": "https://www.cbc.ca/news/world/ukraine-kursk-offensive-drones-russia-1.7292736", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Kyiv has said little about its rapid entry into Russia's Kursk region, only confirming involvement on Saturday.\nWhile Kyiv has not elaborated, across the border in Russia, military commentators have been rumbling that Ukrainian forces skilfully used drones and jammers to limit Russia's defences and break into Kursk.\nSoaring drone useDrones have become increasingly critical to both Russia and Ukraine across nearly 30 months of all-out war in Ukraine.\nAnd it's likewise felt the sting of Russian drones that have killed Ukrainian soldiers and civilians alike, and have damaged infrastructure including power plants.\nWATCH | Ukrainian troops go to Kursk, as do drones: Drones fly overhead as Ukraine makes advances into Russian territory Duration 1:00 Ukrainian forces heading into Russia's Kursk region drove through a border checkpoint in Ukraine's Sumy region on Tuesday."}, {"id": "1cfb76b2-72bd-4a61-9af7-e36a456c83ab", "title": "Battle 360 - Sky History", "date": "2024-08-14 08:45", "url": "https://www.tvguide.co.uk/schedule/1cdb14bc-569a-5006-93ff-15d5f79dc944/battle-360", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Battle 360Sky History 2:00 PM to 3:00 PM Wednesday 14 August Share Add toCalendar +Enterprise vs Japan Season 1 Episode 5 of 10The Japanese attack on the USS Enterprise, which came at a point in the Second World War when the vessel was the only battle-ready American carrier left in the PacificBattle 360 airs on Sky History at 2:00 PM, Wednesday 14 August ."}, {"id": "bc5574cf-cacb-4d88-9e6d-de8876b98546", "title": "Star Trek : Deep Space Nine - Sky Sci - Fi HD", "date": "2024-08-14 07:15", "url": "https://www.tvguide.co.uk/schedule/881fd785-1e75-5bd6-bcbd-7177d76e47ad/star-trek-deep-space-nine", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Star Trek: Deep Space NineSky Sci-Fi HD 1:00 PM to 2:00 PM Wednesday 14 August Share Add toCalendar +Battle Lines Season 1 Episode 13 of 20 S SubtitlesSisko, Kira and Bashir accompany Bajoran spiritual leader Kai Opaka on a trip through the wormhole, and find themselves stranded in a world caught in the throes of a bizarre civil war - where soldiers are reincarnated as soon as they are killed in battle.\nSci-fi drama, with Avery Brooks and Nana VisitorStar Trek: Deep Space Nine airs on Sky Sci-Fi HD at 1:00 PM, Wednesday 14 August .\n(Subtitles.)\nLearn more about Star Trek: Deep Space Nine and other movie/drama on our drama pageTopics Movie ➝ Drama Adventure Science Fiction"}, {"id": "27184241-6be9-4eff-b489-94b811d685d0", "title": "Star Trek : Deep Space Nine - Sky Sci - Fi HD", "date": "2024-08-14 13:15", "url": "https://www.tvguide.co.uk/schedule/ef5e166c-3ef9-57af-9375-0168027746f7/star-trek-deep-space-nine", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Star Trek: Deep Space NineSky Sci-Fi HD 7:00 PM to 8:00 PM Wednesday 14 August Share Add toCalendar +Battle Lines Season 1 Episode 13 of 20 S SubtitlesSisko, Kira and Bashir accompany Bajoran spiritual leader Kai Opaka on a trip through the wormhole, and find themselves stranded in a world caught in the throes of a bizarre civil war - where soldiers are reincarnated as soon as they are killed in battle.\nSci-fi drama, with Avery Brooks and Nana VisitorStar Trek: Deep Space Nine airs on Sky Sci-Fi HD at 7:00 PM, Wednesday 14 August .\n(Subtitles.)\nLearn more about Star Trek: Deep Space Nine and other movie/drama on our drama pageTopics Movie ➝ Drama Adventure Science Fiction"}, {"id": "37954e67-cf33-45ef-9bf1-c9c9eeab648a", "title": "North Korea warns South Korea , Japan will be nuclear  cannon fodder  ", "date": "2024-08-14 10:30", "url": "https://www.yahoo.com/news/north-korea-warns-south-korea-093805248.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "North Korean state media warned Tuesday that U.S. allies Seoul and Tokyo would be nuclear \"cannon fodder.\"\nLeader Kim Jong Un, seen guiding a nuclear counterattack drill in April, has declared North Korea a nuclear state.\nFile Photo by KCNA/EPA-EFESEOUL, Aug. 14 (UPI) -- North Korean state media has warned that strengthening trilateral ties with Washington risks turning the people of South Korea and Japan into \"cannon fodder\" for a nuclear attack.\nThe Democratic People's Republic of Korea is the official name of North Korea.\nSince early June, North Korea has also sent thousands of balloons carrying scrap paper, manure and discarded clothes into the South in a revival of Cold War-era psychological warfare."}, {"id": "90fb07ad-9f4d-4bcb-a8dd-7be2bdac47b9", "title": "North Korea warns South Korea , Japan will be nuclear  cannon fodder  ", "date": "2024-08-14 13:15", "url": "https://news.yahoo.com/news/north-korea-warns-south-korea-093805248.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "North Korean state media warned Tuesday that U.S. allies Seoul and Tokyo would be nuclear \"cannon fodder.\"\nLeader Kim Jong Un, seen guiding a nuclear counterattack drill in April, has declared North Korea a nuclear state.\nFile Photo by KCNA/EPA-EFESEOUL, Aug. 14 (UPI) -- North Korean state media has warned that strengthening trilateral ties with Washington risks turning the people of South Korea and Japan into \"cannon fodder\" for a nuclear attack.\nThe Democratic People's Republic of Korea is the official name of North Korea.\nSince early June, North Korea has also sent thousands of balloons carrying scrap paper, manure and discarded clothes into the South in a revival of Cold War-era psychological warfare."}, {"id": "a6a1f911-abd3-408e-aed5-9841df28f7b1", "title": "How Hernán Cortés Conquered the Aztec Empire", "date": "2024-08-14 04:15", "url": "https://www.history.com/news/hernan-cortes-conquered-aztec-empire", "domain": "history.com", "domain_classification": "Unknown", "message": "How did Cortés manage to overthrow the seat of the Aztec Empire?\nWhen Spanish conquistadors arrived in the Aztec imperial city in 1519, Mexico-Tenochtitlán was led by Moctezuma II.\nHernándo Cortés Makes Allies with Local TribesUniversal History Archive/Getty Images Hernándo Cortés, Spanish conquistador who conquered Mexico, with Moctezuma II, last Aztec emperor, 1519.\nLeaving his top lieutenant Pedro de Alvarado in charge of Tenochtitlán, Cortés took men to attack the Spanish forces at the coast.\nIn Cortés' absence, Alvarado had hundreds of Aztec nobles killed during a ceremonial feast, leading to further unrest among the Aztec people."}, {"id": "80d2daf3-ac19-4a1e-957b-3a24bdbee181", "title": "Battle 360 - Sky History", "date": "2024-08-14 09:30", "url": "https://www.tvguide.co.uk/schedule/2b8ad5b5-d753-5d7c-a4ed-48cf6658294a/battle-360", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Battle 360Sky History 3:00 PM to 4:00 PM Wednesday 14 August Share Add toCalendar +The Grey Ghost Season 1 Episode 6 of 10The story of the USS Enterprise and the role the ship played in the Gilbert Islands invasion during the Second World War, becoming the first to receive a Presidential Unit CitationBattle 360 airs on Sky History at 3:00 PM, Wednesday 14 August ."}, {"id": "a77a0daa-3efc-4557-9b0d-3084c590d5bf", "title": "Kindermann Corp . Archives", "date": "2024-08-14 01:30", "url": "https://nintendoeverything.com/tag/kindermann-corp/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "After it recently came to Switch, Shikon-X Astro Defense Fortress was given a new round of gameplay.\nThose interested in getting a closer look can see 25 minutes of footage.\nFor those that need a recap, here’s an overview of the title:"}, {"id": "13de3b84-e628-4e3d-afff-68fdf8531c48", "title": "The Greens vs . The Blacks in  House of the Dragon , Explained", "date": "2024-08-14 02:45", "url": "https://www.marieclaire.com/culture/tv-shows/the-greens-and-the-blacks-house-of-the-dragon-hbo/", "domain": "marieclaire.com", "domain_classification": "Unknown", "message": "Why are they called the Greens and the Blacks in 'House of the Dragon?'\nTeam Rhaenyra, but in House of the Dragon, the sides are known by the subtler designations of the Greens and the Blacks.\nOutside of the Red Keep, the Greens have allied with House Hightower, House Lannister, House Baratheon, and House Tyrell, counting these Great Houses and their vassals among their army.\nHowever, one notable house that will remain undeclared throughout the Dance of the Dragons: House Martell of Dorne.\nHugh Hammer claims Vermithor, the second-largest living dragon, in House of the Dragon season 2."}, {"id": "9fcb50f0-08c8-4186-8995-7eb3e159ae61", "title": "Tim Walz defends his military record in first solo campaign speech at labor event", "date": "2024-08-14 04:00", "url": "https://www.stripes.com/theaters/us/2024-08-13/tim-walz-defends-military-record-14857500.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Tim Walz pushed back on GOP attacks on his military service and the timing of his departure from the Army National Guard during his first solo campaign appearance a week after being named Vice President Kamala Harris’s running mate.\nI am damn proud of my service to this country.”The Trump campaign has tried to capitalize on the controversy over the timing of Walz’s retirement.\nWalz did not serve in combat, according to the Minnesota Army National Guard.\n“When were you ever in a war?” Vance said at a recent campaign event in Michigan in comments directed to Walz.\n“Hi Tim, I thank you for your service,” Vance wrote."}, {"id": "c03481d1-2dca-41ad-9bda-2dc6d12bf1a3", "title": "Japan to open U . S .- inspired defense tech research center in October", "date": "2024-08-14 01:15", "url": "https://japantoday.com/category/tech/japan-to-open-u.s.-inspired-defense-tech-research-center-in-october", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "Japan's Defense Ministry is set to open a research institute in Tokyo this October to develop innovative defense technologies that could significantly impact future warfare, drawing on expertise from the private sector.\nProvisionally called the Defense Innovation Technology Institute, half of the members of the Japanese organization will come from outside the ministry, such as companies and universities.\nWhile working to develop new defense technologies over the coming years, the institute will also focus on \"breakthrough research\" aimed at deploying new equipment within about three years by maximizing the use of existing technologies.\nPractical project examples include developing unmanned vehicles that can autonomously navigate in darkness and a new method for detecting submarines.\nThe establishment of the research organization was stipulated in the National Defense Strategy, compiled in December 2022, with its purpose set at finding \"multi-use cutting-edge technologies that contribute to defense equipment development, and to produce equipment that leads to defense innovation.\""}, {"id": "998895af-de68-4b69-942b-9730fb6ed999", "title": "UK Charts : Mario Kart 8 Deluxe Retains Its Crown As We Await New Releases", "date": "2024-08-14 10:00", "url": "https://www.nintendolife.com/news/2024/08/uk-charts-mario-kart-8-deluxe-retains-its-crown-as-we-await-new-releases", "domain": "nintendolife.com", "domain_classification": "Unknown", "message": "After a slight delay this week, the UK Charts are finally in, and it's another quiet one in the region that sees Mario Kart 8 Deluxe retain its crown for a second week running.\nThe top 10 has seen a bit of a shake up, though, with Mortal Kombat 1 storming to 3rd place while Hogwarts Legacy takes a bit of a tumble down into 10th.\nIt'll be interesting to see how the latter performs in particular.\n- 39Lego Harry Potter Collection Switch 70%, PS4 27%, Xbox 3% - 40Mafia Trilogy[Compiled by GfK]< Last week's chartsDid you pick up anything new this week?\nLet us know what you think of the latest charts in the comments below."}, {"id": "33bb4037-0193-460d-bfe2-7f7a2ebce878", "title": "Today in history , August 14 : Unveiling the events that shaped history", "date": "2024-08-14 03:15", "url": "https://www.moneycontrol.com/education/today-in-history-august-14-unveiling-the-events-that-shaped-history-article-12795966.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSFollow us on:My AccountororHello, LoginAllToday in history, August 14: Unveiling the events that shaped history"}, {"id": "425e49d0-bcae-4f5c-bcf7-5eb9c4eaaefd", "title": "Tim Walz defends his military record in first solo campaign speech in labor event", "date": "2024-08-14 01:45", "url": "https://www.adn.com/nation-world/2024/08/13/tim-walz-defends-his-military-record-in-first-solo-campaign-speech-in-labor-event/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Tim Walz pushed back on GOP attacks on his military service and the timing of his departure from the Army National Guard during his first solo campaign appearance a week after being named Vice President Kamala Harris’s running mate.\n“I firmly believe you should never denigrate another person’s service record,” Walz said at the convention of the American Federation of State, County and Municipal Employees (AFSCME).\nADVERTISEMENTWalz did not serve in combat, according to the Minnesota Army National Guard.\n“Hi Tim, I thank you for your service,” Vance wrote.\nOn the campaign trail, Trump had repeatedly faulted Biden for the rise in prices due to inflation."}, {"id": "cfef6c00-a762-4ab2-866b-7a9dd3b6446d", "title": "How games changed history", "date": "2024-08-14 10:45", "url": "https://www.historyextra.com/membership/board-games-podcast-kelly-clancy/", "domain": "historyextra.com", "domain_classification": "Unknown", "message": "From Chess and Go, to Snakes and Ladders, Monopoly and the ancient Egyptian game of Senet, people have long had a fascination with games.\nBut according to author and academic Kelly Clancy, these games have not only provided people with entertainment (and sparked family arguments), they've also shaped warfare, philosophy and social interactions for several millennia.\nAdvertisementKelly Clancy is the author of Playing with Reality: How Games Have Shaped Our World (Riverhead Books, 2024)"}, {"id": "26934993-3b1c-4a60-ad5c-a9ea0401b053", "title": "Vance challenges Walz to thrash out military records in debate after Harris VP pick slams stolen valor claim", "date": "2024-08-14 11:00", "url": "https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-tim-walz-military-record-b2596114.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}JD Vance has challenged his Democratic vice presidential rival Tim Walz to thrash out their military records on the debate stage after Kamala Harris’s running mate fired back at accusations of stolen valor.\nWhile neither actively fought in combat roles, Republicans have accused Walz of “stolen valor” for allegedly overstating his military record and have claimed, without merit, that he purposely avoided deployment to Iraq.\n“Hi Tim, I thank you for your service,” Vance wrote on X on Tuesday.\nVance claimed that Walz purposely dodged going to Iraq, calling his move into politics as “stolen valor garbage,” coming ahead of his unit being deployed."}, {"id": "d1848314-d425-4ac7-9cfc-65e87259996c", "title": "Kamala Names Muslim Liaison Who Wore Orange to Support Gitmo Terrorists", "date": "2024-08-14 00:30", "url": "https://www.frontpagemag.com/kamala-names-muslim-liaison-who-wore-orange-to-support-gitmo-terrorists/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "And now Kamala introduced Nasrina Bargzie, whom Freedom Center Investigates profiled on August 9th as her Muslim liaison.\nThis way, Kamala has a Jewish liaison who hates Israel and a Muslim liaison who hates Israel.\nIn 2011 she joined the Asian Law Caucus and went to war against Jewish students facing antisemitic harassment.\nNasrina Bargzie accused Jewish students and organizations of “organized legal bullying” for suing universities.\nAlongside her was Zahra Billoo, the local head of CAIR, with whom Nasrina Bargzie had co-signed the letter, who would defend Hezbollah and Hamas."}, {"id": "9a791de1-5388-4842-bdb2-132350b5e355", "title": "Even Ukrainian soldiers were in the dark on the plan . How did Zelensky pull this off ? ", "date": "2024-08-14 09:30", "url": "https://www.smh.com.au/world/europe/even-ukrainian-soldiers-were-in-the-dark-on-the-plan-how-did-zelensky-pull-this-off-20240814-p5k2i0.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Ukrainian soldiers pull down a Russian flag.\nIf Ukrainian troops are able to hold territory, they could stretch the capacity of Russian troops, deliver a major embarrassment for Putin and get a bargaining chip for any peace negotiations.\nUkrainian soldiers said they didn’t know the plan in advance.\nTo divert Russian troops to help fellow soldiers fighting in the eastern Donbas region.\n‘Difficult challenges ahead’ The Ukrainian military hadn’t tried a serious push into Russia since the beginning of Moscow’s full-scale invasion in 2022."}, {"id": "72b2ef3b-022e-4c6a-b917-09b8d5c48e65", "title": "Even Ukrainian soldiers were in the dark on the plan . How did Zelensky pull this off ? ", "date": "2024-08-14 10:00", "url": "https://www.brisbanetimes.com.au/world/europe/even-ukrainian-soldiers-were-in-the-dark-on-the-plan-how-did-zelensky-pull-this-off-20240814-p5k2i0.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Ukrainian soldiers pull down a Russian flag.\nIf Ukrainian troops are able to hold territory, they could stretch the capacity of Russian troops, deliver a major embarrassment for Putin and get a bargaining chip for any peace negotiations.\nUkrainian soldiers said they didn’t know the plan in advance.\nTo divert Russian troops to help fellow soldiers fighting in the eastern Donbas region.\n‘Difficult challenges ahead’ The Ukrainian military hadn’t tried a serious push into Russia since the beginning of Moscow’s full-scale invasion in 2022."}, {"id": "ed16517d-9c0e-40e9-92fd-422cdbbf38a6", "title": "Kursk : Ukraine Exploited Russia Dysfunctional Military Command", "date": "2024-08-14 11:00", "url": "https://www.businessinsider.com/kursk-ukraine-exploited-russias-dysfunctional-military-command-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Russia's convoluted military structures likely hindered its ability to defend Kursk, experts say.\nUkraine \"knew where to press\" to exploit its dysfunction, defense expert Dara Massicot wrote.\nGo to newsletter preferences Thanks for signing up!\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementUkraine exploited the disorganization of Russia's border defenses to make its surprise attack on Kursk, according to expert analyses."}, {"id": "73b985b4-b2f8-445c-bf56-3f5b6d557b96", "title": "Untold Stories Of Bihar Brave Freedom Fighters For India Independence", "date": "2024-08-14 13:45", "url": "https://www.outlookindia.com/brand-studio/independence-day/untold-stories-of-bihars-brave-freedom-fighters-for-indias-independence", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "“To hold a pen is to be at war,\" said Voltaire.\nThe pen here becomes a weapon in the battle, capable of influencing minds, shaping societal dynamics, and capable of challenging injustice and oppression.\nThis statement aptly captures the profound influence Syed Mojibur Rahman had on India’s struggle for freedom.\nThrough his hard work and dedication in the struggle for independence, he used his sagacity to instill a sense of patriotism in the town of Islampur, Bihar.\nAs an educator and a social activist, he tirelessly worked to sow the seeds of nationalism in his community, leading to the formation of dedicated groups of freedom fighters, including Professor Sidheshwar Prasad (former Governor of Tripura and former MP) and Ram Sharan Prasad (former MLA of Islampur, Bihar) who also played their part in the struggle of independence in 1947."}, {"id": "ac5d36b0-7860-4463-97c4-99ce17971d90", "title": "Tim Walz Finally Breaks Silence on Military Service Record but Completely Avoids Stolen Valor Scandal", "date": "2024-08-14 00:30", "url": "https://redstate.com/bobhoge/2024/08/13/tim-walz-finally-breaks-silence-on-military-service-recordbut-completely-avoids-stolen-valor-scandal-n2178081", "domain": "redstate.com", "domain_classification": "Unknown", "message": "Tim Walz, Kamala Harris’ running mate, appeared at the 2024 American Federation of State, County and Municipal Employees (AFSCME) convention in Los Angeles Tuesday and finally addressed the questions about his military service that have clouded his nomination.\nInstead of addressing those serious allegations, he chose to wax poetic about his call to service and his patriotism.\nAnd I firmly believe you should never denigrate another person's service record.\nWatch:The Trump team took note:WALZ: \"These guys are even attacking me for my record of service.\"\npic.twitter.com/Kcd5jNqBlB — Trump War Room (@TrumpWarRoom) August 13, 2024AdvertisementFor anyone thinking Walz would man up and address this controversy, they were left disappointed."}, {"id": "269be70c-b48f-430c-8830-9c351b802aad", "title": "Palestinian Christians Plea With the Global Church to Stand With Them", "date": "2024-08-14 01:15", "url": "https://relevantmagazine.com/current/world/palestinian-christians-plea-with-the-global-church-to-stand-with-them/", "domain": "relevantmagazine.com", "domain_classification": "Unknown", "message": "A group of Christian leaders from Palestine, Egypt, Jordan, Lebanon, Syria and Iraq has issued a plea to Christians around the world to know that they exist and to stand with them in solidarity.\nRecent data shows that there are approximately 15 million Christians in the Middle East.\nWhile the leaders recognize that they are in the religious minority, they want the global Church to know that their region is not a lost cause and that Christians have been living there consistently for 2,000 years.\n“This requires compassion from the global Christian community.\nTogether, we can shape the Middle East into a vibrant epicenter of outreach.”"}, {"id": "7f2ed2ac-6099-4ddb-abfe-62f6ed2ebde2", "title": "What US Aircraft Carrier Turned Museum Is Docked In Corpus Christi , Texas ? ", "date": "2024-08-14 00:15", "url": "https://www.slashgear.com/1641892/corpus-christi-aircraft-carrier-uss-lexington-museum-about/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The aircraft carriers employed by the United States Navy are truly works of engineering art.\nWhen you have a model of engineering on your hands like that, you put it to good use.\nEven if you have an aircraft carrier that's not actively engaging in maritime activities, it wouldn't be right to just let it rot in the ocean.\nAdvertisementSuch is the story of the oldest remaining Essex-class aircraft carrier, the USS Lexington.\nOriginally created to fight in World War II, the USS Lexington was nearing the end of its operational rope in the late 1980s."}, {"id": "a36812cc-cd04-4953-ba9a-768a48ac1d50", "title": "Indian Army on hunt to buy 90 microwave weapons to counter drones", "date": "2024-08-14 09:30", "url": "https://www.theweek.in/news/india/2024/08/14/indian-army-on-hunt-to-buy-90-microwave-weapons-to-counter-drones.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "With drones and unmanned aerial systems (UAS) becoming very potent weapons in modern-day warfare, the need for counter-UAS systems is becoming imperative as is being witnessed in the ongoing wars in Ukraine and in West Asia.\nUpping its quest to equip itself with cutting-edge and niche weaponry, the Indian Army is on the hunt for 90 high-power microwave (Mark II) systems to counter the growing threat of UAS or drones.\nMicrowave weapons belong to the family of Directed Energy Weapons (DEWs) where devastating lethal force generated by concentrated laser, microwaves or particle beams are directed onto a target at a great speed.\nThe radar system should be able to detect and track even targets with low radar signatures and thereafter assist in designation of the hostile targets to the weapon system.\nThe microwave system with at least a 3km operational range, has to be vehicle-mounted and be able to be deployed independently or in conjunction with already deployed air defence weapon systems and other counter UAS weapon systems."}, {"id": "23eb1c61-a101-477b-a527-7dd8a52e3797", "title": "Tim Walz visits Southern California as Kamala Harri running mate", "date": "2024-08-14 01:45", "url": "https://www.nbclosangeles.com/news/local/tim-walz-visits-southern-california-for-first-time-as-kamala-harris-running-mate/3487559/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "\"AFSCME stands for the American worker,'' the vice presidential contender said, one week after Harris named him as her running mate.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n\"It's a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,'' the county GOP contended.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "dc8eeb25-a387-4c47-97f1-0163a843ae11", "title": "Sudan at  breaking point  amid civil war as US - mediated cease - fire talks set to begin", "date": "2024-08-14 07:45", "url": "https://abcnews.go.com/International/sudan-breaking-point-amid-civil-war-us-mediated/story?id=112796431", "domain": "abcnews.go.com", "domain_classification": "International", "message": "LONDON -- The U.S. Special Envoy for Sudan has said U.S.-mediated cease-fire talks between warring Sudanese parties are set to go ahead this week, despite pending confirmation of participation from the Sudanese Army.\nAFP via Getty Images\"The RSF delegation has arrived in Switzerland,\" Perriello said on social media early on Wednesday.\nU.S. Special Envoy for Sudan Tom Perriello talks to the media about talks aimed on Sudan during a press briefing at the U.S. Mission in Geneva, Switzerland, Monday, Aug. 12, 2024.\nThe combat between warring parties has continued to rage in areas of North Darfur, Al Jazirah state, Sennar State, West Kordofan and other areas.\nThe U.S. invited warring parties to cease-fire talks last month."}, {"id": "9d2e4ea0-405b-4899-b9e1-4ff8158431cf", "title": "The latest skirmish in the ongoing war on Western civilization * WorldNetDaily * by Jerry Newcombe", "date": "2024-08-14 02:45", "url": "https://www.wnd.com/2024/08/the-latest-skirmish-in-the-ongoing-war-on-western-civilization/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "Last week, in the New York City college named after Christopher Columbus (the arch-villain to today’s anti-Western civilization), there were calls for the destruction of that very Western civilization.\nAdams Sabes, deputy editor of Campusreform.org, reported that anti-Israel groups at Columbia posted on Instagram: “We are Westerners fighting for the total eradication of Western civilization.\nWhat is Western civilization?\nHe did so much to rally his beleaguered countrymen during World War II to stave off the Nazi barbarians from taking over the British Isles.\nFranklin Roosevelt spoke regularly during World War II about protecting Christian civilization against the Nazis."}, {"id": "fb0c1573-6fdf-4126-bec4-7ebf0e558d0a", "title": "Malaysia assures safety of troops in Lebanon", "date": "2024-08-14 01:00", "url": "https://www.thestar.com.my/news/nation/2024/08/14/malaysia-assures-safety-of-troops-in-lebanon", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "The Defence Minister said his ministry is closely monitoring the situation, and the safety of more than 800 personnel and officers in the region.\n“Rest assured, we have developed options for our troops, and they will only be mobilised if absolutely necessary,” he told reporters after attending the Firepower Training Exercise 2024 at the Syed Sirajuddin Camp’s shooting range here yesterday, Bernama reported.\nThe event is a comprehensive field training exercise, involving all three branches of the Malaysian Armed Forces (MAF).\nMeanwhile, he noted that this year’s training exercise focused on utilising drones for reconnaissance and strike missions, enhancing the effectiveness of indirect fire with air support, as well as integrating ground operations with aerial support.\nIt is a critical exercise to evaluate and align our assets with the country’s needs, and those of other nations,” he added."}, {"id": "46a52a93-00c6-4bb8-9c82-d76239cac287", "title": "Tim Walz speaks in LA during first solo appearance as VP candidate , shows support for unions", "date": "2024-08-14 02:45", "url": "https://www.yahoo.com/news/tim-walz-speaks-la-during-214137821.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tim Walz speaks in LA during first solo appearance as VP candidate, shows support for unionsLOS ANGELES - Democratic vice presidential nominee Tim Walz gave his first solo speech in downtown Los Angeles Tuesday since becoming Kamala Harris' running mate.\nSUGGESTED: Tim Walz picked as Kamala Harris’ running mate\"AFSCME stands for the American worker,\" Walz said, in his speech.\nWhen Tim Walz was called to Iraq in the National Guard, he was the first to run.\"\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "4a30f8d7-0a58-4704-b1d1-e77af2c092a7", "title": "Tim Walz speaks in LA in first solo appearance as VP candidate , shows support for unions", "date": "2024-08-14 01:00", "url": "https://www.foxla.com/news/tim-walz-in-los-angeles-newport-beach", "domain": "foxla.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz gave his first solo speech in downtown Los Angeles Tuesday since becoming Kamala Harris' running mate.\nSUGGESTED: Tim Walz picked as Kamala Harris’ running mate\"AFSCME stands for the American worker,\" Walz said, in his speech.\nWhen Tim Walz was called to Iraq in the National Guard, he was the first to run.\"\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "1ef15608-aa1e-4e4b-9d4c-b8c15d8338f8", "title": "Walz Defends Military Record , Saying He Proud of His Service", "date": "2024-08-14 08:45", "url": "https://www.theepochtimes.com/us/walz-defends-military-record-saying-hes-proud-of-his-service-5705372", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz on Tuesday defended his military record against Republican attacks, saying he is proud of his service to the country.\nDuring a campaign event in Los Angeles, Walz addressed the accusations launched by his GOP critics, specifically Marine Corps veteran and Republican vice presidential nominee J.D.\nVance, who alleged that Walz lied about his military service.\n“These guys [they] are even attacking me for my record of service, and I just want to say I’m proud to have served my country, and I always will be,” Walz told supporters“I firmly believe you should never denigrate another person’s service record,” he said.\nVance accused Walz of misrepresenting his military record and portraying himself as a combat veteran."}, {"id": "d3bd615a-2900-40d6-bac8-77be4d758d70", "title": "Some Thoughts On Valor -- Stolen Or Not", "date": "2024-08-14 10:30", "url": "https://www.americanthinker.com/articles/2024/08/some_thoughts_on_valor_stolen_or_not.html", "domain": "americanthinker.com", "domain_classification": "Unknown", "message": "Dad spent much of his service time as a medic, manning a two-man stretcher to carry the wounded from battle.\nHe claimed he didn’t believe he deserved that form of recognition after seeing so many men killed and severely wounded.\nThat comment was based on love for my mother, not on wanting to steal any valor for himself.\nOne morning in December of 1972, American bombers got their grid coordinates reversed on a cloudy day and dropped their bombs on the Da Nang Airbase, where our dental clinic was located.\nI told my commanding officer that I was proud to accept the medal, but I asked that he present it to me in the dental clinic rather than in front of a crowd."}, {"id": "741765a5-e8f5-410b-b522-5f056fc67a88", "title": "Walz defends National Guard service record after Vance attack – NBC New York", "date": "2024-08-14 12:30", "url": "https://www.nbcnewyork.com/decision-2024/walz-defends-military-record-amid-republican-attacks/5704282/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz defended his military record Tuesday amid attacks from Republicans led by his election rival, Sen. JD Vance of Ohio, who has accused him of stolen valor.\n“These guys have — are even attacking me for my record of service,” Walz said.\nRepublicans have attacked Walz over his military record, with Vance, a Marine Corps veteran, accusing him of lying about his service.\nThe criticism over Walz’s military service swirled after Vice President Kamala Harris’ campaign posted a video clip of Walz discussing gun control and referring to his own military background in 2018.\nVance last week asserted that Walz had misrepresented his military record in those remarks."}, {"id": "a967034a-918d-4e7a-8f59-f9fa8ecb248a", "title": "Walz defends National Guard service record after Vance attack – NBC 5 Dallas - Fort Worth", "date": "2024-08-14 14:15", "url": "https://www.nbcdfw.com/decision-2024/walz-defends-military-record-amid-republican-attacks/3620940/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz defended his military record Tuesday amid attacks from Republicans led by his election rival, Sen. JD Vance of Ohio, who has accused him of stolen valor.\n“These guys have — are even attacking me for my record of service,” Walz said.\nThe criticism over Walz’s military service swirled after Vice President Kamala Harris’ campaign posted a video clip of Walz discussing gun control and referring to his own military background in 2018.\nVance last week asserted that Walz had misrepresented his military record in those remarks.\n“I’d be ashamed if I was him and I lied about my military service like he did,” Vance said at the time."}, {"id": "655f0782-0d0c-44cf-b737-e734f1b0d15c", "title": "Sir Peter Cosgrove to attend Vietnam Veteran Day in Warrnambool | The Standard", "date": "2024-08-14 03:15", "url": "https://www.standard.net.au/story/8729600/sir-peter-cosgrove-to-attend-vietnam-veterans-day-in-warrnambool/", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Fought in monsoonal rains in the Long Tan rubber plantation where Aussie soldiers were outnumbered 10 to one by the Viet Cong, the battle was one of the biggest and most costly, although ultimately successful encounter of the 1962-73 war for Australia at the time.\nEighteen Diggers from D Company 6RAR lost their lives in the battle."}, {"id": "2b44c9a8-6746-4925-bb9a-19a3e2fea95c", "title": "Tim Walz Defends Military Service , Thanks JD Vance For His", "date": "2024-08-14 01:00", "url": "https://www.mediaite.com/politics/im-damn-proud-of-my-service-tim-walz-defends-military-record-and-thanks-jd-vance-for-his-service/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "Tim Walz (D), Kamala Harris’s running mate, took on the accusations regarding his military service record during a solo stump speech on Tuesday.\nWalz recalled how he was inspired by his father’s service during the Korean War to enlist when he was 17.\n“Then in 2005, I felt the call of duty again, this time of being service to my country in the halls of Congress.\nAnd I firmly believe you should never denigrate another person’s service record.\npic.twitter.com/DN0CjLqRWc — Acyn (@Acyn) August 13, 2024Watch the clip above and full speech here."}, {"id": "772d9194-db39-4c1c-8777-5b8f096b3316", "title": "Russian Army Loses 1 , 240 Soldiers In Ukraine Over Past Day", "date": "2024-08-14 07:45", "url": "https://menafn.com/1108552412/Russian-Army-Loses-1240-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia lost about 594,400 in Ukraine between February 24, 2022 and August 14, 2024, including 1,240 killed or wounded in action in the past 24 hours.\nThe General Staff of the of Ukraine said this in a post on , Ukrinform reports.\nIn addition, Ukraine's defense forces destroyed 8,476 (+21) Russian tanks, 16,402 (+17) armored fighting vehicles, 16,821 (+57) artillery systems, 1,151 (+5) multiple rocket launchers, 921 (+1) anti-aircraft warfare systems, and 2,426 missiles.\nThe Russian also lost 366 warplanes, 328 (+1) helicopters, 13,548 (+57) tactical unmanned aerial systems, 28 warships/cutters, 1 submarine, 22,710 (+61) vehicles and fuel tankers, and 2,813 (+7) pieces of special equipment."}, {"id": "241277b4-2717-47a7-bade-08cd36c893e0", "title": "President recalls suffering in Middle East , Ukraine at ceremony marking 82 years since Santa Marija convoy saved Malta", "date": "2024-08-14 12:30", "url": "https://www.maltatoday.com.mt/news/national/130732/president_recalls_suffering_in_middle_east_ukraine_at_event_marking_82_years_since_santa_marija_convoy", "domain": "maltatoday.com.mt", "domain_classification": "Unknown", "message": "The Maltese have a “constitutional duty to actively pursue peace”, President Myriam Spiteri Debono said during a ceremony marking the 82nd anniversary of the Santa Marija convoy.\nThe commemorative ceremony organised by the Malta George Cross branch of the Royal British Legion was held at the Grand Harbour in Valletta.\nThe ceremony marked the 82nd anniversary of the Second World War convoy, known as Operation Pedestal, that saw a flotilla of ships traverse the Mediterranean to bring important supplies to Malta.\nThe Maltese referred to the maritime operation as the Santa Marija Convoy since the ships made landfall on the day Malta celebrates the feast of the Assumption, better known as Santa Marija.\nHowever, she said it would be pointless to mark the day without reflecting on what is happening today in the world."}, {"id": "fae3060a-a9fa-482b-bbda-f15d530361ae", "title": "These Famous Gravesites Are The Most Visited In Michigan", "date": "2024-08-14 13:15", "url": "https://wbckfm.com/ixp/1161/p/famous-gravesites-most-visited-michigan/", "domain": "wbckfm.com", "domain_classification": "Unknown", "message": "We've all heard the famous saying, \"The only thing guaranteed in life is death and taxes\" and honestly this couldn't be more true.\nThere are famous people buried all over the world as each person's burial location is significant to them in some way.\nSo, which famous people have gravesites in Michigan that are frequently visited by tons of people?\nRosa Parks and David Ruffin, another Motown legend, are buried in Detroit while Sojourner Truth is buried in Battle Creek.\nHere Are 6 of the Most Famous People Buried in Battle Creek's Oak Hill Cemetery From cereal magnates to saxophonists, here are some of the most famous residents of Battle Creek's Oak Hill Cemetery."}, {"id": "fe0947e1-7504-4e0d-8ed2-dc750fb2d6d5", "title": "Walz defends National Guard service record after Vance attack – NBC 6 South Florida", "date": "2024-08-14 13:45", "url": "https://www.nbcmiami.com/decision-2024/walz-defends-military-record-amid-republican-attacks/3391879/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz defended his military record Tuesday amid attacks from Republicans led by his election rival, Sen. JD Vance of Ohio, who has accused him of stolen valor.\n“These guys have — are even attacking me for my record of service,” Walz said.\nThe criticism over Walz’s military service swirled after Vice President Kamala Harris’ campaign posted a video clip of Walz discussing gun control and referring to his own military background in 2018.\nVance last week asserted that Walz had misrepresented his military record in those remarks.\n“I’d be ashamed if I was him and I lied about my military service like he did,” Vance said at the time."}, {"id": "af4c7117-b54c-4b6f-8b6c-ade0c86dcebc", "title": "Hillary Clinton Attempts to Rescue Tim Walz After Stolen Valor Claims", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/12/hillary-clinton-attempts-rescue-embattled-vice-president-pick-tim-walz-stolen-valor-claims/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hillary Clinton — who once falsely claimed she took sniper fire in Bosnia — attempted to come to the rescue of Minnesota Gov.\n“Tim Walz served honorably for two decades.\nThe post did not address Walz’s false claims over the last two decades of being a retired command sergeant major when he actually retired at a rank below.\nNor did her post address Walz’s false claim that he carried weapons “in war” when he never served in combat.\nThe Harris campaign actually posted that video on its X account before Walz’s false claims about his military record grew into a scandal."}, {"id": "8c1ea5db-8da3-45bc-9a5d-66e0d1e281cc", "title": "Russia Belgorod border region declares emergency after heavy shelling by Ukrainian forces", "date": "2024-08-14 11:15", "url": "https://www.moneycontrol.com/news/world/russias-belgorod-border-region-declares-emergency-after-heavy-shelling-by-ukrainian-forces-12796821.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "0e90fe96-122f-4b8f-bbf6-4e619dabaafb", "title": "What Are The 6 Lightsabers Of Anakin Skywalker ? EXPLAINED", "date": "2024-08-14 08:30", "url": "https://www.pinkvilla.com/entertainment/hollywood/what-are-the-6-lightsabers-of-anakin-skywalker-explained-1338850", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "If you’re a true Star Wars fan, you’ve either bought or wanted a blue lightsaber inspired by Anakin Skywalker.\nThroughout the many movies and TV Shows, Anakin Skywalker wields not one, not two, but a total of six lightsabers, and here’s everything we know about them.\nThis was also the scene where Obi-Wan left Anakin Skywalker for the dead.\nAs for the blue lightsaber, Anakin didn't just use it in Revenge of the Sith.\nJust like Anakin Skywalker, his lightsabers have also been through a journey of their own."}, {"id": "790488f9-7c77-4dbe-bacd-a065bf9ea8ff", "title": "Ukraine news : Russia border region declares emergency", "date": "2024-08-14 12:30", "url": "https://www.ctvnews.ca/world/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion-1.7000124", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "KYIV, Ukraine -Russia's Belgorod border region declared an emergency Wednesday under heavy shelling by Ukrainian forces that are pressing a major cross-border incursion into the adjacent Kursk region for a second week.\nThe surprise Ukrainian charge onto Russian soil that began Aug. 6 has rattled the Kremlin.\nA Ukrainian Foreign Ministry spokesperson said Tuesday that Kyiv has no intention of occupying the Russian territory it says it is holding.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\nThe report showed burnt-out Russian military columns on roads in the area as well as Ukrainian soldiers handing humanitarian aid to local residents and taking down Russian flags from an administrative building."}, {"id": "738579bf-70df-4606-893d-0ea9efc6f647", "title": "Airpower History Tour coming to Colorado Springs", "date": "2024-08-14 02:00", "url": "https://www.yahoo.com/news/airpower-history-tour-coming-colorado-233322659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(COLORADO SPRINGS) — The Airpower History Tour is coming to the Colorado Springs Airport from Wednesday, Aug. 28, to Sunday, Sept. 1, bringing the sights, sounds, and stories of World War II (WWII) aviation to life when the B-29 Superfortress “FIFI” along with a T-6 Texan and an RC-45J Expeditor land.\nThe event, which tours airports across North America, is presented by the Commemorative Air Force (CAF).\nVisitors will have the opportunity to view all aircraft up close, purchase rides, and tour the B-29 cockpit in between flights.\nIt is known as the aircraft that helped bring the war to an end with its mission flying over Japan.\nThe CAF has become the world’s largest flying museum, collecting and flying WWII aircraft for over six decades."}, {"id": "af1e36b0-6083-4c4b-a08e-e876e67f4cd8", "title": "One of Ukraine Main Goals in Invading Russia Appears to Be Working", "date": "2024-08-14 13:30", "url": "https://www.businessinsider.com/ukraines-main-goal-in-invading-russia-appears-working-kurk-putin-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Ukraine's invasion of the province of Kursk last week took Russia by surprise.\nAnalysts told Business Insider that one of Ukraine's core aims in the operation is to divert Russian troops from the front line in Ukraine.\nRelated storiesIt said that Russia could be diverting troops from units in Donetsk intended to relieve or reinforce front-line units.\nBI has been unable to confirm reports of the redeployments, and it is unknown exactly how many Russian troops may have been diverted to fight Ukraine's Kursk incursion.\nAdvertisementFor months, Ukraine's forces have been losing ground to Russia in a grinding war of attrition."}, {"id": "cf34e8c8-07d1-4a50-9a4f-6cdc5ffe3837", "title": "Ukraine may use German weapons in its advance into Russia – DW – 08 / 14 / 2024", "date": "2024-08-14 13:30", "url": "https://www.dw.com/en/ukraine-may-use-german-weapons-in-its-advance-into-russia/a-69937795", "domain": "dw.com", "domain_classification": "International", "message": "In Germany, the government and the main opposition party say Ukraine's alleged use of German-supplied weapons within Russia presents no legal problems.\nFor the spokesman of Germany's Ministry of Defense, the matter was simple: \"Those are Ukrainian weapons,\" said Wolfgang Büchner when asked about the issue in the weekly press conference.\nThe ministry's position is that once the weapons have been delivered to Ukraine, the German government no longer has anything to do with them.\nThe Chancellor remains silentGerman Chancellor Olaf Scholz has so far remained silent on the possible use of German weapons in the Ukrainian advance into the Kursk region.\nConfirmation that Ukraine is using German weapons in Russia could further shift sentiment among some German citizens against military support."}, {"id": "07770f28-c884-4faa-a995-ec8cc2df9a1a", "title": "Ukraine war : Kursk offensive has taken the war into Russia and put Putin on the back foot – for now", "date": "2024-08-14 12:30", "url": "https://theconversation.com/ukraine-war-kursk-offensive-has-taken-the-war-into-russia-and-put-putin-on-the-back-foot-for-now-236663", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "But in moving the point of attack to a relatively unguarded stretch of border, Ukraine has managed to negate these advantages and set the conditions for an operational breakthrough.\nSo perhaps the strategic aim is to seize and hold Russian territory as leverage in any future negotiations.\nThis will be their short-term goal, followed by the attrition of Ukrainian forces and the reducing of the pocket occupied by the incursion.\nUkraine’s Kursk offensive is high risk and high stakes.\nAnd one thing neither side will forget is how easy it was for Ukraine to roll over the weakly protected Russian border and embarrass Putin."}, {"id": "c4708fe9-b050-4bb9-a0aa-bdfcadcf9ef6", "title": "Army extends deadline : Old combat uniform will be in service till June 2026", "date": "2024-08-14 06:00", "url": "https://www.moneycontrol.com/news/india/army-extends-deadline-old-combat-uniform-will-be-in-service-till-june-2026-12796122.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:Army extends deadline: Old combat uniform will be in service till June 2026"}, {"id": "60db7f7a-231e-4a4c-8e20-425b40240492", "title": "Backlash Against Tim Walz for Mischaracterizing  Stolen Valor  Claims", "date": "2024-08-14 03:15", "url": "https://www.breitbart.com/politics/2024/08/13/backlash-against-tim-walz-for-mischaracterizing-stolen-valor-claims/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "And I firmly believe you should never denigrate another person’s service record.\nNo one is denigrating his actual service record, they’re denigrating the lies he tells about his service record.\nWalz is dishonoring himself by embellishing his military service record for political gain.”“It’s not ‘degrading someone’s service record’ to point out that they lied about serving in combat repeatedly,” said retired USAF pilot Dale Stark.\nNo one is denigrating his actual service record, they're denigrating the lies he tells about his service record.\n🇺🇸 (@RobManess) August 13, 2024It’s not “degrading someone’s service record” to point out that they lied about serving in combat repeatedly."}, {"id": "3385639e-f702-412a-bec5-e51fbe3b27f6", "title": "A second Russian border region declares an emergency as Ukrainian forces press their incursion", "date": "2024-08-14 10:45", "url": "https://www.ksat.com/news/world/2024/08/14/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Ukraine also claimed that overnight from Tuesday to Wednesday it conducted its biggest attack on Russian military airfields since the start of the Kremlin's full-scale invasion in Feb. 2022.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nAnalysts say that Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nIt was not clear how or when — or whether — Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "a51a6b60-5114-4aff-aef5-f827b825f97d", "title": "A second Russian border region declares an emergency as Ukrainian forces press their incursion", "date": "2024-08-14 11:00", "url": "https://www.clickondetroit.com/news/world/2024/08/14/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Ukraine also claimed that overnight from Tuesday to Wednesday it conducted its biggest attack on Russian military airfields since the start of the Kremlin's full-scale invasion in Feb. 2022.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nAnalysts say that Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nIt was not clear how or when — or whether — Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "0d129e6c-cd84-406e-ab02-46bdcabfad60", "title": "Russian Army Gets Into Mousetrap Near Village Of Kamyshnoye In Kursk region", "date": "2024-08-14 13:15", "url": "https://charter97.org/en/news/2024/8/14/606727/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Russian Army Gets Into Mousetrap Near Village Of Kamyshnoye In Kursk region 11 14.08.2024, 13:2431,250The AFU outflanked the Russians and hit their rear south of Sudzha.\nForward units of the Ukrainian army outflanked Russian troops near Krupets and hit them in their rear on the western outskirts of Kamyshnoye.\nThis area was remotely mined by the Ukrainian troops in order to block the route towards Sudzha.\nSoon the Russians will find themselves in a full-fledged mousetrap, which will be closed by units of the Ukrainian army.\nRussian channels are reporting similar information that fighting has been recorded on the western outskirts of Kamyshnoye, although it has not yet been visually confirmed."}, {"id": "4d538d39-80ab-4cd5-a23d-af45906e8527", "title": "K1NGM4K3RS Inc . Aims to Bring Kabaddi to America", "date": "2024-08-14 12:30", "url": "https://www.businesswireindia.com/k1ngm4k3rs-inc-aims-to-bring-kabaddi-to-america-91185.html", "domain": "businesswireindia.com", "domain_classification": "Unknown", "message": "We want to ensure that Battle Tag respects the heritage of Kabaddi and that we attain the highest standards and ethics.\"\nK1NGM4K3RS Inc. co-founder Vishal Singh, underlined the ambitious plans to grow Battle Tag from the grassroots.\nK1NGM4K3RS Inc. has been actively engaged in discussions to secure partnerships and investments from various esteemed partners across the United States, United Kingdom and Asia.\nFurther details about the Battle Tag Expo and the league launch will be shared in the coming weeks.\nK1NGM4K3RS Inc. is committed to creating a dynamic and engaging platform for Battle Tag, setting the stage for a new era in sports entertainment."}, {"id": "d125100d-622d-4848-b8ea-ba5a9dc9d6c4", "title": "DNC Credentials Compromised by  IntelFetch  Telegram Bot", "date": "2024-08-14 10:45", "url": "https://www.darkreading.com:443/cyberattacks-data-breaches/dnc-credentials-compromised-intelfetch-telegram-bot", "domain": "darkreading.com", "domain_classification": "Unknown", "message": "As the Democratic National Convention (DNC) is set to kick off in Chicago Aug. 19-22, a Telegram-based bot service called \"IntelFetch,\" has been aggregating compromised credentials linked to the DNC and Democratic Party websites.\nThe stolen data, identified and verified by ZeroFox researchers, includes compromised credentials from the Washington and Idaho state branches of the DNC, and other sensitive information, including logins for party members and delegates.\n\"Threat actors may target attendees directly and leverage their access to move on to higher-value targets,\" he tells Dark Reading.\n\"Threat actors who cannot send diplomats to engage with candidates are more likely to attempt to obtain the information via cyber espionage campaigns or other malicious activity,\" Shields says.\n\"The days of cybersecurity concerns being relegated to secondary discussed only among cybersecurity experts has ended,\" he explains."}, {"id": "249edd56-e4e6-42a1-b66a-9ca3019dde3d", "title": "VP Candidate Walz Declares  When Unions Are Strong , America is Strong  at Local Convention", "date": "2024-08-14 00:45", "url": "https://mynewsla.com/government/2024/08/13/tim-walz-speaks-at-downtown-la-union-convention-newport-beach-fundraiser-next-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "The Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\n“From the Lyon Air Museum and Veterans Memorial in Orange to Heroes Hall in Costa Mesa and Sid Goldstein Freedom Park in Westminster, Orange County honors our veterans.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nWalz has a clear record supporting veterans while in the National Guard and during his time in office,” Foley added."}, {"id": "b80e75c0-b66b-4b75-9d6a-d0d08709fee0", "title": "Kyodo News Digest : Aug . 14 , 2024", "date": "2024-08-14 04:30", "url": "https://english.kyodonews.net:443/news/2024/08/e9a36e81c110-kyodo-news-digest-aug-14-2024--1-.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 1 hour ago - 23:00 | All, Japan, WorldThe following is the latest list of selected news summaries by Kyodo News.\nOperations between Nagoya and Shin-Osaka stations on the Tokaido Shinkansen line will also be significantly reduced later this week, Central Japan Railway Co. said Wednesday.\nThe typhoon is currently located south of the Japanese archipelago and moving northward.\nHiroshi Kasamatsu, 53, the merchandise division chief of Aeon Orange Co., left Yangon on Tuesday and arrived in Bangkok the same day without any major health problems.\nWill Smith had also homered in the second to put the Dodgers on the board."}, {"id": "4f123652-1283-49d4-be22-25e90d515fc2", "title": "Independence Day 2024 : From Har Ghar Tiranga to unfurling tricolor at Red Fort , India to celebrate 77th year of freedom – Firstpost", "date": "2024-08-14 12:30", "url": "https://www.firstpost.com/india/independence-day-2024-from-har-ghar-tiranga-to-unfurling-tricolor-at-red-fort-india-set-to-celebrate-77th-year-of-freedom-13804574.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "This day, steeped in national pride, honours the sacrifices of countless freedom fighters and civilians who contributed to India’s struggle for independence.\nProminent leaders such as Mahatma Gandhi, Pandit Jawaharlal Nehru, Sardar Patel, and Subhas Chandra Bose were instrumental in opposing British rule.\nCelebrations of Independence DayPreparations for Independence Day start well in advance.\nOn Independence Day itself, the prime minister raises the national flag and delivers a speech at the historic Red Fort in Delhi.\nThis year, the government has specifically asked each household to raise the tricolour on Independence Day."}, {"id": "9977be7d-c781-4193-9f13-06f60b2f2e3a", "title": "Russia says it thwarted Ukrainian charge to expand Kursk incursion , Kyiv says it wont occupy land", "date": "2024-08-14 07:15", "url": "https://www.thehindu.com/news/international/russia-says-it-thwarted-ukrainian-charge-to-expand-kursk-incursion-kyiv-says-it-wont-occupy-land/article68523351.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Russia said Tuesday (August 14, 2024) that its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesperson said Kyiv has no intention of occupying Russian territory.\nAlso read: Ukraine offers to stop incursion if Russia agrees to ‘just peace’Meanwhile, Ukrainian Foreign Ministry spokesperson Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine’s shorthanded army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "637e92b4-93c8-4233-a588-84013181cb9c", "title": "Moscow claims it thwarted a new Ukraine push into Russia", "date": "2024-08-14 00:15", "url": "https://www.mercurynews.com/2024/08/13/moscow-claims-it-thwarted-a-new-ukraine-push-into-russia/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "“Ukraine is not interested in taking the territory of the Kursk region, but we want to protect the lives of our people,” Tykhyi was quoted as saying by local media.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\n“The purpose of this operation is to preserve the lives of our children, to protect the territory of Ukraine from Russian strikes,” he said.\nUkraine’s undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "994e0d67-8f34-4964-a879-91b2b9d91f61", "title": "NATO to boost readiness numbers , approve new Ukraine aid at Madrid summit", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/global/europe/2022/06/27/nato-to-boost-readiness-numbers-approve-new-ukraine-aid-at-madrid-summit/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "STUTTGART, Germany — NATO plans to approve increased readiness objectives and provide more support to Ukraine, as well as formalize a key strategic document at its annual summit this week, alliance Secretary-General Jens Stoltenberg said Monday.\nNATO is also planning to upgrade its defense plans, and pre-assign troops to defend specific allies.\nNATO plans to approve a new comprehensive aid package for Kiev, to include “partial deliveries” of capabilities like secure communications, unmanned systems and fuel, per Stoltenberg.\n“But of course, then we need to respond to that reality.”Stoltenberg lauded the fact that NATO members have increased defense spending for the eighth consecutive year.\nShe previously reported for National Defense Magazine, Defense Daily, Via Satellite, Foreign Policy and the Dayton Daily News."}, {"id": "eb7f223f-addb-4be6-b321-20bdf7f2c6ad", "title": "Ukrainian incursion forces 2nd Russian region to declare emergency", "date": "2024-08-14 12:45", "url": "https://www.dailysabah.com/world/europe/ukrainian-incursion-forces-2nd-russian-region-to-declare-emergency", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "The Belgorod border region in Russia declared an emergency due to heavy shelling by Ukrainian forces pressing a major cross-border incursion into the adjacent Kursk region for a second week.\nThe surprise Ukrainian charge onto Russian soil that began Aug. 6 has rattled the Kremlin.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\nThe report showed burnt-out Russian military columns on roads in the area as well as Ukrainian soldiers handing humanitarian aid to local residents and taking down Russian flags from an administrative building.\nUkraine servicemen walk among sunflowers, to their position outside the town of Pokrovsk, in Donetsk region, Ukraine, Aug. 13, 2024."}, {"id": "4ea4eaf0-c661-4958-a7cc-a921d6b3381f", "title": "Ukraine claims prisoners taken as it continues incursion into Russia", "date": "2024-08-14 13:45", "url": "https://www.edp24.co.uk/news/national/24517632.ukraine-claims-prisoners-taken-continues-incursion-russia/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Also, Ukrainian troops on Wednesday took more than 100 Russian soldiers prisoner, he said.\nThe daring Kursk operation is the largest attack on Russia since the Second World War and could involve as many as 10,000 Ukrainian troops backed by armour and artillery, military analysts say.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nIt was not clear how or when, or whether, Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "d030a1a4-1d63-4d8e-9833-050183f0522d", "title": "Moscow claims it thwarted a new Ukraine push into Russia", "date": "2024-08-14 01:30", "url": "https://www.eastbaytimes.com/2024/08/13/moscow-claims-it-thwarted-a-new-ukraine-push-into-russia/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "“Ukraine is not interested in taking the territory of the Kursk region, but we want to protect the lives of our people,” Tykhyi was quoted as saying by local media.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\n“The purpose of this operation is to preserve the lives of our children, to protect the territory of Ukraine from Russian strikes,” he said.\nUkraine’s undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "69631159-5e9d-4236-a554-be0306c19023", "title": "A second Russian border region declares an emergency as Ukrainian forces press their incursion – Winnipeg Free Press", "date": "2024-08-14 11:15", "url": "https://www.winnipegfreepress.com/world/2024/08/14/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine (AP) — Russia’s Belgorod border region declared an emergency Wednesday under heavy shelling by Ukrainian forces that are pressing a major cross-border incursion into the adjacent Kursk region for a second week.\n(Russian Defense Ministry Press Service photo via AP)The surprise Ukrainian charge onto Russian soil that began Aug. 6 has rattled the Kremlin.\nA Ukrainian Foreign Ministry spokesperson said Tuesday that Kyiv has no intention of occupying the Russian territory it says it is holding.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\nMilitary vehicles drive near the Russian-Ukrainian border in Sumy region, Ukraine, Tuesday, Aug. 13, 2024."}, {"id": "ccbdaf0a-4874-4331-aed2-84dd0e5da04f", "title": "Clarence Page : Why  stolen valor  political fights are so intense and misplaced in the cases of Walz and Vance", "date": "2024-08-14 05:30", "url": "https://www.sunjournal.com/2024/08/14/clarence-page-why-stolen-valor-political-fights-are-so-intense-and-misplaced-in-the-cases-of-walz-and-vance/", "domain": "sunjournal.com", "domain_classification": "Unknown", "message": "Tim Walz, out of her mouth before the Republican vice presidential nominee, Sen. JD Vance from Ohio, raised allegations of “stolen valor” against Walz.\nHe also was a prominent backer of legislation to put an end to stolen valor claims.\n”From the LEGAL standpoint, there is no Stolen Valor here” in the examples regarding Walz, he wrote in an email exchange.\nOne person’s “stolen valor” can be another person’s “war stories,” in which fact-checking is almost nonexistent.\nVance volunteered for military service in a time of war and he should be proud of that."}, {"id": "6d664c69-1f40-4376-9c63-d3d21d288b2f", "title": "Ten Blasts Reported As Russia Savasleyka Airfield Comes Under Drone Attack", "date": "2024-08-14 10:00", "url": "https://menafn.com/1108553115/Ten-Blasts-Reported-As-Russias-Savasleyka-Airfield-Comes-Under-Drone-Attack", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Explosions rang out Wednesday morning in Russia's Nizhny Novgorod region, where the Savasleyka military airfield is located, local authorities reported, adding that air defenses were activated in the area.\nAccording to open sources, a branch of the 4th State Center for Personnel Training and Military Tests of Russia's of Defense is based at the Savasleika airfield.\nAccording to local sources, there were at least 10 impacts at the Savasleika military air base on Wednesday.\nUkraine intercepts 17 Shahedovernight WedLater, the governor of the Nizhny Novgorod region, Gleb Nikitin, said air defense forces engaged incoming drones in the Kulebyaki district.\n\"In the Kulebayaki municipal district, air defense and electronic warfare units are in action this morning to repel the attack of aircraft-type unmanned aerial vehicles,\" Nikitin wrote on Telegram."}, {"id": "baea33d2-0362-4eff-8954-1c331d4181e1", "title": "Will the attacks on Walz military service stick like they did to John Kerry 20 years ago ? ", "date": "2024-08-14 02:30", "url": "https://www.adn.com/nation-world/2024/08/13/will-the-attacks-on-walzs-military-service-stick-like-they-did-to-john-kerry-20-years-ago/", "domain": "adn.com", "domain_classification": "Unknown", "message": "“It is a very different world,” said Tad Devine, a senior adviser to Kerry’s 2004 campaign.\nKamala Harris’ campaign has pushed back against the attacks, but some Democrats worry Republicans might succeed in turning Walz’s military service into a liability.\nADVERTISEMENTIn 2004, Kerry and President George W. Bush, the Republican nominee, took public funding, receiving $74.6 million each from the government, barring them from private donations.\nCould attacks on Walz’s 24 years of military service boomerang on the Republican standard-bearer?\nThe former president has been criticized for avoiding military service over claims he suffered from bone spurs."}, {"id": "8f50e0f8-85cb-4619-a2fd-7c0751a08c33", "title": "Second Russian border region declares emergency as Ukrainian forces continue incursion", "date": "2024-08-14 12:30", "url": "https://fox11online.com/news/nation-world/second-russian-border-region-declares-emergency-as-ukrainian-forces-continue-major-cross-border-incursion-kursk-civilian-casualties-camps-safety-kremlin-putin-armor-artillery-kyiv-zelenskyy", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "Russia's Belgorod border region declared an emergency Wednesday under heavy shelling by Ukrainian forces that are into the adjacent Kursk region for a second week.\nA Ukrainian Foreign Ministry spokesperson said Tuesday that Kyiv has no intention of occupying the Russian territory it says it is holding.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\nThe report showed burnt-out Russian military columns on roads in the area as well as Ukrainian soldiers handing humanitarian aid to local residents and taking down Russian flags from an administrative building.\nRussia's Ministry of Defense said Wednesday it destroyed 117 Ukrainian drones and four missiles over eight of its regions overnight."}, {"id": "43bf6be5-2b6b-405f-84ff-0170d2389d16", "title": "Ukraine advance into Russian Kursk region halted , Moscow claims", "date": "2024-08-14 01:30", "url": "https://news.sky.com/story/ukraine-advance-into-russian-kursk-region-halted-moscow-claims-13196728", "domain": "news.sky.com", "domain_classification": "International", "message": "Follow the latest updates on the Russia-Ukraine warPlease use Chrome browser for a more accessible video player 3:44 How long can Ukraine hold Kursk?\nUkraine's state television showed Ukrainian troops pulling down a Russian flag from an official building in Sudzha, a transhipment hub for Russian natural gas flowing to Europe via Ukraine.\nUkraine blindsided Moscow when it poured thousands of troops into Kursk last week, rapidly gaining ground as it launched the biggest invasion of Russian territory since the Second World War.\nThe United States says it had \"nothing to do\" with the surprise invasion of Russian territory.\nA \"generous\" peace offer made by Russia to Ukraine in June is \"no longer on the table\", said Dmitry Polyanskiy, Russia's deputy envoy to the UN."}, {"id": "ebc0da38-1b48-4c0e-848a-2c00fab1692d", "title": "Chuck Johnson performs  The Night Before Gettysburg  for auditorium fundraiser", "date": "2024-08-14 00:30", "url": "https://www.perhamfocus.com/news/local/chuck-johnson-performs-the-night-before-gettysburg-for-auditorium-fundraiser", "domain": "perhamfocus.com", "domain_classification": "Unknown", "message": "PERHAM — Chuck Johnson performed his original one-act play, \"The Night Before Gettysburg,\" for a fundraiser hosted by the Friends of the Perham Auditorium on Thursday, Aug. 8, at 7 p.m.\nI want to talk about something of great pride, the Minnesota First Regiment,” Johnson said.\nChuck Johnson on stage at the Perham Auditorium while he portrays Abraham Lincoln sitting alone at his desk polishing his Gettysburg Address.\n“If the Battle of Gettysburg goes to the Confederates, there’s a 99 percent chance that the Union would not have won the Civil War,” Johnson continued.\nThe Confederates started fighting their way up that hill and the Minnesota flag bearer heard somebody call for a charge."}, {"id": "b5409b16-7ba2-47fd-b162-a65e6f667ab4", "title": "Ukraine claims more advances , prisoners taken as it presses an incursion into Russia", "date": "2024-08-14 13:15", "url": "https://www.news4jax.com/news/world/2024/08/14/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Ukraine also claimed that overnight from Tuesday to Wednesday it conducted its biggest attack on Russian military airfields since the start of the Kremlin's full-scale invasion in Feb. 2022.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nAnalysts say that Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nIt was not clear how or when — or whether — Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "e80f9d6f-cadb-432c-8468-3dd8f134cbe7", "title": "Ukraine claims prisoners taken as it continues incursion into Russia", "date": "2024-08-14 13:45", "url": "https://www.theboltonnews.co.uk/news/national/24517632.ukraine-claims-prisoners-taken-continues-incursion-russia/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "Also, Ukrainian troops on Wednesday took more than 100 Russian soldiers prisoner, he said.\nThe daring Kursk operation is the largest attack on Russia since the Second World War and could involve as many as 10,000 Ukrainian troops backed by armour and artillery, military analysts say.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nIt was not clear how or when, or whether, Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "9f099b10-e583-45c3-93e9-1c371fc1ee38", "title": "Ukraine claims more advances , prisoners taken as it presses an incursion into Russia", "date": "2024-08-14 13:15", "url": "https://www.clickorlando.com/news/world/2024/08/14/a-second-russian-border-region-declares-an-emergency-as-ukrainian-forces-press-their-incursion/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Ukraine also claimed that overnight from Tuesday to Wednesday it conducted its biggest attack on Russian military airfields since the start of the Kremlin's full-scale invasion in Feb. 2022.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nAnalysts say that Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nIt was not clear how or when — or whether — Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "3d6d17a6-7dbb-4ced-a06e-eb8191773eee", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 00:45", "url": "https://www.smdailyjournal.com/news/world/russia-says-it-thwarted-a-ukrainian-charge-to-expand-its-incursion-kyiv-says-it-wont/article_61b76f58-59b6-11ef-bb9e-eb6f808bfa4c.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "c60ad1aa-29e5-490d-9441-5aa6d461e9b1", "title": "House of the Dragon Review : Marching towards the dance", "date": "2024-08-14 03:15", "url": "https://www.jamaicaobserver.com/2024/08/13/house-dragon-review-marching-towards-dance/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "Daemon walks towards Rhaenyra in a scene from the House of the Dragon Season 2 finale.\nAlicent appears to have done a complete 180, retreating to old habits of nibbling at her fingertips when nervous.\n“I must take Aegon’s head, and I must do it for all to see,” Rhaenyra reminds Alicent.\nAlicent’s season 2 journey from self-righteous confidence to bitter resignation and self-contempt is one of the most fascinating elements of this season of House of the Dragon.\nHow did House of the Dragon get so woke?"}, {"id": "a2744d33-fc1f-48c4-8149-9ab0faa5ce44", "title": "Here What Tim Walz Had to Say During First Solo Address Since Joining the Ticket", "date": "2024-08-14 03:45", "url": "https://townhall.com/tipsheet/rebeccadowns/2024/08/13/tim-walz-uses-same-tiring-talking-points-in-first-solo-address-since-joining-the-ticket-n2643371", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Tim Walz (D-MN) gave his first solo address since being added to the ticket.\n\"These guys have--are even attacking me on my record of service,\" Walz said, without responding to specific claims about stolen valor.\npic.twitter.com/9a9rJSQurQ — Tim Walz (@Tim_Walz) August 13, 2024Freakish Timothy Walz lied about carrying weapons into war.\nFREAKISH TIM WALZ: \"We respect our neighbors and we respect their personal choices.\"\nWhile Vance can take it, it doesn't mean that he should, and also shows that Walz can't exactly claim \"we respect\" anybody."}, {"id": "f47d04d6-9c30-46e9-8ef9-bfcf3d546d6a", "title": "Ukraine claims more advances , prisoners taken as it presses an incursion into Russia", "date": "2024-08-14 13:30", "url": "http://www.koreaherald.com/view.php?ud=20240814050723", "domain": "koreaherald.com", "domain_classification": "Unknown", "message": "Also, Ukrainian troops on Wednesday took more than 100 Russian soldiers prisoner, Syrskyi said.\nUkraine also claimed that overnight from Tuesday to Wednesday it conducted its biggest attack on Russian military airfields since the start of the Kremlin's full-scale invasion in February, 2022.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nIt was not clear how or when — or whether — Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "d38e55f6-c06a-4403-98c6-cd0cb90eced3", "title": "AP PHOTOS : Indian soldiers drill for counterinsurgency amid rise in rebel attacks in Kashmir", "date": "2024-08-14 07:45", "url": "https://www.yahoo.com/news/ap-photos-indian-soldiers-drill-063414849.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Indian army soldier takes position during a mock drill along the highly militarized Line of Control that divides Kashmir region between India and Pakistan, in Nowshera sector about 127 kilometers (79 miles) from Jammu, India, Monday, Aug.12, 2024.\n(AP Photo/Channi Anand)NOWSHERA, India (AP) — In the remote Himalayas, tens of thousands of Indian soldiers maintain a tight vigil along the highly militarized Line of Control that divides Kashmir region between India and Pakistan.\nThe terrain is tough and the weather is harsh as the soldiers go through counterinsurgency drills and tactical exercises following months of deadly rebel attacks in the disputed region.\nAuthorities say violence in the region has reduced significantly since 2019, when the Indian government stripped Kashmir of semiautonomy and brought it under direct federal control.\nThe string of attacks killed 14 soldiers last month, according to officials, stoking fears of militancy returning to the area."}, {"id": "b2f5a204-5493-4294-9549-74064f9620ce", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 03:15", "url": "https://lasvegassun.com/news/2024/aug/13/russia-says-it-thwarted-a-ukrainian-charge-to-expa/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia says it thwarted a Ukrainian charge to expand its incursion.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "26ff28c2-1664-4ccc-a035-4f4d33cffc5a", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 03:30", "url": "http://lasvegassun.com/news/2024/aug/13/russia-says-it-thwarted-a-ukrainian-charge-to-expa/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia says it thwarted a Ukrainian charge to expand its incursion.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "f28e3bc3-8999-422d-8d13-4beceafca837", "title": "Ukraine cross - border incursion challenges Moscow war narrative – but will it shift Russian opinion ? ", "date": "2024-08-14 13:45", "url": "https://www.yahoo.com/news/ukraine-cross-border-incursion-challenges-123248887.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nUkraine’s invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude “rally around the flag” effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "e3d294f0-09d5-482f-8e11-b267425ae21d", "title": "  Pokémon  Voice Actress Rachael Lillis Dies After Battle With Cancer", "date": "2024-08-14 08:45", "url": "https://www.theepochtimes.com/entertainment/pokemon-voice-actress-rachael-lillis-dies-after-battle-with-cancer-5705286", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Rachael Lillis, known for voicing the characters Misty and Jessie in the English version of the “Pokémon” TV series, has passed away at the age of 55.\nThe Pokémon Company International also paid tribute to Lillis, saying she will be “remembered for generations to come.” The company also extended its condolences to her family and friends.\n“We are deeply saddened to hear about the passing of Rachael Lillis,” the company stated on its official X account.\n“Her performance in the Pokémon animated series will be cherished by the many fans who grew up with the characters she brought to life with her special talent,” it added.\nAside from her iconic voice roles in Pokémon, Lillis also voiced Faragonda and Lucy on “Winx Club,” Danny on “Sonic X,” and Hakura Kasugano on “Midori Days.” The actress also had voice roles on “Teenage Mutant Ninja Turtles” and many other animated television shows and films."}, {"id": "89e5f561-8ef8-4cc6-a0f2-ad2e54a2fed6", "title": "Ukraine pounds Russia with drones , says it is going deeper", "date": "2024-08-14 11:30", "url": "https://www.khaleejtimes.com/world/europe/ukraine-pounds-russia-with-drones-says-it-is-going-deeper", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Refugees receive humanitarian aid at a collection station in Moscow on August 13, 2024, following Ukraine's offensive into Russia's western Kursk region.\nRussia said on Wednesday that it had destroyed 117 Ukrainian drones in Russia overnight, mostly in the Kursk, Voronezh and Belgorod and Nizhny Novgorod regions.\nFormer Ukrainian Defence Minister Andriy Zagorodnyuk said the goal appeared to be to \"distract (Russian) forces and its leadership's attention and resources\" from the frontline in Ukraine.\nRussian military bloggers said that they expected Ukraine to make at least one more major move over coming days.\nIn Russia's border region of Belgorod, governor Vyacheslav Gladkov declared a regionwide state of emergency."}, {"id": "555aaa06-1a24-49d1-a6aa-bef9af94e680", "title": "Oil Theft : Reps Seek Special Fund For NSCDC , Customs", "date": "2024-08-14 01:00", "url": "https://leadership.ng/oil-theft-reps-seek-special-fund-for-nscdc-customs/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "The House of Representatives Special Committee on Oil Theft/Losses has called for a particular intervention fund to enable the Nigeria Security and Civil Defence Corps (NSCDC) and Nigeria Customs Service (NCS) to perform optimally.\nAlhasan Ado Doguwa, said this on Tuesday during a special session/hearing on the Use of Special Intervention Funds to Combat crude oil theft in the country.\nThe chairman promised to ensure that the NSCDC is fully involved in the war against oil theft and losses in Nigeria.\nThe Commandant General of NSCDC, Ahmed Audi, said the Corps‘ core mandate is to protect critical national assets and infrastructure across the Country.\nRepresented by his deputy, Philip Ayuba, the Commandant General also said the corps has been unable to fully access the special intervention fund from any agencies to carry out its mandates."}, {"id": "00fae07b-8888-42bd-bfd6-62ae6a64f5fd", "title": " [ DECODED ] From  slut to  security risk : Gendered disinfo isnt just a problem for women", "date": "2024-08-14 09:30", "url": "https://www.rappler.com/technology/decoded-gendered-disinformation-not-just-problem-women/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "After all, most of Rappler’s journalists were women, so there wasn’t much for me to compare.\nNerve’s research in other markets around the world show signs of democratic backsliding in the form of gendered disinformation.\nForensics researcher Gaby Baizas also explored gendered disinformation in Moldova, where it’s used as a geopolitical warfare tactic.\nThere’s still a lot to untangle on gendered disinformation, but what we’re seeing so far is a global phenomenon that transcends borders and societal contexts.\nAs we continue to uncover the layers of this problem, it becomes increasingly clear that combating gendered disinformation requires a collective effort."}, {"id": "eb4ba58b-aa4b-4679-b0fa-345cef05fd55", "title": "Ukraine claims more advances as troops press on incursion into Russia - National", "date": "2024-08-14 13:15", "url": "https://globalnews.ca/news/10697944/ukraine-cross-border-incursion-russia/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Also, Ukrainian troops on Wednesday took more than 100 Russian soldiers prisoner, Syrskyi said.\nUkraine’s General Staff added that troops deployed in Kursk destroyed a Russian Su-34 jet used to launch devastating glide bombs at Ukrainian front-line positions and cities.\nThe daring Kursk operation is the largest attack on Russia since World War II and could involve as many as 10,000 Ukrainian troops backed by armor and artillery, military analysts say.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\n2:06 Russia-Ukraine: Zelenskyy confirms Ukrainian troops pushing into Russian territoryRussia’s Ministry of Defense said Wednesday it destroyed 117 Ukrainian drones and four missiles over eight of its regions overnight."}, {"id": "297041ec-216b-4f0c-afc9-14600ec52bd9", "title": "Ukraine claims prisoners taken as it continues incursion into Russia", "date": "2024-08-14 13:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/14/ukraine-claims-prisoners-taken-as-it-continues-incursion-into-russia/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Ukrainian forces pushed on with their major cross-border incursion into Russia’s Kursk region for a second week on Wednesday, claiming to have taken more ground, captured more Russian prisoners and destroyed a jet bomber.\nAlso, Ukrainian troops on Wednesday took more than 100 Russian soldiers prisoner, he said.\nThe goal is to stop Russia from firing missiles into Ukraine from Kursk, he said.\nIt was not clear how or when, or whether, Ukraine would attempt to extricate itself from the ground it has taken.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "69c73075-a049-4a3f-8355-ffa67e47b5b7", "title": "Walz says he  damn proud  of military service record amid GOP attacks - Boston News , Weather , Sports", "date": "2024-08-14 14:15", "url": "https://whdh.com/news/walz-says-hes-damn-proud-of-military-service-record-amid-gop-attacks/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(CNN) — Minnesota Gov.\nTim Walz, the Democratic vice presidential nominee, defended his military record during remarks in Los Angeles on Tuesday, saying he is “damn proud” of his service in the Army National Guard.\n“I’m going to say it again as clearly as I can: I am damn proud of my service to this country, and I firmly believe you should never denigrate another person’s service record,” he said.\nHe retired in May 2005, according to the Minnesota National Guard.\nWalz has had to fend off accusations of embellishing his military service record before."}, {"id": "79b735b1-13f7-474f-b4a6-d7fbb3ea2a5a", "title": "Now RUSSIA is afraid : State of emergency is declared across entire state of Belgorod as Ukraine surprise attack continues with huge overnight drone attack , putting Putin on the back foot", "date": "2024-08-14 08:45", "url": "https://www.dailymail.co.uk/news/article-13741761/State-emergency-declared-Russia-Belgorod-Ukraines-surprise-attack-continues.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "'The situation in our Belgorod region remains extremely difficult and tense due to shellings from the Ukrainian Armed Forces.\nClose to 200,000 Russians are now said to have evacuated their homes amid the ongoing Ukrainian ground offensive in Kursk along with artillery and drone attacks in Belgorod.\nRussia had been advancing since the failure of Ukraine's 2023 counteroffensive to make any major gains against Moscow's forces.\n'The extent to which the Ukrainian offensive in Kursk will last depends heavily on the forces that Russia is willing to commit to retaking its own territory.\nHis comments regarding Ukraine's alleged indiscriminate strikes on civilians and civilian infrastructure will undoubtedly be ridiculed in Kyiv and the West."}, {"id": "59bb0b44-be54-4ac7-9f4c-a7c0820f4bb1", "title": "Veterans Will Not Be Fooled By Tim Walz", "date": "2024-08-14 00:30", "url": "https://www.frontpagemag.com/veterans-will-not-be-fooled-by-tim-walz/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "But vets know what they see when they look at this guy and it’s not good.\nHe was a senior noncommissioned officer—a high-ranking sergeant who was frocked as a command sergeant major.\nYou need to understand what a command sergeant major is.\nHe wasn’t an actual command sergeant major either, only holding the rank temporarily contingent on passing the Sergeant Majors Academy course.\nThe command sergeant major is supposed to take care of them."}, {"id": "0ee9f0eb-401c-49d3-ae14-3c6a86fb6246", "title": "India NAL Unveils  Desi Shahed 136  Type loitering munition – Indian Defence Research Wing", "date": "2024-08-14 06:15", "url": "https://idrw.org/indias-nal-unveils-desi-shahed-136-type-loitering-munition/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "India’s NAL Unveils “Desi Shahed 136” Type loitering munition| BySOURCE: AFIIndia’s state-owned National Aerospace Laboratories (NAL) has recently unveiled an indigenous kamikaze drone, a significant advancement in the country’s defense technology.\nThe kamikaze drone, a crucial addition to India’s unmanned aerial capabilities, measures approximately 2.8 meters in length with a wingspan of 3.5 meters.\nOne of the standout features of this indigenous drone is its ability to operate effectively in GPS-denied environments, a vital capability for modern warfare.\nThis development marks a significant step forward in India’s efforts to bolster its self-reliance in defense technology.\nThe indigenous kamikaze drone not only showcases NAL’s engineering prowess but also contributes to the nation’s strategic capabilities, aligning with the broader goal of enhancing indigenous defense manufacturing."}, {"id": "00fadeb8-d3a3-4672-b95b-8919e3049556", "title": "China Is in Denial About the War in Ukraine", "date": "2024-08-14 01:15", "url": "https://www.foreignaffairs.com/china/china-denial-about-war-ukraine-jude-blanchette", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "China has, in fact, incurred costs as a result of Putin’s war and Beijing’s economic and diplomatic support for it.\nThese blind spots matter because in China, the war in Ukraine is serving as both an observatory and a laboratory as the country prepares for heightened geopolitical conflict with the United States.\nThat effort offered a “vivid demonstration of the tools of economic power” that the United States could muster, Li wrote.\nAlthough Western sanctions have not broken the Russian economy, the war in Ukraine has spurred further global economic fragmentation.\nRussia’s war on Ukraine offers general lessons about the complexities of modern warfare, the possibilities for an international response to a purportedly regional dispute, and the costs of a protracted military conflict."}, {"id": "9b7b1b68-9712-4cb3-bd3e-c7d222b344d9", "title": "Ukraine General Staff urges Ukrainians and foreigners to avoid unauthorised access to combat zones", "date": "2024-08-14 13:45", "url": "https://www.yahoo.com/news/ukraines-general-staff-urges-ukrainians-121135709.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The General Staff of the Armed Forces of Ukraine has urged Ukrainians and foreigners to follow movement regulations in combat areas due to cases of unauthorised access to these areas.\nSource: General Staff of the social mediaDetails: The General Staff of the Armed Forces of Ukraine reports that despite the security measures implemented by the military command to achieve operational objectives and protect the lives and health of both military personnel and civilians, there are cases of unauthorised access by individuals to combat areas.\nIt is emphasised that this could negatively impact the safety measures for military operations, thereby creating an additional threat to the lives of Ukrainian soldiers and civilians alike.\nQuote: \"We urge Ukrainian citizens and foreigners to adhere to the established rules for movement in combat areas, including the twenty-kilometre border zone of Sumy Oblast.\"\nSupport UP or become our patron!"}, {"id": "b50bfd88-2d27-4637-90d9-773c5d73b95e", "title": "Russia says it thwarted expanding Ukrainian charge", "date": "2024-08-14 02:45", "url": "https://www.stltoday.com/news/nation-world/russia-ukraine-war-kursk/article_06804d2f-2f99-5d52-87b1-261c962a2d5a.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Russia said Tuesday its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesman said Kyiv has no intention of occupying Russian territory.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region were a closely guarded military secret."}, {"id": "63cc7e9c-9365-4286-ac75-e4dcc9b7775d", "title": "Ukraine deals blow to Putin narrative with Kursk offensive", "date": "2024-08-14 00:30", "url": "https://www.yahoo.com/news/ukraine-deals-blow-putin-narrative-205800553.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces are struggling to beat back Ukrainian troops who are now digging into the territory they grabbed in a widely praised counteroffensive.\nThough the country lowered the draft age earlier this year, it will take time to replenish troops, and that could impact Ukraine’s ability to hold territory in Kursk.\nKursk borders the northeastern Ukrainian region of Sumy, which neighbors Ukraine’s Kharkiv province, where Russian forces are still trying to advance.\n“Unlike Russia, Ukraine doesn’t need something that belongs to someone else,” he said in remarks shared by state-run media.\nAnd we will find another weak point in [the] Russian border, and will attack.”Copyright 2024 Nexstar Media, Inc. All rights reserved."}, {"id": "b3ce61c6-a5e5-4bf1-b1cd-a8bfe833a7de", "title": "When fighter jets took over Coimbatore skyline | Coimbatore News", "date": "2024-08-14 11:30", "url": "https://timesofindia.indiatimes.com/city/coimbatore/when-fighter-jets-took-over-coimbatore-skyline/articleshow/112520688.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "COIMBATORE: India's indigenous light combat aircraft Tejas Mk1 dominated the Coimbatore skyline with goosebump-inducing manoeuvres on Tuesday.According to officials, Tejas Mk1, which was operated at 120 knots for landing, performed well in the first phase of Tarang Shakti, the first and largest multinational air exercise held on Indian soil after a gap of six decades.Tejas was joined by European multirole fighter aircraft Eurofighter Typhoon to showcase its stealth power in the sky.The pilots of the two fighter jets performed multiroling in the sky, even as Tamil Nadu governor R N Ravi and bureaucrats watched the exercise in awe at the Sulur air force station in the morning.The occasion was the final day of the exercise that started at the Sulur air force station on Aug 6 with the participation of air forces from India, France, Spain, Germany and the UK.Besides Tejas Mk-1 and Eurofighter Typhoons, Rafales, Su-30MKI, A400 Military Transport Aircraft and Airbus A330 Multi Role Tanker Transport took part in the exercise.Added attractions were the performances by the aerobatic air display team of IAF with Hindustan Aeronautics Limited (HAL)'s Sarang, HAL's light utility helicopter, Prachand light combat helicopter and the Hindustan Turbo Trainer flight.IAF Air Chief Marshal V R Chaudhari said, \"The size of our light combat aircraft Tejas Mk1 does not matter.\nThe aircraft proved its capabilities in realistic combat settings.\nThis was the first time the Mk1 took part in a large force engagement with other aircraft.\nWe are proud of its performance.\""}, {"id": "4189b905-e9aa-4bfa-9053-e5656d700381", "title": "Is the West finally seeing through Hamas lies ? ", "date": "2024-08-14 08:45", "url": "https://www.spectator.co.uk/article/is-the-west-finally-seeing-through-hamass-lies/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "On Saturday, when Israel attacked the al-Taba’een Hamas command centre in Gaza City, jihadi propagandists swung into action straight away.\n‘Nearly 100 killed in Israeli strike on school, Gaza officials say,’ blared the Washington Post, a typical example.\nAside from treating Hamas’s numbers with well-deserved scepticism, Israel has not offered a definitive answer on the numbers of civilians killed.\nIn the past, Hamas’s strategy for manipulating the media, and consequently world opinion, has worked shamefully well.\nThe Gaza activists, whose marches were once a disturbing fixture of city life across the west, ignored the al-Taba’een attack."}, {"id": "b1309963-ae84-4acd-91aa-9579f716abd3", "title": "Emergency declared in Russian border region Belgorod as Ukraine attacks intensify", "date": "2024-08-14 06:30", "url": "https://news.sky.com/story/emergency-declared-in-russian-border-region-belgorod-as-ukraine-attacks-intensify-13196728", "domain": "news.sky.com", "domain_classification": "International", "message": "Follow the latest updates on the Russia-Ukraine warPlease use Chrome browser for a more accessible video player 3:44 How long can Ukraine hold Kursk?\nUkraine's state television showed Ukrainian troops pulling down a Russian flag from an official building in Sudzha, a transhipment hub for Russian natural gas flowing to Europe via Ukraine.\nUkraine blindsided Moscow when it poured thousands of troops into Kursk last week, rapidly gaining ground as it launched the biggest invasion of Russian territory since the Second World War.\nThe United States says it had \"nothing to do\" with the surprise invasion of Russian territory.\nA \"generous\" peace offer made by Russia to Ukraine in June is \"no longer on the table\", said Dmitry Polyanskiy, Russia's deputy envoy to the UN."}, {"id": "69abcb63-2a1f-4bcc-9342-0b9bd9d1cef8", "title": "South Korea spy satellite to start  full - fledged  mission", "date": "2024-08-14 09:00", "url": "https://www.bssnews.net/news/203831", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "SEOUL, Aug 14, 2024 (BSS/AFP) - South Korea's first home-grown military spy satellite is ready to begin its \"full-fledged\" mission of monitoring the North, Seoul's arms procurement agency said Wednesday.\nThe satellite, launched from the Vandenberg Space Force Base in California in December last year, is part of an intensifying space race on the Korean peninsula.\nSince its launch, South Korea's reconnaisance satellite has undergone operational tests in space and this week had its \"combat suitability\" approved by the defense ministry.\nNuclear-armed North Korea's November satellite launch, which Seoul claims was aided by Moscow in exchange for supplying weapons for Russia's war in Ukraine, drew international condemnation.\n\"We will strive to maximise the capabilities of our independent surveillance and reconnaissance assets to maintain an overwhelming advantage over the North Korean satellite,\" the agency said."}, {"id": "e9b7285f-f731-43e6-bee8-e22970aabbb9", "title": "Charges dropped against pro - Palestinian campaigner for  direct action  in Belfast supermarket – The Irish News", "date": "2024-08-14 08:15", "url": "https://www.irishnews.com/news/northern-ireland/charges-dropped-against-pro-palestinian-campaigner-for-direct-action-in-belfast-supermarket-AS2QDXHEWRFTNMAIIHZOKPQMUY/", "domain": "irishnews.com", "domain_classification": "Unknown", "message": "A pro-Palestinian protester, against whom charges were dropped, says he was prepared to “battle this in court” in order to highlight the plight of Palestinians.\nEoin Rua Davey was arrested after Boycott, Divestment, Sanctions (BDS) Belfast held a protest at a Sainsbury’s branch at the Kennedy Centre in west Belfast on July 14.\nThe BDS campaign encourages the international community to turn its back on Israel because of its treatment of Palestinians.\nCharges against Mr Davey were withdrawn by the Public Prosecution Service at a hearing at Belfast magistrates Court on Tuesday.\nMr Davey said the BDS Belfast branch carries out 40-50 “direct actions a week” and believes the charges he faced were designed to “force us out of the stores”."}]