[{"id": "6b5e6e21-3f00-4e77-8e99-27e94fd87a88", "title": "Antisemitism can easily become a slippery slope and lead to violence", "date": "2024-06-06 00:00", "url": "https://www.jpost.com/opinion/article-805109", "message": "It’s crucial to use the term “racism” because we understand all too well how rhetoric leads to violence in that context.\nThis is how violence and murder begin – with inflammatory rhetoric that escalates into physical harm.\nThis indiscriminate targeting underscores the horrific nature of the calls for violence emanating from university campuses and other pro-Hamas protests.\nThe path from hateful rhetoric to violence is short and well-trodden.\nPrior to Aish, he was eastern director of the Simon Wiesenthal Center where he oversaw the Museum of Tolerance in New York City and contributed to the center’s fight against antisemitism."}, {"id": "3f114e5e-2ac1-467e-812b-7eb859e5081c", "title": "Vandals kick in glass door at USC Chabad House – Daily News", "date": "2024-06-06 01:15", "url": "https://www.dailynews.com/2024/06/05/vandals-kick-in-glass-door-at-uscs-chabad-house/", "message": "An investigation was continuing Wednesday into the vandalism of a glass door at the Chabad House at USC, but police said they do not believe the damage rises to the level of a hate crime.\nAccording to the Los Angeles Police Department, officers from the USC Department of Public Safety responded to the house on the 2700 block of Severance Street around 9:15 p.m. Tuesday.\nLast night the Chabad at @USC was vandalized and individuals shattered glass at the Chabad House, @jewsc.\n“Today, the Chabad House at USC was vandalized.\n“The event only further highlights the rising antisemitism on US college campuses.”No further information about the suspects was immediately released."}, {"id": "00d400e4-519f-4417-855f-1cddc5cb5e48", "title": "USC Chabad House Vandalized ; Police : Not a Hate Crime", "date": "2024-06-06 01:30", "url": "https://mynewsla.com/crime/2024/06/05/vandals-damage-front-door-at-uscs-chabad-house-2/", "message": "An investigation was continuing Wednesday into the vandalism of a glass door at the Chabad House at USC, but police said they do not believe the damage rises to the level of a hate crime.\n“LAPD Southwest Detectives responded to the location and gook a vandalism report.\nBased on preliminary information, this incident did not rise to the level of a hate crime.”Chabad House officials posted surveillance video of the crime on X.\n“Today, the Chabad House at USC was vandalized.\nAccording to police, the USC DPS and LAPD Southwest Area University Park Special Problems Unit is increasing patrols in the area while the investigation continues."}, {"id": "390488b1-e9ad-4280-8053-a8bf474cdbe0", "title": "Natan Sharansky talks unity , October 7 , anti - Zionism , Netanyahu - Israel News", "date": "2024-06-06 11:45", "url": "https://www.jpost.com/israel-news/article-805190", "message": "Not many people alive today have done as much for human freedom and the Jewish people as has Natan Sharansky.\nFollowing massive public campaigns by the State of Israel, world Jewry and leaders of the free world, Sharansky was released in 1986, and emigrated to Israel, on the very day of his release.\nSharansky also received the Congressional Medal of Honor in 1986 and the Presidential Medal of Freedom in 2006.\nClearly, there is almost nothing in the Jewish world and in Israel that Sharansky has not been involved with, in one way or another, in the course of his life.\nWe are part of the free world, yet still insist on maintaining our identity as a Jewish state.\""}]