[{"id": "3a3cb628-a559-4e07-8c78-ec9f9676630d", "title": "Israel and Hezbollah step back from war , but for how long ? All eyes are now on Iran next move", "date": "2024-08-27 02:30", "url": "https://theconversation.com/israel-and-hezbollah-step-back-from-war-but-for-how-long-all-eyes-are-now-on-irans-next-move-237463", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "How both sides are seeing thingsClearly, both Israel and Hezbollah have stepped back at this stage from any further action.\nAt the same time, Hezbollah retaliated by sending a large number of Katyusha rockets into northern Israel.\nIn addition, about 60,000 Israelis have had to evacuate their homes in northern Israel and are living in temporary accommodation due to the Hezbollah threat.\nIsrael’s military has now been been fighting Hamas in Gaza, and to some extent, protecting northern Israel from Hezbollah attacks for nearly 11 months.\nTo do that, he must re-establish the confidence of those who live in northern Israel and stop the attacks from Hezbollah."}, {"id": "6c7faac3-3798-42d5-83d2-8d4b63784599", "title": "Hezbollah Mocked After Attack Hits Israeli Chicken Coop", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/politics/2024/08/25/hezbollah-mocked-after-attack-on-israeli-chicken-coop/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "As Breitbart News reported, Israel launched a preemptive strike on thousands of Hezbollah rocket launchers early Sunday morning after concluding that Hezbollah was about to launch hundreds of rockets, including Tel Aviv among its targets.\nHezbollah leader Hassan Nasrallah said that the attack was meant to be a retaliation for Israel’s killing of second-in-command, Fuad Shukr, in Beirut last month.\nHezbollah also claimed that Israel had not preempted anything — which also confirmed Israel’s suspicions that an attack had been imminent.\nWith 100 Israeli aircraft participating in the mission, a significant portion of the Hezbollah rockets were prevented from being launched, and Israel’s missile defense system took care of the rest.\nA rocket fired from Lebanon in this morning’s Hezbollah attack struck a chicken coop in the Western Galilee community of Manot."}, {"id": "29c2e3d4-6ed7-4ce3-b2ac-bbabec1bccbe", "title": "Russia targets Ukraine energy sector in one of worst assaults to date", "date": "2024-08-27 01:15", "url": "https://www.yahoo.com/news/russia-targets-ukraine-energy-sector-001125763.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia targets Ukraine energy sector in one of worst assaults to dateAn elderly woman stands outside a house after the owner was killed by the Russian missile attack.\nAccording to the report, there was a fire in the turbine room of the hydroelectric power station.\nIAEA chief to visit Russia's Kursk nuclear power plantThe head of the UN's nuclear watchdog said he will lead a team visiting the the Kursk nuclear power plant in western Russia on Tuesday.\n\"The safety and security of all nuclear power plants is of central and fundamental concern to the IAEA.\"\nThe nuclear power plant is located on the Seym river near the town of Kurchatov."}, {"id": "290bcc31-208a-4a2b-a52c-6327ea41a212", "title": "", "date": "2024-08-27 03:15", "url": "https://www.israelnationalnews.com/news/395221", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The chairman of the Joint Chiefs of Staff, General Charles Brown, told Reuters on Monday that the near-term risk of a broader war in the Middle East has eased somewhat after Israel and Hezbollah exchanged fire without further escalation, but Iran still poses a significant danger as it weighs a strike on Israel.\nBrown noted Hezbollah's strike was just one of two major threatened attacks against Israel that emerged in recent weeks.\nIran is also threatening an attack over the elimination of Hamas political bureau leader Ismail Haniyeh in Tehran last month, which Israel has not commented on.\n\"And do these others actually go off and do things on their own because they're not satisfied - the Houthis in particular,\" Brown told Reuters.\nWhite House National Security Council spokesman John Kirby recently told CNN that US intelligence indicates that Iran has not backed down from its threat to attack Israel."}, {"id": "b2241c46-c2ee-4d03-90de-80c13dbcde10", "title": "", "date": "2024-08-27 03:30", "url": "http://www.israelnationalnews.com/news/395221", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The chairman of the Joint Chiefs of Staff, General Charles Brown, told Reuters on Monday that the near-term risk of a broader war in the Middle East has eased somewhat after Israel and Hezbollah exchanged fire without further escalation, but Iran still poses a significant danger as it weighs a strike on Israel.\nBrown noted Hezbollah's strike was just one of two major threatened attacks against Israel that emerged in recent weeks.\nIran is also threatening an attack over the elimination of Hamas political bureau leader Ismail Haniyeh in Tehran last month, which Israel has not commented on.\n\"And do these others actually go off and do things on their own because they're not satisfied - the Houthis in particular,\" Brown told Reuters.\nWhite House National Security Council spokesman John Kirby recently told CNN that US intelligence indicates that Iran has not backed down from its threat to attack Israel."}, {"id": "e2ae2a8a-31b3-4f09-a140-90ef1c1ef57e", "title": "Russia Launches Missile , Drone Attack On Ukrainian Energy Facilities", "date": "2024-08-27 00:15", "url": "https://www.ndtv.com/world-news/russia-launches-missile-drone-attack-on-ukrainian-energy-facilities-6425077", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Ukrainians had been expecting a major Russian missile attack for some time.\nRussian military launched a massive strike on Ukraine's critical energy infrastructure facilities, the Russian Defence Ministry said.\nZelensky said the attack had caused extensive damage to the energy sector, but facilities are currently being restored.\nAccording to the Ukrainian Air Force, Russia fired at Ukraine several groups of combat drones and cruise missiles.\nThe US Embassy issued a warning last week of an elevated risk of attack around Ukrainian Independence Day, which Ukraine marked on Saturday."}, {"id": "2da40a19-1387-4d1a-b867-aa056942534e", "title": "Israel still faces threat of attack by Iran , proxies , Pentagon says", "date": "2024-08-27 04:30", "url": "https://www.moneycontrol.com/news/world/israel-still-faces-threat-of-attack-by-iran-proxies-pentagon-says-12807522.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:Israel still faces threat of attack by Iran, proxies, Pentagon says"}, {"id": "238cbdfc-fb19-449f-978d-6cee5f4b85d0", "title": "IDF : 90 % of Hezbollah Rockets Fired from Civilian Areas in Lebanon", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/politics/2024/08/26/idf-90-of-hezbollah-rockets-fired-from-civilian-areas-lebanon/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "The Israel Defense Forces (IDF) said Monday that 90% of the Hezbollah rockets that were intercepted Sunday were fired from civilian areas in southern Lebanon, a further violation of international law by the Iran-backed terror group.\nIn a statement, the IDF said:Early Sunday morning, following the detection of preparations by Hezbollah to launch missiles and rockets aimed toward the north and the center of the State of Israel, the IDF struck Hezbollah targets that posed an immediate threat.\nThe Hezbollah terrorist organization places its terrorist infrastructure in the middle of the civilian population while using Lebanese civilians as human shields.\n90% of the launches were from the heart of a civilian area, near civilian facilities such as mosques, schools, UN sites, etc.\nHezbollah’s very presence in southern Lebanon is a violation of United Nations Security Council Resolution 1701 of 2006, which requires southern Lebanon to be demilitarized."}, {"id": "3011fc51-a6b0-46c3-be71-b2c0ab460fed", "title": "Russia Ukraine War : Russia targets Ukraine cities , infrastructure in  largest air attack since war began  ", "date": "2024-08-27 03:30", "url": "https://www.9news.com.au/national/russia-targets-cities-and-infrastructure-in-largest-air-attack-since-war-began-ukraine-says/8e192309-a1ed-4220-afea-264d4b52872e", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Russia launched a \"massive\" missile and drone attack aimed at energy infrastructure across Ukraine overnight into Monday, marking the biggest air attack since the war began, Ukrainian officials said.\nThe attack, which killed at least seven people and caused power outages in several cities, marks Russia's \"most massive air attack\" in more than two-and-a-half years of conflict, according to Ukrainian Air Force Commander Mykola Oleshchuk.\nThroughout the war, Russia has repeatedly targeted Ukraine's energy infrastructure, attempting to plunge its citizens into darkness and use freezing winter temperatures as a weapon of war.\nAfter Monday's attack, Ukraine's Energy Minister Herman Halushchenko said \"the energy sector is in the crosshairs\" and the extent of the damage was being investigated.\nMeanwhile, in Ukraine, Russian ground forces are inching toward the key eastern city of Pokrovsk, which could become the next major battleground of the war."}, {"id": "19f2f98f-de08-42a5-95ae-f273a2e4fbec", "title": "Hezbollah attacks Israeli site with suicide drone", "date": "2024-08-27 04:30", "url": "https://www.prokerala.com/news/articles/a1559209.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, Aug 27 : Hezbollah has claimed that it targeted Israeli \"spy equipment\" at the Ramyah site in northern Israel with a suicide drone, achieving a direct hit.\nMilitary sources in Lebanon, speaking anonymously, told Xinhua that Israeli drones and warplanes carried out 12 airstrikes on border towns and villages in southern Lebanon on Monday.\nThey added that an Israeli drone fired two air-to-ground missiles at a vehicle travelling on the main road in the Abra area, setting the car on fire.\nIsraeli artillery shelled 16 border towns in southern Lebanon, destroying 11 homes and damaging around 24 others, with no casualties reported.\nIn response, Israel reported conducting numerous pre-emptive airstrikes targeting Hezbollah's rocket launchers in southern Lebanon."}, {"id": "26fab94f-04cc-4dec-9c62-aed01ec59894", "title": "Missile russo su hotel a Kryvyi Rih , due morti e 5 dispersi", "date": "2024-08-27 03:30", "url": "https://www.giornaledibrescia.it/italia-e-estero/missile-russo-su-hotel-a-kryvyi-rih-due-morti-e-5-dispersi-us61ewrn", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "ROMA, 27 AGO - E' di due morti, quattro feriti e cinque dispersi il bilancio di un attacco russo sulla cittadina di Kryvyi Rih, città nell'oblast di Dnipropetrovsk, nell'est dell'Ucraina.\nUn missile - secondo quanto ha riferito il capo dell'amministrazione militare della città, Oleksandr Vilkul - ha colpito un hotel.\nI feriti sono stati trasportati in ospedale.\n\"L'operazione di salvataggio è in corso.\nTutti i servizi di emergenza, comunali e medici stanno operando\" ha scritto su Telegram Yevhen Sytnychenko, capo dell'amministrazione militare distrettuale."}, {"id": "e34fc69e-bcc2-4291-a60d-7c112c2e5191", "title": "Ukraine touts threat of new long - range  Palianytsia  weapon in war with Russia", "date": "2024-08-27 03:45", "url": "https://www.cbc.ca/news/world/urkaine-palianytsia-long-range-weapon-1.7305701", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "On Monday, a wave of Russian missiles and drones targeted Ukraine's electrical infrastructure in the largest such attack in weeks.\nA Ukrainian military video hinted that its range is up to 700 kilometres — on par with the U.S.-supplied ATACMS.\nThe United States and other Western allies provide long-range weapons to Ukraine but restrict it from launching them deep into Russia for fear of escalating the war.\nWATCH | Major missile-and-drone attack on Ukraine: Russia unleashes large-scale drone, missile attack on Ukraine Duration 4:03 Russia launched more than 100 missiles and around 100 attack drones at Ukraine during the morning rush hour on Monday, killing at least five people, officials said.\nUkraine says its inability to fight back against Russian long-range weapons has deadly consequences."}, {"id": "c27f8156-ff61-4349-8ccc-dabe02af91ff", "title": "Seven killed in  most massive  Russian air attack , Ukraine says", "date": "2024-08-27 00:15", "url": "https://www.aol.com/three-killed-huge-russian-attack-092016414.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "At least seven people were killed and dozens wounded as missiles and drones were fired into more than half of Ukraine's regions on Monday.\nPower infrastructure was hit, causing widespread blackouts, as the entire country was put under air raid alert and told to take shelter.\nAccording to Mykola Oleshchuk, the commander of Ukraine's air force, Russia launched 127 missiles and 109 attack drones overnight and into Monday morning.\nPreviously, an attack last December when 158 missiles and drones were fired at Ukraine, had been considered the largest attack so far.\nAnd he said \"we could do much more to protect lives\" if European air forces worked with Ukraine's air defence."}, {"id": "139132de-83be-4497-b9b1-d49711599276", "title": "Trump says he would create a Space National Guard and build an  Iron Dome  missile shield around the US", "date": "2024-08-27 02:30", "url": "https://www.yahoo.com/news/trump-says-create-space-national-002946398.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump says he would create a Space National Guard and build an ‘Iron Dome’ missile shield around the USTrump says he would create a Space National Guard and build an ‘Iron Dome’ missile shield around the USFormer President Trump said he would create a national guard for the Space Force and build an “Iron Dome” in the U.S. as he laid out his military plans during a Monday address.\n“One of my proudest achievements in my first term was to create Space Force, the first new branch of the armed forces in over 70 years; it’s a big deal,” he said.\n“So as president, I will sign historic legislation creating a Space National Guard,” he continued.\nThe proposal, which would have impacted about 1,000 Air National Guard members, drew sharp criticism from nearly every U.S. governor and dozens of lawmakers.\n“And we’re going to build a great Iron Dome for missile defense around our nation."}, {"id": "68b1e5eb-7630-4e6f-92d9-4e59e874b712", "title": "Trump says he would create a Space National Guard and build an  Iron Dome  missile shield around the US", "date": "2024-08-27 03:30", "url": "https://www.aol.com/trump-says-create-space-national-002946717.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Former President Trump said he would create a national guard for the Space Force and build an “Iron Dome” in the U.S. as he laid out his military plans during a Monday address.\n“One of my proudest achievements in my first term was to create Space Force, the first new branch of the armed forces in over 70 years; it’s a big deal,” he said.\n“So as president, I will sign historic legislation creating a Space National Guard,” he continued.\nThe proposal, which would have impacted about 1,000 Air National Guard members, drew sharp criticism from nearly every U.S. governor and dozens of lawmakers.\n“And we’re going to build a great Iron Dome for missile defense around our nation."}, {"id": "5f996396-aadc-455c-be3a-5b4853ade3c6", "title": "", "date": "2024-08-27 03:30", "url": "http://www.israelnationalnews.com/news/395220", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Iran on Monday praised the drone and missile assault by Hezbollah on Israel, even though Israel made clear that the attack had failed, AFP reported.\nHezbollah leader Hassan Nasrallah on Sunday claimed that the group had launched a large-scale attack on Israel, targeting \"the Glilot base - the main Israeli military intelligence base\".\nIDF Spokesperson Daniel Hagari later made clear , however, that Israel’s preemptive strike prevented a major attack on Israel by Hezbollah.\n\"This morning, we thwarted a large-scale attack by the Hezbollah terrorist organization targeting northern communities and locations in central Israel.\nKanani noted that the Hezbollah attack \"extended deep into the occupied territories\", and said the \"strategic balance has undergone fundamental changes\" to the detriment of Israel."}, {"id": "1ae3c737-b8e8-440d-a5d4-e73a80ccb926", "title": "Israel still faces threat of attack by Iran , proxies , Pentagon says", "date": "2024-08-27 02:45", "url": "https://www.deccanherald.com/world/israel-still-faces-threat-of-attack-by-iran-proxies-pentagon-says-3165397", "domain": "deccanherald.com", "domain_classification": "Unknown", "message": "Washington: The United States continues to assess that the threat of attack against Israel by Iran and its proxy groups still exists, the Pentagon said on Monday, after Hezbollah launched hundreds of rockets and drones at Israel in retaliation for the killing of a senior Hezbollah commander.\n\"I would point you to some of the public comments that have been made by Iranian leaders and others ... we continue to assess that there is a threat of attack,\" Pentagon spokesperson Air Force Major General Patrick Ryder told reporters."}, {"id": "b9d40f9d-ff4f-4254-bb74-4af95438ee8e", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 03:00", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122832.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls."}, {"id": "795ea775-89af-461d-81b8-f0df10cf9134", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 02:30", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122532.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls."}, {"id": "1ebe50e5-8b76-4e8d-afbc-119dc6dfa8f4", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 02:45", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122110.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls."}, {"id": "8541a96a-cbfa-4fe6-817c-1c2183a8f542", "title": "Is Ukraine new Palianytsia missile the answer to Russian dominance ? ", "date": "2024-08-27 02:30", "url": "https://economictimes.indiatimes.com/news/defence/is-ukraines-new-palianytsia-missile-the-answer-to-russian-dominance/articleshow/112821355.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "The Palianytsia was created due to urgent necessity, Ukrainian officials said, as Russia has dominated the skies since the outbreak of the war in February 2022 and Ukraine's Western allies have placed conditions on use of their long-range missiles in Russia.\nOn Monday, a wave of Russian missiles and drones targeted Ukraine's electrical infrastructure in the largest such attack in weeks.\n\"This once again proves that for victory, we need long-range capabilities and the lifting of restrictions on strikes on the enemy's military facilities.\n\"A Ukrainian military video hinted that its range is up to 700 kilometers (430 miles) - on par with the US-supplied ATACMS.\nThe missile has a solid-fuel booster that accelerates it, followed by a jet engine, the specialist said.Ukraine says its inability to fight back against Russian long-range weapons has deadly consequences."}, {"id": "d8232c5a-41e2-4875-ad88-4f06dd405239", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 00:45", "url": "https://www.pressherald.com/2024/08/26/ukraine-counts-on-new-long-range-weapon-to-bypass-western-restrictions-and-hit-deep-into-russia/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine says it has a new long-range weapon to strike deep into Russia without asking permission from allies – a homegrown combination of missile and drone that the defense minister vowed Monday would provide “answers” to a wave of Russian bombings.\nOn Monday, a wave of Russian missiles and drones targeted Ukraine’s electrical infrastructure in the largest such attack in weeks.\nDefense Minister Rustem Umerov promised Monday the weapon would be used again soon in response to the overnight attack on Ukraine.\nThe United States and other Western allies provide long-range weapons to Ukraine but restrict it from launching them deep into Russia for fear of escalating the war.\nUkraine says its inability to fight back against Russian long-range weapons has deadly consequences."}, {"id": "48736e4a-da62-4844-b178-f8402fae0247", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 03:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/27/fgn8-russia-ukraine-missiles.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "On Monday, a wave of Russian missiles and drones targeted Ukraine's electrical infrastructure in the largest such attack in weeks.\nDefense Minister Rustem Umerov promised Monday the weapon would be used again soon in response to the overnight attack on Ukraine.\nThe United States and other Western allies provide long-range weapons to Ukraine but restrict it from launching them deep into Russia for fear of escalating the war.\nUkraine says its inability to fight back against Russian long-range weapons has deadly consequences.\nUkraine's Commander-in-Chief Gen. Oleksandr Syrskyi said Russia has launched 9,627 long-range missiles and Ukraine's defense shot down only a quarter of them, and that more than half the Russian targets were civilian."}, {"id": "d467d42e-c53e-42cb-9f92-33761563412f", "title": "Israel Used US Arms to Commit at Least 20 Likely War Crimes Since October 7", "date": "2024-08-27 00:00", "url": "https://truthout.org/articles/israel-used-us-arms-to-commit-at-least-20-likely-war-crimes-since-october-7/", "domain": "truthout.org", "domain_classification": "Unknown", "message": "The Biden administration says very little about the weapons it delivers to Israel or how the Israeli military uses them.\nIn doing so, it helps explain why the Biden administration prefers to arm Israel in secret.\nSix weeks into the war, Israel had dropped 2,000-pound bombs in areas to which it had instructed civilians to flee more than 200 times.\nOn August 13, the Biden administration notified Congress that it approved a $774 million arms sale to Israel for 32,739 120mm tank cartridges.\nThis total includes thousands of 155mm rounds originally for Ukraine that the Biden administration diverted to Israel in October."}, {"id": "049905fe-7415-49c2-b9de-032018c97a6b", "title": "Hospital in Gaza empties out as Israeli forces draw near", "date": "2024-08-27 04:15", "url": "https://www.stltoday.com/news/nation-world/hospital-in-gaza-empties-out/article_2fb4f11f-ca00-5429-9578-fb5bf0d230a3.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The Al-Aqsa Martyrs Hospital in Deir al-Balah is the main hospital serving central Gaza.\nThe Israeli military did not order its evacuation, but patients and people sheltering there fear it could be engulfed in fighting or become the target of a raid.\nIsraeli forces invaded several hospitals in Gaza over the course of the 10-month-old war, accusing Hamas of using them for military purposes, allegations denied by Palestinian health officials.\nIsraeli evacuation orders now cover about 84% of Gaza's territory, according to the United Nations, which estimates that about 90% of Gaza's population of 2.3 million were forced from their homes.\nThe Israeli military did not immediately respond to a request for comment on those attacks."}, {"id": "74e69eb3-e59e-439c-8728-15f8a322f7f6", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 04:30", "url": "https://www.wsoctv.com/news/world/ukraine-counts-new/XGAU3BMYSBALVFWL2CR3GDCDNE/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "9749e8a6-73f8-4217-ac67-1ea134f37807", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 02:15", "url": "https://www.smdailyjournal.com/business/ukraine-counts-on-new-long-range-weapon-to-bypass-western-restrictions-and-hit-deep-into/article_4bdef7c0-038c-5870-960e-de7ec7eefc9e.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "7e1ec043-b7ea-4f15-9701-96f5a7cfd74e", "title": "Donald Trump rally counter - sniper backs bombshell  evidence tampering  claims by House GOPers", "date": "2024-08-27 03:30", "url": "https://www.skynews.com.au/world-news/united-states/donald-trump-rally-countersniper-backs-bombshell-evidence-tampering-claims-by-house-gopers/news-story/567bd912e3fa044d4b8bbfc3cbd671af?nk=c17eddfd73b637177ce7344969ce92ce-1724728600", "domain": "skynews.com.au", "domain_classification": "Unknown", "message": "Counter-sniper teams fired two shots in response, but it is unknown whether just one of those shots or both killed Crooks, Shaffer noted in his testimony.\n“The FBI arranged for the cleaning of the location where the perpetrator died, which is in keeping with normal procedures.\nThe shooter’s body was released to his family after coordination with the coroner’s office and our state and local law enforcement partners.\nThis is also in keeping with normal procedures.”The Butler County Coroner’s Office did not immediately respond to a request for comment.\nOriginally published as Donald Trump rally counter-sniper backs bombshell ‘evidence tampering’ claims by House GOPers"}, {"id": "2d7a4c56-1e14-400e-a839-cf16834068a3", "title": "House task force investigating Trump assassination attempt tours rally site", "date": "2024-08-27 00:15", "url": "https://www.abcactionnews.com/us-news/trump-assassination-attempt/house-task-force-investigating-trump-assassination-attempt-tours-rally-site", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "The bipartisan House task force investigating the attempted assassination of former President Donald Trump visited the rally site of the shooting Monday in Butler, Pennsylvania, as they try to make more sense of what allowed it to occur.\nThe tour is part of a four-month probe the House is conducting into organizational failures surrounding the July 13 shooting that left Trump wounded.\nThe visit to the campaign rally site also comes just days after several Secret Service members were placed on administrative leave amid intense scrutiny directed toward the agency.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptAfter the tour, task force ranking member Rep. Jason Crow — who was a military intelligence officer — said that he now has more questions after seeing the rally site first-hand.\nRELATED STORY | Video appears to show police were alerted prior to Trump assassination attemptThe task force is trying to move quickly as it only has until Dec. 13 to complete its investigation."}, {"id": "010d7ac1-8eb6-4b7c-a3e7-a87987a6c2de", "title": "Hospital in Gaza empties out as Israeli forces draw near", "date": "2024-08-27 00:15", "url": "https://siouxcityjournal.com/news/nation-world/hospital-in-gaza-empties-out/article_c6e96993-2221-5e4a-b5b0-0e7f9fd8148d.html", "domain": "siouxcityjournal.com", "domain_classification": "Unknown", "message": "The Al-Aqsa Martyrs Hospital in Deir al-Balah is the main hospital serving central Gaza.\nThe Israeli military did not order its evacuation, but patients and people sheltering there fear it could be engulfed in fighting or become the target of a raid.\nIsraeli forces invaded several hospitals in Gaza over the course of the 10-month-old war, accusing Hamas of using them for military purposes, allegations denied by Palestinian health officials.\nIsraeli evacuation orders now cover about 84% of Gaza's territory, according to the United Nations, which estimates that about 90% of Gaza's population of 2.3 million were forced from their homes.\nThe Israeli military did not immediately respond to a request for comment on those attacks."}, {"id": "ebf93287-a85c-4fb0-b943-35565510d7a4", "title": "House task force investigating Trump assassination attempt tours rally site", "date": "2024-08-27 00:45", "url": "https://www.10news.com/us-news/trump-assassination-attempt/house-task-force-investigating-trump-assassination-attempt-tours-rally-site", "domain": "10news.com", "domain_classification": "Unknown", "message": "The bipartisan House task force investigating the attempted assassination of former President Donald Trump visited the rally site of the shooting Monday in Butler, Pennsylvania, as they try to make more sense of what allowed it to occur.\nThe tour is part of a four-month probe the House is conducting into organizational failures surrounding the July 13 shooting that left Trump wounded.\nThe visit to the campaign rally site also comes just days after several Secret Service members were placed on administrative leave amid intense scrutiny directed toward the agency.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptAfter the tour, task force ranking member Rep. Jason Crow — who was a military intelligence officer — said that he now has more questions after seeing the rally site first-hand.\nRELATED STORY | Video appears to show police were alerted prior to Trump assassination attemptThe task force is trying to move quickly as it only has until Dec. 13 to complete its investigation."}, {"id": "8a8ab8bc-f64f-4d2f-bffc-8426fb39c7f7", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 03:30", "url": "https://www.yakimaherald.com/news/nation_and_world/business/ukraine-counts-on-new-long-range-weapon-to-bypass-western-restrictions-and-hit-deep-into/article_3b5230ca-e88c-5afc-9705-5496aa78ca06.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Ukraine counts on new long-range weapon to bypass Western restrictions and hit deep into RussiaUkraine says it has a new homegrown long-range weapon that will allow it to strike deep into Russia without asking permission from allies"}, {"id": "7af34ab3-41b6-4a6c-a42e-8c9a114f293f", "title": "Israel / OPT : Israeli attacks targeting Hamas and other armed group fighters that killed scores of displaced civilians in Rafah should be investigated as war crimes - occupied Palestinian territory", "date": "2024-08-27 02:15", "url": "https://reliefweb.int/report/occupied-palestinian-territory/israelopt-israeli-attacks-targeting-hamas-and-other-armed-group-fighters-killed-scores-displaced-civilians-rafah-should-be-investigated-war-crimes", "domain": "reliefweb.int", "domain_classification": "Unknown", "message": "The organization also reviewed relevant statements by the Israeli military regarding the attacks.\nThe Israeli military said the rockets were intercepted by the Iron Dome air defence system, and no casualties were reported.\nThe Israeli military later issued an update stating they had killed two senior Hamas military commanders, Yassin Rabie and Khaled Najjar.\nThe Israeli military has smaller precise missiles, carried by drones, that contain far less explosives and have a smaller area effect.\nIn many attacks it has not been possible for Amnesty International to identify the intended target, precluding an assessment of proportionality."}, {"id": "de511772-02de-4b15-9079-fda16d61b7b4", "title": "Roundup : Iran calls for Muslim solidarity against Israeli  crimes  in Gaza", "date": "2024-08-27 04:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-08/27/content_117389923.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器TEHRAN, Aug. 26 (Xinhua) -- Iranian President Masoud Pezeshkian on Monday called on Muslim states to take joint actions to force Israel to stop its \"crimes and genocide\" in Gaza.\nHe made the appeal during talks with visiting Qatari Prime Minister and Minister of Foreign Affairs Sheikh Mohammed bin Abdulrahman Al Thani in Tehran, according to a statement by his office.\nChief of Staff of the Iranian Armed Forces Mohammad Baqeri also vowed on Monday that the revenge is \"definite,\" semi-official Tasnim news agency reported.\nBaqeri said Iran would decide about its revenge for Haniyeh's assassination itself, and the resistance axis, as was seen on Sunday, would act separately and independently.\nHe described the \"cowardly\" assassination of the Hamas chief in Tehran as an \"unforgettable\" incident, saying Iran would not fall into the trap of the enemies' media \"provocations.\""}, {"id": "fca0401a-538f-43ba-90b4-a4449dc2f4d0", "title": "Who Was Hannibal ? How One Brilliant General Almost Brought Ancient Rome To Its Knees", "date": "2024-08-27 01:45", "url": "https://menafn.com/1108603545/Who-Was-Hannibal-How-One-Brilliant-General-Almost-Brought-Ancient-Rome-To-Its-Knees", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The Carthaginian general's innovative military strategies in his struggle against Rome give us a glimpse into why his fame endures.\nHannibal forced Rome to rethink its military strategies.\nIn the series of battles with the Romans, Hannibal proved he was capable of undertaking seemingly impossible feats to achieve strategic advantages.\nThe Metropolitan MuseumHannibal's downfallDespite his victories against the Romans, Hannibal did not conquer the city of Rome, allowing the Romans to regroup.\nAt the Battle of Zama in modern-day Tunisia (in 202 BCE) Hannibal was defeated by the young Roman general Scipio Africanus ."}, {"id": "d45d1832-05f6-47fe-a597-e1f64c298234", "title": "Who was Hannibal ? How one brilliant general almost brought Ancient Rome to its knees", "date": "2024-08-27 02:30", "url": "https://theconversation.com/who-was-hannibal-how-one-brilliant-general-almost-brought-ancient-rome-to-its-knees-235009", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "The Carthaginian general’s innovative military strategies in his struggle against Rome give us a glimpse into why his fame endures.\nIn the series of battles with the Romans, Hannibal proved he was capable of undertaking seemingly impossible feats to achieve strategic advantages.\nHannibal forced Rome to rethink its military strategies and adapt in ways that would ultimately shape the future of the Roman Empire.\nHannibal’s downfallDespite his victories against the Romans, Hannibal did not conquer the city of Rome, allowing the Romans to regroup.\nAt the Battle of Zama in modern-day Tunisia (in 202 BCE) Hannibal was defeated by the young Roman general Scipio Africanus."}, {"id": "df3fb323-3645-44af-9c50-bdb916755287", "title": "Electronic Warfare Systems On Ukraine F - 16s Getting Specially Tuned To Russian Threats By USAF", "date": "2024-08-27 03:30", "url": "https://news.yahoo.com/news/electronic-warfare-systems-ukraine-f-001506375.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Before the Ukrainian Air Force received its first batch of F-16 Viper fighters, the U.S. Air Force helped optimize electronic warfare (EW) systems on those jets against Russian threats.\nBefore the Ukrainian Air Force received its first batch of F-16 Viper fighters, the U.S. Air Force helped optimize the electronic warfare (EW) systems on those jets to defend against Russian threats.\nIn turn, electronic warfare systems have to be routinely reprogrammed to update their databanks to respond to evolving threats.\nThe electronic warfare threat libraries available to U.S. forces are one of the biggest advantages available to America’s armed forces.\nContractors with the 68th Electronic Warfare Squadron prepare the Advanced Integrated Defense Electronic Warfare System test lab for a test run."}, {"id": "32c5a37b-66fb-4d78-b7da-dc12e754ed80", "title": "The Geneva Conventions :  Rules of war  saved me , says former child soldier Global Issues", "date": "2024-08-27 00:45", "url": "https://www.globalissues.org/news/2024/08/26/37488", "domain": "globalissues.org", "domain_classification": "Unknown", "message": "‘Moral beacon’From Mozambique, Permanent Representative to the UN in New York, Pedro Comissario Afonso, insisted that the Geneva Conventions were both “a moral beacon and legal compass during and after the armed conflict in our country”, fought from 1977 to 1992.\nThe Conventions’ onus on legal and institutional norms with regard to armed conflict, endure in the Government’s approach to confronting non-State armed actors responsible for terror attacks in the country’s north, the Mozambican representative continued.\nExpressing the widely shared call for far greater engagement by all governments on IHL, Andrew Clapham, Professor of International Law at the Geneva Graduate Institute, told delegates that violations of the Geneva Conventions “are not just technicalities to be dealt with by somebody else”.\nOften unreported acts of compliance with the Geneva Conventions “do save lives, preserve dignity and ensure humanitarian access”, she said.\n“And over the decades there can be no doubt that the Geneva Conventions have saved millions of lives.”"}, {"id": "6c8f3217-f62f-4a4d-bf8d-570c4e197e05", "title": "North Korean leader supervises test of  suicide drones , calls them crucial for war readiness", "date": "2024-08-27 01:15", "url": "https://www.dailyexcelsior.com/north-korean-leader-supervises-test-of-suicide-drones-calls-them-crucial-for-war-readiness/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "SEOUL, Aug 26: North Korean leader Kim Jong Un supervised a demonstration of new “suicide drones” and pledged to spur the development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. And South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts.\nNorth Korea’s official Korean Central News Agency said Saturday’s test involved various types of drones built to fly different ranges to attack enemy targets on land and sea."}, {"id": "ca044af2-f103-40a9-9a09-90ed68d62dcb", "title": "MMA media personalities Ben Davis , Oscar Willis set to fight at BKFC 67", "date": "2024-08-27 01:15", "url": "https://www.mmafighting.com/2024/8/26/24228993/mma-media-personalities-ben-davis-oscar-willis-set-to-fight-at-bkfc-67", "domain": "mmafighting.com", "domain_classification": "Unknown", "message": "On Monday, Bare Knuckle Fighting Championship announced its upcoming BKFC 67 card, which takes place on Oct. 12 at Marbella Arena in Marbella, Spain, will feature a high-profile amateur encounter between two sizable MMA personalities: Ben Davis and Oscar Willis.\n“This is easily the craziest thing I’ve ever done,” Davis told MMA Fighting.\nI believe this all ends with an MMA debut next.\nThis will also be Willis’s first fight since then and his bare-knuckle debut, but he felt the timing and opponent made sense.\n“BKFC felt like the right promotion, Bane felt like the right opponent, and a bull fighting arena in Spain felt like the right venue,” Willis told MMA Fighting."}, {"id": "471d13e0-05fb-45fb-afc4-7e21fc931227", "title": "Largest Russian Aerial Attack Of The War Wreaks Havoc On Ukraine Beleaguered Power Grid", "date": "2024-08-27 02:30", "url": "https://www.yahoo.com/news/largest-russian-aerial-attack-war-010732012.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces recently advanced near and within Toretsk and southwest of Donetsk City.\n“They practically detained the head of communication of the Russian army,” Russian military blogger channel Povernutie na Z Voine said in a Telegram statement.\nStory: https://t.co/UnsF7rDZlc — The Aviationist (@TheAviationist) August 24, 2024A Ukrainian Air Force S-300PT air defense system is seen in this rare image launching against an aerial target.\nThe Ukrainian Air Force began to operate F-16s donated by the Netherlands and Denmark in combat last month.\nUkrainian F-16 jet in one of the reinforced concrete shelters at a Ukrainian air base."}, {"id": "e262e8e6-b21a-4c76-a9ef-e5819b3bbc19", "title": "SwitchArcade Round - Up :  Fragrant Story & Papaya Path , Plus Today Other Releases and Sales – TouchArcade", "date": "2024-08-27 04:15", "url": "https://toucharcade.com/2024/08/26/fata-morgana-switch-discount-eshop-price-arzette-jewel-faramore-lrg/", "domain": "toucharcade.com", "domain_classification": "Unknown", "message": "Hello gentle readers, and welcome to the SwitchArcade Round-Up for August 26th, 2024.\nIn today’s article, we get the week started with a somewhat lighter edition than we usually go with.\nSelect New ReleasesFragrant Story and Papaya’s Path ($7.99)Ah, the sordid tale of Fragrant Story, one of the would-be final Nintendo 3DS releases.\nNintendo’s deadline for 3DS releases was coming quickly, so the developer pushed an unfinished game to the eShop.\nWe’ll be back tomorrow with more new releases, more sales, and perhaps some reviews and news."}, {"id": "8f27cbb6-06d6-4aa6-8f2c-d2ce3cd521f4", "title": "  World of Warcraft : The War Within : How yo Buy Online , Pricing", "date": "2024-08-27 00:15", "url": "https://www.billboard.com/culture/product-recommendations/world-of-warcraft-the-war-within-how-to-buy-online-1235761059/", "domain": "billboard.com", "domain_classification": "Unknown", "message": "After launching in 2004, World of Warcraft has been bringing new gamers into the fold as one of the best and most long-running massively multiplayer online role-playing games out there.\nAnd for the game’s 10th expansion, gamers can experience Azeroth in a different way in The War Within.\nActivision Blizzard ‘World of Warcraft: The War Within’ $49.99 and up Buy Now at G2A.comIf you’re new to World of Warcraft, now is a good time to start playing since there’s a new expansion and upcoming trilogy to experience.\nYou also don’t need a console, like Xbox Series X or Sony PlayStation 5, to start playing.\nAvailable at G2A and Battle.net starting at for $49.99, World of Warcraft: The War Within is out for Mac and PC on Monday (Aug. 26)."}, {"id": "e4f6de6c-3863-4d82-8bd6-b01dfc8b64ab", "title": "Shoplifters & Scammers : At War with the Law", "date": "2024-08-27 04:15", "url": "https://www.tvguide.co.uk/schedule/a0e22816-f807-5317-93cf-d46cd170e6e5/shoplifters-and-scammers-at-war-with-the-law", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Shoplifters & Scammers: At War with the Law5STAR 10:00 AM to 11:00 AM Tuesday 27 August Share Add toCalendar +Episode 22 S SubtitlesDocumentary following shopping centre security teams who are locked in a cat and mouse battle to catch criminalsShoplifters & Scammers: At War with the Law airs on 5STAR at 10:00 AM, Tuesday 27 August .\n(Subtitles.)\nLearn more about Shoplifters & Scammers: At War with the Law and other education/science/factual topics on our factual page"}, {"id": "6ad8dab4-d226-40fa-9c42-5a2fbc64c8b1", "title": "Reining in the cost of unwanted calories , sugar and salt", "date": "2024-08-27 03:15", "url": "https://www.businesstimes.com.sg/opinion-features/reining-cost-unwanted-calories-sugar-and-salt", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "TO WIN a war, access to information is critical.\nThis can be said, too, of Singapore’s ongoing battle against diabetes, hypertension and other chronic diseases.\nPoor dietary habits remain a key cause of these diseases, but this may be partly due to a lack of full information and consumer education.\nSome consumers may claim to not know the nutritional composition of their favourite food, which probably contains too much sugar, salt or oil.\nAnd in day-to-day life, many others perhaps simply aren’t too perturbed about the consequences of making poor food choices."}, {"id": "902b3745-a588-4bf9-8b65-c1a63384775a", "title": "The war and withdrawal from Afghanistan , a timeline", "date": "2024-08-27 00:00", "url": "https://www.bostonherald.com/2024/08/26/the-war-and-withdrawal-from-afghanistan-a-timeline/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Here are some important events in the timeline of the U.S. war and withdrawal from Afghanistan, as reported at the time and cataloged by the Council on Foreign Relations.\nOctober 7, 2001 – U.S. and British forces begin bombing Taliban positions and forces in Afghanistan.\nOctober 9, 2004 – Afghan President Hamid Karzai is elected in the country’s first democratic elections.\nMay, 2005 – Bush and Karzai agree to a joint commitment allowing U.S. forces to prosecute the war on terror from Afghan bases.\nAugust 16, 2021 – Kabul falls to Taliban forces."}, {"id": "5c262cd4-e594-40ee-af18-be702c7bad3e", "title": "Zeus Numerix Develops Lethal Payload for Swarm Drones – Indian Defence Research Wing", "date": "2024-08-27 03:15", "url": "https://idrw.org/zeus-numerix-develops-lethal-payload-for-swarm-drones/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Zeus Numerix Develops Lethal Payload for Swarm Drones| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIndian defence startup, Zeus Numerix, has made significant strides in drone technology by developing 3kg and 5kg ammunition specifically designed for swarm drone operations.\nZeus Numerix has introduced three variants: ER8 Agnibaahu, capable of carrying one 3kg ammunition; ER25 Agnibaahu, designed to carry one 5kg ammunition; and ER55 Agnibaahu, which can carry two 3kg and one 5kg ammunition.\nSwarm drone technology, combined with lethal payloads, can be employed for a wide range of tactical missions, including precision strikes, suppression of enemy air defences, and electronic warfare.\nZeus Numerix’s innovation showcases India’s growing prowess in the defence sector and highlights the country’s commitment to developing cutting-edge military capabilities.\nNOTE : Article cannot be reproduced without written permission of idrw.org in any form even for YouTube Videos to avoid Copy right strikes."}, {"id": "5871a464-15d1-43a4-9d63-879f462c9ce2", "title": "At least 30 dead after dam bursts in eastern Sudan", "date": "2024-08-27 02:00", "url": "https://www.perthnow.com.au/news/disaster-and-emergency/at-least-30-dead-after-dam-bursts-in-eastern-sudan-c-15841991", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "Surging waters have burst through a dam, wiped out at least 20 villages and left at least 30 people dead but probably many more in eastern Sudan, devastating a region already reeling from months of civil war.\nTorrential rains caused floods that overwhelmed the Arbaat Dam on Sunday 40km north of Port Sudan, the de facto national capital and base for the government, diplomats, aid agencies and hundreds of thousands of displaced people.\nThe dam was the main source of water for Port Sudan, which is home to the country’s main Red Sea port and working airport, and receives most of the country’s much-needed aid deliveries.\nOfficials said the dam had started crumbling and silt had been building during days of heavy rain that had come much earlier than usual.\nThe conflict in Sudan began when competition between the army and the RSF, who had previously shared power after staging a coup, flared into open warfare."}, {"id": "a9ff6ec0-cd6f-4dc9-9b92-051e17c7a65b", "title": "Exclusive - Top US general says risk of broader war eases a bit after Israel - Hezbollah exchange", "date": "2024-08-27 02:00", "url": "https://www.aol.com/exclusive-top-us-general-says-233954204.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Iran is also threatening an attack over the killing of a Hamas leader in Tehran last month.\nAsked if the immediate risk of a regional war had declined, Brown said: \"Somewhat, yes.\"\n\"How Iran responds will dictate how Israel responds, which will dictate whether there is going to be a broader conflict or not.\"\nIn Tel Aviv, he met Israel's Defense Minister Yoav Gallant and its Chief of the General Staff Lieutenant General Herzi Halevi.\nAsked about Lebanese Hezbollah's military might, particularly after the strikes by Israel, Brown cautioned \"they still have capability.\""}, {"id": "f4e14e8b-9d97-4183-bf32-e995463f484b", "title": "US military official hopeful on Mid . East tensions after Hezbollah attack", "date": "2024-08-27 03:30", "url": "https://www.jpost.com/israel-hamas-war/article-816538", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Brown noted Hezbollah's strike was just one of two major threatened attacks against Israel that emerged in recent weeks.\nAsked if the immediate risk of a regional war had declined, Brown said: \"Somewhat, yes.\"\nNow it depends on how the second is going to play out,\" Brown said while flying out of Israel.\nIn Tel Aviv, he met Israel's Defense Minister Yoav Gallant and its Chief of the General Staff Lieutenant General Herzi Halevi.\nAsked about Lebanese Hezbollah's military might, particularly after the strikes by Israel, Brown cautioned \"they still have capability.\""}, {"id": "960503e2-5892-406c-b7c7-bb74f3c46e56", "title": "Exclusive - Top US general says risk of broader war eases a bit after Israel - Hezbollah exchange", "date": "2024-08-27 01:15", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Exclusive-Top-US-general-says-risk-of-broader-war-eases-a-bit-after-Israel-Hezbollah-exchange-47735019/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Iran is also threatening an attack over the killing of a Hamas leader in Tehran last month.\nAsked if the immediate risk of a regional war had declined, Brown said: \"Somewhat, yes.\"\n\"How Iran responds will dictate how Israel responds, which will dictate whether there is going to be a broader conflict or not.\"\nIn Tel Aviv, he met Israel's Defense Minister Yoav Gallant and its Chief of the General Staff Lieutenant General Herzi Halevi.\nAsked about Lebanese Hezbollah's military might, particularly after the strikes by Israel, Brown cautioned \"they still have capability.\""}, {"id": "c2352191-aecd-4df7-b3c0-00e0d60db20f", "title": "Exclusive - Top US general says risk of broader war eases a bit after Israel - Hezbollah exchange", "date": "2024-08-27 02:45", "url": "https://www.swissinfo.ch/eng/exclusive-top-us-general-says-risk-of-broader-war-eases-a-bit-after-israel-hezbollah-exchange/87443128", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Exclusive-Top US general says risk of broader war eases a bit after Israel-Hezbollah exchangereuters_tickers4 minutesBy Phil StewartABOARD A U.S. MILITARY AIRCRAFT (Reuters) – The near-term risk of a broader war in the Middle East has eased somewhat after Israel and Lebanon’s Hezbollah exchanged fire without further escalation but Iran still poses a significant danger as it weighs a strike on Israel, America’s top general said on Monday.\nBrown noted Hezbollah’s strike was just one of two major threatened attacks against Israel that emerged in recent weeks.\nAsked if the immediate risk of a regional war had declined, Brown said: “Somewhat, yes.”“You had two things you knew were going to happen.\nNow it depends on how the second is going to play out,” Brown said while flying out of Israel.\nIn Tel Aviv, he met Israel’s Defense Minister Yoav Gallant and its Chief of the General Staff Lieutenant General Herzi Halevi."}, {"id": "b28348c0-2d83-49f0-bc73-41449bfcb54c", "title": "Israel conflicts with Hamas and Hezbollah show no sign of easing", "date": "2024-08-27 02:00", "url": "https://www.bostonglobe.com/2024/08/26/world/israels-conflicts-with-hamas-hezbollah-show-no-sign-easing/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But any relief has been tempered by renewed anxiety and uncertainty: Despite the apparent postponement of a bigger regional war, Israel’s grinding conflicts with both Hezbollah in Lebanon and Hamas in the Gaza Strip still have no end in sight.\nWithout a deal in Gaza, Hezbollah has vowed to continue its strikes along the Israel-Lebanon border, where any sudden miscalculation or mistake still risks transforming a relatively restricted fight into a bigger conflict involving Iran, the benefactor of both Hamas and Hezbollah.\nAnd Iran has yet to respond militarily to Israel’s assassination of a Hamas leader last month in Tehran, Iran.\nHezbollah has said it will continue its battle until Israel agrees to a cease-fire with Hamas in Gaza.\nDespite a renewed push by the United States and optimistic comments from Biden administration officials, the Gaza cease-fire talks appear to be at an impasse."}, {"id": "bffde7d1-dbc7-4e8b-9fe8-a513fab931f5", "title": "Why Ansar uprising in Dhaka pushes Bangladesh to the brink – Firstpost", "date": "2024-08-27 02:30", "url": "https://www.firstpost.com/world/why-ansar-uprising-could-push-bangladesh-back-to-the-brink-13808342.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The discontent among the Ansar members had been brewing for years, but it reached a boiling point on the Wednesday before the clashes.\nBy Monday afternoon, 109 Ansar members were arrested on charges of unlawful assembly, obstructing police duties and vandalism.\nRole and importance of the Ansar forceDespite its significant contributions, the Ansar force has long struggled with issues of recognition and fair treatment.\nIn the post-independence period, the Ansar force was reconstituted and expanded, incorporating the DP and the Town Defence Party into its ranks.\nA wake-up callThe recent unrest within the Ansar force is a wake-up call for the government."}, {"id": "ed672a8d-f159-45d7-9fdd-1fdca249a310", "title": "Israel - Hamas war day 325 : What happening in Israel , Gaza , Lebanon ? ", "date": "2024-08-27 03:45", "url": "https://www.jpost.com/israel-hamas-war/2024-08-27/live-updates-816539", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A POLICE vehicle drives on a road near Meron in the North as a forest fire rages after rockets were fired from Lebanon last Friday.\nDespite its claims, Hezbollah is clearly trying to provoke Israel into a broader conflict, the writer asserts.\nAir Force General C.Q.\nBrown noted Hezbollah's strike was just one of two major threatened attacks against Israel that emerged in recent weeks.\nIran is also threatening an attack over the killing of a Hamas leader in Tehran last month."}, {"id": "ca113e1a-d5df-465d-9280-d95effd7e7c0", "title": "This is genocide , says CM Bugti", "date": "2024-08-27 00:30", "url": "https://tribune.com.pk/story/2491308/this-is-genocide-says-cm-bugti", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Balochistan Chief Minister Sarfaraz Bugti strongly condemned the violence that gripped the province on Monday, reiterating the state's resolve to combat terrorism in all its forms.\n\"Thirty-eight innocent lives were taken, they were innocent Pakistanis,\" Bugti stated, highlighting the heinous nature of the attacks.\nThis is an intelligence-driven war; we will not spare anyone,\" Bugti said.\n\"A terrorist has no affiliation with any particular sect, province, nation, or religion, their only identity is 'terrorist',\" he said.\n\"Prime Minister Shehbaz Sharif will visit Balochistan, and an apex committee will convene to address these challenges,' he said."}, {"id": "5e6c5e75-62fe-4484-b0b9-eefb331c7c41", "title": "Why Iran and Hezbollah May Back Off", "date": "2024-08-27 02:15", "url": "https://hotair.com/headlines/2024/08/26/why-iran-and-hezbollah-may-back-off-n3793693", "domain": "hotair.com", "domain_classification": "Unknown", "message": "It appears likely that Hezbollah will indeed conclude that sufficient revenge has been exacted for the loss of Shukr.\nThe killings of Haniyeh and Shukr, indeed appear to have constituted a kind of bluff-calling by Israel, in which the Jewish state sought by escalation to break the pattern of slow attritional warfare preferred by Iran and its allies.\nAdvertisementFrom this perspective, Israel may record a notable achievement.\nThe current round indicates that Jerusalem can hit prestige targets, senior officials of the enemy side, in the very heart of enemy territory, while paying only a limited and symbolic price by way of retribution.\nIndeed, yesterdays’ events appear to indicate that Israel can even use the enemy’s preparations for retaliation in order to carry out additional telling strikes of its own."}, {"id": "a514e7a8-d53b-433f-8a0a-94d96899d3a6", "title": "U . S . Rep . Tom Cole discusses enormity of Ukraine - Russia war", "date": "2024-08-27 02:00", "url": "https://tulsaworld.com/news/nation-world/government-politics/congressman-tom-cole-concerned-americans-dont-understand-enormity-of-ukrainian-conflict/article_ad2b0744-63be-11ef-962a-3f65a5f4e09e.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "Hern and others also say they don't want to send more money to Ukraine until the U.S. southern border is secured.\nHe said policy, not money, is the reason for the post-COVID surge of immigration across the United States' southern border.\n\"I was in the southern end of my district, and someone said, 'Why are we spending this money in Ukraine and we're not spending money on the southern border?'\n\"I said, 'First of all, we are spending more money on the southern border than the president asked for.\nIt's not like we aren't spending money on the southern border."}, {"id": "68f9f1c7-b6d5-4fcb-b111-3a9cf43eddc3", "title": "Worthplaying |  Shadow Of The Road  Resurfaces , Publishing Rights Picked Up By Owlcat Games", "date": "2024-08-27 03:45", "url": "https://worthplaying.com/article/2024/8/26/news/143349-shadow-of-the-road-resurfaces-publishing-rights-picked-up-by-owlcat-games-screens-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "Announced back in 2024, Owlcat Games has signed a agreement with developer Another Angle Games to publish Shadow Of The Road.\nSupernatural beings derived from Japanese mythology manifest their displeasure with continuing industrialization of the country and profanation of sacred places.\nSupernatural beings derived from Japanese mythology manifest their displeasure with continuing industrialization of the country and profanation of sacred places.\nDiscover the world of Japanese mythology by finding hidden passageways to a mythical world.\nDiscover the world of Japanese mythology by finding hidden passageways to a mythical world."}, {"id": "c0142bf0-7c18-4021-8ae9-36db5aac7251", "title": "Diversity in the High Brass", "date": "2024-08-27 01:15", "url": "https://carnegieendowment.org/research/2022/09/diversity-in-the-high-brass", "domain": "carnegieendowment.org", "domain_classification": "Unknown", "message": "This theory is not to discount the fervent desire that many Black officers have to serve and protect their country.\nThis is by no means to say that only Black officers should mentor or sponsor Black officers.\nThe issue, however, remains that for largely structural and historical reasons, there are fewer opportunities for Black officers to benefit from the mentorship of more successful Black officers.\nMoreover, not all the racism they encountered came from White officers; sometimes Black officers themselves had subconscious biases.\nIn comparison, another 2012 study found that White officers were 29 percent more likely to be promoted than Black officers."}, {"id": "38f29732-7fd6-4a46-954a-68e2726055e6", "title": "Mideast Remains On Edge Despite Lull After Israel Bombed Lebanon", "date": "2024-08-27 00:15", "url": "https://menafn.com/1108602761/Mideast-Remains-On-Edge-Despite-Lull-After-Israel-Bombed-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah responded by firing more than 200 projectiles, according to Israel, although officials said very limited damage was caused.\nBoth Israel and Hezbollah announced that, for the moment, their operations were over - despite ongoing low-level fighting.\nThe Mossad intelligence service's base in Glilot was the main target of the attack, Hezbollah Secretary General Hassan Nasrallah said Sunday.\nThe war in the Palestinian enclave began on Oct. 7 after Hamas militants, supported by Iran, invaded Israel and killed 1,200 people and abducted others.\nIsrael's retaliation in Gaza has killed at least 40,000 people, according to Hamas health officials in Gaza."}, {"id": "2cd7f5db-d1f2-4cd8-a71b-58bb919fb985", "title": "US Army takes new look at training aviators with decisions coming soon", "date": "2024-08-27 03:15", "url": "https://www.militarytimes.com/land/2024/08/26/us-army-takes-new-look-at-training-aviators-with-decisions-coming-soon/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "The Army retired its Bell-manufactured TH-67 single-engine training helicopter following a decision to restructure its aviation fleet in late 2013.\nEverything is on the table as far as what kind of aircraft does that look like and what does the training look like,” McCurry said.\nAdditionally, with the improvement of simulation technology, the aviation training curriculum relies more on simulator hours than ever before.\nWhat parts of flight training can really be assisted and optimized using those technologies?” McCurry questioned.\nEarlier this month, an AH-64 Apache helicopter crashed during a routine flight training on Fort Novosel, killing the flight instructor and injuring the student."}, {"id": "15e1d0f8-ca20-4846-89ea-6ce27ffedfa0", "title": "China spent $15 . 3 billion on Pacific exercises in 2023 , internal Taiwan estimates show", "date": "2024-08-27 04:30", "url": "https://www.moneycontrol.com/news/world/china-spent-15-3-billion-on-pacific-exercises-in-2023-internal-taiwan-estimates-show-12807509.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "0bc2c49e-44ef-4b64-9d95-d6194f528733", "title": "China spent $15 . 3 billion on Pacific exercises in 2023 , internal Taiwan estimates show | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-27 03:30", "url": "https://www.asahi.com/ajw/articles/15402791", "domain": "asahi.com", "domain_classification": "Unknown", "message": "It is also locked in disputes with several countries over sovereignty of large parts of the South China Sea and the East China Sea.\nThe First Island Chain is a collection of archipelagos running roughly from Indonesia in an arc northeast to Japan, encompassing the South China Sea and East China Sea.\nThe 110 billion yuan figure amounts to about 85% of Taiwan’s 2023 defense budget, Reuters calculations show.\nChina in March announced a 7.2% rise in defense spending for this year to 1.67 trillion yuan.\nChieh Chung, a researcher at a Taipei-based think tank, the Association of Strategic Foresight, said the activity showed the Chinese military was building combat readiness."}, {"id": "6575df66-637c-45be-92da-a27519e8909c", "title": "US Army takes new look at training aviators with decisions coming soon", "date": "2024-08-27 03:30", "url": "https://www.defensenews.com/land/2024/08/26/us-army-takes-new-look-at-training-aviators-with-decisions-coming-soon/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Army retired its Bell-manufactured TH-67 single-engine training helicopter following a decision to restructure its aviation fleet in late 2013.\nEverything is on the table as far as what kind of aircraft does that look like and what does the training look like,” McCurry said.\nAdditionally, with the improvement of simulation technology, the aviation training curriculum relies more on simulator hours than ever before.\nWhat parts of flight training can really be assisted and optimized using those technologies?” McCurry questioned.\nEarlier this month, an AH-64 Apache helicopter crashed during a routine flight training on Fort Novosel, killing the flight instructor and injuring the student."}, {"id": "3f484375-1d47-4e09-90d2-e0d80c2a5011", "title": "The danger is not a new Cold War but a grinding collapse of the world order", "date": "2024-08-27 02:30", "url": "https://www.straitstimes.com/opinion/the-danger-is-not-a-new-cold-war-but-a-grinding-collapse-of-the-world-order", "domain": "straitstimes.com", "domain_classification": "Local - Asia", "message": "The world is, we are told repeatedly, entering a “new Cold War”.\nTo a critical eye, the world looks less like the structured competition of that Cold War and more like the grinding collapse of world order that took place during the 1930s.\nFrom the vantage of almost a century of hindsight, the period from the Wall Street crash of 1929 to the onset of World War II can be distorted by loaded terms like “isolationism” and “appeasement”.\nIt wasn’t just Wall Street that crashed; for many, the crisis undercut the ideology driving the United States and many parts of the world: liberalism.\nOver the past decade, we have similarly seen voters turn to authoritarian-leaning populists in countries around the world."}, {"id": "3cada528-ab5c-4e65-8e66-f220815c23c4", "title": "Exclusive - China spent $15 . 3 billion on Pacific exercises in 2023 , internal Taiwan estimates show", "date": "2024-08-27 02:45", "url": "https://www.swissinfo.ch/eng/exclusive-china-spent-$15.3-billion-on-pacific-exercises-in-2023,-internal-taiwan-estimates-show/87443344", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Exclusive-China spent $15.3 billion on Pacific exercises in 2023, internal Taiwan estimates showreuters_tickers7 minutesBy Yimou LeeTAIPEI (Reuters) – China spent about $15 billion, or 7% of its defence budget, on exercises in the Western Pacific in 2023, according to a previously unpublished Taiwanese estimate, showing Beijing’s investment in military activity around Taiwan and its neighbours.\nIt is also locked in disputes with several countries over sovereignty of large parts of the South China Sea and the East China Sea.\nThe First Island Chain is a collection of archipelagos running roughly from Indonesia in an arc northeast to Japan, encompassing the South China Sea and East China Sea.\nThe 110 billion yuan figure amounts to about 85% of Taiwan’s 2023 defence budget, Reuters calculations show.\nChieh Chung, a researcher at a Taipei-based think tank, the Association of Strategic Foresight, said the activity showed the Chinese military was building combat readiness."}, {"id": "7262180f-5a3b-4229-bf10-a3c3827f05a3", "title": "Thousands of Fort Carson soldiers getting back to basics of warfare at Piñon Canyon", "date": "2024-08-27 04:15", "url": "https://gazette.com/military/thousands-of-fort-carson-soldiers-getting-back-to-basics-of-warfare-at-pi-on-canyon/article_fd2719bc-63f6-11ef-b5f0-3fa581ddf4fc.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "4ef44de3-69d4-4ed8-b476-25693ae48429", "title": "Trump , Harris mark end to war in Afghanistan with strikingly different messages", "date": "2024-08-27 00:00", "url": "https://www.bostonherald.com/2024/08/26/trump-harris-mark-end-to-war-in-afghanistan-with-strikingly-different-messages/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "With three years passing since the deadly U.S. withdrawal from Afghanistan ended the nation’s longest continuous conflict, both presidential candidates took the time to mark the solemn occasion on Monday, though each delivered very different messages.\nPresident Joe Biden’s decision to carry through with plans put in place by the Trump Administration to end the war was the right one, she said.\n“President Biden made the courageous and right decision to end America’s longest war.\n“This is the third anniversary of the BOTCHED Afghanistan withdrawal, the most EMBARRASSING moment in the history of our Country.\nTrump’s administration agreed to the withdrawal of all U.S. military members from Afghanistan in February, 2020, in a deal signed with the Taliban."}, {"id": "911d9a6b-e402-43f3-81a8-c907adad3104", "title": "North Korea Debuts Suicide Drone Program", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/national-security/2024/08/26/north-korea-debuts-suicide-drone-program/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "North Korea revealed its first allegedly indigenous suicide drones and other combat vehicles on Monday in an article on communist dictator Kim Jong-un attending a drone performance test this weekend.\nSuicide drones, also known as loitering munitions, are explosives-carrying unmanned aerial vehicles (UAVs) that work by identifying a target and flying into it, detonating its payload.\nThe photos blurred the bodies of the alleged suicide drones to hide design details, presumably for security reasons.\nSouth Korean officials described increasing drone development as a “key component” of North Korean strategy in the near future.\nIn an address on the attack, Zelensky suggested North Korea is already involved in the war."}, {"id": "dc7b18c6-8975-4a73-b9ca-a3a5a56e17e7", "title": "Kim Jong - un cackles with delight as he watches  successful testing of suicide drone with huge fireball explosion - weeks after Putin visited North Korea", "date": "2024-08-27 01:15", "url": "https://www.dailymail.co.uk/news/article-13782417/Kim-Jong-cackles-delight-testing-suicide-drones-fireball-explosion-Putin-visited-North-Korea.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Kim Jong-un was pictured cackling as he watched the testing of 'suicide drones' with a huge fireball explosion - just a few weeks after ally Vladimir Putin visited him in North Korea.\nAnalysts suggest the North Korean drones shown in state media photos resemble Russian drones, implying friendship in the face of their separate confrontations with the US.\n'We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,' he said.\n'We would need to analyse various aspects, including whether (North Korea) would have modified to improve their capabilities or other possibilities.'\nNorth Korea is accused of breaching arms control measures by supplying weapons to Russia for use in its war in Ukraine."}, {"id": "4bf43890-03ed-4a6d-b606-76684c6f0863", "title": "US Army takes new look at training aviators with decisions coming soon", "date": "2024-08-27 02:30", "url": "https://www.airforcetimes.com/land/2024/08/26/us-army-takes-new-look-at-training-aviators-with-decisions-coming-soon/", "domain": "airforcetimes.com", "domain_classification": "Unknown", "message": "The Army retired its Bell-manufactured TH-67 single-engine training helicopter following a decision to restructure its aviation fleet in late 2013.\nEverything is on the table as far as what kind of aircraft does that look like and what does the training look like,” McCurry said.\nAdditionally, with the improvement of simulation technology, the aviation training curriculum relies more on simulator hours than ever before.\nWhat parts of flight training can really be assisted and optimized using those technologies?” McCurry questioned.\nEarlier this month, an AH-64 Apache helicopter crashed during a routine flight training on Fort Novosel, killing the flight instructor and injuring the student."}, {"id": "afe9b374-965c-4cb4-b30f-8636b708c544", "title": "Gaza Truce Talks Continue To Iron Out Details : US", "date": "2024-08-27 03:15", "url": "https://menafn.com/1108603631/Gaza-Truce-Talks-Continue-To-Iron-Out-Details-US", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Speaking to reporters in a virtual briefing, Kirby pushed back on suggestions that the talks have broken down, and said, on the contrary, that they were 'constructive'.\n“The talks actually progressed to a point where they felt like the next logical step was to have working groups at lower levels to sit down to hammer out these finer details,” Kirby said.\nBrett McGurk, US President Joe Biden's top Middle East aide at the White House who has been participating in the talks, will soon leave Cairo after staying an extra day to start the working-group talks, Kirby said.\nHe said the details to be settled included how many hostages may be exchanged, their identities, and the pace of their potential release.\nBut Kirby said the cross-border warfare over the weekend has not had an impact on the talks."}, {"id": "14b31584-6223-490a-a763-f4612727a1a1", "title": "Trump tries to tie rival Harris to chaotic Afghanistan exit", "date": "2024-08-27 02:00", "url": "https://gazette.com/news/us-world/trump-tries-to-tie-rival-harris-to-chaotic-afghanistan-exit/article_0f4680cf-c8c8-5fb6-bc87-fcaaf361473b.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Harris' campaign said the fault lay with Trump's tenure as president.\n\"The Biden-Harris administration inherited a mess from Donald Trump,\" said Ammar Moussa, a Harris spokesperson.\n\"Trump wants America to forget that he had four years to get out of Afghanistan, but failed to do it.\"\nThe Harris campaign deleted a reference this month to Walz's rank as a \"command sergeant major\" on its website.\nDuring her acceptance speech at the Democratic National Convention last week, Harris said she was ready to assume the role of commander-in-chief."}, {"id": "ab759c7e-391b-4c14-804b-bf86fee55133", "title": "Gaza truce talks continue to iron out details : US", "date": "2024-08-27 00:15", "url": "https://www.gulf-times.com/article/689399/region/gaza-truce-talks-continue-to-iron-out-details-us", "domain": "gulf-times.com", "domain_classification": "Unknown", "message": "Negotiations in Cairo to achieve a ceasefire in Gaza and a hostage deal are still pressing ahead, White House national security spokesperson John Kirby said, adding that the discussions will continue on the working-group level for the next few days to iron out specific issues.Speaking to reporters in a virtual briefing, Kirby pushed back on suggestions that the talks have broken down, and said, on the contrary, that they were ‘constructive’.“The talks actually progressed to a point where they felt like the next logical step was to have working groups at lower levels to sit down to hammer out these finer details,” Kirby said.Brett McGurk, US President Joe Biden’s top Middle East aide at the White House who has been participating in the talks, will soon leave Cairo after staying an extra day to start the working-group talks, Kirby said.One of the issues to be tackled by the working groups will be the exchange of hostages Hamas is holding and Palestinian prisoners that Israel is holding, Kirby said.He said the details to be settled included how many hostages may be exchanged, their identities, and the pace of their potential release.The latest round of negotiations came under the threat of a regional escalation.\nOver the weekend, Hezbollah launched hundreds of rockets and drones at Israel as Israel’s military said it struck Lebanon with around 100 jets to thwart a larger attack.But Kirby said the cross-border warfare over the weekend has not had an impact on the talks.Key sticking points in ongoing talks mediated by the United States, Egypt and Qatar include an Israeli presence in the so-called Philadelphi Corridor, a narrow 14.5km-long stretch of land along Gaza’s southern border with Egypt."}, {"id": "5dfaaa84-7313-43a0-ad8f-416c16d76500", "title": "Von der Leyen second term from hell – POLITICO", "date": "2024-08-27 04:15", "url": "https://www.politico.eu/article/ursula-von-der-leyen-eu-commission-hellacious-ukraine-pandemic-trump-war-challenge/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "“The next five years will be a political minefield,” said one senior EU official, who was granted anonymity to speak freely about the European Commission president.\n“Within that, she will have to make key decisions on the future of the European Union and its budget, while handling the war in Ukraine and the U.S. election.”No matter the direction you look, there are problems for von der Leyen.\nAround the table at the European Council — the bloc’s 27 leaders — sit several who are right-wing and/or openly hostile to von der Leyen, and that number could grow (hallo Austria this year and bonjour Marine Le Pen in 2027).\nDuring the next five years, von der Leyen will also have to prepare the bloc for future enlargement.\nDuring the pandemic and the Ukraine crisis, von der Leyen “showed she has the balls” to steer the bloc through tough times, another EU diplomat stressed."}]