[{"id": "098fc1c6-8bda-4e2b-9c15-a32c28aab6d9", "title": "Analysis : High - wire diplomacy on possible Iran retaliation in the Israel - Hamas war draws in world - New Delhi Times - India Only International Newspaper", "date": "2024-08-15 01:30", "url": "https://www.newdelhitimes.com/analysis-high-wire-diplomacy-on-possible-iran-retaliation-in-the-israel-hamas-war-draws-in-world/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Iran’s threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers into a high-wire act of diplomacy Tuesday.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu’s hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea.\nIran for years has asked for Sukhoi Su-35 fighter jets.\nTehran has also sought Russia’s S-400 surface-to-air missile defense system, a possible deterrent for the American-made F-35 fighter jets flown by the U.S. and Israel."}, {"id": "78a14b86-7e48-413a-a286-f26aa42576fc", "title": "Deif is  fine : Hamas rejects Israeli claims of military chief assassination", "date": "2024-08-15 13:30", "url": "https://www.presstv.ir/Detail/2024/08/15/731416/Israeli-reports-Mohammed-Deif-assassination-", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "A senior member of Hamas has categorically dismissed Israeli reports on the assassination of the Palestinian resistance movement’s military leader, Mohammed Deif, in the occupying regime’s barbaric aggression on the besieged Gaza Strip.\nHamdan said Deif, the commander of al-Qassam Brigades, the military wing of Hamas, is \"fine\" after the Israeli officials and media outlets claimed he had been assassinated.\nDeif is among the founders of al-Qassam Brigades in the 1990s and has led the force for more than 20 years.\nSinwar was Hamas’s Gaza leader before he replaced Ismail Haniyeh who was killed in an Israeli attack in Tehran last month.\nThe high-profile Hamas military commander became the head of the al-Qassam Brigades in 2002 after Israel killed his predecessor, Salah Shahada."}, {"id": "5442deed-d3fb-4388-8830-f374ff2c8bea", "title": "Canadian group fundraises for bombed Kyiv children hospital", "date": "2024-08-15 13:30", "url": "https://www.cbc.ca/news/canada/toronto/kyiv-childrens-hospital-ukraine-canada-foundation-1.7293490", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Of those, two adults were killed in the hospital attack, including one doctor.\nWATCH | Canadians raise money for damaged children's hospital: Ukraine children’s hospital lost its dialysis unit to war.\nCanadians are trying to help Duration 2:02 Ukraine’s largest children’s hospital lost its entire dialysis unit in a suspected Russian missile strike.\nHospital staff clean up following a Russian missile strike on the Ohmatdyt Children's Hospital.\nWATCH | Missile attack on Ohmatdyt Children's Hospital kills dozens: Kyiv children’s hospital destroyed in Russian airstrikes, dozens killed Duration 2:06 A barrage of Russian missile attacks against Kyiv largely destroyed the Ukrainian city’s largest children’s hospital and left other buildings in the city in ruins."}, {"id": "4ba4bdde-5d98-494b-9141-0a8540d0b2b9", "title": "Russians Hit Odesa Port Infrastructure With Ballistic Missiles , One Wounded", "date": "2024-08-15 00:45", "url": "https://menafn.com/1108556520/Russians-Hit-Odesa-Port-Infrastructure-With-Ballistic-Missiles-One-Wounded", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In Odesa on Wednesday evening, Russians launched a missile attack on civilian infrastructure near the port, injuring one person.\nAccording to Ukrinform, the head of the Odesa regional military administration, Oleh Kiper, reported this in a Telegram message.\nAccording to him, the enemy attacked Odesa with a ballistic missile in the evening.\n'The aggressor targeted civilian infrastructure near the port.\nAs Ukrinform previously reported, an explosion and fire broke out in Odesa on Wednesday evening during an air raid alert."}, {"id": "a1caf6bb-64fd-4f61-b94f-b0f57b29e3f0", "title": "Swift makes London comeback : 90 000 fans , tight security", "date": "2024-08-15 09:45", "url": "https://www.citizen.co.za/news/swifts-london-comeback-90-000-fans-tight-security-after-vienna-scare/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Swift’s London comeback: 90 000 fans, tight security after Vienna scareApproximately 90 000 fans are expected to fill London's Wembley Stadium for the first of five shows.\nApproximately 90 000 fans are expected to fill London’s Wembley Stadium for the first of five shows, with heightened security measures in place, including additional ticket checks.\nLast week, all three of Swift’s shows in Vienna were called off after authorities uncovered an Islamic State-inspired plot involving explosives and knives, AFP reported.\nThe police are collaborating closely with venue security teams to ensure robust security and policing plans are in place, a spokesperson said.\nDuring her last London shows, Swift’s audience included high-profile attendees like Keir Starmer, then running for prime minister, and Prince William, who was celebrating his birthday with his children, Prince George and Princess Charlotte."}, {"id": "51972f06-ed5b-4858-9bca-0c2f54bdd5b7", "title": "Wounded Palestinians shot dead following drone strike in West Bank : Rights group", "date": "2024-08-15 13:30", "url": "https://www.presstv.ir/Detail/2024/08/15/731410/Wounded-Palestinian-shot-dead-drone-strike-West-Bank-right-group", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Israeli forces have shot at point-blank three Palestinians, including a 17-year-old boy, who had been severely injured in an earlier drone strike in the northern occupied West Bank.\nThis morning in Tammun in the occupied West Bank, an Israeli drone-fired missile targeted Mohammad Bashar Hasan Bani Odeh, 17.\nAs he lay injured, Israeli forces ordered a paramedic to leave at gunpoint, then shot Mohammad at point-blank range.\nThe latest development came a day after five Palestinian were killed by Israeli forces during raids in the West Bank cities of Tubas and Tammun.\nDrone attacks in the West Bank have become increasingly common in recent months."}, {"id": "0b1d3035-7423-4221-8308-e600c04db7a7", "title": "Man struck with glass bottle , robbed inside NYC subway station", "date": "2024-08-15 13:30", "url": "https://www.fox5ny.com/news/nyc-subway-station-robbery-queens", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A man was struck with a glass bottle before being robbed inside a NYC subway station in Queens, the NYPD said.\nThe attack happened on Saturday around 3 p.m. at the Woodhaven Boulevard subway station in Elmhurst.\nAccording to police, the 42-year-old man was approached by three individuals, who used a glass bottle to strike him before taking his wallet with about $300.\n2 men stabbed on subway trainMeanwhile, two men were stabbed on Thursday morning aboard a subway train, the NYPD said.\nThe stabbing happened just before 7 a.m. on a southbound Q train near the Times Square–42nd Street station."}, {"id": "0f1d885f-ab76-4add-bec8-541111f17ca1", "title": "2 killed , 4 injured in Israeli airstrike in S . Lebanon | Central India Premier English Daily", "date": "2024-08-15 05:30", "url": "https://www.centralchronicle.com/2-killed-4-injured-in-israeli-airstrike-in-s-lebanon/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Beirut, Aug 15 (UNI) Two people were killed, and four others wounded on Wednesday in an Israeli airstrike in southern Lebanon, Lebanese military sources said.\nThe sources, who spoke on condition of anonymity, said the Israeli airstrike targeted a car in a square in the town of Marjeyoun.\nThe Lebanese Red Cross and the Civil Defense then transferred the casualties to hospitals in Marjeyoun and the city of Nabatieh.\nThe situation escalated further after Israel’s attack on Dahieh in Beirut’s southern suburbs, killing a senior Hezbollah military commander, Fouad Shokor, and seven civilians.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "dcbedb70-0a07-4b0b-a0ca-11a25354bd4a", "title": "Terrorist Released in November Hostage Exchange Killed in Shechem | The Jewish Press - JewishPress . com | David Israel | 11 Av 5784 – Thursday , August 15 , 2024", "date": "2024-08-15 07:00", "url": "https://www.jewishpress.com/news/eye-on-palestine/palestinian-authority/terrorist-released-in-novembers-hostage-exchange-killed-in-shechem/2024/08/15/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "IDF forces operated overnight Thursday in the Balata camp in the city of Shechem to counter terrorism and arrest terrorists, during which two armed terrorists were eliminated in a drone airstrike.\nThe IDF spokesperson announced: “IDF forces acted tonight to counter terrorism in Shechem in the Samaria Division area.\nDuring the operation, an Air Force aircraft carried out several airstrikes in the villages of Tamun and Tubas, in which four armed terrorists were killed.\nThe fighters eliminated a wanted senior terrorist and exchanged fire with other terrorists in the area.\nDuring the operation, a David-type military vehicle ran over an explosive charge, and two IDF fighters were moderately injured and two others lightly."}, {"id": "f39af270-6850-426d-8117-856458874761", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 08:15", "url": "https://www.ksat.com/news/world/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Relatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a protest calling for their return in Tel Aviv, Israel, Thursday, Aug. 15, 2024.\nRecommended VideosWhite House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "d72857ec-bcde-4dc1-805a-4309f14c0f4f", "title": "Tensions remain high in the Middle East as Israel braces for looming attack", "date": "2024-08-15 00:30", "url": "https://www.kbzk.com/world/israel-at-war/tensions-remain-high-in-the-middle-east-as-israel-braces-for-looming-attack", "domain": "kbzk.com", "domain_classification": "Unknown", "message": "Tensions continue to climb in the Middle East following the recent killing of top leaders in Hezbollah and Hamas.\nIran and the allied Lebanese Hezbollah group say they are committed to launching retaliatory strikes on Israel in response to the alleged assassinations.\nThe U.S. is aiming to ease tensions in the region as negotiators prepare to resume cease-fire talks on Thursday.\nThe White House is now concerned that if Iran and Hezbollah decide to attack simultaneously, it could be a very different story.\nIn terms of conventional warfare, Israel still has a vast advantage over Hezbollah."}, {"id": "c3cc2a35-793e-4633-8120-6d6436dbe353", "title": "Britain says Ukraine can use donated weapons inside Russia", "date": "2024-08-15 14:00", "url": "https://economictimes.indiatimes.com/news/defence/britain-says-ukraine-can-use-donated-weapons-inside-russia/articleshow/112548642.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelBritish weapons can be used by Ukrainian forces in operations on Russian territory, Britain 's Ministry of Defence said on Thursday, but restrictions on the use of long-range Storm Shadow missiles remain.In the last two weeks, Ukraine has carried out the biggest foreign attack on sovereign Russian territory since World War Two, which one Ukrainian official has said is designed to create a buffer zone to protect its population against attack.Britain's then foreign minister David Cameron said in May that Ukraine had a right to use weapons provided by London to strike targets inside Russia , but the government had not commented before on Ukraine's use of the donated weapons by ground forces on Russian territory.Setting out the use of weapons deliveries in some of the most explicit terms to date, a spokesperson for Britain's Ministry of Defence said that Ukraine had a \"clear right of self-defence against Russia's illegal attacks\" and \"that does not preclude operations inside Russia\".\n\"We make clear during the gifting process that equipment is to be used in line with international law,\" the spokesperson said.The policy means that British tanks, anti-tank missiles, and other military equipment given to Ukraine can be used inside Russia as part of Ukraine's defence against Russia's invasion Restrictions on the use of British supplied long-range Storm Shadow missiles, which can only be used within Ukraine's internationally accepted borders, remain in place.Using swarms of drones, heavy artillery and tanks, Ukraine says it has captured more than 1,000 square kilometres (390 sq miles) of Russian territory since Aug. 6 in a move that Russian leader Vladimir Putin called a \"major provocation\".A British source said Ukrainian troops are thought to have used British Challenger 2 tanks inside Russia.The Ministry of Defence declined to comment on the use of British tanks inside Russia.Britain has pledged 7.6 billion pounds ($9.77 billion) in military assistance for Ukraine since February 2022 when the Russia invasion began, according to the House of Commons library, which publishes research.This includes 14 of Britain's main battle tanks last year along with armoured vehicles, ammunition, air defence systems, electronic warfare equipment and artillery.But Britain, like other Western governments, has so far refused to allow Ukraine to use long-range weapons because of the perceived risk of escalation in the conflict.Russia has said it would respond if Britain allowed Ukraine to strike Russia with British weapons.Ukrainian President Volodymyr Zelenskiy again this week urged Western allies to permit long-range missile strikes into Russia."}, {"id": "b3f31d03-a5e4-4cf1-af2f-ce5fb1ef85c6", "title": "Britain says Ukraine can use donated weapons inside Russia", "date": "2024-08-15 14:30", "url": "https://www.khaleejtimes.com/world/europe/britain-says-ukraine-can-use-donated-weapons-inside-russia", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "The policy means that British tanks, anti-tank missiles, and other military equipment given to Ukraine can be used inside Russia as part of Ukraine's defence against Russia's invasion.\nA British source said Ukrainian troops are thought to have used British Challenger 2 tanks inside Russia.\nThe Ministry of Defence declined to comment on the use of British tanks inside Russia.\nBut Britain, like other Western governments, has so far refused to allow Ukraine to use long-range weapons because of the perceived risk of escalation in the conflict.\nRussia has said it would respond if Britain allowed Ukraine to strike Russia with British weapons."}, {"id": "669c087c-b460-4d34-95e3-ef959477241a", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war – Winnipeg Free Press", "date": "2024-08-15 07:15", "url": "https://www.winnipegfreepress.com/world/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nRelatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a protest calling for their return in Tel Aviv, Thursday, Aug. 15, 2024.\n(AP Photo/Ariel Schalit)A cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "52330721-4054-4bc6-8da7-3d90739c3721", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 08:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an/article_91529f79-f1df-57b3-9e91-e3c77ee89e24.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Mediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warInternational mediators are set to hold a new round of talks aimed at halting the war in Gaza and securing the release of scores of hostages"}, {"id": "8f23f0f0-b9ec-4144-b454-102cb64c1039", "title": "Escalating Hamas assassinations spur panic and fears of collaborators in Gaza", "date": "2024-08-15 10:15", "url": "https://www.ynetnews.com/article/bjcjjsjcc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "On Wednesday, Hamas’s Interior Ministry took the unusual step of issuing a statement through the pro-HamasAl Jazeerachannel, expressing concern about a possible surge inGazans"}, {"id": "39593d33-6a6b-4dcc-98c9-cb032f9bf22e", "title": "Ukrainian presidential adviser denies country involvement in Nord Stream explosions", "date": "2024-08-15 11:30", "url": "https://www.theglobeandmail.com/world/article-ukrainian-presidential-adviser-denies-countrys-involvement-in-nord/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: A leak from the Nord Stream 2 pipeline on Sept. 28, 2022.The Associated PressUkrainian presidential adviser Mykhailo Podolyak denied his country’s involvement in explosions which damaged the Nord Stream 2 gas pipeline and instead pointed the finger at Russia in comments to Reuters on Thursday.\nOnly Russia,” Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\nOn Friday, the Wall Street Journal reported that top Ukrainian officials were involved in what happened.\n“Ukraine has nothing to do with the Nord Stream explosions,” Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts."}, {"id": "d092904d-0a58-4cfb-a3fd-2267e506f791", "title": "Ukraine presidential adviser denies Ukraine involvement in Nord Stream explosions", "date": "2024-08-15 10:15", "url": "https://www.swissinfo.ch/eng/ukraine-presidential-adviser-denies-ukraine", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine presidential adviser denies Ukraine’s involvement in Nord Stream explosionsreuters_tickers2 minutesBy Pavel PolityukKYIV (Reuters) – Ukrainian presidential adviser Mykhailo Podolyak denied his country’s involvement in explosions which damaged the Nord Stream 2 gas pipeline and instead pointed the finger at Russia in comments to Reuters on Thursday.\nOnly Russia,” Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n“Ukraine has nothing to do with the Nord Stream explosions,” Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts.\nRussia has already blamed the United States, Britain and Ukraine for the blasts, which largely cut Russian gas off from the lucrative European market."}, {"id": "66766ee1-a752-4fe6-9d12-d9824556203c", "title": "Ukraine presidential adviser denies Ukraine involvement in Nord Stream explosions", "date": "2024-08-15 09:45", "url": "https://www.yahoo.com/news/ukraine-presidential-adviser-denies-ukraines-085346287.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Only Russia,\" Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n\"Ukraine has nothing to do with the Nord Stream explosions,\" Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts.\nRussia has already blamed the United States, Britain and Ukraine for the blasts, which largely cut Russian gas off from the lucrative European market.\n(Reporting by Pavel Polityuk; Writing by Anastasiia Malenko and Pavel Polityuk; Editing by Jason Neely and Shounak Dasgupta)"}, {"id": "c5f261f4-6a0f-49ab-9a71-63e558671e76", "title": "Ten months of bloodshed : the Gaza war in numbers - World", "date": "2024-08-15 12:45", "url": "https://www.brecorder.com/news/40317663/ten-months-of-bloodshed-the-gaza-war-in-numbers", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "OCCUPIED JERUSALEM: The bloodiest ever Gaza war which broke out more than 10 months ago has taken an appalling human toll.\nAmong the Hamas fighters killed until July 16 were six brigade commanders, more than 20 battalion commanders, and around 150 company commanders, the military said.\nAt least 18 Israelis – soldiers and civilians, including Jewish settlers – have been killed in violence in the Israeli-occupied West Bank since the Gaza war began.\nIsrael pounds Gaza ahead of ceasefire talksTwenty-six civilians and 22 Israeli soldiers have died in the north in Hezbollah rocket and missile attacks from Lebanon.\nThe Israeli military has called up 300,000 reservists, 17 percent of them women, since the war began."}, {"id": "4a4a825e-9175-4867-baf0-7d495104e51f", "title": "Hamas plots to scuttle Doha summit , hoping to trigger regional war", "date": "2024-08-15 10:00", "url": "https://www.ynetnews.com/article/sy6uxnj50", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "As of now, there is no certainty that Hamas representatives will attend the summit.\nReports surfaced Wednesday suggesting that senior Hamas officials have decided not to participate, effectively reducing the event to a one-sided meeting.\nTehran has issued statements threatening to attack Israel if the Doha negotiations fail to produce results, setting the summit up for failure.\nThis scenario has been Hamas leader Yahya Sinwar’s goal since October 7, but his attempts to trigger a regional war have so far failed.\nSecond, even a limited response from Iran or Hezbollah could result in civilian casualties if a missile or rocket strikes Israel."}, {"id": "cb9e8c47-ae00-41c2-8da3-59f98135c290", "title": "Fire in Nuclear Plant in Ukraine sends Danger Signal for Escalation of War", "date": "2024-08-15 01:30", "url": "https://www.dailyexcelsior.com/fire-in-nuclear-plant-in-ukraine-sends-danger-signal-for-escalation-of-war/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The atomic bombing on Japan unleashed a nuclear arms race with several countries joining the nuclear club.\nFrom two nuclear weapons in 1945 their number rose to over 61000 in 1985 (USA 21392 and USSR 39197).\nMaximum nuclear weapons tests were carried out between 1960 to 1969 total 706 of which 418 by the US and 232 by USSR.\nPerceiving the threat and public pressure the major nuclear weapons countries the USA and USSR cut down the number of nuclear weapons.\nTime is now to promote peace and nuclear weapons abolition by joining the Treaty on the Prohibition of Nuclear Weapons (TPNW)."}, {"id": "39ab5e06-121d-4884-ac81-0b3a708cd3af", "title": "Israel news : 40 , 000 Palestinians killed in Gaza , ministry says", "date": "2024-08-15 12:00", "url": "https://www.ctvnews.ca/world/mediators-are-set-to-hold-new-gaza-ceasefire-talks-hoping-to-head-off-an-even-wider-war-1.7001554", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "A ceasefire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.\nAssociated Press writers Bassem Mroue in Beirut and Wafaa Shurafa in Deir al-Balah, Gaza Strip contributed to this report."}, {"id": "fce1c9f3-1d9c-411f-b1ff-4d827f1c9962", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 09:15", "url": "https://wtop.com/news/2024/08/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "DOHA, Qatar (AP) — A new round of peace talks aimed at ending the Gaza war started Thursday, White House…DOHA, Qatar (AP) — A new round of peace talks aimed at ending the Gaza war started Thursday, White House National Security spokesperson John Kirby said.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nAssociated Press writers Bassem Mroue in Beirut and Wafaa Shurafa in Deir al-Balah, Gaza Strip contributed to this report."}, {"id": "8f75c7ed-a32b-4800-b823-5b04c14e69c6", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 10:15", "url": "https://www.clickondetroit.com/news/world/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Relatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a protest calling for their return in Tel Aviv, Israel, Thursday, Aug. 15, 2024.\nRecommended VideosWhite House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "5a32b9d7-8016-4025-bd64-2e84a85c680e", "title": "Mediators to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 13:45", "url": "https://abc7ny.com/post/mediators-hold-new-gaza-cease-fire-talks-hoping-head-off-wider-war/15188910/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Mediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warInternational mediators were set to hold a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "66c617fb-8f92-416a-b06a-001d2415a32a", "title": "11 - year - old girl randomly stabbed eight times by stranger in London was tourist visiting from Australia", "date": "2024-08-15 01:30", "url": "https://nypost.com/2024/08/14/world-news/11-year-old-girl-stabbed-eight-times-by-stranger-london-was-tourist-visiting-from-australia/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A young girl brutally attacked by a knife-wielding maniac in the middle of bustling London Monday was a tourist visiting with her family from Australia, according to reports.\n3 Ioan Pintaru, 32, was charged with attempted murder for the stabbing of the 11-year-old tourist.\n3 The 11-year-old was randomly grabbed while strolling through bustling London.\n3 The stabbing happened in the heart of Leicester Square, a tourist hub which sees 2.5 million visitors weekly.\nLeicester Square sees about 2.5 million people pass through weekly, many of whom are tourists."}, {"id": "b00a5fe9-3515-41bc-856f-fc81c185e621", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 05:15", "url": "https://dunyanews.tv/en/World/830876-lebanon-says-two-killed-in-israeli-strikes", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Lebanon says two killed in Israeli strikesWorld World Lebanon says two killed in Israeli strikesLebanon's health ministry said Israeli strikes killed two people in country's south on Wednesday.\nFollow on Published On: Thu, 15 Aug 2024 07:30:18 PKTBEIRUT (Lebanon) (AFP) – Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures."}, {"id": "dc296b57-cc52-4bcf-bfc3-a6f9ec7ba636", "title": "In Beirut , US envoy says  no more time to waste  on Gaza ceasefire", "date": "2024-08-15 05:15", "url": "https://dunyanews.tv/en/World/830877-in-beirut-us-envoy-says-no-more-time-to-waste-on-gaza-ceasefire", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "In Beirut, US envoy says 'no more time to waste' on Gaza ceasefireWorld World In Beirut, US envoy says 'no more time to waste' on Gaza ceasefireVisiting US envoy Amos Hochstein warned Wednesday the clock was ticking for a Gaza ceasefire.\nFollow on Published On: Thu, 15 Aug 2024 07:31:59 PKTBEIRUT (Lebanon) (AFP) – Visiting US envoy Amos Hochstein warned Wednesday the clock was ticking for a Gaza ceasefire that could also help end 10 months of cross-border exchanges between Lebanon's Hezbollah and Israel.\nThat time is now,\" added the envoy, who in 2022 brokered a maritime border deal between Israel and Lebanon.\nHezbollah has repeatedly said it would only end hostilities once a Gaza ceasefire deal has been reached.\nThe US envoy also met Prime Minister Najib Mikati, who warned in a statement that \"Israeli intransigence is threatening efforts to stop the war\"."}, {"id": "c46a1ea2-0b76-45e0-b90b-0365095b0a83", "title": "Iran new president asserts right to retaliation in rare phone call with major US ally", "date": "2024-08-15 13:30", "url": "https://wfin.com/fox-world-news/irans-new-president-asserts-right-to-retaliation-in-rare-phone-call-with-major-us-ally/", "domain": "wfin.com", "domain_classification": "Unknown", "message": "Newly elected Iranian President Masoud Pezeshkian stressed his country’s right to retaliation against Israel in a rare phone call with the United Kingdom.\nThe Iranian president, however, insisted that a strong response to an attack “is a right of nations and a solution for stopping crimes and aggression,” Sky News reported.\nIran denounced Haniyeh’s murder and blamed Israel, even though Haniyeh died in what was later deemed a localized explosion that killed no Iranian citizens.\nTensions continue to slowly ratchet up across the week, with Iranian banks on Wednesday suffering a major cyberattack that all but crippled the institutions, according to Israeli outlet i24 News.\nFox News Digital’s Greg Norman and Bradford Betz and the Associated Press contributed to this report."}, {"id": "f879674e-d84a-4bc3-990a-bfdff11522ec", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 01:00", "url": "https://www.al-monitor.com/originals/2024/08/lebanon-says-two-killed-israeli-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nThe violence since October has killed some 570 people in Lebanon, most of them Hezbollah fighters but also including at least 118 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures."}, {"id": "ec5d7ae2-2a7a-498b-9c7b-edb9d5c172ae", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 10:15", "url": "https://www.durangoherald.com/articles/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "31a3d236-862c-4ae9-bfea-fb80d77154ad", "title": "Senor Biden adviser shuttles between Israel , Lebanon | Nation and World", "date": "2024-08-15 01:45", "url": "https://www.reviewjournal.com/news/nation-and-world/u-s-envoy-warns-lebanon-israel-tensions-could-easily-slip-out-of-control-3128691/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Senior Advisor to U.S. President Joe Biden Amos Hochstein, gestures as he meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(Hassan Ibrahim, Lebanese Parliament media office via AP)Senior Advisor to U.S. President Joe Biden Amos Hochstein, left, meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(AP Photo/Hussein Malla)Senior Advisor to U.S. President Joe Biden Amos Hochstein, gestures as he meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(AP Photo/Hussein Malla)Senior Advisor to U.S. President Joe Biden Amos Hochstein, left, meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\nHochstein also met with Lebanon’s caretaker Prime Minister Najib Mikati and Army chief Gen. Joseph Aoun Hochstein."}, {"id": "5a158997-3554-4f70-b0b4-ecae21b7817d", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 03:00", "url": "https://www.digitaljournal.com/world/taylor-swift-returns-to-stage-in-london-after-vienna-concert-plot/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Taylor Swift is on the European leg of a tour that began more than one year ago.\n- Copyright GETTY IMAGES NORTH AMERICA/AFP/File Brandon BellAkshata KAPOORTaylor Swift will return to the stage in London on Thursday to end the European leg of her “Eras” tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nFollowing the knife attack, Swift said she was “completely in shock” and at a “complete loss for how to ever convey my sympathies to these families”.\nFans without tickets will also not be allowed to “tay-gate” the event — the practice of Swift fans standing outside the venue during the live show to hear the music.\nLondon shows are off to a splendid start”."}, {"id": "6060e9d1-e494-469c-93ee-938fbc88aa1a", "title": "Israelis prepping bomb shelters in light of Iranian threats", "date": "2024-08-15 05:15", "url": "https://www.mnnonline.org/news/israelis-prepping-bomb-shelters-in-light-of-iranian-threats/", "domain": "mnnonline.org", "domain_classification": "Unknown", "message": "Meanwhile, Israelis are preparing their bomb shelters for potentially longer stays if Iran or one of its proxies attacks.\nBut many more who live in older homes have to stay in shared community bomb shelters.\nPochtar and his ministry team bring aid and biblical encouragement to people struggling in bomb shelters, especially near the conflict borders.\n“Visiting those bomb shelters, I can tell you it was a very difficult scene,” says Pochtar.\n“As Isaiah 40 says, ‘Comfort, comfort my people, says the Lord."}, {"id": "90a83b2a-e2d5-4cfc-a4da-e356629327ca", "title": "  Complete Hypocrisy : US Continues to Serve Israel as Fear of Middle East Conflict Grows", "date": "2024-08-15 02:45", "url": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict Grows'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict GrowsSputnik InternationalHamas has reportedly expressed that they no longer see the US as being able to bring about a deal that would solidify a ceasefire in the Gaza Strip.\nAnd following the assassination of one of their leaders, the US has continued to support Israel indefinitely.\n2024-08-15T01:32+00002024-08-15T01:32+00002024-08-15T01:32+0000analysisisraeliranhamasismail haniyehpalestiniansmiddle eastjoe bidenus hegemonyarms tradehttps://cdn1.img.sputnikglobe.com/img/07e8/08/0f/1119774903_0:319:3074:2048_1920x0_80_0_0_059d12146e3a96dfb114e385f1d91624.jpgTensions in the Middle East are growing as Israel anticipates a retaliatory attack from Iran in response to the assassination of Hamas political chief Ismail Haniyeh.\nThey want their basic human rights that are guaranteed to them under international law.\nThat once the agreement is basically in place, Israel decides on some other conditions that it wants."}, {"id": "6f728be4-5f0b-45ad-8bf4-c309c37e1ee2", "title": "Taylor Swift returns to stage in London after Vienna concert plot - Life & Style", "date": "2024-08-15 08:30", "url": "https://www.brecorder.com/news/40317637/taylor-swift-returns-to-stage-in-london-after-vienna-concert-plot", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "LONDON: Taylor Swift will return to the stage in London on Thursday to end the European leg of her “Eras” tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nFollowing the knife attack, Swift said she was “completely in shock” and at a “complete loss for how to ever convey my sympathies to these families”.\nShe has not yet commented on the decision to cancel the Vienna shows.\nLondon’s mayor Sadiq Khan told Sky News that the city was “going to carry on working closely with police, ensuring that the Taylor Swift concerts can take place in London safely”.\nLondon shows are off to a splendid start”."}, {"id": "b77e2dc6-b8ea-499c-a8ee-c7048eac5ef5", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 12:45", "url": "https://ktul.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "332f1095-f424-4ec5-8898-048ca3a4fed6", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot - New Delhi Times - India Only International Newspaper", "date": "2024-08-15 06:00", "url": "https://www.newdelhitimes.com/man-charged-with-attempted-murder-in-stabbing-of-11-year-old-girl-in-a-london-tourism-hot-spot/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "A man accused of stabbing an 11-year-old girl in London’s bustling theater district was charged Tuesday with attempted murder.\nIoan Pintaru put the girl in a headlock and stabbed her eight times, seriously wounding her, prosecutors said.\nThe girl was hospitalized and required plastic surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said.\nThe attack happened around 11:30 a.m. on Monady in Leicester Square, a tourism hot spot, outside a shop selling tea.\nThe girl’s mother wasn’t wounded, though she initially appeared to be because she was covered in her daughter’s blood, police said."}, {"id": "af70a1f9-68c6-4bb0-ba28-dd9dee8e1b49", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 04:15", "url": "https://www.stripes.com/theaters/europe/2024-08-14/britain-child-stabbing-14868369.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A police officer stands at the scene in Leicester Square, as a man was arrested with the accusation of stabbing an 11-year-old girl and 34-year-old woman, in London, Monday Aug. 12, 2024.\n(James Manning, PA/AP)LONDON — A man accused of stabbing an 11-year-old girl in London’s bustling theater district was charged Tuesday with attempted murder.\nIoan Pintaru put the girl in a headlock and stabbed her eight times, seriously wounding her, prosecutors said.\nThe girl was hospitalized and required surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said.\nThe attack happened around 11:30 a.m. Monday in Leicester Square, a tourism hot spot, outside a shop selling tea."}, {"id": "3a79893c-6f2a-4553-ba10-4f4fee8e13ad", "title": "Mediators hold new Israel - Hamas cease - fire talks in hopes of preventing wider war", "date": "2024-08-15 13:30", "url": "https://www.cbsnews.com/news/israel-gaza-cease-fire-talks-qatar/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "The group said it would still be open to speaking to mediators afterwards, depending on how the talks went.\nA cease-fire in Gaza would likely calm tensions across the region.\nSupporters of hostages who were abducted during the deadly October 7 attack by Hamas protest ahead of planned Israel-Gaza ceasefire talks to be hosted in Qatar, in Tel Aviv, Israel, August 15, 2024.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "d0efc6eb-59dd-48c5-bfe1-a5b9da90fc8c", "title": "Israel - Hamas : America Middle East defence rests on aircraft carriers", "date": "2024-08-15 13:45", "url": "https://www.afr.com/world/middle-east/america-s-middle-east-defence-rests-on-aircraft-carriers-20240813-p5k25o", "domain": "afr.com", "domain_classification": "Unknown", "message": "Jack Detsch Aug 15, 2024 – 9.38pm Save Share Copy link Copied Email LinkedIn Twitter Facebook Copy link Copied Share via...\nGift this article New Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.\nLoginWith the United States and Israel expecting a military response any minute from Iran or its proxies for the recent deaths of Hamas’ political leader and Hezbollah’s second-in-command, the most visible presence of the US military in the region is its hulking aircraft carriers.\nOn Sunday, US Defence Secretary Lloyd Austin said he had ordered the USS Abraham Lincoln carrier strike group to accelerate its deployment to the Middle East, leaving the Indo-Pacific empty of carriers.\nThe United States also sent an additional missile submarine to the region on Sunday night, according to a Pentagon statement."}, {"id": "2fc83fe9-f077-4ce0-85b7-ec6ca68f1182", "title": "Washington intensifies preparations for Middle East war with $20 billion arms sale to Israel", "date": "2024-08-15 04:30", "url": "https://www.wsws.org/en/articles/2024/08/15/nvin-a15.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The decision by the United States to supply arms worth $20 billion to Israel one day after announcing the deployment of a second aircraft carrier strike group to the region marks a further step towards a Middle East war.\n[AP Photo/Tsafrir Abayov]This is the inescapable conclusion that must be drawn from a review of the contents of the arms sale.\nThe Biden-Harris administration wants to ensure that Israel can continue pulverizing the people of the Middle East without missing a beat.\nThe latest arms sale was preceded by unmistakable signs that Washington wants a region-wide war.\nAmerican imperialism has already killed millions of people across the Middle East and Central Asia during three decades of uninterrupted war, and laid waste to entire societies."}, {"id": "b50aa1b4-13b0-42d8-b34b-6ed4a6b56de9", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 01:15", "url": "https://www.news-gazette.com/news/nation-world/man-charged-with-attempted-murder-in-stabbing-of-11-year-old-girl-in-a-london/article_4662ab14-8e8b-5e50-b5b9-008d197be4a1.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Scattered thunderstorms for the afternoon.\nWinds SSE at 10 to 20 mph.\n1 to 2 inches of rain expected..TonightVariably cloudy with scattered thunderstorms.\nWinds SSW at 5 to 10 mph.\nChance of rain 50%."}, {"id": "7012e5da-017d-4ec4-957d-c7063cf608a8", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 00:45", "url": "https://www.ajc.com/news/nation-world/man-charged-with-attempted-murder-in-stabbing-of-11-year-old-girl-in-a-london-tourism-hot-spot/A3CUTN6QEVGKNLJBMNIXPSOXW4/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "b9e6c3fb-5f4e-4ed8-947b-6f7152f2ede6", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war - LocalNews8 . com", "date": "2024-08-15 10:15", "url": "https://localnews8.com/news/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nAssociated Press writers Bassem Mroue in Beirut and Wafaa Shurafa in Deir al-Balah, Gaza Strip contributed to this report."}, {"id": "0cac4f77-80de-4a8b-9cc2-2d018359f466", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 06:00", "url": "https://www.jacarandafm.com/news/entertainment/taylor-swift-returns-stagelondonafterviennaconcertplot/", "domain": "jacarandafm.com", "domain_classification": "Unknown", "message": "Following the knife attack, Swift said she was \"completely in shock\" and at a \"complete loss for how to ever convey my sympathies to these families\".\nLondon's mayor Sadiq Khan told Sky News that the city was \"going to carry on working closely with police, ensuring that the Taylor Swift concerts can take place in London safely\".\nHe was referring to the 2017 bombing at an Ariana Grande concert that killed 22 people, some of them children.\nFans without tickets will also not be allowed to \"tay-gate\" the event -- the practice of Swift fans standing outside the venue during the live show to hear the music.\nLondon shows are off to a splendid start\"."}, {"id": "7dbe7ec8-830f-43c2-8369-58ec8d0987d3", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\"."}, {"id": "3b940dc6-bb3c-42ad-bd52-aa69d9207085", "title": "Mum of Romanian suspect in Leicester Square child attack says she  suffers together with ... ", "date": "2024-08-15 06:45", "url": "https://www.lbc.co.uk/news/ioan-pintaru-mother-leicester-square-stabbing/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Mum of Romanian suspect in Leicester Square child attack says she 'suffers together with victim's mother'Ioan Pintaru's mother has spoken out.\nPicture: Social media/AlamyBy Kit HerenThe mother of the Romanian man accused of stabbing a girl eight times in Leicester Square has said she shares the pain of the victim's family.\nLeicester Square, London, UK.\nCrime scene at a double stabbing in Leicester Square, London.\nPicture: AlamyThe stabbing took place at the TWG tea shop in the heart of the tourist hotspot, in what police believe was not a terror-related attack."}, {"id": "f5925eb5-d674-4fe8-b15e-ad1273ff6283", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 10:15", "url": "https://dunyanews.tv/en/Entertainment/830964-taylor-swift-returns-to-stage-in-london-after-vienna-concert-plot", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Taylor Swift returns to stage in London after Vienna concert plotEntertainment Entertainment Taylor Swift returns to stage in London after Vienna concert plotLast week, all three of Taylor's shows in the Austrian capital were cancelled due to threatsFollow on Published On: Thu, 15 Aug 2024 14:33:49 PKTLONDON (AFP) – Taylor Swift will return to the stage in London on Thursday to end the European leg of her \"Eras\" tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nFollowing the knife attack, Swift said she was \"completely in shock\" and at a \"complete loss for how to ever convey my sympathies to these families\".\nShe has not yet commented on the decision to cancel the Vienna shows.\nLondon's mayor Sadiq Khan told Sky News that the city was \"going to carry on working closely with police, ensuring that the Taylor Swift concerts can take place in London safely\".\nLondon shows are off to a splendid start\"."}, {"id": "7dc521f0-2d77-41f0-a1c4-4111b0e596da", "title": "Lebanon says three killed in Israeli strikes", "date": "2024-08-15 00:30", "url": "https://www.gjsentinel.com/news/national/lebanon-says-three-killed-in-israeli-strikes/article_e4566bbc-9b9a-5ab2-a755-2ec174567558.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Wednesday NightSome clouds this evening will give way to mainly clear skies overnight.\nA stray shower or thunderstorm is possible.\nSW winds shifting to ESE at 10 to 15 mph."}, {"id": "ce142bc5-ee1b-410a-95b0-26e1dbd9a0bf", "title": "Taylor Swift returns to London amid heightened security , no  tay - gate  allowed following Vienna plot", "date": "2024-08-15 05:30", "url": "https://www.malaymail.com/news/showbiz/2024/08/15/taylor-swift-returns-to-london-amid-heightened-security-no-tay-gate-allowed-following-vienna-plot/147053", "domain": "malaymail.com", "domain_classification": "Unknown", "message": "Around 90,000 fans will again pack London’s Wembley Stadium for the first date in the five-day run, with additional ticket checks and restrictions in place.\nFollowing the knife attack, Swift said she was “completely in shock” and at a “complete loss for how to ever convey my sympathies to these families”.\nShe has not yet commented on the decision to cancel the Vienna shows.\nLouise Kent and her niece Amelia Defontaine, 9, eat ice cream on the ‘Swiftie Steps’ at Wembley Stadium, in London August 13, 2024.\nLondon shows are off to a splendid start”."}, {"id": "e47badc5-c5c4-464f-9291-1478db7e62d0", "title": "More than 40 , 000 Palestinians have been killed in Gaza , the territory Health Ministry says", "date": "2024-08-15 14:30", "url": "https://www.kbtx.com/2024/08/15/more-than-40000-palestinians-have-been-killed-gaza-territorys-health-ministry-says/", "domain": "kbtx.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nAssociated Press writers Bassem Mroue in Beirut and Wafaa Shurafa in Deir al-Balah, Gaza Strip contributed to this report."}, {"id": "3cffd9f3-8681-4368-850e-2e19d15d1292", "title": "U . S . House investigating Google and Facebook for  censorship  of Trump assassination attempt * WorldNetDaily * by Cami Mondeaux , Washington Examiner", "date": "2024-08-15 02:15", "url": "https://www.wnd.com/2024/08/u-s-house-investigating-google-and-facebook-for-censorship-of-trump-assassination-attempt/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "(WASHINGTON EXAMINER) — House Republicans are demanding information from Google and Facebook executives after receiving “concerning reports” that the two companies may be engaging in censorship or misinformation about the assassination attempt against former President Donald Trump last month.\nIn a letter sent to Google CEO Sundar Pichai and Meta CEO Mark Zuckerberg, House Oversight Committee Chairman James Comer (R-KY) announced he would open an investigation to determine whether the two companies have generated “inaccurate or nongermane information” about the shooting at Trump’s Pennsylvania rally on July 13.\nThe investigation is one of several inquiries into the assassination attempt that resulted in the death of one rallygoer and injuries to two others.\nIn his request to Pichai, Comer cited reports from Google users who attempted to research the assassination attempt on Trump but instead were referred to results for failed attempts on other former presidents, such as Harry Truman, Gerald Ford, and Ronald Reagan.\nIn response, Comer requested information about how the Google search function is designed and “updated to take into account and incorporate recent newsworthy events.”"}, {"id": "c5f32555-1039-467a-b725-9cfdfeb3a500", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 01:00", "url": "https://www.mtdemocrat.com/news/national/lebanon-says-two-killed-in-israeli-strikes/article_4e82dd75-7752-5c30-b5a0-fae0177923b0.html", "domain": "mtdemocrat.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "3107d16f-ae2d-4545-95ad-391580ae9871", "title": "Swift return : Eras Euro tour leg to end with royal fans and strict security following Vienna plot", "date": "2024-08-15 13:30", "url": "https://www.news24.com/life/arts-and-entertainment/music/swifts-return-eras-euro-tour-leg-to-end-with-royal-fans-and-strict-security-following-vienna-plot-20240815", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Taylor Swift will return to the stage in London on Thursday to end the European leg of her Eras tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nTaylor Swift will return to the stage in London on Thursday to end the European leg of her Eras tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nFollowing the knife attack, Swift said she was \"completely in shock\" and at a \"complete loss for how to ever convey my sympathies to these families\".\nShe has not yet commented on the decision to cancel the Vienna shows.\nFans without tickets will also not be allowed to \"tay-gate\" the event - the practice of Swift fans standing outside the venue during the live show to hear the music."}, {"id": "49055dc1-c19d-4dc3-8695-40c1b7286ec3", "title": "  Ukraine missile , UAV attacks on Russian regions clearly of terrorist nature , says Russia", "date": "2024-08-15 02:00", "url": "https://news.webindia123.com/news/Articles/World/20240815/4225282.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Moscow has accused Kyiv of carrying out barbarous attacks devoid of military purpose to 'terrorise' Russian civilians, after the Ukrainian forces made advancements in southern Russia recently.\n\"The Kyiv regime continues to carry out its terrorist attacks with the single goal to terrorise the Russian civilians.\nIt is apparent that Ukraine's missile and UAV attacks on Russian regions are clearly of terrorist nature,\" Zakharova said, according to the readout of the briefing released by the Russian Foreign Ministry.\nTerming the strikes by Ukraine as 'terrorist attacks', Zakharova called on international organisations to condemn these acts.\nThe advisory stated that due to security concerns in the Bryansk, Belgorod and Kursk regions, all Indian nationals must temporarily relocate outside these regions."}, {"id": "1d779a5e-cd3d-436b-8ce7-c8043fca12b3", "title": "US envoy in Beirut to cool regional tensions - World", "date": "2024-08-15 04:30", "url": "https://www.dawn.com/news/1852372/us-envoy-in-beirut-to-cool-regional-tensions", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT / CAIRO: Washington on Wednesday sent an envoy to Lebanon to try and cool down tensions stemming from Iran and Hezbollah’s stated intentions to strike Israel in retaliation for the assassination of two key figures in the Middle East.\nSenior Iranian officials have said that only a ceasefire deal in Gaza would hold Iran back from direct retaliation.\nThat time is now,” added the envoy, who in 2022 brokered a maritime border deal between Israel and Lebanon.\nHezbollah and Iran have vowed to retaliate, sending tensions soaring.\nHezbollah has repeatedly said it would only end hostilities once a Gaza ceasefire deal has been reached."}, {"id": "76eef25d-4a72-488a-8361-93fb7b8e827a", "title": "Wheat rises after Russian attack on Ukrainian grain port", "date": "2024-08-15 12:00", "url": "https://www.marketscreener.com/news/latest/Wheat-rises-after-Russian-attack-on-Ukrainian-grain-port-47661988/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "* Concern about Ukrainian grain shipments after port attack* Soybeans rise on bargain buying, corn firmSINGAPORE, Aug 15 (Reuters) - Chicago wheat rose on Thursday as an overnight Russian attack on Ukraine's Odesa grain export port, and expectations of lower output in France, underpinned prices.\nCorn rose on spillover support from wheat, although gains in both were curbed by expectations of large global supplies.\n\"(The) Russian missile strike on the Ukrainian port of Odessa last night is the main factor supporting prices today,\" said one grain trader in Singapore.\nThe Chicago Board of Trade's most-active wheat rose 1.5% to $5.42-3/4 a bushel by 1115 GMT.\nSoybeans rose 0.6% to $9.74-3/4 a bushel, and corn rose 0.3% to $4.02-3/4 a bushel."}, {"id": "1ded66df-d66a-409d-bc88-8d6e388cd017", "title": "Wheat jumps almost 2 % as Russian attack on Ukrainian port supports prices", "date": "2024-08-15 03:30", "url": "https://www.marketscreener.com/news/latest/Wheat-jumps-almost-2-as-Russian-attack-on-Ukrainian-port-supports-prices-47655385/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"Russian missile strike on the Ukrainian port of Odessa last night is the main factor supporting prices today,\" said one grains trader in Singapore.\nRussian forces attacked port infrastructure in Ukraine's southern city of Odesa on Wednesday evening, injuring at least two people, Ukrainian officials said.\nThis year's rain-affected French soft wheat crop that is set to bring the smallest volume since the 1980s is also showing mixed milling quality, mainly for test weights, farm office FranceAgriMer said on Wednesday.\nTraders are monitoring drought in Ukraine, where producers warned that the corn crop could shrink by a third from last year if there is no rain relief.\nCommodity funds were net buyers of CBOT soybean, soymeal, corn and wheat futures contracts on Wednesday, according to traders."}, {"id": "cab0bf6c-9068-4efe-b56c-eb08b9e94603", "title": "Three killed in Israeli strikes in Lebanon - Newspaper", "date": "2024-08-15 05:30", "url": "https://www.dawn.com/news/1852341/three-killed-in-israeli-strikes-in-lebanon", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Lebanon’s health ministry said three people were killed on Wednesday in Israeli strikes on the country’s south, the latest cross-border violence amid heightened regional tensions and fear of a full-blown war.\nThe Lebanese health ministry said in a statement that an “Israeli enemy” strike on the southern town of Marjayoun killed two people and wounded four others, noting the toll was provisional.\nThe health ministry also said one person was killed and another wounded in an “Israeli” strike in south Lebanon’s Blida village.\nIt earlier reported that an “Israeli enemy” strike in Abbassiyeh, near the southern city of Tyre, wounded 17 people, including two teenagers and an eight-year-old girl, with four people in “critical” condition.\nThe group claimed a number of other attacks on Israeli troops and positions on Wednesday, including with “explosive-laden drones”."}, {"id": "e68b3890-a6df-4b9e-b169-8352d15c880c", "title": "Two men are stabbed in NYC Times Square subway station", "date": "2024-08-15 13:30", "url": "https://www.dailymail.co.uk/news/article-13746833/imes-square-nyc-stabbing-subway-station.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Two men have been stabbed at Times Square subway station in New York City.\nThe knife attack happened at the Manhattan transit hub around 7am Thursday, with the assailant said to be a teenage boy.\nTwo men have been stabbed in a knife attack in Times Square subway stationOne victim was stabbed in the hand while another was slashed in his abdomen.\nThey were rushed to a nearby hospital and their condition is reported as stable.\nIt's unclear what led up to the stabbing and whether the victims knew their attacker."}, {"id": "6b799d90-16e2-4234-85e2-df2336f5dedd", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 01:15", "url": "https://www.bendigoadvertiser.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\"."}, {"id": "b6fdbdb8-4ad0-4f56-81c6-3c7ac22b8529", "title": "Ukraine carries out largest drone strike on four Russian airfields", "date": "2024-08-15 09:45", "url": "https://bnn-news.com/ukraine-carries-out-largest-drone-strike-on-four-russian-airfields-259773", "domain": "bnn-news.com", "domain_classification": "Unknown", "message": "Ukraine confirmed on Wednesday, the 14th of August, that it carried out its largest ever long-range drone strike on four Russian military airfields overnight on Wednesday, with President Volodymyr Zelenskyy saying the strike was “timely”, report Reuters and The Kyiv Independent.\nThe strike was aimed at reducing Moscow’s ability to use warplanes to carry out cruise missile attacks against Ukraine, the Kyiv source said.\n“Thank you for the precise, timely and effective strikes on Russian airfields.\nThe attack on the airfields came as Ukrainian troops seek to advance in Russia’s Kursk region after launching a surprise operation that yielded their biggest battlefield success since 2022.\nAlso read: Ukraine continues Kursk incursion, which Biden calls “real dilemma” for PutinFollow us on Facebook and X!"}, {"id": "b8d2b820-180b-4224-889f-a754fd1c058c", "title": "Taylor Swift Spotted for 1st Time Since Canceled Vienna Concerts", "date": "2024-08-15 06:45", "url": "https://www.usmagazine.com/celebrity-news/news/taylor-swift-spotted-for-1st-time-since-canceled-vienna-concerts/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Taylor Swift surfaced in London after she was forced to cancel the Vienna leg of her Eras Tour.\n(Instead of yellow, though, Swift rocked an autumnal palette of reds and earthy green.\nAccording to TMZ, Swift had thrown a party for employees of her tour at Annabel’s, a private members’ club in London’s Mayfair neighborhood.\nSwift has been laying low since her three concerts in Vienna were canceled on Wednesday, August 7, after police discovered and averted a planned terrorist attack at Ernst Happel Stadium.\nThe tour is scheduled to resume on Thursday, August 15, for five shows at London’s Wembley Stadium."}, {"id": "5dc35295-3faa-4d9e-95cf-3e29c2e27cce", "title": "Operation Sea Strike , 2001", "date": "2024-08-15 12:30", "url": "https://www.stripes.com/history/archive_photo_of_the_day/2024-08-15/operation-sea-strike-2001-14852009.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Andy Dunaway/Stars and Stripes)Chulmae Range, South Korea, Nov. 27, 2001: Army Pfc.\nJoshua Turknett, Alfa Battery, 5th Battalion, 5th Air Defense Artillery, stationed at Camp Casey, looks over his live stinger missile prior to going to the Chulmae Range, Korea, during Operation Sea Strike.\nSoldiers from 5th Battalion, 5th Air Defense Artillery fired Stingers at the beachside training range on the West Sea.\nThe Stinger, which debuted in 1982, remains a core of the Army’s low-altitude air defense.\nRead the 2001 article and find additional photos here."}, {"id": "cbf00962-455d-40cf-9f40-e5fccc4b1da5", "title": "New talks aimed at stopping Israel - Hamas war to take place on Thursday", "date": "2024-08-15 08:00", "url": "https://www.impartialreporter.com/news/national/24519440.new-talks-aimed-stopping-israel-hamas-war-take-place-thursday/", "domain": "impartialreporter.com", "domain_classification": "Unknown", "message": "The US, Qatar and Egypt are to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war nears 40,000.\nBoth sides have agreed in principle to the plan, which President Joe Biden announced on May 31.\nThe war began when Hamas-led militants stormed across the heavily-guarded border on October 7 in an attack that shocked Israel’s vaunted security and intelligence services.\nMany fear a repeat after the killing of Hamas leader Ismail Haniyeh, who was visiting Iran for the inauguration of its new president.\nHezbollah has meanwhile vowed to avenge the killing of its commander, Fouad Shukur, raising fears of an even more devastating sequel to the 2006 war between Israel and the militant group."}, {"id": "e06b7101-fe6a-48ec-a1ae-fc87d716cc86", "title": "New talks aimed at stopping Israel - Hamas war to take place on Thursday", "date": "2024-08-15 08:15", "url": "https://guernseypress.com/news/world-news/2024/08/15/new-talks-aimed-at-stopping-israel-hamas-war-to-take-place-on-thursday/", "domain": "guernseypress.com", "domain_classification": "Unknown", "message": "International mediators are set to hold a new round of talks on Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages.\nThe US, Qatar and Egypt are to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war nears 40,000.\nHamas has not said whether it will participate, accusing Israel of adding new demands to an evolving proposal that had US and international support.\nThe war began when Hamas-led militants stormed across the heavily-guarded border on October 7 in an attack that shocked Israel’s vaunted security and intelligence services.\nMany fear a repeat after the killing of Hamas leader Ismail Haniyeh, who was visiting Iran for the inauguration of its new president."}, {"id": "db6fc363-8e14-4d4a-838d-627fff240ab4", "title": "Israel - Hamas war latest : Palestinian death toll surpasses 40 , 000 as mediators hold cease - fire talks", "date": "2024-08-15 13:30", "url": "https://www.smdailyjournal.com/news/national/israel-hamas-war-latest-palestinian-death-toll-surpasses-40-000-as-mediators-hold-cease-fire/article_f9422c0e-974a-5619-8919-6c3ebd5e559f.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "885958fe-878c-4890-bb37-6ce4003fb022", "title": "Vigil held for mother stabbed to death by son in Brandon , family hopes for death penalty", "date": "2024-08-15 03:15", "url": "https://www.fox13news.com/news/vigil-held-mother-stabbed-death-son-brandon-family-hopes-death-penalty", "domain": "fox13news.com", "domain_classification": "Unknown", "message": "Family, friends and neighbors gathered with roses and candles Wednesday to remember a mother stabbed to death by her own son.\nRELATED: Man accused of stabbing mother to death faces judge amid family violence 'crisis'\"My mom was a good mom.\n\"I want the death penalty.\nI want the death penalty.\nI will not stop until he gets the death penalty,\" Blair said."}, {"id": "864f8819-9c3a-4fb4-a49e-168046b1b665", "title": "Russia euphoric as  British Challenger 2 tank destroyed  | World | News", "date": "2024-08-15 11:30", "url": "https://www.express.co.uk/news/world/1936416/russia-euphoric-british-challenger-2", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "A British Challenger 2 tank has been destroyed in battle, according to pro-Russian sources.\nA British Challenger-2 tank has been destroyed in a battle inside Russia’s Kursk region for the first time, say pro-Putin war reporters.\nEpic war footage shows a huge battlefield explosion as the alleged UK tank was reportedly deployed by the Ukrainian 82nd Brigade.\nThe Challenger-2 was hit by a low-flying Russian Lancet-3 kamikaze drone, according to Svarshchiki - or Welders - Telegram channel.\n“Our technically savvy operator jewelled the Lancet-3 into the upper hemisphere with a dive of the upper hull armour plate,” the channel said."}, {"id": "53c7b394-be52-4253-8b04-60f55c2ccf1d", "title": "Gaza ceasefire talks resume between Israel and Hamas", "date": "2024-08-15 09:45", "url": "https://www.thetimes.com/world/israel-hamas-war/article/gaza-ceasefire-israel-hamas-war-m2jr6ggjf", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "Talks to end the war in Gaza resumed on Thursday in Qatar as western powers urged both sides to take a deal that could prevent a wider conflict between Iran and Israel.\nThe latest round of negotiations to end the ten-month war were taking place amid escalating tensions between Israel, Iran and its ally Hezbollah in Lebanon.\nAs they got under way in the Qatari capital Doha, the death toll from the war in Gaza passed another grim milestone, with the health authorities there saying it had surpassed 40,000 Palestinians.\nThe US is pressuring both sides to accept a truce, which could forestall attacks by Iran and Hezbollah against Israel after the assassinations of the Lebanese militant group’s military commander Fuad Shukr in Beirut and"}, {"id": "cbb449c9-d255-434b-97a9-6925bded7507", "title": "Ukraine advance into Russia creates strategic buffer . ", "date": "2024-08-15 07:15", "url": "https://tribune.com.pk/story/2488189/ukraines-advance-into-russia-creates-strategic-buffer", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Russian forces that began a full-scale invasion of Ukraine in 2022 had been grinding out steady gains all year.\n\"We continue to advance further in Kursk,\" Zelenskiy wrote on Telegram, \"from one to two km in various areas since the start of the day\".\nIn the Russian border region of Belgorod, governor Vyacheslav Gladkov declared a state of emergency.\nThe unprecedented incursion carries major risks for Russia, Ukraine and the West, which is keen to avoid a direct confrontation between Russia and the U.S.-led NATO military alliance that has helped arm Ukraine.\nThe offensive could leave Ukrainian forces more exposed on other parts of the front, where Russia has been slowly adding to the 18% of Ukrainian territory it now controls."}, {"id": "f4279213-b8d5-4e20-a8e5-f8f2f8335fb6", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Canberra Times", "date": "2024-08-15 02:15", "url": "https://www.canberratimes.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "cf265e30-f631-4e24-8aff-51d17b6a2a98", "title": "Iowa man allegedly shoots his father in face after complaint about smelly feet", "date": "2024-08-15 08:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/15/iowa-man-shoots-father-smelly-feet", "domain": "theguardian.com", "domain_classification": "International", "message": "A man shot his father in the face after the victim complained about the son’s smelly feet, according to authorities in Iowa.\nHe told officers who interviewed him at the hospital that his son had shot him after the pair had argued at home over the younger man’s “stinky feet”.\nCarpenter himself then allegedly confirmed to police that he had been in the family’s living room when his father – while in a motorized scooter – said the son’s feet smelled badly.\nAt that point, Carpenter allegedly said, he walked to his bedroom, grabbed a gun and returned to his father.\nOfficers arrived at the Carpenter family home after the son called police to report the shooting."}, {"id": "f8d7cb03-ddac-4cfb-ab7a-f5b06199b546", "title": "Sikh activists believe they are in danger - The Jerusalem Post", "date": "2024-08-15 02:45", "url": "https://www.jpost.com/opinion/article-814766", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "INDIA’S PRIME Minister Narendra Modi gestures during the swearing-in ceremony at the presidential palace in New Delhi in June.\nThe Indian embassy in Washington and Modi’s office did not respond to repeated requests for comment.\nIn 2019, India declared Sikhs for Justice an unlawful association, citing its involvement in extremist activities.\nBains told Reuters she isn’t sure whether she experienced transnational repression by the Indian government.\nIn May, the California Assembly passed a bill she introduced that would train state law enforcement to identify and respond to transnational repression."}, {"id": "27204743-d3df-4103-8801-9cd48a071c9c", "title": "Israel - Hamas war latest : Mediators hold cease - fire talks as Palestinian death toll nears 40 , 000 – Winnipeg Free Press", "date": "2024-08-15 07:15", "url": "https://www.winnipegfreepress.com/world/2024/08/15/israel-hamas-war-latest-mediators-hold-cease-fire-talks-as-palestinian-death-toll-nears-40000", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The United States, Qatar and Egypt were to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war surpassed 40,000.\nThe Lebanese Hezbollah militant group Thursday said it fired salvos of Katyusha rockets targeting Shamir for the first time.\nHezbollah announced three other attacks on Israeli military positions near the tense border with Lebanon, including an attack using exploding drones.\nPalestinian death toll tops 40,000 in Israel-Hamas war, says Health Ministry in GazaDEIR AL-BALAH, Gaza Strip — The Health Ministry in Gaza says more than 40,000 Palestinians have been killed in the Israel-Hamas war.\nThe Israeli military said aircraft killed two gunmen who were identified as a threat to troops operating in the city of Nablus."}, {"id": "a063fd31-06fb-4ae4-a34c-7076b88535fb", "title": "Direct spending on TV , film plummets 37 % in Georgia , hurt by strikes", "date": "2024-08-15 00:45", "url": "https://www.ajc.com/news/business/direct-spending-on-tv-film-plummets-37-in-georgia-hurt-by-strikes/XFP5TWWDT5EFXBYKVXC7OXZAWA/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "72a35cf9-889d-40c3-b64d-032dcef0a60d", "title": "New Gaza ceasefire talks begin in Qatar , aiming to head off wider war", "date": "2024-08-15 11:30", "url": "https://www.theglobeandmail.com/world/article-new-gaza-ceasefire-talks-begin-in-qatar-aiming-to-head-off-wider-war/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "8e8d9413-248c-4194-95d1-6a9a5d5f3a71", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Standard", "date": "2024-08-15 03:15", "url": "https://www.standard.net.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "3866995e-32a0-41d8-a617-2e9fed018906", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds."}, {"id": "d1b32064-e273-4053-b789-7a2951822309", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=2596", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds."}, {"id": "8af541a3-31d5-4c0a-8f04-1b91aec64574", "title": "Israel - Hamas war latest : Mediators hold cease - fire talks as Palestinian death toll nears 40 , 000", "date": "2024-08-15 07:45", "url": "https://isp.netscape.com/news/world/story/0001/20240815/9038f179921cfed1241ef3acac7f87ff", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Palestinian death toll surpasses 40,000 as mediators hold cease-fire talksThe White House says a new round of talks aimed at halting the Israel-Hamas war has resumed in Doha and is expected to run into Friday.\nThe Lebanese Hezbollah militant group Thursday said it fired salvos of Katyusha rockets targeting Shamir for the first time.\nHezbollah announced three other attacks on Israeli military positions near the tense border with Lebanon, including an attack using exploding drones.\nPalestinian death toll tops 40,000 in Israel-Hamas war, says Health Ministry in GazaDEIR AL-BALAH, Gaza Strip — The Health Ministry in Gaza says more than 40,000 Palestinians have been killed in the Israel-Hamas war.\nThe Israeli military said aircraft killed two gunmen who were identified as a threat to troops operating in the city of Nablus."}, {"id": "cb1f2051-d4a6-4cad-b2aa-a8de1b46c34c", "title": "Iran Islamic Revolutionary Guard Corps military advisor killed in Syria", "date": "2024-08-15 14:30", "url": "https://news.am/eng/news/838245.html", "domain": "news.am", "domain_classification": "Unknown", "message": "Bloomberg: Germany suspects Russia in sabotage at 2 military basesThailand ex-leader’s daughter to be nominated new PMUkraine opens military commandant's office in territory it controls in Russia’s Kursk RegionHundreds of thousands of women in India march overnight after brutal murder of young female doctorNew IDBank Branch in the City of HrazdanMore than 720 people evacuated in Russia’s Kursk Region in one dayDollar continues losing ground in ArmeniaAbout 1 million Puerto Rico homes left without power after Hurricane ErnestoHarris campaign hires Afghan American woman to work with Muslim, Arab votersRecord number of candidates to run in Sri Lanka presidential electionIran Islamic Revolutionary Guard Corps military advisor killed in SyriaGeorgia-Azerbaijan joint company to manage section of Baku-Tbilisi-Kars railwayMFA: Armenia highly values enhancement of multiform cooperation with IndiaArmenia official on Brazil man’s death: If someone acted unprofessionally, he should definitely be held accountable2 Germany airports temporarily suspend flights due to climate activistsIsraeli hostages’ families hold rally in Tel Aviv, JerusalemArmenia to have Father's Day, it will be celebrated on June 17Iran-linked hackers attacked Trump and Biden campaigns, Google saysUcom Successfully Concludes uGeneration Summer Internship ProgramRFE/RL: OSCE Minsk Group issue can be considered in context of signing peace treaty, Armenia MFA saysAxios: Trump speaks to Netanyahu about Gaza ceasefire deal, sources sayAmbassador of Iran announces signing of comprehensive strategic partnership treaty with Russia soonGurgen Arsenyan is appointed Armenia Ambassador to RussiaAzerbaijan Air Force conducts military exercisesAzerbaijan informs about earthquake in Caspian SeaFord no longer going to give up electric carsNewspaper: Pro-Western forces to start signature campaign to put Armenia’s EU membership issue to referendumIndia’s Global Climate LeadershipEurasian Economic Commission: Positive trade balance in services in Armenia decreased 19.1%CSTO military exercises kick off in Russia, Armenia not participatingJ.K. Rowling, Donald Trump, Elon Musk named in cyberbullying lawsuit filed by Algeria boxer Imane Khelif2 fighter jets crash in FranceSaudi Arabia company to build clean-hydrogen-powered skyscraper in EgyptArmenia Central Bank to put into circulation silver coins dedicated to Charles Aznavour, Ervand KocharNorth Korea to open border for foreign tourists in December, tour operators sayPartition Horrors Remembrance Day Exhibition at the Indian Embassy in YerevanUS announces aim to 'turn the temperature down' in Middle EastIran to not attend Gaza ceasefire talksBiden's senior adviser holds talks with Lebanon parliament speakerDollar drops, euro rises in ArmeniaNew Zealand charity unknowingly distributes candies with potentially lethal dose of methamphetamineIndia launches app that warns people of incoming herds of wild elephantsThailand Constitutional Court removes PM from officeArtsakh ombudsman: Azerbaijan has destroyed Mokhrenes village of KarabakhRussia limits gasoline exports until December 31Armenia seismic service chief: 45% of Yerevan buildings are highly susceptible to earthquakes4.2-magnitude quake hits southern IranRussia MFA spox: Moscow hopes UN request for access to Kursk Region is not performanceGaza ceasefire deal could deter Iran from attacking Israel, says BidenNewspaper: Armenia ambassador to Ukraine working illegally for 2 months nowDocument signed with Russia on implementation of border control on Armenia’s Goris-Kapan motorway?\nBiden comments for first time on Ukraine troops’ attack on Russia's Kursk RegionMikayel Minasyan, former ambassador, remains one of mostly discussed and prominent figures in Armenia todayNo tire tracks, UAV fragments found in burning reactor of Zaporizhzhia nuclear plant, IAEA experts sayIRGC: Fearing Iran's response, Azerbaijan denies presence of Israeli military in its territoryTropical Storm Ernesto batters northeast CaribbeanLiquefied gas price in Armenia up 54.3% in JulyWafa: Death toll in Gaza has reached 40,000Dollar, euro gain value in ArmeniaFactor.am: Constitutional amendments’ process is Armenia’s internal matter, MFA saysSameep Shastri: Armenia can become one of gateways to Europe for Indian exportersDeputy minister of economy: Only 49.5% of arable land in Armenia is cultivatedConverse Bank has joined the UN Global Compact InitiativeAbout 32,000 Indians are issued entry visas to Armenia in past 7 monthsTurkey confident that there will not be large-scale war in Middle East, US ambassador saysHamas representative in Tehran: Iran response to Haniyeh assassination will be definite and decisive3 civilians killed during clashes on Pakistan border, Afghanistan saysNumber of people hospitalized due to abnormal heat increases sharply in most popular Italy tourist citiesUcom Launches Special Promotion for Students Ahead of Academic YearTourist to be fined for carving family members' initials "}, {"id": "2d1b9186-bcc6-4f55-93a9-d84ea8146834", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | Illawarra Mercury", "date": "2024-08-15 02:00", "url": "https://www.illawarramercury.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "illawarramercury.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "5c99f783-f6e4-4446-955d-adbad80bf53e", "title": "Pressure for deal builds ahead of new Gaza truce talks", "date": "2024-08-15 12:45", "url": "https://www.naharnet.com:443/stories/en/307280-pressure-for-deal-builds-ahead-of-new-gaza-truce-talks", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Pressure built for a Gaza ceasefire to be agreed at talks set to resume Thursday in Qatar to avert a wider war involving Iran, after months of fighting between Israel and Hamas militants.\nUS news website Axios, citing U.S. officials, reported that former president Donald Trump, who is seeking re-election, spoke with Netanyahu on Wednesday and discussed the Gaza hostage and ceasefire deal.\nAsked whether a ceasefire agreement in Gaza could stave off an Iranian attack on Israel, Biden said: \"That's my expectation.\"\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 the Israeli military says are dead.\nHezbollah said two of its fighters were killed, and the Israeli military said its air force had \"struck Hezbollah military structures.\""}, {"id": "7421ca9b-eaaa-40eb-b5a9-41e50205242b", "title": "Germany issues arrest warrant for Ukrainian over Nord Stream sabotage", "date": "2024-08-15 11:00", "url": "https://www.yahoo.com/news/germany-issues-arrest-warrant-ukrainian-102138653.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The NewsGerman authorities reportedly issued an arrest warrant for a Ukrainian man over the 2022 bombing of the Nord Stream pipeline, an attack that disrupted gas supplies to Europe.\nMoscow, Kyiv, Washington, and London have all variously traded blame over the act of sabotage, and though Berlin is after a Ukrainian man — whom German media said subsequently escaped back to Ukraine — Polish officials have previously argued signs of Ukrainian involvement were a “false flag” planted by Russia.\nThe Wall Street Journal, meanwhile, reported that Ukraine’s President Volodymyr Zelenskyy approved a plan to blow up the pipeline before later calling it off, only for his own commander-in-chief to go ahead anyway.\nKyiv denied those allegations."}, {"id": "170d46cd-b753-46fb-9171-a85f5e3187c6", "title": "Russian family who fled Ukraine cross - border attack recalls panic , chaos", "date": "2024-08-15 02:45", "url": "https://www.voanews.com/a/russian-family-who-fled-ukraine-s-cross-border-attack-recalls-panic-chaos-/7743419.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Marina and her family were used to hearing the distant boom of explosions from their village in Russia's Kursk region, just a few kilometers from the Ukrainian border.\nUkrainian soldiers and armored vehicles began pouring into the region in the early hours of that morning, mounting the biggest cross-border attack on Russian soil since World War II.\nBut for many living in the border region, the attack came as a surprise.\nThe family reached Kursk in the early morning, where they found accommodation in a center for evacuees.\nRussia says more than 120,000 people have fled fighting in the region, but Yevgeny said many of his neighbors were stuck."}, {"id": "3f21ed83-922d-41ee-95ea-a0827b71c65d", "title": "Butler footage shows police frustrated with Secret Service", "date": "2024-08-15 05:15", "url": "https://www.christianpost.com:443/news/butler-footage-shows-police-frustrated-with-secret-service.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home News Bodycam footage shows police frustrated with Secret Service after Trump assassination attemptBody camera footage shows Butler Township police officers scrambling to gain rooftop access to reach the gunman who tried to assassinate former President Donald Trump last month, expressing frustration with the U.S. Secret Service for failing to heed their warnings to secure the roof.\nIn the footage, officers call for a ladder to gain access to the roof moments after the assassination attempt.\n\"The U.S. Secret Service appreciates our local law enforcement partners, who acted courageously as they worked to locate the shooter that day,\" the spokesperson stated.\nCrooks was later killed by a Secret Service sniper.\nIn a letter to Acting Secret Service Director Ronald Rowe, Hawley said Secret Service whistleblowers told him the lead site agent responsible for security at the Butler rally had a reputation for incompetence."}, {"id": "c6d17f49-40f4-433f-8a87-1bd46dc86649", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 04:30", "url": "https://www.channelnewsasia.com/world/taylor-swift-london-vienna-concert-plot-4547486", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "LONDON: Taylor Swift will return to the stage in London on Thursday (Aug 15) to end the European leg of her \"Eras\" tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nAround 90,000 fans will again pack London's Wembley Stadium for the first date in the five-day run, with additional ticket checks and restrictions in place.\nThree alleged Islamic State sympathisers have been arrested on charges of plotting the atrocity, which was thwarted with the help of United States intelligence.\nFollowing the knife attack, Swift said she was \"completely in shock\" and at a \"complete loss for how to ever convey my sympathies to these families\".\nShe has not yet commented on the decision to cancel the Vienna shows."}, {"id": "570f7386-39df-4838-8480-d2dbcafeec7a", "title": "Israel - Hamas war latest : Mediators hold cease - fire talks as Palestinian death toll nears 40 , 000", "date": "2024-08-15 09:45", "url": "https://www.gjsentinel.com/news/us/israel-hamas-war-latest-mediators-hold-cease-fire-talks-as-palestinian-death-toll-nears-40/article_115362d3-95ab-54fb-9664-331a63f861be.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "International mediators were set to hold a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict"}, {"id": "e4e8f950-d707-4bce-949e-c38666aa6f03", "title": "Iranians Rooting For Israel Against Their Monstrous Regime", "date": "2024-08-15 05:30", "url": "https://www.frontpagemag.com/iranians-rooting-for-israel-against-their-monstrous-regime/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "While Iranians endure a cratering economy, with the leaders of the regime have been enriching themselves.\nAyatolah Khamenei now controls a “financial empire” worth $95 billion, according to a six-month investigation by Reuters.\nAs there are currently Iranians on death row for speaking to Israeli media, we cannot publish the names of the Iranians interviewed for their own protection.\n“Overall, the Iranian people are extremely pro-Israel and reject the regime’s warmongering, but multiple Iranians expressed concern about operating on Iranian soil.\nThis time, unlike in the past, if Israel delivers such a blow, a humiliated, defeated, and impoverished regime will not be able to suppress its own people."}, {"id": "4a09a631-f383-4f3f-bad8-d4f589512547", "title": "Queensland police dog Kaos , who survived 2020 stabbing attack , dies aged 12", "date": "2024-08-15 03:15", "url": "https://www.9news.com.au/national/brisbane-police-dog-kaos-who-survived-stabbing-attack-dies-aged-12/6bbe4010-55f6-47d0-b41b-28c5cf43847a", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Beloved Queensland police dog Kaos has died aged 12, just weeks after being decorated for outstanding service to the police force .\nKaos captured Australians' hearts when he survived a near-fatal stabbing attack while taking down two suspects in Brisbane on February 2, 2020.\nKaos with his handler Senior Constable Jim Griffiths, who Queensland Police have described as a \"formidable team\".\nQueensland Police have paid tribute to Kaos as \"fierce while tracking offenders\" but \"a sweet and soft soul\" when off-duty.\n\"PD Kaos and Senior Constable Griffiths were best mates and a formidable team,\" the statement reads."}, {"id": "423c17fc-12f0-442f-90a9-5f0e7a248608", "title": "The Biden - Harris Regime Latest Betrayal of Israel Will Make Your Blood Run Cold – PJ Media", "date": "2024-08-15 01:30", "url": "https://pjmedia.com/robert-spencer/2024/08/14/the-biden-harris-regimes-latest-betrayal-of-israel-will-make-your-blood-run-cold-n4931652", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "The Biden-Harris regime is supposed to be an ally of Israel and occasionally sends signals to that effect, but its real loyalties are not hard to figure out.\nThe Biden-Harris regime is all about holding and increasing its power, and Israel is in the way of that aspiration right now.\nAnd now it is being accused of a betrayal so immense that it makes those others look like friendship.\nTo a regime that has never shown good faith and has repeatedly vowed the destruction of America as well as Israel?\nAdvertisementAre those two dozen people suffering unimaginable horrors in Iranian prisons today because of the Biden-Harris regime’s anxiousness to betray Israel?"}, {"id": "0bfecbb7-67ed-4c55-93d9-59098a756b2b", "title": "Germany Locks Down Military Base , Claims Russia Tampered with Water", "date": "2024-08-15 00:45", "url": "https://www.breitbart.com/politics/2024/08/14/germany-locks-down-military-base-claims-russia-tampered-with-water/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "German politicians have pointed the finger at Russia after two military bases in the country had suspected incursion incidents overnight, with base drinking water apparently targeted.\nA German army air base was placed on lockdown for several hours after water testing detected “abnormal values” in the on-base drinking water, and a man-sized hole was discovered in the fence surrounding the facility’s water plant.\nA second base, a NATO airbase hosted in Germany was pulled into the incident when there was a foiled attempt to gain entry overnight.\nA spokesman said: “As the drinking water system was showing unusual values, the drinking water supply in the barracks was cut off”, a memo was circulated ordering staff at the base not to drink the tap water in any circumstance.\nThe base was searched and no intruder was found, but a man-sized hole was discovered in the fence surrounding the base’s drinking water plant on Wednesday morning."}, {"id": "59921201-ddbd-417b-ad3f-d52c0ba7b056", "title": "Israel : Hamas Launched Rockets at Tel Aviv from Humanitarian Area", "date": "2024-08-15 00:45", "url": "https://www.breitbart.com/politics/2024/08/14/israel-hamas-rockets-aimed-at-tel-aviv-launched-from-humanitarian-area/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hamas launched rockets at Israel on Tuesday from a protected humanitarian area in the Gaza Strip, Israel said on Wednesday, further proof of the degree to which Hamas is violating international law and endangering civilians.\nTwo rockets were launched from Gaza towards Tel Aviv on Tuesday, the first time Israel’s major coastal city had been targeted since May.\nThe IDF said in a statement:Earlier today (Tuesday), Hamas terrorists opened fire toward the Humanitarian Route in the area of Rafah.\nConsequentially, movement and coordination along the Humanitarian Route has been temporarily halted as the area now constitutes an active combat zone.\nIn a further statement on Wednesday, the IDF said:Yesterday (Tuesday), the Hamas terrorist organization launched rockets from the Humanitarian Route in Khan Yunis toward central Israel."}, {"id": "45a03eb8-c071-4f99-bd3b-5985cc872be1", "title": "Arrest made in Manchester shooting", "date": "2024-08-15 03:30", "url": "https://www.unionleader.com/news/crime/arrest-made-in-manchester-shooting/article_fce6d6b8-5a5f-11ef-bda1-fb48755800f0.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "41d85f07-b082-42cc-9b8a-edae18ea90cf", "title": "Taylor Swift set for emotional London return after terror threat", "date": "2024-08-15 13:30", "url": "https://www.timeslive.co.za/news/world/2024-08-15-taylor-swift-set-for-emotional-london-return-after-terror-threat/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "78331351-5d45-4e88-a78a-71a073afcd8e", "title": "Israel - Hamas war : More than 40 , 000 Palestinians have been killed in 10 months of war in Gaza , health ministry says", "date": "2024-08-15 13:45", "url": "https://us.cnn.com/2024/08/15/middleeast/gaza-death-toll-40000-israel-war-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —More than 40,000 Palestinians have been killed in Gaza since Israel launched its war on Hamas following the group’s October 7 attack, the health ministry in the enclave said Thursday, yet another dark milestone in the 10-month-old conflict.\nIsrael said last month that it had killed more than 14,000 combatants in Gaza since the start of the war.\nAli Jadallah/Anadolu/Getty ImagesIn addition, at least another 10,000 people are missing and believed to be buried under rubble in Gaza, the Gaza government’s media office said earlier this week.\nThe soaring figures give a window into the daily suffering, malnutrition and volatility in Gaza after 10 months of conflict.\nA humanitarian catastropheA ceasefire deal would provide a reprieve for the approximately 2.2 million Palestinians who have been living in nightmarish conditions in Gaza."}, {"id": "75801aab-56fa-4bd2-b63f-2b6783cfbee1", "title": "Qatar to host high - stakes Gaza truce talks", "date": "2024-08-15 06:15", "url": "https://www.news24.com/news24/world/news/qatar-to-host-high-stakes-gaza-truce-talks-20240815", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Qatar is hosting Gaza ceasefire talks to halt the fighting between Israel and Hamas.\nQatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes would stop Iran striking Israel and avert a wider war.\nAsked whether a ceasefire agreement in Gaza could stave off a feared Iranian attack on Israel, Biden said: \"That's my expectation\".\nIn Lebanon, the health ministry reported two killed in separate Israeli strikes, the latest in near-daily cross-border violence throughout the Gaza war.\nThe Israeli military said its air force had \"struck Hezbollah military structures\"."}, {"id": "7c36ed9f-c067-4c73-96e5-317cf7959abf", "title": "Fire Twister - GREAT ! movies", "date": "2024-08-15 10:15", "url": "https://www.tvguide.co.uk/schedule/7334dedd-4c28-566d-8634-b1dbafd30c3f/fire-twister", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Fire Twister (2015)GREAT!\nA ragtag group of strangers join forces to stop the fiery twister, which appears to be controlled and manipulated in a plot to create the ultimate terror attack.\nDisaster movie, starring Casper Van Dien, Alyvia Alyn Lind and Jon MackFire Twister airs on GREAT!\nmovies at 4:45 PM, Thursday 15 August .\nCertificate PGTopics Movie ➝ Drama Disaster Movie"}, {"id": "cd9a32ea-7e42-4985-b736-d7258ad03a80", "title": "Russo - Ukraine War - 14 August 2024", "date": "2024-08-15 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian terrorists four times, supported by aviation, stormed the positions of Ukrainian units in the areas of Vovchansk and Sotnitsky Cossack.\nUkrainian defenders also caused significant damage to two artillery systems, two combat armored vehicles and three Russian vehicles.\nThe operation to neutralise the AFU units is in progress."}, {"id": "d12e6289-f9cd-4494-a703-cd3c82ae14fb", "title": "Freedom Fighters Windows , RTX , XBOX , PS2 game", "date": "2024-08-15 12:45", "url": "https://www.moddb.com/games/freedom-fighters-electronic-arts", "domain": "moddb.com", "domain_classification": "Unknown", "message": "In a world where the Soviet Union won the Cold War, a fierce conflict is unfolding in the streets of America.\nTaking on the role of Christopher Stone, players evolve from an average New Yorker into a fearless patriot who recruits and leads an army of freedom fighters in the streets of New York City.\nFreedom Fighters combines the depth of a squad-based game with the intensity of an action-packed war game that unfolds in the streets, subways, and buildings of the city.\nChristopher Walker has lost his family in New York City, after the nuking of Washington D.C. and the death of America's leaders.\nAs Soviet forces cross the borders of Mexico & Canada, he'll lead a guerilla band to fight through them and learn his loved ones' fate -- becoming an unlikely hero."}, {"id": "b9b0f228-2a18-4994-b989-ff353a9a3f42", "title": "Ukraine raid into Russia has shifted the tactical narrative – POLITICO", "date": "2024-08-15 03:30", "url": "https://www.politico.eu/article/ukraines-raid-kursk-russia-shift-tactical-narrative/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "And on Monday, Ukraine’s Commander-in-Chief Oleksandr Syrskyi claimed Ukraine had seized almost 1,000 square kilometers of territory inside Russia.\n“We continue to conduct an offensive operation in the Kursk region,” Syrsky declared in a video posted on Ukrainian President Volodymyr Zelenskyy’s social media accounts.\nAnd his prediction coincided with redoubled pleas for Western allies to allow Ukraine to shoot Western-supplied long-range missiles much deeper inside Russia.\nAnd the operation that’s underway in Kursk isn’t on the scale of Barbarossa or anything like it.\nThe Ukrainian president underscored that point himself this week, stating that “Russia must be forced into peace if Putin wants to continue waging war so badly.”"}, {"id": "cb40a0a3-0367-402d-8a8e-192953e02871", "title": "A History Of  First In Warfare", "date": "2024-08-15 01:00", "url": "https://www.science20.com/scientist/history_firsts_warfare-67906", "domain": "science20.com", "domain_classification": "Unknown", "message": "at Megiddo, named in the Bible Derekh Hayam (Hebrew: דרך הים), was fought the first battle remembered by military history.\nMoreover, according to the History of the Peloponesian War, it is used also during the siege of Syracuse (about 413 BC).\nIn 68 BC Rome is committed against pirates in the Mediterranean and one can speak for the first time of the war on terrorism.\nThese factors led the Khan to implement the last and desperate act of war, which appears as a genuine act of biological warfare.\nIn the American War of Independence of 1776, the submarine is armed against surface ships."}, {"id": "0193a162-000c-4b1b-8615-cd92d7dc902d", "title": "USAF can no longer count on overseas bases for power projection", "date": "2024-08-15 00:15", "url": "https://www.flightglobal.com/defence/usaf-can-no-longer-count-on-overseas-bases-for-power-projection/159575.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "Overseas air bases can no longer be counted on as safe harbours for American aircraft forward deployed to conflict zones.\nAdversary air fighters, including Lockheed F-16s and F-35As from USAF aggressor squadrons, acted as a modern enemy air force.\nUnlike the USAF’s famous Red Flag air combat exercises, Bamboo Eagle sought to test the entire chain of personnel involved in sortie generation with combat conditions.\n“The USAF no longer has the luxury of projecting power from sanctuary bases,” he adds.\n“This is central to success in a changing threat environment that no longer allows the air force to treat overseas bases as sanctuaries,” the USAF says."}, {"id": "7562469a-1e9c-469e-af09-0603d01cfecc", "title": "Burkinabe Defence minister says Army - 2024 Forum in Russia  was really enriching  ", "date": "2024-08-15 14:30", "url": "https://www.the-star.co.ke/news/africa/2024-08-15-burkinabe-defence-minister-says-army-2024-forum-in-russia-was-really-enriching/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The Army-2024 Forum, following last year's success with contracts worth over 400 billion rubles ($4.4 billion), welcomes delegations from 83 countries, including 39 led by defense ministry heads and chiefs of general staffs.\nChina, Iran, India, Mali, and Burkina Faso were among the 83 countries participating in the event on August 12-14.\nDefense Minister of Burkina Faso Kassoum Coulibaly found the International Forum Army-2024 \"really enriching\" as he shared his impressions in an exclusive interview with Sputnik Africa.\nThe minister highlighted the topics of these presentations: artillery, anti-drone warfare, chemical defense, combat practices, and tactical medicine.\nIt is not just seeing the equipment; it is really seeing how the equipment performs,\" Coulibaly noted."}, {"id": "635e1483-e5c3-448e-ac36-5cb50a3c393e", "title": "Poland showcases its growing army on a holiday that celebrates its historic defeat of the Red Army", "date": "2024-08-15 12:45", "url": "https://isp.netscape.com/news/world/story/0001/20240815/db5c8663bf0b6e3c403b0c8482da4aed", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Poland showcases its growing army on a holiday that celebrates its historic defeat of the Red ArmyWARSAW, Poland (AP) — NATO member Poland on Thursday is paying tribute to its historic victory over the Red Army by honoring fallen Poles and showing off modern tanks and other equipment that it hopes will deter the threat it sees in modern-day Russia.\nSome of Poland's new weapons replace Soviet- and Russian-made equipment sent to neighboring Ukraine after Russia launched its full-scale invasion of its democratic neighbor in 2022.\nSince Poland broke free of Moscow's control 35 years ago and then joined NATO, it has worked to modernize its army.\nThe holiday falls on the anniversary of the 1920 Battle of Warsaw, in which Polish troops defeated Russian Bolshevik forces advancing on Europe, halting their western march.\nPoland signed a $10 billion deal earlier this week with the U.S. government for 96 Apache attack helicopters."}, {"id": "7613ee7b-ce8e-4328-95ec-35b1cda8952d", "title": "Undersea Warfare Systems Market Share & Market Analysis", "date": "2024-08-15 06:15", "url": "https://www.openpr.com/news/3623749/undersea-warfare-systems-market-share-market-analysis-growth", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Undersea Warfare Systems Market Share & Market Analysis - Growth Trends & Forecasts for period from (2024 - 2031)https://www.reportprime.com/undersea-warfare-systems-r14230https://www.reportprime.com/enquiry/request-sample/14230https://www.reportprime.com/enquiry/pre-order/14230https://www.reportprime.com/checkout?id=14230&price=3590https://www.reportprime.com/checkout?id=14230&price=3590https://www.linkedin.com/pulse/machine-vision-edge-software-market-global-insights-regional-analysis-wseac?trackingId=r78cW4uFT9OACnB5flTweA%3D%3Dhttps://www.linkedin.com/pulse/global-ultra-precision-machining-technology-market-trends-innovations-5t5bc?trackingId=GxFq%2FVIUS3yAjt6aunnYmg%3D%3Dhttps://www.linkedin.com/pulse/how-regions-adapting-ent-surgery-navigation-software-market-jiq4c?trackingId=JcMyz5W5RsWzrjN4AWJV2g%3D%3Dhttps://www.linkedin.com/pulse/pioneering-growth-analyzing-global-neurosurgery-surgery-navigation-aesec?trackingId=RCoKJVtlRUe2wqNPP9m6mw%3D%3Dhttps://www.linkedin.com/pulse/market-leaders-laggards-global-orthopedic-surgery-navigation-jd7rc?trackingId=irlHdY%2F3QZmFcm58GI3QCA%3D%3Dhttps://www.linkedin.com/pulse/automation-after-services-outsourcing-market-global-3v2nc?trackingId=siUcA24VR0GiRJQ4kiStmw%3D%3Dhttps://www.linkedin.com/pulse/insights-decongestant-nasal-spray-industry-market-financial-y89uc?trackingId=UrRZB%2FyHTm%2BN6%2BWFmbSJ6w%3D%3Dhttps://www.linkedin.com/pulse/what-emerging-market-trends-rnase-inhibitor-detailed-overview-qzuuc?trackingId=9fcoQxjVTH6QjRcMFfGz8w%3D%3Dhttps://www.linkedin.com/pulse/orally-dissolving-strips-market-forecast-global-trends-r4o4c?trackingId=qXL86GLCSAOyfxHBxe0YwA%3D%3Dhttps://www.linkedin.com/pulse/global-oral-films-market-status-2024-2031-forecast-region-ldwic?trackingId=GkL4bfpQSbW24JPFcy6XPg%3D%3Dhttps://www.linkedin.com/pulse/emerging-geographic-atrophy-market-opportunities-analysis-investors-gcxfc?trackingId=bT1CqxkcStOy3HdmV204xg%3D%3Dhttps://www.linkedin.com/pulse/exploring-acne-treatment-products-market-dynamics-global-trends-svc5c?trackingId=6XA0B54kS%2F6fx1jTXcKLrQ%3D%3Dhttps://www.linkedin.com/pulse/analyzing-key-drivers-oral-dissolving-film-market-trends-future-ixuuc?trackingId=jO5FiE7WS3acEXLkIU%2BU9A%3D%3Dhttps://www.linkedin.com/pulse/future-insights-exosome-therapy-market-trends-regional-analysis-kfwqc?trackingId=GiZQNy2qQPaWtMrUJELCZw%3D%3Dhttps://www.linkedin.com/pulse/what-driving-global-reticle-smif-pods-market-dive-trends-applications-onbyc?trackingId=JBiUOFtUSXuFUqEIrDhk7A%3D%3Dhttps://www.linkedin.com/pulse/what-influencing-future-pva-materials-market-insights-growth-duiyc?trackingId=1qbKhkIfTu6Nx1PmQpQ3Iw%3D%3Dhttps://www.linkedin.com/pulse/what-influencing-future-radiation-processing-market-insights-whvjc?trackingId=%2Fym1dnnfTneeR1hhT%2FwPHw%3D%3Dhttps://www.linkedin.com/pulse/global-full-bore-safety-valve-market-product-type-application-2mrrc?trackingId=xHLV0NPtRJ2z9pcqpQjz7A%3D%3Dhttps://www.linkedin.com/pulse/gamma-irradiation-services-market-emerging-trends-future-hjrcc?trackingId=WS%2Bh77w5SF6Pj%2BDIGmHYDw%3D%3Dhttps://www.linkedin.com/pulse/what-factors-influence-evaporative-cooling-system-market-jmqic?trackingId=3lnTU8WiR0yiYHxPSCWp7w%3D%3Dhttps://www.linkedin.com/pulse/export-management-software-market-segmentation-geographical-ny4nc?trackingId=UpZbEd45Qgig1PJnjiIdbg%3D%3Dhttps://www.linkedin.com/pulse/future-innovation-global-custom-battery-pack-market-growth-0k2yc?trackingId=w3eE%2B%2FgTQ6CnbTFGUbemSg%3D%3Dhttps://www.linkedin.com/pulse/adhesives-testing-market-research-report-exploring-size-n7doc?trackingId=N1hkGN%2F0R22Z3BXi4OciGQ%3D%3Dhttps://www.linkedin.com/pulse/universal-testing-systems-market-size-growth-trends-statistics-qx4fc?trackingId=Wox0X%2FwHRFGuiSNmfH45WA%3D%3Dhttps://www.linkedin.com/pulse/what-current-future-prospects-laboratory-monitoring-systems-market-qzhzc?trackingId=PGiUr3HpS4GCyYduOsj5og%3D%3Dhttps://www.linkedin.com/pulse/future-innovation-global-cable-protection-market-growth-opportunities-87g2c?trackingId=R0GoImUMRbW64cR0M%2Fsb5g%3D%3Dhttps://www.linkedin.com/pulse/market-trends-global-advanced-balloon-catheter-forecast-analysis-y0axc?trackingId=DMsVENtNTGO7mPL1E6EvPg%3D%3Dhttps://www.linkedin.com/pulse/strategic-roadmap-success-global-smoke-evacuation-pencil-market-2ywzc?trackingId=L4VVNSpdTzaHFBFDyRNKMA%3D%3Dhttps://www.linkedin.com/pulse/global-biosurgery-sealants-hemostats-market-focus-application-avegc?trackingId=yhu1xfHySYmS4rx2NIo4ag%3D%3Dhttps://www.linkedin.com/pulse/medical-imaging-arms-market-size-share-trends-analysis-report-mj3ic?trackingId=dmhEJ5%2BiTmaAPvQd04yqeg%3D%3Dhttps://www.linkedin.com/pulse/global-raffia-tape-stretching-line-market-opportunities-forecast-vljqe?trackingId=bNlyisKZQzip%2Bb17PSUu%2Fw%3D%3Dhttps://www.linkedin.com/pulse/what-current-future-prospects-plastic-tongue-depressors-wgexc?trackingId=p7v%2BErxRSJ6BB5eFGSiF8A%3D%3Dhttps://www.linkedin.com/pulse/protein-packaging-market-share-size-trends-industry-analysis-report-dmpme?trackingId=SsXFe7XDQW22oULOI6Z6dA%3D%3Dh"}, {"id": "30706687-28cc-46f3-b386-bf32f3cfb612", "title": "Nalin Prabhat to take over as J & K DGP from October : MHA", "date": "2024-08-15 14:00", "url": "https://www.thehindu.com/news/national/jammu-and-kashmir/nalin-prabhat-to-take-over-as-jk-dgp-from-october-mha/article68528667.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "The Ministry of Home Affairs (MHA) on Thursday (August 15, 2024) appointed Indian Police Service (IPS) officer Nalin Prabhat as Special Director General (SDG) of the Jammu & Kashmir Police.\nMr. Prabhat will take over as Director General of Police (DGP), J&K from October this year.\nNalin Prabhat, IPS (AP:1992) is hereby posted to Jammu & Kashmir as Special Director General (SDG), Jammu & Kashmir Police with immediate effect and till 30.09.2024,” the MHA’s order said.\nThe order said Mr. Prabhat has also been appointed as J&K DGP with effect from October 1.\nMr. Swain also held the post of Director General of Police, J&K."}, {"id": "608a9020-7704-4442-b713-08c131be6e2d", "title": "Let get to the real veteran issues", "date": "2024-08-15 01:00", "url": "https://www.newsday.com/opinion/editorials/jd-vance-tim-walz-military-service-ijy7ye2r", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Charges had emerged that Caputo falsely claimed he’d been a lieutenant in the U.S. Army during the Vietnam War.\nHis Democratic challenger, Sen. John Kerry, was politically targeted by other veterans who questioned the merits of his multiple combat medals.\nIn 2010, Connecticut Attorney General Richard Blumenthal told an audience of veterans he served in Vietnam.\nWhat do the candidates have to say about the defense budget and technological shifts in the armed forces, long-brewing sexual abuse and gender issues?\nLet’s thank both candidates for their service and move on to the relevant issues that affect those in uniform and the rest of us."}, {"id": "7b6c35ce-3dfa-48ae-aa50-77c703b314de", "title": "The U . S . Marines Will Be Key to a Two - Front War", "date": "2024-08-15 02:45", "url": "https://nationalinterest.org/blog/buzz/us-marines-will-be-key-two-front-war-212331", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Historically, the U.S. was equipped to handle two major regional conflicts (MRCs) simultaneously, relying heavily on the Marine Corps' combined arms capabilities.\nHistorically, the U.S. was equipped to handle two major regional conflicts (MRCs) simultaneously, relying heavily on the Marine Corps' combined arms capabilities.\n-However, since 2019, the Marine Corps has shifted focus away from its traditional roles, divesting key combat capabilities to adopt a China-centric strategy.\nThe Marine Corps’ Strategic Shift: Are We Ready for a Two-Front War?\nEven if the Marine Corps had retained the combat capabilities lost through divestment, it would have been crippled by the failure of the Navy’s amphibious shipbuilding deals made for the Marine Corps."}, {"id": "f685b40a-b09b-4897-82f9-9228e586ddb5", "title": "Opinion : Will New Battle of Kursk Prove as Historically Significant as its Forerunner ? ", "date": "2024-08-15 06:15", "url": "https://www.kyivpost.com/opinion/37411", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Kursk occupies a special place in the Soviet history of World War II.\nThe battle thwarted the plans of the German command and was a turning point in the war for the Soviet Union.\nThe new \"Battle of Kursk\" is on a completely different scale from that of 1943, but its impact on the military-political situation in modern day Russia has already shown itself to be significant.\nIn March of this year, an interesting decision was made by the management of Ukraine’s National Museum of World War II History.\nThey dismantled a large copper frieze dedicated to the 1943 Battle of Kursk."}, {"id": "a2d887eb-5685-4d8e-a68c-c6b75c8b1605", "title": "Russian phishing campaign targets Kremlin enemies at home and abroad", "date": "2024-08-15 03:45", "url": "https://www.yahoo.com/news/russian-phishing-campaign-targets-kremlins-021726758.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A sophisticated Russian spear phishing campaign has been targeting the Kremlin's critics in Russia and the West, according to a report from digital rights groups Citizen Labs and Access Now published Aug. 14.\nPhishing is a type of social engineering in which attackers seek access to victims' online accounts by leveraging personalized deceptive tactics.\nThe campaign targeted Russian opposition figures, NGOs, and Western diplomats, including former U.S.\nIn the case of Pifer, the phishing email impersonated another former U.S. ambassador.\nThe campaign also targeted Polina Machold, publisher of the Russian independent investigative outlet Proekt Media, and multiple officials and academics at U.S. think tanks."}, {"id": "3073807a-ec1b-4fdb-a21f-271e15d6c456", "title": "Putin army is only  second best in Russia  boasts Ukrainian general", "date": "2024-08-15 08:30", "url": "https://www.standard.co.uk/news/world/ukraine-russia-kursk-raid-buffer-zone-lieutenant-colonel-vano-nadiradze-b1176606.html", "domain": "standard.co.uk", "domain_classification": "Unknown", "message": "He said: “Now all of us in Ukraine should act as unitedly and efficiently as we did in the first weeks and months of this war, when Ukraine took the initiative and began to turn the situation to the benefit of our state.”"}, {"id": "ab3d8334-f6dd-4cca-ba42-f29fc33ccbfb", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-08-15 03:30", "url": "https://gamingbolt.com/page/5494?action_type_map=fp781524", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "GameInformer is supposed to have their first look at Modern Warfare 2, the sequel to Call of Duty 4: Modern Warfare, and some of the details have been leaked, and we have them.\nYou will play a... Read More"}, {"id": "271c4388-b2d6-496c-8555-8ecfe3d4533e", "title": "Army brigade with no  luxury of time  rehearses sudden deployment to South Korea", "date": "2024-08-15 11:45", "url": "https://www.stripes.com/branches/army/2024-08-15/army-no-notice-south-korea-deployment-14870594.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The 1st Armored Brigade Combat Team, part of the 1st Armored Division from Fort Bliss, Texas, was taking part in Operation Pacific Fortitude, a test of the Army’s ability to quickly deploy and defend South Korea in case of war.\nTwo weeks earlier, the brigade unexpectedly received orders to deploy roughly 800 soldiers to South Korea within 10 days.\nAn AH-64E Apache helicopter flies over the Rodriguez Live Fire Complex in Pocheon, South Korea, Aug. 14, 2024.\nThose tanks and howitzers are the same “go-to-war set” in place should a conflict break out in South Korea, Little said.\nArmy logisticians have since worked to rectify wartime supply issues and defend South Korea from a potential attack by the North, Ruether said."}, {"id": "62602f92-172b-47ad-b03b-f38e27e74010", "title": "  Dad brought me back from clutches of death , inspired me to join medical service : Lt Sadhana Saxena Nair | Lucknow News", "date": "2024-08-15 06:00", "url": "https://timesofindia.indiatimes.com/city/lucknow/dad-brought-me-back-from-clutches-of-death-inspired-me-to-join-med-services/articleshow/112540073.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "She served the IAF for 38 years.“The sense of discipline inculcated during school days, especially in Loreto when I was a boarding student, left a long-lasting impression on me.\nAt the age of 3, I almost died with a fever shooting up to 106-107 degrees with measles.\nIn 1966-67, there was no concept of well-equipped hospitals, my father took care of me at home for three consecutive days without even changing his uniform and brought me back from the clutches of death.\nI also ensure combat medical support, when and wherever required,” she said.She wishes to get in touch with her school batchmates Nita Prasad and Lata Shukla, who also joined AMFC but later lost contact.\n“There was no social media back in the days when postal telegrams were the way of communication."}, {"id": "95f7f1aa-1d66-448d-a844-39cfa317aeac", "title": "Lucas : Scuttling Walz , Kerry swift boat comparisons", "date": "2024-08-15 05:45", "url": "https://www.bostonherald.com/2024/08/15/lucas-scuttling-walz-kerry-swift-boat-comparisons/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Tim Walz is no John Kerry, despite sympathetic and dishonest comparisons from the left.\nThe left-wing media immediately came to Walz’s defense and wrongly compared criticism of Walz to the “swift boating” of John Kerry, a Vietnam War veteran, who was the 2004 Democrat candidate for president.\nNo sooner did Kerry return as a war hero than he morphed into an anti-war hero and launched his political career.\n“My name is John Kerry, and I am reporting for duty,” he said saluting upon winning the Democrat Party nomination in 2004.\nTim Walz is no John Kerry."}, {"id": "730b77e8-7c8c-4010-bece-34ce354e78c7", "title": "Independence Day Special : Films that will awaken the patriot in you", "date": "2024-08-15 08:00", "url": "https://www.filmfare.com/features/independence-day-special-films-based-on-true-events-that-will-awake-the-50126.html", "domain": "filmfare.com", "domain_classification": "Unknown", "message": "Be it winning against another country or fighting internal battles to save ours, we’ve had films like Border, Raazi, Uri: The Surgical Strike and many more to stir our souls and wake the patriot in us.\nAs we celebrate the 78th Independence Day today, here’s looking at films that are sure to make you proud and hold your head up high with patriotism.\nWith a fictionalised representation of the events, the film follows a small platoon into the war and narrates their life and how the war impacted them.\nUri: The Surgical Strike (2019)This is a fictional dramatisation of true events of the retaliation of 2016 Uri attack.\nThis film takes you through his journey as a freedom fighter and narrated the brave acts he committed before he was sentenced to death."}, {"id": "d4f84da4-97d2-42fb-b319-54bc7ef690e9", "title": "Air Crash Investigation - National Geographic Channel HD", "date": "2024-08-15 07:15", "url": "https://www.tvguide.co.uk/schedule/f1c93216-0489-5ebd-bb1c-883ebfa18c48/air-crash-investigation", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Air Crash InvestigationNational Geographic Channel HD 1:00 PM to 2:00 PM Thursday 15 August Share Add toCalendar +Operation Babylift Season 7 Episode 5 of 8 S SubtitlesAn American plane crash in the last days of the Vietnam War in 1974 that killed more than 250 people, including Vietnamese orphans being airlifted to safety.\nInvestigators had to battle looters in order to safeguard the wreckage, hoping to determine the cause of the disasterAir Crash Investigation airs on National Geographic Channel HD at 1:00 PM, Thursday 15 August .\n(Subtitles.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "10823ac6-adce-406f-b57f-762330b61056", "title": "Local activist group raises alarm over governor comments on Pacific nuclear threat", "date": "2024-08-15 13:45", "url": "https://www.guampdn.com/news/local-activist-group-raises-alarm-over-governors-comments-on-pacific-nuclear-threat/article_0062a3a6-5ab7-11ef-8949-9fc861ca983b.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "edc094ef-0535-49a3-9f92-c1cff2445f88", "title": "My notes on Ukraine part of VIDEO | Ukr Pokrovsk Crisis , Rus : No Talks Kiev ; Alaudinov : Kursk NPP Ukr Target , Failed ; Iran Rejects US", "date": "2024-08-15 02:00", "url": "https://freerepublic.com/focus/f-chat/4258489/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Ukrainian offensive in Kursk:The Russian authorities are saying that the objective of the Ukrainians was the capture of the Kursk nuclear power plant.\nThis 'blitzkreig' of Zelensky's as planned to seize the power plant and use it as an ultimatum that we should leave somewhere and do something has failed.\nNext we will systematically destroy every Ukrainian (Mercouris notes Aladeenov uses a stronger word here) who got into our territory.\nThere have been many failed Ukrainian attempts to reach the nuclear power plant.\nIn this way the enemy tried to break through (city name) and the nuclear power plant but has been repulsed and loses equipment and soldiers."}, {"id": "7c0e1ce8-4a6b-457c-bd04-59a02b57a57d", "title": "04 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/04", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The AFU losses amounted to up to 190 Ukrainian troops, two armoured fighting vehicles, and six pickup trucks.\nOne counter-attack launched by an assault detachment of the AFU 54th Mechanised Brigade was repelled.\nAs a result of active actions, units of the Tsentr Group of Forces liberated Novosyolovka Pervaya (Donetsk People’s Republic).\nOne counter-attack launched by an assault detachment of the Lyut Assault Brigade of the Ukrainian National Police was repelled.\nThe AFU losses amounted to up to 75 Ukrainian troops, seven motor vehicles, one 152-mm D-20 howitzer, one 152-mm Msta-B howitzer, and one Anklav-N electronic warfare station."}, {"id": "21d6ba11-6ed4-4270-a88a-a4527173faf2", "title": "Ukraine Soldier Said Russians Still  Drinking Coffee  During Kursk Attack", "date": "2024-08-15 05:30", "url": "https://www.businessinsider.com/ukraine-kursk-russian-drinking-coffee-sitting-forest-attack-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewA Ukrainian soldier who participated in the first forays of last week's Kursk incursion said his unit caught Russian troops completely by surprise as the latter were having coffee.\nThis story is available exclusively to Business Insider subscribers.\nVolodymyr told the outlet that his unit entered Kursk in the late morning of August 6, and soon found a group of Russian troops \"sitting in the forest, drinking coffee at a table.\"\nVolodymyr said \"dozens\" of other Russian troops surrendered afterward.\nPress services for the Russian defense ministry and the Kremlin did not immediately respond to requests for comment sent outside regular business hours by Business Insider."}, {"id": "2fb4ccb2-e7fa-4a87-bd02-1c64d8063026", "title": "RIGHT SPEAK : 153 C - Clashes in F - Line , 40 Repelled , 15 are Ongoing in Pokrovsk Sec ; UKR Territory Gains in RU in 1 Week Nearly Match RU Advances Which Took 8 Months ; UKR Strikes 4 Putin Airfields 500 Miles Over Border ; UKR Secures Toretsk ; ...", "date": "2024-08-15 05:00", "url": "http://www.rightspeak.net/2024/08/153-c-clashes-in-f-line-40-repelled-15.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Aug 2024 (75) Jul 2024 (155) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "af8891ea-facf-4736-b274-1e294e1ed63e", "title": "Former CIA director coming to Peoria area", "date": "2024-08-15 04:30", "url": "https://www.yahoo.com/news/former-cia-director-coming-peoria-021254102.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — The Peoria Area World Affair Council is hosting former CIA Director General David H. Petraeus for a luncheon.\nPetraeus retired from the Army and is a former Commander of US Central Command and former Commander of Coalition Forces in Afghanistan.\nHe will also discuss is book Conflict: The Evolution of Warfare from 1945 to Ukraine.\nFour-Star Tour of the World with General David Petraeus is August 19 at the Par-A-Dice Hotel and Conference Center located at 21 Blackjack Boulevard in East Peoria.\nFor the latest news, weather, sports, and streaming video, head to CIProud.com."}, {"id": "5fd3a794-f4d5-4c9e-8c5f-887d9cd122cd", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks", "date": "2024-08-15 11:30", "url": "https://abcnews.go.com/Business/wireStory/dubai-based-port-operator-dp-worlds-half-year-112853516", "domain": "abcnews.go.com", "domain_classification": "International", "message": "DP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group's chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm's revenues.\nThe Houthis since November have been targeting shipping through the Red Sea corridor over the Israel-Hamas war in the Gaza Strip.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai's Jebel Ali Port, the home of DP World and the world's largest manmade harbor."}, {"id": "e685b5e0-9b99-4481-a338-3ecbdff9cb9b", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks", "date": "2024-08-15 08:45", "url": "https://www.wral.com/story/dubai-based-port-operator-dp-worlds-half-year-profits-fall-nearly-60-in-part-over-red-sea-attacks/21578530/", "domain": "wral.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen's Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\nDP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group's chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm's revenues.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai's Jebel Ali Port, the home of DP World and the world's largest manmade harbor."}, {"id": "e584b32a-2b75-415b-86ef-c3d5aa3d00af", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks", "date": "2024-08-15 11:15", "url": "https://www.ksat.com/business/2024/08/15/dubai-based-port-operator-dp-worlds-half-year-profits-fall-nearly-60-in-part-over-red-sea-attacks/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Kamran Jebreili, File)DUBAI – Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen's Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\nDP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group's chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm's revenues.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai's Jebel Ali Port, the home of DP World and the world's largest manmade harbor."}, {"id": "f6b7b72d-11af-4c1a-897a-46efbe91a95c", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks", "date": "2024-08-15 10:15", "url": "https://www.clickondetroit.com/business/2024/08/15/dubai-based-port-operator-dp-worlds-half-year-profits-fall-nearly-60-in-part-over-red-sea-attacks/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Kamran Jebreili, File)DUBAI – Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen's Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\nDP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group's chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm's revenues.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai's Jebel Ali Port, the home of DP World and the world's largest manmade harbor."}, {"id": "474cbd87-997b-4965-95f2-44fd4b8f2301", "title": "Lebanese hold their breath as mediators scramble to avert all - out war", "date": "2024-08-15 06:00", "url": "https://www.bbc.co.uk/news/articles/cm2ndvg18j8o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "And for once many in Israel, Lebanon and Iran have something in common - a war of nerves.\nHow will Iran, and its proxy militia Hezbollah, retaliate against Israel for back-to-back assassinations in Beirut and Tehran?\nHeart-stopping sonic booms interrupt the hum of traffic in Beirut, as Israeli warplanes break the sound barrier in the skies above.\nWe live day to day.\nAnd we joke about the situation.”In the next breath she admits business has suffered, and she has post-traumatic stress disorder."}, {"id": "d47c114f-8e62-4c2b-9392-90591876e249", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks – Winnipeg Free Press", "date": "2024-08-15 08:30", "url": "https://www.winnipegfreepress.com/business/2024/08/15/dubai-based-port-operator-dp-worlds-half-year-profits-fall-nearly-60-in-part-over-red-sea-attacks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen’s Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\nDP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group’s chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm’s revenues.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai’s Jebel Ali Port, the home of DP World and the world’s largest manmade harbor."}, {"id": "fc3a2721-a07d-496c-8775-ec13fbf4a5b7", "title": "Dubai - based port operator DP World half - year profits fall nearly 60 %, in part over Red Sea attacks", "date": "2024-08-15 11:45", "url": "https://www.wsls.com/business/2024/08/15/dubai-based-port-operator-dp-worlds-half-year-profits-fall-nearly-60-in-part-over-red-sea-attacks/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "(AP Photo/Kamran Jebreili, File)DUBAI – Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen's Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\nDP World reported profits of $265 million this year, down from $651 million the same time last year.\nDP World Group's chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm's revenues.\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely.\nThe rerouting has affected shipping through Dubai's Jebel Ali Port, the home of DP World and the world's largest manmade harbor."}, {"id": "987e9551-1cc9-4684-aeca-76dbbef053d4", "title": "This month in Illinois State University history : August", "date": "2024-08-15 00:15", "url": "https://news.illinoisstate.edu/2024/08/this-month-in-illinois-state-university-history-august/", "domain": "news.illinoisstate.edu", "domain_classification": "Unknown", "message": "From an alum’s historic dive to a former faculty member’s early exploration of the Grand Canyon, historian Tom Emery explores this month in Illinois State University history.\nBarbara Scholley, a 1980 Illinois State University graduate and a distinguished officer in the U.S. Navy, was on the dive team.\nIn 1994, Scholley was honored as the Illinois State University Distinguished Young Alumni Award, and four years later, she received an honorary doctorate from ISU.\nAugust 24John CookOn this date in 1882, the 25th anniversary gala for Illinois State University began.\nAt the time, Powell was on the staff of Illinois State University, which helped pay for the expedition."}, {"id": "12215477-0057-42b1-9435-3c38794c205c", "title": "Ukrainian Mercenary NATO Forces Invade Russia Targeting Civilian Populations – Russia Labels Invasion as  Terrorist Attack  ", "date": "2024-08-15 00:30", "url": "https://healthimpactnews.com/2024/ukrainian-mercenary-nato-forces-invade-russia-targeting-civilian-populations-russia-labels-invasion-as-terrorist-attack/", "domain": "healthimpactnews.com", "domain_classification": "Unknown", "message": "It’s clear from the context that the video captures the early moments of a serious Ukrainian assault on Russian positions.\nThe 80th Air Assault Brigade, like its sister unit the 82nd Air Assault Brigade, apparently operates Marders alongside its Strykers.\nThey suit the Ukrainian air assault forces’ preference for swift but powerful attacks.\nThe agency claimed that the man shown in the footage was captured with the help of local residents in Kursk Region.\nOn August 6, Ukrainian forces launched their largest attack on Russian territory since the outbreak of the conflict in February 2022."}, {"id": "1c0324bb-91e0-4d0d-ae07-9ae54344ee24", "title": "AEW Dynamite results , live blog ( Aug . 14 , 2024 ): Two title defenses", "date": "2024-08-15 00:15", "url": "https://www.cagesideseats.com/aew/2024/8/14/24220298/aew-dynamite-results-live-blog-aug-14-2024-young-bucks-mercedes-mone-title-defenses-all-in-build", "domain": "cagesideseats.com", "domain_classification": "Unknown", "message": "AEW DYNAMITE RESULTS AND LIVE BLOG FOR AUG. 14But how can we let them go on this way?\nMone gets Shida up...Mercedes Mone wins by pinfall with Mone Maker, retaining the AEW TBS Championship.\nHe asks what Jungle Boy has ever added to AEW and says he’s going to end him at All In.\nAt Wembley he’s going to beat Allin at his own game— he wants a Coffin Match!\nHe talks about this being a vehicle to the world title and he’s going to hold all the titles at once."}, {"id": "8d30a844-545a-4229-8d8f-e2e7cf10474a", "title": "Shiloh National Military Park to celebrate National Park Service 108th birthday", "date": "2024-08-15 00:00", "url": "https://www.wbbjtv.com/2024/08/14/shiloh-national-military-park-to-celebrate-national-park-services-108th-birthday/", "domain": "wbbjtv.com", "domain_classification": "Unknown", "message": "SHILOH, Tenn. — Shiloh is pleased to announce a full day of activities in celebration of the National Park Service’s birthday, on August 24, 2024.\nIn celebration of the National Park Service’s Birthday, Shiloh National Military Park is offering a Junior Ranger Artillery Kids Camp on Saturday, August 24.\nJoin the Shiloh Cannon Crew as they present Civil War cannon firing demonstrations in honor of the NPS birthday.\nDemonstrations will take place on Saturday at 11:00 a.m., 1:00 p.m., 2:00 p.m., 3:00 p.m. and 4:00 p.m.As part of the NPS birthday, Shiloh rangers will provide guided tours of the Shiloh National Cemetery.\nPlaying period instruments and clad in Civil War clothing, the Ball’s are modern troubadours of Civil War era music."}, {"id": "e274cef1-6371-419a-9bf1-2e2ecd1f01ff", "title": "14 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/14", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Deputy Prime Minister Dmitry Chernyshenko congratulated the team of Russian high school students on their high result at the first International Olympiad on Artificial Intelligence (IOAI).\nMay your knowledge make a serious contribution to the technological sovereignty of Russia in the future,” said Dmitry Chernyshenko.\n🏫The preparation of the Russian team lasted about two months.\nThe Russian team scored an absolute majority of competition points in this round and bypassed other teams.\nIn addition to the Russian team, schoolchildren from 39 countries took part in the final, including China, Japan, Canada, Sweden, the Netherlands, the USA and others."}, {"id": "b2d4e7a6-3978-4a80-b44f-cbc96f19be28", "title": "Canelo Vs . Berlanga : One Month To Go , And The Heat Is On", "date": "2024-08-15 01:45", "url": "https://www.boxingnews24.com/2024/08/canelo-vs-berlanga-one-month-to-go-and-the-heat-is-on/", "domain": "boxingnews24.com", "domain_classification": "Unknown", "message": "Berlanga would still be toiling away in the salt mines with the other contenders if not for Canelo giving him this golden opportunity.\nHe looked so happy because this is the only way he’s going to get Canelo’s respect.\nBerlanga looked great against the guys Top Rank matched him against, but he’s looked terrible lately, and he’s not been fighting quality guys.\nDuring the press conferences with Canelo, Berlanga was in pure theatrical mode, out-acting him and admirably selling the fight by playing the villain role.\nI would suggest that Berlanga jump on Canelo from the first round, throwing with pure power and not letting up on him."}, {"id": "638b26ef-7c23-483d-918b-93d2f31d2bd6", "title": "Russian prisoners of war say they surrendered to Ukraine inside their own country", "date": "2024-08-15 08:15", "url": "https://news.sky.com/story/russian-prisoners-of-war-say-they-surrendered-to-ukraine-inside-their-own-country-13197209", "domain": "news.sky.com", "domain_classification": "International", "message": "The Russian prisoners of war - mostly young conscripts - were grouped together in a line of cells along a dimly-lit corridor at a detention site in Ukraine.\nThe men we spoke to said their families did not know what had happened to them and that they hoped to be swapped in any exchange with Ukrainian prisoners of war so they could go home.\nImage: Russian prisoners of war are being held at a detention site in UkraineAny evidence of conscripts being posted so close to the Ukrainian border - and now detained inside Ukraine - may raise questions for Vladimir Putin.\nAdvertisementHe had said at the start of Russia's full-scale invasion of Ukraine that conscripts would not be sent to frontline positions in Ukraine.\nAsked whether the plan was to exchange the detainees Ukraine has captured with Ukrainian prisoners of war on the Russian side, the officer said: \"Well, of course."}, {"id": "05796cc7-7fcf-4f55-8d2a-60a810bd952c", "title": "08 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/08", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Aviation strikes are delivered at the approaching AFU reserves on the territory of Sumy region.\nOver the past 24 hours, the AFU losses have amounted to up to 400 Ukrainian troops and 32 units of armoured hardware, including one tank, four armoured personnel carriers, three infantry fighting vehicles, and 24 Kozak armoured fighting vehicles.\nSince the beginning of battles in Kursk direction, the AFU losses have amounted to up to 660 Ukrainian troops, 82 units of armoured hardware, including eight tanks, 12 armoured personnel carriers, six infantry fighting vehicles, 55 armoured fighting vehicles, and one counter obstacle vehicle.\nOne counter-attack launched by an assault detachment of the AFU 116th Mechanised Brigade was repelled.\nTwo counter-attacks launched by assault detachments of the AFU 25th Airborne Brigade and 142nd Infantry Brigade were repelled."}, {"id": "b57892dc-edd5-4e21-a229-2f695b1bd9fb", "title": "Russian prisoners of war say they surrendered to Ukraine inside their own country", "date": "2024-08-15 07:15", "url": "https://www.heart.co.uk/news/uk-world/russian-prisoners-of-war-say-they-surrendered/", "domain": "heart.co.uk", "domain_classification": "Unknown", "message": "Russian prisoners of war say they surrendered to Ukraine inside their own countryThe Russian prisoners of war - mostly young conscripts - were grouped together in a line of cells along a dimly-lit corridor at a detention site in Ukraine.\nAny evidence of conscripts being posted so close to the Ukrainian border - and now detained inside Ukraine - may raise questions for Vladimir Putin.\nA Ukrainian officer involved with transporting detainees from the battlefield to Ukrainian detention sites said that anyone with any wounds is given medical treatment.\nAsked whether the plan was to exchange the detainees Ukraine has captured with Ukrainian prisoners of war on the Russian side, the officer said: \"Well, of course.\n(c) Sky News 2024: Russian prisoners of war say they surrendered to Ukraine inside their own country"}, {"id": "ea5a4927-0328-44f3-bb7b-1c47469c1824", "title": "PNP forms review panel to assess drug campaign of past admins", "date": "2024-08-15 05:45", "url": "https://www.sunstar.com.ph/manila/pnp-forms-review-panel-to-assess-anti-illegal-drugs-campaign-of-past-admins", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "PHILIPPINE National Police (PNP) chief General Rommel Marbil has ordered the creation of a review panel for the conduct of assessment in the anti-illegal drugs campaign of his predecessors.\nIn a statement, Marbil raised the need for a comprehensive review of Oplan Double Barrel, which maps out policies and strategies against illegal drugs to evaluate their effectiveness and identify both strengths and weaknesses.\n“We need to take a hard look at our past and present strategies in the fight against illegal drugs.\n“This review panel will bring together the key components of our police force to ensure a comprehensive and balanced evaluation.\nUnder the recalibrated strategies to combat the country’s problem of illegal drugs, the PNP will focus on targeting the sources and supply chains rather than focusing on street-level pushers and users."}, {"id": "60d56c12-d307-441d-ac05-2e8ab532fe1a", "title": "Task force in Osceola County shares how they plan to tackle opioid epidemic", "date": "2024-08-15 00:30", "url": "https://www.clickorlando.com/news/local/2024/08/14/task-force-in-osceola-county-shares-how-they-plan-to-tackle-opioid-epidemic/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "OSCEOLA COUNTY, Fla. – The Osceola Opioid Task Force has recently unveiled their final recommendations on how the county should allocate over $12 million they will receive over the next 18 years to combat the opioid epidemic.\n“In 2008, the state of Florida filed a lawsuit against five opioid manufacturers and four opioid distributors.\nThe settlement from this lawsuit resulted in a fund that will be available at the local, state, and federal levels to address the opioid epidemic,” said Vianca McCluskey, the chairperson of the task force.\nThe funds will also support organizations like Children Athletes & Artists Involved in Recreational Events (CAAIRE) which works with nearly 3,500 kids annually to help them avoid drug use.\nThey plan to open applications for organizations to apply for funding later this year."}, {"id": "ca38e9ea-b4d0-4aa8-a058-920679f79842", "title": "Taliban Flexes US Weapons In Military Parade , Left Behind By Biden - Harri Botched Afghan Exit", "date": "2024-08-15 06:00", "url": "https://www.zerohedge.com/military/taliban-flexes-us-weapons-military-parade-left-behind-biden-harris-botched-afghan-exit", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "JUST IN: 🇦🇫 🇺🇸 The Taliban held a military parade using United States military equipment that was left behind after the U.S. withdrawal from Afghanistan.\npic.twitter.com/oZzg0RuAo5 — BRICS News (@BRICSinfo) August 14, 2024NEW: The Taliban held a military parade at Bagram Airfield in Afghanistan with the US military equipment they stole after the disastrous Biden-Harris withdrawal.\nMilitary equipment left by the U.S. forces everywhere.\npic.twitter.com/fvcU3qCXWk — Clash Report (@clashreport) August 14, 2024The Taliban just held a military parade with our equipment that was left during the disastrous Afghanistan withdrawal.\nAnother person said, \"The Democrat’s presidential nominee made it possible for this Taliban parade to happen."}, {"id": "264d0667-fdcf-45f8-8916-f71d4fbbb2fe", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 11:30", "url": "https://www.yahoo.com/news/gaza-death-toll-passes-40-104315792.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Palestinian mourners carry their loved one for burial at the cemetery in Deir al-Balah, Gaza Strip, Friday, Aug. 9, 2024.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nSmashed graves and cemeteries off-limitsIsraeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "ccc404b9-a119-469f-8aca-adc5e0d80a4e", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 13:30", "url": "https://abcnews.go.com/International/wireStory/gaza-death-toll-passes-40000-corpses-buried-yards-112855161", "domain": "abcnews.go.com", "domain_classification": "International", "message": "“Sometimes we make graves on top of graves,” he said.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nJomaa said that come the end of the war, he plans to visit Gaza to search for Mira's remains."}, {"id": "0a76066a-4639-4f7d-96a6-9e1eb0ac7892", "title": "  The Challenge 40 : Battle of the Era Premiere Recap Twist Explained", "date": "2024-08-15 06:00", "url": "https://tvline.com/recaps/the-challenge-40-battle-of-the-eras-premiere-recap-twist-explained-1235318971/", "domain": "tvline.com", "domain_classification": "Unknown", "message": "It’s the biggest and likely baddest season The Challenge has ever seen — and no, that’s not just some glossy marketing promo.\nOnly 32 players of the starting 40 will be still around come challenge No.\nThe first man and woman from each era will win the challenge and be safe from elimination.\nMeet The Challenge 40 Cast!\nSo what did you think of The Challenge 40′s first episode, and who do you want to see eliminated first?"}, {"id": "33c24c2a-7e73-4515-bd9e-9fc4144cebbd", "title": "  We Entered Easily , With Little Resistance  – Ukraine at War Update for Aug . 15", "date": "2024-08-15 02:00", "url": "https://www.kyivpost.com/post/37408", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "As Ukrainian forces’ incursion into Russia’s Kursk region enters its second week, President Volodymyr Zelensky said on Wednesday that Ukrainian troops had “advanced well” that day, despite Moscow’s reinforcements.\nIn his nightly address to the nation, Zelensky reported that the Armed Forces of Ukraine (AFU) had gained about a mile on Wednesday.\n“Today we have advanced well in the Kursk region.\n“The creation of a buffer zone in the Kursk region is a step to protect our border communities from daily hostile shelling,” he said.\n“We don’t touch them, but they either treat us sharply, negatively, or not at all…They also deceive us about the positions of Russian troops,” he added."}, {"id": "df28dfe6-54a5-4627-8b1c-bc6684adccfd", "title": "Former SEAL Leader Likely to Face Board of Inquiry in Coming Days over Death of Candidate Kyle Mullen", "date": "2024-08-15 00:30", "url": "https://www.yahoo.com/news/former-seal-leader-likely-face-214430577.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "However, Geary's lawyer, Jason Wareham, told Military.com that they refused the proceeding, arguing that he wouldn't receive a fair hearing.\nAccording to Wareham, Geary is instead headed for something in between -- a board of inquiry.\nMullen, 24, died of acute pneumonia shortly after completing the first, brutal portion of SEAL training known as \"Hell Week\" on Feb. 4, 2022.\nAsked Wednesday whether he still stands by his critiques of the investigation, Geary said that he feels \"even stronger toward those positions.\"\nRelated: Navy Looks to Punish 3 Top Officers Overseeing Navy SEAL Training After Recruit Death"}, {"id": "ddd0bdb1-b5a2-4635-a63d-4459b10bf733", "title": "Former SEAL Leader Likely to Face Board of Inquiry in Coming Days over Death of Candidate Kyle Mullen", "date": "2024-08-15 01:45", "url": "https://www.military.com/daily-news/2024/08/14/former-seal-leader-likely-face-board-of-inquiry-coming-days-over-death-of-candidate-kyle-mullen.html", "domain": "military.com", "domain_classification": "Unknown", "message": "However, Geary's lawyer, Jason Wareham, told Military.com that they refused the proceeding, arguing that he wouldn't receive a fair hearing.\nAccording to Wareham, Geary is instead headed for something in between -- a board of inquiry.\nMullen, 24, died of acute pneumonia shortly after completing the first, brutal portion of SEAL training known as \"Hell Week\" on Feb. 4, 2022.\nAsked Wednesday whether he still stands by his critiques of the investigation, Geary said that he feels \"even stronger toward those positions.\"\nRelated: Navy Looks to Punish 3 Top Officers Overseeing Navy SEAL Training After Recruit Death"}, {"id": "90392dc6-a3e0-4bc1-81bb-45d32fa768e2", "title": "Gaza death toll : As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 11:45", "url": "https://economictimes.indiatimes.com/news/international/world-news/as-gaza-death-toll-passes-40000-corpses-are-buried-in-yards-streets-tiered-graves/articleshow/112547202.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "The dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.The cemetery is 70 years old.\nA quarter of its graves are new.The death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\n\"One large cemetery\" A steady drumbeat of death since October has claimed nearly 2% of Gaza's prewar population.\nThe fighting has killed 329 Israeli soldiers.Even in death, Palestinians have been displaced by Israel's offensives.Palestinians move corpses, shielding them from the path of war.\n\"Haneen Salem, a photographer and writer from northern Gaza, has lost over 270 extended family members in bombardments and shelling."}, {"id": "ba757457-f8ac-4f70-a770-990c7c11cbe8", "title": "Russia casualty toll in Ukraine climbs up by 1 , 220 in past day", "date": "2024-08-15 08:00", "url": "https://www.ukrinform.net/rubric-ato/3895327-russias-casualty-toll-in-ukraine-climbs-up-by-1220-in-past-day.html", "domain": "ukrinform.net", "domain_classification": "Unknown", "message": "Russian invasion forces have lost an estimated 595,620 personnel killed or wounded since the full-scale invasion.\nThat’s including 1,220 war casualties over the past day alone, as per the General Staff of Ukraine’s Armed Forces, Ukrinform reports.\nAlso, Ukraine’s Defense Forces have destroyed 8,484 Russian tanks (+8 in the past day), 16,426 (+24) armored fighting vehicles, 16,868 (+47) artillery systems, 1,154 (+3) multiple rocket launchers, 922 (+1) anti-aircraft warfare systems, 367 (+1) warplanes, 328 helicopters, 13,598 (+50) UAVs, 2,428 (+2) cruise missiles, 28 warchips/cutters, a submarine, 22,775 (+65) vehicles and fuel tankers, and 2,813 units of specialized equipment.\nThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, the Ukrainian raid in Kursk region has already proven that the Kremlin is unable to quickly make anti-crisis decisions, says Mykhailo Podolyak, the advisor to the head of the Ukrainian President’s Office."}, {"id": "66f256e9-8b5d-48be-8726-dc7b1a0628d5", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 12:30", "url": "https://www.pennlive.com/nation-world/2024/08/as-gaza-death-toll-passes-40000-corpses-are-buried-in-yards-streets-tiered-graves.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nSmashed graves and cemeteries off-limitsIsraeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "ad159c17-86d1-480e-ac5f-9b927a806abb", "title": "Liberty County Four recognized at Hinesville VA", "date": "2024-08-15 01:00", "url": "https://www.wtoc.com/2024/08/14/liberty-county-four-recognized-hinesville-va/", "domain": "wtoc.com", "domain_classification": "Unknown", "message": "HINESVILLE, Ga. (WTOC) - Group called the “Liberty County Four” recognized Wednesday.\nFour men, all killed in combat during the Vietnam War, all with ties to Liberty County.\nYou may remember—President Biden signed a bill into law earlier this year, naming the Hinesville VA clinic after them.\n“It’s not an award anybody wants to get, especially the family members of the men,” said Brenda Acebes who is on the committee to rename the Hinesville VA clinic.\nAccording to the VA, an official renaming ceremony of the Hinesville clinic is in the works but a date has not yet been set."}, {"id": "63790d93-94a6-4cd0-a539-848912cab688", "title": "Myanmar Rebel Militias Redeploy Towards Mandalay – The Diplomat", "date": "2024-08-15 07:00", "url": "https://thediplomat.com/2024/08/myanmars-rebel-militias-redeploy-towards-mandalay/", "domain": "thediplomat.com", "domain_classification": "Unknown", "message": "Everyone evacuated their homes as Lashio was falling and they lost all their possessions, including their pets, their dogs,” a PDF source said.\nEAO troop deployments are also on the back of recent battlefield victories by the Mandalay PDF.\nMeanwhile, NUG-backed militias captured nine military posts near Thabeikkyin, about 100 kilometers north of Mandalay, on the Irrawaddy River.\nThese were small gains in the overall context of the three-and-a-half-year conflict but the PDF source said rebel militias were now poised.\nMandalay, the historical seat of kings until the British annexation in 1885, remains the country’s cultural center and its importance can not be discounted."}, {"id": "c746eb63-58da-4ce4-ab04-d9e3d4a9ae21", "title": "Best Look Yet At Ukrainian MiG - 29 Releasing Hammer Rocket - Assisted Bombs", "date": "2024-08-15 02:00", "url": "https://www.yahoo.com/news/best-look-yet-ukrainian-mig-003444914.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has released a video offering the best look to date of one of the country's MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nThe Ukrainian Air Force has released a video offering the best look to date of one of the country’s MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nA video of the moment of release of two French-supplied AASM-250 Hammer guided bombs from a Ukrainian MiG-29 fighter jet.\nLow pass by a Ukrainian Air Force MiG-29, armed with a French-supplied AASM 250 HAMMER extended-range guided bomb.\nHowever, it will take years for the Ukrainian Air Force and its pilots to unlock the full potential of those fighters."}, {"id": "660a6d17-7c51-4b52-a17a-7f1d72c14f8a", "title": "Why  stolen valor  political fights are so intense and misplaced in the cases of Walz and Vance | News , Sports , Jobs", "date": "2024-08-15 08:00", "url": "https://www.lockhaven.com/opinion/columns/2024/08/why-stolen-valor-political-fights-are-so-intense-and-misplaced-in-the-cases-of-walz-and-vance/", "domain": "lockhaven.com", "domain_classification": "Unknown", "message": "Tim Walz, out of her mouth before the Republican vice presidential nominee, Sen. JD Vance from Ohio, raised allegations of “stolen valor” against Walz.\nHe also was a prominent backer of legislation to put an end to stolen valor claims.\n“From the LEGAL standpoint, there is no Stolen Valor here” in the examples regarding Walz, he wrote in an email exchange.\nOne person’s “stolen valor” can be another person’s “war stories,” in which fact-checking is almost nonexistent.\nVance volunteered for military service in a time of war and he should be proud of that."}, {"id": "befffc39-feda-4852-ad4e-8c5c13926623", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 12:45", "url": "https://isp.netscape.com/news/world/story/0001/20240815/988d16b648e06e222f04964dc9440da0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered gravesDEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nSmashed graves and cemeteries off-limitsIsraeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "0930fa5e-d7a8-45a5-b863-353f38e6dcb5", "title": "South Korea Yoon makes fresh outreach to Kim Jong - un , says unification an  unfinished task  ", "date": "2024-08-15 06:45", "url": "https://www.scmp.com/news/asia/east-asia/article/3274569/south-koreas-yoon-makes-fresh-outreach-kim-jong-un-says-unification-unfinished-task", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "“Only by firmly defending our freedom can we become the leading force driving free and democratic unification,” Yoon said.\nHe also pledged to raise awareness about human rights abuses in North Korea, which has bristled for years at criticism of its rights record.\n“Even though the North Korean regime rejected our offer yet again, we will never stop making offers of humanitarian aid,” Yoon said.\nThis would allow South Korean companies to benefit from low-cost workers and open new avenues for commerce, according to analysis by Bloomberg Economics.\nSouth Korea expressed disappointment over the officials’ visit, its foreign ministry said in a statement."}, {"id": "bbff1f1d-2f22-4213-af93-d3b18b0e76e4", "title": "What the real aim of Ukraine Russian offensive ? ", "date": "2024-08-15 03:15", "url": "https://www.spectator.co.uk/article/whats-the-real-aim-of-ukraines-russian-offensive/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "On Monday morning, Vladimir Putin was briefed about Ukraine’s audacious invasion of Russian territory.\nUkraine captured more than 100 Russian troops in less than a day, the military chief said – they will be a part of the PoW exchange fund.\nSome 92 countries attended Ukraine’s peace summit in Switzerland in June, but Russia wasn’t invited so there was little progress.\nUK military intelligence estimates that half a million Russian troops have been killed or injured.\nThe crucial factor now is Ukraine’s capacity to sustain its offensive while also continuing the defence in the east."}, {"id": "8907549b-1b68-4512-9d1d-8eedc2ee204f", "title": "A Drunken Evening , a Rented Yacht : The Real Story of the Nord Stream Pipeline Sabotage", "date": "2024-08-15 05:45", "url": "https://freerepublic.com/focus/f-news/4258507/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "by 3 posted onby monkeyshine (live and let live is dead)To: buwayaWas the yacht called “The Left Hand”?\nby 4 posted onby monkeyshine (live and let live is dead)To: monkeyshineThe “Andromeda”, a 50-foot sailing yacht.\nby 11 posted onby Paul R. (Bin Laden wanted Obama killed so the incompetent VP, Biden, would become President!)\nDrunk, corrupt, drunk, devious, destructive, lawless, corrupt, drunk, lots of yachts laying around bought with America’s $$$, corrupt, drunk, evil.\nby 14 posted onby Nervous Tick (\"First the Saturday people, then the Sunday people...\": ISLAM is the problem!)"}, {"id": "25d27337-2a47-4a7f-9581-527b2868fb79", "title": "Ukraine incursion into Russia flips the script on Putin", "date": "2024-08-15 05:45", "url": "https://economictimes.indiatimes.com/news/defence/ukraines-incursion-into-russia-flips-the-script-on-putin/articleshow/112540679.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Since the start of the war, Putin has pledged that conscripts -- Russian men as young as 18 are required to serve in the military for a year -- would not be sent into the Ukraine war zone.\n\"Russia retains an advantage in the war in terms of personnel and domestic resources, but Ukraine's incursion underlined Kyiv's ability to use its nimble forces and Western weaponry to steal some of Russia's initiative.\nSome in Russia said they expected Putin to strike back in some unexpected form of his own, further escalating the violence of the war.\n\"A red line that seemed to be untouchable has been erased,\" Shlosberg said, referring to Ukraine's foray into Russian territory.\n\"Now Putin has a chance, a reason, to think about what line he should cross.\""}, {"id": "6c3b0af0-0db5-4562-b99a-d2a02dc81371", "title": "3 years after the Taliban return , Afghanistan is a broken country swarming with terrorists again", "date": "2024-08-15 05:30", "url": "https://theconversation.com/3-years-after-the-talibans-return-afghanistan-is-a-broken-country-swarming-with-terrorists-again-236860", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "This week marks the third year since America’s retreat from Afghanistan and the Taliban’s return to power.\nIt potentially stands on the edge of yet another world war.\nSuccess in Afghanistan was intertwined with two other broader US foreign policy goals under the presidency of Republican George W. Bush – the global war on terrorism and promoting democracy.\nAPThe Taliban’s extremismThe Taliban’s 2.0 minority tribal government has proven to be as dreadfully extremist and discriminatory as its previous reign of terror from 1996-2001.\nAnd the US defeat in Afghanistan has heartened America’s chief adversaries – Iran, Russia, China and North Korea."}, {"id": "3ace8b11-1ef1-4a09-8aca-f9ccf1608aac", "title": "Israel Hamas conflict : Gaza death toll passes 40 , 000", "date": "2024-08-15 14:00", "url": "https://www.9news.com.au/world/israel-hamas-conflict-gaza-death-toll-passes-40000/2a42fdf6-e17c-4415-be16-4be2ade548cf", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nPalestinian mourners prepare to bury their loved one at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024.\nPalestinian grave digger Sa'di Baraka, centre, oversees a burial in the cemetery in Deir al-Balah, Gaza Strip, Saturday, August 10, 2024.\nPalestinian mourners carry their loved one for burial at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024.\nPalestinian mourners bury their loved one at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024."}, {"id": "46e308c6-627f-41a8-aeb1-b4ca996a767e", "title": "07 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/07", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Two counter-attacks launched by assault detachments of the AFU 63rd Mechanised Brigade were repelled.\nThe AFU losses amounted to up to 120 Ukrainian troops, two pickup trucks, two 152-mm D-20 howitzers, and two 122-mm D-30 howitzers.\nThree counter-attacks launched by assault detachments of the AFU 53rd, 151st mechanised brigades, and 95th Air Assault Brigade were repelled.\nThe AFU losses amounted to up to 355 Ukrainian troops, one U.S.-made M113 armoured personnel carrier, one 122-mm D-30 howitzer, and one 100-mm Rapira anti-tank gun.\nTwo counter-attacks launched by units of the AFU 108th Territorial Defence Brigade were repelled."}, {"id": "5ef2b261-d76a-4d97-8d30-da43c317df82", "title": "July | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/07", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Russian Defence Ministry report on the progress of the special military operation (31 July 2024)The Armed Forces of the Russian Federation continue the special military operation.\nThe Armed Forces of Ukraine suffered losses of up to 350 troops, one U.S.-made HMMWV armoured fighting vehicle, one 122-mm D-30 howitzer, and one 100-mm Rapira gun.\nThe Zapad Group of Forces continue to take more advantageous lines and positions.\nOperational-Tactical Aviation, unmanned aerial vehicles, Missile Troops and Artillery of the Russian Groups of Forces have engaged AFU manpower and hardware in 143 areas during the day.\nAir defence units shot down two U.S.-made HIMARS MLRS projectiles, one Neptune long-range guided missile, and 42 unmanned aerial vehicles."}, {"id": "4da88b6d-488a-4516-86ac-8b5a1122378a", "title": "Who is Oleksandr Syrski , Ukraine  butcher , in - charge of the Kursk incursion in Russia ? – Firstpost", "date": "2024-08-15 10:15", "url": "https://www.firstpost.com/explainers/ukraine-incursion-russia-kursk-general-oleksandr-syrski-butcher-13804903.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Ukraine’s forces have launched a surprise incursion into Russia’s Kursk, capturing more than 1,000 square kilometres and 74 towns and settlements.\nWho is responsible for the Ukrainian incursion, which according to analysts has left Russian President Vladimir Putin red-faced?\nWho’s responsible for Ukraine’s incursion into Russia?\nUkraine’s President Volodymyr Zelenskyy with Commander in Chief of the Ukrainian Armed Forces Oleksandr Syrski in Kyiv after the latter was promoted.\nA week into the incursion, Russia has responded to Ukraine’s incursion with anger."}, {"id": "b3e3705a-4fa7-4dd9-8790-f20517303b3d", "title": "South Korea Yoon Offers Rare Olive Branch to Kim Jong Un", "date": "2024-08-15 04:30", "url": "https://www.yahoo.com/news/south-korea-yoon-offers-rare-024638695.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "“Only by firmly defending our freedom can we become the leading force driving free and democratic unification,” Yoon said.\nHe also pledged to raise awareness about human rights abuses in North Korea, which has bristled for years at criticism of its rights record.\nKim has strengthened his hand by providing munitions to Russia in exchange for aid propping up his economy, the US and South Korea have said.\n“Even though the North Korean regime rejected our offer yet again, we will never stop making offers of humanitarian aid,” Yoon said.\nSouth Korea expressed disappointment over the officials’ visit, its Foreign Ministry said in a statement."}, {"id": "f3f0030b-0e78-40ff-b326-b72a53e3635e", "title": "The simple gesture that proves just how much pressure Putin is under", "date": "2024-08-15 12:00", "url": "https://metro.co.uk/2024/08/15/simple-gesture-proves-just-much-pressure-putin-21426474/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "CCTV footage shows troops victoriously taking down a Russian flag from the top of the House of Culture in the village of Vnezapnoe, in Kursk.\nIt is a scene that is being repeated as Ukrainian forces ramp up attacks in the west of the border region.\nBut the move is also aimed at forcing Putin to slow down his advances in Ukraine by pulling back Russian forces to protect sovereign land.\nFootage showed burnt-out columns of Russian military vehicles, and Ukrainian soldiers handing out humanitarian aid to local residents and removing Russian flags from an administrative building.\nIn an update on Facebook, the defence ministry said it had struck the airfields of Khalino, Savasleyka, Borisoglebsk and Baltimore."}, {"id": "e2d8c1d9-d46e-402c-be70-5a6075110256", "title": "Despite Retired Israeli General Warning , US , Europeans Push Hard for Ceasefire Talks , Hostage Deal", "date": "2024-08-15 13:30", "url": "https://www2.cbn.com/news/israel/despite-retired-israeli-generals-warning-us-europeans-push-hard-ceasefire-talks-hostage", "domain": "cbn.com", "domain_classification": "Unknown", "message": "JERUSALEM, Israel – A high-level Israeli delegation is in Qatar for talks intended to end the Israel-Hamas war and bring home the Hamas-held hostages.\nAs Israelis continue to wait for a possible Iranian attack, the ceasefire talks begin in Qatar on Thursday without a Hamas representative.\nGermany's Ambassador to Israel Steffen Seibert declared, \"All eyes and the hopes of millions – millions in Israel and millions in Gaza – are pinned on this Thursday, on the possible talks about a deal.\"\nYet the same article quotes retired Israeli Maj.-General Yaakov Amidror, who urges the Jewish state to continue the fight.\nIsraeli President Isaac Herzog held a prayer vigil for the hostages in the synagogue at his official residence."}, {"id": "02f288e0-5a02-4fe1-93c2-5d443c4723c0", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 02:15", "url": "https://www.stltoday.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_622e9fd6-ab35-5ae4-8bac-56b360a5d65b.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "f511b3d7-03b4-48de-87ee-271230b4fcf3", "title": "Brad Pitt , Angelina Jolie Legal Battle : How Did it Come to This ? ", "date": "2024-08-15 02:45", "url": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-angelina-jolies-bitter-legal-battle-where-do-they-stand/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Nestled among the rolling hills of the French countryside in the small village of Correns sits Château Miraval, the centuries-old 1,200-acre property Brad Pitt and Angelina Jolie purchased for $28.4 million in 2008.\nA little more than a decade later, the winery is at the center of Pitt and Jolie’s seemingly never-ending feud.\n(Pitt’s legal team is looking to prove his request to have Jolie sign one is a common business practice.)\n“The issue of NDAs has become a key battleground in the dispute,” a member of Pitt’s legal team tells Us.\nA Pitt source says Jolie’s side has turned the war over Miraval into a rehashing of their divorce case."}, {"id": "7abed0cf-d3d0-490d-8fcc-30ec862d843b", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 03:15", "url": "https://omaha.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_d1bef3fa-2825-5bac-9282-c04b9f893146.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "78fa90a5-c120-40e1-8de2-e056197bfe38", "title": "Cherie Blair represents Russian oligarch in $16bn battle with Luxembourg", "date": "2024-08-15 14:15", "url": "https://www.yahoo.com/news/cherie-blair-represents-russian-oligarch-132422360.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Cherie Blair, the co-founder and chair of law firm Omnia Strategy, has been a barrister since 1976 - Riccardo Savi/Getty ImagesCherie Blair is representing a sanctioned Russian oligarch in a $16bn (£12bn) legal battle with Luxembourg.\nMr Fridman claimed to have been blocked from managing or receiving the returns from $16bn of investments in Luxembourg for nearly two and half years, despite overturning previous sanctions earlier this year.\nMost of Mr Fridman’s assets and investments are managed by companies incorporated in Luxembourg, a financial hub inside the EU.\nLady Blair, who became a barrister in 1976, and her law firm, Omnia Strategy, are among the lawyers instructed by Mr Fridman.\nLuxembourg’s government confirmed that Mr Fridman had begun arbitration proceedings against the country."}, {"id": "936abee7-3a30-42c9-bd50-92961293e215", "title": "Boost for IAF fighter fleet ! Sukhoi 30 - MKI jets likely to get new engines in Rs 21 , 000 crore deal", "date": "2024-08-15 07:15", "url": "https://timesofindia.indiatimes.com/business/india-business/boost-for-iafs-fighter-fleet-sukhoi-30-mki-jets-likely-to-get-new-engines-in-rs-21000-crore-deal/articleshow/112541992.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Sukhoi 30-MKI fighter jets set for a boost!\nThe Defence Ministry is looking to sign a deal worth approximately Rs 21,000 crore to procure jet engines for its Su 30MKI fighter fleet.\nA significant portion of the order value is expected to be passed on to the vendor and supplier base that HAL has developed over the years.Besides the new engines, the Su 30MKI fighter jet fleet, which forms the backbone of the Indian Air Force , is set to undergo an upgrade that will include entirely new avionics, radars, and electronic warfare suites.\nThe first phase of the upgrade, which will be carried out entirely in India, will involve close to 100 fighters.HAL will be the lead agency for the upgrade, valued at over Rs 60,000 crore, in collaboration with the Indian Air Force and other partners.\nIndia had initially ordered 272 of the fighter jets from Russia.The defence ministry has also approved an additional order for 12 more jets, valued at nearly Rs 11,000 crore, to replace aircraft lost in accidents, but the deal has not yet been signed."}, {"id": "90f45bf7-c3bd-45df-94bd-59ce1d2db3a9", "title": "  We are in shock : US soldier found dead at military base , roommate charged with murder", "date": "2024-08-15 06:15", "url": "https://www.azfamily.com/2024/08/14/we-are-shock-us-soldier-found-dead-military-base-roommate-charged-with-murder/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "LAKE COUNTY, Ohio (WOIO/Gray News) - A family in Ohio is grieving and desperate for answers after a 21-year-old soldier died while stationed at a military base in New York.\n“Jacob was my first best friend in this world, and he was taken from me, taken from my family,” Alaina Ustupski, the soldier’s sister, said.\nAuthorities reported that fellow U.S. Army Specialist Riley Birbilas, 22, has been charged with premeditated murder and obstruction of justice.\n“No one knew anything about him.”The soldier’s family said Ashton and Birbilas deployed to Iraq together in 2023 for nine months.\n“They said the trial might take up to a year so we’re just trying to take it day by day."}, {"id": "196c7c55-e5ab-42e0-b90f-a2936b162e3a", "title": "Ukraine Says It Has Taken More Ground And Prisoners During Its Advance Into Russia Border Region", "date": "2024-08-15 14:00", "url": "https://www.theyeshivaworld.com/news/general/2305845/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border-region.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 has rattled the Kremlin.\nSyrskyi claims Ukrainian forces have advanced into 1,000 square kilometers (about 390 square miles) of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv has claimed.\nAnalysts say Kyiv’s forces targeted the Kursk region because Russia’s weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "601cc049-fe84-4cbb-a025-1d3a4f6d817a", "title": "Two programs suggest the Pentagon is getting better at buying technology", "date": "2024-08-15 06:45", "url": "https://www.defenseone.com/technology/2024/08/dod-getting-better-buying-tech-reports-say/398821/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "Two new reports suggest that the Pentagon may have finally learned how to buy technology at lower cost quickly, at least when it comes to AI-driven capabilities.\nOne report looks at the Maven Smart System, or MSS, part of Maven, a system for rapidly analyzing and sharing intelligence.\nEmelia Probasco, a Senior Fellow at Georgetown's Center for Security and Emerging Technology, describes how MSS works in a report out this week.\nMSS had senior leaders who championed the program, a mature technology, and direct access to developers and testers.\n“The CCA program and others like it, such as the Replicator initiative, show that the DOD is trying to change and maintain its competitiveness in a new military technology equilibrium where mass once again matters.”"}, {"id": "a169c083-f795-4a8b-a8a1-520ed63c3580", "title": "人道法の歴史に名を残した6人のスイス人", "date": "2024-08-15 14:00", "url": "https://www.swissinfo.ch/eng/international-geneva/%E3%82%B8%E3%83%A5%E3%83%8D%E3%83%BC%E3%83%96%E6%9D%A1%E7%B4%84%E3%81%A8%E3%82%B9%E3%82%A4%E3%82%B9%E3%81%AE%E3%81%8B%E3%81%8B%E3%82%8Fr/86669293", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Close ShareThe four Geneva Conventions celebrate their 75th anniversary on Monday.\nTo mark the occasion, SWI swissinfo.ch invites you to (re)discover six Swiss personalities who championed international humanitarian law from 1864 to 2024.\nThe first gave rise to the Geneva Conventions and the second to the Red Cross movement.\nThis led to the four Geneva Conventions of 1949, which ensured the protection of civilians.\nDuring his long career with the ICRC, Pictet held the positions of director general and vice-president."}, {"id": "9b12741a-8932-44fd-875b-e0395fbeb2d4", "title": "New commander takes over USS Montana submarine", "date": "2024-08-15 01:00", "url": "https://helenair.com/news/local/new-commander-takes-over-uss-montana-nuclear-submarine/article_876a1e16-5a7a-11ef-88e0-bf9e467ca761.html", "domain": "helenair.com", "domain_classification": "Unknown", "message": "John Gilligan is the new commanding officer of the USS Montana as part of the Navy’s normal succession and career development processes.\nJon Quimby was relieved of command of the USS Montana by Gilligan as part of the U.S. Navy’s normal succession and career development processes, according to a posting by the USS Montana Committee’s website.\nBrian Hogan, commodore and commander of Submarine Squadron 8, which the USS Montana, also known as SSN 794, is assigned until her move to the Pacific Fleet, praised both officers.\nThe USS Montana is a $2.6 billion Virginia-class nuclear-powered submarine, which are fast-attack submarines.\nBerthing areas, where sailors sleep, are named for Montana places and towns such as Helena and Kalispell."}, {"id": "b245192b-2e07-4853-9582-10f9c7e4904a", "title": "Ukraine continues push in Kursk | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-15 11:30", "url": "https://www.arkansasonline.com/news/2024/aug/15/ukraine-continues-push-in-kursk/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 has rattled the Kremlin.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv has claimed.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\n(AP Photo/Evgeniy Maloletka)Ukrainian servicemen sit inside their APC after returning from Russian Kursk region, near Russian-Ukrainian border, Sumy region, Ukraine, Wednesday, Aug. 14, 2024."}, {"id": "ba7651f9-f14e-4ff1-9f81-657c5fea9383", "title": "Russia moving troops from Kaliningrad to Kursk to repel Ukraine attack , official says", "date": "2024-08-15 04:15", "url": "https://news.yahoo.com/news/russia-moving-troops-kaliningrad-kursk-153344767.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Russia moving troops from Kaliningrad to Kursk to repel Ukraine attack, official saysRussia moving troops from Kaliningrad to Kursk to repel Ukraine attack, official saysRussia has moved troops from the isolated European enclave Kaliningrad to the border region of Kursk to help defend against a Ukrainian incursion, according to Lithuania.\n“We are now seeing how they are redeploying their troops from Kaliningrad to Kursk,” Lithuanian Defense Minister Laurynas Kasčiūnas told Ukrainian President Volodymyr Zelensky in a Tuesday meeting.\nKaliningrad was estimated to have some 30,000 troops stationed there before the war in Ukraine, but some of them have already been moved to the battlefield.\nIt’s not clear how many were redeployed to Kursk, where Ukrainian troops caught Russia by surprise in an Aug. 6 counterattack in the Russian region.\nThe New York Times reported Wednesday, citing a U.S. official, that Russia had redeployed some troops from Ukraine, though there were few details."}, {"id": "6780be1e-ad88-43c5-bb17-3597d2b081b9", "title": "Gaza death toll hits 40 , 000 with thousands more yet to be counted", "date": "2024-08-15 13:30", "url": "https://www.irishexaminer.com/world/arid-41456605.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "They are not listed among Gaza’s war dead, because their bodies were trapped too deep beneath the rubble for rescue teams to reach them.\nTen months into Israel’s war on Gaza, the death toll has passed 40,000, according to health authorities there.\nHams said:People who died due to indirect impacts of war, including diseases, starvation and the collapse of the healthcare system, are not included [in the war dead].\nThey had a life to live, they had families and friends, but they left without even saying goodbye.”Israeli officials question the death toll given by the authorities in Gaza.\nThe pace of death in Gaza has slowed slightly this year compared with 2023."}, {"id": "5ce2af71-cfe4-41bc-9c16-17c2600a6103", "title": "Silver anniverary concert for Meir Ariel , the late singer - songwriter - Israel Culture", "date": "2024-08-15 04:30", "url": "https://www.jpost.com/israel-news/culture/article-814774", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Singer-songwriter Meir Ariel has been gone for a quarter of a century.\nIt is hard to believe the still celebrated poet-troubadour passed away so long ago, at the early age of 57.\nDuring a two-year sojourn in the US in the late 1960s, Ariel took on all sorts of influences from American artists, particularly Bob Dylan.\nAriel was known by some as “the Israeli Dylan,” and the power and artistry of his lyrical work certainly provide the requisite collateral for that.\nRegardless of any further salutes, the Israeli music scene would undoubtedly have been much poorer without Meir Ariel."}]