[{"id": "c7cd7e2c-7161-46c5-b27a-1bf43d64893c", "title": "Israeli Strike Kills 1 , Wounds Many East Of Lebanon Tyre - Report", "date": "2024-06-14 06:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-israeli-strike-kills-1-wounds-many-east-of-lebanon-s-tyre-report", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Initial reports indicated that an Israeli airstrike targeted a residential building between the towns of Jannata and Deir Qanoun En Nahr in southern Lebanon, according to Lebanon’s official National News Agency.\nAl Arabiya sources suggest that the building allegedly targeted by the Israel Defense Forces (IDF) in Jannata was rented by Hezbollah.\nAccording to the Lebanese news outlet An-Nahar, several drones were seen above the building during the missile attack.\nThe strike came shortly after Hezbollah claimed launching rockets and weaponized drones at several Israeli military sites in a coordinated attack on the country's north earlier on Thursday.\nHostilities on the Israel-Lebanon border have intensified after the Israeli military on Tuesday carried out a strike in the same district, killing a senior Hezbollah commander."}, {"id": "5effe9bf-6a93-42d2-9fbd-a0bb0f75f69f", "title": "Hezbollah launches massive strikes on Israeli military positions in solidarity with Gaza", "date": "2024-06-14 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240613-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah launches massive strikes on Israeli military positions in solidarity with GazaIran Press TVThursday, 13 June 2024 3:08 PMThe Lebanese Hezbollah resistance forces conducted a series of strikes against Israeli military positions in the northern side of the 1948 occupied territories in response to the ongoing Israeli onslaught against Palestinians in the Gaza Strip.\nThe military media bureau of Hezbollah also published video footages of the Lebanese resistance fighters' earlier attacks on the Israeli al-Raheb and Ramia outposts as well as the Zarit barracks.\nIt also published scenes of retaliatory operations against Meron Air Base and the headquarters of the Northern Command of the Israeli military in the northern part of the occupied lands.\nAccording to the source, Hezbollah struck over 10 military targets, including intelligence targets related to the assassinations of its officials.\nThe Israeli military reported that some 40 rockets crossed the border, many of which were allegedly intercepted by the so-called Iron Dome missile systems, but others impacted, causing at least 15 fires."}, {"id": "5cc3dcf6-3f7f-41e7-b381-0e0609e86e4d", "title": "Two Lebanese Women Martyred , Dozens Injured in Israeli Air on South Lebanon", "date": "2024-06-14 09:15", "url": "https://english.almanar.com.lb/2131582", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Two Lebanese women lost their lives and 14 people were wounded in an Israeli air strike on a building in Jennata, South Lebanon.\nThe attack sparked fears of retaliation from Hezbollah, with Israeli media warning of unpredictable responses.\nAs rescue teams search for survivors under the rubble, tensions escalate as Hezbollah carried out a significant counterattack in response to the ongoing assaults on Lebanese towns and civilians by the Israeli occupation.\nThe Resistance launched a joint missile and drone attack, targeting multiple Israeli occupation military sites and barracks in a 30-minute operation.\nIsraeli media reported the attack involved 150 rockets, drones, and anti-tank missiles, marking the largest assault since October 7."}, {"id": "ef67f370-d35f-40ba-8f2f-ed572bbd6039", "title": "Hezbollah fires new barrage at Israel , which vows to hit back", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818434-Hezbollah-fires-new-barrage-at-Israel,-which-vows-to-hit-back", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah fires new barrage at Israel, which vows to hit backWorld World Hezbollah fires new barrage at Israel, which vows to hit backHezbollah group said it had fired waves of rockets and drones at the Israeli army on Thursday.\nThe major attack comes after months of near-daily cross-border fire between the group and the Israeli military since Hezbollah ally Hamas's October 7 attack on Israel triggered the Gaza war.\nThe Israeli army said during the afternoon that about \"40 projectiles were launched toward the Galilee and Golan Heights area\", adding most were intercepted, while some ignited fires.\nThe Israeli army confirmed it carried out the strike that \"eliminated\" Abdallah on Tuesday, describing him as \"one of Hezbollah's most senior commanders in southern Lebanon\".\nA Lebanese military source said he was the \"most important\" Hezbollah commander to have been killed since the start of the war."}, {"id": "383e0d1e-5d30-4467-87cc-3546387634f5", "title": "Hizbollah Rains Rockets On Israel After Strike Kills Commander", "date": "2024-06-14 04:45", "url": "https://menafn.com/1108331324/Hizbollah-Rains-Rockets-On-Israel-After-Strike-Kills-Commander", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Hizbollah has traded near-daily cross-border fire with Israeli forces since its Palestinian ally Hamas attacked southern Israel on October 7, triggering war in the Gaza Strip.\nThe exchanges have escalated in recent weeks, with Hizbollah stepping up its use of drones to attack Israeli military positions and Israel hitting back with targeted strikes against the fighters.\nThe Israeli forces on Wednesday confirmed it had“eliminated” Taleb Sami Abdallah in a strike the day before on a Hizbollah command centre in southern Lebanon.\nOn Tuesday, Hizbollah said it fired about 50 rockets at Israeli positions in the annexed Golan Heights.\nTens of thousands of people have been displaced on both sides of the border since the violence erupted the day after the Hamas attack on southern Israel."}, {"id": "fd2a0c3e-f028-4cc1-9cbc-4763a9ce9567", "title": "Israeli strike kills two people , wounds seven in southern Lebanon", "date": "2024-06-14 12:45", "url": "https://www.yahoo.com/news/israeli-strike-kills-two-people-115824645.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Marwan Naamani/dpaAt least two people were killed and seven others wounded in an Israeli airstrike overnight that hit a house in southern Lebanon, security sources and state media reported on Friday.\nThey added that flying shrapnel from the strike on the targeted Hezbollah base hit and damaged an adjacent residential building, killing the two women.\nMeanwhile, Israeli reportedly shelled some Lebanese villages in southern Lebanon causing fires in some fields.\nThe escalation on the Lebanese-Israel border has raised fears of an all-out war by Israel on Lebanon to halt Hezbollah attacks.\nMarwan Naamani/dpaA view of rubble of destroyed houses caused by Israeli air raids are seen in the Lebanese southern village of Naqura."}, {"id": "04083a2b-9f1e-4c58-8ea6-8428829fe3f6", "title": "Explosion Heard In Kyiv During Air Alert", "date": "2024-06-14 12:30", "url": "https://charter97.org/en/news/2024/6/14/598886/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Explosion Heard In Kyiv During Air Alert 14.06.2024, 7:468,440The cause could be an aeroballistic Kinzhal missile.\nPresumably the air defence forces shot down a high-speed target in Kyiv region.\nWe remind you, about 6:00 a second air alert was announced in Kyiv throughout Ukraine because of the takeoff of a MiG-31 fighter jet.\nLater in the Air forces reported about the high-speed target, which moved in the direction of Kyiv region.\nAround 3:00, a large-scale air alert was declared in Ukraine due to the launch of cruise missiles from enemy bombers."}, {"id": "c34e23f9-b6da-4e79-9b06-a2293b9b35cc", "title": "Man arrested in connection with three stabbings throughout Charlotte", "date": "2024-06-14 01:30", "url": "https://www.wsoctv.com/news/local/cmpd-arrests-suspect-accused-stabbing-woman-she-left-work/BCHDJ7F4WNGEPCVCMMINDRHVYQ/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "24e87278-9d20-4a46-960b-834ced827f93", "title": "The Russian Air Force Is Getting Blown to Bits in Ukraine", "date": "2024-06-14 12:30", "url": "https://nationalinterest.org/blog/buzz/russian-air-force-getting-blown-bits-ukraine-211440", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Ukraine claims to have downed or damaged 359 Russian aircraft and 326 helicopters.\nRussia's inability to dominate Ukrainian airspace has led to high attrition rates and significant daily casualties, with total Russian casualties nearing 525,000.\nAlthough the Ukrainians have much better visibility on the Russian casualties, they also have a general tendency to “spice up” enemy casualties for psychological reasons.\nHowever, overall, the Ukrainian estimates of Russian casualties have been corroborated by the West at some point.\nHeavy Casualties overall for Russia in UkraineOne thing that remains constant for the Russian military is the heavy casualty rate."}, {"id": "8e3a007e-3a30-4286-8d1f-d1272f4b42f4", "title": "Gaza : 30 Palestinians killed , 105 injured by Israeli bombings last 24hrs - The Muslim News", "date": "2024-06-14 02:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-30-palestinians-killed-105-injured-by-israeli-bombings-last-24hrs/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): At least 30 people were killed and 105 others were injured in Israeli indiscriminate bombings in Gaza Strip in the last 24 hours, according to the Health Ministry.\nThe Israeli artillery fired shells at Palestinian homes northwest of the Nuseirat camp and Al-Mughraqa area in the central Gaza Strip.\nWAFA correspondent reported that Israeli warplanes targeted a house in the Nafeq Street area of Gaza City with two missiles.\nAn Israeli airstrike on a residential apartment in Gaza City killed seven Palestinians and injured others, including children and women, on Thursday, according to Gaza’s Civil Defense Agency.\nWitnesses also told Anadolu that Israeli artillery continues to shell areas and homes in the Al-Zaytoun neighborhood in southeast of Gaza City."}, {"id": "6ad8cd3e-4c05-4155-aee4-7dd62fcf5bc0", "title": "Hezbollah claims biggest attack on Israel since outbreak of Gaza conflict - Xinhua", "date": "2024-06-14 08:30", "url": "https://english.news.cn/20240613/f195ee24eb9a4c59b20511b318dd55c4/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024.\nTuesday's attack hit a house in Jouaiya, killing Abu Talib and three of his companions.\nA Lebanese military source told Xinhua that the Lebanese Army's observation posts on Thursday monitored the launch of about 150 surface-to-surface missiles and about 20 drones from Lebanon towards northern Israel.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah towards Israel in solidarity with Hamas's attack on Israel the day before.\n(Photo by Taher Abu Hamdan/Xinhua)A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024."}, {"id": "cfc9454d-e48f-4e94-93d8-d4271b753c37", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818432-Huthi-missile-attack-severely-injures-sailor-on-cargo-ship:-US-military", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Huthi missile attack severely injures sailor on cargo ship: US militaryWorld World Huthi missile attack severely injures sailor on cargo ship: US militaryTwo cruise missiles launched by Huthi rebels struck a bulk cargo carrier in the Gulf of Aden.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nOn Wednesday, the Huthis struck the Tutor, a Liberian-flagged bulk carrier, southwest of Hodeida.\nCENTCOM later said the Tutor had been struck by a Huthi \"unmanned surface vessel\" that \"caused severe flooding and damage to the engine room\"."}, {"id": "542e5681-daef-41c4-bb92-b003336d6580", "title": "Hezbollah shells Kiryat Shmona , Kfar Szold in response to Janata strike", "date": "2024-06-14 12:30", "url": "https://www.naharnet.com/stories/en/305912-hezbollah-shells-kiryat-shmona-kfar-szold-in-response-to-janata-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah attacked Friday Kiryat Shmona and Kfar Szold with dozens of rockets, in response to an overnight strike that killed 2 women and injured several civilians in south Lebanon.\nHezbollah said in a statement it has targeted the two Israeli settlements with Katyusha and Falaq rockets, in response to the strike on Janata that killed and injured civilians.\nThe group later targeted buildings used by Israeli soldiers in Metula in north Israel, also in retaliation to the Janata strike.\nHezbollah vowed to \"increase the intensity, strength, quantity and quality\" of its attacks, after an Israeli strike killed one of its senior commanders.\nIsraeli authorities say at least 15 Israeli soldiers and 11 civilians have been killed."}, {"id": "6facd2be-cbe4-48b7-81ba-f6c6ef5127a2", "title": "Houthi missile strikes set ship ablaze , injure one crew , US military says", "date": "2024-06-14 04:30", "url": "https://interaksyon.philstar.com/politics-issues/2024/06/14/277392/houthi-missile-strikes-set-ship-ablaze-injure-one-crew-us-military-says/", "domain": "interaksyon.philstar.com", "domain_classification": "Unknown", "message": "The Iran-allied Mouths have launched dozens of attacks on international shipping in the Red Sea region since November in solidarity with the Palestinians in the war between Israel and Hamas.\nThree missiles struck the Verbena on Thursday, sparking a fire and damaging the ship, the United Kingdom Maritime Trade Operations (UKMTO) agency said.\nA day earlier, Yemen’s Houthi militants took responsibility for small watercraft and missile attacks that left the Tutor, a Greek-owned cargo ship, taking in water and in need of rescue near Yemen’s Red Sea port of Hodeidah.\nThe Houthi campaign in the Red Sea region has disrupted global shipping, cascading delays and costs through supply chains.\nUKMTO said the master of one of those reported an explosion near the vessel that did not cause any damage or injury."}, {"id": "6d68d765-b4cf-4cbf-b1a5-cc54fd9b0b2b", "title": "Press TVs news headlines", "date": "2024-06-14 13:00", "url": "http://www.presstv.ir/Detail/2024/06/14/727438/Press-TV-s-news-headlines", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The regime’s fresh attacks on Gaza City took the lives of at least 19 Palestinians, including women and children.\nThe regime says 33 of its soldiers have been wounded in clashes in Gaza in the past 48 hours.\nThe Israeli attack took place in the town of Janata early on Friday.\nThe group has time and again warned that if Israel keeps crossing the red lines by targeting Lebanese civilians, it will pay the price of its action with blood.\nIn a message on the occasion of the annual Hajj rituals, Ayatollah Seyyed Ali Khamenei said the complex rituals instill intimidation and trepidation among the enemies and ill-wishers."}, {"id": "f2ce1505-7b02-4366-b2f9-1d983850ae31", "title": "Ukraine Presumed Air Base Targeted by Russian Combined Missile and Drone Attack", "date": "2024-06-14 07:30", "url": "https://www.kyivpost.com/post/34262", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The primary target of the strike was Starokostyantyniv in the Khmelnytsky region, which is widely thought to be home to a vast Ukrainian air base.\nThe assault began at approximately 22:40 with the attack by Iranian-made Shahed combat drones, followed by the launch of cruise missiles, and concluded at 04:43.\nFor the first time since a Russian Tu-22M3 was shot down, the strategic bomber was employed within reach of Ukraine’s air defense systems.\nJust over an hour later, at 06:00, Starokostyantyniv was attacked using a Kh-47M2 Kinzhal hypersonic missile.\nAdvertisementUkraine's Air Force successfully intercepted five out of 7 missiles and 14 out of 17 drones during the assault, with air defenses reacting in the Khmelnytsky, Kyiv, Dnipropetrovsk, Zaporizhia, Mylolaiv, Kharkiv and Odesa regions."}, {"id": "37cafa93-a1fd-42e2-a361-e6c2d5b1c782", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:30", "url": "https://abcnews.go.com/Business/wireStory/missile-strike-yemens-houthi-rebels-sets-cargo-ship-111114121", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Earlier Thursday, the British military's United Kingdom Maritime Trade Operations center said a vessel had been attacked and had caught fire.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen’s capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "ae65ee1d-449c-4997-a39d-2e823a4bd5e2", "title": "Hezbollah says it attacked 9 Israeli military sites with rockets and drones", "date": "2024-06-14 00:00", "url": "https://www.scmp.com/news/world/middle-east/article/3266548/hezbollah-says-it-attacked-9-israeli-military-sites-rockets-and-drones", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Asked about the incident, the Israeli military said it was looking into it.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander .\nHezbollah said it had launched rockets and weaponised drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon’s southern border for the second consecutive day.\nHezbollah said in a statement earlier that it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nState broadcaster Kan broadcast footage of numerous mid-air interceptions of rockets above Israeli towns, including in Safed, some 12km (7.5 miles) from the border."}, {"id": "80e0eda6-43a7-453a-afa3-1c0e3c2fb373", "title": "A missile strike from Yemen  Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/14/fgn9-yemen-houthi--rebels-cargo.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Jun 14 (AP) Yemen's Houthi rebels launched two anti-ship cruise missiles and struck a commercial ship Thursday in the Gulf of Aden off Yemen, setting it on fire and severely wounding one civilian mariner, authorities said.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen's capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "8a35de2a-5e56-413e-9f8c-d9bd15389959", "title": "Children , Nurse Reportedly Killed As Israel Launches Fresh Attack On Lebanon Amid Fight With Hezbollah", "date": "2024-06-14 14:30", "url": "https://saharareporters.com/2024/06/14/children-nurse-reportedly-killed-israel-launches-fresh-attack-lebanon-amid-fight", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "The Israel Defense Forces have launched another attack on Southern Lebanon as their fight with a militant group based in the country, Hezbollah intensifies.\nThe Israel military said its warplanes bombed infrastructure used by Hezbollah in several locations in southern Lebanon, according to AP News.\n“Israel killed Sally Skayki, a young Lebanese nurse, in South Lebanon tonight while she was sleeping,” Sarah said.\nCowards.”Tweet URLHoward Beckett wrote: “These are scenes from Jannata in southern Lebanon 🇱🇧 after an attack by Israel 🇮🇱.\nAccording to Jerusalem Post, there was no such news in Israeli media, but warnings in Arab media caused tremendous alarm in Lebanon."}, {"id": "f8c8c6cc-7455-47fb-9b9c-574ddb9a4c22", "title": "Wakeley church terrorist attack : Alleged Wakeley church terror stabber faces new charges", "date": "2024-06-14 03:30", "url": "https://www.9news.com.au/national/alleged-wakeley-church-terror-stabber-faces-new-charges/f623106b-629a-4955-bcb5-a100806141af", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Investigators will comb through thousands of videos and images on the phone of a 16-year-old boy accused of stabbing a bishop during a live-streamed sermon.\nFresh charges have been levelled against a 16-year-old boy accused of stabbing a bishop.\nThe teen is behind bars, accused of stabbing Assyrian bishop Mar Mari Emmanuel and priest Isaac Royel during a live-streamed service at Christ the Good Shepherd Church on April 15.\nThe fresh intent to murder charge relates to Bishop Emmanuel, while the intent to cause grievous bodily harm charge relates to Father Royel.\nThe stabbing, which investigators say was religiously motivated, left Bishop Emmanuel seriously injured before the teenager was subdued."}, {"id": "547b68b5-3ff3-4ddb-9fe3-73b530bb7a17", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://ktok.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "ktok.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "bc496aab-17b1-4f56-9cac-67218c025918", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://jetradio1400.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/?pname=www.jetradio1400.com&sc=dnsredirect", "domain": "jetradio1400.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "020e5c75-6953-4f5d-b6cd-cbceafcc1e82", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:45", "url": "https://970kfbx.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "f8d62c0e-9f58-47fb-9fa2-3638426d2e67", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://talkradio1080.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "talkradio1080.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "59e68746-729c-4911-8804-46d70bd764b0", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://newsradio1470.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradio1470.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "9f7c58ff-0de4-4fa3-ad2a-3d343c2007a2", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building | NewsRadio WKCY", "date": "2024-06-14 00:30", "url": "https://newsradiowkcy.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "fd74dfa2-f867-4054-9745-ae6e254d66cf", "title": "Houthi missile strike on cargo ship severely injures sailor", "date": "2024-06-14 09:00", "url": "https://www.thenationalnews.com/news/mena/2024/06/14/houthi-missile-strike-on-cargo-ship-severely-injures-sailor/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "A sailor was severely wounded after a cargo ship in the Gulf of Aden was hit by two cruise missiles fired by Yemen's Houthi rebels on Thursday.\nAircraft from USS Philippine Sea missile cruiser evacuated the injured sailor to another ship for treatment, it said.\nHouthi rebels in Yemen have pledged to disrupt all shipping destined for Israel through the Red Sea and the Suez Canal.\nCentcom said the Houthis had launched two ballistic missiles in the Red Sea that caused “no injuries or significant damage”.\nCentcom also said it destroyed an unmanned Houthi boat and two patrol vessels in the Red Sea, as well as one drone."}, {"id": "ae4286b6-66d7-4a73-8915-a20b7f269d33", "title": "Hezbollah shells Kiryat Shmona and Kfar Szold in response to Janata strike", "date": "2024-06-14 13:15", "url": "https://dailystar.com.lb/hezbollah-shells-kiryat-shmona-kfar-szold/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Hezbollah launched a barrage of rockets at Kiryat Shmona and Kfar Szold on Friday, in retaliation for an overnight Israeli strike that killed two women and injured several civilians in southern Lebanon.\nHezbollah stated it targeted the Israeli settlements with Katyusha and Falaq rockets in response to the strike on Janata that resulted in civilian casualties.\nThe group also attacked buildings used by Israeli soldiers in Metula, north Israel, as further retaliation.\nHezbollah has vowed to “increase the intensity, strength, quantity, and quality” of its attacks following the Israeli strike that killed one of its senior commanders.\nIsraeli authorities report that at least 15 Israeli soldiers and 11 civilians have been killed."}, {"id": "6a811124-d249-44c3-b166-6b7197c13327", "title": "Middle East crisis : As border clashes intensify , Hezbollah fires rockets into northern Israel again", "date": "2024-06-14 04:30", "url": "https://thelabradorian.ca/middle-east-crisis-as-border-clashes-intensify-hezbollah-fires-rockets-into-northern-israel-again/", "domain": "thelabradorian.ca", "domain_classification": "Unknown", "message": "But al-Manar, the group’s broadcaster, reported at one point that more than 100 people had been shot in a coordinated attack targeting several Israeli military installations.\nIsrael’s military said in the afternoon that Hezbollah had fired more than 40 rockets across the border, but the barrage continued into the evening.\nOn Wednesday, Israel fired more than 200 rockets at Israel, according to the military, but they did little damage.\nThe Israeli military said Thursday that its warplanes struck “Hezbollah military structures” in Lebanese border villages overnight.\nSome residents said they had never seen the leaflets, while others said they were confused by the numbering system the Israeli military uses to define “humanitarian zones”."}, {"id": "319f8428-126c-4c75-9d99-06894e0a0f00", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 12:30", "url": "https://economictimes.indiatimes.com/news/defence/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/articleshow/110999612.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\n\"This is the most sustained combat that the US Navy has seen since World War II - easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nIf you let it fester, the Houthis are going to get to be a much more capable, competent, experienced force.\n\"Asked if the Navy believed Iran picks targets for the Houthis, Miguez would only say there was \"collaboration\" between Tehran and the rebels.\n\"Officers acknowledge some grumbling among their crew, wondering why the Navy doesn't strike harder against the Houthis."}, {"id": "9b94e503-db12-4f7f-96c2-9280aadc3b3b", "title": "US Navy Faces Its Most Intense Combat Since World War II Against Yemen Iran - Backed Houthi Rebels", "date": "2024-06-14 13:45", "url": "https://www.military.com/daily-news/2024/06/14/us-navy-faces-its-most-intense-combat-world-war-ii-against-yemens-iran-backed-houthi-rebels.html", "domain": "military.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "8e601fe3-510f-48c2-a83f-9f5034ea8722", "title": "US Navy faces its most intense combat since World War II against Yemen Houthi rebels", "date": "2024-06-14 13:00", "url": "https://www.stltoday.com/news/nation-world/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemen-s-houthi/article_2baad968-2a40-11ef-95ab-eb3ede52a9e8.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "6904f770-2de3-4c19-8265-d4d9d59693e8", "title": "U . S . Navy faces most intense combat since WWII against Yemen Iran - backed Houthi rebels – The Virginian - Pilot", "date": "2024-06-14 13:00", "url": "https://www.pilotonline.com/2024/06/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "pilotonline.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThe Navy saw periods of combat during the “Tanker Wars” of the 1980s in the Persian Gulf, but that largely involved ships hitting mines.\nThe White House hasn’t discussed the Houthi campaign at the same level as negotiations over the Israel-Hamas war."}, {"id": "2511cf34-1ff6-4a0b-8bd9-b182370c565c", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "eac62429-2577-4b37-b80f-2b2ffeb7d924", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "e36d9bf5-7389-403b-b7c0-0ac9fa9df805", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:45", "url": "https://www.hawkesburygazette.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "47c20fd7-fe87-4a50-9973-7ff380ea2799", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 01:00", "url": "https://www.batemansbaypost.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "07b57f24-a07e-47ca-a6c0-76a61cf7dc0f", "title": "UN Smears Israel With Jihad Propaganda on Shavuot", "date": "2024-06-14 11:30", "url": "https://pjmedia.com/catherinesalgado/2024/06/13/un-smears-israel-with-jihad-propaganda-on-shavuot-n4929878", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "With its usual impeccable timing, the terrorist-tied UN released its latest report using jihadi propaganda to accuse Israel during the Jewish feast of Shavuot.\nThe UN announced its latest report insanely trying to draw a moral equivalence between Hamas and Israel.\nAlmost three-fourths of Palestinians still support Hamas and its Oct. 7 actions, and a Hamas leader vowed to repeat its atrocities “again and again” until Israel is obliterated.\nAt these UNRWA schools, Palestinian children are indoctrinated to be terrorists and to see the genocide of Jews as a glorious thing.\nIsrael rejects the abhorrent and immoral accusations leveled against the [Israel Defense Forces],” the post added."}, {"id": "6fae22bf-beb4-4929-a42a-bdd616b35ce0", "title": "U . S . Navy faces most intense combat since WWII against Yemen Iran - backed Houthi rebels – Daily Press", "date": "2024-06-14 14:15", "url": "https://www.dailypress.com/2024/06/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "dailypress.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThe Navy saw periods of combat during the “Tanker Wars” of the 1980s in the Persian Gulf, but that largely involved ships hitting mines.\nThe White House hasn’t discussed the Houthi campaign at the same level as negotiations over the Israel-Hamas war."}, {"id": "c38a3346-7128-4f12-ac85-2be37dff14ef", "title": "Lebanon Hezbollah reveals more of its arms in risky escalation with Israel", "date": "2024-06-14 05:15", "url": "https://www.scmp.com/news/world/middle-east/article/3266577/lebanons-hezbollah-reveals-more-its-arms-risky-escalation-israel", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Hezbollah rockets have set off wildfires in northern Israel.\nHezbollah began trading fire with Israel on October 8, a day after its Palestinian ally Hamas attacked southern Israel, sparking the Gaza war.\nHezbollah says it will cease fire only when the Gaza war stops.\nPhoto: ReutersPrior to this conflict, Israel and Hezbollah had avoided a major clash since a month-long war in 2006, deterred since then by mutual threats of catastrophic destruction.\nThe aftermath of an Israeli air strike in the southern Lebanese town of Wadi Jilo."}, {"id": "53041940-6d45-498b-9430-43fd1496409b", "title": "US Navy faces its most intense combat since World War II against Houthis", "date": "2024-06-14 12:45", "url": "https://www.naharnet.com/stories/en/305931-us-navy-faces-its-most-intense-combat-since-world-war-ii-against-houthis", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\n\"This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nA stalemated warOfficers acknowledge some grumbling among their crew, wondering why the Navy doesn't strike harder against the Houthis.\nMeanwhile, the Houthi attacks continue to depress shipping through the region."}, {"id": "6786217c-5c22-4e96-8a76-8ee7566e60b3", "title": "Officials ban some fireworks in unincorporated portions of Santa Fe County", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/officials-ban-fireworks-unincorporated-portions-220128554.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SANTA FE, N.M. (KRQE) – The Board of County Commissioners has banned the sale and use of certain types of fireworks within unincorporated portions of Santa Fe County for at least the next 30 days.\nThe resolution does not ban all types of fireworks.\nOn wildlands within Santa Fe County, all fireworks are banned, the resolution notes.\nThe county says the following types of fireworks are NOT banned by the resolution.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "0f3e409a-a962-462c-8202-e98316aa0dd7", "title": "Huthi missile attack severely injures sailor on cargo ship US military", "date": "2024-06-14 07:30", "url": "https://www.philstar.com/world/2024/06/14/2362846/huthi-missile-attack-severely-injures-sailor-cargo-ship-us-military", "domain": "philstar.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates — Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "c8a099cc-8da1-4583-935f-989d67124d2c", "title": "IRA bombing survivor receives honorary fellowship for work with terror victims | united kingdom | News", "date": "2024-06-14 12:45", "url": "https://www.express.co.uk/news/uk/1911220/ira-bombing-survivor-receives-honorary-fellowship-terrorism-victim-advocacy", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Head of the Docklands victims campaign group Jonathan Ganesh was awarded an honorary fellowship by the University of Sunderland (Dominic Lipinski/PA)Jonathan Ganesh, a survivor of the 1996 IRA Docklands bombing, has been honoured with an honorary fellowship by the University of Sunderland.\nThe bomb attack left Mr Ganesh seriously injured, claiming two lives and wounding another 42.\nFollowing the attack, he became a powerful voice for terrorism victims, heading up the Docklands Victims Association and training as a psychotherapist.\nThe prestigious award was presented to him by University Chancellor Leanne Cahill.\nHe added that although he's accepting it, the honour is on behalf of all those they've helped and everyone contributing to the charity's work and accomplishments."}, {"id": "d31d05bb-89eb-4ff2-9438-df237632aa17", "title": "Ukrainian military says it downed seven of 14 missiles , all drones in Russian attack", "date": "2024-06-14 12:30", "url": "https://www.theglobeandmail.com/world/article-ukrainian-military-says-it-downed-seven-of-14-missiles-all-drones-in/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The Ukrainian military said on Friday its forces downed seven of 14 missiles and all 17 drones launched by Russia in overnight attacks in the west of the country.\nRussian forces targeted critical infrastructure and military objects during the raid, air force spokesperson Illia Yevlash said on national television.\nThe Ukrainian military destroyed 11 aerial targets over the western region of Khmelnytskyi, according to the governor.\nAir defence shot down seven of 10 Kh-101/Kh-555 cruise missiles, the Ukrainian military said.\nRussia also launched three Iskander-M ballistic missiles, targeting Zaporizhzhia region, and one Kinzhal air-launched ballistic missile in its attack, according to Yevlash."}, {"id": "c5cd031f-639f-4d05-bae5-592d0a34b2d3", "title": "Hezbollah Fires Largest Drone Volley , Over 100 Rockets On 9 IDF Bases , Israeli Jets Bomb Lebanon", "date": "2024-06-14 10:00", "url": "https://article.wn.com/view/2024/06/14/Hezbollah_Fires_Largest_Drone_Volley_Over_100_Rockets_On_9_I/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The Iran-backed Hezbollah said it had launched rockets and weaponised drones at over 10 Israeli military sites in a coordinated attack on June 13, PressTV reported.\nThe Lebanese group said it fired around 30... read full story"}, {"id": "4ea30a2e-2be0-49c8-91f1-9af8da41132f", "title": "Why Israel - Hezbollah tensions risk boiling over now", "date": "2024-06-14 13:45", "url": "https://www.yahoo.com/news/why-israel-hezbollah-tensions-risk-120936159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Since then, the two sides have traded fire sporadically, but tensions boiled over in 2006 when Israel went to war in southern Lebanon again after Hezbollah kidnapped two Israeli soldiers.\nMore than 1,000 Lebanese were killed in that conflict, mostly civilians, as well as 49 Israeli civilians and 121 soldiers.\nThe military capability of the Lebanese group has grown since 2006, when it relied largely on inaccurate Soviet-era Katyusha rockets.\nHezbollah has fired 35 kilometers into Israel, while Israel has targeted areas of Lebanon more than 120 kilometers north.\nMore houses were evacuated this week in the Galilee region in northern Israel after a fire broke following rocket attacks from Lebanon, Israeli police said."}, {"id": "7a784451-9613-4b06-834a-36062aeb5cc7", "title": "Two Men Arrested in Connection with Fatal Stabbing in Costa Mesa", "date": "2024-06-14 06:15", "url": "https://mynewsla.com/crime/2024/06/13/two-men-arrested-in-connection-with-fatal-stabbing-in-costa-mesa/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men from Costa Mesa suspected in a fatal stabbing in the city that police said they believed was gang-related were behind bars Thursday.\nIsrael Antonio Valencia, 25, and Christopher Mathew Pena, 18, were arrested Wednesday, according to Roxi Fyad of the Costa Mesa Police Department.\nThey are accused in the killing of a 22-year-old man, Fyad said.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive."}, {"id": "b49d2cf1-150d-4c52-ae85-de5556e1bf29", "title": "Huthi missile attack injures sailor - Manila Standard", "date": "2024-06-14 12:30", "url": "https://manilastandard.net/news/314459508/huthi-missile-attack-injures-sailor.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -DUBAI – Two cruise missiles launched by Yemen’s Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena — a Palauan-flagged, Ukrainian-owned, Polish-operated ship — “reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,” the US Central Command said in a statement.\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March.\nCENTCOM said at the time that the Tutor had been hit by a Huthi “unmanned surface vessel” that “caused severe flooding and damage to the engine room”."}, {"id": "f5aa537c-11cb-4789-b96b-2375759a35b1", "title": "US Submarine Makes Routine Stop in Cuba As Russia Holds Drills", "date": "2024-06-14 13:30", "url": "https://www.theepochtimes.com/world/us-submarine-makes-routine-stop-in-cuba-as-russia-holds-drills-5668596", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "A U.S. military official said that the Russian warships visiting Cuba on military exercises ‘don’t pose a threat to the United States’.\nA nuclear-powered U.S. submarine arrived in Guantanamo Bay, Cuba, as part of what officials said was previously planned visit, a day after a fleet of Russian warships arrived at the island as part of their military drills in the region.\nThe USS Helena, a fast attack submarine, arrived at the naval base for “a routine port visit as it transits the U.S. Southern Command geographic area of responsibility,” the U.S. Southern Command said on X.\nThe U.S. Defense Department has downplayed the Russian warships’ visit to Cuba, and Pentagon spokeswoman Sabrina Singh said it is consistent with “routine naval visits that we’ve seen under different administrations.”“We’ve been tracking the Russians’ plans for this.\nThe Cuban Foreign Ministry has previously said the four Russian ships would not carry nuclear weapons during their visit to the Caribbean from June 12 to June 17."}, {"id": "b20da2ff-4d88-4e4c-adb6-60989b891278", "title": "Houthi missile attack severely injures sailor on cargo ship : U . S . military", "date": "2024-06-14 06:00", "url": "https://www.thehindu.com/news/international/houthi-missile-attack-severely-injures-sailor-on-cargo-ship-us-military/article68288033.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Two cruise missiles launched by Yemen's Houthi rebels struck a bulk cargo carrier in the Gulf of Aden on June 13, severely injuring a sailor who was evacuated by American forces, the U.S. military said.\nOne civilian mariner was severely injured during the attack,\" the U.S. Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nJune 13 U.S. Central Command UpdateIn the past 24 hours, U.S. Central Command (USCENTCOM) forces successfully destroyed one air defense sensor in a Houthi controlled area of Yemen.\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "ce90ab76-81cf-472a-89b1-b72ec03c9f7c", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 05:30", "url": "https://www.bssnews.net/news/195119", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DUBAI, June 14, 2024 (AFP) - Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "b1c3a4e3-e0e6-4c36-a3c7-c5f2e3d423a2", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 10:45", "url": "https://greatbendpost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "greatbendpost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "155506c0-ef8d-4396-ac1f-277e26c62406", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 10:45", "url": "https://salinapost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "salinapost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "1a25a768-893c-4f2d-9562-6f0060a18f12", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 12:45", "url": "https://jcpost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "fda2d2e4-63d1-421f-938e-e177db796ccc", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 14:30", "url": "https://hayspost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "hayspost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "af5269e4-1a8e-4441-9d7f-589919175c45", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 03:15", "url": "http://usa.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "366bc0b6-a733-474f-b4fc-ff19a9278e6b", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 02:00", "url": "http://europe.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "6a80b541-1a41-44c1-b9e3-87abb6e8a6ec", "title": "Russian attack sub discovered just 200 miles from US East Coast is given safe harbor during Hurricane Sandy", "date": "2024-06-14 05:00", "url": "https://engineeringevil.com/2012/11/06/russian-attack-sub-discovered-just-200-miles-from-us-east-coast-is-given-safe-harbor-during-hurricane-sandy/", "domain": "engineeringevil.com", "domain_classification": "Unknown", "message": "Officials said the submarine was probably conducting anti-submarine warfare efforts against U.S. ballistic and cruise missile submarines at Kings Bay, Georgia.\nThe submarine did not sail near Kings Bay or threaten a U.S. aircraft carrier group conducting exercises near it in the eastern Atlantic.\nThere are two guided missile submarines and six nuclear missile submarines docked at Kings Bay Naval Submarine Base.\nThose American vessels are a known target of Russian attack subs.\nFlexing their muscle: Officials say Russian sub patrols have increased in recent yearsHowever, the Russian sub was considered safe enough that it was given a safe harbor in Jacksonville, Florida’s commercial port during Hurricane Sandy, within listening range of Kings Bay."}, {"id": "a047093b-e951-43a6-9daf-5292f3de573f", "title": "الوكالة الوطنية للإعلام - Islamic Resistance launches rocket attack in response to Israeli strikes", "date": "2024-06-14 11:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/701605/islamic-resistance-launches-rocket-attack-in-respo", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - In a statement issued on Friday, the Islamic Resistance in Lebanon announced, \"In support of our steadfast Palestinian people in the Gaza Strip and to back their courageous and honorable resistance, and in response to the Israeli assaults on the resilient southern villages and the safe homes, including the recent attack on the town of Janata which resulted in the martyrdom and injury of civilians, the fighters of the Islamic Resistance launched dozens of Katyusha and Falaq rockets on Friday, June 14, 2024, targeting the settlements of Kiryat Shmona and Kfar Szold.\"\n===============R.H."}, {"id": "1ace34e7-4722-44fe-aa49-65030bdb415d", "title": "الوكالة الوطنية للإعلام - Islamic Resistance launches rocket attack in response to Israeli strikes", "date": "2024-06-14 11:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/701608/islamic-resistance-launches-rocket-attack-in-respo", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - In a statement issued on Friday, the Islamic Resistance in Lebanon announced, \"In support of our steadfast Palestinian people in the Gaza Strip and to back their courageous and honorable resistance, and in response to the Israeli assaults on the resilient southern villages and the safe homes, including the recent attack on the town of Janata which resulted in the martyrdom and injury of civilians, the fighters of the Islamic Resistance launched dozens of Katyusha and Falaq rockets on Friday, June 14, 2024, targeting the settlements of Kiryat Shmona and Kfar Szold.\"\n===============R.H."}, {"id": "4ca439e2-67b9-4078-88a8-e077922fad31", "title": "Man accused of planning mass shooting to start  race war  arrested in New Mexico", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/man-accused-planning-mass-shooting-220550403.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NEW MEXICO (KRQE) – An Arizona man who is accused of planning a mass shooting in an attempt to start a “race war” was arrested in New Mexico, according to federal authorities.\nCourt documents noted that Prieto reportedly planned to carry out the attack along with the two undercover government individuals.\nPrieto was arrested by law enforcement on May 14 while he was driving east from Arizona through New Mexico along Interstate 40, the U.S. Attorney’s Office in Arizona said.\nOfficials did not specify what law enforcement agency arrested Prieto, but said law enforcement found Prieto was in possession of seven guns, ammo, and was taken into federal custody.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "12254227-c227-4c24-92ff-b7b078071223", "title": "Yemen Houthi rebels launch 2 cruise missles and hit ship in Gulf of Aden , sparking blaze , US says", "date": "2024-06-14 00:45", "url": "https://www.ivpressonline.com/news/world/yemens-houthi-rebels-launch-2-cruise-missles-and-hit-ship-in-gulf-of-aden-sparking/article_de3fa657-9317-59d3-b5e8-2de2ac045abd.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "0cbbd8d8-9ed2-48fe-87ae-17426d07ba5b", "title": "Tensions flare on Israeli - Lebanese border after senior Hezbollah commander death – Ya Libnan", "date": "2024-06-14 14:30", "url": "https://yalibnan.com/2024/06/14/tensions-flare-on-israeli-lebanese-border-after-senior-hezbollah-commanders-death/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Lebanon’s Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group’s October 7 attack on southern Israel.\n© Jalaa Marey, AFPTensions flared on the Israeli-Lebanese border Friday amid intensified fighting between Hezhollah and Israel after the Iran-backed militant group vowed to avenge the death of a senior commander.\nTensions are flaring by the Israel-Lebanese border after the Iran-backed militant group Hezbollah vowed to avenge the death of a senior commander.\nTensions are flaring by the Israel-Lebanese border after the Iran-backed militant group Hezbollah vowed to avenge the death of a senior commander.\nTaleb el Abdullah, the senior Hezbollah commandeer who was killed by Israeli strike"}, {"id": "eaaa631d-7203-4858-9e9d-1cfa8c4f9890", "title": "  Our souls are still there : Palestinians evacuated from Gaza to Qatar long for home - Doha News", "date": "2024-06-14 13:15", "url": "https://dohanews.co/our-souls-are-still-there-palestinians-evacuated-from-gaza-to-qatar-long-for-home/", "domain": "dohanews.co", "domain_classification": "Unknown", "message": "Source: Doha NewsLed by Amir Sheikh Tamim bin Hamad Al-Thani, the initiative aims to sponsor 3,000 orphans and provide medical care for 1,500 injured Palestinians from Gaza.\nSource: Doha NewsThe child, who is severely traumatised and can barely talk, has been receiving treatment at Sidra Medicine.\nWafaa Abu Samaan, 27, holds an image of her state during the final days of her pregnancy.\nSource: Doha NewsAbu Samaan was forced to flee the northern Gaza Strip in a wheelchair, pushed by her brother.\nWe kill you because you keep having children’,” Abu Samaan recalled."}, {"id": "2aafd954-b128-4ef2-b343-46257e09982f", "title": "Man Indicted For Planning Shooting At Bad Bunny Concert", "date": "2024-06-14 05:30", "url": "https://uproxx.com/music/man-indicted-allegedly-planning-shooting-bad-bunny-concert/", "domain": "uproxx.com", "domain_classification": "Unknown", "message": "An Arizona man has been indicted in Atlanta after planning to carry out a mass shooting a Bad Bunny concert, according to a report from NBC.\nMark Adams Prieto was indicted earlier this week after his arrest last month for the alleged plot.\nPrieto was reportedly charged with Possession of an Unregistered Firearm, Firearms Trafficking, and Transfer of a Firearm for Use in a Hate Crime.\nPrieto evidently planned the attack for after Super Tuesday, after the presidential candidates were set, the source revealed.\nLaw enforcement has since executed a search warrant at Prieto’s home and recovered more firearms, including an unregistered short-barreled rifle."}, {"id": "8121de3c-b8b8-492b-8a3c-59f5343997aa", "title": "Russian warships reach Cuba ahead of military exercises", "date": "2024-06-14 00:00", "url": "https://www.dailymail.co.uk/news/article-13528593/Russian-warships-reach-Cuba-ahead-military-exercises-just-two-weeks-Biden-approved-Ukraine-using-weapons-inside-Russia-ominous-echo-Cold-War.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Russian warships reached Cuba this week ahead of planned military exercises in echos of the cold-war missile crisis.\nThe fleet, made up of a frigate, a nuclear-powered submarine, an oil tanker and a rescue tug, crossed into Havana Bay after drills in the Atlantic Ocean.\nUS officials expect the ships to remain in the region through the summer and possibly also stop in Venezuela.\nRussia is a longtime ally of Venezuela and Cuba, and its warships and aircraft have periodically made forays into the Caribbean.\nAlthough the fleet includes a nuclear-powered submarine, a senior US administration official said that the intelligence community has determined no vessel is carrying nuclear weapons."}, {"id": "a974410a-de45-4d57-9241-64c37c62c10c", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:00", "url": "https://kdhnews.com/news/world/a-missile-strike-from-yemens-houthi-rebels-sets-a-cargo-ship-on-fire-in-gulf/article_0397a67f-e472-5b70-85b9-989a5e9bbdbe.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "It would free up time for the mayor, City Council, city manager and city staff.\nIt would give council members more time to study an issue before it is discussed.\nCouncil meetings are already too long.\nCutting the number of meetings means reducing residents’ input.\nThe proposal has some merit, but it could require marathon council sessions."}, {"id": "ba0700bb-9227-4996-8afe-8978b750b10b", "title": "Woman survives knife attack after man goes on stabbing spree in Charlotte", "date": "2024-06-14 13:15", "url": "https://www.witn.com/2024/06/14/woman-survives-knife-attack-after-man-goes-stabbing-spree-charlotte/", "domain": "witn.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - A horrific series of knife attacks in Charlotte over a 24-hour period sent three people to the hospital, and the suspect behind bars.\nOn her way to the vehicle, she spotted a man sitting at a bus stop bench and gave it little thought.\n“That’s when the knife injured my hand.”The suspect started stabbing her wildly, and without cause or reason.\nBefore police could arrest Maitland, the suspect in the woman’s case, he allegedly committed two more stabbing attacks.\n“I’m just thankful because it could have been a lot worse.”Related: CMPD: Man arrested after stabbing 60-year-old woman, 2 others across Charlotte areaWatch continuous news coverage here:Copyright 2024 WBTV."}, {"id": "914f47af-dac5-4ae5-bc8a-87457f87cb5f", "title": "Two women killed in Israeli strike on Janata", "date": "2024-06-14 07:45", "url": "https://www.naharnet.com:443/stories/en/305909-two-women-killed-in-israeli-strike-on-janata", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two civilians were killed and at least seven others injured in an Israeli nighttime strike on southern Lebanon, the country's national news agency reported on Friday.\nEnemy warplanes launched a raid targeting a three-story house in the town of Janata in the Tyre district, killing a woman, Sally Skaiki, and injuring seven other civilians, the agency said.\nSally Skaiki was a medical auxiliary in the Amal-affiliated al-Risala scout association.\nAnother woman, Dalal Ezzeddine later died of her wounds, local media said.\nThe escalation comes as some Israeli leaders have threatened all-out war to silence Hezbollah’s rocket fire, and as the militant group seeks to pressure Israel during the cease-fire negotiations in support of its ally Hamas."}, {"id": "93cf8c17-81c7-4121-beac-1e48da7a54cf", "title": "Two women killed in Israeli strike on Janata", "date": "2024-06-14 12:30", "url": "https://www.naharnet.com/stories/en/305909-two-women-killed-in-israeli-strike-on-janata", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two civilians were killed and at least seven others injured in an Israeli nighttime strike on southern Lebanon, the country's national news agency reported on Friday.\nEnemy warplanes launched a raid targeting a three-story house in the town of Janata in the Tyre district, killing a woman, Sally Skaiki, and injuring seven other civilians, the agency said.\nSally Skaiki was a medical auxiliary in the Amal-affiliated al-Risala scout association.\nAnother woman, Dalal Ezzeddine later died of her wounds, local media said.\nThe escalation comes as some Israeli leaders have threatened all-out war to silence Hezbollah’s rocket fire, and as the militant group seeks to pressure Israel during the cease-fire negotiations in support of its ally Hamas."}, {"id": "31bc7776-81c4-4bb9-8b45-26a7ab63213b", "title": "Media avoid word  Christian  in Nashville shooting headlines", "date": "2024-06-14 14:30", "url": "https://www.christianpost.com/news/media-avoid-word-christian-in-nashville-school-shooting-headlines.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home News After warning of religious ‘attacks' on trans people, media avoid 'Christian' or 'transgender' in Nashville shooting headlinesDespite the loss of six lives at a Christian elementary school, not one of the nation’s biggest newspapers used the words “Christian” in their headlines for the mass shooting in Nashville earlier this week.\nThe shooter, later identified as Audrey Hale, 28, of Nashville, was a former student at the school and self-identified as trans, according to Metropolitan Nashville Police Chief John Drake.\nGet Our Latest News for FREE Subscribe to get daily/weekly email with the top stories (plus special offers!)\nJesus Christ is the only answer for them, and the Christian who knows that will never be their enemy.”The media response to the attack comes as federal government officials have yet to declare the Covenant School shooting as a hate crime.\nWhen asked by a reporter Tuesday whether he believed Christians were targeted in the Nashville shooting, President Joe Biden smiled and said, “I have no idea.”EWTN’s @owentjensen asked President Biden about whether Christians were targeted in the Nashville mass shooting, tonight on the South Lawn, upon his return from North Carolina."}, {"id": "92fce46c-afa8-4b3b-abda-43eddb076a13", "title": "Woman survives knife attack after man goes on stabbing spree in Charlotte", "date": "2024-06-14 13:00", "url": "https://www.wbtv.com/2024/06/14/woman-survives-knife-attack-after-man-goes-stabbing-spree-charlotte/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - A horrific series of knife attacks in Charlotte over a 24-hour period sent three people to the hospital, and the suspect behind bars.\nOn her way to the vehicle, she spotted a man sitting at a bus stop bench and gave it little thought.\n“That’s when the knife injured my hand.”The suspect started stabbing her wildly, and without cause or reason.\nBefore police could arrest Maitland, the suspect in the woman’s case, he allegedly committed two more stabbing attacks.\n“I’m just thankful because it could have been a lot worse.”Related: CMPD: Man arrested after stabbing 60-year-old woman, 2 others across Charlotte areaWatch continuous news coverage here:Copyright 2024 WBTV."}, {"id": "23cc883c-bb4d-4688-af5d-4c1cc5f99682", "title": "Russia , Ukraine exchange drone , missile attacks", "date": "2024-06-14 08:45", "url": "https://punchng.com/russia-ukraine-exchange-drone-missile-attacks/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Kyiv and Moscow staged dozens of drone and missile attacks overnight, officials said Friday, leaving several wounded in Ukraine and damaging a fuel reservoir site in a Russian border region.\nRussia said it had downed 87 Ukrainian drones, of which 70 had targeted the southern Rostov region that houses the headquarters of its military operation against Kyiv.\nThe attacks sparked power cuts in several areas of the Rostov region, its governor Vasily Golubev said on social media.\nIn Voronezh, which borders Ukraine, a fuel reservoir was slightly damaged by falling debris, its regional governor Aleksander Gusev said.\nKyiv meanwhile said Ukrainian air defence systems had downed 24 out of 31 Russian drones and missiles fired overnight."}, {"id": "1d5b17d1-c8ae-4120-80cc-6a236c855834", "title": "US attack sub , Canada navy patrol ship arrive in Cuba on heels of Russian warships", "date": "2024-06-14 14:00", "url": "https://www.yahoo.com/news/us-attack-sub-canada-navy-132901979.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US attack sub, Canada navy patrol ship arrive in Cuba on heels of Russian warshipsHAVANA (Reuters) - A Canadian navy patrol ship sailed into Havana early on Friday, just hours after the United States announced a fast-attack submarine had docked at its Guantanamo naval base on Cuba, both vessels on the heels of Russian warships that arrived on the island earlier this week.\nHowever, both the U.S. and Cuba have said the Russian warships pose no threat to the region.\nRussia has also characterized the arrival of its warships in allied Cuba as routine.\nMoscow, which has maintained ties with Havana, has questioned the apparent nervousness of the West over the warships this week.\nThe Russian warships are expected to remain in Havana harbor until June 17."}, {"id": "a24893e7-1c3d-46e0-be55-d4e0f5caaed9", "title": "U . S . attack sub , Canadian navy patrol ship arrive in Cuba on heels of Russian warships", "date": "2024-06-14 14:15", "url": "https://www.theglobeandmail.com/world/article-us-attack-sub-canadian-navy-patrol-ship-arrive-in-cuba-on-heels-of/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Canadian navy patrol boat HMCS Margaret Brooke enters the Havana’s bay, Cuba, on June 14.Alexandre Meneghini/ReutersA Canadian navy patrol ship sailed into Havana early on Friday, just hours after the United States announced a fast-attack submarine had docked at its Guantanamo naval base on Cuba, both vessels on the heels of Russian warships that arrived on the island earlier this week.\nHowever, both the U.S. and Cuba have said the Russian warships pose no threat to the region.\nRussia has also characterized the arrival of its warships in allied Cuba as routine.\nMoscow, which has maintained ties with Havana, has questioned the apparent nervousness of the West over the warships this week.\n“Why do only signals related only to our army and navy reach the West?”The Russian warships are expected to remain in Havana harbor until June 17."}, {"id": "af6c3647-02b1-41f0-b32e-836358b935b3", "title": "Bad Bunny Concert Targeted for Would - Be Race War Mass Shooting , Feds Say", "date": "2024-06-14 14:30", "url": "https://www.tmz.com/2024/06/14/bad-bunny-concert-targeted-race-war-mass-shooting-federal-indictment/", "domain": "tmz.com", "domain_classification": "Unknown", "message": "An Arizona man allegedly tried to spark a race war ahead of the 2024 election by carrying out a mass shooting at a Bad Bunny concert ... so claim the feds, who stopped it.\nThe feds claim Prieto recruited the informant and FBI agent to help him launch his attack, thinking they were in lockstep with his racist views on Blacks, Jews and Muslims.\nThe feds specified in the court docs that Prieto wanted to trigger a \"race war prior to the 2024 United States Presidential Election.\"\nPrieto is alleged to have said he picked the Bad Bunny concert because of the high concentration of Black people that'd be in attendance.\nThe feds say they finally took down Prieto on May 14 -- the day of the Bad Bunny show at State Farm Arena – by pulling over the suspect as he drove through New Mexico."}, {"id": "5b616f8e-90b5-4e15-a561-1382e95cccfe", "title": "DRDO to Showcases Indigenous Defense Might at Eurosatory 2024 – Indian Defence Research Wing", "date": "2024-06-14 13:15", "url": "https://idrw.org/drdo-to-showcases-indigenous-defense-might-at-eurosatory-2024/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "DRDO to Showcases Indigenous Defense Might at Eurosatory 2024| BySOURCE: AFIIndia’s premier defense research agency, the Defence Research and Development Organisation (DRDO), is making a strong impression at the ongoing Eurosatory 2024, a leading global defense and security exhibition held in Paris, France.\nDRDO’s presence at Eurosatory is centered around its cutting-edge weapon systems and platforms designed to address contemporary battlefield requirements.\nLCA Mk1A Tejas: The latest iteration of India’s indigenously developed Light Combat Aircraft boasts significant advancements over its predecessor.\nArjun MBT Mk-1A: This indigenously developed Main Battle Tank strengthens India’s self-reliance in armored fighting vehicles.\nThis ship-launched, heavy-weight, electrically propelled anti-submarine torpedo is designed to effectively target quiet submarines in various water depths."}, {"id": "005ef7af-b4c7-4308-af89-802ee875c26f", "title": "Police chief finds tools to combat PTSD in veterans , officers during trip to Israel", "date": "2024-06-14 00:00", "url": "https://wlos.com/news/local/waynesville-police-chief-israel-trip-combatting-ptsd-veterans-officers-tools", "domain": "wlos.com", "domain_classification": "Unknown", "message": "It’s not connected to the ongoing war with Hamas, but rather to gain knowledge to benefit both military veterans and even police officers here.\nHe recently wrapped up a 10-day trip as a coach for Heroes to Heroes, which helps combat veterans heal from the traumas of war and often the moral injuries they carry with them.\nAdams says that spirituality can help veterans combat suicidal thoughts and reintegrate into communities with support and planning“A lot of them struggle ...I think they're averaging now still around 22 a day take their lives.\nThe mission of Heroes to Heroes has extended from veterans to law enforcement officers who put their lives on the line too.\nAdams is carrying back from Israel tools his officers can use including listening to unique stories, mental health awareness and physical fitness."}, {"id": "a8054bc1-8356-40b3-a709-a6373395d264", "title": "Politico : Lukashenka Secretly Supplies Weapons To Azerbaijan In Conflict With Armenia", "date": "2024-06-14 12:30", "url": "https://charter97.org/en/news/2024/6/14/598893/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Politico: Lukashenka Secretly Supplies Weapons To Azerbaijan In Conflict With Armenia 19 14.06.2024, 8:3614,440The newspaper has obtained documented evidence.\nBelarus was supplying modern weapons to Azerbaijan in its conflict with Armenia, despite the fact that both countries - Armenia and Belarus - are members of the CSTO and are formally allies.\nPolitico has obtained documents confirming the facts of arms deliveries.\nSecret documents obtained by Politico prove that Belarus was actively assisting Azerbaijan's armed forces between 2018 and 2022, when tensions with Armenia were at their peak.\nThe offered services included \"modernisation of outdated artillery equipment and supply of new equipment used for electronic warfare and drone systems\"."}, {"id": "dada9ab3-73b4-4e8e-9f73-8f37a8cfc758", "title": "The Israeli hostage rescue and Christian just war theory", "date": "2024-06-14 09:45", "url": "https://www.christiantoday.com/article/the.israeli.hostage.rescue.and.christian.just.war.theory/141828.htm", "domain": "christiantoday.com", "domain_classification": "Unknown", "message": "Those who have welcomed the raid have done so because it resulted in the release of the four Israeli hostages.\nIt was an act by the Israeli military duly authorised by the Israeli government.\nBlaming the Israelis is like blaming the Allied forces rather than the Germans for the 35,000 civilian casualties in the Normandy landings in 1944.\nThere would have been zero civilian casualties if the Germans had not started the war in the first place.\nSimilarly, there would have been zero civilian casualties in Nuseirat had Hamas not attacked Israel on 7 October."}, {"id": "833334c5-5157-46a0-a4ba-965270880a3b", "title": "Major events in the Russian invasion of Ukraine", "date": "2024-06-14 05:30", "url": "https://uk.news.yahoo.com/major-events-russian-invasion-ukraine-050627865.html", "domain": "uk.news.yahoo.com", "domain_classification": "Unknown", "message": "(Reuters) - Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nMay 20, 2022: Russian forces capture Mariupol in southeastern Ukraine after a three-month siege, during which Kyiv estimates more than 20,000 civilians were killed.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "640c9b8a-2159-49d6-aea7-7c61dde04963", "title": "Major events in the Russian invasion of Ukraine", "date": "2024-06-14 05:45", "url": "https://www.moneycontrol.com/news/world/major-events-in-the-russian-invasion-of-ukraine-12748501.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "1b2d22ce-6900-4f42-9831-b0802c6d97a2", "title": "The Third World War 1989 mod for Civilization III : Conquests", "date": "2024-06-14 04:45", "url": "https://www.moddb.com/mods/the-third-world-war-1989", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Nearly ten years after its original release, The Third World War 1989 scenario for Civilization III has been re-uploaded and is at your fingertips.\nThe game is now capable of running with the CXE patch, which allows new modding options never before available to Civ 3.\nPrimarily, this means that the number of starting units has been severely cut down, with emphasis on reducing battalion-sized forces and reserves.\nOverhauled combat - While the map may look the same, every aspect of land, sea, and air warfare has been updated.\nThe game is still capable of being run normally without CXE, but a large number of changes are now available."}, {"id": "0362d087-470f-4b80-b9f6-ff2ce1ec0f1a", "title": "Marine training shifts may ad tech , change officer assignments", "date": "2024-06-14 00:00", "url": "https://www.marinecorpstimes.com/news/your-marine-corps/2024/06/13/marine-training-shifts-may-ad-tech-change-officer-assignments/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "“These initiatives collectively aim to equip the Marine Corps with the most modern, lethal, and capable Marines conceivable,” Iiams said.\nThe communication training battalion at Training Command is assessing how to combine critical skillsets from three communications job fields, 062X, 063X and 067X.\nAlso in the tech vein, the service will have deployed live, virtual, constructed training simulators to Marine Corps Air Ground Combat Center, Twentynine Palms, California, Camp Pendleton, California and Marine Corps Bases Hawaii and Okinawa, Japan, before October.\nAt the same time, each Marine expeditionary force and the Marine air-ground task force training command will receive one battalion-capable Marine Corps Tactical Instrumentation System by summer.\nThe training command is preparing to field electromagnetic spectrum simulators at Twentynine Palms, California, that can replicate adversary electronic warfare capabilities in training."}, {"id": "6c15f1a0-17f7-42bd-995b-d9441bc9484c", "title": "Europe Bloodiest Conflict : Ukraine Struggle Against Russia", "date": "2024-06-14 06:00", "url": "https://www.devdiscourse.com/article/law-order/2982442-europes-bloodiest-conflict-ukraines-struggle-against-russia", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nFeb-April, 2022: Advancing Russian forces are halted at the outskirts of Kyiv after meeting stiffer-than-expected resistance.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "4d1fd653-6ca4-4baa-b1a0-d30c6542cedb", "title": "We must support IDF soldiers , bot mentally and physically", "date": "2024-06-14 07:00", "url": "https://www.jpost.com/opinion/article-806160", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The tragic story of Eliran Mizrahi has haunted the country for the last week.\nHowever, inexplicably, he received a Tzav 8 (emergency call-up order) from the IDF last week to return to Gaza two days later.\nInstead, at the beginning of the week, Mizrahi took his own life.\nThe decision was made after consultations with Defense Minister Yoav Gallant and IDF Chief of Staff Lt.-Col. Herzi Halevi.\nMay the lesson from his tragic story resonate with the IDF and those who send our sons and daughters to war."}, {"id": "9c6aa99e-4d1a-4564-b8a4-02d9dd77b3f2", "title": "The American public must rethink its relationship with the military", "date": "2024-06-14 00:00", "url": "https://www.michigandaily.com/opinion/columns/the-american-public-must-rethink-its-relationship-with-the-military/", "domain": "michigandaily.com", "domain_classification": "Unknown", "message": "The military budget is one aspect that needs this closer look.\nRegardless of who the American public feels may be the aggressor, prioritizing a diplomatic when possible approach avoids breeding contempt in foreign areas.\nMoreover, lowering our military budget doesn’t necessarily mean creating a power vacuum that a new country would fill.\nReworking our relationship with military contractors will allow us to reduce our spending without affecting our military capabilities.\nMoreover, reducing our defense spending and avoiding unwinnable wars not only preserves American lives, but also spares countless lives abroad."}, {"id": "b23977da-0941-4677-b30f-032e7e766a68", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 13:30", "url": "https://www.telegraphherald.com/ap/international/article_641d1e11-eceb-5b13-bead-0a964b553eb6.html", "domain": "telegraphherald.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "acb4f392-c1e1-4dfc-b72b-8abf9fe5dd35", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 13:30", "url": "https://www.wdio.com/front-page/world-national/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer USS Laboon during a deployment in the Red Sea on Wednesday, June 12, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II."}, {"id": "0cf60b98-a8bc-4a85-bdfc-01b0f5576c1c", "title": "Erased : WWII Heroes of Colour - National Geographic Channel HD", "date": "2024-06-14 12:30", "url": "https://www.tvguide.co.uk/schedule/5e6f3fa9-af55-5975-8418-0cab4b1003f2/erased-wwii-heroes-of-colour", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Erased: WWII Heroes of ColourNational Geographic Channel HD 6:00 PM to 7:00 PM Friday 14 June Share Add toCalendar +Battle of the Bulge Season 1 Episode 4 of 4 S Subtitles Audio DescriptionThe untold story of the Black Panthers, an elite African American tank battalion, who fought in the bloodiest American battle of the Second World WarErased: WWII Heroes of Colour airs on National Geographic Channel HD at 6:00 PM, Friday 14 June .\n(Subtitles, audio description.)\nLearn more about Erased: WWII Heroes of Colour and other education/science/factual topics on our factual page"}, {"id": "ba40849b-d814-4ef2-9ee1-dd2cf4f1ee6f", "title": "G7 leaders tackle the issue of migration on the second day of summit in Italy", "date": "2024-06-14 09:30", "url": "https://www.irishexaminer.com/world/arid-41416108.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Leaders of the G7 are turning their attention to migration on the second day of their summit on Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.\nShe has also spearheaded the “Mattei Plan” for Africa, a continentwide strategy to increase economic opportunities at home and so discourage migration to Europe.\nUS President Joe Biden introduced new policies to curb migration after a bill he tried to get through Congress failed to pass.\nTackling migration “is a common challenge,” European Council president Charles Michel said after arriving at the summit.\nPope Francis will also become the first pontiff to address a G7 summit when he delivers a speech on artificial intelligence on Friday."}, {"id": "e59bd4f4-d8ee-4662-80a4-70ab9745391f", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 14:00", "url": "https://us.cnn.com/2024/06/14/middleeast/israel-catapult-trebuchet-lebanon-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "23b6714d-5814-4e34-aaac-52fd166474c5", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 11:00", "url": "https://edition.cnn.com/2024/06/14/middleeast/israel-catapult-trebuchet-lebanon-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "a005bd01-30ce-42c5-9b11-727b6621c818", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:00", "url": "https://saudigazette.com.sa/article/643588/World/Mena/Israeli-troops-catapult-fireball-into-Lebanon-using-weapon-rarely-used-since-16th-century", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "BEIRUT — Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "722ee7a6-d803-495a-98bf-48d09fe854d5", "title": "Russian warships off the Florida coast | LETTER | Letters", "date": "2024-06-14 05:00", "url": "https://www.reviewjournal.com/opinion/letters/letter-russian-warships-off-the-florida-coast-3068878/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "It’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nIt’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nWe should be worried that ships potentially carrying hypersonic missiles and subs possibly carrying atomic warheads are so close.\nThis is the second time we’ve come close to nuclear war, both times during Democratic presidencies.\nI hope cooler heads prevail, but for the media to downplay this because it’s the candidate of their choice who is putting us in harm’s way is a disgrace."}, {"id": "31a9319a-f57e-4e80-a1f6-c7fded470139", "title": "South Korea fires warning shots as North Korean soldiers briefly cross border", "date": "2024-06-14 10:00", "url": "http://www.myanmarmuslim.net/news/20240614411f599579.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosSouth Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said on Tuesday.\nThose North Korean soldiers carrying construction tools — some of them armed — immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 metres (165 feet) after they likely lost their way.\nThe reports said most North Korean soldiers carried pickaxes and other construction tools.\nSouth Korea said North Korea has installed its own border loudspeakers in response but has not turned them on yet."}, {"id": "415cb5e5-6718-4ea0-b22d-3136133bf87f", "title": "NATO to build three large bases to supply weapons to Ukraine , Orban says", "date": "2024-06-14 09:00", "url": "https://tass.com/world/1803245", "domain": "tass.com", "domain_classification": "Unknown", "message": "The North Atlantic Alliance is planning to establish three large military bases in ally countries in order to coordinate weapons supplies to Ukraine, Hungarian Prime Minister Viktor Orban said.\nAccording to the Hungarian premier, the bloc seeks \"to help Ukraine by establishing the so-called NATO’s Ukraine mission.\"\n\"This means that NATO will coordinate weapons supplies to Ukraine,\" Orban told a morning talk show on Radio Kossuth.\nOrban expressed concern that should these bases be built in Poland, Romania, Slovakia and other Ukrainian neighbors they will \"become military targets.\"\n\"Obviously, colossal pressure is being put on us from the [other] 31 NATO member countries to sway us from the position of peace to the side of war,\" Orban continued."}, {"id": "01339e91-c7de-42d9-92b9-50e83a8ea161", "title": "How to get Civil War on 4K Blu - ray and DVD", "date": "2024-06-14 00:45", "url": "https://www.digitalspy.com/movies/a61101394/civil-war-4k-blu-ray-dvd/", "domain": "digitalspy.com", "domain_classification": "Unknown", "message": "The critically acclaimed film Civil War is coming soon to home video.\nWhile Civil War has already had its digital release on streaming services, the film will be getting its physical release next month.\nYou can opt for the standard Blu-ray release of Civil War, available for pre-order now for for £14.99 or £16.99 on .\nThe film concludes with a haunting and violent climax — one that's unlikely to leave your thoughts for some time after seeing Civil War.\nCivil War is now streaming on all major digital retailers in the UK."}, {"id": "25f5fc63-4b19-497c-b219-54dd61cf9a41", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century - LocalNews8 . com", "date": "2024-06-14 14:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "The trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "76192049-b8a7-49e7-8360-3393b00a3acb", "title": "SYRIA - UN UN : Syrian Kurdish militias conscripted more than 200 child soldiers in 2023", "date": "2024-06-14 10:45", "url": "https://www.asianews.it/news-en/UN:-Syrian-Kurdish-militias-conscripted-more-than-200-child-soldiers-in-2023-60946.html", "domain": "asianews.it", "domain_classification": "Unknown", "message": "This is according to the latest UN report 'Children and Armed Conflict' soon to be published.\nViolations and abuses at an \"alarming\" level throughout the country, violations of child rights.\nDamascus (AsiaNews) - The Syrian Kurdish militias of the People's Protection Units (YPG) forcibly recruited hundreds of child soldiers into their ranks in 2023.\nAs for child soldiers, the ascertained number of those enlisted in the armed ranks in 2023 is 231.\nThe UN chief called for the unconditional and immediate release of all children from recruitment and forced detention, for which Kurdish militias have been largely responsible during the ongoing 13-year Syrian conflict."}, {"id": "713432b0-1ae1-4cc6-a24b-042d6355be91", "title": " [ Recruiting Indian Citizens In Russian Army ] Mother Of Commission Agent Approaches Kerala High Court Seeking Protection From CBI Probe", "date": "2024-06-14 10:30", "url": "https://www.livelaw.in/high-court/kerala-high-court/kerala-high-court-recruiting-indian-citizens-russian-army-mother-commission-agent-approaches-seeking-protection-from-cbi-investigation-260511", "domain": "livelaw.in", "domain_classification": "Unknown", "message": "A 65-year-old mother has invoked the writ jurisdiction of the Kerala High Court seeking protection from the probe of the CBI alleging that her son was involved in trafficking Indian nationals to Russia.\nIt is alleged that traffickers seize the passports of Indian nationals on reaching Russia and they are given training in combat roles and provided with the uniform of the Russian army.\nIt is further alleged that the traffickers deploy Indian nationals at war front bases in the Russia-Ukraine war zone.\nMedia has reported that two Indian nationals recruited by the Russian army were killed in an ongoing war between Ukraine and Russia.\nAdvocate Naveen Radhakrishnan, Counsel for the petitioner stated her son was innocent and that she has no knowledge about his whereabouts."}, {"id": "150a5155-d80a-421f-b0dd-b9884752c533", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:30", "url": "https://ktvz.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN."}, {"id": "4fdeefbe-4846-4b37-9193-1cb444577055", "title": "Battle Lines : Israel hostage rescue , Far - right gains in EU election", "date": "2024-06-14 10:45", "url": "https://www.telegraph.co.uk/world-news/2024/06/13/battle-lines-israel-hostage-rescue-far-right-gains-in-eu/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "8f62a81d-1010-4e88-b541-2d54d004ec23", "title": "Ukraine older recruits await help from younger fighters", "date": "2024-06-14 14:15", "url": "https://www.thestar.com.my/news/world/2024/06/14/ukraine039s-older-recruits-await-help-from-younger-fighters", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "DONETSK REGION, Ukraine (Reuters) - Huddling in the dark with his automatic rifle, 50-year-old Ukrainian soldier \"Bell\" said he wished more of his younger compatriots would join the fight against Russia's invasion.\nFacing a bigger and better equipped enemy, Ukrainian forces are heavily reliant on older soldiers like him to defend the country against relentless Russian assaults.\nUkraine is under pressure to call up more troops as the 27-month-old war grinds on and fewer volunteers line up than in the first months of the war.\nSome Ukrainian officials have estimated the average age of the Ukrainian soldier is more than 40-years-old.\nThe brigade's chief sergeant, call sign Deputy, said many of the men currently training are over 50 years-old but that they are more motivated than younger troops."}, {"id": "0fc116d0-af96-4755-b33b-8edc90a67985", "title": "Yars Rising stretches its ties to the Atari classic , but somehow kind of works", "date": "2024-06-14 13:30", "url": "https://www.destructoid.com/yars-rising-stretches-its-ties-to-the-atari-classic-but-somehow-kind-of-works/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Yars Rising was recently announced as a follow-up of sorts to Atari 2600 classic Yars’ Revenge.\nRather than taking the form of a Zorlon Cannon-blasting shooter, Yars Rising is a hacking-centric Metroidvania with a demo now live during Steam Next Fest.\nYars Rising is also chock full of fully-voiced dialogue exchanges, so if you’re into that there’s plenty of it in this short jaunt.\nThus, the jury is out on whether or not the stealth portion of Yars Rising will be a thorn in the side of those who aren’t fond of sneaking missions.\nI may not be wild about what I’ve played of Yars Rising, but I’m curious."}, {"id": "6cfb8775-3ae2-4a72-bf7a-35d5c8734a4c", "title": "The story of the flags raised on Iwo Jima | News , Sports , Jobs", "date": "2024-06-14 08:45", "url": "https://www.ironmountaindailynews.com/opinion/2024/06/the-story-of-the-flags-raised-on-iwo-jima/", "domain": "ironmountaindailynews.com", "domain_classification": "Unknown", "message": "The time and place: Let’s turn back the hands of time to Feb. 23, 1945, (World War II) to Iwo Jima and Mount Suribachi.\nThe considerably larger flag could be seen from the countryside by the Marines and naval ships surrounding Iwo Jima.\nThe fighting with the Japanese soldiers spanned another 31 brutal, cruel days.\nThey were marked with hand-to-hand combat, suicide charges by the Japanese soldiers and fighting in the caves where they were entrenched.\nIt was the raising of the flag (the colors) on Mount Suribachi that gave them hope."}, {"id": "67c75483-2fb4-4d4b-8137-45eec6cbfd90", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "The trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "7386ee81-5c29-4a5c-9027-068d4b7743fe", "title": "Dr . Francis Boyle : COVID Injections Meet The Criteria For Biological Weapons Of Mass Destruction", "date": "2024-06-14 00:30", "url": "https://www.shtfplan.com/headline-news/dr-francis-boyle-covid-injections-meet-the-criteria-for-biological-weapons-of-mass-destruction", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "“It is my expert opinion that [the COVID injections] meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons [Convention],” his affidavit states.\nDr. Boyle is considered one of the world’s leading legal experts on biological weapons and he drafted the US Biological Weapons and Antiterrorism Act (“the Act”), which was passed into law in 1989 to implement the Biological Weapons Convention to criminalize the development, production, and possession of biological weapons.\nIn his affidavit for Dr. Sansone’s case, Dr. Boyle stated that COVID injections violate the Act.\nHe asserted that “covid-19 injections,” “covid-19 nanoparticle injections,” and “mRNA nanoparticle injections” are biological weapons and weapons of mass destruction which violate Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat.\nIt is my expert opinion that ‘COVID-19 nanoparticle injections’ or ‘mRNA nanoparticle injections’ or ‘COVID-19 injections’ meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat."}, {"id": "c6d1595d-ab4b-474e-8865-4258fc836111", "title": "RIGHT SPEAK : Fighting Most Tense in Kurakhove , Pokrovsk , Kramatorsk Axes ; UKR Stabilizes Kharkiv Front ; UKR Repels RU Arm - Attacks Near Chasiv Yar ; UKR Recapture Key Positions in Vovchansk ; UKR Decimates RU Radars , Air Defenses in Belgorod O...", "date": "2024-06-14 04:45", "url": "http://www.rightspeak.net/2024/06/fighting-most-tense-in-kurakhove.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (70) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "000fdb76-3832-43eb-ba5b-705d666fcccd", "title": "Hitler was  hypnotic in a very dangerous way  as a public speaker , says Farage", "date": "2024-06-14 12:30", "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-hitler-putin-general-election-b2562594.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theView from Westminster email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Nigel Farage has said Adolf Hitler was “hypnotic in a very dangerous way” as a public speaker and spoke again of his admiration for Vladimir Putin as a “political operator”.\nThe Reform leader tried to dismiss the concerns on Monday, saying that “every party will suffer” controversy triggered by its candidates in a snap election.\nAt the BBC phone-in Mr Farage was also asked about the ongoing conflict in Ukraine.\nMr Farage said: “This war has been going on for years, it is likely to go on for many, many more years."}, {"id": "d9adc6cf-b214-4622-8996-c10d1d660d55", "title": "The new cancer in society - Trinidad and Tobago Newsday", "date": "2024-06-14 10:45", "url": "https://newsday.co.tt/2024/06/13/the-new-cancer-in-society/", "domain": "newsday.co.tt", "domain_classification": "Unknown", "message": "The new cancer in society- Photo courtesy PixabayTHE EDITOR: As in the case of Osmond Baboolal, we've all seen the tragic consequences of young people witnessing horrific events.\nHis younger sister, however, overcame the tragedy and became a lawyer with the help of family and support from non-governmental organisations.\nJust as the internal conflict between the wolves can unite or divide, family support and open communication are vital for healing.\nAs a society we must recognise the long-term effects of violence and create safe spaces for young people to express their fears and feelings.\nWhile we fight to win the battle within, we have to be aware of the overall effects our choice will have on our family, nation, society and local communities."}, {"id": "0e307e3a-2ed8-4566-a906-d5287de16f65", "title": "Distinguished Historian Randall Woods to Speak on John Quincy Adams", "date": "2024-06-14 06:45", "url": "https://news.uark.edu/articles/70576/distinguished-historian-randall-woods-to-speak-on-john-quincy-adams", "domain": "news.uark.edu", "domain_classification": "Unknown", "message": "Distinguished Historian Randall Woods to Speak on John Quincy AdamsPhoto SubmittedOn Friday, June 28, the Fayetteville Public Library will host a talk with Randall Woods, the John A. Cooper Distinguished Professor of History at the U of A, to mark the release of his newest book, John Quincy Adams: A Man for the Whole People.\nJames M. McPherson, Pulitzer Prize winning author of Battle Cry of Freedom: The Civil War Era, notes that John Quincy Adams \"served his country for more than a half century as diplomat, senator, secretary of state, president, public intellectual and in a unique post-presidential career as gadfly of the slave power in Congress.\"\nHe says that \"Randall Woods skillfully interweaves the narrative of these events with intimate accounts of Adams' personal and family life in a warmly human manner.\"\nWoods will take questions and be available to sign books following the discussion.\nWoods has taught at the U of A since 1971, and his book on Adams follows on the heels of his award-winning biographies LBJ: Architect of American Ambition and Fulbright: A Biography."}, {"id": "3619131e-ba89-4b7a-94c6-0be99854eb68", "title": "Zimbabwe Has 8 , 000 Doses of Cabotegravir Anti - HIV Drug", "date": "2024-06-14 06:45", "url": "https://allafrica.com/stories/202406140105.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Zimbabwe has 8,000 doses of injectable pre-exposure prophylaxis drug, cabotegravir, for use in the ongoing pilot programme to establish its efficacy in preventing HIV as the country pulls all the stops to completely eradicate all new infections of the virus by 2030.\n\"We are doing a pilot programme to test the drug's efficacy especially looking at things like the side effects that it causes.\nWe have about 8000 doses of CAB-LA that we are using and this pilot programme that involves about 1000 people.\"\nDr Mugurungi noted that the new pre-exposure prophylaxis drug, if successful and approved, will be handy in the battle against taming new HIV infections.\nClose Sign up for free AllAfrica Newsletters Get the latest in African news delivered straight to your inbox Top Headlines AIDS Zimbabwe By submitting above, you agree to our privacy policy."}, {"id": "ba7ed7db-1db8-4842-ba5b-6608e1c7f3f8", "title": "What Can a Boosting Service Offer You ? ", "date": "2024-06-14 13:15", "url": "https://qcostarica.com/what-can-a-boosting-service-offer-you/", "domain": "qcostarica.com", "domain_classification": "Unknown", "message": "Boosting services provide players with professional assistance across a wide range of in-game activities.\nIn this article, we will explore the various benefits and possibilities that boosting services offer, shedding light on how they can elevate your gaming experience.\n- Advertisement -Overview of Key Boost Services AvailableThese boosting services cater to a wide range of player needs, ensuring that you can enjoy your favorite games to the fullest without the usual grind.\nWorld of Warcraft (WoW)In World of Warcraft, boosting services cater to a wide array of in-game needs.\nWide Range of ServicesBoosthive offers an extensive array of boosting services tailored to meet the diverse needs of gamers."}, {"id": "5f6818a1-7617-4675-b8ff-84d5d8d0a030", "title": "Belarus Delivered Advanced Weapons to Azerbaijan During Artsakh War , Leaked Documents Reveal", "date": "2024-06-14 14:00", "url": "https://horizonweekly.ca/en/belarus-delivered-advanced-weapons-to-azerbaijan-during-artsakh-war-leaked-documents-reveal/", "domain": "horizonweekly.ca", "domain_classification": "Unknown", "message": "Belarus delivered advanced weapons to Azerbaijan during the 2020 Artsakh War in a secret pact that defies the mandate of the Russia-led Collective Security Treaty Organization, recently leaked document reviewed by Politico have revealed.\nThe prime minister’s statement was swiftly followed by an announcement by Armenia’s foreign ministry that Yerevan was recalling its ambassador in Minsk.\nBelarus followed suit by recalling its ambassador to Yerevan.\nEduard Arakelyan, a military analyst at Yerevan’s Regional Center for Democracy and Security, verified to Politico that the leaked documents pertained to hardware used by Azerbaijan in recent wars, both in Artsakh and against Armenia itself.\n“This equipment was used with devastating effect against Armenian troops and was provided by a country that is supposed to be an ally of Armenia,” he told Politico."}, {"id": "8740e1bc-c17b-4206-b292-ef88498d7673", "title": "The Feds Are Itching to J6 Us Again By J . B . Shurk", "date": "2024-06-14 10:45", "url": "https://www.ruthfullyyours.com/2024/06/14/the-feds-are-itching-to-j6-us-again-by-j-b-shurk/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "The Feds Are Itching to J6 Us Again By J.B. Shurkhttps://www.americanthinker.com/articles/2024/06/the_feds_are_itching_to_j6_us_again.htmlAfter New York’s sham “justice” system procured a ridiculous felony conviction against President Trump, a lot of leftist commentators predicted that his supporters would erupt in violent mayhem.\nBiden’s campaign has been desperate for an explosive J6 or Charlottesville incident to use to slander Trump’s voters as violent extremists.\nIt is difficult to paint ordinary Trump voters as “dangerous” when ordinary Biden voters are threatening Jews, toppling statues, and burning down buildings.\nSo that the Establishment Class can laughably pretend President Trump (while still in office, no less) engaged in a bloody war against the United States.\nNonetheless, the Democrat Deep State has treated them as expendable pawns in its all-out war against President Trump."}, {"id": "e3cd9258-7729-4f87-860f-4a56c1434b94", "title": "Sudan Army Kills Senior RSF Commander Amid Ongoing Conflict", "date": "2024-06-14 14:00", "url": "https://www.devdiscourse.com/article/law-order/2983012-sudans-army-kills-senior-rsf-commander-amid-ongoing-conflict", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Sudan's army said on Friday it had killed Ali Yagoub Gibril, a senior commander for the paramilitary Rapid Support Forces (RSF) who was under U.S. sanctions, during a battle in the besieged north Darfur city of al-Fashir.\nGibril was a leading commander for the RSF in al-Fashir, the last major city in the Darfur region of Sudan that the paramilitary force does not control.\nThe RSF has been besieging al-Fashir, a city of 1.8 million people, for weeks and top U.N. officials have warned that the worsening conflict there could trigger widespread intercommunal violence.\nWar between the army and the RSF erupted over conditions for a transition to democracy in mid-April last year in the capital Khartoum, soon spreading to other parts of the country.\nThe conflict has led to the world's largest displacement crisis, renewed ethnic violencein Darfur blamed on the RSF and its allies, and a sharp increase in extreme hunger."}, {"id": "7e2cc4d1-4f46-43d9-88c8-0d0201405959", "title": "Australia arms export comes under scrutiny . Is Canberra  complicit  in Israel - Gaza war ? ", "date": "2024-06-14 01:30", "url": "https://www.scmp.com/week-asia/politics/article/3266529/australias-arms-export-comes-under-scrutiny-canberra-complicit-israel-gaza-war", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "There are also existing permits that allowed Australian manufacturers to supply weapons parts for the manufacture of F-35 jets.\nAustralia’s export of weapons to Israel amid the Israel-Gaza war has sparked controversy, with recent senate hearings confirming Canberra has issued new permits for military equipment exports to Israel since the start of the crisis.\nFor months, researchers, humanitarian groups, war protesters and Australia’s third-largest political party, the Australian Greens, have sought clarity over Australia’s exports of weapons and parts to Israel.\nIn older permits, Australia also sent “dual use technology” parts to Israel, but they were not military equipment, Marles added.\nThe Arms Trade Treaty, which regulates the international trade of arms, also makes clear that parts and components of weapons are also considered weapons."}, {"id": "51203fe5-dcf8-4e98-aee6-bd774fb4da81", "title": "Video - Jake Paul Faces Off With Sean OMalley After Accepting Offer To  Save  UFC 303", "date": "2024-06-14 03:15", "url": "https://www.lowkickmma.com/jake-paul-sean-omalley-face-off-rubi-rose/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Jake Paul and Sean O’Malley are ready to step and save UFC 303.\nEmanating from T-Mobile Arena on June 29, the International Fight Week finale was expected to be headlined by the long-awaited return of former two-division titleholder Conor McGregor.\nAfter exchanging words on social media, ‘The Problem Child’ and reigning bantamweight world champion ‘Sugar’ Sean O’Malley went face-to-face, giving fans a little taste of the UFC vs. PFL clash they hope to bring to ‘Sin City’ later this month.\nAdding insult to injury, the UFC 303 co-main event is now in need of replacing.\nCarlos Ulberg agreed to step in and take Rountree’s spot, but it now sounds like the fight needs yet another replacement."}, {"id": "b6fef41c-a31f-4389-aebd-9fbfba68d480", "title": "CFF , Atlas Elektronik partner for indigenous sonar project – Indian Defence Research Wing", "date": "2024-06-14 13:15", "url": "https://idrw.org/cff-atlas-elektronik-partner-for-indigenous-sonar-project/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "CFF, Atlas Elektronik partner for indigenous sonar project| BySOURCE: ANIAn Indian engineering firm and a division of a German defence major Thyssenkrupp Marine Systems have partnered to supply 12 indigenous low-frequency variable depth sonar systems for an indigenous project, according to an official statement.\nAtlas Elektronik GmbH has partnered with CFF Fluid Control Ltd for the supply of 12 indigenous low-frequency variable depth sonar systems.\n“The technology for the system is already proven in Indian waters, in the Active Towed Array Sonars supplied by Atlas Elektronik to the Indian Navy.\nThe partnership between CFF and Atlas Elektronik will build on this base in enhancing the operational effectiveness of the Indian Navy’s front-line platforms,” it said.\nThe systems will be produced in India by CFF in furtherance of the Indian government’s goal of self-reliance, it said."}, {"id": "665defaa-4c30-4505-aa35-3440ef2b06c8", "title": "Op - ed : How did pilot Bessie Coleman become a queen ? ", "date": "2024-06-14 13:00", "url": "https://www.chicagotribune.com/2024/06/14/opinion-bessie-coleman-aviation/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "I had always wanted to fly a plane, yet I had never found Coleman in any textbook in college, nor graduate school.\nAs a woman, Coleman had moved to Chicago from Waxahachie, Texas.\nIn France, she had to find an alternative flight school after her first Paris school shuttered its doors to women.\nTo give context to the cultural landscape in which Coleman earned her historic license in France (in French), women had just earned the right to vote in the U.S.\nMore than anyone I have ever met, Bessie Coleman truly earned a pair of wings."}, {"id": "9395eb10-70e3-4abc-a626-7792a8873777", "title": "Avowed developer admits combat didnt  look great  but has been hard at work on improving it", "date": "2024-06-14 10:00", "url": "https://www.techradar.com/gaming/consoles-pc/avowed-developer-admits-combat-didnt-look-great-but-has-been-hard-at-work-on-improving-it", "domain": "techradar.com", "domain_classification": "Unknown", "message": "Obsidian Entertainment, the developer behind the upcoming role-playing game Avowed is working on improving the upcoming role-playing game's combat based on player feedback from January's Xbox Developer Direct.\nAt the time of that presentation, the game's combat was criticized for appearing a little listless in its combat.\n\"When the player feedback is like, 'Oh, this doesn't look great,' you're like, okay, we need to prioritize that polish, like, immediately.\n\"We really heavily focused on the hit reactions on the creatures and started to really frame-by-frame focus.\nGet daily insight, inspiration and deals in your inbox Sign up for breaking news, reviews, opinion, top tech deals, and more."}, {"id": "bf7b1be9-5e62-4472-bc86-d210540a4c72", "title": "Navy adopting  startup approach  to fielding new technology in Europe and Africa", "date": "2024-06-14 14:15", "url": "https://www.stripes.com/branches/navy/2024-06-14/drones-russia-navy-nato-14166646.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The U.S. Navy in Europe is working with allies on setting common operations standards for drones and emerging technology.\nIn November, the service established Task Force 66 at its base in Naples.\nThe task force was integrated into the fleet last month.\nThat response is an example of how the task force will offer feedback to industry to spur quick, cost-effective solutions, he said.\nThe lessons the task force learns may apply well beyond Europe and Africa, as the team coordinates with other fleets and the Navy’s Disruptive Capabilities Office."}, {"id": "ef24abb5-3b99-41eb-91d1-d74cbc842dbe", "title": "Gaza war : with both Sides playing Politics , dont expect a Ceasefire any time Soon", "date": "2024-06-14 06:30", "url": "https://www.juancole.com/2024/06/playing-politics-ceasefire.html", "domain": "juancole.com", "domain_classification": "Unknown", "message": "China supported the resolution, but doubted whether there had been notable developments since the previous ceasefire motion.\nProminent among these are how the war goes from here, the Israeli political environment and the extent of pressure on Israel from the Washington for a ceasefire.\nThere were more violations against children in Gaza, the West Bank and Israel than anywhere else in the world last year, the report says.\nThere has been a similar response to a further UN report accusing Israel as well as Hamas of war crimes.\nOn the Palestinian side, there are certainly some differences between the Hamas military leadership in Gaza and the overall political leadership in Qatar."}, {"id": "edadeb84-8dad-4f50-8fcf-8fa5f0cc69f9", "title": "Father of American hostage held by Hamas talks about efforts to free his son", "date": "2024-06-14 05:00", "url": "https://www.news4jax.com/news/local/2024/06/14/father-of-american-hostage-held-by-hamas-talks-about-efforts-to-free-his-son/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "The father of an American man talked to News4JAX about his son’s experience as a hostage taken by Hamas terrorists during the October attack.\nIt’s been eight months since 35-year-old Sagui Dekel Chen, a father of three, was kidnapped.\nHis father, Jonathan Dekel-Chen said 40 of the 79 people kidnapped from his Kibbutz were released in the first hostage deal in late November.\n“They saw my son and many other people from our Kibbutz who were taken hostage.\nLast week, four hostages were rescued during an Israeli military operation that, according to Hamas, killed more than 200 Palestinians."}, {"id": "7699753c-c9bb-4570-949e-b946e53b4dc1", "title": "UN Chief Guterres warns of heightened risk of NUCLEAR CONFLICT amid geopolitical tensions – NaturalNews . com", "date": "2024-06-14 09:45", "url": "https://www.naturalnews.com/2024-06-13-un-chief-warns-high-risk-nuclear-conflict.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "UN Chief Guterres warns of heightened risk of NUCLEAR CONFLICT amid geopolitical tensionsUnited Nations Secretary-General Antonio Guterres recently issued a stern warning as technological advances and escalating geopolitical tensions that risk the outbreak of a nuclear conflict endanger the world at a level not seen since the Soviet Union collapsed in 1991.\nHowever, they \"are not brandishing [nuclear weapons],\" Russian President Vladimir Putin told an audience at the St. Petersburg International Economic Forum on June 7.\nHe reiterated that Russia would only consider using nuclear weapons if its sovereignty or territorial integrity were under threat.\nTactical nuclear weapons include air bombs, warheads for short-range missiles and artillery munitions and are meant for use on a battlefield.\nU.S. accused of taking out Russian nuclear missile early warning system in latest escalation."}, {"id": "bedf16b1-b11a-4e22-8f78-754a4f5e5415", "title": "ARTS AND HUMANITIES : Beaufort memorializes African American hero", "date": "2024-06-14 13:15", "url": "https://www.postandcourier.com/aikenstandard/aikenstandard/lifestyle/arts-and-humanities-beaufort-memorializes-african-american-hero/article_c167557a-2799-11ef-a8c3-8f9abb9b548b.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "JACKSON — The Savannah River Ecology Lab’s Outreach Coordinator Sean Poppy presented a variety of animals — from salamanders and skinks, to frogs, snakes and a turkey vulture — to eager viewers at the Jackson library on Wednesday.\nRead moreSavannah River Ecology Lab showcases native amphibians, reptiles and birds at Jackson library"}, {"id": "29c187c1-d090-4eef-8a4c-3fc682d13deb", "title": "Battles rage in Rafah as Biden blames Hamas for truce delay", "date": "2024-06-14 03:30", "url": "https://dunyanews.tv/en/World/818435-Battles-rage-in-Rafah-as-Biden-blames-Hamas-for-truce-delay", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Battles rage in Rafah as Biden blames Hamas for truce delayWorld World Battles rage in Rafah as Biden blames Hamas for truce delayUS President Joe Biden called Hamas the \"biggest hang-up\" to another truce.\nIn Italy at a G7 summit, Biden called Hamas \"the biggest hang-up so far\" to a deal on a Gaza truce and hostage release.\nThe plan for the first Gaza truce since a week-long pause in November includes a six-week ceasefire, a hostage-prisoner exchange and Gaza reconstruction.\nFallout from the Gaza war is regularly felt on the Israeli-Lebanon frontier, where deadly cross-border exchanges have escalated.\nThe Israeli military said most launches had been intercepted while others ignited fires."}, {"id": "dfc58dff-fd13-418f-a15a-7bc00cc9c658", "title": "Lee  Once Were Warrior Tamahori wraps trilogy with The Convert", "date": "2024-06-14 00:45", "url": "https://www.brisbanetimes.com.au/culture/movies/lee-once-were-warriors-tamahori-wraps-trilogy-with-the-convert-20240607-p5jk6d.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Got it Normal text size Larger text size Very large text size Thirty years after breaking through with his debut feature Once Were Warriors, Lee Tamahori has made The Convert, a film that completes a trilogy he always intended to make – without knowing exactly what it would be about.\nWarriors catapulted him into Hollywood, a step that, then aged in his mid-40s, he was more than ready to take.\nAs it happens, he has effectively made a trilogy in reverse, with three films about the state of Maori culture at different points in New Zealand’s history since European settlement.\nThere’s quite a complex history.” Tioreore Ngatai-Melbourne as Rangimai in Lee Tamahori’s movie The Convert.\nLee Tamahori on the set of The Convert with leading man Guy Pearce."}, {"id": "fdedce0a-dff2-4f28-a9d5-5dbe5eaee6c9", "title": "European Populists Back Putin As They Roll Out Their Anti - Ukraine Positions", "date": "2024-06-14 14:00", "url": "https://menafn.com/1108332558/European-Populists-Back-Putin-As-They-Roll-Out-Their-Anti-Ukraine-Positions", "domain": "menafn.com", "domain_classification": "Unknown", "message": "As well as increasing opposition to Russian sanctions, far-right MEPs have demonstrated a pro-Russia voting record.\nRead more: EU parliament election sees shaken centre hold – but far right now has chances to show its strengthExploiting the European far right offers numerous benefits to Putin.\nNew world orderRussia's fight against the world order in place since the end of the cold war resonates with far-right parties.\nBut there are splits in the far right - one of the most divided political groups in Europe .\nThe role that these far-right parties play in the upcoming years will have serious implications for European democracy and stability."}, {"id": "f11e1457-a2a2-45f9-889d-f3b8d9dd4ee4", "title": "HBO New House of the Dragon Season Moves Way Too Slowly : Review", "date": "2024-06-14 11:00", "url": "https://www.bnnbloomberg.ca/hbo-s-new-house-of-the-dragon-season-moves-way-too-slowly-review-1.2085288", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- The first season of House of the Dragon moved extremely fast—arguably, too fast.\nNow that the battle for the Iron Throne among members of House Targaryen has reached the meat of its story, things drag(on) along at an almost glacial pace.\nAfter Game of Thrones ended in 2019, HBO scrambled to find a way to mine George R.R.\nThe network settled on House of the Dragon, based on Martin’s history text Fire & Blood.\nSet about two centuries before the events of Thrones, House of the Dragon centers on two warring branches of the same family, the dragon-riding Targaryens."}, {"id": "b8a795f7-f70c-492a-b82d-fd8d7057edd9", "title": "Star - spangled banner still waves boldly as always , Flag Day reminds Americans", "date": "2024-06-14 10:45", "url": "https://www.yahoo.com/news/star-spangled-banner-still-waves-094506455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "File Photo by Bill Greenblatt/UPIJune 13 (UPI) -- Today is Flag Day, and while Americans typically don't get the day off, it's still a holiday worth celebrating.\nPresident Harry Truman in 1949 signed into law a bill making Flag Day a day of \"national observance.\"\nFlag Code, the American flag should always fly freely and never touch anything beneath it.\nNotable for our times, U.S. code also forbids the flying of the flag upside down except as a sign of distress.\nAlito, however, claimed his wife flew the flag upside down over a dispute she had with a neighbor."}, {"id": "1fb4f5f7-0a95-4496-aa2b-820c36b5cc73", "title": "Russia prisons close as so many convicts die fighting in Ukraine | Daily Star", "date": "2024-06-14 11:00", "url": "https://www.dailystar.co.uk/news/world-news/putin-close-russian-prisons-ukraine-33028610", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nAn estimated 150,000 Russian prisoners, including murderers, rapists, robbers and gangsters, were forcibly recruited into the military to serve on the frontline.\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters."}, {"id": "b8235526-54e0-47bd-b201-13b63bfedf92", "title": "5 spine - chilling body horror anime to watch now | English Movie News", "date": "2024-06-14 12:30", "url": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/5-spine-chilling-body-horror-anime-to-watch-now/articleshow/110996922.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Made in AbyssBody horror anime can evoke a mix of revulsion and fascination, making it a unique sub-genre for horror enthusiasts .\nHere are five exceptional body horror anime series that are a must-watch for anyone seeking a thrilling experience.The horror genre in anime doesn't always rely on supernatural elements; sometimes, the terror comes from within the human body itself.\nWith so many options, it can be challenging to find the truly outstanding body horror anime.\nThis 24-episode series is filled with spine-chilling body transformations, from heads splitting open to reveal hidden teeth and eyes.\nCreated by renowned horror mangaka Junji Ito, this series delves into body horror and eldritch horror, presenting some of the most unsettling transformations imaginable."}, {"id": "89ec3fdb-b399-4abf-9e1c-decec30ae3d4", "title": "Meet the American who stitched the Stars & Stripes , Betsy Ross", "date": "2024-06-14 08:45", "url": "https://www.foxnews.com/lifestyle/meet-american-who-stitched-stars-stripes-betsy-ross-reputed-wartime-seductress", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Flagmaker Betsy Ross is embraced as one of the most popular figures of the American Revolution.\nThe real story of Betsy Ross is even greater than the highly plausible account of America’s first flagmaker.\nNeither Betsy Ross story — America’s first flagmaker or Washington’s secret-ally seductress — is proven in the eyes of historians.\nHer version, the 13 stars in a circle, is still known as the Betsy Ross Flag.\nHe credits historian Joseph Tustin for naming Betsy Ross the possible seductress."}, {"id": "9068ad26-5f28-41be-a913-002d0c2364e2", "title": "G7 summit in Italy : PM Modi holds bilateral talks with Zelenskyy , Macron and Sunak", "date": "2024-06-14 14:15", "url": "https://www.theweek.in/news/world/2024/06/14/g7-summit-in-italy-pm-modi-holds-bilateral-talks-with-zelenskyy-macron-and-sunak.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "On the sidelines of the G7 summit in Italy's Apulia region, Prime Minister Narendra Modi on Friday held talks with Ukrainian President Volodymyr Zelenskyy, French President Emmanuel Macron and UK Prime Minister Rishi Sunak.\nAlso, PM Modi discussed ways to strengthen the strategic partnership including defence, nuclear, and space with Macron.\nPM @narendramodi met President @EmmanuelMacron of France on the sidelines of the 50th G7 Summit in Apulia, Italy,\" said Jaiswal.\nPM @narendramodi and French President @EmmanuelMacron held a bilateral meeting in Italy on the sidelines of the G7 Summit.\nOn the final day of the G7 summit, the members vowed to tackle the \"unfair\" business practices by China that are undermining their workers and industries."}, {"id": "16bdd200-4705-49f7-bc97-a313eee042e8", "title": "The best announcements from Summer Game Fest 2024", "date": "2024-06-14 08:45", "url": "https://www.stuff.tv/features/the-best-announcements-from-summer-game-fest-2024/", "domain": "stuff.tv", "domain_classification": "Unknown", "message": "PlayStation had its own State of Play the week before while Nintendo has still yet to confirm its own summer Direct.\nTo save you a good many hours, we’ve put together the most exciting trailers and announcements that came from the past week of Summer Game Fest 2024, from the big blockbusters to the indie darlings.\nRelease: 2025CairnPlayIf last year’s indie game Jusant conveyed the calm of climbing, then Cairn seems to want to really focus on the other end of the extreme.\nRelease: TBAEverything elseWith just so many streams happening during Summer Game Fest, it’s simply too much to go for more honourable mentions.\nBut if you want to watch them in full for yourself then simply follow the links below:– Summer Game Fest Live, Day of the Devs and Devolver Direct– Wholesome Direct Indie Showcase– Xbox Games Showcase, Call of Duty: Black Ops 6 Direct– Future Games Show: Summer Games Showcase– The PC Gaming Show– Ubisoft ForwardAlan Wen About Stuff contributor Areas of expertise gaming"}, {"id": "d909b854-281c-4087-8d9a-82b3ec5db0c8", "title": "New Video Reveals Glimpse Of The Manta Ray Underwater Drone Propulsion System", "date": "2024-06-14 00:30", "url": "https://theaviationist.com/2024/06/13/manta-ray-rear-section/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "The subsequent segment shows the Manta Ray UUV in action, either being deployed into water or already submerged, showcasing its operational capabilities in an aquatic environment.\nThe Manta Ray prototype underwent extensive full-scale testing off the coast of Southern California in February and March 2024.\nThe Manta Ray ProgramThe Manta Ray‘s development is part of a DARPA initiative to advance critical technologies for future unmanned underwater vehicle (UUV) designs.\nThe data collected by Manta Ray will enhance decision-making for joint forces, providing a strategic advantage in missions.\nEach contractor is responsible for creating unique vehicles to showcase specific capabilities within the Manta Ray program."}, {"id": "1009f69c-33c2-4199-abe3-4b05732e0616", "title": "World News in Brief : Ukraine attacks continue , education in Africa , Albinism update", "date": "2024-06-14 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240613-unnews07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "World News in Brief: Ukraine attacks continue, education in Africa, Albinism update13 June 2024 - The UN humanitarian coordinator for Ukraine Denise Brown on Thursday said she was 'appalled' by the scale of Russia's overnight attack on Kryviy Rih City in the Dnipro Region.\n\"Strikes on Ukrainian cities by the Armed Forces of the Russian Federation continue to bring devastating human loss,\" said Ms. Brown.\nKillings continue\"I continue to receive cases of attacks and killings, often perpetuated against the most vulnerable in our societies - our children,\" Ms. Miti-Drummond said.\nSome reports also show that children with albinism face abandonment and rejection by their families in China and other Asian countries.\nWith regard to health challenges, persons with albinism still struggle to access a simple bottle of life-saving sunscreen - an unaffordable luxury in some regions, according to the UN independent expert."}, {"id": "5da8989c-a7dc-46ff-958b-9e590b0b46d7", "title": "Germany Uniper wins $14 billion arbitration ruling against Gazprom – Euractiv", "date": "2024-06-14 09:15", "url": "https://www.euractiv.com/section/energy-environment/news/germanys-uniper-wins-14-billion-arbitration-ruling-against-gazprom/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "German utility Uniper has won a multi-billion euro arbitration against former long-time supplier Gazprom, it said on Wednesday (12 June), allowing it to tear up dormant gas supply contracts and potentially setting a precedent for similar cases.\nSources told Reuters last month that the arbitration tribunal could allow Uniper to terminate the 250 terawatt hours in dormant Russian gas contracts, some of which run until the middle of the next decade.\nWith the right of termination that we received in the arbitration ruling, we are ending the contracts with Gazprom Export,” Uniper CEO Michael Lewis said in a statement.\nThe German government is also taking part in the discussions between the European Commission and those countries that are still dependent on Russian gas, Economy Minister Robert Habeck said on Tuesday.\n“I am personally very involved in it,” Habeck said, adding that the talks aim to ensure secure gas supply for southeastern Europe without filling Russia’s coffers."}, {"id": "68c0ed8a-cfa8-4f7d-b95a-7166e96084ff", "title": "Mark Alexander : Profile of Valor : Forgotten Hero ? ", "date": "2024-06-14 09:30", "url": "https://patriotpost.us/alexander/107653-profile-of-valor-forgotten-hero-2024-06-14", "domain": "patriotpost.us", "domain_classification": "Unknown", "message": "Woody Woodson was a Philadelphia native.\nThe hunt’s still ongoing.”There are 94 black recipients, proportionally far less than the percentage of black Americans serving, but until the 1960s black soldiers were mostly excluded from combat roles.\nThe first Medal of Honor to a black recipient was awarded for his valorous actions during the War Between the States.\nCPL Waverly “Woody” Woodson Jr.: Your example of valor — a humble American Patriot defending Liberty for all above and beyond the call of duty, and in disregard for the peril to your own life — is eternal.\nSemper Vigilans Fortis Paratus et FidelisPro Deo et Libertate — 1776Follow Mark Alexander on X/Twitter."}]