[{"id": "5645ef43-d349-4e2f-8ec7-47d79f42333d", "title": "Editorial : Hikurangi scenario shows 22 , 000 Kiwis could die in a quake - are we doing enough to prepare ? ", "date": "2024-05-19 21:00", "url": "https://www.nzherald.co.nz/nz/editorial-hikurangi-scenario-shows-22000-kiwis-could-die-in-earthquake-are-we-doing-enough-to-prepare/A7PCATMRFVERTHHCHJFRUGCAEI/", "message": "Screenshot of a GNS model of an 8.9 magnitude Hikurangi earthquake.\nThat included a focus on our largest fault – the Hikurangi Subduction Zone.\nDuring a session on catastrophic risk, the National Emergency Management Agency (Nema) detailed its work over the past 18 months, using a 9.1 Hikurangi earthquake and tsunami as its “planning scenario” for the “worst of the worst”.\nThe general location of the offshore part of the Hikurangi subduction zone.\nOn a nationwide, governmental level, we must ensure our systems are ready to cope with a disaster."}, {"id": "43614ea9-728d-49f8-a2dc-e744af89d52a", "title": "Why holdover , or  zombie , wildfires are a bigger problem for B . C . this year", "date": "2024-05-19 17:15", "url": "https://www.cbc.ca/news/canada/british-columbia/holdover-fires-explainer-1.7206823", "message": "But crews are also watching one of the largest wildfires burning in Western Canada — the Patry Creek fire, 25 kilometres north of Fort Nelson, B.C.\nWildfire Service put out an early warning that with dry conditions, these holdover fires could pose a bigger threat than in years past.\nWATCH | Wildfire smoke near Fort Nelson in December 2023: Wildfire smoke still smouldering near Fort Nelson, B.C.\nTower told the Canadian Press that the depth of the holdover fires presents another challenge, even when they are found.\nThese are the regions, he said, where large fires burned last year, putting them at greatest risk of having holdover fires return."}, {"id": "539bc652-95d2-49a3-bcb7-aba7eb566c4e", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 21:15", "url": "https://www.theglobeandmail.com/canada/british-columbia/article-northern-rockies-regional-municipality-says-four-homes-lost-in-bc-2/", "message": "Rob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nI mean, this is the start of a potentially really long season,” Fraser said Sunday.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nThe Patry Creek wildfire to the north of the town doesn’t pose an immediate threat, but the municipality warned the situation could change rapidly in the event of strong northerly winds."}, {"id": "f5e7cdc4-d45e-4d8d-9ce5-22b89981f4df", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 22:00", "url": "https://www.timescolonist.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "7158fd03-f848-4648-a374-df47b838befc", "title": "Wildfires and tornadoes have a tangled relationship . Ontario researchers work to learn why", "date": "2024-05-19 11:30", "url": "https://www.cbc.ca/news/canada/london/canada-tornado-forest-fires-tornado-relationship-1.7207582", "message": "As another wildfire season gets underway in Canada, researchers with the Northern Tornadoes Project (NTP) at Western University have found a curious link between wildfires and tornadoes.\nAccording to data from the London, Ont., university, Canada experienced a record-breaking 129 tornadoes in 2022.\nThat continent-spanning veil of wood smoke, Sills said, seems to have a diminishing effect on the size and power of thunderstorms.\nCoulson said that trend, along with the yet-to-be-understood relationship between wildfires and tornadoes, was clearly seen in last year's weather data.\nBack at Western University, researchers with the NTP will be watching what kind of an effect, if any, this year's wildfire season will have on storms."}, {"id": "d1966529-1829-4a7b-b434-b6c43f522e57", "title": "Light earthquake 4 . 4 mag , south of the Fiji Islands", "date": "2024-05-19 16:45", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-south-of-the-fiji-islands-42/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Sunday, south of the Fiji Islands (0 miles).\nEvent ids that are associated to the earthquake: us6000mu1u.\nThe earthquake occurred at a depth of 527.048 km (327 miles) below the earth’s surface.\nIn the past 24 hours, there have been eleven, in the last 10 days thirteen, in the past 30 days thirteen and in the last 365 days thirteen earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: south of the Fiji Islands."}, {"id": "bec0277f-4ab1-42e8-8a5c-eb6c81fbdf64", "title": "Light earthquake 4 . 5 mag , 100 km N of Barishal , Pakistan", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-100-km-n-of-barishal-pakistan/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported 100 km N of Barishal, Pakistan (62 miles) on Friday.\nEvent ids that are associated to the earthquake: us6000mxn4.\nExact location of earthquake, 74.72° East, 37.2283° North, depth 10 km.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 100 km N of Barishal, Pakistan."}, {"id": "fbc10ca5-98bd-4607-99f6-e6b8eee6575b", "title": "Light earthquake : M4 . 4 quake has struck near South Sandwich Islands region", "date": "2024-05-19 13:15", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-south-sandwich-islands-region-4/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Saturday, South Sandwich Islands region (0 miles).\nThe 4.4-magnitude earthquake was detected at 12:38:31 / 12:38 pm (local time epicenter).\nExact location of earthquake, -27.2723° West, -55.4595° South, depth 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: South Sandwich Islands region."}, {"id": "dc1a2550-92bf-4768-8991-01d385055875", "title": "Light earthquake , 4 . 7 mag strikes near Higuerote in Venezuela", "date": "2024-05-19 20:15", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-7-mag-strikes-near-higuerote-in-venezuela/", "message": "A light earthquake magnitude 4.7 (ml/mb) has struck on Sunday, 55 km ENE of Higuerote, Venezuela (34 miles).\nThe earthquake was roughly at a depth of 10 km (6 miles).\nIds that are associated to the earthquake: us6000mzpr.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 55 km ENE of Higuerote, Venezuela."}, {"id": "6c28e44b-36cd-4455-8e47-1f8b5ba42cfc", "title": "Light earthquake , 4 . 4 mag was detected near Mariana Islands region", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-mariana-islands-region-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Saturday, Mariana Islands region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, 142.9613° East, 21.9681° North, depth 280.585 km.\nIds that are associated to the earthquake: us6000muhq.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Mariana Islands region."}, {"id": "4ae14df1-b404-425e-9dc5-1fd6a5e9f4e1", "title": "Light earthquake : M4 . 5 quake has struck near Poso in Indonesia", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-5-quake-has-struck-near-poso-in-indonesia/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Monday, 42 kilometers (26 miles) from Poso in Indonesia.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nNearby country/countries that might be effected, Indonesia (c. 242 968 000 pop).\nEpicenter of the earthquake was 81 km (50 miles) from Palu (c. 282 400 pop), 43 km (27 miles) from Poso (c. 47 100 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 42 km NNW of Poso, Indonesia."}, {"id": "b6067eae-8e93-4e0c-9d41-2d29f8760cdd", "title": "Light earthquake : M4 . 5 quake has struck near Lata in Solomon Islands", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-5-quake-has-struck-near-lata-in-solomon-islands-6/", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 114 km WNW of Lata, Solomon Islands (71 miles) on Saturday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.5-magnitude earthquake was detected at 00:26:32 / 12:26 am (local time epicenter).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 114 km WNW of Lata, Solomon Islands."}, {"id": "52522656-cbf4-4dfa-93be-60fcb6e0835b", "title": "4 homes destroyed in Fort Nelson wildfire , no green light yet for residents to return", "date": "2024-05-19 21:00", "url": "https://globalnews.ca/news/10511903/4-homes-lost-fort-nelson-wildfire/", "message": "“Additionally, an emergency operations centre advance team is in Fort Nelson, working to have the necessary systems to return the full emergency operations centre home,” municipal staff said on social media.\nIt says fire crews have placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by helicopters and heavy equipment.\nThe BC Wildfire Service is reporting the Parker Lake wildfire is now around 12,329 hectares, or 123 square kilometres.\nThe wildfire service said it does not have a timeline yet for green-lighting a full return for the Fort Nelson community.\nFraser’s comments come after videos were posted on social media showing what appeared to be multiple homes destroyed outside Fort Nelson."}, {"id": "5c28946b-92a3-449d-b3b2-ff9b7641b519", "title": "Light earthquake 4 . 5 mag , Bonin Islands , Japan region", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-bonin-islands-japan-region-2/", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Tuesday, Bonin Islands, Japan region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nAll ids that are associated to the event: us6000mx2d.\nThe earthquake occurred at a depth of 456.949 km (284 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Bonin Islands, Japan region."}, {"id": "f8694f9d-5bf4-41dd-9c0a-cb3cc7d6ce37", "title": "Light earthquake : M4 . 9 quake has struck near Port - Olry in Vanuatu", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-9-quake-has-struck-near-port-olry-in-vanuatu-5/", "message": "A light earthquake magnitude 4.9 (ml/mb) strikes 120 km E of Port-Olry, Vanuatu (75 miles) on Sunday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000mzlh.\nId of event: us6000mzlh.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 120 km E of Port-Olry, Vanuatu."}, {"id": "03aa2935-d84e-4a93-a821-f57571c7ef5a", "title": "Light earthquake 4 . 4 mag , Fiji region", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-fiji-region-28/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Friday, Fiji region (0 miles).\nExact time and date of event in UTC/GMT: 10/05/24 / 2024-05-10 12:07:24 / May 10, 2024 @ 12:07 pm.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 530.15 km (329 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Fiji region."}, {"id": "95436b84-7b6e-4e7e-a7e0-61e4811a830a", "title": "Light earthquake , 4 . 4 mag strikes near Amahai in Indonesia", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-amahai-in-indonesia-7/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Saturday, 145 km SSE of Amahai, Indonesia (90 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.4-magnitude earthquake was detected at 04:39:17 / 4:39 am (local time epicenter).\nId of earthquake: us7000mdeu.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 145 km SSE of Amahai, Indonesia."}, {"id": "676a1b46-9161-4dfd-9eb4-8da8b3da883d", "title": "Light earthquake , 4 . 4 mag strikes near Pundong in Indonesia", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-pundong-in-indonesia/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 141 km S of Pundong, Indonesia (88 miles) on Friday.\nIds that are associated to the earthquake: us7000mdau.\nThe earthquake occurred at a depth of 39.062 km (24 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 141 km S of Pundong, Indonesia."}, {"id": "c050f020-404c-4b7b-87ab-6d32a9fd9e07", "title": "Light earthquake : M4 . 4 quake has struck near Mid - Indian Ridge", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-mid-indian-ridge-7/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes Mid-Indian Ridge (0 miles) on Friday.\nEvent ids that are associated to the earthquake: us6000mw3c.\nId of event: us6000mw3c.\nIn the past 24 hours, there have been fourty, in the last 10 days fourty, in the past 30 days fourty and in the last 365 days fourty earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Mid-Indian Ridge."}, {"id": "8c859832-2fe7-471c-a9d1-bf6750df22e9", "title": "Hot Weather Poses New Risk as Thousands Remain Without Power After Deadly Houston Storm", "date": "2024-05-19 05:30", "url": "https://www.theyeshivaworld.com/news/general/2284136/hot-weather-poses-new-risk-as-thousands-remain-without-power-after-deadly-houston-storm.html", "message": "“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\n“It felt terrifying.”STATE AND FEDERAL RECOVERY ASSISTANCE ON THE WAYIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "c2b32332-52df-439a-b0f8-2cd78ca95b3d", "title": "Light earthquake , 4 . 5 mag was detected near San Antonio de los Cobres in Argentina", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-was-detected-near-san-antonio-de-los-cobres-in-argentina-17/", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 82 km W of San Antonio de los Cobres, Argentina (51 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000mx34.\nId of event: us6000mx34.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 82 km W of San Antonio de los Cobres, Argentina."}, {"id": "85f44fb5-dae2-40e6-a492-1e6845b80e2f", "title": "Light earthquake : M4 . 4 quake has struck near Neiafu in Tonga", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-neiafu-in-tonga-11/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Tuesday, 134 km NNE of Neiafu, Tonga (83 miles).\nIds that are associated to the earthquake: us6000mv8t.\nExact location of earthquake, longitude -173.3236 West, latitude -17.6165 South, depth = 41.866 km.\nThe earthquake occurred at a depth of 41.866 km (26 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 134 km NNE of Neiafu, Tonga."}, {"id": "6095e6a2-116c-492e-853f-d0de23c16348", "title": "Light earthquake , 4 . 4 mag has occurred near Nikolski in Alaska", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-nikolski-in-alaska-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Sunday, 157 km WSW of Nikolski, Alaska (98 miles).\nThe earthquake was roughly at a depth of 48.723 km (30 miles).\nThe 4.4-magnitude earthquake has occurred at 19:59:10 / 7:59 pm (local time epicenter).\nIn the past 24 hours, there have been six, in the last 10 days eleven, in the past 30 days fourty-six and in the last 365 days fourty-eight earthquakes of magnitude 3.0 or greater that have been detected nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 157 km WSW of Nikolski, Alaska."}, {"id": "5befd4f9-f6b7-4cd3-a897-f9bcbc3d2053", "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm - WSVN 7News | Miami News , Weather , Sports", "date": "2024-05-19 00:00", "url": "https://wsvn.com/news/us-world/hot-weather-poses-new-risk-as-thousands-remain-without-power-after-deadly-houston-storm/", "message": "“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\n“It felt terrifying.”STATE AND FEDERAL RECOVERY ASSISTANCE ON THE WAYIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "0f6c5873-7350-4025-8356-b2ebcba8d90c", "title": "Light earthquake : M4 . 5 quake has struck near Tambolaka in Indonesia", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-5-quake-has-struck-near-tambolaka-in-indonesia/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Wednesday, 150 km SW of Tambolaka, Indonesia (93 miles).\nEvent ids that are associated to the earthquake: us6000mxb4.\nId of event: us6000mxb4.\nThe 4.5-magnitude earthquake was detected at 20:54:31 / 8:54 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 150 km SW of Tambolaka, Indonesia."}, {"id": "3f056fd5-8dc7-401c-a837-67aef7a3bf53", "title": "Moderate earthquake : M5 . 2 quake has struck near La Placita de Morelos in Mexico", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/moderate-earthquake-m5-2-quake-has-struck-near-la-placita-de-morelos-in-mexico/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was detected on Sunday, 145 km SW of La Placita de Morelos, Mexico (90 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, -104.5165° West, 17.5684° North, depth 10 km.\nIds that are associated to the earthquake: us6000mzmh.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 145 km SW of La Placita de Morelos, Mexico."}, {"id": "292a293a-34a7-4a98-9f8c-f9003ffa1c36", "title": "Light earthquake , 4 . 4 mag has occurred near Ambunti in Papua New Guinea", "date": "2024-05-19 13:15", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-ambunti-in-papua-new-guinea/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 12 km SW of Ambunti, Papua New Guinea (7 miles).\nDate and time of earthquake in UTC/GMT: 16/05/24 / 2024-05-16 13:20:14 / May 16, 2024 @ 1:20 pm.\nThe epicenter of the earthquake was roughly 106.27 km (66 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 12 km SW of Ambunti, Papua New Guinea."}, {"id": "f7cbed7e-4610-4480-abcf-7fa7e2820d2f", "title": "Light earthquake 4 . 4 mag , 137 km SSW of Labuan , Indonesia", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-137-km-ssw-of-labuan-indonesia/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Sunday, 137 km SSW of Labuan, Indonesia (85 miles).\nEvent id: us6000mwqh.\nIds that are associated to the earthquake: us6000mwqh.\nThe earthquake occurred at a depth of 26.203 km (16 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 137 km SSW of Labuan, Indonesia."}, {"id": "d36e5ef8-1b94-43ad-a7c7-f1868d33841f", "title": "Light earthquake , 4 . 7 mag has occurred near Tobelo in Indonesia", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-7-mag-has-occurred-near-tobelo-in-indonesia-9/", "message": "A light earthquake magnitude 4.7 (ml/mb) has occurred on Sunday, 89 kilometers (55 miles) from Tobelo in Indonesia.\nThe earthquake occurred at a depth of 40.734 km (25 miles) below the earth’s surface.\nId of earthquake: us6000mzpe.\nEpicenter of the earthquake was 89 km (56 miles) from Tobelo (c. 10 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 89 km NE of Tobelo, Indonesia."}, {"id": "bfefa9af-06eb-415a-9ab2-cfb95d2a8acd", "title": "Light earthquake , 4 . 5 mag strikes near Kermadec Islands , New Zealand", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-strikes-near-kermadec-islands-new-zealand-3/", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes Kermadec Islands, New Zealand (0 miles) on Tuesday.\nThe earthquake occurred at a depth of 35 km (22 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nDate and time of earthquake in UTC/GMT: 07/05/24 / 2024-05-07 03:05:53 / May 7, 2024 @ 3:05 am.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Kermadec Islands, New Zealand."}, {"id": "2e2355aa-c5cd-4fbd-811c-11f5be7e066f", "title": "Light earthquake : M4 . 5 quake has struck near the Fiji Islands", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-5-quake-has-struck-near-the-fiji-islands-36/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported south of the Fiji Islands (0 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, -179.4628° West, -22.2455° South, depth 587.744 km.\nThe earthquake was roughly at a depth of 587.744 km (365 miles).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: south of the Fiji Islands."}, {"id": "6d8b8edf-0e4f-4c22-b07e-8f31e769c0b6", "title": "Light earthquake , 4 . 4 mag strikes near Svalbard", "date": "2024-05-19 09:45", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-svalbard-5/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported north of Svalbard (0 miles) on Sunday.\nExact location of event, longitude 13.2392 East, latitude 85.1631 North, depth = 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact time and date of earthquake 19/05/24 / 2024-05-19 04:19:12 / May 19, 2024 @ 4:19 am UTC/GMT.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: north of Svalbard."}, {"id": "9efb64d7-928b-492f-a957-7e2b6dfa694c", "title": "Light earthquake , 4 . 4 mag strikes near Uyuni in Bolivia", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-uyuni-in-bolivia-5/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Saturday, 97 km SSW of Uyuni, Bolivia (60 miles).\nThe earthquake occurred at a depth of 183.634 km (114 miles) below the earth’s surface.\nExact time and date of earthquake 18/05/24 / 2024-05-18 15:12:52 / May 18, 2024 @ 3:12 pm UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 97 km SSW of Uyuni, Bolivia."}, {"id": "ae878b02-0749-4b67-973e-fde6fa025a76", "title": "Light earthquake , 4 . 4 mag was detected near Maug Islands region , Northern Mariana Islands", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-maug-islands-region-northern-mariana-islands/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Sunday, Maug Islands region, Northern Mariana Islands (0 miles).\nEvent ids that are associated to the earthquake: us6000mxsd.\nId of event: us6000mxsd.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Maug Islands region, Northern Mariana Islands."}, {"id": "c6f481c4-8082-4f74-8c7d-978856081421", "title": "Light earthquake , 4 . 4 mag was detected near Lajes das Flores in Portugal", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-lajes-das-flores-in-portugal/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Tuesday, 120 km S of Lajes das Flores, Portugal (75 miles).\nEvent ids that are associated to the earthquake: us6000mv97.\nId of event: us6000mv97.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 120 km S of Lajes das Flores, Portugal."}, {"id": "227e252c-cc17-49d4-a511-bc182e9c7868", "title": "Light earthquake 4 . 4 mag , 195 km ENE of Lospalos , Timor Leste", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-195-km-ene-of-lospalos-timor-leste/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 195 km ENE of Lospalos, Timor Leste (121 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the event: us6000mv89.\nThe earthquake was roughly at a depth of 70.773 km (44 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 195 km ENE of Lospalos, Timor Leste."}, {"id": "a42ac24e-b26c-4a92-b140-1c3ef21e35a0", "title": "Light earthquake : M4 . 4 quake has struck near Labuan in Indonesia", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-labuan-in-indonesia/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 101 km SW of Labuan, Indonesia (63 miles) on Saturday.\nExact time and date of event in UTC/GMT: 27/04/24 / 2024-04-27 04:22:46 / April 27, 2024 @ 4:22 am.\nThe earthquake occurred at a depth of 35 km (22 miles).\nId of earthquake: us6000mw43.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 101 km SW of Labuan, Indonesia."}, {"id": "bd3e83dd-bc40-48cb-8541-88d1f2c26aed", "title": "Light earthquake , 4 . 4 mag was detected near Mid - Indian Ridge", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-mid-indian-ridge-11/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Friday, Mid-Indian Ridge (0 miles).\nEvent id: us6000mw35.\nIds that are associated to the earthquake: us6000mw35.\nIn the past 24 hours, there have been fourty, in the last 10 days fourty, in the past 30 days fourty and in the last 365 days fourty earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Mid-Indian Ridge."}, {"id": "18e5f1f6-d398-46c0-8481-e752f3a1b754", "title": "Light earthquake , 4 . 4 mag was detected near Ternate in Indonesia", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-ternate-in-indonesia-2/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Monday, 149 km NW of Ternate, Indonesia (93 miles).\nThe earthquake occurred at a depth of 47.282 km (29 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the event: us6000mwz8.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 149 km NW of Ternate, Indonesia."}, {"id": "dc37c5db-9de3-4d09-9f8d-d7db6276625d", "title": "Light earthquake , 4 . 4 mag has occurred near Sarangani in Philippines", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-sarangani-in-philippines-6/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Saturday, 235 km SSE of Sarangani, Philippines (146 miles).\nDate and time of earthquake in UTC/GMT: 27/04/24 / 2024-04-27 23:35:53 / April 27, 2024 @ 11:35 pm.\nThe earthquake occurred at a depth of 55.518 km (34 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 235 km SSE of Sarangani, Philippines."}, {"id": "751c26e3-10eb-4bbb-99a4-726004ef4213", "title": "Light earthquake 4 . 4 mag , 140 km S of Sarangani , Philippines", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-140-km-s-of-sarangani-philippines/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 140 km S of Sarangani, Philippines (87 miles) on Sunday.\nIds that are associated to the earthquake: us6000mwqq.\nThe epicenter was at a depth of 98.597 km (61 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 140 km S of Sarangani, Philippines."}, {"id": "13b2315b-e962-4286-8790-e50cf58af2f8", "title": "Light earthquake : M4 . 4 quake has struck near Hihifo in Tonga", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-hihifo-in-tonga-14/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 78 kilometers (48 miles) from Hihifo in Tonga on Thursday.\nEvent ids that are associated to the earthquake: us6000myzb.\nId of event: us6000myzb.\nThe epicenter was 78 km (48 miles) from Hihifo (c. 800 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 78 km ESE of Hihifo, Tonga."}, {"id": "c5ed8389-32af-4a77-b7c7-2d30e9636b9d", "title": "Light earthquake , 4 . 4 mag strikes near Koshima in Japan", "date": "2024-05-19 16:45", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-koshima-in-japan-2/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 103 km S of Koshima, Japan (64 miles) on Sunday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact time and date of earthquake 21/04/24 / 2024-04-21 00:27:28 / April 21, 2024 @ 12:27 am UTC/GMT.\nThe epicenter of the earthquake was roughly 37.717 km (23 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 103 km S of Koshima, Japan."}, {"id": "4b03fbeb-e55a-4141-8a38-a50f34ef84d7", "title": "Light earthquake , 4 . 4 mag strikes near the Fiji Islands", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-the-fiji-islands-46/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, south of the Fiji Islands (0 miles).\nExact location of earthquake, longitude -179.6961 West, latitude -23.7177 South, depth = 523.481 km.\nThe earthquake occurred at a depth of 523.481 km (325 miles) below the earth’s surface.\nIn the past 24 hours, there have been ten, in the last 10 days thirteen, in the past 30 days thirteen and in the last 365 days thirteen earthquakes of magnitude 3.0 or greater that have been detected nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: south of the Fiji Islands."}, {"id": "3e98079c-2d17-4938-923c-d0c23437bc22", "title": "Light earthquake , 4 . 5 mag has occurred near Challapata in Bolivia", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-has-occurred-near-challapata-in-bolivia-2/", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Thursday, 77 kilometers (48 miles) from Challapata in Bolivia.\nThe earthquake was roughly at a depth of 260.76 km (162 miles).\nClose country/countries that might be effected, Bolivia (c. 9 947 000 pop).\nEpicenter of the earthquake was 81 km (50 miles) from Colchani (c. 12 000 pop), 96 km (60 miles) from Uyuni (c. 10 300 pop), 78 km (49 miles) from Challapata (c. 8 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 77 km S of Challapata, Bolivia."}, {"id": "875d1af8-a660-4083-8057-dbfdf60d3262", "title": "Light earthquake , 4 . 4 mag was detected near Pondaguitan in Philippines", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-pondaguitan-in-philippines-8/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 64 kilometers (40 miles) from Pondaguitan in Philippines on Friday.\nThe epicenter of the earthquake was roughly 115.83 km (72 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us6000mzb2.\nId of event: us6000mzb2.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 64 km ESE of Pondaguitan, Philippines."}, {"id": "dc2bdb03-d643-455f-95fa-14afbd1e077f", "title": "Light earthquake , 4 . 4 mag has occurred near Shuanglong in China", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-shuanglong-in-china/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 50 kilometers (31 miles) from Shuanglong in China on Tuesday.\nThe epicenter of the earthquake was roughly 16.881 km (10 miles) below the earth’s surface.\nNearest cities/city/towns to hypocenter/epicentrum was Luocheng, Xunchang, Yibin (min 5000 pop).\nEpicenter of the event was 76 km (47 miles) from Yibin (c. 242 100 pop), 87 km (54 miles) from Luocheng (c. 73 600 pop), 85 km (53 miles) from Xunchang (c. 64 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 50 km WNW of Shuanglong, China."}, {"id": "e4787979-55ae-4984-92de-a69c1c9e2dcf", "title": "Light earthquake , 4 . 4 mag was detected near Hualien City in Taiwan", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-hualien-city-in-taiwan/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 40 kilometers (25 miles) from Hualien City in Taiwan on Saturday.\nExact time and date of earthquake 20/04/24 / 2024-04-20 00:35:11 / April 20, 2024 @ 12:35 am UTC/GMT.\nThe earthquake occurred at a depth of 16.639 km (10 miles).\nEpicenter of the earthquake was 40 km (25 miles) from Hualian (c. 350 500 pop), 65 km (40 miles) from Yilan (c. 94 200 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 40 km NE of Hualien City, Taiwan."}, {"id": "f4b0e1f6-75f6-4802-a650-34fda01a8af0", "title": "Light earthquake , 4 . 4 mag was detected near Hualien City in Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-hualien-city-in-taiwan-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, 23 kilometers (14 miles) from Hualien City in Taiwan.\nThe earthquake occurred at a depth of 13.111 km (8 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us6000mt0w.\nEarthquake epicenter was 24 km (15 miles) from Hualian (c. 350 500 pop), 68 km (42 miles) from Puli (c. 86 400 pop), 87 km (54 miles) from Lugu (c. 19 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 23 km S of Hualien City, Taiwan."}, {"id": "2fac78fb-754a-4d62-ad16-029138497d0a", "title": "Deadly storms leave Houston area reeling with power outages and health risks", "date": "2024-05-19 05:30", "url": "https://timesofindia.indiatimes.com/world/us/deadly-storms-leave-houston-area-reeling-with-power-outages-and-health-risks/articleshow/110243609.cms", "message": "Thunderstorms and hurricane-force winds tore through the city - decimating the facade of one brick building and leaving trees, debris and shattered glass on the streets.\nA tornado also touched down near the northwest Houston suburb of Cypress.More than a half-million homes and businesses in Texas remained without electricity by midday Saturday, according to PowerOutage.us.\nAnother 21,000 customers were also without power in Louisiana, where strong winds and a suspected tornado hit.\n\"You know we don't have any power.\n\"I could definitely tell that this storm was a little different,\" she said."}, {"id": "43325b46-f24f-4ff2-b2c3-0753c872c699", "title": "Light earthquake 4 . 5 mag , Izu Islands , Japan region", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-izu-islands-japan-region-10/", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Wednesday, Izu Islands, Japan region (0 miles).\nThe 4.5-magnitude earthquake has occurred at 15:35:33 / 3:35 pm (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the event: us6000mx9j.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Izu Islands, Japan region."}, {"id": "401e9efc-0183-4eec-8af0-b345de902810", "title": "Light earthquake , 4 . 4 mag strikes near Şalālah in Oman", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-salalah-in-oman/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 158 km SE of Şalālah, Oman (98 miles) on Sunday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent id: us6000muqs.\nIds that are associated to the earthquake: us6000muqs.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 158 km SE of Şalālah, Oman."}, {"id": "b5c042d4-67e7-450c-8a7e-41359ed351f8", "title": "Light earthquake 4 . 5 mag , 31 km ENE of Kainantu , Papua New Guinea", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-31-km-ene-of-kainantu-papua-new-guinea/", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Tuesday, 31 kilometers (19 miles) from Kainantu in Papua New Guinea.\nThe epicenter of the earthquake was roughly 64.809 km (40 miles) below the earth’s surface.\nClose country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nEvent epicenter was 85 km (53 miles) from Goroka (c. 18 500 pop), 32 km (20 miles) from Kainantu (c. 8 500 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 31 km ENE of Kainantu, Papua New Guinea."}, {"id": "119f14b9-d33e-477f-aa3f-ae35f14d1cfd", "title": "Light earthquake , 4 . 4 mag has occurred near Massawa in Eritrea", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-massawa-in-eritrea/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Friday, 27 kilometers (17 miles) from Massawa in Eritrea.\nEvent ids that are associated to the earthquake: us7000md3v.\nId of event: us7000md3v.\nEpicenter of the event was 93 km (58 miles) from Asmara (c. 563 900 pop), 28 km (17 miles) from Massawa (c. 23 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 27 km NE of Massawa, Eritrea."}, {"id": "01edff03-658e-491a-b79a-ff475484bc48", "title": "Light earthquake : M4 . 4 quake has struck near Hualien City in Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-hualien-city-in-taiwan-3/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 30 kilometers (19 miles) from Hualien City in Taiwan on Tuesday.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nNearby country/countries, Taiwan (c. 22 894 000 pop) (That might be effected).\nEarthquake epicenter was 31 km (19 miles) from Hualian (c. 350 500 pop), 76 km (47 miles) from Puli (c. 86 400 pop), 92 km (57 miles) from Lugu (c. 19 600 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 30 km S of Hualien City, Taiwan."}, {"id": "7c6da2d2-b123-46c0-bac6-21d93eee8806", "title": "Light earthquake , 4 . 4 mag strikes near Burica in Panama", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-burica-in-panama/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Monday, 61 kilometers (38 miles) from Burica in Panama.\nDate and time of earthquake in UTC/GMT: 29/04/24 / 2024-04-29 09:00:06 / April 29, 2024 @ 9:00 am.\nThe earthquake occurred at a depth of 36.491 km (23 miles).\nCountry/countries that might be effected, Panama (c. 3 411 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 61 km SE of Burica, Panama."}, {"id": "a02a3166-0525-45dd-818c-3c21e505d4a6", "title": "Light earthquake 4 . 5 mag , 12 km ESE of San Lucas , Mexico", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-12-km-ese-of-san-lucas-mexico/", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 12 kilometers (7 miles) from San Lucas in Mexico on Tuesday.\nExact location of earthquake, -100.6749° West, 18.5597° North, depth 68.552 km.\nIds that are associated to the earthquake: us6000mwy2.\nThe earthquake occurred at a depth of 68.552 km (43 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 12 km ESE of San Lucas, Mexico."}, {"id": "d2552141-ae4c-4185-aa3f-e8a540653e8f", "title": "Light earthquake , 4 . 5 mag strikes near Takedamachi in Japan", "date": "2024-05-19 08:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-strikes-near-takedamachi-in-japan/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Wednesday, 8 kilometers (5 miles) from Takedamachi in Japan.\nExact location of earthquake, longitude 131.4384 East, latitude 33.0408 North, depth = 104.653 km.\nThe earthquake occurred at a depth of 104.653 km (65 miles).\nThe 4.5-magnitude earthquake was detected at 19:34:44 / 7:34 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 8 km NNE of Takedamachi, Japan."}, {"id": "f8bd19d5-3c1c-4e7e-a077-d0deccf7a36d", "title": "Light earthquake 4 . 4 mag , 24 km S of Hualien City , Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-24-km-s-of-hualien-city-taiwan/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 24 kilometers (15 miles) from Hualien City in Taiwan on Monday.\nExact location of earthquake, longitude 121.5757 East, latitude 23.757 North, depth = 13.842 km.\nThe earthquake occurred at a depth of 13.842 km (9 miles) below the earth’s surface.\nEpicenter of the earthquake was 25 km (15 miles) from Hualian (c. 350 500 pop), 94 km (59 miles) from Nantou (c. 105 700 pop), 66 km (41 miles) from Puli (c. 86 400 pop), 93 km (58 miles) from Zhongxing New Village (c. 25 500 pop), 84 km (52 miles) from Lugu (c. 19 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 24 km S of Hualien City, Taiwan."}, {"id": "8ea4c5c7-52ae-4ac8-8432-8f27bd21d229", "title": "Light earthquake 4 . 4 mag , 20 km NNE of Hualien City , Taiwan", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-20-km-nne-of-hualien-city-taiwan/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Friday, 20 kilometers (12 miles) from Hualien City in Taiwan.\nIds that are associated to the earthquake: us6000mu4c.\nExact location of earthquake, 121.6577° East, 24.1595° North, depth 37.395 km.\nEpicenter of the earthquake was 21 km (13 miles) from Hualian (c. 350 500 pop), 67 km (42 miles) from Yilan (c. 94 200 pop), 73 km (45 miles) from Puli (c. 86 400 pop), 89 km (55 miles) from Daxi (c. 84 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 20 km NNE of Hualien City, Taiwan."}, {"id": "038087bb-85f9-4f92-adfd-f8704d0ae5b4", "title": "BMKG prepares joint expedition to explore earthquake zones", "date": "2024-05-19 10:15", "url": "https://en.antaranews.com/news/313779/bmkg-prepares-joint-expedition-to-explore-earthquake-zones", "message": "BMKG prepares joint expedition to explore earthquake zonesJakarta (ANTARA) - The Meteorology, Climatology, and Geophysics Agency (BMKG) has begun preparing expeditions to investigate seismic phenomena in the megathrust zones in Indonesia, the agency's head, Dwikorita Karnawati, said on Sunday.The expeditions will be conducted by the BMKG and the National Research and Innovation Agency (BRIN) for research and data collection.Karnawati said the expeditions will explore all megathrust zones in Indonesia: Sunda Subduction, Banda Subduction, Sulawesi Subduction, Philippine Sea Plate Subduction, Maluku Sea Plate Subduction, and North Papua Subduction.\n\"We've begun preparing everything, including research, training, and development centers, to create earthquake and tsunami models,\" she said.BMKG Head of Public Meteorology, Andri Ramdhani, said that the expeditions will begin in Batam, Riau Islands, and travel through several cities before reaching Bitung, North Sulawesi, on August 25.The research will involve a series of long voyages using OceanX's OceanXplorer ship.OceanX is a global non-profit organization in the field of marine exploration that collaborates with the Coordinating Ministry for Maritime Affairs and Investment to research Indonesian seas.The expeditions will not only investigate earthquake phenomena but also observe the interaction of air and sea in Indonesian waters.The target is areas that are identified as locations for phenomena influenced by Indonesia's weather and climate variability, such as the Madden-Julian Oscillation (MJO), El Nino Southern Oscillation (ENSO), and the Indian Ocean Dipole (IOD).BMKG considers this research exploration crucial because natural and sometimes periodic changes in air and ocean circulation, volcanic eruptions, and other factors influence climate variability.Furthermore, only 19 percent of Indonesia's vast seas (over 70 percent of the country's area) have been mapped, highlighting the need for exploration, as Coordinating Minister for Maritime Affairs and Investment Luhut Binsar Pandjaitan stated in a recent coordination meeting.\n\"Preparations with OceanX are complete.\nThe BMKG is also bringing equipment to measure relevant parameters and continues coordination, especially with the Coordinating Ministry for Maritime Affairs and Investment as the leading sector,\" said Ramdhani.\nTranslator: M. Riezko Bima Elko Prasetyo, KatrianaEditor: Anton SantosoCopyright © ANTARA 2024"}, {"id": "fc00f239-22d7-4cdc-9c89-398c81bcce41", "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm", "date": "2024-05-19 03:30", "url": "https://lasvegassun.com/news/2024/may/18/hot-weather-poses-new-risk-as-thousands-remain-wit/", "message": "Hot weather poses new risk as thousands remain without power after deadly Houston stormKaren Warren / Houston Chronicle via Associated PressHOUSTON — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.\n“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed."}, {"id": "7db7a7b9-2dc7-41e5-8301-98aa69365e89", "title": "Light earthquake , 4 . 4 mag was detected near Loreto in Mexico", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-loreto-in-mexico-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 68 kilometers (42 miles) from Loreto in Mexico on Saturday.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nThe epicenter was 69 km (43 miles) from Loreto (c. 11 200 pop).\nIn the past 24 hours, there have been four, in the last 10 days nineteen, in the past 30 days nineteen and in the last 365 days nineteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 68 km ENE of Loreto, Mexico."}, {"id": "87ea8583-9478-4e07-ad68-d71fb41a8cd9", "title": "Light earthquake : M4 . 4 quake has struck near Hualien City in Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-hualien-city-in-taiwan/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 30 kilometers (19 miles) from Hualien City in Taiwan on Monday.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nNearby country/countries that might be effected, Taiwan (c. 22 894 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 30 km SSW of Hualien City, Taiwan."}, {"id": "e81c78d3-46c2-41a8-a3a6-9937b5a57bf1", "title": "Light earthquake , 4 . 4 mag strikes near Hualien City in Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-hualien-city-in-taiwan/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, 26 kilometers (16 miles) from Hualien City in Taiwan.\nThe 4.4-magnitude earthquake was detected at 16:01:26 / 4:01 pm (local time epicenter).\nThe epicenter of the earthquake was roughly 7.732 km (5 miles) below the earth’s surface.\nLeave a comment or report about activity, shaking and damage at your home, country and city.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 26 km S of Hualien City, Taiwan."}, {"id": "6dc54910-1065-43dd-9e98-454380cbdcc2", "title": "Light earthquake 4 . 4 mag , 29 km ENE of Hachinohe , Japan", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-29-km-ene-of-hachinohe-japan/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 29 kilometers (18 miles) from Hachinohe in Japan on Friday.\nThe earthquake was roughly at a depth of 66.692 km (41 miles).\nExact location of earthquake, longitude 141.8258 East, latitude 40.597 North, depth = 66.692 km.\nEpicenter of the event was 95 km (59 miles) from Aomori Shi (c. 298 400 pop), 30 km (18 miles) from Hachinohe (c. 239 000 pop), 92 km (57 miles) from Mutsu (c. 49 200 pop), 38 km (24 miles) from Misawa (c. 42 800 pop), 62 km (38 miles) from Ichinohe (c. 15 800 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 29 km ENE of Hachinohe, Japan."}, {"id": "9b71b253-a0f1-41a3-81da-49b27316003b", "title": "Light earthquake : M4 . 4 quake has struck near Hualien City in Taiwan", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-hualien-city-in-taiwan-4/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Sunday, 17 kilometers (11 miles) from Hualien City in Taiwan.\nThe earthquake was roughly at a depth of 39.701 km (25 miles).\nThe epicenter was 18 km (11 miles) from Hualian (c. 350 500 pop), 72 km (44 miles) from Yilan (c. 94 200 pop), 75 km (47 miles) from Puli (c. 86 400 pop), 95 km (59 miles) from Daxi (c. 84 500 pop).\nNearby country/countries, Taiwan (c. 22 894 000 pop) (That might be effected).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 17 km NNE of Hualien City, Taiwan."}, {"id": "8851ae3d-a7e3-4a64-8391-7699f2dbf8aa", "title": "Light earthquake 4 . 4 mag , 33 km ENE of Santa Maria , Philippines", "date": "2024-05-19 15:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-33-km-ene-of-santa-maria-philippines/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Friday, 33 kilometers (21 miles) from Santa Maria in Philippines.\nThe earthquake was roughly at a depth of 79.657 km (49 miles).\nExact time and date of earthquake 19/04/24 / 2024-04-19 11:05:00 / April 19, 2024 @ 11:05 am UTC/GMT.\nEpicenter of the event was 50 km (31 miles) from Bislig (c. 67 600 pop), 80 km (50 miles) from Monkayo (c. 51 400 pop), 84 km (52 miles) from Compostela (c. 42 600 pop), 86 km (54 miles) from Veruela (c. 18 100 pop), 75 km (46 miles) from Trento (c. 15 900 pop), 83 km (52 miles) from Bunawan (c. 15 500 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 33 km ENE of Santa Maria, Philippines."}, {"id": "36941224-f7c2-4bd1-af03-fa9123416006", "title": "Light earthquake 4 . 4 mag , 26 km SSW of Hualien City , Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-26-km-ssw-of-hualien-city-taiwan/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Monday, 26 kilometers (16 miles) from Hualien City in Taiwan.\nThe earthquake occurred at a depth of 10.478 km (7 miles) below the earth’s surface.\nThe epicenter was 27 km (17 miles) from Hualian (c. 350 500 pop), 92 km (57 miles) from Nantou (c. 105 700 pop), 64 km (39 miles) from Puli (c. 86 400 pop), 91 km (56 miles) from Zhongxing New Village (c. 25 500 pop), 80 km (50 miles) from Lugu (c. 19 600 pop).\nNearby country/countries, Taiwan (c. 22 894 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 26 km SSW of Hualien City, Taiwan."}, {"id": "99affa53-b0e5-42f2-8500-10ade4344b37", "title": "Light earthquake : M4 . 5 quake has struck near Puerto El Triunfo in El Salvador", "date": "2024-05-19 01:00", "url": "https://www.earthquakenewstoday.com/2024/05/18/light-earthquake-m4-5-quake-has-struck-near-puerto-el-triunfo-in-el-salvador-7/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Wednesday, 46 kilometers (29 miles) from Puerto El Triunfo in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 61.775 km (38 miles).\nCountry/countries that might be effected, El Salvador (c. 6 052 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 46 km SSW of Puerto El Triunfo, El Salvador."}, {"id": "f666551c-4472-4388-9bd0-a03465c9b025", "title": "Light earthquake , 4 . 4 mag strikes near Hualien City in Taiwan", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-hualien-city-in-taiwan-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Wednesday, 12 kilometers (7 miles) from Hualien City in Taiwan.\nThe epicenter was at a depth of 10 km (6 miles).\nCountry/countries that might be effected, Taiwan (c. 22 894 000 pop).\nEvent epicenter was 12 km (7 miles) from Hualian (c. 350 500 pop), 91 km (57 miles) from Yilan (c. 94 200 pop), 76 km (47 miles) from Puli (c. 86 400 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 12 km ESE of Hualien City, Taiwan."}, {"id": "fb66f539-9896-46dc-9cbd-c754ad95d58a", "title": "Light earthquake : M4 . 4 quake has struck near Isangel in Vanuatu", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-isangel-in-vanuatu-7/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Thursday, 89 kilometers (55 miles) from Isangel in Vanuatu.\nThe epicenter was at a depth of 73.236 km (46 miles).\nEpicenter of the event was 89 km (55 miles) from Isangel (c. 1 400 pop).\nClose country/countries, Vanuatu (c. 222 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 89 km WNW of Isangel, Vanuatu."}, {"id": "d1c38dd5-d3eb-40a1-b057-b3017b28831d", "title": "Light earthquake , 4 . 4 mag has occurred near Dao in Philippines", "date": "2024-05-19 09:45", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-dao-in-philippines/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 3 kilometers (2 miles) from Dao in Philippines on Tuesday.\nExact time and date of earthquake 23/04/24 / 2024-04-23 14:29:59 / April 23, 2024 @ 2:29 pm UTC/GMT.\nThe earthquake was roughly at a depth of 35.953 km (22 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 3 km W of Dao, Philippines."}, {"id": "bed242b5-182a-4a42-87c6-ad43ef89e3f2", "title": "Light earthquake , 4 . 5 mag was detected near Cantilan in Philippines", "date": "2024-05-19 22:00", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-5-mag-was-detected-near-cantilan-in-philippines-3/", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Sunday, 10 kilometers (6 miles) from Cantilan in Philippines.\nThe earthquake occurred at a depth of 70.859 km (44 miles) below the earth’s surface.\nNearby country/countries, Philippines (c. 99 900 000 pop) (That might be effected).\nEarthquakes 4.0 to 5.0 are often felt, but only causes minor damage.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 10 km ENE of Cantilan, Philippines."}, {"id": "6f4a59ab-1636-4e41-ada1-c1f5d423cb5c", "title": "Light earthquake , 4 . 4 mag strikes near Saladoblanco in Colombia", "date": "2024-05-19 11:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-saladoblanco-in-colombia/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Sunday, 3 kilometers (2 miles) from Saladoblanco in Colombia.\nThe earthquake was roughly at a depth of 12.009 km (7 miles).\nThe epicenter was 80 km (50 miles) from Popayán (c. 258 700 pop), 65 km (40 miles) from Florencia (c. 130 300 pop), 19 km (12 miles) from Pitalito (c. 53 700 pop), 71 km (44 miles) from Belalcazar (c. 31 800 pop), 49 km (30 miles) from Garzón (c. 29 500 pop), 44 km (27 miles) from La Plata (c. 19 300 pop).\nNearby country/countries, Colombia (c. 47 790 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 3 km NNE of Saladoblanco, Colombia."}, {"id": "f2ec896d-259d-4545-985e-5503098ff93d", "title": "Light earthquake : M4 . 4 quake has struck near Lárdos in Greece", "date": "2024-05-19 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-m4-4-quake-has-struck-near-lardos-in-greece-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Monday, 64 kilometers (40 miles) from Lárdos in Greece.\nAll ids that are associated to the event: us6000mt19.\nThe epicenter was at a depth of 52.355 km (33 miles).\nNearby country/countries, Greece (c. 11 000 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 64 km SE of Lárdos, Greece."}, {"id": "db908701-caad-4470-a709-08edc60a476f", "title": "Fresh floods kill 66 in northern Afghanistan : provincial official", "date": "2024-05-19 16:00", "url": "https://thepeninsulaqatar.com/article/19/05/2024/fresh-floods-kill-66-in-northern-afghanistan-provincial-official", "message": "Afghan residents clean debris and salvage their belongings after flash floods following heavy rainfall at a damaged house in Firozkoh, Ghor province on May 18, 2024.\nPhoto by AFPAFPKabul: Fresh floods killed 66 people in Faryab province in northern Afghanistan, a provincial official said Sunday, in the latest deadly flooding to hit the country.\nHeavy floods in multiple districts of Faryab province on Saturday night \"resulted in human and financial losses,\" Asmatullah Muradi, spokesman for the Faryab governor, said in a statement.\nThe floods came a day after provincial police said more than 50 people were killed in flash flooding in the western province of Ghor.\nJust over a week ago, more than 300 people were killed in flash flooding in northern Baghlan province, according to the UN World Food Programme and Taliban officials."}, {"id": "fbe92bab-0cfd-431c-a409-b2d9af74f433", "title": "Fresh floods kill 66 in northern Afghanistan : provincial official", "date": "2024-05-19 14:30", "url": "https://www.bssnews.net/international/190023", "message": "KABUL, May 19, 2024 (BSS/AFP) - Fresh floods killed 66 people in Faryabprovince in northern Afghanistan, a provincial official said Sunday, in thelatest deadly flooding to hit the country.\nHeavy floods in multiple districts of Faryab province on Saturday night\"resulted in human and financial losses,\" Asmatullah Muradi, spokesman forthe Faryab governor, said in a statement.\n\"Due to the floods 66 people were killed,\" he said, adding that at least fivepeople were injured and others were still missing.\nThe floods came a day after provincial police said more than 50 people werekilled in flash flooding in the western province of Ghor.\nJust over a week ago, more than 300 people were killed in flash flooding innorthern Baghlan province, according to the UN World Food Programme andTaliban officials."}, {"id": "78ec079f-9be5-48b1-8d52-8f41a352ed86", "title": "At least 66 killed as fresh floods devastate northern Afghanistan", "date": "2024-05-19 13:45", "url": "https://www.dailysabah.com/world/asia-pacific/at-least-66-killed-as-fresh-floods-devastate-northern-afghanistan", "message": "At least 66 people were killed as fresh floods devastated northern Afghanistan's Faryab province, a provincial official said Sunday.\nHundreds of people have died in separate flash floods this month that have also swamped farmland in a country where 80% of the population depends on agriculture to survive.\n\"Due to the floods 66 people were killed,\" he said, adding that at least five people were injured and others were still missing.\nThe floods came a day after provincial police said more than 50 people were killed in flash flooding in the western province of Ghor.\nSpring floods are not uncommon in Afghanistan, a country of more than 40 million people, but above-average rainfall this year has sparked devastating flash flooding."}, {"id": "46f9177d-12b7-4d72-97e6-2195d3e5fa1d", "title": "Fresh floods kill 66 in northern Afghanistan", "date": "2024-05-19 14:45", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374913.html", "message": "Fresh floods killed 66 people in Faryab province in northern Afghanistan, a provincial official said Sunday, in the latest deadly flooding to hit the country.\nHundreds of people have died in separate flash floods this month that have also swamped farmland in a country where 80 percent of the population depends on agriculture to survive.\nThe floods came a day after provincial police said more than 50 people were killed in flash flooding in the western province of Ghor.\nResidents in Baghlan, Ghor, Faryab and other affected regions found themselves without shelter, stripped of their homes and livelihoods.\nSpring floods are not uncommon in Afghanistan, a country of more than 40 million people, but above-average rainfall this year has sparked devastating flash flooding."}, {"id": "f07eaaf0-50e0-4f6f-95f6-7c588de2f7fa", "title": "At least 66 dead as new floods hit Afghanistan Faryab province | Floods News", "date": "2024-05-19 17:00", "url": "https://www.aljazeera.com/news/2024/5/19/at-least-66-dead-as-new-floods-hit-afghanistans-faryab-province", "message": "Fresh floods have killed at least 66 people in Faryab province in northern Afghanistan, says a provincial official, in the latest deadly string of disasters to hit the country in recent days.\nHeavy floods in multiple districts of Faryab province on Saturday night “resulted in human and financial losses”, Asmatullah Moradi, spokesman for the Faryab governor, said in a statement on Sunday.\n“Due to the floods 66 people were killed,” he said, adding that at least five people were injured and several others missing.\nAnother 18 people had also died in floods in the same province on Friday, Moradi added.\nThe latest disaster in Faryab came just a day after provincial authorities said 50 people were killed in flash flooding just south of the province in Ghor."}, {"id": "8120d5fe-9dc5-4609-892c-0a5f65d6e275", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 21:15", "url": "https://www.quesnelobserver.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "a91cc443-0a8d-4047-99c3-774feac9921f", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 21:15", "url": "https://www.interior-news.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "358757aa-957e-430d-918b-b75097ce088f", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 21:15", "url": "https://www.burnabynow.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "5b854f8a-b9f7-4541-ace1-d33bf44e22e7", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 21:15", "url": "https://www.sookenewsmirror.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "c7742e05-c379-448d-aa60-cdea4d2b152d", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 22:00", "url": "https://www.pqbnews.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "6b905e66-790c-477d-a18e-e2850d5466a0", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 22:00", "url": "https://www.cowichanvalleycitizen.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "62cd1b60-4289-4ce4-ba16-df5cb4ad281e", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 22:00", "url": "https://www.nanaimobulletin.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "17f26a0b-1a59-43b4-a02a-f6a0bcc2d310", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 23:00", "url": "https://www.wltribune.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "4c6d360c-1ad0-4085-8d23-34614b331958", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 23:00", "url": "https://www.delta-optimist.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "4bb6bdb7-d861-473f-825f-758870a013ec", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 23:00", "url": "https://www.richmond-news.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "b810e781-7242-4f03-bc04-4d3caaa35ed9", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-19 23:30", "url": "https://www.terracestandard.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "681671eb-3500-4674-92a0-c2bd06078117", "title": "Severe Thunderstorm Watch in Broward , Miami - Dade – NBC 6 South Florida", "date": "2024-05-19 19:45", "url": "https://www.nbcmiami.com/news/local/severe-weather-sunday-south-florida/3314547/", "message": "A Severe Thunderstorm Watch was issued for South Florida, in effect until 8 p.m. Sunday evening.\nSign up for NBC South Florida newsletters.\nOn Sunday evening, a Severe Thunderstorm Warning was issued for Palm Beach County until 6 p.m.A Severe Thunderstorm Watch has been issued for the east coast of Florida...including Broward & Miami-Dade counties...until 7 p.m.\nAfternoon storms will develop, producing a hail and wind threat to the watch area.\npic.twitter.com/GRJr19coP4 — Ryan Phillips - NBC6 (@RyanNBC6) May 19, 2024The overall coverage of storms were likely to remain east of the Florida Turnpike with storm motion carrying storms into the Atlantic before sunset."}, {"id": "bd47b205-d862-4f18-8cca-9f9b7ce3f4a5", "title": "Thousands march in Cork town to demand flood protection measures", "date": "2024-05-19 12:45", "url": "https://www.irishexaminer.com/news/munster/arid-41398336.html", "message": "Thousands have marched through a Cork town devastated by flooding last October to \"scream out\" for interim flood protection measures before the next storm season.\nOrganisers of the rally through Midleton in East Cork, the Midleton and East Cork Flood Protection Group, said they hope the event sends a clear message to government that they want and need urgent action over the coming months to protect homes, businesses and lives pending the delivery of the €50m Midleton flood relief scheme.\nThey need to start doing some of these interim works this summer.\nIn addition, Individual Property Protection (IPP) “is being considered” as part of the overall suite of measures for Midleton, the OPW said.\n“A decision on this is expected shortly, so IPP can be rolled out by Cork County Council on a phased and targeted basis,” a spokesperson said."}, {"id": "60fc142b-57b7-490d-9cfe-7f59797c8e79", "title": "Hikurangi Subduction Zone : The burning question about NZ biggest quake - maker", "date": "2024-05-19 02:30", "url": "https://www.nzherald.co.nz/nz/hikurangi-subduction-zone-the-burning-question-about-nzs-biggest-quake-maker/TPYTCPZLIVF3XPGHB4DUP6U2NM/", "message": "An explanation of the slow-slip earthquakes associated with New Zealand's Hikurangi Subduction Zone.\nNow, scientists have edged closer to answering perhaps the most important question about our big-risk Hikurangi Subduction Zone: what controls the system’s suspected release valve.\nThe general location of the offshore part of the Hikurangi Subduction Zone.\nEach of those geological profiles and everything in between can be found within the Hikurangi Subduction Zone - explaining why such a large range of earthquake types happen on it.\nSpecifically, they tend to happen within areas where the subduction zone is transitioning from being \"stuck\" beneath the southern North Island to an area where the subduction zone is \"creeping\" further north, around Gisborne and Hawke's Bay."}, {"id": "d954c046-2bd8-4239-a0e4-c62a90722fc9", "title": "Fort Nelson evacuation order update", "date": "2024-05-19 18:00", "url": "https://energeticcity.ca/2024/05/19/fort-nelson-evacuation-order-update/", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "47b4a1d7-cf64-4c06-9e11-e80c7f9cc7eb", "title": "What the outlook for weather headed into Memorial Day weekend ? ", "date": "2024-05-19 19:15", "url": "https://www.yahoo.com/news/whats-outlook-weather-headed-memorial-174942795.html", "message": "The weather service says thunderstorms are likely Sunday afternoon and overnight Sunday, with gusty winds and up to a half-inch of rain.\nTuesday will bring the week's strongest potential for severe weather, according to weather service forecast guidance.\nThrough April, weather service data shows, Des Moines received 7.26 inches or rain, almost an inch-and-a-half shy of the 8.61 inches that is normal for the period.\nThe normal rainfall for the month is 4.77 inches.\nThis article originally appeared on Des Moines Register: Severe weather possible this week, National Weather Service says"}, {"id": "8e9111d2-a43e-4d2d-95b5-1493a70a2abe", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 19:30", "url": "https://www.squamishchief.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "f7a9615d-e18c-4755-9ece-cf51e0f2f8d5", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 20:00", "url": "https://www.piquenewsmagazine.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "7c9a0cfe-8935-4b53-90ea-75d9446b98a3", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 20:15", "url": "https://www.bowenislandundercurrent.com/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "0d79392d-b4d4-41ab-82fb-719961941486", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 19:30", "url": "https://www.coastreporter.net/bc-news/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire-8768895", "message": "FORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFORT NELSON, B.C.\n— The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "0b26b9f3-58a1-4c30-9115-1a33d5943afa", "title": "Multiple homes confirmed destroyed in Fort Nelson , B . C ., wildfire", "date": "2024-05-19 19:00", "url": "https://www.cbc.ca/news/canada/british-columbia/homes-destroyed-fort-nelson-wildfire-1.7209035", "message": "Officials have confirmed that multiple homes have been damaged, and some destroyed, as a wildfire west of Fort Nelson, B.C., continues to burn Sunday.\nIt resulted in more than 4,700 people being placed on evacuation order from the town and the nearby Fort Nelson First Nation.\nThe west flank of the Parker Lake fire near Fort Nelson, B.C., is pictured on May 13.\nWATCH | Bowinn Ma addresses reports of property damage in Fort Nelson: No new structural losses since first days of Fort Nelson wildfire, minister says Duration 0:28 Emergency Management Minister Bowinn Ma addressed concerns that buildings have been lost to the Parker Lake wildfire near Fort Nelson, B.C.\nFort Nelson is in the province's far northeast, about 1,000 kilometres north of Vancouver and about 800 kilometres northwest of Edmonton."}, {"id": "be35b4a3-6f3b-4012-9c80-de6fb6402daa", "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm - American Press", "date": "2024-05-19 17:00", "url": "https://www.americanpress.com/2024/05/18/hot-weather-poses-new-risk-as-thousands-remain-without-power-after-deadly-houston-storm/", "message": "“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\n“It felt terrifying.”STATE AND FEDERAL RECOVERY ASSISTANCE ON THE WAYIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "4700632c-4b13-441c-9096-ca202aad2b6a", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire", "date": "2024-05-19 23:00", "url": "https://energeticcity.ca/2024/05/19/northern-rockies-regional-municipality-says-four-homes-lost-in-b-c-wildfire/", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "ae595bf3-e9ba-43f2-897c-c8e0c5f08bc6", "title": "Alberta wildfire information update : May 18 , 3 p . m . ", "date": "2024-05-19 01:45", "url": "https://www.alberta.ca/release.cfm?xID=90383863A1020-A048-0816-6F994A9EE3B2CBC7", "message": "A more accurate scan of the wildfire perimeter has resulted in a reduced area – 19,582 hectares – affected by wildfire.\nCurrent wildfire information is available on the Alberta Wildfire Status Dashboard.\nEducationAlberta Emergency AlertsFor up-to-the-minute Alberta Emergency Alert information visit: Alberta Emergency Alert.\nAlbertans are encouraged to download the Alberta Emergency Alert mobile app which immediately pushes all alerts out to subscribers.\nWildfire UpdatesMinister of Forestry and Parks Todd Loewen will provide a weekly briefing with officials from Alberta Wildfire and the Alberta Emergency Management Agency on Thursday mornings at 9:30 a.m.MultimediaRelated information"}, {"id": "aadb9bc8-6f40-4012-aede-48fc8251042a", "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm", "date": "2024-05-19 06:45", "url": "https://www.thesunchronicle.com/news/nation_world/hot-weather-poses-new-risk-as-thousands-remain-without-power-after-deadly-houston-storm/article_2da2e4ef-1fda-5e57-8c62-c489e7b3e4fd.html", "message": "As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and rising Texas heat"}, {"id": "ae27fb3b-1806-46df-9366-d7546579ea3e", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 21:15", "url": "https://isp.netscape.com/news/story/0001/20240519/4d98b8c59a10227e8891d6530f583cf1", "message": "Power restored to most affected by deadly Houston storm, with the rest by WednesdayHOUSTON (AP) — Houston area residents affected by deadly storms last week received some good news as officials said power had been restored Sunday to a majority of the hundreds of thousands who had been left in the dark and without air conditioning amid hot and humid weather.\nBy Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nMore than 289,000 homes and businesses in Texas remained without electricity Sunday evening, mostly in the Houston area.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nTwo other large school districts in the the Houston area — Cypress-Fairbanks and Spring Branch — planned to be closed."}, {"id": "3198f296-db3a-4e03-8ba5-93ea4184e0b9", "title": "Houston surveys destruction from deadly storms and races to restore power as Southeast and Gulf Coast face flood threat", "date": "2024-05-19 01:15", "url": "https://ktvz.com/cnn-weather-environment/2024/05/18/houston-surveys-destruction-from-deadly-storms-and-races-to-restore-power-as-southeast-and-gulf-coast-face-flood-threat-2/", "message": "My condolences go out to the families that lost a loved one during yesterday’s severe weather event,” Gonzalez said.\nThe damaging storms will be followed by high temperatures in the 90s through the weekend and beyond while many are without air conditioning.\n“Isolated to scattered severe thunderstorms appear possible across portions of the Southeast and Carolinas on Saturday, and parts of the Upper Midwest,” the center said.\nThe greatest chances for severe weather are across parts of Nebraska and Kansas, with a slight level 2 of 5 risk of severe thunderstorms issued by the Storm Prediction Center.\nBy the end of the weekend, thunderstorm chances will diminish for most of the Southeast and Mid-Atlantic, the weather service said."}, {"id": "5e5ff0d5-c9a9-4304-999f-e8f98b2a8d36", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 03:00", "url": "https://www.edp24.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "a6449e1e-8654-4f82-9b9e-76b6cdc5305c", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.thetelegraphandargus.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "1a8115e7-b6ad-4800-9179-f6eacff51b1c", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.echo-news.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "fcef22dc-24c8-47b9-a773-75d573c87fd0", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 03:00", "url": "https://www.lancashiretelegraph.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "56da1318-7d3a-415e-9073-03e077ee2ebe", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 02:30", "url": "https://www.ipswichstar.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "e5c2857b-eb32-4391-ac59-12f0d15ba4f5", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.theboltonnews.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "cc5016a2-6a64-43a2-b41c-4ce8d4c96d5e", "title": "Rogers launches AI - powered cameras to detect wildfires in B . C . ", "date": "2024-05-19 21:15", "url": "https://www.theglobeandmail.com/business/article-rogers-launches-ai-powered-cameras-to-detect-wildfires-in-bc/", "message": "The cameras, which look like fivepin bowling balls, faced their first test on the BC Wildfire Service’s front lines.\nIn the next few weeks, Rogers will set up cameras in three more B.C.\n“We’re excited about the potential of this partnership and the opportunity it presents to help mitigate wildfire risk in B.C.\nRogers is paying the bill, along with the cost of connecting the cameras to its network and SpaceX satellites and supplying firefighters with satellite phones.\n“We invested in wildfire detection technology that, combined with Rogers 5G and satellite technology, will protect communities from the devastating impact of climate change,” said Tony Staffieri, chief executive officer at Rogers, at the company’s recent annual meeting."}, {"id": "c2628813-3eb5-4985-8a7a-a4a4760c1b06", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 03:00", "url": "https://www.lbc.co.uk/business/7932d67c52ed44c8a65f0fb4c96b898f/", "message": "Children are taking centre stage at this year’s Chelsea Flower Show, which is being billed as “one of the greenest” in years with a focus on sustainability and the climate crisis.\nYoungsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "40a24674-d710-4d73-9cb7-52c864b21172", "title": "From Florida floods to Idaho desert : Understanding impacts of flood damage on vehicle batteries", "date": "2024-05-19 22:00", "url": "https://www.eastidahonews.com/2024/05/from-florida-floods-to-idaho-desert-understanding-impacts-of-flood-damage-on-vehicle-batteries/", "message": "Electric vehicles offer some clear advantages over gasoline-power cars including zero emissions and lower operation and maintenance costs.\nOf those, 36 of the impacted EV batteries caught fire due to thermal runaway, an uncontrollable increase in temperature that can occur in damaged batteries.\nThey studied 10 vehicle battery packs.\nTanim and his colleagues will continue examining the impacts of flooding on vehicle batteries.\nThey are building an immersion test facility for testing EVs and battery packs at INL."}, {"id": "eca03cf7-4ccd-4ea8-9997-7bb51af20161", "title": "Texas Will Feel The Wrath of La Niña , Starting This Summer", "date": "2024-05-19 19:45", "url": "https://kissfm969.com/ixp/190/p/la-nina-return/", "message": "The eastward winds of El Niño are fading, but a terrible little girl we know as La Niña is brewing on the horizon.\nWith El Niño, the temperatures in the eastern Pacific Ocean drop by half a degree Celsius; with El Niña, the inverse holds true.\nThe key difference between El Niño and La Niña in how it impacts Texas is that the former brings about a wet winter, the latter brings warmer, drier weather.\nThere may be a period of neutral weather, but we can expect a rapid cycle over to La Niña by June or August at the latest.\nAll aboard the Somewhat Small Texas Panhandle Towns tour!"}, {"id": "7734ab7e-bae0-4832-93b5-d65de0138143", "title": "Boston artificial land vulnerable to climate change , harder to protect", "date": "2024-05-19 12:30", "url": "https://www.bostonglobe.com/2024/05/19/science/boston-sea-level-risks-artificial-land-fill-climate-change/", "message": "Artificial land is generally lower in elevation, and it cannot always hold as much weight as natural land without subsiding, Kunkel said.\nThat means the artificial land is both more vulnerable to sea level rise and more difficult to protect from flooding with heavy sea walls.\n(Humanity still has time to reach net zero global emissions by 2050; if we do, sea level rise would likely be less.)\nAdvertisementIn the 19th century, techniques changed; developers began to build stone sea walls and fill behind that point until it was above high tide.\nWithout that new berm in the park, 2 feet of sea level rise could bring flooding to Charlestown during an extreme storm."}, {"id": "2e649937-bbc4-4047-b5c5-766a645e753c", "title": "Radiant Resilience : Japan Self - Defense Forces During the 2011 Nuclear Meltdown", "date": "2024-05-19 18:00", "url": "https://sofrep.com/news/radiant-resilience-japans-self-defense-forces-during-the-2011-nuclear-meltdown/", "message": "It undertook complex tasks ranging from search and rescue missions to managing the looming nuclear crisis.\nIt undertook complex tasks ranging from search and rescue missions to managing the looming nuclear crisis.\nNuclear Crisis ManagementThe JSDF played a critical role in managing the unfolding nuclear crisis.\nAs the nation grappled with the nuclear crisis and strived to regain control, the JSDF’s unwavering commitment to relief, recovery, and rebuilding remained an essential pillar of hope and resilience.\nJSDF: A Stalwart Force in Times of CrisisThe 2011 Great Japan Earthquake showcased the Japan Self-Defense Forces as a stalwart force in times of crisis."}, {"id": "cd5c6d5d-7544-4592-98f9-33d72d6414a8", "title": "How  kitty cat are wrecking the home insurance industry", "date": "2024-05-19 18:30", "url": "https://www.popsci.com/environment/home-insurance-midwest-climate-disasters/", "message": "The rising cost of homeowner’s insurance is now one of the most prominent symptoms of climate change in the United States.\nLosses from severe convective storms increased by about 9 percent every year between 1989 and 2022, according to the insurance firm Aon.\nBut climate change may also be playing a role: Convective storms tend to form in hot, moist, and unstable weather conditions.\nEven large “reinsurers,” which sell insurance to insurance companies around the world, are feeling the sting from these storms.\nBut the increasing trend of “attritional” losses from repeated convective storms does threaten to cut into their profit margins."}, {"id": "f8596363-7563-4a78-9f17-098b4c1482c9", "title": "Power expected to be restored for most affected by deadly Houston storm", "date": "2024-05-19 23:00", "url": "https://www.voanews.com/a/power-expected-to-be-restored-for-most-affected-by-deadly-houston-storm/7618507.html", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCarolina Sierra and her 6-year-old son, Derek, enjoyed the air conditioning for a couple of hours Sunday.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nHouston area school districts canceled classes for more than 400,000 students Friday."}, {"id": "dbae253e-fe36-45f0-bedc-f82b741935b9", "title": "4 . 7 Magnitude Earthquake Reported | NewsRadio 1360 KKTX", "date": "2024-05-19 00:00", "url": "https://1360kktx.iheart.com/content/2024-05-18-47-magnitude-earthquake-reported/", "message": "A 4.7-magnitude earthquake struck Japan on Saturday (May 18), according to the United States Geological Survey.\nThe Tennessee earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey.\nThe Tennessee earthquake struck hours after a 4.0-magnitude earthquake struck California on Wednesday (May 15), according to the United States Geological Survey.\nThe California earthquake struck hours after a 5.6-magnitude earthquake struck Puerto Rico on Tuesday (May 14), according to the United States Geological Survey.\nThe Puerto Rico earthquake was reported hours after a 5.1-magnitude earthquake struck Indonesia on Tuesday, according to the United States Geological Survey."}, {"id": "965cd5ca-6192-48d5-bf41-d7fd53b225e1", "title": "4 . 7 Magnitude Earthquake Reported", "date": "2024-05-19 01:45", "url": "https://wtag.iheart.com/content/2024-05-18-47-magnitude-earthquake-reported/", "message": "A 4.7-magnitude earthquake struck Japan on Saturday (May 18), according to the United States Geological Survey.\nThe Tennessee earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey.\nThe Tennessee earthquake struck hours after a 4.0-magnitude earthquake struck California on Wednesday (May 15), according to the United States Geological Survey.\nThe California earthquake struck hours after a 5.6-magnitude earthquake struck Puerto Rico on Tuesday (May 14), according to the United States Geological Survey.\nThe Puerto Rico earthquake was reported hours after a 5.1-magnitude earthquake struck Indonesia on Tuesday, according to the United States Geological Survey."}, {"id": "188de31f-7b9f-4011-9dfd-5264b110213e", "title": "Fresh floods kill 66 in northern Afghanistan : provincial official", "date": "2024-05-19 14:30", "url": "https://www.terradaily.com/afp/240519114117.2r2wh4i1.html", "message": "Fresh floods kill 66 in northern Afghanistan: provincial officialKabul, May 19 (AFP) May 19, 2024Fresh floods killed 66 people in Faryab province in northern Afghanistan, a provincial official said Sunday, in the latest deadly flooding to hit the country.\nHeavy floods in multiple districts of Faryab province on Saturday night \"resulted in human and financial losses,\" Asmatullah Muradi, spokesman for the Faryab governor, said in a statement.\n\"Due to the floods 66 people were killed,\" he said, adding that at least five people were injured and others were still missing.\nThe floods came a day after provincial police said more than 50 people were killed in flash flooding in the western province of Ghor.\nJust over a week ago, more than 300 people were killed in flash flooding in northern Baghlan province, according to the UN World Food Programme and Taliban officials."}, {"id": "efc7418a-9844-4d78-8f07-f1b4eb8a9152", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 04:15", "url": "https://www.wypr.org/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "d461f6ab-dd2d-4f3a-b35c-05d91ef5c740", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 02:30", "url": "https://www.aspenpublicradio.org/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "cf0b83a0-717f-4a65-a4fc-089ec16f696d", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 05:00", "url": "https://www.wclk.com/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "44398908-964c-4a2e-b2db-add7d894f189", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 05:30", "url": "https://www.wunc.org/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "cb53b322-abeb-41fe-a39c-e70a2ed2b7dc", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 07:15", "url": "https://www.wvik.org/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "caecf366-eca9-42b9-a48a-847d73d0a543", "title": "Widespread power outages from deadly Houston storm raise new risk : hot weather", "date": "2024-05-19 07:15", "url": "https://www.wrvo.org/2024-05-18/widespread-power-outages-from-deadly-houston-storm-raise-new-risk-hot-weather", "message": "\"Don't overdo yourself during the cleanup process,\" the weather service's Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHundreds of thousands remain without powerThe widespread destruction of Thursday's storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed.\nState and federal recovery assistance is on the wayIn light of the storm damage, Harris County Judge Lina Hidalgo and Whitmire both signed disaster declarations, paving the way for state and federal storm recovery assistance."}, {"id": "d3bf6347-9fb8-408d-9df7-dee98dee3e64", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 23:00", "url": "https://www.clickorlando.com/news/national/2024/05/19/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/", "message": "Recommended VideosBy Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nMore than 289,000 homes and businesses in Texas remained without electricity Sunday evening, mostly in the Houston area.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nCarolina Sierra and her 6-year-old son, Derek, enjoyed the air conditioning for a couple of hours Sunday.\nTwo other large school districts in the the Houston area — Cypress-Fairbanks and Spring Branch — planned to be closed."}, {"id": "2c6a6bdd-85df-426c-9d27-9a426c348ef5", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 22:00", "url": "https://www.news-gazette.com/news/nation-world/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/article_f95c23a5-49a5-5c79-8ec5-4a0a2f333570.html", "message": "Champaign, IL (61820)TodayA stray shower or thunderstorm is possible early.\nLow near 65F.\nWinds S at 5 to 10 mph..TonightA stray shower or thunderstorm is possible early.\nLow near 65F.\nWinds S at 5 to 10 mph."}, {"id": "8e181380-0c34-4efd-9112-dbf87e995115", "title": "Prince William , Kate Middleton love spread like  wildfire during Scotland days", "date": "2024-05-19 23:00", "url": "https://www.geo.tv/latest/544846-prince-william-kate-middleton-spread-like-wildfires-during-scotland-days", "message": "Prince William, Kate Middleton love spread like ‘wildfires' during Scotland daysPrince William and Kate Middleton touched upon their blossoming romance during a special interview.\nThe Prince of Wales, who met Kate Middleton during college at St Andrews, touched upon the start of his love story in a confessional.\nSpeaking to Tom Bradby, William told ITV at the time: “We moved in together as friends because we were living together.\nWe lived with a couple of others as well, and it just sort of blossomed from there.\nEveryone pretended that they weren’t taking much notice, but it went round St. Andrews like wildfire afterwards.”"}, {"id": "889facde-51b4-4dab-8a45-ce2a3b4efa15", "title": "1 . 6 magnitude earthquake reported in Chesterfield", "date": "2024-05-19 17:00", "url": "https://www.unionleader.com/news/environment/1-6-magnitude-earthquake-reported-in-chesterfield/article_451aae00-15f5-11ef-a747-5749f0bfac50.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "7b869ed5-d3ba-47da-b4c9-407bb268232e", "title": "What To Do When Facing Extended Summer Power Outages", "date": "2024-05-19 19:45", "url": "https://www.theyeshivaworld.com/news/general/2284217/what-to-do-when-facing-extended-summer-power-outages.html", "message": "Texas officials say power outages could last weeks in parts of Houston after thunderstorms with hurricane-force winds tore through the city and killed at least four people.\nWhat should you do to stay cool and safe at home when summer power outages prevent you from using fans and air conditioners?\nIf your home is without water during a power outage, be sure to stock up on bottled water.\nAt night, if temperatures drop, open windows help increase the flow of cooler air.\nGenerators, which are largely fueled by gasoline and diesel, can be used as an external power source during an outage."}, {"id": "febcaa18-1bc0-4682-8c9f-8a5516493d13", "title": "Kerr : The Isles of Shoal Bloody Lady", "date": "2024-05-19 10:15", "url": "https://www.yahoo.com/news/kerr-isles-shoals-bloody-lady-091213664.html", "message": "Rachel Wall.\nBut the cruelest, most bloodthirsty cutthroat to terrorize our waters may have been the young lady known as Rachel Wall, who based her operations among the Isles of Shoals back in the 1780s.\nThe cutthroats would ride out a raging storm within the rocky Isles, and then once the weather had passed they would put out to sea.\nTheir first victims were four fishermen aboard a schooner from Plymouth, Massachusetts, who offered the Wall crew a ride back into port, DePauw wrote.\nThis article originally appeared on Portsmouth Herald: Kerr: The Isles of Shoals' Bloody Lady"}, {"id": "42d0d27b-0745-487c-8136-ae46792f485d", "title": "Houston storms kill seven , leave hundreds of thousands without power amid heat wave", "date": "2024-05-19 17:00", "url": "https://foxsanantonio.com/news/instagram/houston-storms-kill-seven-leave-hundreds-of-thousands-without-power-amid-heat-wave-clean-up-process-restore-power-trees-buildings-glass-destruction", "message": "HOUSTON (AP) — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.\n“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed."}, {"id": "f4400485-43cb-4410-b3dd-63f596269f67", "title": "Fresh floods kill 66 in northern Afghanistan", "date": "2024-05-19 14:30", "url": "https://www.terradaily.com/afp/240519121529.qse3kgj7.html", "message": "Fresh floods kill 66 in northern AfghanistanKabul, May 19 (AFP) May 19, 2024Fresh floods killed 66 people in Faryab province in northern Afghanistan, a provincial official said Sunday, in the latest deadly flooding to hit the country.\nHundreds of people have died in separate flash floods this month that have also swamped farmland in a country where 80 percent of the population depends on agriculture to survive.\nThe floods came a day after provincial police said more than 50 people were killed in flash flooding in the western province of Ghor.\nResidents in Baghlan, Ghor, Faryab and other affected regions found themselves without shelter, stripped of their homes and livelihoods.\nSpring floods are not uncommon in Afghanistan, a country of more than 40 million people, but above-average rainfall this year has sparked devastating flash flooding."}, {"id": "2b8ed9fc-64ab-4b12-9838-7407f02ad6da", "title": "Severe winds cancel Idaho Falls circus - LocalNews8 . com", "date": "2024-05-19 00:00", "url": "https://localnews8.com/news/idaho-falls/2024/05/17/severe-winds-cancel-idaho-falls-circus/", "message": "IDAHO FALLS, Idaho (KIFI) - Wind gusts of 60 miles per hour forced the Cirque Ma’Ceo equestrian circus to cancel Friday’s Idaho Falls performance.\n“I’m being extremely calm right now, but my heart is right here listening to that wind,” he added.\nThen again, it’s also its first time in Idaho Falls.\n“The only time I’ve ever experienced wind like this is when this tent had gone through a hurricane,” Zoppe said.\n“Wind is the worst type of weather a big top can endure.”The winds were also strong enough to tip over porta-potties, so the circus battened down the hatches."}, {"id": "9d3fb2c2-ddc1-4b89-9c64-ad7d391d0d69", "title": "Map Shows Which Maine Towns Could Be Underwater in 50 Years", "date": "2024-05-19 18:00", "url": "https://i95rocks.com/ixp/488/p/maine-towns-flooding-climate-change/", "message": "While these storms have caused damage inland, they have wreaked havoc on Maine’s coast.\nClimate Central / Google Maps Climate Central / Google Maps loading...attachment-Flood-OOB loading...Portland's Munjoy Hill could see the addition of new waterfront real estate.\nClimate Central / Google Maps Climate Central / Google Maps loading...\nIn Central Maine, the east side of Water Street could end up underwater, like they were during December’s ‘Grinch’ storm.\nClimate Central / Google Maps Climate Central / Google Maps loading..."}, {"id": "676e6867-6d9c-43b3-8837-5b047f4bfbb8", "title": "Map Shows Which Maine Towns Could Be Underwater in 50 Years", "date": "2024-05-19 21:30", "url": "https://q1065.fm/ixp/488/p/maine-towns-flooding-climate-change/", "message": "While these storms have caused damage inland, they have wreaked havoc on Maine’s coast.\nClimate Central / Google Maps Climate Central / Google Maps loading...attachment-Flood-OOB loading...Portland's Munjoy Hill could see the addition of new waterfront real estate.\nClimate Central / Google Maps Climate Central / Google Maps loading...\nIn Central Maine, the east side of Water Street could end up underwater, like they were during December’s ‘Grinch’ storm.\nClimate Central / Google Maps Climate Central / Google Maps loading..."}, {"id": "6dec0f21-4680-4269-8bb6-b80404ab084c", "title": "Fast - growing wildfire has shut down a portion of the Tonto National Forest in Arizona", "date": "2024-05-19 22:00", "url": "https://wacotrib.com/ap/state/fast-growing-wildfire-has-shut-down-a-portion-of-the-tonto-national-forest-in-arizona/article_4998eed1-6196-5892-9ed3-d7825c96fa4a.html", "message": "PHOENIX (AP) — A fast-growing wildfire has led the U.S. Forest Service to shut down a portion of the Tonto National Forest northeast of Scottsdale.\nThe so-called Wildcat Fire burning in the Cave Creek Ranger District has charred about 7.8 square miles (20 square kilometers) as of Sunday with no containment.\nVisitors have been escorted out of the Bartlett Lake area but no evacuations have been ordered and forest officials said the wildfire wasn’t threatening any occupied structures at this time.\nAbout 200 personnel were battling the blaze, backed by four engines, an air tanker and three water-dropping helicopters.\nTonto National Forest officials said in a statement that “the public is urged to stay away from the area so as not to impede fire suppression operations and for the safety of themselves and firefighters.”"}, {"id": "a06a3fe7-32dc-4763-9653-7c30a73efe26", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.dorsetecho.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "b9226d31-0b18-46a8-b453-7f1ef5e157a3", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 17:00", "url": "https://www.startribune.com/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/600367105/", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nHouston area school districts canceled classes for more than 400,000 students Friday.\nThe Houston Independent School District, the state's largest, said power had been restored to nearly 200 campuses and those schools would be open Monday."}, {"id": "385f6dc2-d1d7-4b8b-bf79-f2bf58e3133c", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 17:00", "url": "https://www.thespec.com/news/world/united-states/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/article_bd22ee44-59ca-53fa-bf73-51d52f83343a.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "fbc33763-9eb8-4721-aed1-1f9556b111a1", "title": "Chelsea Flower Show 2024 - from balcony gardens to beautiful tropical spaces", "date": "2024-05-19 08:45", "url": "https://www.express.co.uk/life-style/garden/1899638/Chelsea-Flower-Show-2024-gardens", "message": "This year's show will be about sustainable gardens and gardens as a means of nurturing good health - both strong themes and ones close to my heart.\nExpect to see lighter weight gardens and structures - this is where garden design is heading as designers look to cut carbon and create sustainable spaces.\nAnother thing to look out for are balcony gardensAnother thing to look out for at the show are the small gardens, in particular the balcony gardens.\nBig gardens are becoming a rarity so knowing how to create a beautiful space with a small patch is important, as is utilising any outside space.\nExpect to see big, bold plants that will catch the eye, including tropical varieties such as Cannas, Phormiums and Fatsias."}, {"id": "1c730af6-1213-4e7c-86fa-d49197a527fe", "title": "Oil and water – and oysters – dont mix", "date": "2024-05-19 10:15", "url": "https://www.yahoo.com/news/oil-water-oysters-don-t-090334854.html", "message": "The result of FSU’s research includes the Apalachicola Bay System Ecosystem-Based Adaptive Restoration Management Plan, released in January 2024.\nAll three of our area institutions of higher education have a vested interest in Apalachicola Bay and the floodplain.\nTallahassee Community College’s Wakulla Environmental Institute creates oyster domes to bring back the wild oyster population.\nAll three of our area institutions of higher education have a vested interest in Apalachicola Bay and the flood plain.\nThis article originally appeared on Tallahassee Democrat: Oil and water – and oysters – don’t mix | Chucha Barber"}, {"id": "c8625f77-673d-4627-b3ce-ffa1b3f3f058", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 21:15", "url": "https://www.10news.com/weather/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nHouston area school districts canceled classes for more than 400,000 students Friday.\nThe Houston Independent School District, the state's largest, said power had been restored to nearly 200 campuses and those schools would be open Monday."}, {"id": "2bf779f7-cc3f-4bdf-ba0d-d12d0f36b70e", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 20:00", "url": "https://www.mymotherlode.com/news/national/3360690/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm.html", "message": "Power expected to be restored to most affected by deadly Houston stormPower expected to be restored to most affected by deadly Houston storm View PhotoHOUSTON (AP) — Houston area residents affected by deadly storms last week that left at least seven dead were finally getting some good news as officials said they expected power to be restored by Sunday evening to a majority of the hundreds of thousands still in the dark and without air conditioning amid hot and humid weather.\nMore than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nThe Houston Independent School District, the state’s largest, said power had been restored to nearly 200 campuses and those schools would be open Monday."}, {"id": "7f309fd4-722c-4384-9733-058e1a970ea3", "title": "Eden Golan performs at rally for hostages in Hamas captivity - Israel News", "date": "2024-05-19 04:15", "url": "https://www.jpost.com/israel-news/article-801667", "message": "Golan's performance at the Hostage Square came six days after she won fifth place in the Eurovision final with the song \"Hurricane.\"\nEden Golan performs \"October Rain\" to the crowdBefore her performance, Golan told the crowd at the rally that it was her first time performing since her return from Eurovision.\nI will not stop making our voice heard in Israel and worldwide until everyone returns home,\" Golan said.\nHostage family members took to the stage of the Hostage Square, demanding the return of their loved ones and those held in Hamas captivity.\nRachel Goldberg-Polin, mother of Hersh Goldberg-Polin, who is currently in Hamas captivity after being kidnapped at the Nova Music Festival in Re'im, appeared at the Hostage Square as well."}, {"id": "c30dbfd0-d19f-4295-9b72-d4ebaff5f08a", "title": "Drought Relief Funds : BJP seeks proper distribution of drought relief funds | Mysuru News", "date": "2024-05-19 04:15", "url": "https://timesofindia.indiatimes.com/city/mysuru/bjp-seeks-proper-distribution-of-drought-relief-funds/articleshow/110241773.cms", "message": "We also published the following articles recentlyRain showers relief, raises farmers fearsCoastal Saurashtra had unseasonal rain and strong winds due to cyclonic circulation, bringing relief from summer heat.\nThe update strengthens network security with a higher level of safety, stricter access controls, improved password encryption, and robust security policy enforcement.\nDigisol's proactive approach and collaboration with Redfox Security emphasize the importance of addressing vulnerabilities to protect against potential cyberattacks.\nEven before the farmers get relief from drought, they are affected again with damage caused to their crops by rains.\nThey condemned the state government for stopping the scholarship announced by the previous BJP government to children of farmers, besides Rs 4,000 chief minister Krishi Samman Nidhi."}, {"id": "39f572ec-d068-44fe-bcec-5f02dd5aa0da", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 22:00", "url": "https://www.ksby.com/weather/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nHouston area school districts canceled classes for more than 400,000 students Friday.\nThe Houston Independent School District, the state's largest, said power had been restored to nearly 200 campuses and those schools would be open Monday."}, {"id": "2218886a-19ef-4368-bef6-aaad03beceb7", "title": "How to be a good follower", "date": "2024-05-19 21:30", "url": "https://www.economist.com/business/2024/05/16/how-to-be-a-good-follower", "message": "I f there is one thing anyone with a job and a pulse needs to learn, it is how to lead.\nThat, at least, is the message from the tsunami of books, courses, videos and podcasts on the topic.\nAuthors pump out books instructing you to eat last, be daring and take leaps—which risks stomach ache if nothing else.\nGurus tell you how to lead without actually being a leader; you might be on the reception desk, but you’re really in charge.\nThe most useful skill to have in your current job may well be how to be a good follower."}, {"id": "b5059fd0-5b43-4ab6-8d25-34cc61055021", "title": "Central US braces for potential derecho packed with  extreme  100+ mph wind gusts , baseball - sized hail", "date": "2024-05-19 15:15", "url": "https://www.yahoo.com/news/central-us-braces-potential-derecho-123504012.html", "message": "The severe weather threat isn’t limited to those areas, however.\n\"And when we’re talking damaging winds, you’re talking wind gusts 75 mph or greater.\nAnd some of these thunderstorms on Sunday could produce wind gusts as strong as a Category 2 hurricane.\nThunderstorms that develop in the Plains and Midwest will all be capable of producing damaging wind gusts, hail and possible tornadoes.\nOriginal article source: Central US faces 'Particularly Dangerous Situation' from potential derecho with 100-mph winds, giant hail"}, {"id": "e7e96a67-361a-432b-9452-07862c32d8bc", "title": "Xu fires 22 - under over 3 days to capture Copper Rock Championship in Hurricane", "date": "2024-05-19 05:45", "url": "https://www.stgeorgeutah.com/news/archive/2024/05/18/vpc-spo-xu-fires-22-under-over-3-days-to-capture-copper-rock-championship-in-hurricane/", "message": "The Epson Tour rookie from New Zealand distanced herself from the field Saturday en route to a Copper Rock Championship title, shooting a record-setting 22-under par across the three-day event.\nWhen Xu’s final putt found the bottom of the cup on Saturday, she had won by seven shots, having carded an 8-under 64 to dominate the final day of play at Copper Rock Golf Course in Hurricane.\nXu’s 63 in the second round placed her alongside 2023 champion Savannah Vilaubi and Su Oh, who set the mark for the 18-hole course during the 2023 Copper Rock Championship.\n“I started off pretty stable with three pars today,” she said in a news release from the Epson Tour.\n“Fiona played great golf today and it was just nice to watch her and see how you win a golf tournament."}, {"id": "1fef6ebd-7d5e-4fd1-b8c4-1b083020710d", "title": "Extreme weather batters world in 2024 | World News", "date": "2024-05-19 15:15", "url": "https://indianexpress.com/article/world/extreme-weather-batters-world-in-2024-9339039/", "message": "Climate change is likely fueling a surge in extreme weather events across the planet.\nSo far, 2024 has been a particularly bad for extreme weather, according to the World Meteorological Organization (WMO), with droughts, extreme heat, and floods causing severe damage to health and livelihoods.\n\"Almost every region in the world saw extreme weather and climate events of different natures,\" WMO climate expert Alvaro Silva told DW.\nWhat extreme weather is caused by climate change and what isn't?\nThe damage caused by extreme weather depends on the vulnerability of the population."}, {"id": "a8f64ddc-a844-4a55-a074-49a5e2aad9b1", "title": "Station 19 Season 7 Episode 9 Spoilers : What To Expect From ,  How Am I Supposed To Live Without You  ", "date": "2024-05-19 21:30", "url": "https://www.celebdirtylaundry.com/2024/station-19-season-7-episode-9-spoilers-what-to-expect-from-how-am-i-supposed-to-live-without-you/", "message": "A full synopsis of what to expect from Station 19, Season 7, Episode 9 is down below!\nStation 19 Season 7, Episode 9 Spoilers: A Wildfire Brings On The DramaStation 19, Season 7, Episode 9 is set to air on Thursday, May 23 at 10 p.m. on ABC.\nStation 19 Season 7, Episode 9 Spoilers: What’s Next?\nAs Station 19 is a spin-off to Grey’s Anatomy, there’s been some speculation that the station could carry on within the medical drama, moving forward.\nAre you going to miss Station 19?"}, {"id": "ce780d91-87ad-41f8-b2b7-b5b8494f1887", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 17:00", "url": "https://www.niagarafallsreview.ca/news/world/united-states/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/article_cb8370fb-fa43-5fa1-a3d9-2325a59ea586.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "00528e22-4114-4f39-bfa0-10d063a441b2", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-19 19:45", "url": "http://www.middletownpress.com/news/article/power-expected-to-be-restored-to-most-affected-by-19466598.php", "message": "Electric crews restored full power and air conditioning Sunday morning.\n(AP photo/Mark Vancleave) Mark Vancleave/AP Crews replace utility poles along Durham Drive on Sunday, May 19, 2024, in Houston, Texas.\nBy Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nTwo other large school districts in the the Houston area — Cypress-Fairbanks and Spring Branch — planned to be closed."}, {"id": "2856d2b4-d9b4-4472-87fa-73651dd10e1e", "title": "Lohardaga BJP leaders campaigned for Kalicharan Singh", "date": "2024-05-19 19:30", "url": "https://www.dailypioneer.com/2024/state-editions/lohardaga-bjp-leaders-campaigned-for-kalicharan-singh.html", "message": "Regarding the Chatra Lok Sabha elections in Jharkhand, the BJP members of Lohardaga appealed to the voters of Barwa Toli, Goli, Rud etc.\nvillages of Chandwa block of Chatra parliamentary constituency on the border of Kudu in Lohardaga to vote for BJP candidate Kalicharan Singh.\nSimultaneously, a meeting was held with senior BJP members of Chandwa and Latehar.\nSenior BJP leaders Lal Radhe Nath Shahdev, Devashish Kar, Rana Govardhan Sharma, Dilip Patnaik, Sanjay Burman etc.\nwere present along with Mr. Singh."}, {"id": "22b8b1c6-103e-4dc2-aaf0-f846a2a9f8c3", "title": "Hikurangi Subduction Zone : The burning question about NZ biggest quake - maker", "date": "2024-05-19 04:15", "url": "https://www.newstalkzb.co.nz/news/science/hikurangi-subduction-zone-the-burning-question-about-nz-s-biggest-quake-maker/", "message": "Now, scientists have edged even closer to answering perhaps the most important question about our big-risk Hikurangi Subduction Zone: what controls the system’s suspected release valve.\nSubduction zone cataclysms like the 2011 Tōhoku and 2004 Indian Ocean disasters have shown what happens when all that energy suddenly released in “mega-thrust” earthquakes.\nThe general location of the offshore part of the Hikurangi Subduction Zone.\nEach of those geological profiles and everything in between can be found within the Hikurangi Subduction Zone -explaining why such a large range of earthquake types happen on it.\nSpecifically, they tend to happen within areas where the subduction zone is transitioning from being \"stuck\" beneath the southern North Island to an area where the subduction zone is \"creeping\" further north, around Gisborne and Hawke's Bay."}, {"id": "a4658488-fa54-4c4b-b9eb-ce8477a13e18", "title": "Power expected to be restored to most affected by deadly Houston storm – KTBB News , Weather , Talk", "date": "2024-05-19 18:30", "url": "https://ktbb.com/post/?p=1323427", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nIt’s been really crazy.”CenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nThe National Weather Service said in a post on the social media site X that residents should expect “sunny, hot and increasingly humid days” in the Houston area.\nHouston area school districts canceled classes for more than 400,000 students Friday."}, {"id": "8cfd4795-47e1-4ab4-8a20-4405e747a03a", "title": "Wildcat Fire grows to approximately 500 , causes road closures near Bartlett Lake", "date": "2024-05-19 03:00", "url": "https://www.fox10phoenix.com/news/wildcat-fire-grows-to-approximately-500-causes-road-closures-near-bartlett-lake", "message": "A new wildfire that erupted northeast of Cave Creek on Saturday is estimated at 12,100 acres.\nIt has been called the Wildcat Fire and was first reported at 9:20 a.m. on May 18.\nParties were being escorted off Bartlett Lake to safety as the unpredictability of the fire threatened people in the area.\nRoad closuresRoads were closed near the intersection of Horseshoe Dam and Bartlett Dam roads as officials stated the fire was burning on both sides of Bartlett Dam Road.\nOfficials with the Tonto National Forest closed the public off from entering the forest in the Cava Creek Ranger District, saying the closure is meant to protect the public from the \"uncontrolled\" fire."}, {"id": "78f691d1-fcf3-46ca-b325-0ec20d0ba247", "title": "Officials recap severe Thursday evening weather", "date": "2024-05-19 08:30", "url": "https://www.wbrz.com/news/officials-recap-severe-thursday-evening-weather", "message": "Officials recap severe Thursday evening weatherBATON ROUGE - Both Entergy and Demco are still working to restore power to about 6,000 customers around the state after a round of powerful storms Thursday night.\nWe want every member to be restored to power and we definitely do not want folks to be without power,\" Latona said.\nSome residents, like those near the Romeville area in St. James Parish, are not expected to receive power until Sunday evening.\nOn Friday, officials confirmed St. James Parish was hit by an EF-1 tornado which touched down in Romeville.\nThe American Red Cross came to St. James' rescue and set-up a shelter for those in need."}, {"id": "5c9b66ff-4088-4315-943c-ba603207953d", "title": "City of Mission prepares for hurricane season with cleanup project", "date": "2024-05-19 02:00", "url": "https://www.krgv.com/news/city-of-mission-prepares-for-hurricane-season-with-cleanup-project", "message": "City of Mission prepares for hurricane season with cleanup projectLoads of tires, old mattresses and other unwanted items were dropped off in Mission on Saturday as the city prepared residents ahead of hurricane season.\nThe city held a community roundup event at 1400 S. Conway Ave. where residents were allowed to drop off bulky items and tires.\nThe city says preventing illegal dumping is important, especially in flood-prone areas.\nA total of 500 tires were collected, and the city says they plan to hold more of these events in the coming months."}, {"id": "05e6b811-2b2c-4d36-80ec-263db8420b98", "title": "Naturespeak : Whistler hydrologic regimes and the upcoming fire season", "date": "2024-05-19 20:00", "url": "https://www.piquenewsmagazine.com/local-news/naturespeak-whistlers-hydrologic-regimes-and-the-upcoming-fire-season-8761607", "message": "There is more to Whistler's streams than scenic beauty and recreationAh, the glorious signs of spring!\nEvery stream has a unique annual rhythm, resulting from the amount and form of water that flows into that stream system.\nThe health of Whistler’s many ecosystems relies on these annual rhythmic patterns of stream flow.\nMoisture in plants, soils, and the atmosphere are all important factors in maintaining a fire-resistant forest.\nThe connection between winter conditions, stream flow, the upcoming fire season, and the future of our mountain sports are deeply entwined."}, {"id": "c972aebd-02a1-4426-9ecb-f33909fff4b6", "title": "Houston surveys destruction from deadly storms and races to restore power as Southeast and Gulf Coast face flood threat", "date": "2024-05-19 00:00", "url": "https://www.cbs58.com/news/houston-surveys-destruction-from-deadly-storms-and-races-to-restore-power-as-southeast-and-gulf-coast-face-flood-threat", "message": "My condolences go out to the families that lost a loved one during yesterday’s severe weather event,” Gonzalez said.\nOver 531,000 customers in Harris County remain without power early Saturday following the line of storms, according to PowerOutage.us.\n“Isolated to scattered severe thunderstorms appear possible across portions of the Southeast and Carolinas on Saturday, and parts of the Upper Midwest,” the center said.\nThe greatest chances for severe weather are across parts of Nebraska and Kansas, with a slight level 2 of 5 risk of severe thunderstorms issued by the Storm Prediction Center.\nBy the end of the weekend, thunderstorm chances will diminish for most of the Southeast and Mid-Atlantic, the weather service said."}, {"id": "4289c432-d721-4d8a-9a79-60533272cfca", "title": "Lake County wildfire contained", "date": "2024-05-19 21:15", "url": "https://www.duluthnewstribune.com/news/local/lake-county-wildfire-contained", "message": "ISABELLA — A wildfire in Lake County is now considered 100% contained, according to a news release from Forest Service officials as of Saturday evening.\nThe fire grew from an intentional fire set by Superior National Forest crews just north of Highway 1 near Little Isabella River Campground on Wednesday to help reduce forest fire fuels.\nOfficials stated that they felt \"confident that the edge of the fire will not move,\" according to the release.\nOnce these actions are taken to prevent fire from escaping, the fire is considered contained.\nThere is no immediate threat to private property or structures, and the fire is not active."}, {"id": "31f1bff3-258c-4404-9fab-8d5984f8bc66", "title": "2 , 207 villages gripped by drinking water problem owing to drought , says Minister", "date": "2024-05-19 16:00", "url": "https://www.thehindu.com/news/national/karnataka/2207-villages-gripped-by-drinking-water-problem-owing-to-drought-says-minister/article68193802.ece", "message": "The drought that gripped the State owing to failure of both the southwest and northeast monsoons in the previous season has posed drinking water problem in 2,207 villages, according to RDPR Minister Priyank Kharge.\n“As many as 548 villages are being provided drinking water through 846 tankers and the remaining 1,659 villages are supported by getting 2,098 private borewells on hire basis,” the Minister said.\nTo mitigate the problem of drinking water in rural areas, grants available under SDRF were utilised on priority, he said.\nIn addition to this, grants were also released from the Department of Rural Drinking Water and Sanitation for supplying drinking water in rural areas.\nDrought condition this year has a high impact on the drinking water situation,” he observed."}, {"id": "b87b9f10-c8c5-4298-a3c9-90aad202f62b", "title": "Afghanistan : Humanitarian Access Snapshot ( April 2024 ) - Afghanistan", "date": "2024-05-19 12:15", "url": "https://reliefweb.int/report/afghanistan/afghanistan-humanitarian-access-snapshot-april-2024", "message": "Key HighlightsSome 156 (1) Humanitarian access incidents, a record showing a 22% drop from the same time last year and a 7% increase from the previous month(2), were reported by humanitarian partners in April 2024.\nThe humanitarian access incidents in April resulted in the temporary suspension of 107 projects.\nIn April 2024, approximately 60% of the reported incidents involved 'Interference in the implementation of humanitarian activities' initiated by the de-facto authorities (DfA).\nThe primary goal of this forum was to foster discussions on collective humanitarian access priorities and operational barriers at the national level.\nThese forums mirror the structure and objectives of the TCLF and play a vital role in addressing localized humanitarian access issues and coordinating effective humanitarian response efforts."}, {"id": "7a2b3c90-bfa1-41e1-b7cd-143909b700ab", "title": "Cash crude differentials mostly higher to close the week | Hellenic Shipping News Worldwide", "date": "2024-05-19 20:00", "url": "https://www.hellenicshippingnews.com/cash-crude-differentials-mostly-higher-to-close-the-week/", "message": "Cash crude differentials mostly higher to close the weekU.S. physical crude differentials were mostly higher on Friday in active trading to close out the week, brokers said, while wet weather in Canada continued to dampen concerns that a wildfire would hit oil-producing areas.\nLight Louisiana Sweet WTC-LLS for June delivery gained 37.5 cents on Friday, trading at a $2.70 premium to U.S. crude CLc1.\nMars Sour WTC-MRS rose by 5 cents and traded at a 70-cent premium to West Texas Intermediate crude CLc1.\nWTI Midland WTC-WTM climbed by 15 cents and traded at a 60-cent premium to U.S. crude futures CLc1West Texas Sour WTC-WTS fell 22.5 cents, trading at a $1 discount to WTI Midland.\nWTI June crude CLc1 futures rose 83 cents to settle at $80.06 a barrel on Friday."}, {"id": "aa14ff0d-be4c-4ea6-b9e4-362e0488297e", "title": "Storm vs Mystics Predictions , Picks & Odds – 5 - 19", "date": "2024-05-19 17:15", "url": "https://www.covers.com/wnba/storm-vs-mystics-predictions-picks-sunday-5-19-2024", "message": "Both the Seattle Storm and Washington Mystics have opened the season 0-2 as they get set to play Sunday.\nFind out where my best bets lie in our WNBA picks and Storm vs. Mystics predictions on Sunday, May 19.\nStorm vs Mystics oddsStorm vs Mystics live oddsGet the latest Storm vs. Mystics WNBA odds for tonight.\nStorm vs Mystics trendThe Over is 7-2 in the Storm’s last nine road games.\nStorm vs Mystics game infoLocation: Entertainment & Sports Arena, Washington, D.C."}, {"id": "3fb686ff-52b6-4e88-8906-64d3e8629aa6", "title": "A river of forgotten promises lies buried in Mumbai poll noise | India News", "date": "2024-05-19 01:45", "url": "https://timesofindia.indiatimes.com/india/a-river-of-forgotten-promises-lies-buried-in-mumbais-poll-noise/articleshow/110242135.cms", "message": "During rains, homes in the labyrinthine lanes are still swamped in brown water, bringing with it garbage and dead rodents.\nA decision was taken under the then CM Vilasrao Deshmukh to widen the river from 60 to 150 metres.\nHowever, state environment minister Ramdas Kadam delivered a sobering assessment in the assembly in 2015, stressing that the Mithi River existed in name only.\nIn Aug 2021, former state environment minister Aaditya Thackeray inaugurated a pilot project to improve the river’s water quality by collecting and recycling floating debris.\nLast year, his calls for action prompted CM Eknath Shinde to inspect the river and direct BMC to clean it before the monsoons."}, {"id": "0507e3a8-9047-468b-9c22-92c8c0a6b4d0", "title": "Fire evacuees face eviction from already - booked hotels", "date": "2024-05-19 21:15", "url": "https://www.theglobeandmail.com/canada/article-fire-evacuees-face-eviction-from-already-booked-hotels/", "message": "Some 4,700 people were ordered evacuated a little more than a week ago near Fort Nelson, B.C., because of a fast-moving wildfire.\nCheyenne Seely and her fiancé, Dillon McCann, fled Fort Nelson late on the night of May 10.\nThese supports, provided at the local level and often involving volunteers from nearby communities, include co-ordinating and paying for hotel rooms for evacuees, as well as arranging food and transportation.\nAlberta hotels working to accommodate Fort Mac evacuees are facing similar issues.\nMinistry of Emergency Management and Climate Readiness acknowledges the “frustrations” that some evacuees have faced when asked to leave their hotels."}, {"id": "f9f98a49-8604-4ba8-9703-c02facd12959", "title": "Eastbound traffic on Bay Bridge closed due to Yerba Buena Island fire", "date": "2024-05-19 00:00", "url": "http://www.sfchronicle.com/bayarea/article/yerba-buena-island-fire-19465881.php", "message": "San Francisco firefighters battle a blaze on Yerba Buena Island in an image taken from video.\nSan Francisco Fire Department San Francisco firefighters responded to a blaze on Yerba Buena Island.\nBenjamin Fanjoy/The ChronicleA grass fire on Yerba Buena Island prompted authorities to shut down eastbound traffic Saturday afternoon on the Bay Bridge for about two hours.\nAfter all eastbound lanes were closed at roughly 2:30 p.m. Saturday in response to an “uncontrolled wildfire” on the island, traffic eventually returned around 4:45 p.m., with all lanes reopened by 6 p.m., said fire department spokesperson Capt.\nAbout 40 San Francisco firefighters attacked the fire, he said."}, {"id": "71a36591-7940-4ad3-9ca7-5818ef7d6abf", "title": "Rainy days continue in Bengaluru as villas and roads get flooded", "date": "2024-05-19 16:30", "url": "https://www.thehindu.com/news/cities/bangalore/rainy-days-continue-in-bengaluru-as-villas-and-roads-get-flooded/article68193953.ece", "message": "Cars and bikes were damaged in a residential complex’s basement, while roads were flooded in various other parts, as Bengaluru received heavy to moderate rainfall on Saturday and Sunday.\nHeavy rain resulted in flooded roads in Yelahanka, Byatarayanapura, Hessarghatta Road, Hebbal, and other parts of North Bengaluru and Central Business District (CBD) areas.\nRahul K.T., resident of Chikkabanavara, who was stuck on Hesaraghatta Road, said: “I was stranded for over three hours owing to the flooding.\nIt was a terrifying experience.”Arjun Rao, caught in the flooding in Yelahanka, said: “The roads were completely submerged, and traffic was at a standstill.\nRajesh Kumar, a resident, said: “The flooding in our area was so severe that it took hours for the water to recede."}, {"id": "feffb489-5428-45be-91e6-d2dc71fc418e", "title": "TxDOT works to restore traffic signal outages across Houston area", "date": "2024-05-19 17:45", "url": "https://www.click2houston.com/news/local/2024/05/19/txdot-works-to-restore-traffic-signal-outages-across-houston-area/", "message": "There have been numerous traffic signal outages in the Houston area since Thursday evening’s storm.\nAs a result of the derecho storm, TxDOT crews have been clearing storm debris and working to restore normal operations, focusing on traffic signals impacted by the storm.\nRecommended Videos“Our crews are working diligently to restore our traffic signals and return to normal operations across the Houston District, including Harris, Montgomery, Fort Bend, and Waller counties,” said Eliza Paul, District Engineer for the TxDOT Houston District in a press release.\nTraffic signals that are not functioning and storm debris pose a potential risk to motorists, so TxDOT urges them to avoid unnecessary travel.\nWhen traveling, drivers should slow down and give first responders room to work at intersections with non-functional traffic signals."}, {"id": "bab8889b-9cb9-40ea-ae35-82ce42b560bc", "title": "3 . 3 earthquake strikes east of Ridgecrest", "date": "2024-05-19 19:45", "url": "https://www.yahoo.com/news/3-3-earthquake-strikes-east-182416461.html", "message": "BAKERSFIELD, Calif. (KGET) — A 3.3 magnitude earthquake rattled an area just east of Ridgecrest on Sunday.\nOn May 19, the quake struck 8.6 miles northeast of Ridgecrest, according to a United States Geological Survey report.\nDocuments reveal Bakersfield officers’ account of viral alleged ‘BPD Special’ traffic stopData from the USGS showed the quake struck at a depth of 8 kilometers, around 10:26 a.m.\nThis material may not be published, broadcast, rewritten, or redistributed.\nFor the latest news, weather, sports, and streaming video, head to KGET 17."}, {"id": "1eadf2ec-2025-4568-ab08-5985a947ba72", "title": "The Great New York Earthquake Of 2024 : Lessons For Financial Preparedness | The Jewish Press - JewishPress . com | Jonathan I . Shenkman | 9 Iyyar 5784 – Friday , May 17 , 2024", "date": "2024-05-19 01:45", "url": "https://www.jewishpress.com/sections/businessfinance/money-matters/the-great-new-york-earthquake-of-2024-lessons-for-financial-preparedness/2024/05/17/", "message": "Life Insurance: The death of a family member, particularly if they are a breadwinner or manage household affairs, can be devastating.\nIndividuals deemed uninsurable due to health concerns may access more affordable life insurance through employer-provided coverage.\nDisability Insurance: Disability insurance provides monthly payments to people whose disabilities hinder or halt their ability to work.\nLong-Term Care Insurance: Long-term care insurance policies reimburse policyholders a daily amount for services to assist them with activities of daily living such as bathing, dressing, or eating.\nThe great New York earthquake of 2024 reminds us of life’s uncontrollable nature."}, {"id": "f264bb0c-e30d-48f4-8e72-9812bdb81db7", "title": "USGS reports swarm of earthquakes in Brawley area", "date": "2024-05-19 09:45", "url": "https://kesq.com/news/2024/05/18/usgs-reports-swarm-of-earthquakes-in-brawley-area/", "message": "The USGS reported a swarm of earthquakes in the Brawley area on Saturday.\nA few dozen quakes, ranging between magnitudes 2.5 to 3.9, were reported throughout the day.\nThe largest one recorded (at the time of this report) was a magnitude 3.9 earthquake, which struck around 4:00 p.m.\nNearby, the USGS reported a magnitude 3.0 earthquake, recorded before 2:30 p.m. Saturday in Imperial.\nThere were no reports of damage or injuries."}, {"id": "03cb72ea-46e7-4f15-9df5-c35ce6790c78", "title": "Grey Anatomy James Pickens Jr teases  impactful  season 20 finale", "date": "2024-05-19 12:00", "url": "https://www.digitalspy.com/tv/ustv/a60835515/greys-anatomy-pickens-jr-season-20-finale/", "message": "Grey's Anatomy spoilers follow.\nGrey's Anatomy star James Pickens Jr has teased the show's \"impactful\" season 20 finale.\nHow that's going to impact us moving with season 21.\nIt's going to be true Grey's Anatomy, that's all I can tell you.\"\nGrey's Anatomy season 20 and Station 19's final season are airing on in the US."}, {"id": "e3c82280-bb3c-4f32-884c-d294d3956e30", "title": "The Perfect Storm - 5Action", "date": "2024-05-19 08:30", "url": "https://www.tvguide.co.uk/schedule/7ef5ba42-88a5-53af-8519-1f5d4769adcf/the-perfect-storm", "message": "The Perfect Storm (2000)5Action 2:00 PM to 3:00 PM Sunday 19 May Share Add toCalendar +The Perfect Storm S SubtitlesThe skipper of a fishing boat and his crew ignore severe weather warnings and head for a dangerous area of the North Atlantic in search of the last lucrative catch of the season, but end up fighting for survival in the worst storm of the 20th century.\nFact-based disaster drama, with George Clooney, Mark Wahlberg, Diane Lane, John C Reilly and Mary Elizabeth Mastrantonio.\nThe Perfect Storm airs on 5Action at 2:00 PM, Sunday 19 May .\n(Subtitles.)\nLearn more about The Perfect Storm and other movie/drama on our factual pageCertificate 12Topics Movie ➝ Drama Adventure Disaster Movie Factual"}, {"id": "dbff7f4b-0324-4aa9-a82b-da01eca29517", "title": "Carolina Hurricanes coach Rod BrindAmour signs multi - year contract", "date": "2024-05-19 22:00", "url": "https://abc11.com/post/carolina-hurricanes-coach-rod-brindamour-re-signs-multi-year-contract/14843208/", "message": "Carolina Hurricanes coach Rod Brind'Amour signs multi-year contractRALEIGH, N.C -- The Carolina Hurricanes have re-signed coach Rod Brind'Amour and his staff to multiyear contracts, keeping one of the best in the NHL behind the bench around for the long term.\nThe team announced the re-signings Sunday for Brind'Amour, assistants Jeff Daniels and Tim Gleason, goaltending coach Paul Schonfelder and video coach Chris Huffine.\n\"Rod has been instrumental to the success we've had over the last six seasons,\" team president and general manager Don Waddell said.\n\"Ever since he joined the organization 24 years ago, Rod has embodied what it means to be a Hurricane.\nHe then spent seven seasons as an assistant coach before taking over as a first-time head coach."}, {"id": "7bde0661-9c3b-4629-bc4c-45fd01cf4dfb", "title": "Flash floods kill 50 in Ghor province of Afghanistan", "date": "2024-05-19 01:45", "url": "https://news.webindia123.com/news/Articles/World/20240519/4198471.html", "message": "At least 50 people, including women and children, lost their lives in the Ghor province of Afghanistan following devastating floods in the region, Khaama Press News Agency reported on Saturday.\nLocal officials in Ghor continue to state that, including the Ghor-Herat highway, transportation routes to most districts in this province have been blocked, Khaama Press reported.\nFlash flooding has wreaked havoc in Baghlan province and several other provinces across Afghanistan.\nReports indicate that floods have destroyed homes and infrastructure, and transport routes have been blocked, leaving communities isolated and in urgent need of assistance, Khaama Press reported.\nOn May 16, Pope Francis urged the international community to help the flood victims in Afghanistan, Vatican News reported."}, {"id": "5df461de-145d-4f87-bf1b-e394cbf081b7", "title": "WWE star strips naked on live TV and viewers cant believe their eyes", "date": "2024-05-19 10:00", "url": "https://metro.co.uk/2024/05/19/wwe-star-strips-naked-live-tv-viewers-cant-believe-eyes-20867474/", "message": "Toni Storm got people talking with her latest wild display (Picture: AEW/Lee South)AEW star Toni Storm left viewers gobsmacked on Saturday night when she appeared to strip naked on Collision.\nShe has truly discovered herself as Timeless Toni Storm in All Elite Wrestling, and she frequently has fans howling and gasping with her antics.\nThis week, the AEW Women’s Champion took things to an unexpected level as she played mind games with current rival Serena Deeb.\nTimeless Toni knows how to play mind games (Picture: AEW/Lee South)In a bid to get in her challenger’s head, she stripped naked behind the flag, and wrapped her bare body in it.\nLike Lutha just showed up, stole the flag (it took him 2 whole minutes to do so LOL) and suddenly Toni Storm is naked,’ laughed @winterweather."}, {"id": "b9d5c2b7-6530-4cc0-9227-9bcb0e9832a0", "title": "Sen . Ossoff announces new water pump station for Rockdale County", "date": "2024-05-19 15:15", "url": "https://www.yahoo.com/news/sen-ossoff-announces-water-pump-134258035.html", "message": "Senator Jon Ossoff is delivering new resources to upgrade the water infrastructure in Rockdale County.\nLocal officials say the county’s 50-year-old water pump station often floods during storms.\nThe new water pump station will reduce flooding events and significantly cut down on the amount of bacteria being discharged into Snapping Shoals Creek.\n[DOWNLOAD: Free WSB-TV News app for alerts as news breaks]The bipartisan government funding package has $959,752 set aside for the new water pump station.\nWorking alongside Congressman Hank Johnson, we brought Republicans and Democrats together to help upgrade water infrastructure to prevent flooding and upgrade quality of life for families,” Sen. Ossoff said."}, {"id": "60af364a-cb30-44e3-89da-92f317ad2d6f", "title": "Climate Change May Force Thailand to Relocate Its Capital – One Green Planet", "date": "2024-05-19 21:00", "url": "https://www.onegreenplanet.org/environment/climate-change-may-force-thailand-to-relocate-its-capital/", "message": "Thailand faces a daunting challenge as Climate change threatens to inundate its capital, Bangkok, by the end of the century.\nAccording to Pavich Kesavawong, Deputy Director General of Thailand’s Department of Climate change and Environment, the situation is dire.\nKesavawong highlighted that the city is already grappling with the effects of Climate change, indicating that adaptation strategies are essential.\nThailand is also advancing its Climate change legislation, aiming for carbon neutrality by 2050 and net-zero emissions by 2065.\nAs Thailand navigates these challenges, the potential relocation of its capital underscores the severe impact of climate change on vulnerable regions worldwide."}, {"id": "0d4450e8-7338-43e4-8080-225b820ca715", "title": "SADC PF Standing Committee meets over food security and sustainable agriculture - Newsday Zimbabwe", "date": "2024-05-19 18:30", "url": "https://www.newsday.co.zw/news/article/200027138/sadc-pf-standing-committee-meets-over-food-security-and-sustainable-agriculture", "message": "Malawi Member of Parliament Ishmael Ndaila Onani, chairperson of the FANR Standing CommitteeJOHANNESBURG, SOUTH AFRICA - The SADC PF Standing Committee on Food, Agriculture and Natural Resources (FANR) is meeting this week in Johannesburg, South Africa, to brainstorm over food security and sustainable agriculture in the region.\nThe meetingbrings together parliamentarians, experts, and stakeholders to discuss strategies for mitigating the impacts of climate change and advancing sustainable development.\nIt will focus on three thematic areas: Food Security and Sustainable Agriculture, Sexual and Reproductive Health and Rights (SRHR) and Natural Resource Governance.\n“Failure to address climate change, food security and SRHR will lead to economic loss, where more budgets will be spent in response to climate impacts.\nIt affects air quality, water availability, and food security, impacting public health systems,” she noted."}, {"id": "0328277d-24b0-4120-bf4f-871c5075696d", "title": "Major Disaster Declared After Disastrous Storm Wipes Out State", "date": "2024-05-19 21:15", "url": "https://kixs.com/ixp/178/p/texas-weather-disaster/", "message": "President Joe Biden declared the recent severe storm a major disaster in Texas, opening up funding to help with recovery efforts.\n7 COUNTIES APPROVED FOR FEDERAL FUNDINGFederal aid will be available to help the state, tribal, and recovery efforts involved \"in the areas affected by severe storms, straight-line winds, tornadoes, and flooding.\"\n\"I thank President Biden and his administration’s assistance as Texas continues to respond to severe weather and flooding across the state.\nTexas is working around the clock to provide all necessary resources to help Texans move forward from these devastating storms.\"\nHOW TO APPLY FOR ASSISTANCEIf you were affected and live in the several approved counties you can apply for assistance here, or by calling 800-621-FEMA (3362) or through the FEMA app."}, {"id": "1b23b86b-ce1d-4975-ae2e-dc21c1ffb7b9", "title": "SADC PF Standing Committee meets over food security and sustainable agriculture", "date": "2024-05-19 17:45", "url": "https://www.thestandard.co.zw/news/article/200027138/sadc-pf-standing-committee-meets-over-food-security-and-sustainable-agriculture", "message": "Malawi Member of Parliament Ishmael Ndaila Onani, chairperson of the FANR Standing CommitteeJOHANNESBURG, SOUTH AFRICA - The SADC PF Standing Committee on Food, Agriculture and Natural Resources (FANR) is meeting this week in Johannesburg, South Africa, to brainstorm over food security and sustainable agriculture in the region.\nThe meetingbrings together parliamentarians, experts, and stakeholders to discuss strategies for mitigating the impacts of climate change and advancing sustainable development.\nIt will focus on three thematic areas: Food Security and Sustainable Agriculture, Sexual and Reproductive Health and Rights (SRHR) and Natural Resource Governance.\n“Failure to address climate change, food security and SRHR will lead to economic loss, where more budgets will be spent in response to climate impacts.\nIt affects air quality, water availability, and food security, impacting public health systems,” she noted."}, {"id": "365c05a2-1115-49d9-b77a-47ce35a6b290", "title": "Storms likely for Sunday evening , additional storm chances ahead", "date": "2024-05-19 23:00", "url": "https://www.yahoo.com/news/storms-likely-sunday-evening-additional-213644825.html", "message": "What We’re TrackingSevere storms this evening/tonightA few more storm chancesStill mild through the weekNumerous storms and storm clusters will develop and move east through Sunday evening.\nThese storms have been producing extremely strong wind, large hail and even a few tornadoes Sunday afternoon, but should transition more to an all-wind producing storm cluster over time.\nAnother chance for a few storms on Monday may be more limited after this evening’s round of storms blows through the area.\nAdditional storms on Tuesday, with the better chance setting up to the east late Tuesday.\nHowever, another system brings a chance for scattered showers and storms by Thursday night into part of Friday."}, {"id": "d22b6f61-e2df-42bf-9b74-ad70cc7ffe94", "title": "High water levels on the Peel River near Fort McPherson , N . W . T ., put cabins at risk", "date": "2024-05-19 19:15", "url": "https://www.cbc.ca/news/canada/north/flood-risk-fort-mcpherson-break-up-1.7209048", "message": "Some cabins along the Peel River near Fort McPherson, N.W.T., are at risk because of rising water levels on the river this weekend, according to the territorial government.\nA water monitoring bulletin issued Saturday afternoon stated water levels on the Peel River were rising and ice was accumulating upstream of Fort McPherson.\nWATCH | Cabin owner struggling to rebuild from 2023 Peel River floods:Cabin owner struggling to rebuild from 2023 Peel River floods Duration 1:24 In the N.W.T., it's been over a year since more than a dozen cabins and camps were washed away along the Peel River in the Mackenzie Delta from spring flooding.\n(Gordon Koe)Despite the rising water, Koe was optimistic.\nHe is hopeful that water levels will hold and spare other cabins and his smokehouse from any more damage."}, {"id": "de5b3f14-0f16-4015-80bb-3d7600635b08", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 05:00", "url": "https://guernseypress.com/news/uk-news/2024/05/19/children-centre-stage-at-chelsea-flower-show-as-green-issues-high-on-agenda/", "message": "Children are taking centre stage at this year’s Chelsea Flower Show, which is being billed as “one of the greenest” in years with a focus on sustainability and the climate crisis.\nYoungsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "019d03b2-9b7f-441b-b21e-3d03f4f905b0", "title": "Carolina Hurricanes re - sign coach Rod BrindAmour and staff to multiyear deals", "date": "2024-05-19 19:15", "url": "https://apnews.com/article/carolina-hurricanes-brindamour-contract-cad84d5afe9c5b3f0d9e0c014e945a07", "message": "RALEIGH, N.C. (AP) — The Carolina Hurricanes have re-signed coach Rod Brind’Amour and his staff to multiyear contracts, keeping one of the best in the NHL behind the bench around for the long term.\nThe team announced the re-signings Sunday for Brind’Amour, assistants Jeff Daniels and Tim Gleason, goaltending coach Paul Schonfelder and video coach Chris Huffine.\n“Rod has been instrumental to the success we’ve had over the last six seasons,” team president and general manager Don Waddell said.\nHe then spent seven seasons as an assistant coach before taking over as a first-time head coach.\n___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://apnews.com/hub/nhl"}, {"id": "8225b7c3-bcf6-43ca-9a4a-95d1f2cea197", "title": "Extreme weather is battering the world . What the cause ? – DW – 05 / 17 / 2024", "date": "2024-05-19 17:00", "url": "https://www.dw.com/en/extreme-weather-is-battering-the-world-whats-the-cause/a-69107065", "message": "Climate change is likely fueling a surge in extreme weather events across the planet.\nSo far, 2024 has been a particularly bad for extreme weather, according to the World Meteorological Organization (WMO), with droughts, extreme heat and floods causing severe damage to health and livelihoods.\n\"Almost every region in the world saw extreme weather and climate events of different natures,\" WMO climate expert Alvaro Silva told DW.\nWhat extreme weather is caused by climate change and what isn't?\nDW looked at three big weather events this year to see if climate change was a decisive factor."}, {"id": "a92103c4-d437-488f-a3ad-347d529061df", "title": "Plains Face a Moderate Risk of Severe Storms Today", "date": "2024-05-19 15:15", "url": "http://www.weathernationtv.com/news/moderate-risk-for-severe-storms-sunday", "message": "19 May 2024 11:30 PMLarge hail and intensely strong winds have already made their presence known in the Plains.\nWinds as high as 82 mph were reported in Russell, Kansas, and hail as large as 3\" in diameter in the city of Ellis.\nThrough tonight, a MODERATE risk (level 4 out of 5) has been issued for portions of Kansas, while the larger risk for more isolated severe storms stretches from Texas to North Dakota.\nDamaging winds are expected to be the most likely hazard (gusts 58+ mph), but large hail (2\"+ in diameter) and a few tornadoes are possible.\nThese storms become more widespread into the early evening before gradually losing strength and organization overnight into Monday morning."}, {"id": "2e38f78d-fad7-4ce2-8711-35268aaa1f5d", "title": "Plains Face a Moderate Risk of Severe Storms Today", "date": "2024-05-19 14:30", "url": "https://www.weathernationtv.com/news/moderate-risk-for-severe-storms-sunday", "message": "19 May 2024 11:30 PMLarge hail and intensely strong winds have already made their presence known in the Plains.\nWinds as high as 82 mph were reported in Russell, Kansas, and hail as large as 3\" in diameter in the city of Ellis.\nThrough tonight, a MODERATE risk (level 4 out of 5) has been issued for portions of Kansas, while the larger risk for more isolated severe storms stretches from Texas to North Dakota.\nDamaging winds are expected to be the most likely hazard (gusts 58+ mph), but large hail (2\"+ in diameter) and a few tornadoes are possible.\nThese storms become more widespread into the early evening before gradually losing strength and organization overnight into Monday morning."}, {"id": "358eadfe-2836-4192-89f5-f5e6c6ce8267", "title": "Sen . Ossoff announces new water pump station for Rockdale County", "date": "2024-05-19 14:30", "url": "https://www.wsbtv.com/news/local/rockdale-county/sen-ossoff-announces-new-water-pump-station-rockdale-county/HYOXXM4S3JALFKHTV7MH7C6WJE/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "3e38b974-b5dd-4dbe-8dab-eb902c020771", "title": "Residents forced out of Canada oil sands hub by wildfire cleared to return , officials say", "date": "2024-05-19 03:30", "url": "https://lasvegassun.com/news/2024/may/18/residents-forced-out-of-canadas-oil-sands-hub-by-w/", "message": "Residents forced out of Canada’s oil sands hub by wildfire cleared to return, officials sayFORT MCMURRAY, Alberta (AP) — Residents who were ordered out of Canada's oil sands hub of Fort McMurray, Alberta, due to a nearby wildfire are clear to return home, authorities said Saturday.\nThe Regional Municipality of Wood Buffalo lifted the evacuation order for the Abasand, Beacon Hill, Prairie Creek and Grayling Terrace neighborhoods on the city’s southern edge.\nThe municipality said local highways were open in both directions and emergency social services, including food and accommodation, will remain available until noon on Sunday.\nThe partial evacuation was familiar terrain for the Albertan city, which survived a catastrophic blaze in 2016 that destroyed 2,400 homes and forced more than 80,000 people to flee.\nElsewhere, the Parker Lake and Patry Creek wildfires continue to threaten the northeastern British Columbia town of Fort Nelson, which remained under an evacuation order."}, {"id": "7c9fa240-d746-451d-a38c-f792ef416cd6", "title": "Among solar storms , the one causing the Carrington Event was BIG", "date": "2024-05-19 15:15", "url": "https://earthsky.org/sun/solar-storms-affect-on-power-grid-internet/", "message": "Solar Cycle 25 is peakingWe’re seeing more solar storms as the sun’s activity increases during solar maximum (video).\nThe Carrington EventStronger solar storms have happened, and one caused havoc with one of the earliest electronic technologies.\nGeomagnetic storms scaleNowadays, the National Oceanic and Atmospheric Administration (NOAA) uses the Geomagnetic Storms scale to measure the strength of these solar eruptions.\nIt gets even scarier when you compare the Carrington Event with the Miyake Event.\nBy comparison, the Carrington Event produced less than 1% increase in Carbon-14, so the Miyake Event likely dwarfed the G5 Carrington Event."}, {"id": "13a9e345-700e-4d17-8717-5b8108b59a31", "title": "Central US faces severe weather threat , with tornadoes , large hail and damaging winds possible", "date": "2024-05-19 13:45", "url": "https://www.aol.com/central-us-faces-severe-weather-052733248.html", "message": "Millions across parts of the Central Plains are at risk for severe weather Sunday that could bring tornadoes, tennis ball-sized hail and damaging winds to the area.\n“Destructive wind swaths of 80-100 mph may occur, with localized extreme gusts exceeding 100 mph possible,” the Storm Prediction Center warned.\nThe severe weather in Houston Thursday included a derecho with 100 mph winds.\n“Scattered severe storms are expected to affect the region Sunday afternoon and evening,” the National Weather Service in Wichita said.\nThrough early next week, the Central US faces an increasing threat of severe weather and excessive rainfall, according to the National Weather Service."}, {"id": "d4e1097a-3a92-45bc-a27e-8c462f417ec9", "title": "Flash floods kill 50 in western Afghanistan", "date": "2024-05-19 01:45", "url": "https://www.thenews.com.pk/print/1190721-flash-floods-kill-50-in-western-afghanistan", "message": "— X@WFP_Afghanistan/FileKABUL: Flash flooding has killed at least 50 people in western Afghanistan, provincial police said Saturday, with some residents reaching safety on higher ground mere minutes before the water hit.\nThe fresh flooding in the country -- which has experienced above-average rainfall this spring -- comes after flash floods on May 10 in northern Baghlan province washed away hundreds.\n“Fifty residents of Ghor province were killed by the floods on Friday and a number of others are missing,” Badri said.\n“These terrible floods have also killed thousands of cattle...\n“Within five minutes of our escape, a huge and horrible flash flood came and washed away everything."}, {"id": "0ca9dea7-f084-47a4-b669-86d6e34c0fef", "title": "  Danger behind the beauty : more solar storms could be heading our way", "date": "2024-05-19 00:00", "url": "https://www.citizen.co.za/news/news-world/more-solar-storms-could-be-heading-our-way/", "message": "‘Danger behind the beauty’: more solar storms could be heading our wayAirlines sometimes change routes during extreme solar storms.\n“We need to understand that behind this beauty, there is danger,” Quentin Verspieren, the European Space Agency’s space safety programme coordinator, told AFP.\n– What threat do solar storms pose?\nThe most famous example came in 1859 during the worst solar storm in recorded history, called the Carrington Event.\nAirlines sometimes change routes during extreme solar storms to avoid this happening, he added."}, {"id": "1bb762c0-fe3f-4bff-8e37-e1c3cfca5158", "title": "TIMELINE : Severe storms may bring Central Florida heavy rain , damaging wind gusts , hail on Sunday", "date": "2024-05-19 18:00", "url": "https://www.yahoo.com/news/timeline-severe-storms-may-bring-131310723.html", "message": "Most areas will remain dry but a few afternoon showers and storms will be possible, mostly across areas south of Orlando.\nOn Tuesday, a few isolated rain chances return with the afternoon seabreeze.\nOriginal story below:Sunday has been declared a FOX Storm Alert Day in Central Florida due to the potential for severe weather.\nAfter a few morning showers and rumbles of thunder across northern areas of Central Florida, better chances of strong to severe storms are possible this afternoon.\nOrlando 7-Day Weather ForecastTHIS WEEK: A cold front will bring scattered rain chances to Central Florida for the start of the work week."}, {"id": "129098a7-630c-462c-a189-8d3a84bca11d", "title": "Zimbabwe to Get Bulk of $60 Million Payout for El Niño - Hit African Nations", "date": "2024-05-19 01:15", "url": "https://www.bloomberg.com/news/articles/2024-05-18/zimbabwe-to-get-bulk-of-60-million-payout-for-el-nino-hit-african-nations", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "7059f333-e54a-46af-9caa-286a29295693", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.stroudnewsandjournal.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "aaa643eb-9161-46ba-bb66-8a929267f28a", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.newsshopper.co.uk/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}, {"id": "e9ebf2d3-5802-4fdf-bec3-21200fc7ff01", "title": "Children centre stage at Chelsea Flower Show as green issues high on agenda", "date": "2024-05-19 04:15", "url": "https://www.irvinetimes.com/news/national/24329989.children-centre-stage-chelsea-flower-show-green-issues-high-agenda/", "message": "Youngsters are also being recruited to judge Chelsea Flower Show gardens for the first time, with 72 children from nine London primary schools participating as junior judges.\nThis year at the Chelsea Flower Show, all the large gardens have gone through a “green audit” as part of efforts to reduce the event’s environmental footprint.\nHelena Pettit RHS director of show, said: “The Green garden audit, all gardens living on after the show and our new environmental innovation award, makes this one of our greenest RHS Chelsea Flower Show’s in recent history.\nThey include “Chelsea repurposed”, designed by Darryl Moore of Cityscapes, a garden made from reused materials from previous years’ RHS Chelsea show gardens, including steel columns from the Daily Telegraph exhibit in 2010.\nAnd willow sculptures of the Queen’s beloved dogs Beth and Bluebell are to make an appearance at the Chelsea Flower Show this year when the Highgrove Gardens shop features for the first time."}]