[{"id": "17e3368f-72a3-40ec-b1b3-8a33e67374cd", "title": "Fire rains down from the sky as Israel launches missile attack on Gaza", "date": "2024-06-04 00:45", "url": "https://www.dailymail.co.uk/news/article-13490561/Israel-missile-attack-Gaza-Middle-East.html", "message": "Fire rains down from the sky during Israel's latest missile attack on Gaza as the Middle Eastern conflict shows no signs of ending.\nPhotographs taken today show smoke and flames engulfing buildings in the Al Bureij Camp in Deir al-Balah — a city in the central Gaza strip.\nIt comes after Israel's military confirmed the deaths of four more hostages held in Gaza since the October 7 attack on a music festival.\n'Under the proposal, Israel will continue to insist these conditions are met before a permanent ceasefire is put in place.\nThe notion that Israel will agree to a permanent ceasefire before these conditions are fulfilled is a non-starter.'"}, {"id": "0bb2591b-cd9b-46a8-8687-d4c756e7d4ee", "title": "Man , 36 , charged with murder over alleged stabbing of surfer Kye Schaefer , 21 , in Coffs Harbour , NSW", "date": "2024-06-04 06:30", "url": "https://www.skynews.com.au/australia-news/crime/man-36-charged-with-murder-over-alleged-stabbing-of-surfer-kye-schaefer-21-in-coffs-harbour-nsw/news-story/066ee48de4d68ac67078e2cc3a207f05?nk=b39ad429d538ab85fe942341d57e220f-1717481840", "message": "NSW Police have charged a man over the alleged murder of 21-year-old surfer Kye Schaefer on the state's north coast.\nAuthorities were called to Ocean Parade, Coffs Harbour about 6:40am on May 2 amid reports a man had been stabbed.\nMr Schaefer was treated by paramedics for injuries to his chest and neck before going to Coffs Harbour Base Hospital where he later died.\nKye Schaefer was fatally stabbed in Coffs Harbour on May 2.\nFlowers at the Park Beach car park scene of the fatal Coffs Harbour stabbing of surfer Kye Schaefer, 21."}, {"id": "14b606bc-31b1-4df6-8de6-61004fc9117b", "title": "US to Buy Norwegian Joint Strike Missile for its F - 35A Stealth Aircraft", "date": "2024-06-04 00:00", "url": "https://theaviationist.com/2024/06/03/us-to-buy-norwegian-jsm/", "message": "F-35A Expands Strike Capabilities with New JSM (Joint Strike Missile) Contract.\n“The Joint Strike Missile (JSM) is an air-launched strike missile and is designed to fit into the internal weapons bay and to fulfil complex missions, such as ASuW (Anti-Surface Warfare) and land attack.\nThe JSM is the air-launched version of Kongsberh’s NSM (Naval Strike Missile).\nThe F-35 cannot carry large missiles like the AGM-158C LRASM (Long-Range Anti-Ship Missile) and the AGM-158A JASSM (Joint Air-to-Surface Standoff Missile) inside its internal weapons bay in the underbelly.\nConsistent with F-35’s ‘Strike Orientation’Like the ship-borne NSM, the JSM too can be used against both ship and land-targets, making it versatile and allowing commanders significant tactical flexibility."}, {"id": "b6644069-49fe-4da9-8d63-306dbabe599f", "title": "German authorities see Islamic extremist motive in Mannheim knife attack", "date": "2024-06-04 08:45", "url": "https://www.newsday.com/news/nation/germany-mannheim-stabbing-attack-investigation-v35231", "message": "BERLIN — German authorities say they have uncovered evidence of an Islamic extremist motive in last week's knife attack in the southwestern city of Mannheim in which a police officer was fatally injured.\nJustice Minister Marco Buschmann wrote on the social media platform X late Monday that “there are now clear indications of an Islamist motive” for the attack and federal prosecutors, who are responsible for terrorism and national security cases, are taking over the investigation.\nThe federal prosecutor's office confirmed Tuesday that it has taken on the investigation, citing the significance of the case and the suspicion that it was religiously motivated.\nThe 29-year-old officer died of his injuries on Sunday.\nPolice quickly put an end to the attack by shooting the assailant, who was wounded."}, {"id": "d960ec70-6858-4ef8-b4b9-6ccbf7cf72f2", "title": "The atomic club", "date": "2024-06-04 04:30", "url": "https://www.thenews.com.pk/print/1196564-the-atomic-club", "message": "Within two weeks of these nuclear tests, Pakistan followed suit by demonstrating its own nuclear capability on May 28, 1998.\nIndia’s aggressive pursuit of its nuclear capability leads us to one conclusion: the international community, throughout history, has largely turned a blind eye towards India’s nuclear developments.\nIn fact, the global nuclear powers, particularly the US, failed to implement stringent measures against India’s nuclear weapons programme.\nPakistan was indeed a reluctant entrant to the nuclear club.\nDespite the potential for heightened tensions following the launch of the missile by India, Pakistan chose to approach the situation with measured calmness."}, {"id": "459f2d8e-b3c6-4d73-bc27-fb91a4e7eab2", "title": "2 Hezbollah fighters die in Lebanon - Newspaper", "date": "2024-06-04 02:45", "url": "https://www.dawn.com/news/1837655/2-hezbollah-fighters-die-in-lebanon", "message": "BEIRUT: Hezbollah said two of its fighters were killed by Israeli fire on Monday, after Lebanese official media reported fatalities in Israeli strikes on a car and a motorcycle in the country’s south.\nAlmost eight months of regular cross-border clas­hes between the Iran-backed Hezbollah group, a Hamas ally, and Israel have intensified in recent days.\nThe latest violence came as Iran’s acting foreign minister Ali Bagheri was visiting Lebanon, where he was expected to meet Hezbollah leader Hassan Nasrallah.\nOn Sunday, Hezbollah said its fighters had bombarded two army positions in the Israeli-annexed Golan Heights after deadly Israeli strikes on south Lebanon, which an official said killed two shepherds.\nThe violence since early October has killed at least 453 people in Lebanon, mostly fighters but including 88 civilians, according to a tally."}, {"id": "c09b8fd5-a3a0-4bd7-a4a5-d84c2d54826e", "title": "BBC pundit forced to apologise after posting image of Rishi Sunak , President Biden and other world leaders with Hitler moustaches that labelled them the  Kids Killers Union  ", "date": "2024-06-04 01:00", "url": "https://www.dailymail.co.uk/news/article-13491255/BBC-pundit-forced-apologise-posting-image-Rishi-Sunak-President-Biden-world-leaders-Hitler-moustaches-labelled-Kids-Killers-Union.html", "message": "A BBC pundit has been forced to apologise after posting an image of Rishi Sunak, President Biden and other world leaders with Hitler moustaches.\nQasim Sheikh, a former Scotland international cricketer, reposted the picture of the prime minister, along with other world leaders with the caption 'Kids Killers Union'.\nThe post featured President Biden, Binyamin Netanyahu, the Israeli prime minister, Olaf Scholz, the German chancellor and Ursula von der Leyen, the president of the European Commission.\nThe sports pundit, 39, shared the post in January as well as other inflammatory statements appearing to justify the horrific October 7 attacks on Israel.\nTo make it even worse the oppressor Israel has tried to blame someone else for the bombing.'"}, {"id": "3a3c93e8-4979-42c7-b7e7-fc50ce8f9613", "title": "Yemen Houthis claim launching missiles at Israeli port city", "date": "2024-06-04 03:00", "url": "https://article.wn.com/view/2024/06/04/Yemens_Houthis_claim_launching_missiles_at_Israeli_port_city/", "message": "Yemen's Houthi group on Monday said they launched a ballistic missile attack on southern Israel's port city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted a military site in Eilat with a new self-made missile called \"Palestine,\" said the Houthi... read full story"}, {"id": "f9d51cab-3382-443c-89c8-4b58f5792068", "title": "New Jersey man stabs mother to death while she was sleeping : Police", "date": "2024-06-04 07:15", "url": "https://www.yahoo.com/news/jersey-man-stabs-mother-death-065334025.html", "message": "New Jersey man stabs mother to death while she was sleeping: PoliceNew Jersey man stabs mother to death while she was sleeping: PoliceA New Jersey man has been arrested after allegedly stabbing his mother to death while she slept, police say.\nMORE: Person killed after being sucked into plane's turbine engine on runway“An investigation involving members of the Major Crimes Bureau and the Howell Township Police Department revealed the Robert Parody had entered his mother’s bedroom and stabed her in the chest while she slept,” authorities said.\n“He remains lodged at the Monmouth County Correctional Institution pending a detention hearing.”The Howell Township Police Department responded shortly after 1:30 a.m. and reported to the Monmouth County Prosecutor’s Office Major Crimes Bureau that a stabbing had taken place.\nPolice did not reveal a possible motive in the case or whether the suspect or the victim were known to authorities before the attack.\nNew Jersey man stabs mother to death while she was sleeping: Police originally appeared on abcnews.go.com"}, {"id": "acde03be-0695-4308-9634-fa2a8b77324a", "title": "Russian missile attack on Ukraine Dnipro injures seven people , including two children - World", "date": "2024-06-04 09:00", "url": "https://www.brecorder.com/news/40306808/russian-missile-attack-on-ukraines-dnipro-injures-seven-people-including-two-children", "message": "KYIV: Russian missile attack on the central city of Dnipro injured seven people, including two children, and damaged civilian infrastructure in early hours of Tuesday, local authorities said.\nUkrainian air force said it shot down two Iskander-K cruise missiles over the region.\nThe missile debris damaged civilian infrastructure, causing a fire and injuring residents, according to Serhiy Lysak, the regional governor.\nThree killed, 20 injured in Russian strikes on southern UkraineThe attack damaged cars and knocked windows out in residential buildings and a hospital, Lysak wrote via Telegram messaging app.\nRussian forces also launched four drones in the overnight attack – Ukrainian air force said it shot down two of them over the northern region of Chernihiv."}, {"id": "22c867cb-4393-4766-9b4a-a491fa9f4531", "title": "New Jersey man stabs mother to death while she was sleeping : Police", "date": "2024-06-04 09:15", "url": "https://6abc.com/new-jersey-man-stabs-mother-to-death-while-she-was-sleeping-police/14908956/", "message": "New Jersey man stabs mother to death while she was sleeping: PoliceA New Jersey man has been arrested after allegedly stabbing his mother to death while she slept, police say.\n\"An investigation involving members of the Major Crimes Bureau and the Howell Township Police Department revealed the Robert Parody had entered his mother's bedroom and stabed her in the chest while she slept,\" authorities said.\n\"He remains lodged at the Monmouth County Correctional Institution pending a detention hearing.\"\nThe Howell Township Police Department responded shortly after 1:30 a.m. and reported to the Monmouth County Prosecutor's Office Major Crimes Bureau that a stabbing had taken place.\n\"The first arriving officers quickly located Robert Parody and took him into custody without incident, while Loretta Parody was transported to a local hospital for emergency treatment, where she was later pronounced deceased,\" authorities said."}, {"id": "bb22c8b7-6799-43b9-b49a-03cbc192d155", "title": "New Jersey man stabs mother to death while she was sleeping : Police", "date": "2024-06-04 08:45", "url": "https://abc7news.com/new-jersey-man-stabs-mother-to-death-while-she-was-sleeping-police/14908956/", "message": "New Jersey man stabs mother to death while she was sleeping: PoliceA New Jersey man has been arrested after allegedly stabbing his mother to death while she slept, police say.\n\"An investigation involving members of the Major Crimes Bureau and the Howell Township Police Department revealed the Robert Parody had entered his mother's bedroom and stabed her in the chest while she slept,\" authorities said.\n\"He remains lodged at the Monmouth County Correctional Institution pending a detention hearing.\"\nThe Howell Township Police Department responded shortly after 1:30 a.m. and reported to the Monmouth County Prosecutor's Office Major Crimes Bureau that a stabbing had taken place.\n\"The first arriving officers quickly located Robert Parody and took him into custody without incident, while Loretta Parody was transported to a local hospital for emergency treatment, where she was later pronounced deceased,\" authorities said."}, {"id": "fd1fec64-d325-434e-9a39-a9788e77d4ad", "title": "Nuclear war is unimaginable – but US author wants us to try", "date": "2024-06-04 02:00", "url": "https://www.nzherald.co.nz/the-listener/books/nuclear-war-is-unimaginable-but-us-author-wants-us-to-try/HQHNZSFVKFA6ZAZWWDWLK27XJA/", "message": "Gone in 72 minutes: Writer Anne Jacobson outlines a nuclear war scenario that sees our world destroyed in little more than one hour.\nPhoto / Getty ImagesBook review: Day in and day out, the American Secret Service trains its staff for nuclear war.\nNuclear war is unimaginable – but Jacobsen would like you to try.\nHer minute by minute timeline of unfolding Armageddon reveals long practised US and Russian plans for nuclear war.\nA nuclear war, of the kind planned for and rehearsed by the US and Russian military, will lead to the deaths of billions of people."}, {"id": "18521fb6-13de-4ec6-bed9-9445807e692c", "title": "Russian missile attack on Ukraine Dnipro injures seven people , including two children", "date": "2024-06-04 07:00", "url": "https://gazette.com/news/us-world/russian-missile-attack-on-ukraines-dnipro-injures-seven-people-including-two-children/article_23e1ee12-d04c-58a1-a123-8702c5957ec8.html", "message": "KYIV (Reuters) - Russian missile attack on the central city of Dnipro injured seven people, including two children, and damaged civilian infrastructure in early hours of Tuesday, local authorities said.\nUkrainian air force said it shot down two Iskander-K cruise missiles over the region.\nThe missile debris damaged civilian infrastructure, causing a fire and injuring residents, according to Serhiy Lysak, the regional governor.\nThe attack damaged cars and knocked windows out in residential buildings and a hospital, Lysak wrote via Telegram messaging app.\nRussian forces also launched four drones in the overnight attack -- Ukrainian air force said it shot down two of them over the northern region of Chernihiv."}, {"id": "74338618-5188-4bbf-bd2e-d6eb99c18827", "title": "Sherlock Holmes - Talking Pictures TV", "date": "2024-06-04 02:45", "url": "https://www.tvguide.co.uk/schedule/cdb90c2c-2943-5f73-bef7-021becbaf00f/sherlock-holmes", "message": "Sherlock HolmesTalking Pictures TV 8:00 AM to 8:35 AM Tuesday 4 June Share Add toCalendar +The Case of the Reluctant Carpenter Season 1 Episode 21 of 39 S SubtitlesCovent Garden is rocked by a bombing, and the culprit threatens to strike again if his demands are not met.\nHolmes and Watson race against time to find the second deviceSherlock Holmes airs on Talking Pictures TV at 8:00 AM, Tuesday 4 June .\n(Subtitles.)\nLearn more about Sherlock Holmes and other movie/drama on our drama page"}, {"id": "6b611eae-1498-4fe6-80c4-a39c6727fd81", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 03:45", "url": "https://www.illawarramercury.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "d23beaa0-8d98-47dc-84dd-96b843a703ad", "title": "Houthis claim launching missiles at Israeli port city", "date": "2024-06-04 03:00", "url": "https://www.prokerala.com/news/articles/a1536644.html", "message": "Sanaa, June 4 : Yemen's Houthi group has said they launched a ballistic missile attack on southern Israel's port city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted on Monday a military site in Eilat with a new self-made missile called \"Palestine\", said the Houthi official, claiming that \"the operation achieved its goal successfully\", Xinhua news agency reported.\nHe also pledged continued military operations \"in support of the Palestinian people\" until Israel stops its attacks on the Palestinian enclave.\nEarlier on Monday, Israeli media outlets reported that the Israeli forces in Eilat intercepted a ballistic missile coming from the direction of the Red Sea.\nSeveral ships had been reportedly damaged by Houthi attacks."}, {"id": "5bd3343e-501a-421b-9958-3618791e7ad1", "title": "Kye Schaefer breakthrough : Man is charged with murdering surfer after leaving the water in Coffs Harbour", "date": "2024-06-04 03:00", "url": "https://www.dailymail.co.uk/news/article-13491525/Kye-Schaefer-man-charged-murder-surfer.html", "message": "A man has been charged with murder after a young surfer was allegedly stabbed to death moments after leaving the water.\nKye Schaefer, 21, was allegedly stabbed in the neck and chest after stepping out of the surf at Park Beach on Ocean Parade in Coffs Harbour around 6.40am on May 2.\nNSW Police revealed on Tuesday a 36-year-old homeless man had been arrested at a Coffs Harbour correctional facility.\nThe man was refused bail to appear before Coffs Harbour Local Court on Tuesday.\nKye was treated at the scene and transported to Coffs Harbour Base Hospital, but died shortly after arriving from serious neck and chest wounds."}, {"id": "c34b6738-9678-4a4d-b516-b8304ff3776b", "title": "Mishawaka teen charged with stabbing mom , 2 dogs ruled insane", "date": "2024-06-04 01:15", "url": "https://wsbt.com/news/local/mishawaka-teen-charged-with-stabbing-mom-13-times-2-dogs-ruled-reason-insanity-acquitted-manipulated-satan-kill-demon-police-investigation-not-trial-mother-agrees-mental-health-ill-dangerous-disabled", "message": "No trial for the Mishawaka teen accused of stabbing his s.The courts say 17-year-old Caden Rutledge who was being charged as an adult, is not responsible by reason of insanity.\nDuring the investigation Rutledge claims he was manipulated by Satan to stab his mother and 2 dogs when questioned by police.\nCaden Rutledge was set for trial until the courts ruled him not responsible by reason of insanity.\nBack in August of 2023, Mishawaka Police found Rutledge's mother bleeding from multiple stab wounds to her face, neck and head at her neighbor's home.\nRutledge admitted stabbing his mother to \"kill the demon inside of her and that it was the right thing to do.\""}, {"id": "7e496f53-db8a-4197-82f3-c4a84a4e6961", "title": "Houthis Claim Launching Missiles At Israeli Port City", "date": "2024-06-04 02:00", "url": "https://menafn.com/1108292275/Houthis-Claim-Launching-Missiles-At-Israeli-Port-City", "message": "(MENAFN- IANS) Sanaa, June 4 (IANS) Yemen's Houthi group has said they launched a ballistic missile attack on southern Israel's city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted on Monday a military site in Eilat with a new self-made missile called \"Palestine\", said the Houthi official, claiming that \"the operation achieved its goal successfully\", Xinhua news agency reported.\nHe also pledged continued military operations \"in support of the Palestinian people\" until Israel stops its on the Palestinian enclave.\nEarlier on Monday, Israeli media outlets reported that the Israeli forces in Eilat intercepted a ballistic missile coming from the direction of the Red Sea.\nSeveral ships had been reportedly damaged by Houthi attacks."}, {"id": "e4c82703-2e87-4d43-9c48-b83fa3c06f96", "title": "7 Podiatrist - Recommended Products For Relieving Plantar Fasciitis Pain", "date": "2024-06-04 05:15", "url": "https://www.buzzfeed.com/tessaflores/best-products-for-plantar-fasciitis", "message": "We hope you love our recommendations!\nSome may have been sent as samples, but all were independently selected by our editors.\nJust FYI, BuzzFeed and its publishing partners may collect a share of sales and/or other compensation from the links on this page."}, {"id": "84fc05fc-8930-4ec9-90e4-3d7a5fa36f8b", "title": "The Latest | 2 Palestinians are killed in the West Bank", "date": "2024-06-04 09:00", "url": "https://www.kob.com/news/us-and-world-news/the-latest-2-palestinians-are-killed-in-the-west-bank/", "message": "The Israeli military said Tuesday it killed two Palestinians, who it claimed were attempting to launch a shooting attack toward Israeli communities from the occupied West Bank.\nPalestinian authorities said two men were shot dead by Israeli forces during a raid in the occupied West Bank on Monday.\n2 PALESTINIANS ARE KILLED IN THE OCCUPIED WEST BANKTEL AVIV, Israel — The Israeli military said Tuesday it killed two Palestinians who it claimed were attempting to launch a shooting attack toward Israeli communities from the occupied West Bank.\nThe military said the two approached the West Bank separation barrier and were killed by Israeli forces.\nA surge of violence has gripped the West Bank since the October start of the Israel-Hamas war in Gaza."}, {"id": "32f08b79-fbb3-4ec0-b65a-287040dc8fae", "title": "Revealed : Afghan knifeman who killed cop at anti - Islam rally arrived in Germany as an unaccompanied child , became an unemployed father of two , and was deemed  well integrated  before murderous rampage", "date": "2024-06-04 08:15", "url": "https://www.dailymail.co.uk/news/article-13492069/anti-islam-rally-germany-murder-afghan-knifeman.html", "message": "The Afghan knifeman who went on a murderous rampage at an anti-Islam rally in Germany last week is a father-of-two who practiced Taekwondo and had been 'well integrated', sources told German media.\nBut neighbours of the Afghan knifeman claimed he had begun to show signs he was being 'radicalised' over the last year.\nOne local man whose parents live in the same high-rise as the knifeman told MailOnline the killer was friendly, but largely kept himself to himself - as did his wife.\nAnother neighbour told German outlet Focus: '(His wife) was colder, not as friendly as him.\nMembers of the right-wing AfD and Junge Freiheit parties held a protest on Mannheim's market square on Sunday afternoon, as pro-peace activists held a counter protest."}, {"id": "32c596e7-3877-4eb6-8fb7-3e7b4ea8a6f6", "title": "The Latest | Four more Israeli hostages declared dead , and Palestinians seek to join genocide case", "date": "2024-06-04 03:30", "url": "https://wtop.com/national/2024/06/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan/", "message": "At the top U.N. court, Palestinian officials asked Monday to join South Africa’s case accusing Israel of committing genocide in Gaza.\nCurrently:— Israel declares four hostages are dead in Gaza, including three older men who appeared in video.\nWhen Biden made the announcement he called it an Israeli offer that includes an “enduring cease-fire” and Israeli withdrawal from Gaza if Hamas releases all hostages it is holding.\nIn the second phase, all remaining living hostages would be released including soldiers, and Israeli forces would withdraw from Gaza.\nBiden last week announced what he called an Israeli offer that includes an “enduring cease-fire” and Israeli withdrawal from Gaza if Hamas releases all hostages it is holding."}, {"id": "13ec69bc-716a-4071-9912-90a3ca7bccf4", "title": "Iran Update , June 3 , 2024 | Institute for the Study of War", "date": "2024-06-04 02:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-june-3-2024", "message": "Iran Update, June 3, 2024Ashka Jhaveri, Annika Ganzeveld, Andie Parry, Kathryn Tyson, Kelly Campa, Kitaneh Fitzpatrick, and Brian CarterInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\n[63]Key Takeaways:Iranian Presidential Elections: Hardliners overwhelmingly dominate the candidate pool for the upcoming Iranian presidential election.\n[71] Israeli forces located tunnel shafts, and a weapons stash including long-range rockets, ”combat transmission systems,” and explosive charges.\n[74] Three Palestinian militias have mortared Israeli forces along the Egypt-Gaza Strip border since CTP-ISW's last data cut off on June 2.\n[85] The al Aqsa Martyrs’ Brigades fired small arms and detonated IEDs targeting Israeli forces in the Balata refugee camp in Nablus."}, {"id": "0536989e-461b-4f84-8e3d-6413a72f4a31", "title": "The Latest | 2 Palestinians are killed in the West Bank", "date": "2024-06-04 09:00", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/the-latest-2-palestinians-are-killed-in-the-west-bank/article_0babc068-088c-51b5-aa53-73e2eb7a98d9.html", "message": "The Latest | 2 Palestinians are killed in the West BankThe Israeli military says it killed two Palestinians, who it claimed were attempting to launch a shooting attack toward Israeli communities from the occupied West Bank"}, {"id": "3729b26c-0a77-4859-bb47-0fcbdc076c7c", "title": "Tuesday June 4th - Open Thread - The Last Refuge", "date": "2024-06-04 06:15", "url": "https://theconservativetreehouse.com/blog/2024/06/04/tuesday-june-4th-open-thread-2/comment-page-1/", "message": "Our Father, who art in heaven, hallowed be thy Name.\nThy kingdom come.\nAnd forgive us our trespasses, as we forgive those who trespass against us.\nAnd lead us not into temptation, but DELIVER US FROM EVIL.\nFor Thine is the kingdom and the power and the glory, forever and ever."}, {"id": "47ed7e23-a774-49ef-a683-bcda2cf14497", "title": "Tuesday June 4th - Open Thread - The Last Refuge", "date": "2024-06-04 06:15", "url": "https://theconservativetreehouse.com/blog/2024/06/04/tuesday-june-4th-open-thread-2/", "message": "Our Father, who art in heaven, hallowed be thy Name.\nThy kingdom come.\nAnd forgive us our trespasses, as we forgive those who trespass against us.\nAnd lead us not into temptation, but DELIVER US FROM EVIL.\nFor Thine is the kingdom and the power and the glory, forever and ever."}, {"id": "4dbc344e-508b-4a64-9355-e5d7d9477e9e", "title": "Ukraine claims it hit missile system in Russian territory with Western weapons", "date": "2024-06-04 03:00", "url": "https://us.cnn.com/2024/06/03/europe/ukraine-western-weapons-hit-russian-territory-intl-latam/", "message": "CNN —Ukrainian forces claimed Monday that they had successfully hit a Russian S-300 missile system using Western-supplied weapons inside Russian territory.\nOn Russian territory.\nThe first days after permission to use Western weapons on enemy territory,” Ukrainian government minister Iryna Vereshchuk posted on Facebook alongside a picture purporting to show the strike.\nThis comes just days after US President Joe Biden gave Ukraine permission to carry out limited strikes using US weapons in Russian territory around Kharkiv, after several European nations had removed restrictions on how the weapons can be used.\nUkrainian President Volodymyr Zelensky has praised Biden’s decision to allow some strikes in Russian territory as a “step forward” that will help his forces defend the embattled Kharkiv region."}, {"id": "392e628c-12d1-4c53-a9e2-5c4801c35802", "title": "16 killed in Israeli strike near Aleppo", "date": "2024-06-04 03:00", "url": "https://article.wn.com/view/2024/06/04/16_killed_in_Israeli_strike_near_Aleppo/", "message": "BEIRUT: A war monitoring body on Monday said that 16 members from groups’ allied with Iran, were killed in an Israeli strike near the northern Syrian city of Aleppo.\nState media also reported the ‘deadly Israeli attack’.\n“The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has... read full story\"The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters\""}, {"id": "37e9ce3c-947b-469b-895c-36ae8c40d97e", "title": "As PM Modi awaits his third big win , here how BJP created history during the 2014 & 2019 Lok Sabha elections", "date": "2024-06-04 07:15", "url": "https://www.businessinsider.in/politics/elections/article/as-pm-modi-awaits-his-third-big-win-heres-how-bjp-created-history-during-the-2014-2019-lok-sabha-elections/articleshow/110692557.cms", "message": "But the main duelling parties remain consistent with previous trends: the ruling Bharatiya Janata Party () led by Prime Ministerand the opposition bloc led by the(INC).\nHowever, the early trends are showing a very different picture with the INDIA bloc exceeding expectations in many states.\nThe BJP was in power for a considerable amount of time under Atal Bihari Vajpayee’s leadership at the turn of the century.\nAnd it worked!BJP came to power again in the 2019 Lok Sabha elections, this victory being bigger than the last.\nOnly time will tell if the struggles during the last phases of this year’s election will come back to haunt him.In the meantime, stay tuned to Business Insider India for more updates on the Lok Sabha elections 2024"}, {"id": "e22574fe-9dc1-4a07-a610-22281ec395d5", "title": "Ukraine The Expendable Vanguard For World War III", "date": "2024-06-04 06:15", "url": "https://www.armstrongeconomics.com/international-news/ukraine/ukraine-the-expendable-vanguard-for-world-war-iii/", "message": "The West has threatened Russia that just one nuke in Ukraine would unleash all nuclear weapons pointed at Russia.\nUkraine targeted with drones Russia’s strategic air defense radar system that has NOTHING to do with Ukraine.\nThis Ukraine War is a petri dish for advancing warfare.\nThey have stated that they stand with Ukraine and are prepared to sacrifice all of Europe for Ukraine.\nThe strategy is to try to intimidate Russia into allowing NATO to destroy them without nuclear war."}, {"id": "757cfecb-ab95-4197-bb2d-86088fba28a3", "title": "16 killed in Israeli strike near Aleppo - Newspaper", "date": "2024-06-04 02:45", "url": "https://www.dawn.com/news/1837658/16-killed-in-israeli-strike-near-aleppo", "message": "BEIRUT: A war monitoring body on Monday said that 16 members from groups’ allied with Iran, were killed in an Israeli strike near the northern Syrian city of Aleppo.\n“The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters” stated the Syrian Observatory for Human Rights.\nA Syrian defence ministry statement read “after midnight, the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions” near the city.\nOn Wednesday, according to the Observatory, Israeli strikes in western and central Syria killed a girl and six fighters working with Hezbollah (including three Syrians).\nIn March, the Observatory had said that Israeli air strikes near Aleppo’s airport had killed 52 people."}, {"id": "594623ad-5d24-4754-a68b-f4f50d798a19", "title": "Russia Ukraine war live : Kyiv fires US weapon Himars inside Russia for the first time", "date": "2024-06-04 04:30", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-live-news-putin-weapons-b2556153.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Vladimir Putin faced a rare protest in Moscow by Russian women who demanded his defence minister Andrei Belousov return their mobilised husbands from the frontline in Ukraine.\nA group of 18 women gathered to appeal personally to Belousov, who was appointed to the role last month.\nMeanwhile, Russian sources claimed that Ukraine fired American weapons at Belgorod for the first time after Washington lifted a ban on Kyiv using its weapons inside Russia.\nThe escalation comes as Norway’s top general warned that Nato’s window of preparing against Russia had dwindled from about 10 years to two-three years."}, {"id": "acf2d3bd-153a-4125-acf0-0e422781de85", "title": "Ukraine claims it hit missile system inside Russian territory using Western weapons - LocalNews8 . com", "date": "2024-06-04 02:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/03/ukraine-claims-it-hit-missile-system-inside-russian-territory-using-western-weapons/", "message": "By AnneClaire Stapleton and Christian Edwards, CNN(CNN) — Ukrainian forces claimed Monday that they had successfully hit a Russian S-300 missile system using Western-supplied weapons inside Russian territory.\nOn Russian territory.\nThe first days after permission to use Western weapons on enemy territory,” Ukrainian government minister Iryna Vereshchuk posted on Facebook alongside a picture purporting to show the strike.\nThis comes just days after US President Joe Biden gave Ukraine permission to carry out limited strikes using US weapons in Russian territory around Kharkiv, after several European nations had removed restrictions on how the weapons can be used.\nUkraine has frequently targeted occupied Crimea, which Russia annexed in 2014, using “Storm Shadow” missiles provided by the United Kingdom."}, {"id": "13548b2f-9d6f-4ee2-8217-bbe3363060b9", "title": "Israel - Hamas : Israel declares four more hostages dead in Gaza", "date": "2024-06-04 00:00", "url": "https://www.theage.com.au/world/middle-east/mark-of-disgrace-israel-declares-four-hostages-dead-in-gaza-20240604-p5jj0b.html", "message": "Jerusalem: Four more hostages kidnapped on October 7 last year have been declared dead by the Israeli military, including three older adults seen in a Hamas video begging to be released.\nThe announcement on Tuesday heightens pressure on the Israeli government to agree to a US ceasefire proposal that could secure the return of the hostages still held in Gaza and end the eight-month war.\nDeceased hostage Nadav Popplewell.\nCredit: Hostages Families Forum Headquarters via APMilitants are believed to be holding about 80 hostages alive and the remains of 43 others.\nSince the Biden administration announced the three-phase ceasefire proposal on Saturday, Israel has seen some of its largest protests calling on the government to bring the surviving hostages home."}, {"id": "ceb5e3f4-dd8f-4fe5-8af6-322704b6e390", "title": "Homeless man charged with young surfer stabbing", "date": "2024-06-04 05:15", "url": "https://www.juneesoutherncross.com.au/story/8651498/homeless-man-charged-with-young-surfers-stabbing/?cs=6417", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "bc56b208-18f4-44ed-9f4f-9d4bd62c5ada", "title": "Homeless man charged with young surfer stabbing", "date": "2024-06-04 05:15", "url": "https://www.maitlandmercury.com.au/story/8651498/homeless-man-charged-with-young-surfers-stabbing/", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "fe56fa90-a94d-4a45-a462-19515ea2c923", "title": "Homeless man charged with young surfer stabbing", "date": "2024-06-04 06:00", "url": "https://www.bluemountainsgazette.com.au/story/8651498/homeless-man-charged-with-young-surfers-stabbing/?cs=30776", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "5d3766cc-3ca8-4fd3-98a9-8c0fcdbfeb32", "title": "Four more Israeli hostages have died in Hamas custody", "date": "2024-06-04 01:15", "url": "https://www.nbcdfw.com/news/national-international/four-more-israeli-hostages-died-hamas-custody/3558188/", "message": "But in March, Al-Qassam Brigades spokesperson Abu Ubaida announced that Perry, Metzger and Cooper were among the seven hostages killed in an Israeli airstrike on Gaza.\nLast month, Popplewell was seen in a propaganda video released by Hamas, Israeli media reported.\nPopplewell's elderly mother, Hanna Perry, was among a group of more than a dozen Israeli hostages who were released on Nov. 24 as part of a temporary cease-fire deal.\n“We are really worried about their condition.”Perry, who was also 80, and lived in the same kibbutz as Metzger, Hagari said.\nSome 125 Israeli hostages remain in captivity nearly eight months after they were abducted in a deadly surprise attack by Hamas that sparked the ongoing war in Gaza."}, {"id": "595ad093-483a-4047-adea-a70a6b7ceb62", "title": "Nigerian Newspapers : 10 things you need to know Tuesday morning", "date": "2024-06-04 06:00", "url": "https://dailypost.ng/2024/06/04/nigerian-newspapers-10-things-you-need-to-know-tuesday-morning-27/", "message": "Organised Labour threw the nation into darkness after shutting down the national grid in the wee hours of Monday.\nIt was the first day of the indefinite strike it called to protest the stalled talks on minimum wage.\nThe agreement was reached after the first day of an indefinite strike declared by the organised labour.\nHoodlums on Monday attacked some members of the Nigeria Labour Congress, NLC, enforcing the ongoing indefinite strike in Jos, the Plateau State capital.\nThe immediate past governor of Sokoto State and senator representing Sokoto South, Aminu Waziri Tambuwal, has cautioned President Bola Tinubu to stop dissociating himself from Muhammadu Buhari’s administrative failure."}, {"id": "e9dc8584-6fa0-485a-86db-39add82d9131", "title": "Israel - Hamas : Israel declares four more hostages dead in Gaza", "date": "2024-06-04 00:15", "url": "https://www.brisbanetimes.com.au/world/middle-east/mark-of-disgrace-israel-declares-four-hostages-dead-in-gaza-20240604-p5jj0b.html", "message": "Jerusalem: Four more hostages kidnapped on October 7 last year have been declared dead by the Israeli military, including three older adults seen in a Hamas video begging to be released.\nThe announcement on Tuesday heightens pressure on the Israeli government to agree to a US ceasefire proposal that could secure the return of the hostages still held in Gaza and end the eight-month war.\nDeceased hostage Nadav Popplewell.\nCredit: Hostages Families Forum Headquarters via APMilitants are believed to be holding about 80 hostages alive and the remains of 43 others.\nSince the Biden administration announced the three-phase ceasefire proposal on Saturday, Israel has seen some of its largest protests calling on the government to bring the surviving hostages home."}, {"id": "bce4c59b-9919-489c-b154-d3786cc5db3e", "title": "Israel declares 4 more hostages dead in Gaza , including 3 older men from Hamas video", "date": "2024-06-04 02:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/06/501_375929.html", "message": "Four more hostages kidnapped on Oct. 7 were declared dead by the Israeli military — including three older men seen in a Hamas video begging to be released.\nAbout 80 hostages in Gaza are believed to be alive, alongside the remains of 43 others.\nAlthough Biden said the proposal was Israeli, the Israeli leadership has appeared to distance itself from the plan, vowing to keep conducting military operations against Hamas until the militant group is destroyed.\nIsraeli bombardments and ground operations in Gaza have killed more than 36,000 Palestinians, according to Gaza’s Health Ministry , which does not distinguish between combatants and civilians.\nIsrael has been expanding its offensive in the southern city of Rafah, once the main hub of humanitarian aid operations."}, {"id": "5d0d1d11-bba4-490a-912a-870e8ec65347", "title": "SFPD investigating stabbing on Muni bus in the Mission District", "date": "2024-06-04 05:15", "url": "https://www.ktvu.com/news/sfpd-investigating-stabbing-muni-bus-mission-district", "message": "articleThe San Francisco Police Department is investigating a non-fatal stabbing on a Muni bus in the Mission District on Monday.\nPolice said officers responded to the area of 18th and Mission streets at around 3:40 p.m.\nThey were told a victim was stabbed by an unknown suspect last seen in the area of 24th and Mission streets.\nParamedics transported the victim to a local hospital.\nNo suspect information was available."}, {"id": "5c459e8c-b9b5-4d7a-9184-719597ab6ab9", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.yasstribune.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=14264", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "5023a24b-488f-4ead-a40f-6a0485d47021", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.muswellbrookchronicle.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=9676", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "8c7e8926-e20c-45c9-b315-2a1765c8f2d3", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.theleader.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=30776", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "68ce5d93-7a89-4bab-8507-08f0feced52c", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:30", "url": "https://www.northerndailyleader.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "164cd295-62cd-45a8-8b1a-e8ebaa241705", "title": "OC rideshare driver who shot suspect allegedly assaulting woman could face charges", "date": "2024-06-04 00:30", "url": "https://www.foxla.com/news/rideshare-driver-stanton-shoots-man-assaulting-woman", "message": "A man was hospitalized after being shot by a rideshare driver who allegedly witnessed the man assaulting a woman and took action to stop the attack.\nIt is unclear what happened next, but authorities said the rideshare driver shot the suspect.\nThe man assaulting the woman, only identified as a 20-year-old, sustained a gunshot wound and was taken to the hospital in critical but stable condition.\nThe sheriff's office said the rideshare driver remained at the scene and called dispatch to report the shooting.\nHe may face charges pending further investigation, the sheriff’s office said in a statement."}, {"id": "96bdf3e0-1855-4f1d-8ea8-d1c507c1c97b", "title": "Four more Israeli hostages have died in Hamas custody", "date": "2024-06-04 01:00", "url": "https://www.nbcwashington.com/news/national-international/four-more-israeli-hostages-died-hamas-custody/3631679/", "message": "But in March, Al-Qassam Brigades spokesperson Abu Ubaida announced that Perry, Metzger and Cooper were among the seven hostages killed in an Israeli airstrike on Gaza.\nLast month, Popplewell was seen in a propaganda video released by Hamas, Israeli media reported.\nPopplewell's elderly mother, Hanna Perry, was among a group of more than a dozen Israeli hostages who were released on Nov. 24 as part of a temporary cease-fire deal.\n“We are really worried about their condition.”Perry, who was also 80, and lived in the same kibbutz as Metzger, Hagari said.\nSome 125 Israeli hostages remain in captivity nearly eight months after they were abducted in a deadly surprise attack by Hamas that sparked the ongoing war in Gaza."}, {"id": "1a0e426f-0d00-41c5-a9e7-3246e8c61c28", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:30", "url": "https://www.newcastleherald.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "9c5efd47-de79-4a64-bc59-9d98b2fdc035", "title": "Japan Nagasaki holds off inviting Israel to peace ceremony", "date": "2024-06-04 09:00", "url": "https://www.al-monitor.com/originals/2024/06/japans-nagasaki-holds-inviting-israel-peace-ceremony", "message": "Israel launched a blistering military offensive in Gaza nearly eight months ago, following an attack by Palestinian militant group Hamas on the country.\nThe Palestinian envoy has been invited to the ceremony in Nagasaki, local officials told AFP on Tuesday.\n- Nagasaki, Hiroshima ceasefire push -Nagasaki has instead sent a letter to the Israeli embassy in which \"we call for an immediate ceasefire\", Suzuki said.\nHiroshima has invited Israel to this year's ceremony, but in its letter called for a \"ceasefire as soon as possible and resolution through dialogue\", a city official said.\nAccording to local media, Hiroshima has never invited a Palestinian representative to its ceremony."}, {"id": "0d027577-79e9-443f-b699-dd953cf9994d", "title": "ICC Men T - 20 WC : South Africa beat Sri Lanka by 6 wickets on tricky New York pitch - Breaking News", "date": "2024-06-04 07:15", "url": "https://www.dailymirror.lk/breaking-news/ICC-Men-s-T-20-WC-South-Africa-beat-Sri-Lanka-by-6-wickets-on-tricky-New-York-pitch/108-284005", "message": "Sri Lanka, known for their explosive batting and crafty spin bowling, will take on South Africa, a team renowned for their all-round strength and resilience.\nSince the start of 2023, South Africa have struggled in T20Is, losing nine of the 11 matches they have completed.\nSri Lanka, on the other hand, come into this match with momentum, having won their last three T20I series in a row.\nA decade after their T20 World Cup triumph, they boast a potent bowling attack.\nLet's dive into the excitement of the T20 World Cup!"}, {"id": "fbd24c61-3081-40e4-a60a-3a71e8b7b567", "title": "US  Green Lights  Strikes on Russia , Reality Behind Kerch Port Attack , Czech Ammo Bid Falls Short – The Greanville Post", "date": "2024-06-04 03:45", "url": "https://www.greanvillepost.com/2024/06/03/us-green-lights-strikes-on-russia-reality-behind-kerch-port-attack-czech-ammo-bid-falls-short/", "message": "Jun 1, 2024Update on the conflict in Ukraine for Sunday, June 2, 2024…US greenlights use of American weapons on Russian territory, however this is a process that has been ongoing for decades, it is simply taking place more openly now The New York Times has previously admitted that the US built up the Ukrainian intelligence and military units conducting attacks including terrorism inside Russia since 2022.\nDaily Reports on Ukraine:Kalibrated (YouTube): / @kalibratedwithscottKalibrated (Telegram): https://t.me/kalibratedThe Duran (Telegram): https://t.me/thedurancomMark Sleboda (Telegram): https://t.me/TheRealPolitickReferences: NYT Under Pressure, Biden Allows Ukraine to Use U.S.\nWeapons to Strike Inside Russia (May 30, 2024): https://www.nytimes.com/2024/05/30/us...NYT The Spy War: How the C.I.A.\nSecretly Helps Ukraine Fight Putin (February 2024): https://www.nytimes.com/2024/02/25/wo...NYT U.S.\nBelieves Ukrainians Were Behind an Assassination in Russia (October 2022): https://www.nytimes.com/2022/10/05/us...Kyiv Independent Ukraine hits Russian ferry crossing with ATACMS in Crimea, General Staff says (May 30, 2024): https://kyivindependent.com/ukraineh...Where to Find My Work:Website: https://landdestroyer.blogspot.com/Telegram: https://t.me/brianlovethailandTwitter: / brianjberleticOdysee (YouTube alternative): https://odysee.com/@LandDestroyer:8Rumble (YouTube alternative): https://rumble.com/c/c1459863"}, {"id": "ab0addd7-2487-4f10-a65f-57d96233994d", "title": "Russo - Ukraine War - 03 June 2024", "date": "2024-06-04 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-03.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, the Russian occupiers carried out more than 2,100 shelling positions of Ukrainian troops and settlements using different types of weapons.\nIn the Kharkiv direction, Russian forces six times attacked the positions of Ukrainian defenders in the areas of lipcív and vovchansk.\nWithin a day, previously, Russian forces lost living force 91 occupants dead and wounded."}, {"id": "681ee12e-dcea-45d8-bed8-74f1753d9947", "title": "Young surfer fatally stabbed in  robbery gone wrong  ", "date": "2024-06-04 07:00", "url": "https://www.begadistrictnews.com.au/story/8651498/young-surfer-fatally-stabbed-in-robbery-gone-wrong/?cs=9676", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "6d941ac7-f1dc-4db9-9540-0d270083e97e", "title": "Young surfer fatally stabbed in  robbery gone wrong  ", "date": "2024-06-04 07:15", "url": "https://www.portnews.com.au/story/8651498/young-surfer-fatally-stabbed-in-robbery-gone-wrong/?cs=9676", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "855a175e-d36f-48f3-b980-05783aa84e13", "title": "Young surfer fatally stabbed in  robbery gone wrong  ", "date": "2024-06-04 07:15", "url": "https://www.theleader.com.au/story/8651498/young-surfer-fatally-stabbed-in-robbery-gone-wrong/?cs=30776", "message": "\"He's gone to the surf with his wetsuit and he's putting that on and whatever happened between the interaction between this 36-year-old man and Kye it's resulted in him being stabbed multiple times."}, {"id": "f5ba6b32-c77a-480e-8eff-668e68abebf1", "title": "Puri Cracker Blast : Puri cracker blast : 4 accused arrested , another on the run | Bhubaneswar News", "date": "2024-06-04 02:45", "url": "https://timesofindia.indiatimes.com/city/bhubaneswar/puri-cracker-blast-4-accused-arrested-another-on-the-run/articleshow/110682771.cms", "message": "We also published the following articles recentlyPuri cracker explosion toll rises to 6The death toll in the cracker explosion in Puri, Odisha, increased to six on Friday as three more patients succumbed to burn injuries in hospitals in Bhubaneswar.\nFour men arrested in Puri cracker blast case, another on the runFour men were arrested in connection with the cracker explosion at Narendra pond during the Chandan Yatra festival in Puri, which killed 13 people, including minors.\nTwo dead and several injured in firecracker explosion during Lord Jagannath festivities in PuriTwo dead and several injured in a firecracker explosion during Lord Jagannath's Chandan Yatra in Puri.\nWhile Nayak and Swain own licenced cracker-making units, Bhoi and Rout were employed to illegally manufacture high-decibel explosives.“We have found direct complicity of the four men in connection with the explosion.\nPolice said Rao, who was the prime accused, is among those 13 dead."}, {"id": "ddca6a85-4f41-4ee4-95c3-26ca54cb682b", "title": "Teen Charged With Murder After Alleged Sleepover Stabbing Spree : REPORT", "date": "2024-06-04 01:00", "url": "https://dailycaller.com/2024/06/03/teen-charged-murder-after-sleepover-stabbing-report/", "message": "Police arrested a 16-year-old on murder charges following the death of a 15-year-old boy during a stabbing spree at a Florida sleepover on Saturday.\nThe Sumter County Sheriff’s Office responded to a call at approximately 10:11 p.m. in the town of Wildwood, according to arrest records provided by the sheriff’s office to the Daily Caller.\n(RELATED: Video Appears To Show Woman Try To Stab Man After Car Crash)“The incident occurred during a sleepover the juvenile victim was having.\n“Upon entry, the suspect stabbed the juvenile victim (Connor Michael Gill) and threatened a third victim.\nHe is being held at the Sumter County Jail on charges of premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill, and armed burglary."}, {"id": "025b0e16-1d37-416a-bae9-c65740c3c0eb", "title": "Woman arrested in stabbing of mother , son in North Olmsted", "date": "2024-06-04 01:45", "url": "https://www.news-herald.com/2024/06/03/woman-arrested-in-stabbing-of-mother-son-in-north-olmsted/", "message": "A 32-year-old Cleveland woman is behind bars facing charges she stabbed a customer and her 3-year-old son June 3 at Giant Eagle, 27264 Lorain Road in North Olmsted, according to a news release from the North Olmsted Police Department.\nAt 3:03 p.m., North Olmsted police officers responded to multiple 911 calls of a possible stabbing in the parking lot of the grocery store, the release said.\nNorth Olmsted Mayor Nicole Dailey Jones released a statement following the stabbing.\n“I am deeply saddened by an incident this afternoon in the parking lot of the North Olmsted Giant Eagle Supermarket,” Dailey Jones said of the stabbing.\n“Once again, our North Olmsted safety forces responded quickly and handled the situation with tremendous professionalism.”North Olmsted police Sgt."}, {"id": "498c9458-67c7-4cb1-8ccf-5c2e4a0ae4ef", "title": "Israel declares 4 more hostages are dead in Gaza , including 3 older men from Hamas video", "date": "2024-06-04 01:45", "url": "https://www.stltoday.com/news/nation-world/israel-declares-4-more-hostages-are-dead-in-gaza-including-3-older-men-from-hamas/article_1da780c6-21fa-11ef-89e3-1362dd349c3f.html", "message": "JERUSALEM — Four more hostages kidnapped on Oct. 7 were declared dead by the Israeli military — including three older men seen in a Hamas video begging to be released.\nAbout 80 hostages in Gaza are believed to be alive, alongside the remains of 43 others.\nAlthough Biden said the proposal was Israeli, the Israeli leadership has appeared to distance itself from the plan, vowing to keep conducting military operations against Hamas until the militant group is destroyed.\nIsraeli bombardments and ground operations in Gaza have killed more than 36,000 Palestinians, according to Gaza’s Health Ministry, which does not distinguish between combatants and civilians.\nIsrael has been expanding its offensive in the southern city of Rafah, once the main hub of humanitarian aid operations."}, {"id": "976e4b6b-8e68-4638-999e-92224f6b0cd0", "title": "Workers Struggles : The Americas", "date": "2024-06-04 02:30", "url": "https://www.wsws.org/en/articles/2024/06/04/wrsg-j04.html", "message": "Latin AmericaArgentine health and education workers strike again in Misiones ProvinceConfronted with heavy penalties on their wages, discounts for their days on strike of between 50 and 100,000 pesos, mostly affecting elementary school teachers, educators and health workers in Misiones Province went on strike again last Wednesday.\nWorkers are demanding a 289 percent wage increase to compensate for inflation and have rejected a government offer of 208 percent.\nChile: Puerto Coronel contingent dock workers on hunger strikeContingent workers at Chile’s Coronel Port rejected a May 20 agreement with port authorities that had been mediated by the Ministry of Transportation.\nThe workers claim that the contract goes against the workers’ demands outlined when the strike began as a management lockout on March 26.\nThe dockworkers union, which represents both-part and full-time workers, has stopped sending workers for tasks involving wood and cellulose transportation."}, {"id": "c3793077-06d2-4c01-8bea-791d78ab2712", "title": "Las Vegas WWII veteran recalls his time on the USS Cavalier , 80 years since D - Day", "date": "2024-06-04 03:45", "url": "https://www.yahoo.com/news/las-vegas-wwii-veteran-recalls-012300406.html", "message": "Las Vegas WWII veteran recalls his time on the USS Cavalier, 80 years since D-DayLAS VEGAS (KLAS) — As his 99th birthday approaches, a Las Vegas local looked back on his experience in the Second World War and reflected on the 80 years since the Normandy landings on D-Day in 1944.\nA photo shows Herb Cohen, a Las Vegas local who served as a U.S. Coast Guardsman aboard the USS Cavalier.\nHerb Cohen served aboard the USS Cavalier, an attack transport deployed to the Pacific Theater during World War II.\nFrom the Cavalier, Cohen and his brothers-in-arms helped to fight off the Japanese army, a brutal and bloody conflict that left its mark on the young man.\nEventually, the soldier settled down, made Las Vegas his home, married, and had a family."}, {"id": "8fdd8b39-4c9e-47c4-bc81-8a129ca6051c", "title": "Opinion : Hybrid Warfare and How to Defend Yourself", "date": "2024-06-04 06:15", "url": "https://www.kyivpost.com/opinion/33705", "message": "We go about our lives as hybrid warfare methods target the very fabric of society, making people paranoid and hostile to each other, weakening society before a potential military strike of the enemy.\nHybrid warfare takes on many forms: cyberattacks, arson, psychological warfare, terror attacks, weaponizing migration, and weaponizing farmers against Ukraine.\nThe list of Russian hybrid warfare tactics is long and, unfortunately, expanding every day.\nSomething which seems harmless today might turn out to be a part of a Russian hybrid warfare operation tomorrow.\nAdvertisement Hybrid warfare can affect us all We’re all targets of hybrid warfare."}, {"id": "66a03302-81ca-4ac2-b7f0-013577a557cb", "title": "Stealthy Fighter - Like Wingman Drone Concept Unveiled By Airbus", "date": "2024-06-04 04:45", "url": "https://www.yahoo.com/tech/stealthy-fighter-wingman-drone-concept-000138665.html", "message": "Airbus has unveiled a new fighter-like stealthy loyal wingman drone concept.\nThis might point to plans for the Wingman drone to be capable of supersonic speed.\nAlong the dorsal spine of Airbus' new drone concept, there is a row of familiar-looking low observable (LO; stealthy) apertures.\nIt's not immediately clear where Airbus' Wingman drone might carry munitions, but there could be plans for one or more ventral payload bays that are not seen in the rendering available now.\nThere are reports that Airbus' new Wingman concept leverages prior work done under the Low Observable UAV Testbed (LOUT) program."}, {"id": "11f9455b-0a0d-485d-9b14-4de747eb3794", "title": "Yes ,  free Palestine  – from Hamas | WND | by Michael Brown", "date": "2024-06-04 02:00", "url": "https://www.wnd.com/2024/06/yes-free-palestine-hamas/", "message": "I don't support innocent women and children being killed for war and for money and power.\nThe tragic truth is that, if not for Hamas, innocent women and children would not be dying in Gaza.\nAnd, as outlandish as the genocide charge is, if not for Hamas, Israel would not be waging war in Gaza right now at all.\nWhat we cannot forget, then, is that the people of Gaza are suffering because of Hamas, not because of Israel.\nIf you want to free Palestine, then help free it from Hamas."}, {"id": "24e5fd04-0b67-43a5-9acc-4e51cdaa74d0", "title": "SOF Pic of the Day : German Navy Kampfschwimmer", "date": "2024-06-04 04:15", "url": "https://sofrep.com/news/sof-pic-of-the-day-german-navy-kampfschwimmer/", "message": "They are adept at conducting a variety of operations, including reconnaissance, sabotage, direct action, and counter-terrorism.\nThis ability to move silently and remain unseen is a hallmark of Kampfschwimmer operations.\nWhen it comes to elite maritime special forces, few units are as storied and formidable as the Kampfschwimmer of the German Navy.\nWhen it comes to elite maritime special forces, few units are as storied and formidable as the Kampfschwimmer of the German Navy.\nThis ability to move silently and remain unseen is a hallmark of Kampfschwimmer operations."}, {"id": "b3922ce7-03d2-4887-ab68-d01910acbc69", "title": "Putin troops film blindfolded Ukrainian PoWs on harrowing death march before mock execution in sick footage sent to UN", "date": "2024-06-04 01:00", "url": "https://www.the-sun.com/news/11524195/putin-troops-video-ukrainian-pows-un/", "message": "HARROWING footage shows the sick reality of Vladimir Putin's war in Ukraine, as Russian troops lead Ukrainian prisoners to a mock execution.\nOne of the Russian soldiers turned the camera back to his own face after the gun fired and frowned.\nUkrainian ombudsman Dmytro Lubinets said the footage showed Russian soldiers \"mocking Ukrainian prisoners of war\".\n\"Unfortunately, such treatment of Ukrainian prisoners of war is not an exception to the rules, but a common tactic for the occupiers.\"\nSeriously-ill PoWs must be returned home, and all PoWs must be released - and sent home without delay - when the conflict ends."}, {"id": "22f329ae-6214-4a63-b856-ce50d6887fbe", "title": "5 Things You Might Not Know About the Battle of Midway", "date": "2024-06-04 06:15", "url": "https://www.history.com/news/battle-midway-facts", "message": "Here are five little-known facts about the Battle of Midway, and its impact on World War II in the Pacific.\nA destroyer comes to the aid of the listing aircraft carrier USS Yorktown, which was hit by Japanese bombs and torpedoes during the Battle of Midway.\nUS troops stand at attention behind the flag-draped coffins of their countrymen killed in the battle of Midway, Midway Island, June 1942.\nCorbis/Getty Images The aircraft carrier USS Yorktown is shown in dry dock at Pearl Harbor, as it is being readied for the Battle of Midway.\nU.S. Navy/The LIFE Picture Collection/Getty Images A film still shows a US Navy aircraft carrier, likely the USS Enterprise, during the Battle of Midway, from the John Ford-directed documentary 'The Battle of Midway,' 1942."}, {"id": "9f12884b-13d6-42bb-8862-b7cf016faef4", "title": "IHC questions spie ability over failure to trace those who doxxed judge - Newspaper", "date": "2024-06-04 04:30", "url": "https://www.dawn.com/news/1837644/ihc-questions-spies-ability-over-failure-to-trace-those-who-doxxed-judge", "message": "An IHC larger bench comprising Justices Mohsin Akhtar Kayani, Tariq Mehmood Jahangiri and Sardar Ejaz Ishaq Khan took up the case on Monday.\nThe IHC bench expressed displeasure over the report and rejected it.\nThe spy agency was subsequently directed to submit a fresh report.\nThe bench noted that after six IHC judges wrote a letter to the Supreme Judicial Council, “three malicious campaigns were simultaneously orchestrated against them”.\nAn FIA official who appeared in the court said several X accounts also shared controversial posts against the judge."}, {"id": "d51c7ba1-0686-4e6c-b8f8-05adf6c57298", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-04 03:30", "url": "https://www.tvguide.co.uk/schedule/42db5852-8aa0-5a34-9876-8cc0733c7273/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Tuesday 4 June Share Add toCalendar +Mission Impossible Season 3 Episode 8 of 10 S Subtitles Audio DescriptionMilitary equipment collector Bruce Crompton heads to Finland looking for props, including Cold War Russian anti-aircraft guns, for a new blockbuster movieCombat Dealers airs on Discovery Channel HD at 9:00 AM, Tuesday 4 June .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "ae7e7beb-fd16-42e6-885c-1104cec13c4a", "title": "Seoul fully suspends inter - Korean military pact over trash balloons", "date": "2024-06-04 08:15", "url": "https://www.channelnewsasia.com/east-asia/south-korea-fully-suspends-inter-korean-military-pact-trash-balloons-north-korea-4385461", "message": "President Yoon \"has just approved the 'Sep 19 (2018) Military Agreement Suspension Proposal'\", which the cabinet had already signed off on, his office said in a statement.\nThe move will allow the South to resume live fire drills and restart loudspeaker propaganda campaigns along the border with the North.\nThe South has used the loudspeaker campaigns - considered a psychological warfare tactic dating back to the 1950-53 Korean War - as a countermeasure to what it deems serious North Korean provocations.\nThe broadcasts infuriate Pyongyang, which has previously threatened artillery strikes against the loudspeaker units unless they were switched off.\nPyongyang said the trash balloons were retaliation for similar missives sent northwards by South Korean activists."}, {"id": "678d590e-c3fc-4d0d-8e9f-12271a8e5ba2", "title": "LibriVox", "date": "2024-06-04 06:30", "url": "https://librivox.org/the-capture-of-fort-william-and-mary-by-charles-lathrop-parsons/", "message": "The Capture of Fort William and MaryCharles Lathrop Parsons (1867 - 1954)The Capture of Fort William and Mary took place in Portsmouth, New Hampshire, on December 14, 1774, when local Patriots led by John Langdon stormed Fort William and Mary guarding the mouth of the busy seaport.\nThey overcame a six-man caretaker detachment and seized the garrison's powder, which was distributed through several towns in the colony for potential use in the looming struggle against Great Britain.\nOn December 15, 1774, patriots led by John Sullivan again raided the fort, this time seizing numerous cannons, later used in the pivotal Battle of Bunker Hill.\nThe incident is significant as one of the first overt acts of the American Revolutionary War and the only battle to take place in the state of New Hampshire.\n- Summary by WikipedaGenre(s): War & Military, Early ModernLanguage: English"}, {"id": "ece3a5a4-c830-4c1e-a73b-8d306ffc56c9", "title": "Idris Elba helps uncover the WWII soldiers of colour who never got their due", "date": "2024-06-04 04:45", "url": "https://www.myjoyonline.com/idris-elba-helps-uncover-the-wwii-soldiers-of-colour-who-never-got-their-due/", "message": "One of Idris Elba’s grandfathers fought in World War II, but he doesn’t know what he endured.\n“That part of my family’s history has been erased somewhat,” says Elba.\nMore than 8 million people of color served with the Allies, and the series digs deep to focus on how some fared at D-Day, Dunkirk, Pearl Harbor and the Battle of the Bulge.\nThe series uses archival footage, descendant interviews, soldier journals and actor portrayals — a mix that Elba says he found visceral and moving.\nHe would note: “There’s no such thing as a colour barrier in action.”Brown says that observation proved so powerful."}, {"id": "506bf1b2-1d18-4b6f-8231-19736e49e9b6", "title": "South Korea is suspending a military deal with North Korea after tensions over trash balloons", "date": "2024-06-04 07:15", "url": "https://www.ajc.com/news/nation-world/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/FZTDIVCITVHNTFRTPOZYY6GK3Q/", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "4cbf0054-f1ab-4c32-8dcc-a3883bf29be4", "title": "South Korea to suspend a military deal with North Korea after tensions over North balloons", "date": "2024-06-04 05:45", "url": "https://www.thehindu.com/news/international/south-korea-to-suspend-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/article68249344.ece", "message": "South Korea’s government approved the suspension of a contentious military agreement with North Korea on June 4, a step that would allow it to take tougher responses to North Korean provocations.\nSouth Korea’s Cabinet Council passed a proposal aimed at suspending the 2018 inter-Korean agreement on lowering down frontline military tensions.\n2 official, said the government assessed that the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nMr. Duck-soo cited North Korea’s balloon campaign, tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting South Korea to vow unspecified “unbearable” retaliatory steps."}, {"id": "ef57096a-63a0-4094-8416-41cc4de25a58", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons", "date": "2024-06-04 06:45", "url": "https://www.ksat.com/news/world/2024/06/04/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/", "message": "Visitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\nSouth Koreas government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\n(AP Photo/Lee Jin-man)SEOUL – South Korea on Tuesday took steps to suspend a contentious military agreement with North Korea and resume frontline military activities, as tensions between the rivals are rising over the North's recent launch of trash-carrying balloons.\nRecommended VideosIn the past week, North Korea has used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting Seoul to vow “unbearable” retaliation.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea, and alleged jamming of GPS navigation signals in the South."}, {"id": "a4f87726-16b5-4156-8ea7-8604373b180b", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons", "date": "2024-06-04 05:15", "url": "https://www.clickondetroit.com/news/world/2024/06/04/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/", "message": "Visitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\nSouth Koreas government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\n(AP Photo/Lee Jin-man)SEOUL – South Korea on Tuesday took steps to suspend a contentious military agreement with North Korea and resume frontline military activities, as tensions between the rivals are rising over the North's recent launch of trash-carrying balloons.\nRecommended VideosIn the past week, North Korea has used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting Seoul to vow “unbearable” retaliation.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea, and alleged jamming of GPS navigation signals in the South."}, {"id": "9b298b2f-c1e2-4431-b2dd-6917b8e3ac5b", "title": "A Black medic wounded on D - Day is finally posthumously honored", "date": "2024-06-04 00:00", "url": "https://www.capitalgazette.com/2024/06/03/a-black-medic-wounded-on-d-day-saved-dozens-of-lives-hes-finally-being-posthumously-honored/", "message": "We have numerous accounts of what he did to save his fellow soldiers even as he was wounded.\nMembers of the First Army, which included Woodson’s unit during World War II, is taking a World War II-era Distinguished Service Cross with them to France.\nWoodson was just 21 years old when his unit, the 320th Barrage Balloon Battalion, took part in the Allied operation.\nAlthough 1.2 million Black Americans served in the military during World War II, none was among the original recipients of the Medal of Honor awarded in the conflict.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "25bbbea6-4511-4e21-ac32-a8b499861070", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons", "date": "2024-06-04 04:15", "url": "https://www.clickorlando.com/news/world/2024/06/04/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/", "message": "Visitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\nSouth Koreas government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\n(AP Photo/Lee Jin-man)SEOUL – South Korea on Tuesday took steps to suspend a contentious military agreement with North Korea and resume frontline military activities, as tensions between the rivals are rising over the North's recent launch of trash-carrying balloons.\nRecommended VideosIn the past week, North Korea has used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting Seoul to vow “unbearable” retaliation.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea, and alleged jamming of GPS navigation signals in the South."}, {"id": "4eacd749-1ba5-4169-b452-79f924505f8b", "title": "South Korea suspending military deal with North Korea", "date": "2024-06-04 06:00", "url": "https://www.breakingnews.ie/world/south-korea-suspending-military-deal-with-north-korea-1633365.html", "message": "South Korea’s government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\nSouth Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea (Im Sun-suk/Yonhap/AP)AdvertisementAdvertisementDuring the cabinet meeting, Prime Minister Han Duck-soo said the government assessed the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nMr Han cited North Korea’s balloon campaign, tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nAdvertisementIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, who vowed unspecified “unbearable” retaliatory steps.\nSouth Korean officials said the suspension of the 2018 deal would allow it to stage frontline military drills but didn’t publicly elaborate on other steps."}, {"id": "5c42d0d7-decb-4459-b619-c4dadac4ed2f", "title": "Mansfield 100 - year - old D - Day veteran recalls Normandy landings", "date": "2024-06-04 07:15", "url": "https://www.bbc.com/news/articles/crggrveg3zlo", "message": "D-Day veteran 'shall never forget' Normandy landings4 hours ago by Monika Plaha and Asha Patel , BBC News, Nottingham ShareBBC Ted Rutland, now 100, was just 20 when the D-Day landings beganA 100-year-old World War Two veteran says he will \"never forget\" what he saw during the D-Day invasion.\nAs part of the 80th anniversary commemorations, Mr Rutland is due to unveil a new war monument in Portsmouth on Wednesday.\nThe Mansfield-born veteran still remembers being fired at by German soldiers as they landed on the beach in Normandy, France.\n\"So the co-driver in the first tank had to get out and move the dead bodies because we would never roll over a dead [person].\nI used to get out and move the dead bodies.” From the Battle of Caen they moved on to Falaise."}, {"id": "9239c692-33a3-4af4-bf98-42bf96e303b0", "title": "South Korea suspending military deal with North Korea", "date": "2024-06-04 07:15", "url": "https://www.lbc.co.uk/world-news/99459342e74a4b51ae2fdcc56a8a5298/", "message": "South Korea’s government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\nSouth Korea’s Cabinet Council passed a proposal on Tuesday aimed at suspending the 2018 inter-Korean agreement on lowering down frontline military tensions.\nSouth Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea (Im Sun-suk/Yonhap/AP)During the cabinet meeting, Prime Minister Han Duck-soo said the government assessed the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nMr Han cited North Korea’s balloon campaign, tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, who vowed unspecified “unbearable” retaliatory steps."}, {"id": "0cdda625-074c-4a1e-a72e-defaf3941b28", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons – Winnipeg Free Press", "date": "2024-06-04 04:15", "url": "https://www.winnipegfreepress.com/world/2024/06/03/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons", "message": "SEOUL, South Korea (AP) — South Korea on Tuesday took steps to suspend a contentious military agreement with North Korea and resume frontline military activities, as tensions between the rivals are rising over the North’s recent launch of trash-carrying balloons.\nIn the past week, North Korea has used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting Seoul to vow “unbearable” retaliation.\nVisitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\nSouth Korea’s government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea, and alleged jamming of GPS navigation signals in the South."}, {"id": "74633a0b-1fef-475f-826c-8270dc429c70", "title": "Grizzy and the Lemmings - CBBC", "date": "2024-06-04 07:15", "url": "https://www.tvguide.co.uk/schedule/d9478069-949c-5104-8ef2-4c770b3e8c1b/grizzy-and-the-lemmings", "message": "Grizzy and the LemmingsCBBC 1:05 PM to 1:10 PM Tuesday 4 June Share Add toCalendar +Bamboo Warfare Season 3 Episode 8 of 78 Repeat S SubtitlesGrizzy dismantles the toboggan built by the Lemmings in the log cabinGrizzy and the Lemmings airs on CBBC at 1:05 PM, Tuesday 4 June .\n(Subtitles, repeat.)"}, {"id": "291df8d7-23d8-4845-b685-129d57191198", "title": "Grizzy and the Lemmings - CBBC HD", "date": "2024-06-04 07:15", "url": "https://www.tvguide.co.uk/schedule/e38332a5-753a-5878-ac82-3e3f69325850/grizzy-and-the-lemmings", "message": "Grizzy and the LemmingsCBBC HD 1:05 PM to 1:10 PM Tuesday 4 June Share Add toCalendar +Bamboo Warfare Season 3 Episode 8 of 78 Repeat S SubtitlesGrizzy dismantles the toboggan built by the Lemmings in the log cabinGrizzy and the Lemmings airs on CBBC HD at 1:05 PM, Tuesday 4 June .\n(Subtitles, repeat.)"}, {"id": "f132fd60-5312-4ef7-8b44-cc31f7acd688", "title": "South Korea suspending military deal with North Korea", "date": "2024-06-04 05:15", "url": "https://www.eveningnews24.co.uk/news/national/24363712.south-korea-suspending-military-deal-north-korea/", "message": "South Korea’s Cabinet Council passed a proposal on Tuesday aimed at suspending the 2018 inter-Korean agreement on lowering down frontline military tensions.\nSouth Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea (Im Sun-suk/Yonhap/AP)During the cabinet meeting, Prime Minister Han Duck-soo said the government assessed the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nMr Han cited North Korea’s balloon campaign, tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, who vowed unspecified “unbearable” retaliatory steps.\nSouth Korean officials said the suspension of the 2018 deal would allow it to stage frontline military drills but didn’t publicly elaborate on other steps."}, {"id": "42a3631c-71e5-4b5c-ae5e-d0f4a6ebc88a", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 02:00", "url": "https://abc11.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "fb255064-c209-4749-8a0b-237403367af1", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 00:45", "url": "https://abc13.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "6fa965d4-569c-4743-919b-1f1f88cca219", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 01:15", "url": "https://abc7chicago.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "9d3fc2d7-34ff-480a-aad5-334fd2dca0b0", "title": "United flight taking three World War II veterans from Chicago OHare Airport to France for 80th D - Day anniversary", "date": "2024-06-04 01:15", "url": "https://abc7chicago.com/post/united-flight-taking-world-war-ii-veterans-chicago/14907935/", "message": "Three World War II veterans fly from O'Hare to France to celebrate 80th anniversary of D-DayA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nThis could be the last time any World War II veterans might be there in-person, so organizers are going all-out."}, {"id": "2f19de2b-c89d-4e93-910b-f60571dacb2e", "title": "Glenn Youngkin discusses antisemitism at Norfolk conference :  We have to continue to stand against hate  – Daily Press", "date": "2024-06-04 01:15", "url": "https://www.dailypress.com/2024/06/03/glenn-youngkin-discusses-antisemitism-at-norfolk-conference-we-have-to-continue-to-stand-against-hate/", "message": "Glenn Youngkin, gathered Monday to share experiences and ideas on how to stand up to antisemitism.\nVirginia Summit to Combat Antisemitism, a two-day conference that began Sunday, was held at the Hilton Norfolk The Main.\nAdditionally, several Hampton Roads city leaders gave remarks, including Norfolk Mayor Kenny Alexander and Virginia Beach Mayor Bobby Dyer.\nVirginia Beach Councilman Chris Taylor was on a panel about the best ways to safeguard Jewish communities.\nThough advocates have pushed the issue in Newport News, Norfolk and Virginia Beach, none of those cities have adopted a resolution."}, {"id": "4c423cd5-5b37-4ab3-85cd-35727164db63", "title": "  All Quiet on the Western Front  screenwriter dies aged 54 after losing pancreatic cancer battle", "date": "2024-06-04 00:45", "url": "https://www.femalefirst.co.uk/celebrity/quiet-western-front-screenwriter-dies-aged-54-after-losing-pancreatic-cancer-battle-1400705.html", "message": "Filmmaker Lesley Paterson’s husband Simon Marshall has died aged 54 after losing his pancreatic cancer battle.\nFilmmaker Lesley Paterson’s husband Simon Marshall has died aged 54 after losing his pancreatic cancer battleThe husband-and-wife team co-wrote the script for the brutal 2022 anti-war movie ‘All Quiet on the Western Front’, already considered a classic.\nLesley launched a crowd-funding drive last year after her husband and creative partner was diagnosed with stage four pancreatic cancer.\nTheir ‘All Quiet on the Western Front’ adaptation won four Oscars and seven Baftas.\n“The pain is real but I will take this suffering and turn it into beauty in honour of his spirit."}, {"id": "486a0c26-d877-4ca6-a35d-2dde459b756e", "title": "Manchester D - Day veteran recalls  carnage  of Normandy landing", "date": "2024-06-04 07:15", "url": "https://www.bbc.com/news/articles/cg33282jm4do", "message": "D-Day veteran recalls 'carnage' of Normandy landing4 hours ago Richard Stead & Ewan Gawne , BBC News, Manchester ShareBBC Eric Suchland was a wireless operator who fed intelligence back from the front line.\nA 100-year-old D-Day veteran has recalled the \"carnage\" that confronted him on landing at Normandy but said he \"doesn't remember feeling terrified\".\nEric Suchland Eric Suchland was attached to the 51st Highland DivisionBorn in Reddish, Mr Suchland volunteered for the Army on his 18th birthday and joined the Royal Corps of Signals.\nMr Suchland later took part in the offensive to capture the French city of Caen, which was largely destroyed.\nThe following year, he was posted overseas and served at a training centre for British soldiers in the town of Mhow, central India."}, {"id": "f266d0cb-fba8-4e5c-84cb-6ac193998a6e", "title": "Last member of D - Day veterans group to scatter comrade ashes on final trip to Normandy", "date": "2024-06-04 06:00", "url": "https://news.sky.com/story/last-member-of-d-day-veterans-group-to-scatter-comrades-ashes-on-final-trip-to-normandy-13147182", "message": "The only surviving member of a group of D-Day veterans will scatter his comrades' ashes on his final trip to the beaches of Normandy this week.\nMr Cooke told Sky News how he remembers being overwhelmed by the spectacle of what he saw as they approached the beach.\nPic: National Archives of Canada via ReutersThrough the York Normandy Veterans group he became close friends with other former servicemen who had also been part of D-Day and the subsequent landings.\nGeorge Child, 23, said his family was extremely thankful to Mr Cooke.\nHe is doing that not just for Sid but for everyone in York Normandy Veterans.\""}, {"id": "70ca4e52-380c-4fdd-b7c4-0cedbe31cc7c", "title": "Last member of D - Day veterans group to scatter comrade ashes on final trip to Normandy", "date": "2024-06-04 06:15", "url": "https://www.heart.co.uk/news/uk-world/last-member-of-d-day-veterans-group-to-scatte/", "message": "Last member of D-Day veterans group to scatter comrades' ashes on final trip to NormandyThe only surviving member of a group of D-Day veterans will scatter his comrades' ashes on his final trip to the beaches of Normandy this week.\nThrough the York Normandy Veterans group he became close friends with other former servicemen who had also been part of D-Day and the subsequent landings.\nHe is doing that not just for Sid but for everyone in York Normandy Veterans.\"\nKen Cooke will spread the remaining ashes in a private service this week in Normandy.\n(c) Sky News 2024: Last member of D-Day veterans group to scatter comrades' ashes on final trip to Normandy"}, {"id": "20e0e90f-084b-4b40-b792-bd447838dbf1", "title": "South Korea suspends peace pact with North over trash - filled balloons , raising risk of military clashes", "date": "2024-06-04 08:15", "url": "https://www.scmp.com/week-asia/politics/article/3265323/south-korea-suspends-peace-pact-north-over-trash-filled-balloons-raising-risk-military-clashes", "message": "South Korean army soldiers patrol along the barbed-wire fence in Paju, near the border with North Korea, on May 31.\nAt sea, they can fire artillery and conduct maritime manoeuvres in border waters, despite past clashes in the disputed sea border.\nMilitary personnel collect the debris of balloons sent by North Korea in Incheon, west of Seoul, South Korea, on Sunday.\nNorth Korea also continued conducting GPS-jamming attacks along the sensitive sea border in the Yellow Sea, the South’s defence ministry said.\nNorth Korea said on Sunday it would stop sending trash-carrying balloons into South Korea if Seoul also stopped launching leaflets across the border."}, {"id": "aa05be80-8b95-4df8-9218-def4ae607a89", "title": "Delhi Minister Saurabh Bharadwaj conducts surprise inspection of  Rain basera  ", "date": "2024-06-04 03:15", "url": "https://news.webindia123.com/news/Articles/India/20240604/4203137.html", "message": "To ensure adequate arrangements at 'Rain baseras' during the ongoing heat wave, Delhi's Urban Development Minister Saurabh Bharadwaj on Monday afternoon conducted a surprise inspection of several night shelters in Delhi, an official statement said.\nSaurabh Bharadwaj, who is Vice Chairman of the Delhi Urban Shelter Improvement Board (DUSIB) took stock of the arrangements made at the night shelters.\nIssuing a statement, Minister Bharadwaj said, \"he saw adequate arrangements for water dispensers to provide cold drinking water to the people and water air coolers for cold air.\"\n\"Arrangements must be made immediately wherevr any deficiency is found in the water arrangement or supply of cold water.\nAnd, wherever a problem with the air cooler is noticed, that problem should be resolved immediately,\" he said."}, {"id": "b76a6801-1c8e-4acb-b76f-fbbd4ebf6351", "title": "The Forgotten WWII 80th Anniversary That Not D - Day", "date": "2024-06-04 06:00", "url": "https://townhall.com/columnists/larryprovost/2024/06/04/the-forgotten-wwii-80th-anniversary-thats-not-d-day-n2639943", "message": "However, Normandy was not the initial invasion of Europe by the Western Allies.\nThe invasion of Italy was the first major Western Allied landing on Fortress Europe in World War II.\nThese natural barriers, coupled with the military defensive genius of German Field Marshal “Smiling Albert” Kesselring, presented a formidable obstacle to the Western Allies.\nHowever, even in success American troops faced even more obstacles, including their own overrated commander.\nAs a result, two days before Allied forces landed in France, American troops liberated the city on June 6, 1944."}, {"id": "17e082ea-8651-415d-8e98-d34be69e8adb", "title": "Bagpipes , flags welcome Chicago - area WWII veterans heading back to France for D - Day anniversary", "date": "2024-06-04 03:45", "url": "https://www.fox32chicago.com/news/chicago-veterans-heading-back-france-d-day-anniversary", "message": "There were bagpipes, flags, and a grand procession at O'Hare Airport's Terminal 1 as three World War II veterans headed back to France on Monday.\n\"Many of us here could not even fathom the sacrifices and contributions you made to our country,\" said Omar Idris of United Airlines.\n\"You realize how bad it was when you walk the cemeteries in France,\" Malin said.\nThe three men and their families were cheered all the way to the gate as the event was coordinated by United Airlines and its United for Veterans Group.\nEven more special, the entire flight crew to France was made up of veterans."}, {"id": "5a9136fb-6ff4-415f-bb41-490af79e66e8", "title": "The Eastern Front : A History of the First World War by Nick Lloyd : A compelling and authoritative read", "date": "2024-06-04 04:30", "url": "https://www.irishtimes.com/culture/books/review/2024/06/04/the-eastern-front-a-history-of-the-first-world-war-by-nick-lloyd-a-compelling-and-authoritative-read/", "message": "Photograph: Oesterreichsches Volkshochschularchiv/Imagno/Getty ImagesThe Eastern Front: A History of the First World War Author : Nick Lloyd ISBN-13 : 978-0241506851 Publisher : Viking Guideline Price : £30The first World War started with the assassination 110 years ago of Archduke Franz Ferdinand in Sarajevo, yet the Eastern Front is little known or understood in the West.\nREAD MOREThe three main protagonists, Germany, the Austro-Hungarian empire and Russian empire, were defeated.\nThe Russian empire, as has been exhaustively chronicled elsewhere, withdrew from the war to preserve the nascent Bolshevik revolution.\nItaly lost 500,000 men in the first World War and got nothing like the territories it had anticipated despite being on the winning side.\nIt was out of the chaos of the first World War that the first Ukrainian state was declared in January 1918."}, {"id": "70d3c7fe-582e-4908-892e-499fcda2893a", "title": "CS Runn Announces His Military Thriller The Moral Conundrum", "date": "2024-06-04 01:45", "url": "https://menafn.com/1108287742/CS-Runn-Announces-His-Military-Thriller-The-Moral-Conundrum", "message": "(MENAFN- BookBuzz) CS Runn announces the promotion of his riveting action thriller, The Moral Conundrum.\nIn The Moral Conundrum, readers are introduced to Reed Stanton, a navy fighter pilot and devoted family man.\nAuthor CS Runn brings a wealth of personal experience to The Moral Conundrum, drawing on his background as a navy veteran and former employee of the Federal Aviation Administration.\nExperience the adrenaline rush of The Moral Conundrum today!\nA passionate explorer of America's national parks, CS Runn currently resides in San Diego, California."}, {"id": "d0c58d86-02ea-4941-bfe7-c8c608b15d54", "title": "Fostering Tri - Service Collaboration At Grassroot Level : 40 Trainee Officers Commence Joint Training At DSSC", "date": "2024-06-04 03:30", "url": "https://menafn.com/1108292449/Fostering-Tri-Service-Collaboration-At-Grassroot-Level-40-Trainee-Officers-Commence-Joint-Training-At-DSSC", "message": "For the first time, a select number of officers are being trained under the newly established joint training team at the Defence Services Staff College (DSSC).\nSources in the defence and security establishment said:“About 40 trainee officers are under the newly appointed head of the Joint Training team.\"\nRecently, a Brigadier-level Joint Training Officer was appointed to lead the new joint training team.\n\"As the tri-services posting has already begun, this step is aimed at taking the joint training to the grassroots level,” sources added.\n\"Over the years joint training capsules at DSSC have been increasing to reach the level of above 70 percent now,” sources said."}, {"id": "21f4374a-8ae5-48aa-97f8-c5612305cba9", "title": "Northern Ireland D - Day links connecting young people to the past", "date": "2024-06-04 06:00", "url": "https://www.bbc.com/news/articles/c4nner2117no", "message": "When it comes to D-Day there is no shortage of links to Northern Ireland.\nIt was there that American soldiers first began training for a mission that would eventually lead them to France.\nHowever, alongside these grand tales, Mr Charles makes sure to teach the human cost of this war.\nRobbie said the class learnt about how many people died on D-DayOne of the questions this class is having to consider is whether a conflict on the scale of World War Two could happen again?\nEthan said that meeting a veteran of World War Two would be a \"surreal experience\"“I want to go to different ceremonies,” said Ethan, who is part of the Year 10 class."}, {"id": "331ea6aa-be32-4d6e-ac98-c504285112a7", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem | News , Sports , Jobs", "date": "2024-06-04 01:15", "url": "https://www.mauinews.com/news/local-news/2024/06/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem/", "message": "TOKYO (AP) — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan’s military."}, {"id": "59b42ade-c907-4224-8460-a0cf1537af6e", "title": "John Nelson : Purple Heart recipient reflects on days in Vietnam", "date": "2024-06-04 02:00", "url": "https://mtstandard.com/brandavestudios/john-nelson-purple-heart-recipient-reflects-on-days-in-vietnam/article_4b7dea2c-18da-5e78-8cbb-39e3d2efc4d4.html", "message": "In all, Nelson logged 2,600 hours of combat flight during his two years in Vietnam.\nThe Air Force also recognized Nelson with five additional Air Medals for his service.\nBut Nelson doesn’t like to talk much about his experience or awards from his war days.\nAfter graduating from the University of Montana and marrying his high school sweetheart, Caryl Ann Burgess, Nelson entered the U.S. Air Force.\nAfter completing his tour of Vietnam, Nelson was stationed in Texas at Laredo AFB for two years, where he taught new pilots."}, {"id": "155195d8-ce4b-45ee-a9fc-431c2ea79213", "title": "In the New Cold War , Europe Approach to China Is Already Outdated – The Diplomat", "date": "2024-06-04 04:30", "url": "https://thediplomat.com/2024/06/in-the-new-cold-war-europes-approach-to-china-is-already-outdated/", "message": "In the new Cold War, Russia is more important to the Chinese leadership than Europe.\nIn the new Cold War, Eastern Europe and the Indo-Pacific are part of a united Eurasian strategic theater.\nGeographically, just like the 20th-century Cold War, the new one reflects the expansive logic of malleable buffer zones.\nIt appears that both Moscow and Beijing are ready for the turbulence of the new Cold War.\nThe most pressing issue along the two geographical fault lines in the coming years is keeping the new Cold War “cold” and preventing it from becoming a full-blown global hot war."}, {"id": "049a49e2-5b19-479c-b534-8b8469fe63d8", "title": "TSMC : TSMC says it has discussed moving fabs out of Taiwan , but such a move impossible", "date": "2024-06-04 07:15", "url": "https://economictimes.indiatimes.com/tech/technology/tsmc-says-it-has-discussed-moving-fabs-out-of-taiwan-but-such-a-move-impossible/articleshow/110693911.cms", "message": "Wei said that given 80%-90% of its production capacity is in Taiwan , it would be impossible to move the factories.\n\"I think of course always there is military activity, or showdowns, but again Taiwan is so important to AI - even the Chinese know that.\nAdvanced Micro Devices Chief Executive Lisa Su also reiterated the importance of Taiwan in the global chip supply chain , when asked about how tensions with China and its war games could affect the industry.\n\"We do a lot of our manufacturing here with key suppliers like TSMC... And then we also have a number of partners that help us build out the ecosystem here in Taiwan,\" she told reporters at the show on Monday.\n\"The bottom line from our perspective is it's really important to have a global ecosystem.\""}, {"id": "aa57bef4-c776-47fc-ae3a-23caeba5ea2f", "title": "Arjun Rampal raises Rs 12 . 5 crore for CRY America ensuring underprivileged children rights", "date": "2024-06-04 06:15", "url": "https://www.dnaindia.com/bollywood/report-arjun-rampal-raises-rs-12-5-crore-for-cry-america-ensuring-underprivileged-children-rights-3091937", "message": "Arjun Rampal raises Rs 12.5 crore for CRY America ensuring underprivileged children's rightsArjun Rampal creates history by becoming first Indian celebrity to raise $1.5 million for CRY America.\nArjun Rampal recently impressed audience with his performance as villain in Crakk and Bhagavanth Kesari.\nHowever, beyond the glitz and glamour of the film industry, Arjun has emerged as a passionate advocate for children's rights, championing the cause with unwavering dedication.\nHis perseverance and charisma played a pivotal role in raising a whopping 1.5 million USD for children's rights.\nArjun Rampal adds, “Thanks to all the supporters of the foundation for past 20 years, CRY America has touched the hearts and lives of nearly 800,000 underprivileged children”!"}, {"id": "8da38d73-761b-44ca-a48f-78d2075c14e0", "title": "Today in History : June 4 , World War II Battle of Midway begins in the Pacific", "date": "2024-06-04 04:30", "url": "https://www.startribune.com/today-in-history-june-4-world-war-iis-battle-of-midway-begins-in-the-pacific/600370806/", "message": "Today's Highlight in History:On June 4, 1942, the World War II Battle of Midway began, resulting in a decisive American victory against Japan and marking the turning point of the war in the Pacific.\nIn 1940, during World War II, the Allied military evacuation of some 338,000 troops from Dunkirk, France, ended.\nBritish Prime Minister Winston Churchill declared: ''We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; we shall never surrender.''\nRock musician JoJo Garza (Los Lonely Boys) is 44.\nRock musician Zac Farro is 34."}, {"id": "78e15c68-f473-4c57-9876-b42d1e6c5b9f", "title": "World Environment Day : How smart and sustainable cities can transform our ecosystems", "date": "2024-06-04 04:15", "url": "https://gulfnews.com/opinion/op-eds/world-environment-day-how-smart-and-sustainable-cities-can-transform-our-ecosystems-1.102944421", "message": "The World Environment Day 2024 offers a window of opportunity and action at a time when nearly one-fifth of earth’s land is damaged, forests are disappearing, water bodies are shrinking, and farms are turning into dust bowls.\nEmbracing sustainable developmentIndeed, GCC states have emerged as true global leaders in the fight against climate change and embracing sustainable development.\nThe World Environment Day hosted by the region is the perfect occasion to reflect why the cities of the future must be sustainable and smart, and help preserve our precious natural resources for future generations, through collaborative work between the private and public sectors.\nAs demonstrated by pioneering sustainable projects in the UAE, such as Sharjah Sustainable City, cities that offer an eco-friendly lifestyle and pave the way for a net-zero future are already here.\nThat’s why there’s no better time than this World Environment Day to turn those ambitions and commitments into a turning point for environmental action for a transformative future."}, {"id": "b5ae3474-5ae2-4b4d-b2fd-ad7f854491ef", "title": "Nato land corridors could rush US troops to front line in event of European war", "date": "2024-06-04 06:30", "url": "https://www.yahoo.com/news/nato-land-corridors-could-rush-060200533.html", "message": "Nato land corridors could rush US troops to front line in event of European warTop leaders have warned Western governments that they must prepare themselves for conflict with Russia - CPL AARON J STONE/ARMYNato is developing multiple “land corridors” to rush US troops and armour to the front lines in the event of a major European ground war with Russia.\nExisting plans have US troops landing at Dutch ports before boarding trains that transport them through Germany and onwards to Poland.\nUS troops will land in Rotterdam in the event of a Russian invasion - FRANS LEMMENS/CORBIS DOCUMENTARY RFIn the event of a Russian invasion of Nato, US troops would be shipped to the port of Rotterdam before being transported eastward.\nFrom Italian ports, US troops could be carried via land through Slovenia, Croatia to Hungary, which shares a border with Ukraine.\n“Observing and assessing the Russian war in Ukraine, we have observed Russia has attacked Ukraine’s logistics bases,” he said."}, {"id": "b139f1d1-a6a3-4908-af46-2d4176d1a38b", "title": "Nato land corridors could rush US troops to front line in event of European war", "date": "2024-06-04 08:30", "url": "https://www.telegraph.co.uk/world-news/2024/06/04/nato-land-corridors-us-troops-european-war/", "message": "Plans are also being drawn up to transport troops via ports in the Balkans, as well as through Norway, Sweden and Finland.\nIn these corridors, national militaries will not be restricted by local regulations and will be free to transport consignments without normal restrictions.\nIn the last five years, Jsec has carried out reviews on behalf of Nato to discover various routes that could be used to deliver troops to combat a Russian invasion.\n“Observing and assessing the Russian war in Ukraine, we have observed Russia has attacked Ukraine’s logistics bases,” he said.\nThat is a good example where a military principle applies: ‘If you want to be strong everywhere, you are strong nowhere.’”"}, {"id": "775fa883-4ad7-4a1c-9ee9-a1f2eff255c8", "title": "St Helens veteran celebrates 102nd birthday ahead of D Day anniversary", "date": "2024-06-04 06:45", "url": "https://www.sthelensstar.co.uk/news/24362142.st-helens-veteran-celebrates-102nd-birthday-ahead-d-day-anniversary/", "message": "In 2022, the Star reported how Gerald Anders, a former soldier in the Second World War, tied his 100th birthday celebrations with the Queen's Platinum Jubilee.\nGerald, who was born in St Helens in 1922, arrived at St Helens Town Hall in style as veterans shared stories, dances, and refreshments with the Mayor of St Helens and other special guests.\nAs the veteran reached his 102nd birthday on Saturday, June 1, a celebratory event was organised in his honour at Haydock Conservative Club, along with a hotpot supper and around 100 dancers.\nREAD > Crews called to fire at town centre building undergoing redevelopmentGerarld marked his 100th birthday with a huge event at St Helens Town Hall (Image: Bernard Platt)Following these celebrations, another dance event has been organised at St Helens Town Hall on Wednesday, June 5, to tie in with the D-Day commemorations the following day.\nGerald served in the Royal Artillery during the Second World War (Image: Gerald Anders)Speaking about Gerald, who is loved by all his family and friends, Paul Smith said: \"Gerald is a personality."}, {"id": "d7e01027-3b4a-4511-a39e-f8df35088d59", "title": "Biden takes big swing at hostage - for - truce deal puts onus on Israeli Hamas officials to step up", "date": "2024-06-04 03:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/04/fgn12-us-biden-mideast.html", "message": "NETANYAHU FACING PRESSURE FROM FAR-RIGHTNetanyahu's political survival depends on a far-right coalition that is adamant about eradicating Hamas.\nKirby played down differences between Biden and Netanyahu and underscored that the proposal was an Israeli one.\nOPTIMISM DESPITE HEADWINDSEven as the proposal faces stiff headwinds, the Biden administration said it was cautiously optimistic that a deal could be reached.\nTurkish President Recep Tayyip Erdogan has defended Hamas and hosted the group's political leader, Ismail Haniyeh, for talks in April.\nIndeed, Israeli officials view the conflict on a far longer timeline."}, {"id": "13655201-2b03-4795-8930-fe53c4ca00a9", "title": "Kiesling House offers unique view of past | News , Sports , Jobs", "date": "2024-06-04 08:15", "url": "https://www.nujournal.com/news/local-news/2024/06/04/kiesling-house-offers-unique-view-of-past/", "message": "NEW ULM — History enthusiasts are invited to get a unique glimpse of the past at the historic Kiesling House, 220 Minnesota St. N. Fridays and Saturdays through Aug. 31.\nBuilt in 1861, the house is one of the few wood-frame houses remaining in Brown County before the U.S.-Dakota War of 1862.\nKiesling House volunteer Shirley Lindquist of New Ulm hosted Friday tours.\n“The barricades were right behind the Kiesling House.\nKiesling House admission is $3."}, {"id": "e5750971-1472-4665-9f26-adb18e431e75", "title": "Renowned Actress Rista Laboni Shimana Dead | Shimana 14 - day battle ends , actress passes away", "date": "2024-06-04 07:00", "url": "https://www.thedailystar.net/entertainment/tv-film/news/shimanas-14-day-battle-ends-actress-passes-away-3626371", "message": "After battling for life for 14 days at the hospital, Rista Laboni Shimana passed away today due to severe brain hemorrhage complications.\nShe was admitted to the hospital on May 20 after suffering a brain bleed, and had been unconscious for the past 14 days.\nPhoto: CollectedAccording to the family, Shimana fell suddenly ill on the night of May 21.\nPhoto: CollectedShe remained there for several days, undergoing brain surgery on May 27.\nHowever, she took a six-year hiatus starting in 2016 due to family commitments, returning to the screen only last year."}, {"id": "b4d4c97f-21f2-46b8-9701-a1f4a1efe502", "title": "Biden takes a big swing at hostage - for - truce deal , puts onus on Israeli , Hamas officials to step up", "date": "2024-06-04 00:00", "url": "https://www.yahoo.com/news/biden-takes-big-swing-hostage-231811830.html", "message": "NETANYAHU FACING PRESSURE FROM FAR-RIGHTNetanyahu's political survival depends on a far-right coalition that is adamant about eradicating Hamas.\nHe sowed further doubt about proposal's viability Monday when he told an Israeli parliament committee that there are certain “gaps” in how Biden laid out the proposal.\nAdministration officials on Monday warned Israeli officials that getting bogged down in Gaza could be detrimental to Israel's national security.\nThe second phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza.\nIndeed, Israeli officials view the conflict on a far longer timeline."}, {"id": "00c14dfc-2c5d-4351-a647-53eedcc4035d", "title": "Biden takes a big swing at hostage - for - truce deal , puts onus on Israeli , Hamas officials to step up", "date": "2024-06-04 00:00", "url": "https://www.startribune.com/biden-takes-a-big-swing-at-hostage-for-truce-deal-puts-onus-on-israeli-hamas-officials-to-step-up/600370777/", "message": "NETANYAHU FACING PRESSURE FROM FAR-RIGHTNetanyahu's political survival depends on a far-right coalition that is adamant about eradicating Hamas.\nKirby played down differences between Biden and Netanyahu and underscored that the proposal was an Israeli one.\nAdministration officials on Monday warned Israeli officials that getting bogged down in Gaza could be detrimental to Israel's national security.\nThe second phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza.\nIndeed, Israeli officials view the conflict on a far longer timeline."}, {"id": "9553a4ea-4cc6-4e65-bde9-cbf87741453b", "title": "Gazans returning to Jabalia describe  horrifying  destruction", "date": "2024-06-04 08:15", "url": "https://saudigazette.com.sa/article/643316/World/Mena/Gazans-returning-to-Jabalia-describe-horrifying-destruction", "message": "Displaced families were soon pictured walking back to the camp along streets lined by destroyed buildings, carrying what remained of their belongings.\nA spokesman for Gaza’s Hamas-run Civil Defence force, Mahmoud Bassal, said on Friday that its rescue teams had found dozens of bodies across Jabalia camp mostly women and children - including 30 members of one family.\nHe added that the fifth floor of al-Awda hospital in Jabalia had been destroyed along with the main electrical generators at Kamal Adwan.\nThe UN agency for Palestinian refugees, Unrwa, meanwhile said it had received “horrific reports” from Jabalia camp, where it provides services.\nShe also urged the international community to take action to help Palestinians in Jabalia and elsewhere in Gaza."}, {"id": "d8d52c14-1f79-40a7-952a-e7907df91ebe", "title": "Biden takes a big swing at hostage - for - truce deal , puts onus on Israeli , Hamas officials to step up", "date": "2024-06-04 00:00", "url": "https://www.ksat.com/news/politics/2024/06/03/biden-takes-a-big-swing-at-hostage-for-truce-deal-puts-onus-on-israeli-hamas-officials-to-step-up/", "message": "NETANYAHU FACING PRESSURE FROM FAR-RIGHTNetanyahu's political survival depends on a far-right coalition that is adamant about eradicating Hamas.\nHe sowed further doubt about proposal's viability Monday when he told an Israeli parliament committee that there are certain “gaps” in how Biden laid out the proposal.\nAdministration officials on Monday warned Israeli officials that getting bogged down in Gaza could be detrimental to Israel's national security.\nThe second phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza.\nIndeed, Israeli officials view the conflict on a far longer timeline."}]