[{"id": "5eaec57e-05aa-4752-93be-3df85e1f5ff9", "title": "World Should Rally to Halt Unfolding Atrocities in Darfur", "date": "2024-05-18 02:00", "url": "https://article.wn.com/view/2024/05/18/World_Should_Rally_to_Halt_Unfolding_Atrocities_in_Darfur/", "message": "Tens of thousands of people in El Fasher have already been displaced, with many civilians trapped in the city without access to aid.\nClick to expand ImageDamage to Babiker Nahar Pediatric Hospital in El Fasher, capital of North Darfur following an airstrike, May 11, 2024.\n© 2024 Ayin NetworkObservers within the United Nations, governments, and civil society have warned an attack on El Fasher would cause immeasurable suffering.\nThis is consistent with the RSF and allied forces’ modus operandi in West Darfur last year.\nThe ongoing assault in El Fasher bares stark similarities to these findings and warns of a tragedy which may repeat itself."}, {"id": "7af49238-afb4-4c1e-86d6-1b3485b13cde", "title": "Update : Israeli army says kills senior commander in Lebanese Islamic organization - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/61228b475b09450c9107e64dc649ea9f/c.html", "message": "JERUSALEM, May 17 (Xinhua) -- The Israel Defense Forces (IDF) on Friday said it killed Sharhabil Ali al-Sayed, a senior commander in the Lebanese Islamic Group, or Jamaa Islamiya, in an airstrike on the area of Majdal Anjar village in southeastern Lebanon.\n\"Al-Sayed has recently led many attacks and acts of terrorism from Lebanese territory against Israel in the eastern sector, in cooperation with the Lebanese Hamas branch,\" the IDF said in a statement.\nThe statement noted that the operation was carried out \"to harm the organization's ability to promote and carry out terrorist operations that it planned in the recent period and in the near future against Israel on the northern border.\"\nEarlier in the day, the IDF reported that 75 launches of rockets and drones were carried out from Lebanon into northern Israel.\nMeanwhile, Lebanese military sources told Xinhua on Friday that an Israeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene."}, {"id": "1cde5d3f-4c0b-40de-b93e-dd9a280943ed", "title": "Ukrainian Forces Strengthening Defense In Kharkiv Sector , Destroy Eight Enemy Dugouts", "date": "2024-05-18 01:30", "url": "https://menafn.com/1108227726/Ukrainian-Forces-Strengthening-Defense-In-Kharkiv-Sector-Destroy-Eight-Enemy-Dugouts", "message": "The enemy continued to carry out active offensive and assault operations in the Pokrovsk and Dnipro River sectors.\nIn the Kharkiv sector, the enemy launched 15 airstrikes, using 18 guided aerial bombs.\nSince the beginning of the day, the Russians have carried out six airstrikes near Chasiv Yar, Pivnichne, Druzhba, and Toretsk.\nAnother enemy airstrike was recorded in the Kurakhove sector, near the village of Bohatyr.\nIn the Dnipro River sector, the Russians tried to dislodge Ukrainian forces from the bridgeheads on the left bank of the Dnipro River."}, {"id": "c6a2735d-0cb4-40f0-82a1-876f505f169b", "title": "Israeli strikes kill at least 5 in Lebanon , including civilians", "date": "2024-05-18 03:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/israeli-strikes-kill-least-5-lebanon-including-civilians-3612501", "message": "Smoke billows over northern Israel after rockets were fired from Lebanon, amid ongoing cross-border hostilities between Hezbollah and Israeli forces, by Israel's border with Lebanon, May 16, 2024.\nPhoto: Reuters/Ayal MargolinIsraeli strikes on southern and eastern Lebanon killed at least five people on Friday including Lebanese militants, Palestinian fighters and Syrian civilians, security sources told Reuters.\nOn Friday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and launched a drone attack the furthest into Israeli territory since October."}, {"id": "4acaa39f-1202-43e0-9c8f-a4750e12d232", "title": "IDF Finds Loaded Rocket Launchers in Rafah", "date": "2024-05-18 02:00", "url": "https://www.breitbart.com/politics/2024/05/16/idf-finds-loaded-rocket-launchers-in-rafah/", "message": "The Israel Defense Forces (IDF) has found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip, now in its second week.\nThese launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\nThe rocket launchers were destroyed by the IDF.\nIn another targeted raid, the soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched.\nThe fact that the IDF is discovering and destroying rocket launchers provides further justification for the ongoing Rafah operation, to which the Biden administration and much of the international community has objected."}, {"id": "fa4ee64e-ea1d-4402-8bd0-33ad426b0d53", "title": "Israeli strikes kill at least five in Lebanon , including two children", "date": "2024-05-18 00:00", "url": "https://www.gulf-times.com/article/682753/region/israeli-strikes-kill-at-least-five-in-lebanon-including-two-children", "message": "Israeli strikes on southern and eastern Lebanon killed at least five people yesterday including two children, security sources and Unicef said.Israel and Lebanese armed group Hezbollah have been exchanging fire across Lebanon’s southern border for seven months in parallel with the Gaza war.\nOther Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon.Yesterday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nUnicef Lebanon separately said two children were killed in an Israeli strike on Friday.A separate Israeli strike on Majdal Anjar, on Lebanon’s eastern border with Syria, killed Sharhabil al-Sayed, a member of Palestinian group Hamas who was in charge of the faction’s operations in Lebanon’s eastern Bekaa Valley, according to two security sources.The strike also killed another Palestinian Hamas member, the sources said.The Israeli military said its forces struck a Hezbollah launcher and military infrastructure in southern Lebanon and confirmed the death of al-Sayed.It said sirens warning of incoming rockets and hostile aircraft sounded in several communities throughout yesterday and at one point identified 75 launches crossing from Lebanon into Israel.\nIt said dozens of the launches were intercepted and there were no immediate reports of deaths or damage.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days."}, {"id": "cf255e2f-b9e4-470e-a467-e6e4e3d9d549", "title": "Israel Hamas war : IDF finds bodies of three hostages in Gaza", "date": "2024-05-18 02:15", "url": "https://www.watoday.com.au/world/middle-east/israeli-army-finds-bodies-of-three-hostages-amid-fierce-fighting-in-northern-gaza-20240518-p5jemx.html", "message": "Jerusalem, Cairo: The Israeli military said its troops in Gaza found the bodies of three Israeli hostages killed by Hamas during its October 7 attack, including German-Israeli Shani Louk.\nThe military identified the other two bodies as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nThe Israeli military said its troops in Gaza found the bodies of the three Israeli hostages.\nCredit: Hostages Families Forum Headquarters via APAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsraeli Prime Minister Benjamin Netanyahu called the deaths “heartbreaking,” saying, “We will return all of our hostages, both the living and the dead.”"}, {"id": "1fa46ddd-829a-4d1d-83c6-9f4fde9b46a0", "title": "At least 1 killed , 8 injured in Israeli airstrike on West Bank Jenin - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/0920c9fd2d8b4c1091bb89409d07a62f/c.html", "message": "Medical sources told Xinhua that at least one person was killed and eight others injured in the airstrike on the Jenin refugee camp.\nIt confirmed the death of Khamayseh, saying he was a key wanted person in the Jenin refugee camp and responsible for several attacks in the area, including two shooting attacks about a year ago in which an Israeli was killed and others injured.\nThe IDF added that the airstrike was carried out under the intelligence guidance of the Israeli Security Agency (ISA).\nSome of them were involved in carrying out shooting attacks in the Jenin sector and also planned to carry out additional attacks soon.\"\n\"The IDF and the ISA will continue to work to thwart any terrorist threat against the citizens of Israel,\" said the statement."}, {"id": "bf93de24-8db2-4a9a-867c-a2c98169c476", "title": "Moscow blames West for Ukraine long - range weapon strikes inside Russia", "date": "2024-05-18 01:15", "url": "https://www.voanews.com/a/moscow-blames-west-for-ukraine-s-long-range-weapon-strikes-inside-russia-/7616955.html", "message": "Russia’s Foreign Ministry accused Western nations Friday of “playing with fire” by allowing Ukraine to use the long-range rockets and weapons they had supplied to strike targets inside Russia.\nWhite House national security spokesperson John Kirby told reporters Friday that the Biden administration does not encourage or enable attacks with U.S.-supplied weapons inside Russia.\nIn the Kharkiv region, Russian forces have advanced 10 kilometers from the border, Ukrainian President Volodymyr Zelenskyy said Friday.\n“That's what we are doing.” Russian troops are “advancing daily according to plan,\" he said.\nMeanwhile, in an effort to increase the number of Ukrainian troops, Zelenskyy signed two laws on Friday allowing prisoners to join the army while imposing steep fines for draft dodgers."}, {"id": "6a0358c7-d86e-42b6-a8d8-630bd6e1dfd0", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone", "date": "2024-05-18 00:00", "url": "https://krcgtv.com/news/nation-world/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone", "message": "Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as \"carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nOnline video showed wreckage resembling the pieces of the Reaper on the ground, as well as footage of that wreckage on fire.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen."}, {"id": "332d4858-d4df-4992-898e-ba389f55d2e3", "title": "Hamas loses  commander  in Israeli strike - Newspaper", "date": "2024-05-18 02:15", "url": "https://www.dawn.com/news/1834210/hamas-loses-commander-in-israeli-strike", "message": "BEIRUT: Hamas said on Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nA source close to the Palestinian group had earlier said FP that Sayed was a Hamas official responsible for Lebanon’s Bekaa region and “was killed in an Israeli strike that targeted his vehicle”.\nThe strike came after Israeli strikes earlier in the day killed a Hezbollah fighter and two children, according to the Lebanese group and official media.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al Aruri and six others in Hezbollah’s south Beirut stronghold."}, {"id": "5c3a9e92-4588-4269-b39e-577bbd84c972", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone as footage shows wreckage", "date": "2024-05-18 03:00", "url": "https://www.ivpressonline.com/news/world/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone-as-footage-shows/article_5084072c-62a0-5b41-87a8-1c8c83f2bd02.html", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "b425e104-c0fa-49b9-8bcd-75a94457e200", "title": "Hezbollah Launches First - Ever Airstrike On Israeli Territory", "date": "2024-05-18 00:00", "url": "https://www.zerohedge.com/geopolitical/hezbollah-launches-first-ever-airstrike-israeli-territory", "message": "Via The CradleHezbollah launched the first-ever Lebanese airstrike on an Israeli target on Friday, using a never-before-seen drone for the operation.\npic.twitter.com/YXaO5fSDLr — Middle East Observer (@ME_Observer_) May 16, 2024Three Israeli soldiers were reportedly injured – with one seriously wounded – in the drone attack.\nCoinciding with Israel’s brutal assault on Rafah and its relentless attacks across the Gaza Strip, Hezbollah has stepped up its operations in recent days.\nIn response to Israeli airstrikes on eastern Lebanon the day prior, Hezbollah also announced on Thursday a drone attack on Elbit Systems, the Israel-based international military technology company.\nA couple of days ago we saw how Hezbollah used the new… https://t.co/mkl9FoQ2qi pic.twitter.com/6m5SpSrHkP — Ali Hashem علي هاشم (@alihashem_tv) May 16, 2024It also targeted the David Cohen factory in Tel Hai, north of the Kiryat Shmona settlement."}, {"id": "2d7cf395-ed59-458b-8839-f1c1f1f0fc45", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532073.html", "message": "Beirut, May 18 : A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement \"will remain resistant until the complete liberation of Palestine.\"\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "d891e0d2-37a7-4a67-b35a-00a16ae1e435", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/hamas-official-killed-in-israeli-strike-in-lebanon-3028179/", "message": "Beirut: A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nIsraeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene, Lebanese military sources told Xinhua news agency.\nAlso Read First lorries with aid for Gaza leave newly constructed US pierThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement “will remain resistant until the complete liberation of Palestine.”Tensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "37b5b6f0-20f4-4d6c-93a3-ca8a5a9eb30b", "title": "Operation Iron Swords", "date": "2024-05-18 03:00", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-17.htm", "message": "Operation Iron Swords - Day 224 - 17 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nThere, according to the verified information we have, they were brutally murdered by Hamas terrorists, and their bodies were taken into the Gaza Strip.\n?the corridor of the center of the Gaza Strip and in the neighborhood of Bakshi, the fighters eliminated terrorists, exposed and destroyed underground infrastructures.\nOpinion polls show that Netanyahu would be defeated if the elections were held now amid the chaos of war, according to the newspaper report.\nOperation Iron Swords - By the NumbersIn a recent interview on the Call Me Back podcast with Dan Senor, Israeli Prime Minister Benjamin Netanyahu disclosed startling statistics regarding the casualties in the ongoing conflict between Israel and Hamas."}, {"id": "236c8b51-7b7b-4884-a215-958553f35196", "title": "Israel - Hamas War Day 225 : What happening in West Bank , Gaza ? ", "date": "2024-05-18 04:15", "url": "https://www.jpost.com/israel-hamas-war/2024-05-18/live-updates-801614", "message": "US NATIONAL SECURITY Advisor Jake Sullivan attends the World Economic Forum in Davos, Switzerland, this week.\nThe US must be well-educated regarding Iran's terror network due to the impending threats it poses to regional and global stability, the writer asserts.\n(photo credit: DENIS BALIBOUSE/REUTERS)White House national security adviser Jake Sullivan will travel on Saturday to Saudi Arabia for talks with Crown Prince Mohammed bin Salman and will visit Israel on Sunday to see Israeli Prime Minister Benjamin Netanyahu.\nWhite House national security spokesperson John Kirby told reporters that Sullivan will stress in his talks with the Israelis the need to go after Hamas terrorists in Gaza in a targeted way, not with a full-scale assault on the southern city of Gaza."}, {"id": "15fc8236-e775-4b2b-9f29-a9d9fbf0008e", "title": "SC allows prosecution of HM operatives in Banihal attack", "date": "2024-05-18 03:30", "url": "https://www.dailyexcelsior.com/sc-allows-prosecution-of-hm-operatives-in-banihal-attack/", "message": "The Supreme Court drew parallels between the unsuccessful attack on the CRPF convoy and the deadly 14 February 2019 Pulwama attack, which claimed the lives of 40 CRPF personnel.\nThe Pulwama attack was perpetrated by a suicide bomber affiliated with the Pakistan-based Jaish-e-Mohammad (JeM).\nOn March 30, 2019, individuals suspected to be members of Hizbul Mujahideen attempted to execute an attack on a CRPF convoy in Banihal along the Jammu-Srinagar National Highway.\nFollowing the Pulwama attack, the Union Home Ministry transferred the investigation of the attempted ambush on the CRPF convoy to the NIA.\nNaikoo, one of Kashmir’s most wanted terrorists and the commander of Hizbul Mujahideen (HM) was killed during an encounter in Pulwama in May 2020."}, {"id": "4a34b848-39e1-45ec-87e5-b32a47bbd186", "title": "Xinhua Middle East news summary at 2200 GMT , May 17", "date": "2024-05-18 00:00", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/18/content_117196626.htm", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA -- Yemen's Houthi group said on Friday that it had shot down a \"U.S. MQ-9 spy drone\" over the Yemeni central province of Marib.\n\"The plane was targeted by a locally made surface-to-air missile, and the video showing scenes will be broadcast later,\" Houthi military spokesman Yahya Sarea said in a statement aired by Houthi-run al-Masirah TV.\n(Yemen-Houthis-U.S. Drone)- - - -BEIRUT -- A Hamas member was killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday, Lebanese military sources told Xinhua.\n(Hamas-Israel-Lebanon)- - - -GAZA -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has risen to 35,303, health authorities in the Palestinian enclave said in a press statement on Friday.\n(Gaza-Death Toll)- - - -JERUSALEM -- The Israel Defense Forces (IDF) and the Israeli Security Agency (ISA) recovered in a joint night operation the bodies of three Israeli hostages in the Gaza Strip, as announced by IDF Spokesman Daniel Hagari on Friday."}, {"id": "896091e0-996b-4c83-b2c7-ff75427c6e85", "title": "Iran Update , May 17 , 2024 | Institute for the Study of War", "date": "2024-05-18 02:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-may-17-2024", "message": "Northern Gaza Strip: Israeli forces described the fighting in Jabalia as some of the most intense of the war.\nSouthern Gaza Strip: Israeli forces continued clearing operations in several areas of eastern Rafah.\nIsraeli forces continued clearing operations in several areas of eastern Rafah on May 17.\n[30]Aid trucks began transporting supplies from the US-constructed offshore pier into the Gaza Strip on May 17.\n[39]Palestinian militias conducted at least two indirect fire attacks from the Gaza Strip into Israel on May 17."}, {"id": "26293891-2a07-4169-a2e8-0a796d55075f", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 04:45", "url": "https://dunyanews.tv/en/World/812486-Hamas-says-commander-killed-in-Israel-strike-in-Lebanon", "message": "Hamas says commander killed in Israel strike in LebanonWorld World Hamas says commander killed in Israel strike in LebanonSharhabil Sayed was killed \"after he was targeted by Israeli aircraft\" in Lebanon's West Bekaa area.\nFollow on Published On: Sat, 18 May 2024 07:22:59 PKTBEIRUT (AFP) – Palestinian militant group Hamas said Friday that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nLebanon's official National News Agency reported one dead and two wounded in an \"enemy strike\" that targeted a vehicle in the same area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold."}, {"id": "82b6cee8-bc80-4b00-af39-d19269eb40cb", "title": "Israel prefers to avoid tough war with Hezbollah : Defence Minister", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/israel-prefers-to-avoid-tough-war-with-hezbollah-defence-minister-3028188/", "message": "Jerusalem: Israeli Defence Minister Yoav Gallant has said that his country prefers to avoid a difficult war with the Lebanese armed group Hezbollah.\nAccording to reports in Lebanon, a local leader of the group was killed in the Israeli strikes.\nAt the same time, Hezbollah’s attacks continued on Friday, with dozens of rockets and drones launched into northern Israel.\nThe exchanges of fire between Hezbollah and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and recently launched a drone attack the furthest into Israeli territory since October."}, {"id": "38eb1c3e-834b-427a-a895-575ebc6a9d4a", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 00:15", "url": "https://www.malaymail.com/news/world/2024/05/18/hamas-says-commander-killed-in-israel-strike-in-lebanon/135052", "message": "BEIRUT, May 18 — Palestinian militant group Hamas said Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas’ armed wing, the Ezzedine al-Qassam Brigades, said in a statement that “commander” Sharhabil Sayed was killed “after he was targeted by Israeli occupation aircraft” in Lebanon’s West Bekaa area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold.\nThe cross-border fighting has killed at least 419 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally."}, {"id": "a6a91d52-bb0f-4c82-9dd9-b0db5b2670e7", "title": "Reuters World News Summary", "date": "2024-05-18 02:15", "url": "https://www.devdiscourse.com/article/politics/2942658-reuters-world-news-summary", "message": "Following is a summary of current world news briefs.\nSlovakia's PM Fico undergoes another operation, deputy PM says he is hopefulSlovakia's Prime Minister Robert Fico underwent a two-hour operation on Friday that have increased hopes for his recovery, a deputy prime minister said, following an assassination attempt this week that sent shockwaves through Europe.\nDeputy Prime Minister Robert Kalinak also said any decision to transfer Fico back to the capital Bratislava from the central city of Banska Bystrica where he is being treated would only be taken when there had been further improvement in his condition.\nRegional Governor Oleh Syniehubov had earlier put the death toll at one, with four of the injured in serious condition.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "3b1a1e93-163e-4bbf-bde6-2ef687925d85", "title": "How Israel Rafah Campaign Might Shape Hezbollah Operations", "date": "2024-05-18 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/how-israels-rafah-campaign-might-shape-hezbollahs-operations", "message": "On April 22, Hezbollah claimed to strike a base north of Acre, its deepest attack into Israel since the Gaza war began.\nHezbollah’s Rafah CalculusThe onset of the Rafah campaign is vital to Hezbollah for two main reasons.\nIndeed, multiple indicators and statements imply an Israeli escalation against Hezbollah after Rafah.\nAccordingly, Hezbollah may feel compelled to flex its muscles during the Rafah campaign in order to impose conditions on Israel, Washington, and Paris.\nThe group has already committed to stop its attacks once the Gaza war is over, so it is certainly amenable to the general idea of de-escalation."}, {"id": "bf055571-1a7f-4b92-a798-3df0d16573b5", "title": "J - K : SIA files supplementary charge - sheet against 2 terrorists", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/j-k-sia-files-supplementary-charge-sheet-against-2-terrorists-3028187/", "message": "Jammu: The J-K State Investigation agency on Friday filed a supplementary charge-sheet against two terrorists involved in multiple attacks in Jammu and Kashmir’s Rajouri district, officials said.\nTwo AK assault rifles, a pistol, seven grenades and a large amount of ammunition were seized from them, they added.\nThe accused had received large quantities of arms, ammunition and other war-like stores via drone drops in Lamberi, Rajouri.\nThese were then moved to Kandi Budhal for terrorist activities, as directed by their Pakistani handlers, the spokesman said.\nThe main charge-sheet was filed on December 29 last year by the SIA."}, {"id": "16684818-8ed7-4038-90e4-ad1bcc579409", "title": "Man Arrested : Man arrested for killing four | Indore News", "date": "2024-05-18 00:45", "url": "https://timesofindia.indiatimes.com/city/indore/man-arrested-for-killing-four/articleshow/110221182.cms", "message": "We also published the following articles recentlyFour persons were killed in an accident in KonaseemaFour persons were killed in a tragic road accident in Konaseema district involving an RTC bus.\nThe accident occurred as workers were loading paddy near Udumudi village on Tuesday night.\nAnjali murder case: Karnataka Police arrest accused from HubbaliGirish alias Vishwa, prime suspect in Anjali's murder, arrested by Hubbali Police after stabbing incident at her residence.\nHe told the police that there was a dispute between him and his relative Arvind over ‘Banjghadi’ tradition.\nWhen he saw two other people from Surdiya village passing from the area witnessing the crime, they followed them and mowed them down."}, {"id": "f54384c6-47db-428d-9a70-ef107ea52277", "title": "  Forever changed : Terrorism victims push for passage of new bill to fix U . S . victims fund", "date": "2024-05-18 00:45", "url": "https://www.yahoo.com/news/forever-changed-terrorism-victims-push-000336004.html", "message": "“When your freedoms are taken away, it changes your life,” Synnestvedt told our Washington News Bureau.\nCongress established a fund in 2015 called the U.S. Victims of State Sponsored Terrorism Fund (USVSST Fund) that gives compensation to victims and survivors who won judgements in court after a terrorist attack.\nThe House bill is sponsored by Rep. Mike Lawler (R-NY), Rep. Josh Gottheimer (D-NJ), Rep. Nicole Malliotakis (R-NY), and Rep. Dan Goldman (D-NY).\nWe told you earlier this month how a watchdog report warned the fund is running low on money.\n“Victims of terrorism carry a prolonged grief with them throughout their lifetime,” said Mistrulli."}, {"id": "0703fc79-a84d-4a3d-a819-828d1b0d0d36", "title": "Schmaybe 50 Tunnels Crossing Into Their Country Why Egypt So Riled About Rafah ? ", "date": "2024-05-18 03:00", "url": "https://hotair.com/tree-hugging-sister/2024/05/17/schmaybe-50-tunnels-crossing-into-their-country-why-egypt-so-riled-about-rafah-n3788602", "message": "Nearly 700 tunnel shafts have been identified in Rafah, with ~50 tunnels crossing into Egypt, revealed @DrGiladNoam at today's sham @CIJ_ICJ hearing.\nThose tunnels are used to smuggle weapons to Hamas and can be used to smuggle senior terrorists and/or hostages out of Gaza.\npic.twitter.com/UAgvyTCoJk — Israel War Room (@IsraelWarRoom) May 17, 2024At least fifty tunnels - so far - scootin' over - well, under - the border into Egypt.\n\"Nearly 700 tunnel shafts have been identified in Rafah, from which approximately 50 tunnels cross into Egypt.\nIf any Americans were to be spirited through those tunnels into Egypt, that would be the end of it."}, {"id": "57be6614-48e3-4d6e-9a18-42278ecb32a7", "title": "The Latest | Israel finds bodies of 3 hostages in Gaza , as first aid unloaded by sea", "date": "2024-05-18 02:15", "url": "https://santamariatimes.com/news/national/the-latest-israel-finds-bodies-of-3-hostages-in-gaza-as-first-aid-unloaded-by/article_0d5d321c-91cd-5033-baf5-6333741064da.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "8ee84e96-9819-4128-891b-63d51c8412e7", "title": "7 soldiers injured after blast in St . Petersburg military academy", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532071.html", "message": "Image Source: IANS NewsSt. Petersburg, May 18 : Seven soldiers were injured after a World War II-era munition exploded in the Military Academy of the Signal Corps in St. Petersburg, Russia's Leningrad Military District said.\nThe explosion occurred on Friday during the cleaning of one of the basement premises when people unloaded garbage into a container, the district's press office was quoted as saying by Xinhua news agency.\nA 76-millimeter World War II-era munition \"arbitrarily detonated\", the press office said.\nThe wounded have been taken to the Defense Ministry's health facility, according to the press office.\nGovernor of St. Petersburg Alexander Beglov has denied that the incident was terrorist-related."}, {"id": "4d391d83-2f57-42f9-97d9-effad2138e64", "title": "North Korea Test - Fires Ballistic Missile , Vows Bolstered Nuclear Force", "date": "2024-05-18 03:15", "url": "https://www.ndtv.com/world-news/north-korea-test-fires-ballistic-missile-vows-bolstered-nuclear-force-5688511", "message": "North Korea on Saturday confirmed that it had test-fired a tactical ballistic missile.\nNorth Korea on Saturday confirmed that it had test-fired a tactical ballistic missile, the government news agency KCNA reported, with leader Kim Jong Un vowing to boost the country's nuclear force.\nThe South Korean government reported the launch Friday, saying the North had fired multiple suspected short-range ballistic missiles.\nSeoul described the event as \"several flying objects presumed to be short-range ballistic missiles\" from North Korea's eastern Wonsan area into waters off its coast.\n\"The enemies would be afraid of and dare not to play with fire only when they witness the nuclear combat posture of our state,\" KCNA reported Kim as saying."}, {"id": "c97d7169-ab8a-42be-b31c-5f1242122611", "title": "North Koreas Kim Jong Un Seeks Speeds Up Nuclear Production To Cope With Enemies Reckless Confrontation", "date": "2024-05-18 03:30", "url": "https://www.india.com/news/world/north-koreas-kim-seeks-speeds-up-nuclear-production-to-cope-with-enemies-reckless-confrontation-6938892/", "message": "HomeNewsNorth Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’North Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’Kim expressed contentment with the outcome of the missile test, particularly praising the autonomous navigation system's performance.\nNorth Korea's Kim Seeks Speeds Up Nuclear Production To 'Cope With Enemies Reckless Confrontation'North Korean leader Kim Jong Un has issued a directive to expedite the production process to enhance the country’s nuclear capabilities.\nThe primary objective behind this move is to strengthen North Korea’s nuclear deterrence capabilities, as highlighted by KCNA.\nKim emphasized that by ramping up production, North Korea aims to instill fear in its enemies regarding the country’s nuclear combat readiness.\nKim made the production order “to cope with …the enemies’ reckless military confrontation” and bolster nuclear war deterrence, KCNA said."}, {"id": "f28c6500-27b0-4f82-bc78-70517b72709c", "title": "Colin Sheridan : Harrowing memory of atrocity on our streets put in stark comparison to Gaza horror", "date": "2024-05-18 00:45", "url": "https://www.irishexaminer.com/opinion/columnists/arid-41397181.html", "message": "The bombs, later claimed by the Ulster Volunteer Force, killed 34 civilians, including an unborn child, and injured almost 300.\nMost of the victims were young women, although the ages of the dead ranged from 19 up to 80 years.\nSmoke rises following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, Friday, May 17, 2024.\nIf you were to go to one funeral per day of every child killed in Gaza, it would take 37 years.\nDisplaced Palestinians children take the coastal Rashid road to return to Gaza City as they pass through Nuseirat in the central Gaza Strip on April 14, 2024."}, {"id": "bb50be8e-b7bf-4a64-a829-7d0d37846068", "title": "Gaza : 31 Palestinians killed , 56 injured by Israeli bombardment last 24hrs - The Muslim News", "date": "2024-05-18 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-31-palestinians-killed-56-injured-by-israeli-bombardment-last-24hrs/", "message": "By Abdul Adil(The Muslim News): 31 Palestinians were killed and 56 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 24 hours, according to Ministry of Health.\nThis brings to total number of Palestinians killed by Israeli forces since 7 October 2023 to at least 35,303 and 79,261 injured in Gaza, according to Ministry of Health.\nFour Palestinians were killed and many others injured in Israeli airstrikes on the Nuseirat refugee camp in the central blockaded Gaza Strip.\nAn Israeli raid targeted a Palestinian house located in the al-Shati refugee camp in western Gaza and other raids targeted central Gaza city.\nMedical sources said that the bodies of nine Palestinians killed in Israeli airstrikes and bombardment arrived at the European Gaza Hospital near Khan Younes."}, {"id": "d0f91f9f-46d0-4422-b4b5-ad7fb653a030", "title": "North Korea Kim seeks to shore up nuclear force , oversees missile test , KCNA says | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-18 00:45", "url": "https://www.asahi.com/ajw/articles/15271493", "message": "In this photo provided by the North Korean government, North Korean leader Kim Jong Un, left, supervises artillery firing drills in North Korea, March 7, 2024.\nThis way, the enemy would be afraid of North Korea's nuclear combat posture, Kim added.\nNorth Korea fired a number of short-range ballistic missiles towards the sea off its east coast on Friday, South Korea's military had said.\nKim expressed satisfaction with the successful missile test featuring an autonomous navigation system, KCNA said.\nFriday's launches came a day after the U.S. and South Korea conducted joint drills with stealth fighter jets simulating air combat."}, {"id": "020d9913-45ba-4d12-aca1-96cdd80abebb", "title": "Social divisions and hostile rhetoric in Slovakia provide fertile ground for political violence", "date": "2024-05-18 00:30", "url": "https://www.newsday.com/news/nation/slovakia-prime-minister-polarization-v61889", "message": "But he blamed what he called the hostile communication strategies of Slovak politicians for the growing hostilities in recent years.\nPeople walk in Banska Bystrica, central Slovakia, Friday, May 17, 2024.\nHe referred to journalists and liberal Slovak politicians as “rats.” He called a major television network, two nationwide newspapers and a news website his enemies, and refused to communicate with them.\nPeople walk in Banska Bystrica, central Slovakia, Friday, May 17, 2024.\nSociety has been divided for a long time and this is another thing that will radicalize them even more.”"}]