[{"id": "b2109ea3-6ce7-40af-852f-88190560fe4f", "title": "  Take Back the Campu : Hundreds of Pro - Israel Activists Gather in DC for Major Unity Conference", "date": "2024-08-08 21:15", "url": "https://www.algemeiner.com/2024/08/08/take-back-campus-hundreds-pro-israel-activists-gather-dc-unity-conference/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "As The Algemeiner has previously reported, Jewish college students face an unprecedented crisis in American academia.\nHeld at the Grand Hyatt, the event was the third National Leadership Summit held by the Israel on Campus Coalition (ICC).\nFounded in 2002, the Israel on Campus Coalition is a nonprofit organization that describes its mission as inspiring college students to defend and be proud of Israel.\nOne of its major initiatives is the “microgrants” program, which helps pro-Israel campus groups organize events about Israeli culture and society.\nWe saw throughout this year the importance of Jewish student involvement in student government and conversations with administration."}, {"id": "44b44661-1e00-43a8-aaa5-8b394a4d129a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:45", "url": "https://news3lv.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news."}, {"id": "0ded6dbe-9a66-4465-880d-9ab98bde5f7f", "title": "I am not OK with my childhood synagogue being used as cover for anti - Palestinian hate", "date": "2024-08-08 01:15", "url": "https://rabble.ca/human-rights/i-am-not-ok-with-my-childhood-synagogue-being-used-as-cover-for-anti-palestinian-hate/", "domain": "rabble.ca", "domain_classification": "Unknown", "message": "Last week I was dragged by police from the steps of my childhood synagogue for trying to attend an anti-hate event while wearing a shirt with the words “Jews Say No to Genocide”.\nAnd yet, discussions about the dangers of hate and violence continue to be quite narrow, including discourse among politicians, in the media, and within my own community.\nShaken, we remained outside, chanting for collective liberation and demanding to know why Jews who oppose genocide weren’t being allowed to attend an event supposedly held in solidarity against hate.\nBewilderingly, leaders of legacy Jewish institutions went to social media to disparage fellow Jews for protesting against not being allowed inside a synagogue for a public event.\nThe only conclusion I can draw from any of this, is that this event was not truly an evening of “solidarity” nor was it “against hate”."}, {"id": "b744939c-1058-45ec-a47e-5cee756a10c4", "title": "3 Columbia University deans resign after  antisemitic trope texts scandal : report", "date": "2024-08-08 21:45", "url": "https://nypost.com/2024/08/08/us-news/3-columbia-university-deans-resign-after-antisemitic-tropes-texts-scandal-report/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Three Columbia University deans who exchanged “very troubling” texts that “disturbingly touched on ancient antisemitic tropes” are resigning from the elite school, officials said Thursday.\nColumbia University would not provide additional details surrounding the sudden news, which was first reported by The New York Times.\n4 Susan Chang-Kim, Columbia College’s vice dean and chief administrative officer, was among the university brass placed on leave in the wake of the exchange.\nHis profile was still listed on the university’s staff directory Thursday, while Chang-Kim, Patashnick and Kromm’s were deleted.\nEarly Thursday, pro-Palestine vandals drew hateful inverted triangle symbols, splattered red paint — and unleashed live crickets and mealworms — across a top Columbia University executive’s Brooklyn apartment building."}, {"id": "e942bd83-e2d0-4bfb-b46b-c1593ece707a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:15", "url": "https://cbs2iowa.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news."}, {"id": "46d988be-b5f4-4cde-ba97-7736893a1d5a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:45", "url": "https://klewtv.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "klewtv.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news."}, {"id": "74829cd9-a46b-4d45-a0a6-708ec830ca64", "title": "MP complains over anti - fascist group equating  Zionist with far - Right", "date": "2024-08-08 15:30", "url": "https://www.yahoo.com/news/mp-complains-over-anti-fascist-150030318.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sarah Sackman, the new MP for Finchley, has voiced concerns of constituents over 'anti-Semitic' material spread by activistsA Labour MP has reported an anti-fascist group in north London to the police after a poster from a protest equated “Zionists” with the far-Right.\nSarah Sackman, the new MP for Finchley and Golders Green, said material shared by groups ahead of the demonstration in North Finchley on Wednesday evening was “clearly anti-Semitic”.\nAround 1,000 activists and dozens of police officers had gathered along North Finchley High Road over concerns far-Right agitators were planning to target an immigration office.\nWhether it’s the far-Right or far-Left, there can be zero tolerance for anti-Semitism, Islamophobia or racism in any form.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more."}, {"id": "3e82a842-4076-42d3-b37a-3ef56a573e96", "title": "3 Columbia University administrators resign over controversial texts", "date": "2024-08-08 23:30", "url": "https://www.yahoo.com/news/3-columbia-university-administrators-resign-222400433.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NEW YORK -- Three Columbia University administrators who had been placed on leave over controversial texts they exchanged during an on-campus event about Jewish life at the school have resigned, the school confirmed.\nColumbia President Minouche Shafik previously said in a letter the texts were \"not only unprofessional, but also disturbingly touched on ancient antisemitic tropes.\nOne dean will remainA fourth college dean, Josef Sorrett, will remain at the college.\n\"While not intended as such, some of the text messages exchanged may call to mind antisemitic tropes,\" Sorett said in a letter previously released to the Columbia College community.\nHe said \"the loss of trust and the pain this incident has caused, particularly to the Jewish members of our community, must be fully repaired.\""}, {"id": "7e5c9b0b-6e69-493b-a689-58341b85bb92", "title": "Not inviting Israel harms the memory of innocent Japanese , Israel", "date": "2024-08-08 03:00", "url": "https://www.jpost.com/opinion/article-813809", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In his decision not to invite the Israeli ambassador to Japan to the yearly ceremony commemorating the atomic bombing of Nagasaki, Nagasaki Mayor Shiro Suzuki debased the memory of countless innocent victims.\nThis singling out of Israel demonstrates the mayor’s remarkable historical illiteracy and sets back decades of efforts to build positive relations between Japan, Israel, and world Jewry.\nAdding insult to injury, Mayor Suzuki invited a Palestinian representative to attend even as 115 innocent hostages are still held in terror tunnels beneath Gaza by the Palestinian terrorist group Hamas.\nThe atomic bombing of Nagasaki helped finally end World War II, a war which saw Imperial Japan allied with Nazi Germany.\nThe decision by Nagasaki Mayor Suzuki cheapens and demeans the important lessons that his city has rightly been teaching for generations."}, {"id": "3a21a58e-c3c5-404f-a3df-e803a2dbcecf", "title": "Kamala Harris  Open  to Discussing Arms Embargo on Israel in Exchange for Michigan  Uncommitted  Votes", "date": "2024-08-08 05:00", "url": "https://www.breitbart.com/politics/2024/08/07/kamala-harris-open-to-discussing-arms-embargo-on-israel-in-exchange-for-michigan-uncommitted-votes/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris indicated Wednesday that she would be open to discussing an arms embargo against Israel in exchange for the support of the so-called “uncommitted” movement of Muslim and Arab voters in Michigan.\nHarris listened to stories of people in Michigan who have had dozens of family members killed in Gaza.\nThe protesters, some wearing Muslim hijabs, chanted: “Kamala, Kamala, you can’t hide.\nIn Detroit, after protestors for the Palestinian cause disrupted her speech for a second time, Vice-President Kamala Harris says: “You know what?\nWalz, on the other hand, while supportive of Israel, has also backed anti-Israel and antisemitic Rep. Ilhan Omar (D-MN)."}, {"id": "efad1c0b-b17b-4d46-a847-a1726f26c760", "title": "Where Kamala Harris VP Pick Tim Walz Stands on Israel", "date": "2024-08-08 21:15", "url": "https://www.algemeiner.com/2024/08/08/where-kamala-harris-vp-pick-tim-walz-stands-israel/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Tim Walz (D) as her vice-presidential running mate has sent allies of Israel to search for clues about Walz’s views on the Jewish state and the Middle East more broadly.\nA review of Walz’s record during his tenure in the US Congress and as a governor shows a general trend of support for Israel.\nWalz has issued statements supporting Israel’s right to self-defense and affirming the importance of the Jewish state’s existence.\nWhile serving in Congress from 2007 to 2019, Walz repeatedly exhibited support for Israel.\nSo it is antisemitic.”However, Walz’s support for the Jewish state is not absolute."}, {"id": "4d6112fb-1105-4c1f-b8a6-b3d96d6e2124", "title": "Donald Trump fears over racing against Kamala Harris", "date": "2024-08-08 03:00", "url": "https://www.jpost.com/opinion/article-813772", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "She started this week by picking Minnesota’s popular Governor Tim Walz as her running mate after a careful vetting.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris speaks at an election campaign event in Atlanta, on Tuesday.\nThe man who discovered late in life that Abraham Lincoln was a Republican, recently learned that Harris is Black.\nTRUMP IS running scared and looking for an excuse to avoid debating Harris.\nHARRIS, NEARLY 20 years his junior, like Walz, has taken a tactic right out of Trump’s playbook that has him running scared."}, {"id": "94c801cc-f7d6-4443-92ec-e84350e336ff", "title": "Belgian City Accused of Antisemitism for Banning Israeli Athletes From International Frisbee Tournament", "date": "2024-08-08 21:15", "url": "https://www.algemeiner.com/2024/08/08/belgian-city-accused-antisemitism-banning-israeli-athletes-international-frisbee-tournament/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "The Belgian city of Ghent and organizers of an international frisbee tournament are being accused of antisemitism and discrimination after an Israeli delegation of athletes was prohibited from participating in or even being present at the competition that started this week.\nA total of 33 Israeli athletes traveled to Belgium to compete in the open and mixed divisions of the tournament, which will feature teams from 11 countries.\nThe city also said it forbids “any references related to the Israeli-Palestinian conflict (such as flags, clothing, inscriptions, pamphlets, etc.)\n“Prohibiting Israelis from an international frisbee tournament highlights a troubling trend of xenophobia in sports,” WJC said in a statement shared on X/Twitter.\n“This move by the European Ultimate Federation should be unequivocally rejected."}, {"id": "b38b5b90-3630-4240-a172-8fb6d25df73c", "title": "Opinion : Shame in rioting on streets , difference between racism and immigration concern and scrapping winter fuel allowance debated in letters to the editor", "date": "2024-08-08 08:15", "url": "https://www.kentonline.co.uk/news/opinion/racist-scum-bringing-terror-to-streets-no-different-to-nazi-310922/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "The Second World War would never have happened if ordinary, decent Germans had not closed their eyes to what was happening in their country,We must not allow history to repeat itself here.\nBob Britnell‘We now have to the financial ignominy of losing the winter fuel allowance’ Picture: iStockUnfair to scrap winter fuel allowanceMay I say a big ‘thank you’ to the Conservatives and now Labour for bashing pensioners like myself who are just above the pension tax credit limit.\nWe now have had to suffer yet another financial ignominy of losing the winter fuel allowance.\nFirstly the Conservatives did not increase the personal tax allowance, so pensioners like me now pay tax on a meagre income and now lose the winter fuel allowance.\nTo me, its frightening cargo is a reminder of the horror and destruction wrought by the Second World War."}]