[{"id": "be17aa5a-5472-4d5c-b141-e2d7673d5871", "title": "Historic tropical cyclone threatens Tanzania with major flooding", "date": "2024-05-04 15:15", "url": "https://www.theweathernetwork.com/en/news/weather/severe/historic-tropical-cyclone-hidaya-threatens-tanzania-with-major-flooding", "message": "Forecast Centre The Weather Network Hidaya is the strongest tropical cyclone ever recorded in the Tanzanian regionDeadly floods across eastern Africa may worsen this weekend after Cyclone Hidaya made landfall in Tanzania on Saturday.\nThe storm, a historic first for this stretch of coastal Africa, could produce 100-200+ mm of rain around the country’s densely populated capital region of Dar es Salaam.\nThe storm made landfall near the Tanzanian capital of Dar es Salaam in the early morning hours on Saturday.\nStrong winds are a secondary threat to the tremendous amount of tropical rainfall that’ll push into the coast through this weekend.\nForecasters expect more than 200 mm of rain to fall around the Dar es Salaam region, which is home to more than 5 million people."}, {"id": "95c5330c-ecf6-418b-90ca-7d6cb460036d", "title": "Hurricane Preparedness Week kicks off : Know your risk from wind and water", "date": "2024-05-05 07:15", "url": "https://cbs12.com/news/local/sunday-may-5-2024-hurricane-preparedness-week-kicks-off-know-your-risk-from-wind-and-water", "message": "Hurricane season begins on June 1st and ends on November 30th, but this is not a set-in-stone timeframe.\nThere have been years when tropical systems have developed before the season begins and after the season ends.\nFor South Florida, historically, most of our landfalling hurricanes occur after the climatological peak of the season on September 10.\nYou know what the risks are here in South Florida.\nCheck back all this week on CBS 12 News and CBS 12.com to continue preparing for the upcoming hurricane season."}, {"id": "cdf9d483-4feb-407f-b8b0-0a3bad2e4400", "title": "If a Tsunami Hit Massachusetts Here Is What Would Happen", "date": "2024-05-04 18:00", "url": "https://wokq.com/ixp/519/p/massachusetts-tsunami-preparation-safety/", "message": "If you lived through the devastating tsunamis in Indonesia and Japan, the televised images of loss of life and wreckage immediately come to mind when you hear the word.\nIn April of 2024, Indonesia issued a tsunami alert, evacuating thousands after a volcano erupted on a remote island.\nThe state has calculated how many hospitals, bridges and pieces of infrastructure sit in danger of tsunami destruction.\nThe report did not indicate whether the Commonwealth has yet succeeded in organizing a comprehensive tsunami warning system for coastline residents.\nIt's important to remember that while a tsunami event could cripple waterfront parts of Massachusetts, historically, they are a rare occurrence in this part of the country."}, {"id": "596edc8c-df39-46c9-8410-fa4663c70e1a", "title": "Texas is getting hotter and drier . Here what we can do about it . ", "date": "2024-05-04 20:45", "url": "https://www.dallasnews.com/opinion/commentary/2024/05/04/texas-weather-getting-hotter-plan-ahead/", "message": "Texas summers have become significantly hotter and rainfall is becoming more sporadic, reshaping Texas’ weather patterns.\nThese are just some of the conclusions found in the latest edition of “Future Trends of Extreme Weather in Texas,” a report produced by the Office of the Texas State Climatologist at Texas A&M University in collaboration with Texas 2036.\nAdvertisementUpdated data and analysis in the new report tell us many extreme weather trends continue to accelerate in Texas, posing daunting challenges to Texas’ water supply, flood control and electric power resources.\nTexas’ susceptibility to extreme weather trends should continue to inform state policymakers’ decisions.\nAdvertisementJohn Nielsen-Gammon has served as the Texas state climatologist since 2000."}, {"id": "7c573c4e-cf7e-465c-85fe-c220a4525211", "title": "Hurricane Preparedness Week 2024", "date": "2024-05-04 00:45", "url": "https://www.wuft.org/weather/2024-05-03/hurricane-preparedness-week-2024", "message": "Sunday May 5th is the first day of the National Oceanic and Atmospheric Admistration (NOAA) National Hurricane Preparedness Week.\nThe start of the 2024 hurricane season less than a month away and there are early indicators of an active year in the tropics.\nOn day one of Hurricane Preparedness week, NOAA is focusing on knowing the risks for your particular area.\nAlso as part of Hurricane Preparedness Week, NOAA is emphasizing the importance of having a plan far in advance of any tropical threats.\nBeing ready for hurricane season takes time."}, {"id": "abc5e1b9-e1cd-4d40-a8ad-533d7bed936c", "title": "Evacuations ordered , homes damaged in Texas as rivers surge to Hurricane Harvey levels . And more rain is on the way", "date": "2024-05-04 15:45", "url": "https://www.aol.com/evacuations-ordered-homes-damaged-texas-145941738.html", "message": "“Due to continuous rainfall across East Texas and rising levels in creeks and rivers, flood levels may increase.\nGreg Abbott expanded the storm-related declarations in response to the flooding, according to a news release.\nThe repeated bouts of heavy rainfall soaked soils, making many areas extremely prone to both flash and river flooding.\nHurricane Harvey created a widespread flooding disaster in Houston after dropping 30 to 40 inches of rain across the entire metro in just 48 hours.\n- KTXSRainfall totals from flooding in Texas and Louisiana this week showed nearly two feet of rain in five days, according to the National Weather Service."}, {"id": "978fe317-eab1-4bed-a41c-5ae8a9827267", "title": "Be prepared for Hurricane Season 2024 before it begins June 1", "date": "2024-05-04 12:30", "url": "https://news.wgcu.org/hurricane/2024-05-04/be-prepared-for-hurricane-season-2024-before-it-begins-june-1", "message": "Sunday May 5th is the first day of the National Oceanic and Atmospheric Admistration (NOAA) National Hurricane Preparedness Week.\nThe start of the 2024 hurricane season less than a month away and there are early indicators of an active year in the tropics.\nAnother way to be prepared for hurricane season is by knowing where to go to get high quality weather information for your area or areas that are along your evacuation route.\nIt's not just the National Hurricane Center track forecast for a specific storm that is important.\nBeing ready for hurricane season takes time."}, {"id": "4cc0af9d-7ab5-48dc-9a36-01d81afd2040", "title": "Houston - area flooding could create new San Jacinto River flood risks", "date": "2024-05-04 15:15", "url": "http://www.houstonchronicle.com/news/houston-texas/environment/article/san-jacinto-river-floodwater-sediment-sand-19437982.php", "message": "Mark Mulligan/Staff photographer Following Hurricane Harvey, crews began an emergency dredging operation in the San Jacinto River West Fork on Thursday, Sept. 20, 2018.\nThe rising water from the West Fork of the San Jacinto River, downstream from Lake Conroe, flooded homes and roads along FM2854.\nYi-Chin Lee/Staff photographer A helicopter flies above the San Jacinto River, that has rose out of its banks in the aftermath of a severe storm on Thursday, May 2, 2024 in Conroe.\nThe rising water from the West Fork of the San Jacinto River, downstream from Lake Conroe, flooded homes and roads along FM2854.\nBrett Coomer/Staff photographerSome Kingwood-area residents are worried that sediment roiling in the flood-ravaged San Jacinto River will create blockages like those that sent floodwater into nearby homes during Hurricane Harvey."}, {"id": "496028c2-0331-4389-a285-af9e3f66fab2", "title": "As climate change threatens cemeteries , states look to Louisiana for help", "date": "2024-05-04 00:45", "url": "https://www.wwno.org/coastal-desk/2024-05-03/as-climate-change-threatens-cemeteries-states-look-to-louisiana-for-help", "message": "As climate change increases the likelihood of weather-related disasters, many other states are now grappling with damaged cemeteries.\nLouisiana's cemetery task forceThe flooding that damaged Dalfrey’s family members’ graves in 2016 affected more than 800 graves in 74 cemeteries across Louisiana.\nAfter that event, the Louisiana Cemetery Response Task Force was created.\n“We are the only state that has that,” says Ryan Seidemann, the task force chairman.\nThe task force is activated when there has been a disaster declaration and reports of cemetery damage."}, {"id": "afdb3548-4b34-4013-a1df-82787b2f7f6a", "title": "San Jacinto River Authority explains release of Lake Conroe water", "date": "2024-05-05 05:45", "url": "https://www.fox26houston.com/news/san-jacinto-river-authority-explains-release-lake-conroe", "message": "Some homeowners are raising concerns that water releases from Lake Conroe are making flooding worse.\nThe homeowners expressed their frustrations to FOX 26 Houston about the San Jacinto River Authority releasing water into the San Jacinto River which is now flooding.\nRELATED: Houston flooding: Water rescues in the Cleveland, Huffman area\"Where that water is flowing out from my yard and the yard next to it.\nThe San Jacinto River Authority said in 2017 during Hurricane Harvey, the inflow into Lake Conroe was about 130,000 cubic feet per second.\n\"Our primary goal is to protect our dam,\" said Aubrey Spear, the general manager of the San Jacinto River Authority."}, {"id": "5ff3c22a-ef7f-4f63-b11e-ac9c22d74902", "title": "Kingwood residents face escalating floods ; officials urge evacuation but some remain", "date": "2024-05-04 05:45", "url": "https://www.fox26houston.com/news/kingwood-residents-face-escalating-floods-urge-evacuation-some-remain", "message": "FOX 26 rode along a local rescuer.\nFOX 26 has been reporting in Kingwood for a couple of days and witnessed flooded streets, immobilized vehicles, and community members in need of rescue.\nDaren Hopeflush, a Kingwood resident, reflected on the shock of the rapid rise in water levels, expressing his concern during a dry and sunny afternoon.\nBen Altemus is a Kingwood resident, and he bought a five-ton military truck after Hurricane Harvey in 2017.\nFOX 26 Houston is now on the FOX LOCAL app available through Apple TV, Amazon FireTV, Roku, Google Android TV, and Vizio!"}, {"id": "04a59a23-fdc8-46d0-b50f-f56a338135f4", "title": "Houston weather updates : Flood threat persists as rivers swell", "date": "2024-05-04 15:15", "url": "http://www.houstonchronicle.com/news/houston-weather/article/houston-flooding-weather-updates-19438274.php", "message": "Raquel Natalicchio/Staff photographer Severe flooding is seen on Idle Glen Roadway on Saturday, May 4, 2024, in New Caney.\nJason Fochtman/Staff photographer Homes are inundated due to severe flooding on Saturday, May 4, 2024, in Channelview.\nRaquel Natalicchio/Staff photographer A neighborhood is seen inundated due to severe flooding on Saturday, May 4, 2024, in Channelview.\nThe West Lake Houston Parkway Bridge connecting Kingwood and Atascocita is closed due to high water on both sides of the bridge.\nHarris County Judge Lina Hidalgo said the surge of flood water heading toward Lake Houston remains unpredictable."}, {"id": "e3a4b0ed-52a5-4a32-a919-405434b67ec1", "title": "Brazilians wait on their roofs to be rescued by the military as death toll rises to 57 in record - breaking floods that have made thousands homeless", "date": "2024-05-04 17:30", "url": "https://www.dailymail.co.uk/news/article-13382893/Brazil-death-toll-rises-57-floods-thousands-homeless.html", "message": "Record breaking floods in Brazil have left thousands homeless, with people having to be rescued from their roofs by the military.\nFootage showed residents hit by downpours receiving help as the country faced its worst flooding in 80 years.\nLocal authorities in Brazil's southernmost state of Rio Grande do Sul said that floods had so far claimed 56 lives as of Saturday afternoon, with dozens still yet to be accounted for.\nHeavy rains had already hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers."}, {"id": "45f6ff93-a7d4-44cc-a9de-10e34a5be942", "title": "Rising death toll from rains in Brazil as floods destroy roads and bridges", "date": "2024-05-04 21:00", "url": "https://www.irishtimes.com/world/americas/2024/05/04/rising-death-toll-from-rains-in-brazil-as-floods-destroy-roads-and-bridges/", "message": "The death toll from rains in Brazil’s southernmost state of Rio Grande do Sul rose to 57, local authorities said on Saturday afternoon, while dozens still have not been accounted for.\nFloods destroyed roads and bridges in several regions of the state.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nHeavy rains had hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers."}, {"id": "8a808f19-cf02-4c36-a773-f62cf4d884c2", "title": "Death toll from rains in southern Brazil climbs to 57 , some 70 still missing", "date": "2024-05-04 18:45", "url": "https://www.swissinfo.ch/eng/death-toll-from-rains-in-southern-brazil-climbs-to-57%2c-some-70-still-missing/76910115", "message": "Heavy rains in southern Brazil kill nearly 60, over 70 still missing2 minutesSAO PAULO (Reuters) -Heavy rains in Brazil’s southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities’ authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought."}, {"id": "969ab38a-e163-4b39-8c6e-6822062ba909", "title": "Drain the Sunken Pirate City - National Geographic Channel HD", "date": "2024-05-04 16:45", "url": "https://www.tvguide.co.uk/schedule/39859385-5b66-5c57-8986-45eda1390bec/drain-the-sunken-pirate-city", "message": "Drain the Sunken Pirate CityNational Geographic Channel HD 10:00 PM to 11:00 PM Saturday 4 May Share Add toCalendar +Drain the Sunken Pirate CityExperts investigate the fate of Port Royal.\nKnown as 'the wickedest city on Earth', it was a famous hangout for pirates until an earthquake and tsunami sucked it into the ocean in 1692Drain the Sunken Pirate City airs on National Geographic Channel HD at 10:00 PM, Saturday 4 May ."}, {"id": "b55ae1ad-f6a3-41fb-a009-32c6ab4ed6aa", "title": "Death toll from rains in southern Brazil climbs to 57 , some 70 still missing", "date": "2024-05-04 19:00", "url": "https://gazette.com/news/us-world/death-toll-from-rains-in-southern-brazil-climbs-to-57-some-70-still-missing/article_7254bb8e-f2ad-5d42-a10f-9a99b98bb5de.html", "message": "SAO PAULO (Reuters) -Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought."}, {"id": "d35fd085-7da8-4f8a-bc58-c828ffb8f524", "title": "Blog : Our soggy weather pattern begins", "date": "2024-05-05 13:00", "url": "https://www.yahoo.com/news/blog-soggy-weather-pattern-begins-110246403.html", "message": "As we head into the work week, we’ll continue to see some scattered rain chances.\nWitA few storms mid to late week could be strong – especially Thursday as a front moves into the area.\nStay tuned for updates and make sure you have our WAVY Weather app to get any alerts that are issued.\nThis week on Wednesday the NOAA Hurricane Hunter aircraft will be here in our area and you can tour the planes.\nMeteorologist Ricky MatthewsFollow Ricky on Facebook and TwitterFor the latest news, weather, sports, and streaming video, head to WAVY.com."}, {"id": "005712f8-db7c-4f53-bcc0-00f45283c3e5", "title": "Flooding death toll in Brazil climbs to 57 , dozens missing", "date": "2024-05-04 19:00", "url": "https://www.voanews.com/a/flooding-death-toll-in-brazil-climbs-to-57-dozens-missing-/7598067.html", "message": "The death toll from rains in Brazil's southernmost state of Rio Grande do Sul rose to 57, local authorities said Saturday afternoon, while dozens still have not been accounted for.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaíba River broke its banks, flooding streets.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rain and others of drought.\nHeavy rains had already hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers."}, {"id": "a3fb6302-12b0-429b-b1c9-41e54ed291e2", "title": "Houston braces for flooding to worsen in wake of storms", "date": "2024-05-04 20:45", "url": "https://indianexpress.com/article/world/houston-braces-for-flooding-to-worsen-in-wake-of-storms-9308379/", "message": "A stranded care is seen near the bridge over Lake Houston along West Lake Houston Parkway after it was closed due to high water on either side of the thoroughfare, Saturday, May 4, 2024, in Kingwood, Texas.\n(Jason Fochtman/Houston Chronicle via AP)The water could be seen flowing into parts of the couple’s subdivision.\nHOUSTON IS ONE OF THE MOST FLOOD-PRONE METRO AREAS IN THE USAuthorities in Houston had not reported any deaths or injuries.\n(Jason Fochtman/Houston Chronicle via AP)Most of Houston’s city limits were not heavily impacted by the weather.\nThe greater Houston area covers about 10,000 square miles (about 25,900 square kilometers) — a footprint slightly bigger than New Jersey."}, {"id": "1144267f-24a3-44f4-a2bf-c300e7e6e442", "title": "Evacuations ordered , homes damaged in Texas as rivers rise to Hurricane Harvey level", "date": "2024-05-04 03:45", "url": "https://www.thepacket.ca/evacuations-ordered-homes-damaged-in-texas-as-rivers-rise-to-hurricane-harvey-level/", "message": "CNN—Severe storms and heavy rains have intensified flooding in Texas, sweeping away vehicles, damaging homes and prompting evacuations.\n“As rain continues to fall across East Texas and creeks and rivers rise, flood levels may increase.\nParts of East Texas have received three to seven times the normal rainfall over the past three to four weeks.\nRepeated heavy rains have soaked the soil, leaving many areas highly prone to both flash and river flooding.\nTornadoes with severe thunderstorms moved north and south of the Abilene area in West Texas as heavy rain left East Texas flooded."}, {"id": "0ab47814-17de-45d6-a34d-43ffd76e1b22", "title": "Firefighter mental health a priority , wildfire service says", "date": "2024-05-04 16:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfire-wildland-firefighter-mental-health-1.7189560", "message": "Wildfire Service and other agencies are working to make sure wildland firefighters have mental health supports ready and available year round.\nIts recommendations included the need for mental health and resilience resources.\nfirefighter's mental health Mike Roberts is the CEO of the B.C.\nClinical counsellor Anna Richards runs a confidential hotline, which is contracted by the wildfire service to offer immediate and ongoing counselling to its employees.\n\"There is a change, organizationally, around the culture around mental health.\""}, {"id": "1ca222d9-059f-4106-9ead-676e76ed9c2c", "title": "DeSantis opposes National Guard move to Space Force", "date": "2024-05-03 22:30", "url": "https://www.yahoo.com/news/desantis-opposes-national-guard-move-212201168.html", "message": "Ron DeSantis (R) sent a letter Friday outlining his opposition to the Biden administration’s move to incorporate Air National Guard service members into the Space Force.\n“As a low-lying, storm-prone state, Florida is uniquely vulnerable to hurricanes and flooding that require significant, operationally ready logistics and disaster support, including from our National Guard units,” he wrote.\nDeSantis argued that Florida’s National Guard should be larger than it currently is, but the federal government has “under-resourced” the state in comparison to other large states.\nAccording to his letter, the state of Florida has established the Florida State Guard to supplement the state’s National Guard in times of need.\nThe Space Force has major operations in Florida at Patrick Space Force Base."}, {"id": "c2bbb8f1-d7b5-406d-a6a2-857683d5e226", "title": "DeSantis opposes National Guard move to Space Force", "date": "2024-05-03 22:30", "url": "https://www.aol.com/desantis-opposes-national-guard-move-212201324.html", "message": "Ron DeSantis (R) sent a letter Friday outlining his opposition to the Biden administration’s move to incorporate Air National Guard service members into the Space Force.\n“As a low-lying, storm-prone state, Florida is uniquely vulnerable to hurricanes and flooding that require significant, operationally ready logistics and disaster support, including from our National Guard units,” he wrote.\nDeSantis argued that Florida’s National Guard should be larger than it currently is, but the federal government has “under-resourced” the state in comparison to other large states.\nAccording to his letter, the state of Florida has established the Florida State Guard to supplement the state’s National Guard in times of need.\nThe Space Force has major operations in Florida at Patrick Space Force Base."}, {"id": "68b8f180-ef0e-415e-8c0e-874f3164d7c9", "title": "Stuck in Vt : Visiting the  Wind Phone  at the Lanpher Memorial Library in Hyde Park", "date": "2024-05-04 03:00", "url": "https://www.wcax.com/2024/05/03/stuck-vt-visiting-wind-phone-lanpher-memorial-library-hyde-park/", "message": "The following year, an earthquake and tsunami devastated Japan, killing nearly 20,000 people.\nSasaki opened up his booth to the public, and thousands have visited since to “call” their loved ones on the other side.\n”Wind phones” have caught on around the world, including in Vermont.\nIn Hyde Park, Lanpher Memorial Library director Amy Olsen was inspired to propose adding a wind phone outside the library.\nSeven Days’ Eva Sollberger visited the wind phone and spoke to organizers and community members about it."}, {"id": "c97c4cf0-d995-46a0-ab2e-255b9a650735", "title": "The science behind why the world is getting wetter", "date": "2024-05-05 10:00", "url": "https://www.livemint.com/science/the-science-behind-why-the-world-is-getting-wetter-11714901298593.html", "message": "The powerful downpours are the result of natural weather patterns being supercharged by a record-breaking year for global temperatures.\nAs the globe gets hotter, it is getting wetter too.\nRecord rainfall totaling 17 inches across the month inundated Guangdong province, in southern China, where on Monday a section of a highway collapsed in a mountainous area, killing 48 people.\nThere have been 10 straight months of record-breaking global average atmospheric temperatures, and 12 consecutive months of record global average ocean temperatures.\nRecord rainfall hit the island, the miner said."}, {"id": "2094547a-fc1c-4507-a6f0-ec82b8ca1998", "title": "Inside abandoned ghost town at Fukushima after nuclear power plant meltdown", "date": "2024-05-05 08:30", "url": "https://www.mirror.co.uk/news/weird-news/inside-abandoned-ghost-town-fukushima-32696396", "message": "Tokyo Matilda, a 20-year-old from Sheffield, England, embarked on a mission to delve into this deserted ghost town of Fukushima in Japan.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)While visiting the disaster site, Tokyo explored a theme park, a school and even a ramen café that have all been empty since 2011.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)The danger of radiation poisoning was a very real risk for Tokyo as she explored the many sights.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)‌The Fukushima disaster took place when three of the six nuclear reactors in the power plant suffered damage to their core after the 9.1 magnitude earthquake and following tsunami.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)In turn, they began releasing hydrogen and deadly toxic radiation into the surrounding environment and causing a huge hydrogen explosion that impeded immediate shutdown and rescue efforts."}, {"id": "f0646795-e9c6-47de-9a6a-0956d1bf9d22", "title": "Earthquake Felt In Edmond On Saturday", "date": "2024-05-05 01:30", "url": "http://www.news9.com/story/663639242f0aca064a01f4a7/earthquake-felt-in-edmond-on-saturday", "message": "As the winter storm moved into the metro this weekend, many people in Oklahoma City and Edmond felt more than a cold front.\nHolle says following an earthquake event, his office receives calls from customers about earthquake coverage.\nHe says while it’s not part of the homeowner’s standard policy, earthquake insurance is available as an endorsement or a stand-alone policy.\nInformation from the OID website says earthquake insurance covers repairs needed because of earthquake damage to your home and that an Oklahoma homeowner can expect to pay $50 to $300 per year for earthquake coverage.\nReview your earthquake coverage to understand what is not covered or speak to your agent."}, {"id": "6300a9ec-2080-4c27-aa41-b61d33b86e10", "title": "Commentary : Climate challenges at the nation most expensive home", "date": "2024-05-05 11:30", "url": "https://www.orlandosentinel.com/2024/05/05/commentary-climate-challenges-at-the-nations-most-expensive-home/", "message": "Scientists have confirmed Hurricane Ian’s destructive power was exacerbated by climate change, leading to heavier rains, more powerful winds and a higher storm surge.\nThe 100 Bay property epitomizes the complexities facing buyers in today’s emerging climate-aware market.\nIn 2024, we can now scientifically attribute whether damaging weather events were made more likely or more damaging due to climate change.\nThe stunning property at 100 Bay Road should be enjoyed for generations to come, but its future is jeopardized by climate change.\nThis opinion piece was distributed by The Invading Sea website (www.theinvadingsea.com), which posts news and commentary on climate change and other environmental issues affecting Florida."}, {"id": "bbc8ea9a-8bef-49ee-aeeb-c61473bd904a", "title": "High winds to rip across interior West and High Plains , generating difficult travel and a high fire risk", "date": "2024-05-04 17:30", "url": "https://www.yahoo.com/news/high-winds-rip-across-interior-153109163.html", "message": "\"Winds may become strong enough to cause property damage, knock over trees and bring down power lines [into] Monday from the Rockies to the High Plains,\" AccuWeather Senior Meteorologist Alex Sosnowski said.\nAccuWeather's experts say wind gusts of 40-60 mph will sweep across the Southwestern states through the end of the weekend before reaching the High Plains by Monday.\n\"These winds will make for difficult travel as areas of blowing dust could reduce visibility for drivers across the region,\" AccuWeather Senior Meteorologist Dan Pydynowski said.\nUnlock AccuWeather Alerts™ with Premium+\"By Monday, I-90 and I-94 will be buffeted by strong south-to-southeasterly winds, which can make for tough travel, according to Pydynowski.\nThe region is expected to face a high to extreme risk of significant fires this year, especially through the month of June."}, {"id": "e1bd9984-1693-450b-8ad5-7a3974a0fe42", "title": "Heavy winds and rain damage homes and cause more flooding in Tanzania", "date": "2024-05-05 08:45", "url": "https://www.africanews.com/2024/05/05/heavy-winds-and-rain-damage-homes-and-cause-more-flooding-in-tanzania/", "message": "Heavy rains and strong winds have caused damage and more flooding as Cyclone Hidaya lashed Tanzania over the weekend.\nA major blackout hit most of the country on Saturday as it braced for the tropical cyclone which came following weeks of flooding in the region which has left over 150 people dead.\nThe weather service says more than usual amounts of rainfall were recorded in coastal areas overnight Friday, and forecasters warned flooding across the region may worsen this weekend.\nHeavy rain and flooding has caused chaos on the roads and for small businesses, with authorities saying more than 200 thousand people have been affected.\nHidaya is reportedly the strongest tropical cyclone ever recorded in Tanzania"}, {"id": "a5a54228-dec5-4c67-bef0-ff25c1af252c", "title": "Watch : Powerful Texas Floodwaters Sweep Semi Away", "date": "2024-05-05 06:30", "url": "https://987jack.com/ixp/175/p/texas-floodwaters-sweep-semi-away/", "message": "But there’s a reason for the saying “turn around, don’t drown.”According to the National Weather Service, more people die from drowning in floodwaters each year than from any other hazard related to thunderstorms.\nGet our free mobile appMany people underestimate the power of floodwaters and fall victim to drowning.\nThe below video is the perfect example of just how powerful floodwaters can be.\nFootage shows the terrifying moment a semi is sucked into flooding on I-59 near Shepherd, Texas.\nKeep reading to discover the 50 of the most expensive climate disasters in recent decades in the U.S. Gallery Credit: KATELYN LEBOFF"}, {"id": "63eee2bd-8e89-419a-9505-492fcf0c41d8", "title": "  The water is coming this way : Mayor Whitmire visits Kingwood ahead of  peak  flooding as concerns pour in", "date": "2024-05-04 01:15", "url": "https://www.click2houston.com/news/local/2024/05/03/watch-live-mayor-whitmire-updates-the-flooding-situation-in-kingwood/", "message": "HOUSTON – Houston Mayor John Whitmire visited Houston Fire Station 102 in Kingwood to provide the latest updates as we move into the night, which he says is considered the “peak” of the flooding.\nAs clear skies shine in the Kingwood area, Whitmire urged residents in the area not to take the tame conditions as a sign that the flooding won’t be significant.\n“I think we have to guard against any false impression that we have been cleared,” Whitmire said.\nHeavy thunderstorms pounded the Houston area Thursday and made their presence known with gusty winds, lots of lightning, and very heavy rainfall.\nSeveral videos from Kingwood yesterday illustrated the hectic flooding conditions that are already plaguing the area."}, {"id": "682c5d5c-3cea-46bc-aebd-d95a651d8cc1", "title": "Four hikers drown after heavy rains in Iraq - Newspaper", "date": "2024-05-04 03:45", "url": "https://www.dawn.com/news/1831361/four-hikers-drown-after-heavy-rains-in-iraq", "message": "SULAIMANIYAH: Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday.\n“Four members of a hiking team drowned because of heavy rains and flooding in Awaspi village”, in Qaradah district, local official Rouf Kamal said.\nCivil defence spokesperson Aram Ali confirmed the toll, and said eight other hikers survived the incident south of Sulaimaniyah, the autonomous Kurdistan region’s second city.\nHe said a weather warning had been issued on Thursday, with hikers in particular urged to avoid mountainous areas.\nHeavier than usual rainfall has caused flooding in several parts of Iraq, especially the north, and some roads in Kurdistan region capital Arbil were blocked."}, {"id": "811a5017-bb57-49e4-868a-3cc0262f17d0", "title": "Global Coastal Hurricane Conditions Intensify Due to Warming Temperatures", "date": "2024-05-04 09:15", "url": "https://www.natureworldnews.com/articles/61561/20240504/global-coastal-hurricane-conditions-intensify-due-warming-temperatures.htm", "message": "The latest report raised concerns about the intensifying global hurricane conditions due to climate change and warming temperatures.\nUnderstanding hurricane impacts is essential for better weather prediction and forecasts, particularly for vulnerable communities.\nClimate change, which is increasing due to greenhouse gas emissions, can result in alarming concerns.\nResearchers, led by experts from the Department of Energy's Pacific Northwest National Laboratory, raised concerns that coastal hurricanes have intensified faster due to changing coastal conditions since 1979, particularly the nearshore hurricanes.\nThe study findings can help decision-makers, weather agencies, and forecasters better predict weather amidst the concerns of climate change and global warming."}, {"id": "4007ea73-6dcf-4663-8cf5-a31c3e42fd1a", "title": "Warning issued for parts of Utah ahead of  significant  late season winter storm", "date": "2024-05-04 17:00", "url": "https://www.ksl.com:443/article/51001703/warning-issued-for-parts-of-utah-ahead-of-significant-late-season-winter-storm--", "message": "The National Weather Service issued a winter storm warning for the Wasatch and western Uinta mountains ahead of a \"significant late season storm\" that could dump as much as 1 to 2 feet in parts of the region between Sunday and Tuesday.\nStorm timingThe storm is expected to follow a much smaller system that delivered a few inches of mountain snow Friday morning.\nA significant late season winter storm is expected to impact Utah from Sunday through Tuesday.\nSignificant mountain snow across northern Utah is expected through this time, with the heaviest period anticipated on Sunday.\nThe storm will bring a mix of rain and thunderstorms in the valleys, while snow will fall in the mountains."}, {"id": "e6d87812-63e6-4ae9-9120-4647fd2d2725", "title": "Houston area braces for flooding to worsen following storms", "date": "2024-05-04 10:00", "url": "https://www.houstonpublicmedia.org/npr/2024/05/04/1249155625/houston-flooding-storms/", "message": "Texas Parks & Wildlife Department game wardens use a boat to rescue residents from floodwaters in Liberty County, Texas, on Saturday.\nHOUSTON — High waters flooded neighborhoods around Houston on Saturday following heavy rains that have already resulted in crews rescuing more than 400 people from homes, rooftops and roads engulfed in murky water.\n\"It's going to keep rising this way,\" said Miguel Flores Jr., of the northeast Houston neighborhood of Kingwood.\nFloodwaters partially submerged cars and roads this week across parts of southeastern Texas, north of Houston, reaching the roofs of some homes.\nThe greater Houston area covers about 10,000 square miles (25,900 square kilometers) — a footprint slightly bigger than New Jersey."}, {"id": "984c6202-326f-4955-a497-ae83b53b996f", "title": "Houston braces for flooding to worsen in wake of storms", "date": "2024-05-04 09:00", "url": "https://www.durangoherald.com/articles/houston-braces-for-flooding-to-worsen-in-wake-of-storms/", "message": "One crew brought a family and three dogs aboard as rising waters surrounded their cars and home.\n\"It’s going to keep rising this way,” said Miguel Flores Jr., of the northeast Houston neighborhood of Kingwood.\nFloodwaters partially submerged cars and roads this week across parts of southeastern Texas, north of Houston, reaching the roofs of some homes.\nHOUSTON IS ONE OF THE MOST FLOOD-PRONE METRO AREAS IN THE USAuthorities in Houston have not reported any deaths or injuries.\nThe greater Houston area covers about 10,000 square miles (25,900 square kilometers) — a footprint slightly bigger than New Jersey."}, {"id": "4db9a4d7-63a3-4c17-b735-7c5caa1c7b15", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 17:00", "url": "https://kiss1045fm.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778."}, {"id": "c965698a-d4db-48f6-a01d-18bfb1f3d9b0", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 17:00", "url": "https://bigdog106.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778."}, {"id": "a6679126-238a-4f71-80da-a8b438c27262", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 20:15", "url": "https://klvi.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778."}, {"id": "b53f51d0-97b6-4952-a5bb-2a8abe80fcab", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 20:30", "url": "https://cool925.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778."}, {"id": "6728a3d6-354a-4ec5-b978-d9cce782b71d", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 20:30", "url": "https://kykr.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778."}, {"id": "1b381e5a-85b1-405a-a086-b1597df7f153", "title": "Hurricane season is near for the southeast", "date": "2024-05-04 19:00", "url": "https://accesswdun.com/article/2024/5/1240845/hurricane-season-is-beginning-in-the-southeast", "message": "The 2024 hurricane season could be one of the most active on record according to early outlooks.\nThe official start to hurricane season is June 1, while National Hurricane Preparedness Week is May 5-11.\nIt’s important to have everyone involved and prepared, so take time with your family to make a written storm plan.\nFor guidance on creating a storm plan, visit ready.gov/plan.\nIf you would like more information on how to prepare for severe weather you can visit jacksonemc.com/storm for more details."}, {"id": "111668f7-4dad-42d0-8f17-59da446a0f48", "title": "Flood - hit Kenya and Tanzania on alert as cyclone nears", "date": "2024-05-04 10:45", "url": "https://www.bssnews.net/international/187078", "message": "NAIROBI, May 4, 2024 (BSS/AFP) - Coastal regions of Kenya and Tanzania werebuffeted by heavy rains and high winds from a tropical cyclone on Saturday,adding to the chaos caused by deadly floods that have ravaged the region.\nThe Kenya Met Department said in a bulletin on Saturday that the effects ofTropical Cyclone Hidaya were already being felt offshore, with strong windsexceeding 40 knots and waves over two metres (over six feet).\n\"Current observations indicate that Tropical Cyclone Hidaya has made landfallon the coast of Tanzania.\nThe Climate Prediction and Applications Centre for East African trade blocIGAD had said Friday that Cyclone Hidaya will peak at gusts of 165 kilometres(100 miles) per hour when it makes landfall.\nUN refugee agency UNCHR said it was \"particularly concerned\" about thousandsof refugees displaced in Burundi, Kenya, Somalia and Tanzania."}, {"id": "0628de0d-04d7-4b41-95be-26d038ae55f6", "title": "Iraq rainstorm flooding kills hikers : officials", "date": "2024-05-04 07:00", "url": "https://www.bssnews.net/news/187050", "message": "SULAIMANIYAH, May 4, 2024 (BSS/AFP) - Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday, local officials told AFP.\n\"Four members of a hiking team drowned because of heavy rains and flooding in Awaspi village\" in Qaradah district, local official Rouf Kamal said.\nHe said a weather warning had been issued on Thursday, with hikers in particular urged to avoid mountainous areas.\nHeavier than usual rainfall has caused flooding in several parts of Iraq, especially the north, and some roads in Kurdistan region capital Arbil were blocked.\nIraq has suffered four consecutive years of drought, with irregular rainfall badly affecting water resources, forcing many farmers to abandon their land."}, {"id": "3ce0e963-4f51-4bd1-9dcb-9deba64f73ad", "title": "Death toll from rains in southern Brazil climbs to 56 | World", "date": "2024-05-05 09:30", "url": "https://en.ammonnews.net/article/72422", "message": "Home WorldDeath toll from rains in southern Brazil climbs to 56Ammon News - Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nState Governor Eduardo Leite told reporters on Saturday evening that Rio Grande do Sul would need a \"Marshall Plan\" to recover.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought."}, {"id": "4408d88d-0e81-4744-8e52-3bfd8a8de167", "title": "Trump trial : Former adviser Hope Hicks recounts fallout from Access Hollywood tape in 2016 campaign", "date": "2024-05-03 23:15", "url": "https://www.smh.com.au/world/north-america/longtime-trump-confidant-recounts-fear-in-2016-campaign-over-access-hollywood-tape-20240504-p5fovs.html", "message": "Hicks described being stunned and huddling with other Trump advisers after learning about the tape’s existence from the Washington Post reporter who broke the story.\nHicks forwarded the reporter’s request to campaign leadership with the recommendation to “deny, deny, deny”, she said.\nIt was recorded in 2005 but was not seen by the public until October 7, 2016, about a month before Election Day.\nNew York: Former US president Donald Trump’s 2016 campaign was seized with worry about the potential political damage from a tape that showed Trump bragging about grabbing women sexually without their permission, longtime Trump adviser Hope Hicks testified at his hush money trial.\nTrump has denied any wrongdoing in the case, which he has slammed as an effort to derail his campaign to reclaim the White House in November."}, {"id": "07c75ee8-b359-4736-9a2d-d17a316f3a0f", "title": "Trump trial : Former adviser Hope Hicks recounts fallout from Access Hollywood tape in 2016 campaign", "date": "2024-05-03 23:30", "url": "https://www.watoday.com.au/world/north-america/longtime-trump-confidant-recounts-fear-in-2016-campaign-over-access-hollywood-tape-20240504-p5fovs.html", "message": "Hicks described being stunned and huddling with other Trump advisers after learning about the tape’s existence from the Washington Post reporter who broke the story.\nHicks forwarded the reporter’s request to campaign leadership with the recommendation to “deny, deny, deny”, she said.\nIt was recorded in 2005 but was not seen by the public until October 7, 2016, about a month before Election Day.\nNew York: Former US president Donald Trump’s 2016 campaign was seized with worry about the potential political damage from a tape that showed Trump bragging about grabbing women sexually without their permission, longtime Trump adviser Hope Hicks testified at his hush money trial.\nTrump has denied any wrongdoing in the case, which he has slammed as an effort to derail his campaign to reclaim the White House in November."}, {"id": "39a1fe2c-a054-48dd-930b-6ef6213a6d3c", "title": "Brazil flooding death toll rises to 75 , with 80 , 000 evacuated", "date": "2024-05-05 19:45", "url": "https://news.sky.com/story/brazil-flooding-death-toll-rises-to-75-with-80000-evacuated-13130090", "message": "Mass flooding in Brazil has killed 75 people with more than 100 people still missing, local authorities said on Sunday.\nMore than 80,000 people have been forced to flee their homes since downpours began across Rio Grande do Sul in the south of the country on Monday.\nThe flooding has caused landslides, collapsed bridges, and seen roads transformed into rivers throughout the state.\nImage: Flooding in Sao Sebastiao do Cai, in Rio Grande do Sul.\nPresident Luiz Inacio Lula da Silva has travelled to Rio Grande do Sul to discuss rescue efforts with the governor."}, {"id": "569316aa-6da7-4fb5-b11b-bddf491b661d", "title": "Trump trial : Former adviser Hope Hicks recounts fallout from Access Hollywood tape in 2016 campaign", "date": "2024-05-04 00:45", "url": "https://www.brisbanetimes.com.au/world/north-america/longtime-trump-confidant-recounts-fear-in-2016-campaign-over-access-hollywood-tape-20240504-p5fovs.html", "message": "Hicks described being stunned and huddling with other Trump advisers after learning about the tape’s existence from the Washington Post reporter who broke the story.\nHicks forwarded the reporter’s request to campaign leadership with the recommendation to “deny, deny, deny”, she said.\nIt was recorded in 2005 but was not seen by the public until October 7, 2016, about a month before Election Day.\nNew York: Former US president Donald Trump’s 2016 campaign was seized with worry about the potential political damage from a tape that showed Trump bragging about grabbing women sexually without their permission, longtime Trump adviser Hope Hicks testified at his hush money trial.\nTrump has denied any wrongdoing in the case, which he has slammed as an effort to derail his campaign to reclaim the White House in November."}, {"id": "a3edc429-e31c-4ff1-a919-21e19dd6c2c2", "title": "Flood - hit Kenya and Tanzania on alert as cyclone nears", "date": "2024-05-04 07:45", "url": "https://www.gjsentinel.com/news/national/flood-hit-kenya-and-tanzania-on-alert-as-cyclone-nears/article_ea473eb8-81c0-5fff-9252-7405147cd92c.html", "message": "Tuesday NightSome clouds early will give way to generally clear conditions overnight.\nWinds NW at 15 to 25 mph, becoming ENE and decreasing to 5 to 10 mph.\nHigher wind gusts possible."}, {"id": "c4bfc51d-b55c-48c5-81d3-9e684f61ba84", "title": "178 people rescued amid Texas flood watch :  Were not out of the woods yet  ", "date": "2024-05-04 23:45", "url": "https://6abc.com/178-people-rescued-amid-texas-flood-watch-were-not-out-of-the-wo/14765833/", "message": "178 people rescued amid Texas flood watch: 'We're not out of the woods yet'A flood watch remains in effect for more than 11 million people in Texas and Oklahoma on Saturday as a number of flood warnings were issued as residents are urged not to drive on flooded roads.\nDuring a press conference on Saturday afternoon, Harris County, Texas, Judge Lina Hidalgo said 178 people and 122 pets have been rescued amid the flooding, and no deaths or injuries have been reported.\n\"We're not out of the woods yet and a level of uncertainty remains,\" Hidalgo said.\nThe heaviest rain has eased up in southeast Texas on Saturday morning, with the region set to experience a reprieve for the day.\nMeanwhile, powerful thunderstorms have popped up seemingly every day this week across parts of Texas, and that will be the case again on Saturday."}, {"id": "38aa3bca-a51e-4fcb-bfe3-3a10ec0425b6", "title": "Nearly 60 killed , over 69 , 000 displaced as heavy rains batter southern Brazil", "date": "2024-05-05 06:15", "url": "https://www.indiatoday.in/world/story/heavy-rains-batter-southern-brazil-many-killed-and-thousands-displaced-2535368-2024-05-05", "message": "Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought."}, {"id": "63a80c89-32df-481d-a6d9-9ac9965732a6", "title": "Heavy rains in southern Brazil kill at least 55", "date": "2024-05-05 01:45", "url": "https://www.rte.ie/news/world/2024/0505/1447449-brazil-floods-deaths/", "message": "Raging floods and mudslides have killed at least 57 people in southern Brazil and forced nearly 70,000 to flee their homes, the country's civil defence agency has said.\nThe toll did not include two people who died in an explosion at a flooded gas station in Porto Alegre, witnessed by an AFP journalist, where rescue crews were attempting to refuel.\nFast-rising water levels in the state of Rio Grande do Sul were straining dams and particularly threatening economically important Porto Alegre, a city of 1.4 million.\nThe Porto Alegre international airport suspended all flights on Friday for an undetermined period.\nAt least 300 municipalities have suffered storm damage in Rio Grande do Sul since Monday, according to local officials."}, {"id": "221ace00-b57b-4c97-9edd-07fbb245afad", "title": "Texas Authorities Rescue Over 200 People , 153 Pets , As Residents Brace For More Flooding", "date": "2024-05-05 19:45", "url": "https://dailycaller.com/2024/05/05/people-pets-rescued-floods-houston-texas-houston/", "message": "Authorities in southern Texas rescued at least 224 people and 153 pets from floods late Saturday following recent storms, even as residents batten down for more rain and flooding, according to reports.\nThe figures of the rescued stood at 178 people and 122 pets as of Friday, Hidalgo told reporters at a press conference late Saturday, as aired by KHOU 11.\n“There have been no confirmed deaths related to the incident, and I haven’t heard about any serious injuries,” Hidalgo told reporters.\nThe floodwaters cut off Rio Villa and its surrounding areas south of Lake Houston, Hidalgo told reporters.\nTexas, Kansas and Oklahoma, comprising the southern Great Plains, “regularly experience some of the most extreme weather on the planet,” according to the U.S."}, {"id": "d26b5e7a-b6d8-47ab-92a1-6502841222cc", "title": "Jefferson Parish leaders urge preparation for hurricane season ; permits required for roof work", "date": "2024-05-04 03:30", "url": "https://www.fox8live.com/2024/05/04/jefferson-parish-leaders-urge-preparation-hurricane-season-permits-required-roof-work/", "message": "NEW ORLEANS (WVUE) - Jefferson Parish leaders urge everyone to take the approaching hurricane season seriously and begin making plans now.\nAnd people getting new roofs in Jefferson need to follow new rules.\nParish President Cynthia Lee Sheng says hurricanes over the past several years have intensified quickly.\nUnlike when Hurricane Ida hit Jefferson Parish in 2021, the parish now has permit requirements for property owners who need a new roof any time of the year.\nDan Mills, CEO of the Homebuilders Association of Greater New Orleans joined Lee Sheng and others at the press conference."}]