[{"id": "163791b4-d34d-4000-9926-5f18961ecc67", "title": "Review of The Rumbling Earth The Story of Indian Earthquakes : Ground beneath India feet", "date": "2024-08-02 04:15", "url": "https://www.thehindu.com/books/books-reviews/earthquake-india-natural-disaster-building-collapse-lives-lost-casualty-environment/article68459616.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Rajendran and Kusala Rajendran in their book, The Rumbling Earth: The Story of Indian Earthquakes.\nSuch anecdotes pepper this accessible, concise history of earthquakes, which is exceptional in that it comes from an Indian vantage.\nOnly in the decade that men landed on the moon did earth scientists conclusively establish the theory explaining these links.\nPlate tectonics, as this theory is called, also explains the formation of continents, volcanic activity, tsunamis and the intensity and timing of earthquakes.\nThe Rumbling Earth: The Story of Indian Earthquakes; C.P."}, {"id": "2b2b2a04-afe9-4493-b196-92af57fc9834", "title": "Light earthquake : M4 . 8 quake has struck near the Loyalty Islands", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-8-quake-has-struck-near-the-loyalty-islands-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.8 (ml/mb) has occurred on Saturday, southeast of the Loyalty Islands (0 miles).\nId of earthquake: us6000nhe6.\nDate and time of earthquake in UTC/GMT: 20/07/24 / 2024-07-20 21:01:21 / July 20, 2024 @ 9:01 pm.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: southeast of the Loyalty Islands."}, {"id": "51929de9-cc76-406d-a874-7e5ef5d0d8ff", "title": "Light earthquake : M4 . 6 quake has struck near Port - Vila in Vanuatu", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-6-quake-has-struck-near-port-vila-in-vanuatu-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Saturday, 68 kilometers (42 miles) from Port-Vila in Vanuatu.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us6000nhdv.\nThe epicenter was 69 km (43 miles) from Port-Vila (c. 35 900 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 68 km WNW of Port-Vila, Vanuatu."}, {"id": "36ecf651-b91d-4cb0-91c5-0ce5f8be3e08", "title": "Light earthquake , 4 . 2 mag has occurred near Vilyuchinsk in Russia", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-has-occurred-near-vilyuchinsk-in-russia-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Saturday, 147 km SSE of Vilyuchinsk, Russia (91 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 23:22:37 / 11:22 pm (local time epicenter).\nExact location of earthquake, 159.103° East, 51.6784° North, depth 50.108 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 147 km SSE of Vilyuchinsk, Russia."}, {"id": "f64ca3cb-47e6-4697-920f-0c75c9107969", "title": "Light earthquake : M4 . 5 quake has struck near Yomitan in Japan", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-5-quake-has-struck-near-yomitan-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Thursday, 50 kilometers (31 miles) from Yomitan in Japan.\nExact location of earthquake, longitude 127.2416 East, latitude 26.4762 North, depth = 51.946 km.\nThe earthquake was roughly at a depth of 51.946 km (32 miles).\nCountry/countries that might be effected, Japan (c. 127 288 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 50 km W of Yomitan, Japan."}, {"id": "d0199e9d-acec-47eb-b0cc-25853ce8d8f5", "title": "Light earthquake , 4 . 6 mag was detected near Yalina in Mexico", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-was-detected-near-yalina-in-mexico/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported 4 kilometers (2 miles) from Yalina in Mexico on Thursday.\nThe earthquake occurred at a depth of 63.306 km (39 miles).\nId of earthquake: us6000nhf7.\nThe 4.6-magnitude earthquake has occurred at 19:19:01 / 7:19 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 4 km NW of Yalina, Mexico."}, {"id": "d67d694f-edb5-4cf4-be4c-b7447d81651b", "title": "Moderate earthquake , 5 . 1 mag was detected near Campana in Italy", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-1-mag-was-detected-near-campana-in-italy/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Thursday, 2 kilometers (1 miles) from Campana in Italy.\nThe epicenter was at a depth of 25.686 km (16 miles).\nNearby country/countries that might be effected, Italy (c. 60 340 000 pop).\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days three earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 2 km W of Campana, Italy."}, {"id": "358f2d58-ad44-438b-902c-ac42d20725ae", "title": "SHAREHOLDER ALERT : Pomerantz Law Firm Investigates Claims On Behalf of Investors of CenterPoint Energy , Inc . ", "date": "2024-08-02 00:00", "url": "https://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-investigates-claims-on-behalf-of-investors-of-centerpoint-energy-inc---cnp-302212818.html", "domain": "prnewswire.com", "domain_classification": "Unknown", "message": "NEW YORK, Aug. 1, 2024 /PRNewswire/ -- Pomerantz LLP is investigating claims on behalf of investors of CenterPoint Energy, Inc. (\"CenterPoint\" or the \"Company\") (NYSE: CNP).\nThe investigation concerns whether CenterPoint and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices.\nAt a press conference on July 14, 2024, Texas Governor Greg Abbott said that he was demanding an investigation into CenterPoint's response to Hurricane Beryl.\nFounded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions.\n7980SOURCE Pomerantz LLP"}, {"id": "b691e027-a534-4b71-b07e-36288a243f21", "title": "Toasty temps continue into Friday", "date": "2024-08-02 03:15", "url": "https://www.yahoo.com/news/toasty-temps-continue-friday-010713528.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Heat Advisories were in effect as “feels like” temps got above 100.\nA weak cool front arriving this weekend will tend to increase the rain chances, mainly in the afternoon and evening.\nThe front will drop temperatures to a more “seasonal” level of heat (highs around 90) by the end of the weekend.\nThe latest Drought Monitor shows big improvement across North Carolina; South Carolina, not so much.\nFor the latest news, weather, sports, and streaming video, head to Queen City News."}, {"id": "27d71e47-106e-4f65-a874-9ee26d46ac2d", "title": "Invest 97L forecast : Tropical disturbance tracking towards Gulf of Mexico , near Florida", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "wogx.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) said a tropical disturbance over Hispaniola, known as Invest 97L, is highly likely to develop further over the next seven days and possibly become a tropical depression as early as this weekend.\nAs it moves toward the Gulf of Mexico, it's expected to enter an environment more favorable for further development.\nThe NHC said it could become a tropical depression this weekend or early next week over the Gulf of Mexico, not far from Florida.\n\"Interests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system,\" the NHC said.\nThe tropical wave is getting more organized now and is starting to produce some big thunderstorms, as seen from satellite."}, {"id": "1f488f25-e9d9-4d90-8490-9a4455ce4a75", "title": "High chance of a tropical system targeting Florida this weekend", "date": "2024-08-02 02:45", "url": "https://www.theweathernetwork.com/en/news/weather/forecasts/high-chance-of-a-tropical-system-targeting-florida-this-weekend-debby", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "Forecast Centre The Weather Network A tropical disturbance has a high chance of developing into a storm by this weekend as it approaches FloridaFlorida is on alert as a tropical disturbance gathering steam over the northern Caribbean takes aim at the state this weekend.\nForecasters give the disturbance a 70 percent (high) chance of developing into a tropical depression or a tropical storm over the next couple of days.\nVacationers are advised to keep a close watch on forecasts over the coming days as this system draws closer to the Sunshine State.\nEnvironmental conditions around the disturbance will gradually become favourable for tropical development as it moves west-northwest toward Florida this weekend.\nMUST SEE: Tropical systems don’t need a name to trigger devastating floodsVery warm water temperatures, sufficient humidity, and calmer winds should allow the disturbance to develop into a tropical depression or tropical storm by the end of the weekend."}, {"id": "4717502a-6f0e-48d6-a919-e84aa4ae00fe", "title": "Louisiana at Risk ? Tropical Update Moves Storm Further Into Gulf", "date": "2024-08-02 00:00", "url": "https://973thedawg.com/ixp/36/p/forecast-shifts-potential-tropical-storm-westward-louisiana/", "domain": "973thedawg.com", "domain_classification": "Unknown", "message": "\"The latest models show it going into the eastern Gulf and then exploding there,\" AccuWeather Lead Long-Range Expert Paul Pastelok explained.\nBut whether it develops or not, we can expect a massive amount of rainfall coming from the storm.\nProper planning can make a significant difference in your ability to weather the storm and recover afterward.\nStart with a PlanFirst and foremost, create a family emergency plan.\nEmergency Kit EssentialsPrepare an emergency kit well in advance."}, {"id": "7580f106-1316-4fed-a4c1-018bdf7cf0bd", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province - Boston News , Weather , Sports", "date": "2024-08-02 04:15", "url": "https://whdh.com/news/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Hong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24."}, {"id": "40aecbc7-3fbc-49e6-8d58-4b90e45a1826", "title": "Condo set to be demolished after sitting untouched post Hurricane Ian", "date": "2024-08-02 04:15", "url": "https://winknews.com/2024/08/01/condo-set-to-be-demolished-after-sitting-untouched-post-hurricane-ian/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "A few weeks later, Hurricane ian changed everything.\nUntouched since Hurricane Ian: belongings still on the shelves, furniture smushed, and the remnants of someone’s entire life left behind.\nAnd then we’ll use our other machines to start to tear it down from there.”WINK News went up five of the seven floors.\nThe property is selling for $11 million, and the lot must be cleared before it’s sold.\nIt’s set for demolition in the next few weeks."}, {"id": "b97116db-e965-4381-a41f-e98ef78e6525", "title": "Invest 97L update : Gov . DeSantis declares state of emergency for 54 of Florida 67 counties", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/invest-97l-gov-desantis-declares-state-emergency-ahead-tropical-system", "domain": "wogx.com", "domain_classification": "Unknown", "message": "Ron DeSantis declared a state of emergency in dozens of counties that could be impacted.\nCalled Invest 97L, the storm system on Thursday afternoon was producing a large area of disorganized showers and thunderstorms over regions such as Hispaniola, Puerto Rico and the southeastern Bahamas.\n\"A tropical storm at least is now likely.\nFlorida has declared a state of emergency in anticipation of a tropical system this weekend, which could cause flooding.\n\"The water tables in the affected areas are already nearing peak capacity, and incoming heavy rainfall will cause significant river flooding that may last for several weeks.\""}, {"id": "ff3371dd-2116-4105-b237-5e0201ab0189", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-02 00:00", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/01/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Shawn Deng, Hassan Tayir and Duarte Mendonca, CNNHong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24."}, {"id": "fbef2e26-0e7d-4dd2-9ceb-26ccc1069e86", "title": "Tropical development likely in the Gulf this weekend", "date": "2024-08-02 03:30", "url": "https://mynews13.com:443/fl/orlando/weather/2024/08/02/tropical-development-likely-in-the-gulf-this-weekend", "domain": "mynews13.com", "domain_classification": "Unknown", "message": "Development of this system will be slow for the next couple of days, then development is likely in the Eastern Gulf of Mexico up toward the Florida Big Bend going into Monday.\nRight now, all the computer guidance shows the intensity as a tropical depression or tropical storm.\nIt is important to remember, with a disorganized tropical depression or tropical storm, the exact center doesn’t matter as much.\nMost of the wet weather will be east of the track, bringing heavy rain to the west coast of Florida.\nBe sure to check back often as development is likely pretty close to the west coast of Florida as early as Sunday morning."}, {"id": "40c840b7-4ed6-4d58-80a0-8baf329c024d", "title": "Latest Projected Path of Tropical System Shifts Closer to Texas", "date": "2024-08-02 00:15", "url": "https://kfox95.com/ixp/151/p/tropical-system-path-shifts-westward/", "domain": "kfox95.com", "domain_classification": "Unknown", "message": "Invest 97LThat's the name that the National Hurricane Center has given to a tropical system that continues to push west-northwestward across Puerto Rico.\nNational Hurricane Center National Hurricane Center loading...\nEvery weather model I have seen turns this tropical system northward into the U.S. before reaching New Orleans.\nNational Hurricane Center/Canva National Hurricane Center/Canva loading...\nNever Say NeverEven though there is a very low possibility of this tropical system adjusting its track to Texas, it would be a good idea to monitor the latest updates, just in case."}, {"id": "83175d36-b39f-476a-88dc-baa02059f93f", "title": "Parks still be cleared of Beryl damage", "date": "2024-08-02 01:45", "url": "https://thefacts.com/news/parks-still-be-cleared-of-beryl-damage/article_f3417440-aafc-54ab-b20a-78d117e62dbb.html", "domain": "thefacts.com", "domain_classification": "Unknown", "message": "Clute, TX (77531)TodayMainly clear.\nS winds at 10 to 20 mph, decreasing to less than 5 mph..TonightMainly clear.\nS winds at 10 to 20 mph, decreasing to less than 5 mph."}, {"id": "acf76599-85f6-492a-a567-85dd156ee826", "title": "Invest 97L tracker : Forecast path , spaghetti models , timeline , watches and warnings", "date": "2024-08-02 04:00", "url": "https://www.fox35orlando.com/news/invest-97l-tracker-forecast-path-spaghetti-models-timeline-watches-warnings", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Stream FOX 35 NewsThe National Hurricane Center has named a tropical disturbance in the Atlantic with a high chance of further development over the next seven days.\nInvest 97L could possibly become a tropical depression or storm as early as this weekend.\nIt's still too early to tell exactly where this tropical wave will end up, whether it will become Tropical Storm Debby, and whether it will stay in the Gulf of Mexico or if it will make landfall over Florida – and where.\nRELATED HEADLINES:Below are the latest models that track the storm's possible development, path, timeline, and impacts.\nInvest 97L forecast pathInvest 97L spaghetti modelsSTAY CONNECTED WITH FOX 35 ORLANDO:Invest 97L tropical potential, rainfall, impactsTimeline of when Invest 97L (future \"Debby\") arrives"}, {"id": "82fcfcb3-cc07-4afe-9ebb-4408e9a983e5", "title": "NY weather stays hot and stormy through weekend ; track radar here – NBC New York", "date": "2024-08-02 04:30", "url": "https://www.nbcnewyork.com/weather/extreme-heat-and-humidity-to-fuel-storms-through-the-weekend/5660198/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Nearly every day has brought at least a few showers or storms, and we are going to increase the storm activity into the weekend.\nSome of those storms could be strong to severe, capable of producing some locally heavy rainfall.\nExtreme heat in and around the tri-state area will contribute to the instability, too.\nFriday’s storms will be strongest from the New York City area to the west and south.\nThe main threats from Friday’s and the weekend’s storms will be isolated flooding where downpours are the heaviest and isolated damaging straight line wind gusts."}, {"id": "ff1469ad-e4a7-46af-9886-431a989fbad7", "title": "Hot temps , drought have meteorologists worried about the rest of Idaho wildfire season", "date": "2024-08-02 00:00", "url": "https://cdapress.com/news/2024/aug/01/hot-temps-drought-have-meteorologists-worried-about-the-rest-of-idahos-wildfire-season/", "domain": "cdapress.com", "domain_classification": "Unknown", "message": "The 2024 wildfire season is barely at the halfway mark, yet an especially dry, hot, and active summer has already resulted in 2024 wildfires burning over 4 million acres nationwide.\nThe Northwest wildfire season typically peaks in early July, according to the National Weather Service, and lasts until early September.\nIdaho’s 2024 wildfire season began in mid-July when smoke from two fires in northern California and eastern Oregon began blowing eastward.\nAs of Thursday morning, the Cow Valley fire was 99% contained and had burned 133,490 acres, according to federal wildfire tracker InciWeb.\nParker said this year’s wildfire season has started strongly because of drought and scorching temperatures."}, {"id": "176d270c-a571-4258-8a8c-6892841a281a", "title": "Congressman Eric Sorensen visits Fulton County to survey damage from July storms", "date": "2024-08-02 00:00", "url": "https://www.yahoo.com/news/congressman-eric-sorensen-visits-fulton-231444740.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FULTON COUNTY, Ill. (WMBD) — Congressmen Eric Sorensen (D-17) visited Fulton County Thursday evening to assess damage from the severe storms that swept through the area in mid-July.\nFulton County leaders, and Illinois Emergency Management Agency representatives sat down with the congressman to explain the damage and what problems they are facing.\nLeaders said in order to get help from the Federal Emergency Management Agency, the area needs to meet certain benchmarks.\nThere needs to be $23.6 in uninsured damages, which Fulton County is having trouble meeting.\nWe’re never going to reach that benchmark.”Sorensen plans to take what he learned from the Fulton County leaders to Washington D.C. and work to change the process to receive federal help to assess storm damage."}, {"id": "1193fbb6-eb04-4489-96a9-adb24ea31751", "title": "Disturbance to enter the Gulf this weekend ; intense heat locally", "date": "2024-08-02 00:15", "url": "https://www.fox10tv.com/2024/08/01/disturbance-enter-gulf-this-weekend-intense-heat-locally/", "domain": "fox10tv.com", "domain_classification": "Unknown", "message": "(WALA) - We continue to keep a close eye on a tropical wave which is currently located between Haiti and Cuba.\nBy Saturday, this system will be emerging off the northern coast of Cuba and will then have an opportunity to develop.\nThe upper level steering environment gets really weak in the northern Gulf.\nThe GFS and European models l, the major global models, suggest that the system will run up Florida’s West Coast along the Eastern side of the Gulf.\nThe upper level steering environment is weak so a stalling system is possible near the northern Gulf Coast by early next week."}, {"id": "8453ffbb-02f2-4536-9642-70669fe562b3", "title": "CenterPoint Energy withdraws request to increase electricity rates", "date": "2024-08-02 03:15", "url": "https://www.click2houston.com/news/local/2024/08/01/centerpoint-energy-withdraws-request-to-increase-electricity-rates/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "CenterPoint President and CEO Jason Wells addresses the Public Utilities Commission at a hearing in Austin on July 25, 2024.\nThe energy company proposed action plans for improved customer communication and restoring power quickly in future outages.\nCenterPoint Energy announced its plans to withdraw its 2024 rate case filing with the Public Utilities Commission of Texas (PUC).\nIn a statement released by the company, CenterPoint said the decision to withdraw the request was centered around wanting to focus on improving resiliency around Houston as the hurricane season continues.\nOur company’s collective focus for the remainder of this hurricane season will be on being ready: that is our mission."}, {"id": "05007b74-5910-41d3-a908-4b8333f8d383", "title": "Earthquake shakes southern Italy , no initial damage", "date": "2024-08-02 00:15", "url": "https://www.canberratimes.com.au/story/8716178/earthquake-shakes-southern-italy-no-initial-damage/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The epicentre of the quake was close to the town of Cosenza in the region of Calabria and occurred at 9.43pm on Thursday, Italy's National Institute of Geophysics and Vulcanology (INGV) said, giving a magnitude of 5.0."}, {"id": "e798d235-5e4b-4c7a-b815-99d8c9ba5712", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-02 00:00", "url": "https://www.mymotherlode.com/news/national/3400910/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "The roads with sections washed away were inaccessible by car, leaving some residents stranded.\nAcross the road, Toad Pond Road was crumbled and washed away in parts.\nThe flooding caused a tremendous amount of damage to state and town roads, he said.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "867effc1-e1aa-4ad8-ab80-7abe7146cb8d", "title": "The Jasper fire highlights the risks climate change poses to Canada world heritage sites", "date": "2024-08-02 01:45", "url": "http://www.econotimes.com/The-Jasper-fire-highlights-the-risks-climate-change-poses-to-Canadas-world-heritage-sites-1683097", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "The catastrophic Jasper fire highlights the vulnerability of Canada’s UNESCO World Heritage sites to the dual threat of climate change and extreme weather events, particularly wildfires.\nBecoming recognizedBecoming a UNESCO world heritage site is a recognition only a few places around the world have achieved.\nAccording to the World Heritage Convention — the world heritage site system’s founding document — world heritage sites possess:“priceless and irreplaceable assets, not only of each nation, but of humanity as a whole.\nMany of Canada’s world heritage sites are at an increasing risk of wildfire in a warming world.\nIt is essential that protecting Canada’s world heritage sites from fire be a key component of any national wildfire strategy."}]