[{"id": "fc7ce5b2-121c-4e2c-9826-4a08d1d966d3", "title": "Letter : Israel started it", "date": "2024-06-08 08:15", "url": "https://www.unionleader.com/opinion/letters_to_editor/letter-israel-started-it/article_75d4ce76-fcd3-11ee-938f-ab6955982ae9.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "7bf5c6cb-4dc5-4142-8fb7-d91137c6809e", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "c17dd98a-3ca3-4ce4-8437-4d2fe479e394", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://www.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "d1357493-f1b1-4dad-9ffb-26171f85fe36", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://us.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "2c66ed3e-4144-442d-9ec8-716213f2190d", "title": "The US Military Confidence in Smart Bombs May Have a Fatal Flaw", "date": "2024-06-08 11:00", "url": "https://www.businessinsider.com/us-military-confidence-smart-bombs-may-have-a-fatal-flaw-2024-6", "message": "Or, \"the incongruence between precision strike theory and the fervent enthusiasm of precision ideologues,\" he wrote in an essay for the Royal United Services Institute, a British think tank.\nRelated storiesBut most significantly, Fox questions the essence of US precision warfare: the belief that smart bombs spare a need for boots on the ground.\n\"If precision strikes are often accurate, but ineffective, and additional strikes or land operations are required to create the effect intended with the initial precision strikes, then precision strategies do not decrease civilian casualties and collateral damage in conflict zones.\"\n\"The inconvenient truth about war is that it still requires a land force to defeat a land force.\nPrecision warfare, which isn't really a thing, augments a land force in defeating another land force."}, {"id": "0a61242a-4c9a-41e4-af44-294d684bee52", "title": "Russia blames US for deaths on its soil - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838528/russia-blames-us-for-deaths-on-its-soil", "message": "ST PETERSBURG: Russia accused Ukraine on Friday of ‘using US-supplied rockets’ to kill women and children, in a region of southern Russia and added that “Washington is to blame”.\nThis is the first time Russia has stated that it holds the United States responsible for civilian deaths on its own soil.\nThis accusation follows warnings by President Vladimir Putin that the West is playing with fire and risking a global conflict by letting Ukraine fire Western-supplied weaponry into Russia.\nShe alleged this was ‘shortly’ after the United States ‘agreed for the first time’ to let Ukraine fire US-supplied weapons into Russia.\nThe eastern Lugansk border region is almost entirely under the control of Moscow, which has claimed its full annexation."}, {"id": "df8bec78-6c7e-43d1-af3d-ab8955a4a0a4", "title": "Media : Explosions reported across occupied Crimea", "date": "2024-06-08 02:45", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-012654335.html", "message": "Explosions were heard across Sevastopol in occupied Crimea overnight on June 8, the Telegram channel Crimean Wind reported.\nAt around 1:39 a.m. local time, residents of Balaklava, a settlement in the city of Sevastopol, reportedly heard explosions.\nThe Russian proxy leader in Sevastopol in occupied Crimea, Mikhail Razvozhayev, later claimed that the \"loud sounds\" residents heard in the Striletska Bay were the Russian forces destroying an \"unmanned boat.\"\nThe Crimean Wind alleged that residents of Sevastopol had their windows blown out by the explosion in the coastal area.\nEarlier this week, Ukraine's military carried out a naval strike in occupied Crimea overnight on June 6, destroying a Project 498 \"Saturn\" raiding tugboat."}, {"id": "ae3a3906-33ee-4cc8-bb73-d11417f17cba", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 06:00", "url": "https://www.prokerala.com/news/articles/a1537810.html", "message": "Moscow, June 8 : At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson, region's Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "255a498c-40a4-46cc-b73b-6299acbab202", "title": "Kremlin Claims Kyiv Strikes on Russian - Occupied Ukraine Kill 26", "date": "2024-06-08 09:15", "url": "https://www.kyivpost.com/post/33964", "message": "Ukrainian strikes on parts of the Russian-held Luhansk and Kherson regions killed 26 people and injured dozens more on Friday, occupation authorities said.\nBoth Ukrainian regions were among four Russia claimed to have annexed in September 2022 despite not fully controlling any of them following the full-scale invasion launched that February.\nAdvertisementSaldo condemned the “vile murder of civilians” made possible by Western arms deliveries to Ukraine.\nOver the last week, Russian troops “improved their positions along the front line and liberated the settlement of Paraskoviivka,” the ministry said.\nAdvertisementIn the central city of Nikopol in the Dnipropetrovsk region, Russian shelling killed a 71-year-old woman, the regional authorities said."}, {"id": "72ecb13e-2ca3-47bd-bc87-4072862820fe", "title": "Two months after the strike on World Central Kitchen workers , U . S . still reviewing Israel investigation", "date": "2024-06-08 00:45", "url": "https://www.yahoo.com/news/two-months-strike-world-central-000024719.html", "message": "A man displays blood-stained British, Polish, and Australian passports after an Israeli airstrike in Deir al-Balah, Gaza, on April 1, 2024, killed seven World Central Kitchen workers.\nIn the aftermath of the strike on WCK aid workers, the group called for an independent inquiry into the deadly attack.\nAdministration officials have been quick to point out that Israel made some adjustments to its rules of operation based on the findings from its investigation into the WCK strike.\nThe pier was reattached to the beach in Gaza on Friday, according to U.S. Central Command, and the Biden administration expects aid deliveries to resume in the coming days.\nThe goal will be to move 500,000 pounds over the beach daily initially and then grow that over time, administration officials have said."}, {"id": "5f925e4a-fc2a-41cf-95c7-89a9f9494cb2", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 12:00", "url": "https://keyt.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "6f655a95-8e9d-4418-96b6-19f13aa34dcb", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://abc17news.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "b4a0338e-b48f-4c08-83ed-3bb8d76fe796", "title": "Israel bombs another UN - run school in Gaza , a day after strike on school killed 33", "date": "2024-06-08 09:15", "url": "https://www.independent.ie/world-news/middle-east/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/a1631676334.html", "message": "Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza StripAn Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza's center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nThe Associated Press could not verify the claims."}, {"id": "403a9fe3-f06e-4c87-9c71-691e61c77e80", "title": "Israeli Forces Batter Central , South Gaza as Tanks Advance in Rafah", "date": "2024-06-08 11:15", "url": "https://en.tempo.co/read/1877483/israeli-forces-batter-central-south-gaza-as-tanks-advance-in-rafah", "message": "Gaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\n\"I think the occupation forces are trying to reach the beach area of Rafah.\nIn the larger city of Khan Younis just to the north of Rafah, an Israeli airstrike on the house killed eight people and wounded several, including children, medics said.\nIn north Gaza, three Palestinians were killed in an Israeli airstrike on a Gaza City school building that was sheltering displaced families, rescue workers said."}, {"id": "bcfbb49c-e577-4563-b277-00053fa2ad9a", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 10:15", "url": "https://economictimes.indiatimes.com/news/defence/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say/articleshow/110818261.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelUkraine - Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left at least 27 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.A Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nPasechnik also said 60 people were wounded in the attack.Ukraine did not comment on either assault.Meanwhile, drone attacks between Russia and Ukraine persisted.Ukraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defense Ministry said Saturday.\nSergei Menyailo reported three downed drones over the region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "0f5768b4-6739-4d82-aa4f-f7ff4fcefaa3", "title": "Blinken to head back to Middle East on Sunday", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240607-voa02.htm", "message": "Blinken to head back to Middle East on SundayBy VOA News June 07, 2024U.S. Secretary of State Antony Blinken is heading back to the Middle East on Sunday in hopes of persuading Israel and Hamas militants to accept a cease-fire agreement designed to halt the fighting, release hostages and get more humanitarian aid into the war-torn Gaza Strip.\nIn northern Gaza, Palestinian emergency workers said three people were killed when an Israeli airstrike hit a U.N.-run school.\nThe Israeli military said it was targeting Hamas gunmen operating from inside the school.\nIsrael used the same explanation Thursday after an airstrike on a school operated by the U.N. relief agency UNRWA in the central Gaza Nuseirat refugee camp.\nHamas is holding about 120 of the hostages in Gaza, although the Israeli military says at least 37 of them are dead."}, {"id": "3344bf04-3b2a-494e-a906-bb7ac573e783", "title": "Russia says 22 civilians killed by Ukrainian shelling", "date": "2024-06-08 10:15", "url": "http://global.chinadaily.com.cn/a/202406/08/WS6663f47aa31082fc043cb991.html", "message": "Xinhua | Updated: 2024-06-08 14:04Photo taken on July 24, 2022 shows the view of a harbor in the Kherson region.\n[Photo/Xinhua]MOSCOW -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "d7ad425d-636f-442b-958e-78bb5f05fd34", "title": "Israel defends targeting UNRWA school after dozens killed", "date": "2024-06-08 00:00", "url": "https://www.thejc.com/news/israel/israel-defends-targeting-unrwa-school-after-dozens-killed-mxsxcryr", "message": "Dozens of civilians have reportedly been killed after Israel launched an air strike against a school that it claimed terrorists were hiding in.\nThe strike hit al-Sardi school, which is run by the Unrwa Palestinian refugee agency, in the early hours of Thursday morning.\nUS State Department spokesperson Matthew Miller said he had seen reports that 14 children had been killed in the blast.\nIn a statement, the IDF said they had carried out a \"precise strike on a Hamas compound embedded inside\" the school.\nThe ones there are children, playing.”Sam Rose, the director of planning for Unrwa, told The Guardian he was not surprised to see an IDF strike cause civilian causalities."}, {"id": "2ca14e95-1542-464a-9f85-e173eeb29c78", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead Moscow - backed officials say", "date": "2024-06-08 12:45", "url": "https://www.theweek.in/wire-updates/international/2024/06/08/fgn29-russia-ukraine-ld-war.html", "message": "Kyiv, Jun 8 (AP) Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defence Ministry said Saturday.\nTwenty-five drones were reportedly destroyed over Russia's southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "b7a71b92-5340-4186-826c-d08c07b19814", "title": "Israeli forces batter Gaza as tanks advance in Rafah - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838536/israeli-forces-batter-gaza-as-tanks-advance-in-rafah", "message": "CAIRO: With a renewed ceasefire push stalled, Israel bombarded central and southern areas of Gaza Strip again on Friday, killing 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nGaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said 15 people died overnight in Israeli bombardment.\nIn northern Gaza, three Palestinians were killed in an Israeli air strike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nHamas said on Friday its fighters shelled militants in the central city of Deir al-Balah shelled a house where Israeli troops were barricaded, killing some and wounding others."}, {"id": "f48d47c8-7bcf-4abf-8f1f-af3fb506bc85", "title": "Russia - Installed Governor Claims 22 Killed In  Double Tap  Attack In Kherson Region", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-rferl06.htm", "message": "Russia-Installed Governor Claims 22 Killed In 'Double Tap' Attack In Kherson RegionBy RFE/RL's Russian Service and RFE/RL's Ukrainian Service June 07, 2024The Russia-installed governor of the Kherson region in southern Ukraine said 22 people were killed and 15 were injured in the town of Sadove in shelling by Ukrainian forces.\nSaldo said a shop packed with customers and employees was hit in Sadove, a town south of the city of Kherson.\nHe said Ukrainian forces had \"deliberately made a repeat strike to create greater numbers of casualties.\"\nThe same so-called \"double tap\" tactic has been used by Russian forces against Ukraine, including in April in Kharkiv, killing three rescue workers who responded to the first attack.\nIts military said earlier that its forces shot down all five missiles and 48 out of 53 drones over nine regions during Russia's overnight attack."}, {"id": "b2760413-c349-4366-aab3-e59896d88726", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 12:15", "url": "https://www.kob.com/news/us-and-world-news/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nOn Saturday morning, officials said air defenses for the first time shot down Ukrainian drones over the North Ossetia region in the North Caucasus, some 900 km (560 miles) east of the front line in Ukraine’s partially occupied Zaporizhzhia region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "3e276758-df77-4af4-87bf-58aee8b58754", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 13:45", "url": "https://isp.netscape.com/news/world/story/0001/20240608/aa5de3171da1126d0ae2a0dd59d419dc", "message": "Attacks in Russian-occupied Ukrainian regions leave 28 dead, Moscow-backed officials sayKYIV, Ukraine (AP) — Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nOn Saturday morning, officials said air defenses for the first time shot down Ukrainian drones over the North Ossetia region in the North Caucasus, some 900 km (560 miles) east of the front line in Ukraine’s partially occupied Zaporizhzhia region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "9fed5813-246a-46f2-a01c-200f030bf859", "title": "Strategic Calculations Behind Russia Kazan Nuclear Submarine Upcoming Visit to Cuba", "date": "2024-06-08 12:00", "url": "https://theaviationist.com/2024/06/08/strategic-calculations-behind-russias-kazan-nuclear-submarines-upcoming-visit-to-cuba/", "message": "Heralding days of the tense Cold War, particularly the Cuban Missile Crisis, a Russian nuclear-powered submarine of the Yasen-M class, the Kazan, will visit Havana, Cuba has announced.\nWhile the submarine itself would not be armed with nuclear weapons, the strategic message Moscow appears to be sending is loaded.\n“None of the vessels is carrying nuclear weapons, so their stopover in our country does not represent a threat to the region,” it added.\nWhile the Akula is optimized for a ‘hunter-killer’ role, the Yasen-class concept is more of a ‘nuclear guided missile submarine (or SSGN).\nIntelligence gathering missionA Russian nuclear submarine approaching the region will probably attract the attention of several ISR (Intelligence Surveillance Reconnaissance) assets."}, {"id": "dfa3334b-a52b-40f2-8b10-e7e5a15f3e33", "title": "UN set to add Israel , Hamas to  blacklist  over violations against children", "date": "2024-06-08 03:00", "url": "https://www.yahoo.com/news/un-set-add-israel-hamas-001446039.html", "message": "The United Nations secretary-general is set to describe Israel and Hamas as waging a war that violates children’s rights, moving the country to the body’s “blacklist” in an upcoming report to the Security Council.\nHamas and Palestinian Islamic Jihad will also be listed, according to a report by the Associated Press.\nIsrael has faced strong international criticism over the number of civilian deaths in the eight-month war with Hamas.\nMeanwhile, Israel claimed the attack was a “precise strike on a Hamas compound” inside the school.\nThe UN’s decision to include Israel in this report comes before Netanyahu is set to address a joint session of Congress on July 24th."}, {"id": "7afc1131-09ec-41db-8902-0e6ea1cade9d", "title": "Danish prime minister attacked in Copenhagen", "date": "2024-06-08 00:15", "url": "https://www.voanews.com/a/danish-prime-minister-attacked-in-copenhagen-/7647539.html", "message": "Danish Prime Minister Mette Frederiksen was struck on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident,\" but it did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nOn May 15, Slovak Prime Minister Robert Fico was shot four times at close range as he greeted supporters after a government meeting in the central town of Handlova.\n\"I must say that it shakes all of us who are close to her,\" Danish Environment Minister Magnus Heunicke said in a post to social media."}, {"id": "77f52b33-2386-411a-bf28-595081d25b3c", "title": "  Despicable act : European leaders condemn assault of Danish PM", "date": "2024-06-08 13:00", "url": "https://www.prokerala.com/news/articles/a1537945.html", "message": "Copenhagen, June 8 : European Commission President Ursula von der Leyen on Saturday called the assault on Danish Prime Minister Mette Frederiksen a \"despicable act which goes against everything we believe and fight for in Europe\".\nThe Danish Prime Minister Mette Frederiksen was assaulted in a central Copenhagen square following which she has been hospitalised.\nWitnesses told Danish media that the prime minister was able to walk away from the scene.\nThe incident comes as the EU's 27 countries elect hundreds of members of the European Parliament during four days of voting that began on Thursday.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt."}, {"id": "37762db0-899c-4cf3-903e-5494f8a069e3", "title": "Dnipropetrovsk oblast rocked by Russian artillery and drone strikes", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/dnipropetrovsk-oblast-rocked-russian-artillery-080500586.html", "message": "The Russian army targeted the Nikopol district of Dnipropetrovsk Oblast with drones and artillery during an overnight attack, killing one man in the shelling, regional governor Serhiy Lysak reported on Telegram on June 8.\nNot only did the shelling claim a life, but it also left a swath of destruction.\nSerhiy Lysak/TelegramSerhiy Lysak/TelegramSerhiy Lysak/TelegramLysak further reported that the shelling disrupted power lines, and authorities are still assessing the full extent of the damage.\nRead also: Four passengers injured after Russians target bus of Ukrainian civilians in NikopolWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine"}, {"id": "e8f6663a-5bc2-4126-b629-f0677fdd6158", "title": "Israel pounds Gaza refugee camp as war enters 9th month", "date": "2024-06-08 00:30", "url": "https://www.omanobserver.om/article/1154798/world/region/israel-pounds-gaza-refugee-camp-as-war-enters-9th-month", "message": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl Aqsa Martyrs hospital in Deir al Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nThe Israeli military said its fighter jets killed nine \"fighters\" in three classrooms where about 30 militants from Hamas and IJ were hiding.\nWitnesses also reported Israeli strikes east of Deir al Balah and intensive fire from army vehicles near the Bureij camp, where a blaze was raging.\nThe Israeli military said it \"eliminated dozens of fighters\" in eastern Bureij and Deir al Balah."}, {"id": "af9131fe-5121-44b2-8174-2223a782065c", "title": "Puntland Security Force captures two ISIS fighters surviving US airstrike", "date": "2024-06-08 10:15", "url": "https://www.hiiraanweyn.net/2024/06/08/puntland-security-force-captures-two-isis-fighters-surviving-us-airstrike/", "message": "Sabti 8 June 2024 {HMC} The Puntland Security Force {PSF} has apprehended two ISIS foreign nationals who they said survived last week’s US airstrike in northeastern Somalia.\nAccording to a statement from the PSF on Saturday, the men identified as Imraan Mohamed Alawi and Mabruuk Nassor Saidi are from Tanzania.\nThe security forces arrested the men 30 km away from the area where the bombing took place, following a tip-off and subsequent pursuit by the PSF.\nadvertisementsA joint airstrike carried out by Somali and U.S. forces killed three Islamic State {IS}-Somalia fighters in a remote area near Dhaardaar, about 81 km southeast of Bosaso, last week.\nThe so-called IS wing in Somalia has its main base in the Puntland region, northeastern Somalia, and has occasionally clashed with Puntland forces and al-Shabab militants."}, {"id": "2a69049f-73c0-4087-9dfb-dde809649894", "title": "European leaders condemn assault on Danish PM in Copenhagen square", "date": "2024-06-08 10:30", "url": "https://www.prokerala.com/news/articles/a1537877.html", "message": "Copenhagen, June 8 : Leaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nThe incident comes as the EU's 27 countries elect hundreds of members of the European Parliament during four days of voting that began on Thursday.\nLast month, the EU was stunned by the shooting of Slovakia's Prime Minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the President of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "1defaf74-68fa-4a39-a452-ab73140db2c7", "title": "LIVE UPDATES : UNRWA Facilities Face Unprecedented Attacks Amid Gaza War", "date": "2024-06-08 07:45", "url": "https://menafn.com/1108308988/LIVE-UPDATES-UNRWA-Facilities-Face-Unprecedented-Attacks-Amid-Gaza-War", "message": "(MENAFN- The Peninsula) The PeninsulaDoha, Qatar: facilities have faced unprecedented attacks, with a recent strike on a school killing 35 to 45 people.\nThe International Rescue Committee warns that famine is likely underway in northern Gaza, stressing the need for unimpeded humanitarian access.\nMeanwhile, New Zealand commits $1 million to UNRWA after UN assurances of neutrality.\nGaza's reports a rising death toll of 36,731 since October 7, with 77 killed in the past 24 hours.\n(Photo by Bashar TALEB / AFP)At least 36,731 people have been killed and 83,530 wounded in Israeli military attacks on Gaza since October 7, the enclave's Health Ministry says."}, {"id": "9f1201e0-baa5-454d-91bd-1ccc14c80812", "title": "European leaders condemn assault of Danish PM in Copenhagen square", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/european-leaders-condemn-assault-danish-075256759.html", "message": "Danish Prime Minister Mette Frederiksen speaks at a press conference with Chancellor Scholz after their meeting.\nMichele Tantussi/Getty Images Europe/Pool/dpaLeaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the president of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "e3394414-6be5-46ba-ba67-2a30773e96f2", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:30", "url": "https://www.theguardian.com/world/article/2024/jun/08/under-a-drone-filled-sky-ukraine-tries-to-retake-a-town-one-house-at-a-time", "message": "They retreated six months later, going back up the road to the Russian city of Belgorod.\n(57th Separate Motorised Infantry Brigade/Ukraine army) Drone footage shows Russian troops in the town of Vovchansk.\n(57th Separate Motorised Infantry Brigade/Ukraine army)A brutal battle has raged ever since.\n(57th Separate Motorised Infantry Brigade/Ukraine army) The town of Vovchansk has been reduced to rubble after months of heavy fighting.\n(57th Separate Motorised Infantry Brigade/Ukraine army)Villagers living in the nearby countryside have also escaped."}, {"id": "ec20ed8b-8446-4728-9229-ac923f4e5ea3", "title": "Danish Prime Minister left  shaken  and with whiplash after street attack", "date": "2024-06-08 12:15", "url": "https://www.thejournal.ie/prime-minister-of-denmark-attack-6402050-Jun2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "e205cef2-1cb9-438d-97b7-b4f34adccde5", "title": "European leaders condemn assault of Danish PM in Copenhagen square", "date": "2024-06-08 13:00", "url": "https://www.prokerala.com/news/articles/a1537941.html", "message": "Copenhagen, June 8 : Leaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nWitnesses told Danish media that the prime minister was able to walk away from the scene.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the president of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "585d3c53-0e0f-4df2-8ad0-de6d99ff46c3", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:45", "url": "https://www.aol.co.uk/news/under-drone-filled-sky-ukraine-120815524.html", "message": "Photograph: Jędrzej Nowicki/The ObserverThe two Russian soldiers jogged across an apocalyptic landscape.\nThey retreated six months later, going back up the road to the Russian city of Belgorod.\nStreet battles in Vovchansk were so intense that only experienced Ukrainian soldiers were deployed there, rotating among themselves in shifts.\nHe said Russian soldiers kidnapped an unknown number of civilians, using them as a human shields and taking them across the border.\nSoon afterwards, Russian soldiers stormed the building and set up on observation point in a medical department with a tower across the road."}, {"id": "33cc7a8b-e071-4114-9655-be54abee6d39", "title": "Israel  disgusted  after being placed on UN list of countries failing to protect children", "date": "2024-06-08 05:00", "url": "https://www.sbs.com.au/news/article/israel-disgusted-after-being-placed-on-un-list-of-countries-failing-to-protect-children/msudim6nz", "message": "Key Points Israel will be included on the UN's annual list of countries it deems to be failing to protect children in war.\nThe upcoming inclusion of Israel on a UN list of countries and armed forces determined to be failing to protect children in war prompted a furious Israeli response Friday.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\nAn Israeli strike on a Gaza school killed as many as 40 people, medics said.\nMore than 36,700 people have been killed in Gaza since 7 October, according to the health ministry in Gaza."}, {"id": "bf79bc4d-a695-4d76-a820-9132b400eab9", "title": "Slovakia and Italy to vote today as bumper EU elections continue across the continent", "date": "2024-06-08 09:00", "url": "https://www.thejournal.ie/slovakia-elections-6401933-Jun2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "bd455c39-3f19-4177-a947-c117dba4efda", "title": "Disinformation Campaign Exposed : Alleged Houthi Strike on USS Eisenhower Found Baseless", "date": "2024-06-08 05:00", "url": "https://trendydigests.com/2024/06/08/disinformation-campaign-exposed-alleged-houthi-strike-on-uss-eisenhower-found-baseless/", "message": "A cursory glance at social media over the past week might have you thinking the USS Eisenhower was damaged by a missile fired by the Houthis.\nThese false claims involved a video, uploaded to the social media platform X, which gained traction among users.\nThe footage, allegedly showing the Eisenhower on fire, has been identified as taken from a popular video game.\nMisinformation of this nature is not simply a matter of erroneous reporting; it might also forms a part of a disinformation campaign carefully orchestrated disinformation campaign to confuse those on social media.\nIt’s essential to note the Houthi military spokesperson Yahya Saree’s repeated allegations of successful strikes against the Eisenhower and accompanying warships."}, {"id": "6b4e5b8a-b485-47a0-88c8-3555266b8d2e", "title": "Russia Advanced Yasen - M Class Nuclear Submarine Is Headed For Cuba", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/russias-advanced-yasen-m-class-001237490.html", "message": "The Russian Navy frigate Admiral Gorshkov arrives in the port of Havana during a previous visit to Cuba on June 24, 2019.\nThe first-in-class Russian Navy Project 22350 frigate Admiral Gorshkov was sailing in the Caribbean in June 2019.\nLast July, for example, the Russian Navy sent the training class ship Perekop into Havana for a four-day visit.\nMinistry of Defense of RussiaSignificant, too, is the fact that the Kazan and the Admiral Gorshkov are notably modern and capable assets.\nEarlier this week, a senior U.S. official suggested that the current Russian Navy deployment might also include a port call in Venezuela."}, {"id": "5a73719f-c27d-4cd0-9884-f30f3d73d91f", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 07:45", "url": "https://www.mangalorean.com/22-civilians-killed-by-ukrainian-shelling-russia/", "message": "22 civilians killed by Ukrainian shelling: RussiaMoscow: At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson, region’s Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "1c2d60c6-fb62-49ec-8a73-dfab7887fe14", "title": "Reports Surface Of New Version Of Russian Kh - 101 Cruise Missile With Cluster Warhead", "date": "2024-06-08 14:00", "url": "https://theaviationist.com/2024/06/08/kh-101-cluster-warhead/", "message": "Pictures and media reports from Ukraine claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nRussia has reportedly introduced another modification to the Kh-101 ALCM (X-101 Air-Launched Cruise Missile), after variants releasing decoys to divert SAM (Surface-to-Air Missiles) and dual/tandem warheads.\nPictures and media reports claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nMainstay Russian Air-Launched Cruise MissileKh-101 is a strategic cruise missile that is designed with LO (Low Observable features).\nAssuming it is the Kh-101 missile and the claim about the cluster warhead is true, it is likely the Russians might have to compromise on range to accommodate it."}, {"id": "b083f3d9-ab09-4578-90c5-0eba76824b6d", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.k101fm.net/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "a54fdc58-c5df-4030-ad1b-6812810ca7a8", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:00", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "76f7188a-b488-4309-9c7f-fe7f8acde5f2", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "9126ae93-b5ce-4fd5-96d2-fb97ef3f31ba", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "eb9e4d4d-5513-486a-bc25-9e98c266b709", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:15", "url": "https://www.kdks.fm/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "deb17112-839b-46b0-9cf8-7437e42a7fbf", "title": "Funeral , procession honors 3 - year - old North Olmsted boy murdered at Giant Eagle", "date": "2024-06-08 13:00", "url": "https://www.cleveland19.com/2024/06/08/funeral-procession-honors-3-year-old-north-olmsted-boy-murdered-giant-eagle/", "message": "NORTH OLMSTED, Ohio (WOIO) - The funeral for the slain three-year-old North Olmsted boy is set for Saturday at St. Charles Borromeo Church in Parma.\nSunset Memorial Park ; 6625 Columbia Road North Olmsted 4407019 News will be streaming outside of the church and the procession.\nMemorial for Julian Wood at the North Olmsted Giant Eagle (Bingel, Julia | (Source: WOIO))Margot was stabbed while trying to pull Julian from the grocery cart, said O’Malley.\nPREVIOUS COVERAGE: New details about woman charged in fatal stabbing outside North Olmsted Giant EagleEllis was indicted on multiple charges including aggravated murder.\nPREVIOUS COVERAGE: North Olmsted tragedy: Share message of support with the Wood familyNorth Olmsted police previously said the attack appears to be random."}, {"id": "00f8fe0f-bee1-4717-9252-85256aa720a8", "title": "Live updates : Israel - Hamas war , Israeli hostages rescued", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-06-08-24/", "message": "Smoke rises following an Israeli airstrike in Rafah, Gaza, on May 30.\nAbdel Kareem Hana/APUnited Nations Secretary-General António Guterres has added Israel’s military to a global list of offenders who have committed violations against children, UN spokesperson Stéphane Dujarric said Friday.\nIsrael’s ambassador to the UN, Gilad Erdan, made a video recording of the call and leaked part of that on social media.\nThe official report will be published June 18, and discussed at a debate in the Security Council on June 26.\nAsked about ramifications for Israel, the UN spokesperson said it will be up to the council’s members to decide any action."}, {"id": "d7c7cad8-be0c-4539-8534-318634f9924a", "title": "Israel Bombs Another UN - Run School In Gaza , A Day After Strike On School Killed 33 – 710am KURV", "date": "2024-06-08 01:00", "url": "https://www.kurv.com/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/", "message": "(AP)–An Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza’s center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nIsrael on Friday released the names of 17 militants it said were killed in Thursday’s strike.\nInternational pressure is mounting on Israel to limit civilian bloodshed in its war in Gaza, which completed its eighth month on Friday.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "fc2d5899-059b-4c9e-8fff-6249d76177e9", "title": "Russia says 22 civilians killed by Ukrainian shelling - Xinhua", "date": "2024-06-08 04:45", "url": "https://english.news.cn/20240608/da664d6e03b44da7a62b6e0681672c8a/c.html", "message": "MOSCOW, June 8 (Xinhua) -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,\" Saldo added."}, {"id": "4e5872da-dcbf-4482-910b-d432dff07811", "title": "Russia says 22 civilians killed by Ukrainian shelling | Central India Premier English Daily", "date": "2024-06-08 06:30", "url": "https://www.centralchronicle.com/russia-says-22-civilians-killed-by-ukrainian-shelling/", "message": "Moscow, June 8 (UNI) Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region twice on Friday, killing 22 civilians, the region’s Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,” Saldo added."}, {"id": "63cb67ee-38d7-4e01-b8ec-327c921da353", "title": "Danish Prime Minister Frederiksen assaulted in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.euronews.com/my-europe/2024/06/07/danish-prime-minister-frederiksen-assaulted-in-copenhagen", "message": "ADVERTISEMENTDanish Prime Minister Mette Frederiksen has been assaulted by an unknown man in Kultorvet, a central square in Copenhagen, Danish media has reported.\nAccording to her office Frederiksen suffered a light whiplash injury in the assault.\nFrench Prime Minister Emmanuel Macron posted that \"the attack on the Danish Prime Minister is unacceptable.\"\nLast month, Slovakia's Prime Minister survived an assassination attempt in the central Slovakian town of Handlová.\nSweden's Foreign Minister, Tobias Billström reacted to Friday's attack against Frederiksen on X saying that such an “absolutely terrible” attack should be strongly condemned."}, {"id": "88668480-7e91-4f52-8d56-73951124b0cf", "title": "EU voting passes halfway mark with Slovakia , Italy joining in", "date": "2024-06-08 13:15", "url": "https://www.guampdn.com/news/national/eu-voting-passes-halfway-mark-with-slovakia-italy-joining-in/article_3b8a409e-2b47-55e4-aa6a-159aa9174a79.html", "message": "Four days of voting to choose a new European Parliament passed the halfway mark Saturday with Slovakia -- shaken by an assassination attempt last month on its premier -- and influential Italy joining in.\nFico's party opposes EU arms deliveries to Ukraine and rails against alleged \"warmongers\" in Brussels.\nThose are also positions shared with many, but not all, far-right parties in Europe, which are predicted to make gains in the European Parliament.\nLate Friday, a man hit Danish Prime Minister Mette Frederiksen in a Copenhagen square.\n- 'Scary' far-right -In Italy, Meloni has put her name on the EU ballot papers as the lead candidate for the Brothers of Italy, though she does not intend to take up a seat in the European Parliament if chosen."}, {"id": "a116f460-df9c-4e3a-97e9-7bd737c4e712", "title": "Four hostages rescued from Gaza in largest recovery since Oct . 7", "date": "2024-06-08 13:45", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-rescue-four-live-hostages-from-gaza-military-says/", "message": "At least 94 Palestinians including children were killed as heavy fighting continued around the sites in central Gaza, the Health Ministry said.\nArgamani had been one of the most widely recognized hostages after being abducted from a music festival in southern Israel.\nBlinken to travel to Middle East next week to press for Gaza ceasefireSaturday’s hostage recovery operation brings the total of rescued captives to seven.\nTwo men were rescued in February and a woman was rescued in the aftermath of the October attack.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "950a3682-bb0e-43ac-bf37-0fb56736cbde", "title": "Gaza news : 55 dead in strikes , Israel rescues 4 Oct . 7 hostages", "date": "2024-06-08 13:00", "url": "https://www.ctvnews.ca/world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza-strikes-1.6918991", "message": "At least 94 Palestinians including children were killed as heavy fighting continued around the sites in central Gaza, the Health Ministry said.\nArgamani had been one of the most widely recognized hostages after being abducted from a music festival in southern Israel.\nThe bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where Khalil Degran told The Associated Press more than 100 wounded also arrived.\nPalestinians face widespread hunger because fighting and Israeli restrictions have largely cut off the flow of aid.\nIsrael said some 30 militants were inside at the time and on Friday released the names of 17 militants it said were killed."}, {"id": "fd4aae7d-010a-4b55-b04d-f4928107decf", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 12:45", "url": "https://www.ksat.com/news/world/2024/06/08/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nThe bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside at the time and on Friday released the names of 17 militants it said were killed."}, {"id": "7ec3f9ff-a729-4dc9-befd-7d8073c9257c", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://komonews.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "95f24551-a99e-4f83-a966-3ec8f9e88ad9", "title": "Israel rescues 4 hostages kidnapped in a Hamas - led attack on Oct . 7 . ", "date": "2024-06-08 12:30", "url": "https://www.local10.com/news/world/2024/06/08/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "FILE - A woman and her children walk past a wall with photographs of hostages who were kidnapped during the Oct. 7 Hamas cross-border attack in Israel in Jerusalem, on Feb. 26, 2024.\nRecommended VideosArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nThe bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "f620a300-a04c-4624-92f2-290a4bbffa84", "title": "EU voting passes halfway mark with Slovakia , Italy joining in", "date": "2024-06-08 10:00", "url": "https://www.ktbs.com/news/national/eu-voting-passes-halfway-mark-with-slovakia-italy-joining-in/article_f3050da3-f01d-575a-9363-cce6a08c3c36.html", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "0a64b437-afb0-422d-a686-8a2813529cd5", "title": "Essex man arrested for stabbing stranger in front of schoolchildren | News", "date": "2024-06-08 10:15", "url": "https://www.independent.co.uk/tv/news/essex-stabbing-crime-school-tiptree-b2559098.html", "message": "Watch the dramatic moment a violent offender was arrested after stabbing a stranger in front of terrified schoolchildren in Essex.\nJohn Garrett, 55, attacked a man at a bus stop in Tiptree in broad daylight after stealing two bottles of alcohol from a Shell garage on 11 July 2023.\nHe stabbed his victim in the neck three times and left him in a life-threatening condition as paramedics rushed to the scene.\nSix people - including children leaving school - witnessed the violent attack.\nGarrett fled the scene and returned home, where he was arrested shortly after."}, {"id": "b1006695-298a-46df-968a-ff9f885161d7", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 11:00", "url": "https://www.mymotherlode.com/news/east-europe/3371849/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say.html", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nOn Saturday morning, officials said air defenses for the first time shot down Ukrainian drones over the North Ossetia region in the North Caucasus, some 900 km (560 miles) east of the front line in Ukraine’s partially occupied Zaporizhzhia region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "29bfbe68-5e4d-4da8-b007-901c30454600", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 11:30", "url": "https://www.aspendailynews.com/associated_press/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say/article_7084cbc8-06a1-5a2a-a7b3-81f526415041.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left 27 dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday"}, {"id": "65d43f9f-5ddc-4420-8c7b-10af98c49a78", "title": "Israel bombs Gaza as minister poised to quit government", "date": "2024-06-08 10:15", "url": "https://www.channelnewsasia.com/world/israel-bombs-gaza-minister-poised-quit-government-4396501", "message": "\"DEFENCELESS\"The war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Hamas-run territory's health ministry.\nMilitants from Hamas and other Palestinian armed groups also took 251 hostages, 120 of whom remain in Gaza, including 41 the army says are dead.\nIsrael's retaliatory military offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nIsrael's Prime Minister Benjamin Netanyahu, who is due to address the US Congress next month, also faces pressure from within his right-wing government.\nThe office of war cabinet member Benny Gantz has announced a news conference for Saturday, the deadline he gave Netanyahu last month to approve a post-war plan for Gaza."}, {"id": "66a7bc00-8e2b-47a2-826d-84df9bb19834", "title": "Haiti - FLASH : 6 men sentenced to pay $6 . 2M in damages to Martine Moïse and her son Joverlein", "date": "2024-06-08 14:15", "url": "https://www.haitilibre.com/en/news-42504-haiti-flash-6-men-sentenced-to-pay-$62m-in-damages-to-martine-moise-and-her-son-joverlein.html", "message": "Haiti - FLASH : 6 men sentenced to pay $6.2M in damages to Martine Moïse and her son Joverlein6 men found guilty in the case of the assassination of Haitian President Jovenel Moïse https://www.haitilibre.com/en/news-34162-haiti-flash-president-jovenel-moise-assassinated-by-mercenaries-official-updated-7am-+-video.html were ordered in the United States to pay damages for the death of President Moïse, to his widow and to his eldest son Joverlein Moïse for a total of $6.2 millions, according to the restitution order issued by Federal Judge José E. Martínez of Miami.\nIn the restitution agreement filed last week in Miami federal court, Judge Martinez did not identify the widow and eldest son by name in his final ruling.\nHowever, Paul Turner, Martine Moïse's lawyer claims that Victim 1 is his client; Others familiar with the matter say President Joverlein's eldest son, Moïse, is victim 2.\nOf this sum, Martine Moïse (who currently lives in South Florida) is to receive $5,305,387 while Joverlein Moïse will receive $865,396.\nThe judge's order does not specify why the defendants were ordered to compensate Joverlein Moïse who was not present in the house at the time of the assassination."}, {"id": "d85b1629-b43b-4aac-ad34-e73501ea4706", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://wlos.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "4dcbb17d-b1e8-43cb-97da-061cc9fa46e5", "title": "Israel rescues 4 hostages – NBC10 Philadelphia", "date": "2024-06-08 13:00", "url": "https://www.nbcphiladelphia.com/news/national-international/israel-rescues-4-hostages-kidnapped-in-october-hamas-attack/3880479/", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israel on Saturday rescued four hostages who were kidnapped in the Hamas-led attack on Oct. 7, the largest such recovery operation since the war began.\nAt least 94 Palestinians including children were killed as heavy fighting continued around the sites in central Gaza, the Health Ministry said.\nArgamani had been one of the most widely recognized hostages after being abducted from a music festival in southern Israel.\nThe bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people."}, {"id": "e19131a7-68fb-410b-a054-87e79d7f497e", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.gjsentinel.com/news/national/danish-pm-hit-by-man-in-copenhagen/article_5a6b3885-2de4-5081-9543-4e8fead8f1dd.html", "message": "Friday NightSome clouds.\nA stray shower or thunderstorm is possible.\nSE winds at 10 to 20 mph, decreasing to 5 to 10 mph."}, {"id": "f2c82fde-b619-47c7-a0c1-7e10b77f278f", "title": "Israel rescues 4 hostages – NBC 6 South Florida", "date": "2024-06-08 12:30", "url": "https://www.nbcmiami.com/news/national-international/israel-rescues-4-hostages-kidnapped-in-october-hamas-attack/3332097/", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israel on Saturday rescued four hostages who were kidnapped in the Hamas-led attack on Oct. 7, the largest such recovery operation since the war began.\nAt least 94 Palestinians including children were killed as heavy fighting continued around the sites in central Gaza, the Health Ministry said.\nArgamani had been one of the most widely recognized hostages after being abducted from a music festival in southern Israel.\nThe bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people."}, {"id": "739982bd-db58-429b-b774-ed8c2d7fabab", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 13:15", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-news-8-6-2024-d23625", "message": "JERUSALEM — Israel said Saturday it rescued four hostages who were kidnapped in the Hamas-led attack on Oct. 7, the largest such recovery operation since the war began in Gaza.\nArgamani had been one of the most widely recognized hostages after being abducted from a music festival in southern Israel.\nIsrael says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nCredit: APHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7."}, {"id": "09018b75-ff34-45a1-bc8c-dc92491c987e", "title": "PM Modi Condemns Attack On Danish PM Mette Frederiksen | Pragativadi | Odisha News , Breaking News Odisha , Latest Odisha News", "date": "2024-06-08 14:00", "url": "https://pragativadi.com/pm-modi-condemns-attack-on-danish-pm-mette-frederiksen/", "message": "New Delhi: Prime Minister-designate Narendra Modi on Saturday condemned the attack on Danish PM Mette Frederiksen, who was hit by a man in Copenhagen.\n“Deeply concerned by the news of the attack on Mette Frederiksen, Denmark’s Prime Minister.\nThe Danish prime minister suffered minor whiplash but is otherwise fine after the incident, her office confirmed in a statement on Saturday.\nThree weeks ago, Slovakia’s Prime Minister Robert Fico was seriously injured in an assassination attempt.\nThe attack on Frederiksen comes amid European Union parliamentary elections, which are underway in Denmark and across the 27-nation bloc."}, {"id": "18626439-380e-4b29-8ac5-96018bf8774f", "title": "Store explosion injures 15 in Romania | Northwest Arkansas Democrat - Gazette", "date": "2024-06-08 10:00", "url": "https://www.nwaonline.com/news/2024/jun/08/store-explosion-injures-15-in-romania/", "message": "Store explosion injures 15 in RomaniaBUCHAREST, Romania -- An explosion at a chain home improvement store in northeastern Romania on Friday injured at least 15 people, four of them seriously, authorities said.\n(Romanian Emergency Services - ISU Botosani via AP)In this photo released by Romanian Emergency Services (ISU Botosani), firefighters work at the scene of an explosion at a chain DIY store in Botosani, Romania, Friday, June 7, 2024.\nAn explosion at a chain DIY store in northwest Romania on Friday injured at least 13 people, one seriously, but caused no fatalities, authorities said.\n( Romanian Emergency Services - ISU Botosani via AP)In this photo released by Romanian Emergency Services (ISU Botosani), firefighters work at the scene of an explosion at a chain DIY store in Botosani, Romania, Friday, June 7, 2024.\nAn explosion at a chain DIY store in northwest Romania on Friday injured at least 13 people, one seriously, but caused no fatalities, authorities said."}, {"id": "6f586399-35a4-41bc-9d8c-11d0e4842cc0", "title": "Day After UN School Attack , IDF Brags About Striking Another Refugee Camp School", "date": "2024-06-08 00:00", "url": "https://truthout.org/articles/day-after-un-school-attack-idf-brags-about-striking-another-refugee-camp-school/", "message": "Israeli forces carried out the strike on the Al-Shati UN school just after killing at least 40 in an attack on Nuseirat.\nIsrael Defense Forces (IDF) bombed a UN school-turned-evacuation center in Al-Shati refugee camp, near Gaza City, as they carried out an intense series of bombardments on Friday.\nThis is the second time that Israel has struck a UN Relief and Works Agency for Palestine Refugees (UNRWA) school over the course of 48 hours.\nOn Thursday, Israeli forces deployed U.S.-made bombs in an attack that killed at least 40 Palestinians, including 14 children, in Nuseirat refugee camp.\nThe Nuseirat attack sparked widespread outrage, with humanitarian groups quickly denouncing it as a potential war crime."}, {"id": "3c24cab9-35ff-448d-96e7-dbb738a8fb4d", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 12:30", "url": "http://thepeninsulaqatar.com/article/08/06/2024/danish-pm-hit-by-man-in-copenhagen", "message": "(Files) Denmark's Prime Minister Mette Frederiksen addresses the 7th annual Copenhagen Democracy Summit in Copenhagen on May 14, 2024.\n(Photo by Ida Marie Odgaard / Ritzau Scanpix / AFP)AFPCopenhagen: Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details."}, {"id": "66795084-6405-4e43-9b1d-8c2ba3ca5ae8", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news-flash/193929", "message": "COPENHAGEN, June 8, 2024 (BSS/AFP) - Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details.\nIn 2019, Frederiksen became the country's youngest prime minister, and kept the post after emerging victorious in the 2022 general election."}, {"id": "2e521b59-5901-40a4-8f23-9e60cc787e60", "title": "Ukraine air defense downs 9 Russian drones", "date": "2024-06-08 10:30", "url": "https://www.voanews.com/a/ukraine-air-defense-downs-9-russian-drones/7647955.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean Peninsula.\nRussia’s Ministry of Defense said that one drone had been destroyed, whereas regional Governor Sergei Menyailo reported three downed drones over the region.\nDnipropetrovsk regional Governor Serhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "2a342e27-d986-4b01-87ef-2899d8b9eef9", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 12:00", "url": "https://santamariatimes.com/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/article_9c0ee6bf-b7b1-5f95-b453-d41c80c232e1.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left 28 dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday"}, {"id": "c5ea2d5d-ce8b-4e2b-a919-712b705f210c", "title": "While out on bail in BB gun shooting case , man charged with stabbing sex worker in Oakland over $60 dispute", "date": "2024-06-08 00:30", "url": "https://www.eastbaytimes.com/2024/06/07/while-out-on-bail-in-bb-gun-shooting-case-man-charged-with-stabbing-sex-worker-in-oakland-over-60-dispute/", "message": "OAKLAND — A man has been charged with stabbing a woman after allegedly offering her $60 for sex and trying to take it back, court records show.\nThe woman was stabbed in the abdomen on International Boulevard in Oakland on April 9, and required surgery, police say.\nRoughly two weeks earlier, the man had posted $30,000 bail to secure his release from Santa Rita Jail on charges of assault with a BB gun.\nThe BB gun shooting occurred at Monarch Bay Golf Course in San Leandro, according to court records.\nAs a result, his bail was revoked and a no-bail arrest warrant was issued, records show."}, {"id": "765b0bce-6d36-4139-b08f-1b1c52c677d5", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 13:15", "url": "https://fox11online.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "e1536668-3cf8-4665-b06c-f8dc659e8cd8", "title": "OIC condemns Israeli targeting of UNRWA school in Gaza", "date": "2024-06-08 12:30", "url": "https://www.gulf-times.com/article/684379/region/oic-condemns-israeli-targeting-of-unrwa-school-in-gaza", "message": "The Organization of Islamic Cooperation (OIC) has condemned in the strongest terms the Israeli bombing of a United Nations Relief and Works Agency for Palestine Refugees (UNRWA) school in Gaza, which was sheltering displaced persons.\nThe attack resulted in the martyrdom of over 40 Palestinians and injured numerous civilians, most of whom were women and children.In a statement issued Saturday, the OIC considered the Israeli bombing of the school as an extension of the ongoing genocide in Gaza and a blatant violation of international humanitarian law, the Geneva Conventions, relevant United Nations resolutions, and orders from the International Court of Justice.The OIC viewed the United Nations' decision to include Israel, the occupying power, on the list of violators of children's rights in armed conflicts, known as the \"list of shame,\" as an important step towards supporting the rule of international law and ending the culture of impunity concerning Israeli war crimes, thereby ensuring justice for Palestinian victims.The organization called on the international community, particularly the United Nations Security Council, to fulfill its responsibilities by working to end the continuous Israeli aggression against the Palestinian people and taking serious measures to ensure the accountability of those who commit war crimes and genocide against Palestinians, ultimately achieving international justice."}, {"id": "cfa09d7b-1dfd-4b6f-a21c-694e0a56b1c8", "title": "Israel - Hamas War Day 246 : What happening in Gaza , Middle East ? ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-08/live-updates-805413", "message": "(photo credit: MAYA ALLERUZO/POOL/REUTERS)Prime Minister Benjamin Netanyahu said on Saturday that Israel does not give in to terrorism and that it is operating \"creatively and bravely\" to bring home the hostages held by Hamas in Gaza.\n\"We are committed to do so in the future as well.\nWe will not let up until we complete the mission and return home all the hostages - both those alive and dead,\" Netanyahu said."}, {"id": "87dc7c40-b60d-4ef7-9095-c469146bacef", "title": "Slovakia set for EU vote after PM shooting , Meloni Italy next", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193941", "message": "Far-right Prime Minister Giorgia Meloni is hoping astrong showing from her party will strengthen her hand as a key EUpowerbroker.\nThe party opposes EU arms deliveries to Ukraine, calling itself a \"party ofpeace\" and railing against alleged \"warmongers\" in Brussels.\nPolls suggest Meloni's Fratelli d'Italia party looks set to claim 27 percentof the vote, equalling 22 seats, amid a broader surge of far-right groupsacross the EU.\nThe outsized influence of Meloni's party is all the more striking given thatduring the last EU polls in 2019 it won just 6.4 percent of the vote and sixseats.\nOverall, polls ahead of the vote suggested that far-right parties could claimaround a quarter of the 720 seats in the incoming EU parliament."}, {"id": "a65e76d4-f0fd-4461-b5bd-0a39ad40f5ec", "title": "Israeli forces rescue four live hostages who were kidnapped from music festival and taken to Gaza", "date": "2024-06-08 14:00", "url": "https://www.irishtimes.com/world/middle-east/2024/06/08/israel-hamas-latest/", "message": "The Israeli military named the rescued hostages as Noa Argamani (25), Almog Meir Jan (21), Andrey Kozlov (27), and Shlomi Ziv (40).\nThere are 116 now left in Gaza, according to Israeli tallies, including at least 40 whom Israeli authorities have declared dead.\nGaza’s health ministry meanwhile reported on Saturday that Israeli military assaults in al-Nuseirat had killed and wounded dozens of people including women and children.\nIn north Gaza, three Palestinians were killed in an Israeli air strike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nIt was not immediately clear what violations Israel's military had been accused of committing."}, {"id": "368fd4d6-edc3-4bdf-96ce-1ccdd19133c6", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.channelnewsasia.com/world/danish-prime-minister-mette-frederiksen-attacked-man-copenhagen-4395761", "message": "They added that while it was a \"strong push\", Frederiksen did not hit the ground.\n\"CONFUSED\"According to the witnesses, the prime minister then sat down at a nearby cafe.\n\"They had pacified him, and as he lay there, he looked confused and a little dazed,\" Jorgensen told the newspaper.\nMetsola urged the Danish head of government to \"keep strong\", while adding in a post on X that \"violence has no place in politics\".\n\"I strongly condemn this cowardly act of aggression,\" the European Council president said in a separate post on X."}, {"id": "79d33cff-08b8-455e-969d-8abf2635ce82", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://khqa.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "537d89fa-4192-429f-a080-0e0c78beee0b", "title": "Woman rescued from rubble near Poltava dies in hospital", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/woman-rescued-rubble-near-poltava-092512084.html", "message": "Woman rescued from rubble near Poltava dies in hospitalAttack on Poltava Oblast on 7 June.\nPhoto: Oblast Military AdministrationA woman rescued from the rubble in Poltava district on 7 June has died in hospital.\nSource: Filip Pronin, Head of Poltava Oblast Military Administration, on TelegramQuote from Pronin: \"Unfortunately, the woman who was rescued from the rubble yesterday has died.\nDoctors fought to save her life until the last minute.\"\nBackground: On 7 June, the Russian army launched a missile attack on a residential building in Poltava Oblast, and a woman was rescued from the rubble."}, {"id": "be955961-e0ea-4617-9f9c-3c30cc027f1f", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia , according to experts", "date": "2024-06-08 11:00", "url": "https://abcnews.go.com/Politics/permission-win-ukraine-biden-weapons-defeat-russia-experts/story?id=110924679", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat Russia, according to expertsSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nAs opposed to ethics, law or sound military strategy, the restrictive American policy for Ukraine is based on fear, according to Hodges and other experts on the region.\nThe M57A1 Army Tactical Missile System missile is fired over the cab of an M142 High Mobility Artillery Rocket System launcher.\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "558d1f84-dccc-45e5-81ab-cf542cc3fc04", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia", "date": "2024-06-08 14:15", "url": "https://abc7ny.com/permission-to-win-ukraine-needs-more-from-biden-than-weapons-to-de/14925124/", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat RussiaSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nZelenskyy has been vocal about the importance of using long-range Western weapons, like the U.S.-provided Army Tactical Missile System (ATACMS), against military targets in Russia.\nBiden and his cabinet members at the Pentagon and State Department have repeatedly vowed to assist Ukraine for \"as long as it takes.\"\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "7478e7c2-7dd7-4d9a-a68b-34f8cdb285b2", "title": "Danish Prime Minister Mette Frederiksen attacked by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.aol.com/danish-prime-minister-mette-frederiksen-203554001.html", "message": "Danish Prime Minister Mette Frederiksen was attacked by a man, who has since been arrested, in the capital city of Copenhagen on Friday, her office said in a statement to CNN.\n“Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\nIt is unclear if the prime minister was hurt in the assault.\n“Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,” Latvian Prime Minister Evika Siliņa said in a post on X.\nFrederiksen, the leader of Denmark’s center-left Socialist Democratic party, has served as prime minister since 2019."}, {"id": "db7caacf-b906-484d-8229-edd160c38e57", "title": "Ukraine war briefing : Biden pledges $225m in new military aid while vowing US backs Kyiv  completely  | Ukraine", "date": "2024-06-08 04:15", "url": "https://www.theguardian.com/world/article/2024/jun/08/ukraine-war-briefing-biden-pledges-225m-in-new-military-aid-while-vowing-us-backs-kyiv-completely", "message": "Meeting the Ukrainian president in Paris, Biden told him: “You haven’t bowed down, you haven’t yielded at all, you continue to fight in a way that is … just remarkable.\nA Himars missile struck shortly afterwards as residents from neighbouring houses rushed to help the victims, Saldo told Russian media, putting the overall toll at 22 dead and 15 injured.\nWe are not like this,” the French president told reporters on Friday in Paris alongside Zelensky, in an apparent jab at critics including France’s far-right opposition.\nMacron also said he wanted to “finalise” the creation of a coalition of military instructors for Ukraine in the coming days.\nPutin’s legitimacy is recognised only by comrade Putin,” Zelenskiy said in Paris."}, {"id": "9ed0e33f-2300-4d5e-b437-432377b63afb", "title": "First Drones Strike Mozdok Military Airfield In North Ossetia", "date": "2024-06-08 10:45", "url": "https://charter97.org/en/news/2024/6/8/598128/", "message": "First Drones Strike Mozdok Military Airfield In North Ossetia 10 8.06.2024, 15:3421,550The drones covered more than a thousand kilometers.\nOn the morning of June 8, the Russian Defense Ministry complained about another attack by Ukrainian drones.\nThe department said that they allegedly “destroyed the UAV” over the territory of the Republic of North Ossetia.\nAt the same time, head of North Ossetia Sergei Menyailo said that three Ukrainian drones tried to attack a military airfield in Mozdok.\nTheir target was a military airfield,” Menyailo said."}, {"id": "97fce453-be53-43ef-8186-d67adea9a47d", "title": "ALJazeera :  Explosions every minute  as intense Israeli strikes target central Gaza – International Shia News Agency", "date": "2024-06-08 13:00", "url": "https://en.shafaqna.com/371627/aljazeera-explosions-every-minute-as-intense-israeli-strikes-target-central-gaza/", "message": "Israeli forces launch ‘unprecedented brutal attack’ on NuseiratGaza’s Government Media Office says the Israeli forces have launched “an unprecedented brutal attack on the Nuseirat refugee camp,”leaving dozens of people killed and wounded in the streets.\n“[It] continues its aggression against all areas of the Central Governorate, and Al-Aqsa Martyrs Hospital [in Deir el-Balah] is in a catastrophic situation,” it said.\nIsraeli forces launched “a barbaric and brutal aggression” in the camp, directly targeting civilians, the office said, adding that ambulances and civil defence cannot reach the area due to the intensity of the bombing.\nAmbulances have not stopped transferring people to Al-Aqsa HospitalThe ambulances have not stopped transferring injuries, and not only ambulances.\nWe’re talking about people, donkey carts, cars and anyone trying to help as much as possible."}, {"id": "3e5984a7-a3ad-4712-9689-045fc3d3eaef", "title": "Danish Prime Minister Mette Frederiksen attacked in Copenhagen", "date": "2024-06-08 00:15", "url": "https://www.sbs.com.au/news/article/man-arrested-after-danish-prime-minister-mette-frederiksen-hit-in-copenhagen/qu5h09a5h", "message": "Danish Prime Minister Mette Frederiksen has walked away following an assault by a man in central Copenhagen.\nThe background: Frederiksen was \"hit\" on Friday evening (local time) at the public square of Kultorvet in Copenhagen, by a man who was subsequently arrested, her office said in a statement.\n\"The prime minister is shocked by the incident.\"\nThe attack on Mette Frederiksen comes two days before Danes head to the polls in the EU election.\nI must say that it shakes all of us who are close to her,\" Danish Environment Minister Magnus Heunicke said on X."}, {"id": "64ab1dbc-cb9b-4e33-b38d-9ed07e758ad8", "title": "Israel says rescues four Gaza hostages alive", "date": "2024-06-08 12:15", "url": "https://www.al-monitor.com/originals/2024/06/israel-says-rescues-four-gaza-hostages-alive", "message": "The four had been kidnapped by Hamas from the Nova music festival during the Islamists' October 7 attacks that sparked war with Israel, the army said.\nThere are now 116 hostages remaining in Gaza, including 41 the army says are dead.\nPressure increased after Israeli troops retrieved the bodies of seven hostages from the Gaza Strip last month.\nA Gaza hospital said heavy Israeli strikes Saturday in central areas of the territory, including Nuseirat, killed at least 15 people.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny."}, {"id": "3cb0ddbb-b2fa-48df-a97b-fb57557ce788", "title": "Israel rescues four hostages alive from Gaza , army says", "date": "2024-06-08 13:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-rescues-four-hostages-alive-gaza-army-says", "message": "The four had been kidnapped by Hamas from the Nova music festival during the Islamists' October 7 attacks that sparked war with Israel, the army said.\nThere are now 116 hostages remaining in Gaza, including 41 the army says are dead.\nPressure increased after Israeli troops retrieved the bodies of seven hostages from the Gaza Strip last month.\nA Gaza hospital said heavy Israeli strikes Saturday in central areas of the territory, including Nuseirat, killed at least 15 people.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny."}, {"id": "5ad35737-e925-4a6f-aeb0-b26e2fc87b32", "title": "Danish Prime Minister Cancels EU Election Events After Attack", "date": "2024-06-08 10:30", "url": "https://www.bnnbloomberg.ca/danish-prime-minister-cancels-eu-election-events-after-attack-1.2082755", "message": "(Bloomberg) -- A 39-year-old man has been jailed and charged with violence against an official after an attack on Denmark’s Prime Minister Mette Frederiksen that led her to cancel several election events.\nThe attack in Copenhagen comes less than four weeks after Slovak Prime Minister Robert Fico was shot in an assassination attempt.\nThere appears to be no political motive to the attack on the Danish prime minister, Ritzau cited the accused’s lawyer as saying in court.\nDanish politicians, along with Frederiksen, are currently campaigning ahead of the European Parliament elections this weekend and the prime minister has been appearing with candidates from her Social Democrats party.\nAccording to local media reports, the attack occurred as the prime minister was meeting a person at a cafe in Copenhagen’s shopping district."}, {"id": "003791c1-e0e5-4fb0-810a-357b05e3e17f", "title": "PM - designate Modi condemns attack on Denmark PM Frederiksen , wishes her good health | India News", "date": "2024-06-08 14:00", "url": "https://timesofindia.indiatimes.com/india/pm-designate-modi-condemns-attack-on-denmark-pm-frederiksen-wishes-her-good-health/articleshow/110820708.cms", "message": "NEW DELHI: Condemning the attack on Denmark PM Mette Frederiksen, Prime Minister-designate Narendra Modi said that he is \"deeply concerned\" by the news of the attack.\nHe wished good health to Frederiksen.In a post on X, PM-designate Narendra Modi stated, \"Deeply concerned by the news of the attack on Mette Frederiksen, Denmark's Prime Minister.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\nLet's show that Denmark is much better,\" he added.Other world leaders have also reacted to the attack on Mette Frederiksen.\n\"Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,\" Evika Silina said in a post on X."}, {"id": "10e0c4b6-8b79-4b13-a349-e60da3a3df49", "title": "PM - designate Modi condemns attack on Denmark PM Frederiksen , wishes her good health", "date": "2024-06-08 13:15", "url": "https://news.webindia123.com/news/Articles/World/20240608/4204481.html", "message": "Condemning the attack on Denmark PM Mette Frederiksen, Prime Minister-designate Narendra Modi said that he is \"deeply concerned\" by the news of the attack.\nIn a post on X, PM-designate Narendra Modi stated, \"Deeply concerned by the news of the attack on Mette Frederiksen, Denmark's Prime Minister.\nPM Modi's statement comes after Danish Prime Minister Mette Frederiksen was assaulted by a man in Copenhagen, according to a statement from her office to CNN.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\n\"Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,\" Evika Silina said in a post on X."}, {"id": "57c0722b-f4a0-4bb8-a4ab-7197097e2d08", "title": "Denmark Prime Minister Frederiksen assaulted in central Copenhagen , man arrested | World News", "date": "2024-06-08 06:30", "url": "https://indianexpress.com/article/world/denmark-prime-minister-frederiksen-assaulted-copenhagen-man-arrested-9379401/", "message": "Denmark's Prime Minister Mette Frederiksen walked away following an assault by a man in central Copenhagen on Friday and had no outward signs of harm, a local resident told Reuters.\n\"Prime Minister Mette Frederiksen was beaten on Friday evening at Kultorvet (square, red.)\nThe Prime Minister is shocked by the incident,\" her office said in a statement without giving further detail.\n\"She seemed a little stressed,\" Soren Kjergaard, who works as a barista on the square, told Reuters after seeing the prime minister being escorted away by security following the assault.\nThree weeks ago, Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt."}, {"id": "e266b1b4-f110-4580-8cfb-709b6a2c9a70", "title": "How one party is winning perception warfare", "date": "2024-06-08 01:45", "url": "https://www.thenews.com.pk/print/1198161-how-one-party-is-winning-perception-warfare", "message": "Alas, perception warfare, aimed at influencing how people view an issue or event, is not what it used to be.\nNew school perception warfare tools: YouTube, launched in 2005, has 72 million users in Pakistan.\nTikTok, launched in 2016, has 18 million users, while Instagram, launched in 2010, has 16 million users.\nThere is only one political party in Pakistan that has successfully weaponized social media to spread manipulated information and narratives as part of its perception warfare strategy.\nThere is only one political party whose disinformation campaigns are successfully exploiting people’s emotions, such as fear, anger, or outrage."}, {"id": "30663672-0735-401e-9d8e-e6752af73bfa", "title": "  We need both communities , and we need them now more than ever . ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-805237", "message": "We need both communities, and we need them now more than ever.”Elbaum detailed the rise in aliyah, noting that 85,000 Jews from Russia and Ukraine made aliyah to Israel through The Jewish Agency since the start of the Russia-Ukraine war.\nBrummer described the numerous ways in which the Ministry of Diaspora Affairs assists the Jewish community outside Israel.\nHe noted that the fight against antisemitism is about the resilience and strength of Jewish communities and education, and mentioned the importance of the online struggle against antisemitism.\nIn order to win, we need much more coordination and cooperation between all entities and organizations that deal with this sacred mission of combating antisemitism.\nHe praised the work of the Agency’s shlichim – young Israeli emissaries spending time educating and teaching young Jews in the Diaspora."}, {"id": "91a91398-9995-4892-8d18-491f8cf7d192", "title": "IMA POP : Be prepared to meet challenges of modern warfare : Lt Gen Kumar asks IMA cadets", "date": "2024-06-08 10:15", "url": "https://economictimes.indiatimes.com/news/defence/be-prepared-to-meet-challenges-of-modern-warfare-lt-gen-kumar-asks-ima-cadets/articleshow/110818312.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGeneral Officer Commanding-in-Chief Northern Command, Lt Gen MV Suchindra Kumar, on Saturday said the nature and dynamics of modern warfare is changing constantly and asked the gentlemen cadets passing out of the prestigious Indian Military Academy here to be prepared to meet these challenges .\nAddressing the Passing out Parade of the IMA at the historic drill square as the reviewing officer, Lt Gen Kumar said technological advancement is constantly impacting the character of modern wars.\n\"The dynamics of combat is changing continuously with the increasing use of space cyber and information warfare .\nToday's wars are wars of ideas, intellect and innovation.\nYou have to be prepared to be in the forefront to meet these challenges,\" he said.Lt Gen Kumar said the use of space, cyber and cognitive domains in warfare are contemporary realities.Information warfare, drones, autonomous systems, cyber, exploitation of EM spectrum and man-machine teaming, comprise the new normal, he added."}, {"id": "f99bf4b2-98a3-40a2-b994-ee9050c18592", "title": "Be Prepared To Meet Challenges Of Modern Warfare : Lt Gen Kumar Asks IMA Cadets", "date": "2024-06-08 07:30", "url": "https://www.dailyexcelsior.com/be-prepared-to-meet-challenges-of-modern-warfare-lt-gen-kumar-asks-ima-cadets/", "message": "Addressing the Passing out Parade of the IMA at the historic drill square as the reviewing officer, Lt Gen Kumar said technological advancement is constantly impacting the character of modern wars.\nLt Gen Kumar said the use of space, cyber and cognitive domains in warfare are contemporary realities.\nLt Gen Kumar exhorted all cadets to dedicate themselves to the service of the nation.\nAfter reviewing the Parade, Lt Gen Kumar laid wreaths and offered floral tributes to pay homage to the brave alumni of the IMA at the War Memorial.\nThe ‘Pipping Ceremony’, where the Officer Cadets don the ranks of Commissioned Officer, was carried out by their parents and loved ones."}, {"id": "2c7d4f56-4984-4081-bfa9-21c71f2bcb7a", "title": "Air Weapons : Game of Drones", "date": "2024-06-08 07:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairw%5Carticles%5C202406070253.aspx", "message": "Female soldiers can excel as UAV operators while mostly avoiding the battlefield risk of death or injury.\nUnlike pilots of combat aircraft, UAV operators are much less likely to be put out of action by death, injury, or capture.\nUAV operators are relatively close to the front lines and exposed to some risk, but not nearly as much as pilots.\nUkrainian USV operations in the Black Sea forced the Russian Black Sea Fleet to withdraw to the eastern shore of the Black Sea.\nBecause of the USVs, Ukraine, which does not have a conventional navy, now controls most of the Black Sea."}, {"id": "f7ef9cc1-dd48-4d35-8579-c5939236fe9b", "title": "Joe Plenzler Archives", "date": "2024-06-08 10:15", "url": "https://taskandpurpose.com/author/joe-plenzler/", "message": "Joe Plenzler is a communication consultant, leadership coach, and backcountry expert.\nWhen heâ€™s not running his company, he is often found climbing mountains or hiking the Appalachian Trail.\nDuring that time he attended the Marine Corpsâ€™ Mountain Warfare and Jungle Warfare Schools and the NATO Allied Officer Winter Warfare Course in Norway.\nIn 2016, he began section hiking the Appalachian Trail with his partner-in-crime, Kate and has completed more than 700 miles.\nHeâ€™s also completed a winter ascent of Longâ€™s Peak (14,259â€™), and summited Mount Rainier (14,410â€™), the Grand Teton (13,775â€™), and Mt."}, {"id": "02bb309b-edfe-475c-b0aa-896a92b60032", "title": "Like the F - 16 , French Mirage 2000 - 5 fighters are good planes , but they arent the best Western jets for Ukraine", "date": "2024-06-08 13:15", "url": "https://www.yahoo.com/news/f-16-french-mirage-2000-121701163.html", "message": "Like the F-16, French Mirage 2000-5 fighters are good planes, but they aren't the best Western jets for UkraineFrance announced this week it would send Ukraine Mirage 2000-5 fighter jets.\nMacron's announcement comes as Ukraine eagerly awaits the seemingly imminent arrival of American-made F-16s, which will be Kyiv's first Western fighter jet.\nThe Mirage 2000-5, like its F-16 counterpart, is a good fourth-generation fighter jet that will bring some additional capabilities to Ukraine's fleet of aging Soviet-era warplanes.\nInvesting resources to get Ukraine another Western fighter that has an even shorter air-to-air reach won't necessarily improve this dilemma.\nA F-16 aircraft is pictured after the first delivery of Norway's old F-16 fighter aircraft to Romania at Rygge Air Force Base in Norway on Nov. 28, 2023."}, {"id": "b420b866-dde7-4ee2-8461-6e46b38ec290", "title": "Like the F - 16 , French Mirage 2000 - 5 fighters are good planes , but they arent the best Western jets for Ukraine", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/f-16-french-mirage-2000-121701910.html", "message": "Like the F-16, French Mirage 2000-5 fighters are good planes, but they aren't the best Western jets for UkraineFrance announced this week it would send Ukraine Mirage 2000-5 fighter jets.\nMacron's announcement comes as Ukraine eagerly awaits the seemingly imminent arrival of American-made F-16s, which will be Kyiv's first Western fighter jet.\nThe Mirage 2000-5, like its F-16 counterpart, is a good fourth-generation fighter jet that will bring some additional capabilities to Ukraine's fleet of aging Soviet-era warplanes.\nInvesting resources to get Ukraine another Western fighter that has an even shorter air-to-air reach won't necessarily improve this dilemma.\nA F-16 aircraft is pictured after the first delivery of Norway's old F-16 fighter aircraft to Romania at Rygge Air Force Base in Norway on Nov. 28, 2023."}, {"id": "0cd0d823-b533-4c29-b511-3ed39d30ef4f", "title": "Tejas Mk1 / A : A Capable Contender in the Subcontinent Skies – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/tejas-mk1-a-a-capable-contender-in-the-subcontinents-skies/", "message": "This article aims to shed light on the Tejas’ capabilities and their role in the Indian Air Force (IAF).\nThe narrative that the Tejas isn’t designed for specific opponents undermines its potential.\nThe Tejas Mk1/A, armed with advanced avionics, the Astra Mk1 missile, and a capable radar present a formidable challenge.\nWhile details remain undisclosed, it’s likely a combination of aircraft, including Mirage-2000s, and supporting assets like AWACS/AEW&C played a crucial role.\nThe Tejas Mk1/A is a capable platform that continues to evolve."}, {"id": "9c4a25d9-6507-4b52-a162-26428d8e1b03", "title": "  US shadow : Taiwan new defence chief Wellington Koo sets out policy direction", "date": "2024-06-08 13:00", "url": "https://www.scmp.com/news/china/politics/article/3265814/us-shadow-taiwans-new-defence-chief-wellington-koo-sets-out-policy-direction", "message": "Taiwan’s new defence chief Wellington Koo has set out key aspects of his policy direction, including developing asymmetric warfare and seeking military financing and advice on force restructuring from the United States.\nHe would “not rule out using US military force” but made a distinction between deploying ground forces versus using air and naval power.\nOn Thursday, Koo said that instead of relying on others, the island must focus on strengthening its own defences.\nThe report emphasised the importance of better combat resilience, civilian defence mobilisation, strengthening reserve forces, promoting defence autonomy, and prioritising the well-being of soldiers.\nMax Lo, executive director of the Taiwan International Strategic Study Society, said the US appears to have had a significant influence on Koo’s policy direction."}, {"id": "95e0aa0d-aaab-4b22-8327-028ab61f13b6", "title": "One Ukrainian brigade holds back three Russian brigades on Pokrovsk front", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/one-ukrainian-brigade-holds-back-063000261.html", "message": "The Ukrainian Ground Forces have reported that soldiers from the 47th Mechanised Brigade are holding back at least three Russian combat brigades on the Pokrovsk front.\nSource: Ukrainian Ground ForcesDetails: The Ukrainian Ground Forces noted that the Russians are not reducing the pace of their assault actions and the Pokrovsk front is the epicentre of the fighting.\nQuote: \"Here, the enemy is trying to advance into the depths of our territory.\nSoldiers of the 47th Mechanised Brigade are holding back at least three Russian combat brigades.\nWith huge reserves of manpower, the Russians quickly replenish their huge losses and throw [new soldiers] into battle again and again."}, {"id": "c45fa681-3029-4176-9115-bee51e10acc2", "title": "Five settings we would love to see Total War explore", "date": "2024-06-08 09:15", "url": "https://www.gamewatcher.com/news/five-settings-we-would-love-to-see-total-war-explore", "message": "About Fran J. RuizFran J. Ruiz is an English Studies survivor and a freelance writer for The Loadout, VG247, Space, The Escapist, and more.\nSpyro and Warcraft 3 are his all-timers.\nHe plays a bit of everything, from little-known indies to the biggest AAA releases, resulting in a backlog that never goes down."}, {"id": "80df28f8-f74c-43ee-bcd3-f6db06a48b03", "title": "Russo - Ukraine War - 07 June 2024", "date": "2024-06-08 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-07.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nThroughout the day in the Sivers віkomu direction, Russian forces carried out two unsuccessful assault actions in the area of Bílogorivka.\nRussia does not give up trying to find the weak points in Ukrainian defense, with continuous assault attempts to infiltrate Ukrainian troops' combat.\nThe Defense Forces are taking measures to stabilize the situation and prevent Russian forces from advancing.\nIn the Vremívs завkomu direction, Russian forces tried to tie battles near Urožaynogo and Staromayors міkogo."}, {"id": "1ab5a34c-c75d-482e-bc98-bcdabde2bcc6", "title": "Metaphor : ReFantazio has over 40 persona - like archetypes to evolve and combine , still looks a lot like Persona ( complimentary ) ", "date": "2024-06-08 00:15", "url": "https://www.rockpapershotgun.com/metaphor-refantazio-has-over-40-persona-like-archetypes-to-evolve-and-combine-still-looks-a-lot-like-persona-complimentary", "message": "It’s easy to draw comparisons between Metaphor: ReFantazio and Persona, given that the upcoming RPG is in the works over at Persona makers Atlus and is built around a similar ‘transform into an awesome-looking robot/creature and do battle’ concept, but so far all those comparisons only serve to highlight just how damn good Metaphor: ReFantazio looks.\nThe RPG’s latest trailer out of tonight’s Summer Game Fest stream adds to that feeling, focusing on the archetypes used by party members in battle.\nThere’ll be over 40 archetypes in total to bring along in your party, the game’s devs confirmed, with different archetypes able to earn experience and possible evolve into stronger forms.\nI’ll be happy to oblige when Metaphor: ReFantazio arrives on Steam on October 11th.\nHit up our Summer Game Fest 2024 hub and our Day Of The Devs roundup for all the news worth caring about from the shows so far."}, {"id": "4ed384cf-cbad-48e2-bb7b-38408b6c8e32", "title": "Ukraine Situation Report : Claims Fly Over Deadly ATACMS Missile Strike In Luhansk", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/ukraine-situation-report-claims-fly-003714888.html", "message": "Russia’s Defense Ministry on Friday accused Ukraine of using five ATACMS on residential buildings and other civilian structures in Luhansk, Reuters reported .\nVideo emerged on social media of what appears to be a First Person-View (FPV) drone attack on an electric substation in Russia's Kursk region.\nOf note is that in addition to the strike drone, another drone was hovering over the substation to capture the impact.\nThe German Donaustahl company introduced its Maus FPV drone earlier this week at the ILA 2024 Air Show in Berlin.\nUkraine's 46th Airmobile Brigade posted a compilation of FPV drone hits on Russian armor, including the so-called Turtle Tanks ."}, {"id": "4203eca3-aa5a-431e-8b30-c9deef7393c6", "title": "Rafale in Alaska : How  Red Flag 24  is good international exposure to Indian Air Force – Firstpost", "date": "2024-06-08 09:45", "url": "https://www.firstpost.com/opinion/rafale-in-alaska-how-red-flag-24-is-good-international-exposure-to-indian-air-force-13780203.html", "message": "Since the first time in November 1975, each year, three to six ‘Red Flag’ exercises are held at Nellis Air Force Base, Nevada, while up to four more, dubbed ‘Red Flag Alaska’, are held at Eielson Air Force Base, Alaska.\nCope Thunder was moved to Eielson Air Force Base, Alaska, in 1992.\nBlue Flag is a military aviation exercise held by the Israeli Air Force at Ovda Air Force Base in Israel.\nIn July 2022, the IAF carried out a one-month-long engagement with the Egyptian Air Force (EAF) at the Egyptian Fighter Weapon School, located in Cairo West Air Force Base.\nExercise Exposure AdvantageUnlike PLAAF, which exercises primarily with PAF and very few other major air forces, IAF benefits from exposure to air exercises with all the major air forces in the world."}, {"id": "a52cf063-1690-456f-bc66-9d1afcad957f", "title": "Ukraine Defense Needs and Increase in Production : President Met with Representatives of the French Defense and Industrial Complex in Paris", "date": "2024-06-08 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-ukraine-president05.htm", "message": "Ukraine's Defense Needs and Increase in Production: President Met with Representatives of the French Defense and Industrial Complex in ParisPresident of Ukraine7 June 2024 - 17:31In Paris, President of Ukraine Volodymyr Zelenskyy visited the Ministry of Armed Forces of France.\nThe Minister of the Armed Forces of France, SĂ©bastien Lecornu, presented to the Head of State the products of the companies of the French defense and industrial complex, which are planned to be supplied to Ukraine.\nThe President also spoke with representatives of the French defense and industrial complex.\nThey discussed Ukraine's defense needs and the increase in the production of SPH Caesar, artillery shells, including long-range ones, electronic warfare and armored vehicles.\nI would like to thank you for one of the highest quality systems we have ever had â€” the Caesar,\" Volodymyr Zelenskyy said."}, {"id": "79b54c68-6a07-45df-af70-0a85a3725d08", "title": "Prince William wife Princess Catherine is  better  and  would have loved  to have joined him at this year D - Day commemorations - 08 - Jun - 2024", "date": "2024-06-08 07:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399858&fm=psp,tst", "message": "When one war survivor asked after William's wife amid her health fight, footage posted on X showed him replying: \"She is better, thanks.\nHe also told one woman at the event: \"My wife's grandmother did the same sort of thing as you.\nSpeaking to other veterans, William said: \"I found it very moving, all the stories and letters, even now 80 years later.\"\nWhen one veteran told William \"thank you\", the prince replied: \"No, we are here to thank you.\nBritish Prime Minister Rishi Sunak took to the stage and read veterans' letters at the event, which was also attended by Labour leader Sir Keir Starmer and UK Foreign Secretary Lord David Cameron."}, {"id": "d9d64c34-3926-48b9-8308-4f9156afb988", "title": "Amazing Seasun Games Reveals New Trailer for Mecha Break Game", "date": "2024-06-08 02:15", "url": "https://www.animenewsnetwork.com/news/2024-06-07/amazing-seasun-games-reveals-new-trailer-for-mecha-break-game/.211675", "message": "Amazing Seasun Games revealed a new trailer at Summer Games Fest for its Mecha Break game.\nFrom sketches on paper to colossal war machines in game — take a behind the scenes peek at some of the Strikers you can pilot in Mecha BREAK!\nAmazing Seasun Games describes the game:Mecha BREAK is a multiplayer mech game that allows players to choose from diverse mechs, customize appearances, and battle colossal war machines on treacherous terrain.\nThe game will launch for PlayStation 5, Xbox Series X|S, and PC via Steam .\nSource: Summer Games Fest livestream"}, {"id": "a203da9f-5194-4978-a374-bf424bde1056", "title": "SADC forces engage M23 rebels in eastern DRC as violence intensifies", "date": "2024-06-08 12:15", "url": "https://www.theeastafrican.co.ke/tea/news/east-africa/sadc-forces-engage-rebels-in-eastern-dr-congo-4651312", "message": "On May 31, the South African army, a member of this mission known as SAMIDRC announced that it had lost a soldier.\nLike the first four who lost their lives, hit by mortars, the fifth is also South African.\nIt was between December 2023 and January 2024 that SADC troops were in the DRC, alongside the Congolese.\nIt is in this locality that South African and Congolese troops have set up to block the rebel assaults.\nAs for the attacks on South African troops.”Mr Bel points out that rebels are putting pressure on President Ramaphosa to take responsibility over the death of South African soldiers."}, {"id": "9f6a1deb-f39a-42ed-97cb-ffe4b3b3b114", "title": "Battle of the Alphas - Sky Mix", "date": "2024-06-08 12:30", "url": "https://www.tvguide.co.uk/schedule/7b627e01-eaf1-51b3-b63e-7d2118493360/battle-of-the-alphas", "message": "Battle of the AlphasSky Mix 6:30 PM to 7:00 PM Saturday 8 June Share Add toCalendar +Season 1 Episode 12 of 12 New S Subtitles Audio DescriptionAnimal battles south of the Sahara, where male giraffes swing their heads like wrecking balls, zebras boast the most powerful kick in the animal kingdom and chimpanzees wage warBattle of the Alphas airs on Sky Mix at 6:30 PM, Saturday 8 June .\n(Subtitles, audio description, new.)\nLearn more about Battle of the Alphas and other education/science/factual topics on our factual page"}, {"id": "4929d78d-0250-477b-8f4d-87e07b3ba8e6", "title": "Battle Vision Network is Capy spiritual successor to Might & Magic : Clash of Heroes", "date": "2024-06-08 00:00", "url": "https://www.engadget.com/battle-vision-network-is-capys-spiritual-successor-to-might--magic-clash-of-heroes-230547594.html", "message": "It’s called Battle Vision Network, and it’s heading to PC and mobile devices in 2025.\nBattle Vision Network feels like an encapsulation of Capy’s sensibilities over 20 years as an independent game studio.\nAnd finally, it’s a one-on-one puzzle fight, similar to Might & Magic: Clash of Heroes.\nIn the announcement video for BVN, director Dan Vader described the new game as a spiritual successor to Clash of Heroes with an emphasis on multiplayer combat.\nNetflix will distribute the iOS and Android versions of the game, meaning it should be available to all Netflix subscribers at no extra charge."}, {"id": "c05c5593-0d0d-4a13-a472-57a5b62e3d99", "title": "Metaphor : ReFantazio Synthesis Allows for Combining Archetypes in Battle", "date": "2024-06-08 03:30", "url": "https://gamingbolt.com/metaphor-refantazios-synthesis-feature-allows-for-combining-archetypes-in-battle", "message": "Metaphor: ReFantazio, the next big RPG from Persona 5 director Katsura Hashino, is already a massive experience.\nHowever, its battle system has its intricacies, especially when factoring in the Archetypes.\nHowever, the highlight is perhaps Synthesis, which allows for combining two party members’ Archetypes.\nOf course, there’s Special Synthesis, where three characters can team up for massive damage, though the condition for activation changes based on the party composition.\nLaunching on October 11th, Metaphor: ReFantazio will be available for Xbox Series X/S, PS5, PS4 and PC."}, {"id": "7879295a-a2d0-4c1b-b9d3-8e12cf7b5e9d", "title": "Discover Imber : The eerie  ghost village  near London abandoned in WWII , open just 20 days a year | Birmingham Live", "date": "2024-06-08 06:00", "url": "https://www.birminghammail.co.uk/travel/dangerous-ghost-village-abandoned-overnight-29282942", "message": "A tiny village just two hours away from Birmingham was once a bustling community of several hundred villagers.\nBut those living in Imber abandoned their homes after orders from the Ministry of Defence.\nOnly a small church, a handful of cottages, and a vicarage remain at the Wiltshire-based village, often dubbed 'the lost village'.\nA significant portion of the village and surrounding farmland had been strategically acquired by the Ministry of Defence before the war.\nToday, while the charm and mystery of its history are preserved in the church, the rest of the area is now dominated by rather 'unattractive' MOD training buildings."}, {"id": "35c9596b-3cce-481f-b921-d2a297825a57", "title": "Beyond blockbusters : Break from the mainstream with these indie games", "date": "2024-06-08 02:15", "url": "https://www.thestar.com.my/tech/tech-news/2024/06/08/beyond-blockbusters-break-from-the-mainstream-with-these-indie-games", "message": "In the game, players are in the shoes (or shell) of Kril, the hermit crab, as they battle through enemies and explore the briny depths while collecting ocean-borne microplastics as the primary in-universe currency.\nThis could be a broken glass bottle, a plastic cup, or an empty can, with 69 to discover.\n— Out of The Blue GamesAmerican ArcadiaPlatform: SteamPuzzle game fans can check out American Arcadia, a game set in a world stuck perpetually in 1970s Americana with a strong resemblance to The Truman Show.\nRather than rehashing the classic hospital management formula, Galacticraft developer Brightrock Games opted to spice things up by having players operate a hospital in space.\nRather than rehashing the classic hospital management formula, developer Brightrock Games opted to spice things up by having players operate a hospital in space."}, {"id": "fdfd17ad-10d7-478f-b26c-815c2db3bd16", "title": "India MiG - 25 to MiG - 31 Upgrade : A Missed Opportunity or Wise Choice ? – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/indias-mig-25-to-mig-31-upgrade-a-missed-opportunity-or-wise-choice/", "message": "India’s MiG-25 to MiG-31 Upgrade: A Missed Opportunity or Wise Choice?\nHowever, this prompts an interesting comparison with the Indian Air Force’s historical use of the MiG-25 and its subsequent decision regarding the MiG-31.\nThe MiG-25, known for its exceptional speed and high-altitude capabilities, was unrivaled in South Asia.\nHowever, with advancements in remote sensing satellites and synthetic aperture radar technology, the need for manned high-altitude reconnaissance decreased.\nIndia’s decision to prioritize the Su-30MKI over the MiG-31 reflects a strategic assessment of current and future operational requirements."}, {"id": "7c5fc307-f102-420f-83e6-5409e2980dd8", "title": "Delta Force Hawk Ops features extraction mode and Black Hawk Down for alpha test in July", "date": "2024-06-08 10:30", "url": "https://venturebeat.com/latest-games-reviews/delta-force-shows-off-extraction-mode-and-black-hawk-down-for-alpha-test-in-july/", "message": "The devs of Delta Force: Hawk Ops showed off the Extraction Mode for the multiplayer modern combat game.\nIt has a global alpha test in July and you can wishlist it from Steam and the Epic Games Store.\nDelta Force Hawk Ops extraction mode.\nIt has a Delta Force Black Hawk Down mode as well where you can re-fight the ill-fated battle in Mogadishu, Somalia, as depicted in the book/film Black Hawk Down.\nI’m looking forward to a new entry in the military shooter space with the Delta Force brand, as I played the voxel-based games way back when."}, {"id": "bf51f68b-4b86-4779-a503-0576e6e22e78", "title": "Biden Publicly Apologises To Zelenskyy For Monthslong Congressional Holdup To Weapons That Let Russia Advance", "date": "2024-06-08 06:00", "url": "https://www.news18.com/world/biden-publicly-apologises-to-zelenskyy-for-monthslong-congressional-holdup-to-weapons-that-let-russia-advance-8925338.html", "message": "President Joe Biden on Friday for the first time publicly apologised to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.\n“It’s very important that in this unity, United States of America, all American people stay with Ukraine like it was during World War II,” Zelenskyy said.\nThe slow pace of delivery of pledged Western weaponry has long frustrated Zelenskyy, as has Biden’s hesitation over supplying more hardware for fear of provoking Russian President Vladimir Putin.\nThe U.S. will send about $225 million in military aid to Ukraine, Biden announced Friday.\nBiden and Zelenskyy attended the anniversary events of D-Day in Normandy, northern France, on Thursday, along with European leaders who have supported Kyiv’s efforts in the war."}, {"id": "f011ef5e-5730-4d07-a9f9-72d43a32b8b0", "title": "WWII weekend kicks off", "date": "2024-06-08 12:30", "url": "https://www.wfmz.com/news/area/berks/wwii-weekend-kicks-off/article_dfce6cc6-257b-11ef-bd40-332a0d940f60.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "55f24c79-9eca-49b1-a4e5-10ee79e9a4ef", "title": "Everything We Saw At Summer Game Fest 2024", "date": "2024-06-08 03:00", "url": "https://kotaku.com/everything-we-saw-at-summer-game-fest-2024-1851527046", "message": "AdvertisementCuffbustCuffbust World Premiere Trailer | Summer Game Fest 2024If you’re looking for some cooperative prison break action as, um, koalas?\nAdvertisementBatman: Arkham ShadowBatman: Arkham Shadow World Premiere Trailer | Summer Game Fest 2024Batman arrives in the world of VR with Arkham Shadow.\nAdvertisementBlumhouse Games ShowcaseBlumhouse Games Interview and Trailer with Jason Blum and Louise Blain | Summer Game Fest 2024Blumhouse Games offered up a sizzle reel at Summer Game Fest showcasing a variety of different spooky titles, each with delightfully hellacious horror themes and set in different genres.\nAdvertisementPhantom Blade 0Phantom Blade Zero World Premiere Trailer | Summer Game Fest 2024Phantom Blade 0 got a new trailer as the last game on stage at this year’s Summer Game Fest.\nAdvertisementAnd that wraps everything we saw at Summer Game Fest 2024."}, {"id": "d2a6b136-2368-4647-9c61-4c129eef0c14", "title": "Biden Push To End The Gaza", "date": "2024-06-08 09:30", "url": "https://www.outlookindia.com/international/bidens-push-to-end-the-gaza-war", "message": "Palestinian civilians would return to their home in all areas of Gaza.\nHumanitarian assistance would be up to 600 trucks carrying aid to Gaza every day.\nThe second phase was for Israel and Hamas would negotiate the necessary arrangements to get to a permanent end to hostilities.\n\"There are a number of details to negotiate to move from phase one to phase two.\nThe last phase of this ambitious plan was reconstruction of Gaza."}, {"id": "52d40ea8-d8fb-489a-86a8-31f11dc70c98", "title": "Biden apologizes to Zelenskyy for holdup on providing weapons", "date": "2024-06-08 00:00", "url": "https://www.theday.com/nation/20240607/biden-apologizes-to-zelenskyy-for-holdup-on-providing-weapons/", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024."}, {"id": "44cc89e8-c3c5-49c3-bedc-3ebcbfb2ffa8", "title": "It Finally Here ! news - Empires of the Undergrowth", "date": "2024-06-08 00:00", "url": "https://www.indiedb.com/games/empires-of-the-undergrowth/news/its-finally-here6", "message": "Empires of the Undergrowth’s version 1.0 is now released, featuring the Matabele ants as the final focal species of the game, as well as the termites in a co-starring role.\nThe whole campaign is now playable start to finish, along with all of its challenge modes and a greatly expanded custom game offering.\nAfter the changes, read on to see our updated roadmap, showing where we intend to take the game now it has reached version 1.0.\nTake your enhanced colony into custom games, or repeat your colony’s journey with tougher challenges in New Game Plus - but this time you can take your formicarium upgrades into the mission with you!\nAnd if this is your first time playing Empires of the Undergrowth, welcome."}, {"id": "ba1e84c0-1087-443e-8157-eeeff26e6f6b", "title": "SaGa Emerald Beyond Switch physical release with English", "date": "2024-06-08 13:00", "url": "https://nintendoeverything.com/saga-emerald-beyond-getting-physical-release-in-asia-with-english-support-pre-orders-open/", "message": "If you’ve been holding out for a physical version of SaGa Emerald Beyond, we’re happy to report that you’ll soon be happy to add a copy to a collection.\nSaGa Emerald Beyond first came to Switch this past April.\nA Story of Your Very Own Making: SaGa Emerald Beyond has the greatest number of branching plots of any game in the SaGa series.\nBattles where a Single Choice Can Change Everything: SaGa Emerald Beyond further refines the highly strategic Timeline Battles the SaGa franchise has been long renowned for.\nPre-orders for the new SaGa Emerald Beyond Switch physical release are open here with a ship date of July 12, 2024."}, {"id": "bbf37c81-5543-407f-9cdb-440ce5e47ffd", "title": "Congressman Jason Crow reenacts World War II parachute jump on D - Day", "date": "2024-06-08 04:15", "url": "https://www.cbsnews.com/colorado/news/congressman-jason-crow-reenacts-world-war-ii-parachute-jump-d-day/", "message": "Colorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayAs Americans continue to recognize the fallen members of D-Day from World War II, Congressman Jason Crow, an Army combat veteran who served in the 82nd Airborne Division and 75th Ranger Regiment, reenacted the parachute jump of D-Day in Normandy, France 80 years later.\nCBSCrow is currently in Normandy and was alongside 41 WWII veterans, honoring the sacrifice of the service members on D-Day.\nOn Friday with a bipartisan delegation of Congressional veterans, Crow jumped out of a WWII-era plane to honor those who made that same jump behind enemy lines 80 years ago.\nCrow issued a statement on the reenacted jump saying:\"Today, we remember thousands of America's best who were willing to give everything to defend freedom and democracy at home and abroad.\nNow, it's on us to honor their service and recommit to the values they fought to defend — freedom, equality, and democracy.\""}, {"id": "ae8525a0-eb18-41f9-aa79-dbbb4647edc4", "title": "Delta Force : Hawk Ops hands - on preview – the original military shooter", "date": "2024-06-08 02:45", "url": "https://metro.co.uk/2024/06/07/delta-force-hawk-ops-hands-on-preview-original-military-shooter-20992107/", "message": "Delta Force: Hawk Ops – a blast from the past (Tencent)A modern multiplayer shooter with a late 90s heritage, the new Delta Force aims to make Chinese publisher Tencent a major force in the West.\nDelta Force: Hawk Ops is an attempt to recreate the vibe of NovaLogic’s games using modern technology.\nHawk Ops is Tencent’s first weapon in a (some would say overdue) bid to launch itself into the consciousness of gamers beyond China.\n‘But in the triple-A PC and console titles, we hope that Delta Force: Hawk Ops will be the first big success for us.\nMORE : Best new mobile games on iOS and Android – May 2024 round-upMORE : Best new mobile games on iOS and Android – April 2024 round-upMORE : Best new mobile games on iOS and Android – March 2024 round-up"}, {"id": "d921b8d3-f98a-4203-a833-ddf948ed573b", "title": "Flags of our fathers resonate today", "date": "2024-06-08 04:00", "url": "https://www.unionleader.com/news/social_issues/flags-of-our-fathers-resonate-today/article_1ba462be-2414-11ef-9216-0b726ef1ec82.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "eb6c928d-35a6-4816-9ecc-de186011c8bc", "title": "Israeli forces batter central and south Gaza as tanks advance in Rafah", "date": "2024-06-08 03:30", "url": "https://www.japantimes.co.jp/news/2024/06/08/world/politics/israeli-forces-batter-gaza/", "message": "With a renewed cease-fire push in the eight-month-old Gaza war stalled, Israel bombarded central and southern areas again on Friday, killing at least 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nU.S.-backed Qatari and Egyptian mediators have tried again this week to reconcile clashing demands preventing a halt to the hostilities, a release of Israeli hostages and Palestinians jailed in Israel, and an unrestricted flow of aid into Gaza to alleviate a humanitarian disaster.\nBut sources close to the talks said there were still no signs of a breakthrough.\nA month after rumbling into Rafah in what Israel said was an assault to wipe out Hamas' last intact combat units, tank-led forces have advanced to the southwest fringes of the city that skirts the Gaza Strip's border with Egypt, residents said."}, {"id": "e59ae4b4-80c7-44b2-86e6-5394cc404330", "title": "Kingdom Come : Deliverance II Gets Saints and Sinners Trailer", "date": "2024-06-08 01:45", "url": "https://www.vgchartz.com/article/461336/kingdom-come-deliverance-ii-gets-saints-and-sinners-trailer/", "message": "Kingdom Come: Deliverance II Gets Saints and Sinners Trailer - News/ 335 Viewsby, posted 16 hours agoPublisher Deep Silver and developer Warhorse Studios have released a new trailer for the action RPG, Kingdom Come: Deliverance II, called Saints and Sinners.\nView the trailer below:Read details on the game below:Kingdom Come: Deliverance II is a thrilling action RPG, set amid the chaos of a civil war in 15th Century Bohemia.\nFrom bustling city streets to lush forests, discover this open-world Medieval Europe through an unforgettable adventure filled with action, thrill and wonder.\nA True RPG ExperienceYour actions shape Henry’s destiny and how the world will react to him.\nOn foot, horse or by stealth, you can specialize in elegant sword mastery, brutal blunt weapons or deadly ranged attacks."}, {"id": "31bc1c4c-4cec-4edc-8b81-54bdd6a236a4", "title": "Web of control", "date": "2024-06-08 03:30", "url": "https://www.thenews.com.pk/print/1197975-web-of-control", "message": "Icons of the popular social media platforms seen in this undated photo.\nPrevious actions – blocking of specific websites and social media platforms as well as restrictive and regressive legislation – had already raised alarms about government overreach.\nAnd instead of physical and tangible operations we now have info-warfare – all on social media.\nIn fact, starting with PECA, it has been one bad legislation after another when it comes to social media or anything linked to social media.\nWhether the PML-N or the PTI, both governments have been enthusiastic about curbing social media influence."}, {"id": "20e13534-62fe-4208-9f25-93df1fbf3be6", "title": "China Soaring Ambitions Clipped : Why Dragon Fighter Jets Struggle for Takeoff – Indian Defence Research Wing", "date": "2024-06-08 13:00", "url": "https://idrw.org/chinas-soaring-ambitions-clipped-why-dragons-fighter-jets-struggle-for-takeoff/", "message": "China’s Soaring Ambitions Clipped: Why Dragon’s Fighter Jets Struggle for Takeoff| BySOURCE: AFIChina’s rise as a military power includes a growing presence in the arms trade.\nHowever, despite significant economic and military advancements, China’s ambitions in the high-end fighter jet market haven’t quite hit the mark.\nChina’s J-10 and J-20 fighter jets appear impressive on paper, with the J-20 often compared to the top-of-the-line US F-22 Raptor and F-35.\nChina faces an uphill battle in the fighter jet market due to:Quality Concerns: Unproven capabilities compared to established players.\nOnly by addressing these challenges can China hope to truly take flight in the global fighter jet market."}, {"id": "e68447d6-53d3-4631-8b4a-683a446bf772", "title": "Ukraine drone attack reported deep into Russian territory", "date": "2024-06-08 10:30", "url": "https://www.prokerala.com/news/articles/a1537887.html", "message": "Moscow, June 8 : - Ukraine attacked Russian targets with a total of 25 combat drones overnight, according to the Defence Ministry in Moscow, with one drone said to have reached deep into the Russian Caucasus.\nThe Russian ministry said the drones were intercepted in the border regions of Rostov, Bryansk and Belgorod, as well in Russian-occupied Crimea.\nA Ukrainian drone also apparently penetrated the republic of North Ossetia in Russia's Caucasus.\nWhether all Ukrainian drones were actually shot down by Russian air defences could not be independently verified.\nAs a practice, the Russian Defence Ministry does not provide any information about drones that hit their target."}, {"id": "5b645303-3914-4de4-96db-480ff761b6d4", "title": "Navigating the Tensions : US Policy on Ukraine - Russia Conflict Amidst Escalation Fears", "date": "2024-06-08 06:30", "url": "https://trendydigests.com/2024/06/08/navigating-the-tensions-us-policy-on-ukraine-russia-conflict-amidst-escalation-fears/", "message": "However, amidst Ukraine’s pressing needs and the backdrop of Russian President Vladimir Putin’s veiled nuclear threats, the Biden administration’s policy has been subject to intense scrutiny and gradual shifts.\nThe recent decision by the US administration to allow Ukraine to use American-supplied weapons to strike targets within Russia marks a significant, albeit careful, policy escalation.\nDespite the risks, Ukraine’s attacks on Russian territory have raised concerns over the potential of nuclear escalation.\nThis nuanced approach underscores the administration’s attempt to balance between aiding Ukraine and restraining the conflict from spiraling into a broader war.\nAs the war progresses and Ukraine’s needs evolve, the policy has adapted, often incrementally, to the demands of the battlefield."}, {"id": "7c760a61-168b-4fc8-9c1e-5198cc0004ca", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:00", "url": "https://isp.netscape.com/news/story/0001/20240608/10644ab8a4790794e810ace300cef418", "message": "Black D-Day combat medic's long-denied medal tenderly laid on Omaha Beach where he bled, saved livesOMAHA BEACH, France (AP) — A medal richly deserved but long denied to an African American combat medic wounded on Omaha Beach in the D-Day landings was tenderly laid Friday on the hallowed sands where he saved lives and shed blood.\nThe medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "3d289159-719b-4332-b684-d1bba7848e1e", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-08 01:45", "url": "https://www.asahi.com/ajw/articles/15297954", "message": "FILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "44f39348-d504-4035-9ab0-129ad89ef069", "title": "Putin warns Europe is  defenceles against his nuclear weapons", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/putin-warns-europe-defenceless-against-114037883.html", "message": "Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nThe key developments were:Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nHer comments to state news agency RIA followed a statement from Russian president Vladimir Putin on Friday that the country could make adjustments to its nuclear doctrine.\n10:17 AM BSTRussia destroys three Ukrainian drones over North Ossetia, local head saysRussian air defence units destroyed three Ukrainian drones on Saturday in Russia’s town of Mozdok in the Republic of North Ossetia–Alania, regional head Sergey Meniaylo said.\nMr Poroshenko served as Ukrainian president between 2014 and 2019, and has remained a prominent figure in the country since leaving office."}, {"id": "8ddad0b6-ee82-4f94-9576-3e306bbb4e2d", "title": "Putin warns Europe is  defenceles against his nuclear weapons", "date": "2024-06-08 13:00", "url": "https://www.aol.com/putin-warns-europe-defenceless-against-114037902.html", "message": "Vladimir Putin at the St. Petersburg International Economic Forum - Artem Priakhin/SOPA Images/ShutterstockVladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nThe key developments were:Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nHer comments to state news agency RIA followed a statement from Russian president Vladimir Putin on Friday that the country could make adjustments to its nuclear doctrine.\n10:17 AM BSTRussia destroys three Ukrainian drones over North Ossetia, local head saysRussian air defence units destroyed three Ukrainian drones on Saturday in Russia’s town of Mozdok in the Republic of North Ossetia–Alania, regional head Sergey Meniaylo said.\nMr Poroshenko served as Ukrainian president between 2014 and 2019, and has remained a prominent figure in the country since leaving office."}, {"id": "3a339ff5-44ea-457a-a115-b00015803af6", "title": "The hype backfires : India surprise vote result | India Election 2024", "date": "2024-06-08 12:45", "url": "https://www.aljazeera.com/program/the-listening-post/2024/6/8/the-hype-backfires-indias-surprise-vote-result", "message": "The surprise election result in India leaves the BJP and Prime Minister Narendra Modi missing a chunk of voter support and at the helm of a tricky coalition.\nContributors:Nishtha Gautam – Columnist, NDTVSreenivasan Jain – Host, The India ReportMukul Kesavan – Historian and novelistFatima Khan – Journalist, The QuintOn our radar:Amid the European parliamentary election, a battle against misinformation continues between the European Union and Russia.\nMeenakshi Ravi reports on how Moscow could be behind a campaign to misinform and discourage European voters.\nIsrael’s cultural annihilation in GazaThe Listening Post has covered Israel’s war on Gaza through the prism of the media, including the unprecedented killing of Palestinian journalists.\nBut there is another level to what is unfolding in Gaza: the genocidal assault on Palestinian history, existence and culture."}, {"id": "461700c0-c18c-4a17-8c40-61e877d918c2", "title": "Warhammer vet  grimdark femme miniatures Kickstarter shatters goal", "date": "2024-06-08 00:15", "url": "https://www.polygon.com/24173689/john-blanche-morderin-grimdark-femmes-kickstarter-release-date-price", "message": "John Blanche left an indelible mark on science fiction, high fantasy, and the world of gaming as a whole with his iconic art depicting the Warhammer and Warhammer 40,000 universes.\nNow, after 46 years at Games Workshop, he’s stepping out on his own with a new line of miniatures.\nLaunched quietly on Tuesday, the Kickstarter campaign for his inaugural Mörderin line launched with four exquisite “grimdark femmes miniatures.” Unsurprisingly, the project has crushed its funding goal.\nGrid View Image: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheThe Mörderin line began as a series of Blanche artworks, rendered in his unique style with its graceful lines and deep shadows.\nFor this project, Blanche’s figures are being produced by Zealot Miniatures in Siocast thermoplastic."}, {"id": "84194a36-3593-49ca-83c1-95cc87391242", "title": "Biden , Macron and Zelensky escalate war threats against Russia at D - Day commemoration", "date": "2024-06-08 04:45", "url": "https://www.wsws.org/en/articles/2024/06/08/aizj-j08.html", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky in Paris, Friday, June 7, 2024.\n[AP Photo/Evan Vucci]The day after the official commemoration of the 80th anniversary of the Allies’ D-Day landings in Normandy during World War II, Ukrainian President Volodymyr Zelensky met US President Joe Biden and French President Emmanuel Macron for continuing ceremonies in France.\nThese meetings come at a dangerous point in the two-year-old war between NATO and Russia in Ukraine.\nThe invocations of the Normandy landings to justify the NATO war with Russia are political lies based on historical falsifications.\nNevertheless, over the course of yesterday, Biden and Macron announced vast new grants of weapons to the Ukrainian army to escalate the war with Russia."}, {"id": "86ab92a2-2215-419a-8a88-09e9c3fc5efd", "title": "Israeli , Palestinian envoys praise Pope prayer for peace", "date": "2024-06-08 11:15", "url": "https://cruxnow.com/vatican/2024/06/israeli-palestinian-envoys-praise-popes-prayer-for-peace", "message": "ListenROME – Israeli and Palestinian envoys to the Holy See have applauded Pope Francis’s prayer for peace in the Vatican gardens Friday, commemorating a similar event held 10 years ago, with both calling the initiative symbolic and illustrative of the pope’s commitment to ending the Gaza war.\nOn that occasion, Peres and Abbas jointly planted an olive tree in a symbolic gesture of peace.\nIn November, 105 of the hostages were released during a week-long truce, however, around 120 remain unaccounted for, with Israeli officials stating that many are presumed dead.\nHe called for a ceasefire, for the release of Israeli hostages “as soon as possible,” and asked that access to humanitarian aid be guaranteed in Gaza.\nIn this way may peace triumph at last, and may the words ‘division,’ ‘hatred’ and ‘war’ be banished from the heart of every man and woman,” he said."}, {"id": "eb22e961-3dca-49cd-91eb-af8cda261f8c", "title": "Ukraine Joining NATO Would Weaken Biden Reelection Chances", "date": "2024-06-08 14:00", "url": "https://www.businessinsider.com/ukraine-joining-nato-would-weaken-bidens-reelection-chances-2024-6", "message": "Read previewUS President Joe Biden appears to have drawn a line beneath Ukraine's bid for NATO membership.\nHowever, refusing to move forward with an accelerated membership plan leaves Ukraine's hopes for NATO membership in the lurch.\nRelated storiesFor now, Ukraine has to settle for a range of \"security guarantees.\"\nMeister said these packages will provide Ukraine with \"more reliable long-term military and security support by NATO member states.\"\n\"Without NATO membership for Ukraine, security guarantees for Ukraine are blatant lies,\" Canadian analyst Michael MacKay wrote on X."}, {"id": "442c00c9-c9b1-43a5-8028-d1b3150f7a6d", "title": "The Crusader - Era Knights Who Volunteered to Fight World War I", "date": "2024-06-08 14:15", "url": "https://www.military.com/history/crusader-era-knights-who-volunteered-fight-world-war-i.html", "message": "Less than a year after the Russian Empire entered World War I, a band of Georgian men came down from the Caucasus Mountains.\nAt the onset of World War I, the Russian Empire was massive.\nAn estimated 200,000 Georgians were mobilized to fight in World War I in the Russian Army.\nArmor was a common sight on the battlefields of World War I. Broadswords weren't so much.\n(Metropolitan Museum of Art) Armor was a common sight on the battlefields of World War I. Broadswords weren't so much."}, {"id": "473dd138-5ef6-41c6-b707-8a4f31e9d4fb", "title": "Putin Calls  Bulls ** t  On  Plan To Attack NATO , Says He Not Brandishing Nuclear Arms", "date": "2024-06-08 14:00", "url": "https://www.zerohedge.com/geopolitical/putin-calls-bullst-plans-attack-nato-says-hes-not-brandishing-nuclear-arms", "message": "Officials in the UK, Germany, and France have of late signaled to their populations that Europe must be 'war ready' and on a war footing.\nSome have even claimed that Russia is readying to attack NATO countries and that it seeks to expand the conflict beyond Ukraine.\nThere’s nothing to these scary stories, intended for the townsfolk in Germany and France and elsewhere in Europe,\" Putin explained.\nHe explained that nothing has changed in Russia's nuclear doctrine, saying that nuclear weapons usage is only possible in \"exceptional cases\".\nThe only country on Earth to ever use nuclear weapons is the United States."}, {"id": "c7400391-6875-4a08-80dd-4c4bc1e456ef", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:15", "url": "https://www.clickondetroit.com/news/national/2024/06/07/black-d-day-combat-medics-long-denied-medal-tenderly-laid-on-omaha-beach-where-he-bled-saved-lives/", "message": "The medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nThe soldiers all saluted, still and quiet under blue skies, when U.S. First Army Command Sgt.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "af243a87-d50b-4196-881d-517b40f14204", "title": "101st Birthday Party | News , Sports , Jobs - The Intermountain", "date": "2024-06-08 12:15", "url": "https://www.theintermountain.com/news/local-news/2024/06/101st-birthday-party/", "message": "DAILEY — Randolph County resident Juanita Morgan, a former Rosie the Riveter, recently celebrated her 101st birthday at a family member’s home in Dailey.\nThe three members from Our Town dressed in full Rosie attire to help celebrate the special occasion.\n“We had a wonderful time visiting Juanita and her family in Dailey,” Trimboli told The Inter-Mountain.\nMorgan worked alongside her sister and future sister-in-law at the facility, where she was a riveter on B-29 airplanes.\nBoth sons attended the 101st birthday party with their wives and Morgan’s five grandchildren and three great grandchildren."}, {"id": "1e323963-60ee-4d04-96ad-57b718992176", "title": "Zelenskyy welcomes French promises of warplanes to help fight Russia", "date": "2024-06-08 00:30", "url": "https://www.foxnews.com/world/zelenskyy-welcomes-french-promises-warplanes-help-fight-russia", "message": "Ukrainian President Volodomyr Zelenskiy said on Friday he hoped to see French-supplied warplanes in Ukrainian skies soon after President Emmanuel Macron said France planned to provide it Mirage 2000-5 fighter jets.\nFRENCH WARPLANES AND TRAININGThe Mirage 2000-5 is a multi-role, single-engine jet fighter.\nNo, because we have no right to lose,\" Zelenskiy told the lawmakers.\nCLICK HERE TO GET THE FOX NEWS APPUkraine's military leaders admit that the battlefield situation on the eastern front has deteriorated.\nTwo years of war have sapped Ukraine's ammunition and manpower and a failed counter-offensive last year sank morale."}, {"id": "00049513-173f-41eb-a43b-4e16933037b0", "title": "A bottle of blood serum from the 1940s gives researchers hope to save lives on battlefields of the 2020s", "date": "2024-06-08 12:00", "url": "https://www.theglobeandmail.com/canada/article-a-bottle-of-blood-serum-from-the-1940s-gives-researchers-hope-to-save/", "message": "What remains is blood serum, a yellowish fluid containing additional proteins, such as albumin and other beneficial constituents.\nIn addition, freeze-dried blood plasma, now regarded as preferable to blood serum, can be purchased from international suppliers should the need arise.\nBeyond the military, a made-in-Canada freeze-dried blood product could also be useful for emergency responders serving remote areas across the country, he added.\nWithin the display, he could see what appeared to be a bottle of the original 1940s-era blood product.\nThey also prepared fresh blood serum from the pooled, donated blood of 10 people to act as a control."}, {"id": "6b34a562-c87f-4237-aed3-a911c6234699", "title": "Deadly landmines pose hidden threat in Libyan capital", "date": "2024-06-08 01:00", "url": "https://www.citizen.co.za/news/news-world/deadly-landmines-hidden-threat-libya/", "message": "Deadly landmines pose hidden threat in Libyan capitalThe southern suburbs, where three children were injured, have been the 'scene of all wars since 2011 until today'.\nHundreds of deadly landmines and unexploded ordanance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\n(Photo by Mahmud TURKIA / AFP)Hundreds of deadly landmines and unexploded ordnance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\nThe southern suburbs, where the three children were injured, have been the “scene of all wars since 2011 until today”, said Farhat.\nBut it will come too late for Farhat’s son Mohamed, who was wounded in the head by shrapnel from the blast."}, {"id": "de5fc941-119a-4a5e-9c7b-c0b6f00a09d1", "title": "From crusaders to bankers", "date": "2024-06-08 08:15", "url": "https://tribune.com.pk/story/2470336/from-crusaders-to-bankers", "message": "The Middle Ages have provided the history enthusiasts with a story that can hardly be rivaled — the story of the Knights Templar.\nThe history of the Knights Templar can be traced back to the early half of the twelfth century, following the sack of Jerusalem in 1099.\nThey also provided banking to fellow crusaders and travellers to protect their money and wealth and facilitate the transfer of capital.\nThe Order of the Knights Templar became extremely wealthy and powerful, as they were granted the responsibility of protecting the holy land.\nHowever, the growth of the Knights Templar was going to be sure to bring out the resistance of other religious orders and kings."}, {"id": "6ba58a15-a839-49ed-bc78-686d37269df1", "title": "The door is staying shut on Ukraine joining NATO because it would weaken Biden chances of getting reelected", "date": "2024-06-08 14:15", "url": "https://www.yahoo.com/news/door-staying-shut-ukraine-joining-130419079.html", "message": "The door is staying shut on Ukraine joining NATO because it would weaken Biden's chances of getting reelectedThe door is staying shut on Ukraine joining NATO because it would weaken Biden's chances of getting reelectedBiden has rejected Ukraine's NATO membership bid as part of a peace agreement.\nUS President Joe Biden appears to have drawn a line beneath Ukraine's bid for NATO membership.\nEarlier this week, a report by the Financial Times revealed that Ukraine's lack of progress toward NATO membership was a key issue creating tension in US-Ukrainian relations.\nHowever, refusing to move forward with an accelerated membership plan leaves Ukraine's hopes for NATO membership in the lurch.\n\"Without NATO membership for Ukraine, security guarantees for Ukraine are blatant lies,\" Canadian analyst Michael MacKay wrote on X."}, {"id": "14115b82-39c2-4841-8310-1b5772d5a2eb", "title": "Donald Trump says media scrutiny affecting son Barron", "date": "2024-06-08 08:00", "url": "https://www.thenews.com.pk/latest/1198197-donald-trump-says-media-scrutiny-affecting-son-barron", "message": "— Reuters/FileFormer United States president Donald Trump said his hush-money trial and the media scrutiny are affecting his 18-year-old son, Yahoo reported.\nEarlier in an interview with Fox, talking about his family, Trump said: \"I think in many ways it's tougher on my family than it is on me.\"\nTrump, who is the Republican presidential nominee, stated before the election that he feels his family wants him to take on the challenge.\nThe ex-president said that he believes his family wants him to fight the battle.\nMy family loves this country, and I think they feel I do a good job,\" said Trump."}, {"id": "0b657a9a-2f28-407e-b123-8797847185aa", "title": "This Tank Weighs Just Over 8 Tons : The Lightest Tanks in Today Militaries", "date": "2024-06-08 06:15", "url": "https://biztoc.com/x/fc3508b21538e190", "message": "Modern tanks are frightening machines, capable of dominating a battlefield.\nSince their invention, these armored combat vehicles have been used in various ways, from breaking up enemy lines to making it easier to drop allies into the middle of battle.\nWhile heavy tanks are intimidating and full of fighting power, there are lighter versions that serve a slightly different…This story appeared on 247wallst.com , ."}, {"id": "113735a6-9530-4eec-b776-36aef5301904", "title": "Biden to meet Macron after D - Day democracy warnings", "date": "2024-06-08 02:15", "url": "https://www.yahoo.com/news/biden-meet-macron-d-day-014913186.html", "message": "French President Emmanuel Macron welcomed Joe Biden at Paris' Arc de Triomphe at the start of the US leader's state visit to France on Saturday as the two nations seek to tighten ties.\nBiden has been in France since Wednesday and took part in this week's commemorations marking the 80th anniversary of the D-Day landings that changed the course of World War II.\nDuring a welcome ceremony in Paris, Macron and Biden laid a wreath and rekindled the flame on the tomb of the Unknown Soldier.\nMeeting Zelensky in Paris, Biden pledged his support for Ukraine and announced another $225 million in aid to Kyiv.\nZelensky thanked him for the \"tremendous support\", comparing it to the United States coming to Europe's aid during World War II."}, {"id": "746388b0-af49-415e-8cf6-f88efbdbb6f4", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 13:15", "url": "https://www.newsday.com/news/nation/dday-anniversary-war-wedding-normandy-terens-swerlin-a08414", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nWorld War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nWorld War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle."}, {"id": "6e562c44-73e5-4571-8570-68d1e9cde981", "title": "Felixstowe author : the 6 stars you never knew served in WWII", "date": "2024-06-08 11:15", "url": "https://www.eadt.co.uk/news/24371051.felixstowe-author-6-stars-never-knew-served-wwii/", "message": "Mr Tancred tasted success in successive Commonwealth Games, winning a bronze medal at the 1970 tournament and then silver medal in 1974.\nA young Bill Tancred pictured centre, with Sebastian Coe, now Lord Coe, to his right.\n(Image: Bill Tancred) Bill Tancred being made an MBE by the later Elizabeth II in 1992.\nAfter nine months of research, Mr Tancred is now ready to share the stories of almost 100 stars who served their country in some way.\nTo buy a copy of Mr Tancred’s book, visit Stillwater Books in Hamilton Road, Felixstowe, or email Mr Tancred at: billtancred@gmail.com"}, {"id": "79297e3a-481d-4245-add7-713c338b68ec", "title": "Switch eShop charts - June 8 , 2024", "date": "2024-06-08 09:00", "url": "https://nintendoeverything.com/switch-eshop-charts-june-8-2024/", "message": "This week’s Switch eShop charts are as follows:All Games1.\nLittle Kitty, Big City5.\nSuper Mario Bros. Wonder10.\nMario Party Superstars13.\nLittle Kitty, Big City3."}, {"id": "b5566b6f-0886-4182-b3e7-3efcb2114c86", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army | Ethics", "date": "2024-06-08 07:45", "url": "https://www.theguardian.com/world/article/2024/jun/08/you-cant-fight-your-way-to-peace-from-a-20-year-old-israeli-to-a-99-year-old-briton-eight-conscientious-objectors-on-why-they-refused-to-serve-in-the-army", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "64028419-293d-4908-8fdd-8080c3bece43", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army", "date": "2024-06-08 08:00", "url": "https://www.aol.co.uk/news/t-fight-way-peace-20-070040266.html", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "c865b8d8-1bcc-4a96-bb07-500e82dc37f1", "title": "Putin  sent by God to save humans from WW3 , dictator crony claims in chilling rant", "date": "2024-06-08 13:45", "url": "https://www.dailystar.co.uk/news/world-news/putin-sent-god-save-humans-32987684", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nNot only to win but also to save the world which is sliding and being pushed into a World War.\"\nIn attempts to get the Russian people to stay loyal to Putin, minion Patriarch Kirill went on TV and preached: \"Let God save the Russian soil."}, {"id": "66fa2113-acdc-4ad5-a73d-29cc05995b53", "title": "The End Of BLHeli _ 32 : Long Live AM32 ? ", "date": "2024-06-08 09:00", "url": "https://hackaday.com/2024/06/07/the-end-of-blheli_32-long-live-am32/", "message": "As the ESC determines a lot of the performance characteristics of a drone, it has its own firmware, which for (FPV) drones is overwhelmingly BLHeli, specifically the 32-bit version (BLHeli_32).\nNow the Norwegian company (BLHeli AS) behind this closed source firmware has thrown in the towel, citing illegal use of its firmware by sanctioned countries like Russia for purposes like warfare.\nSo far the GitHub repository is still online, featuring binary images for BLHeli_32, as well as the open source BLHeli (8-bit Atmel/Silabs) firmware and BLHeli_S (multirotor 8-bit Silabs) firmware.\nDue to the open source nature of these earlier projects forks already exist, such as BlueJay for BLHeli_S, and with the AM32 project there is an open source 32-bit ESC alternative.\nFor 8-bit platforms it would thus seem that even with BLHeli_32 vanishing there is no impact at all, while for 32-bit platforms AM32 seems to be largely a drop-in solution."}, {"id": "5adfbfb3-ce18-41dc-9f3f-eee7d623aa5c", "title": "India to Rename Tibetan Locations in Retaliation for Arunachal Pradesh Dispute – Indian Defence Research Wing", "date": "2024-06-08 13:00", "url": "https://idrw.org/india-renames-tibetan-locations-in-retaliation-for-arunachal-pradesh-dispute/", "message": "India to Rename Tibetan Locations in Retaliation for Arunachal Pradesh Dispute| BySOURCE: AFIIn a tit-for-tat move, India is set to rename over two dozen locations within China’s Tibet Autonomous Region.\nThis action comes in response to China’s recent renaming of places in India’s Arunachal Pradesh state.\nIndia suspects China’s renaming of locations in Arunachal Pradesh is a deliberate attempt to solidify its territorial claim on the region, which China refers to as Zangnan or “southern Tibet.”The Indian Army’s information warfare division is spearheading this effort.\nThe renaming strategy highlights the escalating tensions between India and China over disputed border territories.\nWhile the effectiveness of this approach remains to be seen, it signifies a rising assertiveness from India in its response to China’s actions."}, {"id": "ae4c848d-d0dd-4036-ac31-79a744f54034", "title": "The Verdict", "date": "2024-06-08 01:45", "url": "https://www.independent.com/2024/06/07/the-verdict/", "message": "For a few on January 6, 2021, it was trauma and death, Donald Trump’s first open assault on the Republic.\nHe will debase and tear apart any cornerstone or guidepost of this nation to regain his access to power.\nDid the Republicans, in 2020, follow the Constitution and the law, excepting without malice the election results?\nOr did they attack the law, incited by the criminal deceit of Donald Trump, as he’s doing today?\nAny person, public voice, entity, or institution opposing or speaking out against Donald Trump will be hounded and persecuted and punished."}, {"id": "085d5ff8-e410-4fd1-a929-1f9b31dace6a", "title": "Glen Ridge pays tribute to the fallen", "date": "2024-06-08 13:15", "url": "https://essexnewsdaily.com/arts/glen-ridge-pays-tribute-to-the-fallen", "message": "Glen Ridge held its annual Memorial Day parade Monday, May 27.\nThe flag on the Ridgewood Avenue School grounds was raised to half-staff and the steadfast Sharon DeRosa Smolen sang an evocative national anthem.\nHe was followed by a selection played by the Glen Ridge High School Band, bronze medalists in the 2023 national championships.\nA reading of the names of borough residents who died in combat were read and wreaths were placed.\nOh, Lord,” he said, “the names we heard were of people who tried to fix a broken world."}, {"id": "c71cef81-2ec4-43eb-aead-62b8ea288c5a", "title": "Syrian rebels sent to Africa to guard mines and businesses", "date": "2024-06-08 09:45", "url": "https://www.middleeasteye.net/news/syrian-rebels-deployed-africa-guard-mines-and-businesses-islamic-state", "message": "Syrian rebels have been hired to fight and provide security at gold mines and factories in African countries, several rebel sources told Middle East Eye this week.\nTurkey to send Syrian rebel fighters to battle Haftar in Libya Read More »The rebels gave conflicting accounts of how many SNA factions were involved and how many fighters were deployed.\nHowever, they confirmed that at least five SNA groups have directed their fighters and some commanders to the three African countries.\n“Commanders who gain power and money from missions abroad have moved away from the revolution and established their small empires,” he told MEE.\n“The missions outside Syria weaken the political representation of the Syrian opposition as well as its legitimacy in the public eye.”"}, {"id": "88a8f245-ef9d-4878-845f-0deb9aba03f2", "title": "Hyper Light Breaker Releases in Early Access in Late Summer for PC", "date": "2024-06-08 01:45", "url": "https://www.vgchartz.com/article/461331/ublisher-arc-games-and-developer-heart-machin/", "message": "Hyper Light Breaker Releases in Early Access in Late Summer for PC - News/ 515 Viewsby, posted 15 hours agoPublisher Arc Games and developer Heart Machine announced the roguelite action game, Hyper Light Breaker, will launch in Early Access for PC via Steam in late Summer 2024.\n\"We’re thrilled to be a part of Summer Game Fest and reveal to millions of people around the world that Hyper Light Breaker will be releasing in Early Access later this summer,\" said Heart Machine founder and creative director Alx Preston.\nView the Summer Game Fest trailer below:Read details on the game below:From Heart Machine, the award-winning team behind critically-acclaimed titles Hyper Light Drifter and Solar Ash, comes Hyper Light Breaker, a new cooperative roguelite adventure set in the beloved Hyper Light Drifter universe.\nHyper Light Breaker is a brand-new entry in the Hyper Light franchise, with a unique story fully realized in 3D for the first time.\nSet decades prior to Drifter, Hyper Light Breaker has you take on the role of a Breaker, a mercenary tasked with entering the Overgrowth."}, {"id": "4b0d99df-9a97-4080-b853-a2c3a23c613c", "title": "Hyper Light Breaker Releases in Early Access in Late Summer for PC", "date": "2024-06-08 04:45", "url": "https://www.vgchartz.com/article/461331/hyper-light-breaker-releases-in-early-access-in-late-summer-for-pc/", "message": "Hyper Light Breaker Releases in Early Access in Late Summer for PC - News/ 517 Viewsby, posted 15 hours agoPublisher Arc Games and developer Heart Machine announced the roguelite action game, Hyper Light Breaker, will launch in Early Access for PC via Steam in late Summer 2024.\n\"We’re thrilled to be a part of Summer Game Fest and reveal to millions of people around the world that Hyper Light Breaker will be releasing in Early Access later this summer,\" said Heart Machine founder and creative director Alx Preston.\nView the Summer Game Fest trailer below:Read details on the game below:From Heart Machine, the award-winning team behind critically-acclaimed titles Hyper Light Drifter and Solar Ash, comes Hyper Light Breaker, a new cooperative roguelite adventure set in the beloved Hyper Light Drifter universe.\nHyper Light Breaker is a brand-new entry in the Hyper Light franchise, with a unique story fully realized in 3D for the first time.\nSet decades prior to Drifter, Hyper Light Breaker has you take on the role of a Breaker, a mercenary tasked with entering the Overgrowth."}, {"id": "2589a922-6665-419b-accf-a48009b79547", "title": "GRSE Ventures into Autonomous Platforms Across Surface , Subsurface , and Aerial Domains – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/grse-ventures-into-autonomous-platforms-across-surface-subsurface-and-aerial-domains/", "message": "GRSE Ventures into Autonomous Platforms Across Surface, Subsurface, and Aerial Domains| BySOURCE: AFIGarden Reach Shipbuilders & Engineers Limited (GRSE), a leading Indian shipbuilding company, has announced significant advancements in the development of autonomous platforms across all three domains of operation: surface, subsurface, and aerial.\nGRSE’s foray into autonomous technology has already yielded promising results in the surface and subsurface domains.\nOne of the standout achievements in the surface domain is the successful prototype of an autonomous surface vessel.\nThese aerial platforms will further augment the operational capabilities of the Indian Armed Forces, providing crucial support in maritime surveillance and reconnaissance missions.\nGRSE recognizes the transformative potential of autonomous platforms in modern warfare."}, {"id": "6aeb3a6b-88b8-4ba2-acad-e1792fde68d2", "title": "U . S . Confronts Failures as Terrorism Spreads in West Africa", "date": "2024-06-08 09:45", "url": "https://news.yahoo.com/news/u-confronts-failures-terrorism-spreads-123238984.html", "message": "This kind of holistic approach has been tried before with limited success, and U.S. officials and independent West Africa specialists say it faces steep hurdles now.\nThe West has long been seen as projecting its own problems onto the Sahel, said Ornella Moderan, a Geneva-based researcher and policy adviser focused on politics and security in West Africa.\nU.S. diplomats and military officials protested this spring and criticized the military government for failing to map out a path to return to democracy.\nOur narrative is still, ‘Hey, we’re here to help.’”The military takeover in Niger upended years of Western counterterrorism efforts in West Africa.\nThat Africa Command conducted three overlapping military exercises, including Flintlock, in Ghana in the past few weeks underscores how much Washington is pinning its security hopes on coastal West Africa."}, {"id": "1e2d25d0-94f2-4c08-b741-9be018f4de79", "title": "Biden to meet Macron after D - Day democracy warnings", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193925", "message": "PARIS, June 8, 2024 (BSS/AFP) - US President Joe Biden was to meet his French counterpart Emmanuel Macron Saturday on a state visit to France, after warning of the need to preserve American democracy and live up to the example of World War II heroes.\nBiden is due to meet Macron for talks at the Elysee Palace in Paris followed by a state banquet given in his honour, with Ukraine's battle against the Russian invasion the dominant topic.\n\"The rangers who scaled this cliff did not know they would change the world but they did,\" said Biden.\nMeeting Zelensky in Paris after the speech, Biden pledged his support for Ukraine and announced another $225 million in aid to Kyiv.\nZelensky thanked him for the \"tremendous support\", comparing it to the United States coming to Europe's aid during World War II."}, {"id": "6918f6d6-9837-4804-8237-8a28d0516bda", "title": "Biden Apologizes to Zelensky for Congress Ukraine Aid Delay", "date": "2024-06-08 02:45", "url": "https://foreignpolicy.com/2024/06/07/biden-zelensky-ukraine-military-aid-war-russia-putin-d-day/", "message": "Welcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine , Houthi detentions of United Nations employees, and India ’s new governing coalition.\nWelcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine, Houthi detentions of United Nations employees, and India’s new governing coalition.\n‘We’re Still In’U.S. President Joe Biden apologized to Ukrainian President Volodymyr Zelensky in Paris on Friday for the monthslong congressional delay in approving the latest U.S. aid package.\nThe meeting, on the sidelines of D-Day commemoration events, was their first face-to-face encounter since Zelensky visited Washington last December to request greater military support.\n“I apologize for those weeks of not knowing what’s going to happen in terms of funding,” Biden told Zelensky, adding that “we’re still in."}, {"id": "a9563108-ef8c-497c-8802-cfc74a3d3b23", "title": "Biden Apologizes to Zelensky for Congress Ukraine Aid Delay", "date": "2024-06-08 09:15", "url": "https://foreignpolicy.com/2024/06/07/biden-zelensky-ukraine-military-aid-war-russia-putin-d-day/?tpcc=recirc_trending062921", "message": "Welcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine , Houthi detentions of United Nations employees, and India ’s new governing coalition.\nWelcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine, Houthi detentions of United Nations employees, and India’s new governing coalition.\n‘We’re Still In’U.S. President Joe Biden apologized to Ukrainian President Volodymyr Zelensky in Paris on Friday for the monthslong congressional delay in approving the latest U.S. aid package.\nThe meeting, on the sidelines of D-Day commemoration events, was their first face-to-face encounter since Zelensky visited Washington last December to request greater military support.\n“I apologize for those weeks of not knowing what’s going to happen in terms of funding,” Biden told Zelensky, adding that “we’re still in."}, {"id": "67fdb0cb-5786-4464-b42a-7dfb51402516", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96 – Winnipeg Free Press", "date": "2024-06-08 12:15", "url": "https://www.winnipegfreepress.com/world/2024/06/08/a-world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTerens called it ″the best day of my life.″FILE - World War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, snuggle during an interview, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nFILE - World War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\n(AP Photo/Jeremias Gonzalez)On D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "c5042e04-5fca-4037-9a64-29e96a36b158", "title": "Battle of the Alphas - Sky Mix", "date": "2024-06-08 12:30", "url": "https://www.tvguide.co.uk/schedule/c0be821c-a842-53cb-9308-2508a3edcb03/battle-of-the-alphas", "message": "Battle of the AlphasSky Mix 6:00 PM to 6:30 PM Saturday 8 June Share Add toCalendar +Season 1 Episode 11 of 12 New S Subtitles Audio DescriptionThe creature conflicts in the landscape of South Africa, where wildebeest battle for herd hierarchy, floppy fish fight it out on land and locusts give into a frenzy of cannibalismBattle of the Alphas airs on Sky Mix at 6:00 PM, Saturday 8 June .\n(Subtitles, audio description, new.)\nLearn more about Battle of the Alphas and other education/science/factual topics on our factual page"}, {"id": "170dc7fb-8dc5-4288-a5a6-928c4e5f970f", "title": "A powerful ally for veterans | News , Sports , Jobs - Adirondack Daily Enterprise", "date": "2024-06-08 06:15", "url": "https://www.adirondackdailyenterprise.com/opinion/guest-commentary/2024/06/a-powerful-ally-for-veterans/", "message": "Some of these organizations united and were known as the Veterans of Foreign Wars of the United States, later the Veterans of Foreign Wars or VFW.\nThe VFW is dedicated to veterans’ service, legislative advocacy, military and community service programs.\n(While most VFW members do not list their gender on the application form, according to one report approximately 8% of members are female).\nThe VFW has made it a priority to “enhance programs and services for women and underserved veterans.” A recent VFW report states the Veterans Administration needs to:¯ Improve outreach to women veterans.\n¯ Train VA’s workforce to treat women veterans with respect and dignity."}, {"id": "85192083-438b-4f18-bc2d-5e95866224cf", "title": "A war on the Nile pushes Sudan toward the abyss | World News", "date": "2024-06-08 12:45", "url": "https://indianexpress.com/article/world/a-war-on-the-nile-pushes-sudan-toward-the-abyss-9380102/", "message": "As he recovered in a military hospital overlooking the Nile, he said, shells slammed into its walls, fired by the Rapid Support Forces across the river.\nFor more than half a century, Sudan’s military waged ugly wars in the nation’s distant peripheries, quelling rebellions by deploying ruthless militias.\nBleeding RSF fighters lie in the dust, and are kicked or taunted by the soldiers.\nHuda Adil, 30, was paralyzed from the waist down after RSF fighters shot up the bus she was traveling in.\nThe foreign powers fueling Sudan’s war seemed to be covering their tracks."}, {"id": "e1e17297-705a-4e80-9105-6405eb56d266", "title": "No injuries in Battle Creek nursing home fire , firefighters say", "date": "2024-06-08 07:00", "url": "https://wwmt.com/news/local/pinnacle-care-battle-creek-fire-temperature-machine-overheat-office-smoke-firefighters-department-safety-calhoun-county-west-michigan", "message": "No one was injured after a fire at a Battle Creek nursing home Wednesday, according to the Battle Creek Fire Department.\nFirefighters were called to Pinnacle Care at 675 Wagner Dr. around 11:23 p.m. for a fire in an office.\nMore Battle Creek:When they arrived, firefighters did not see any fire on the outside or an evacuation in progress, firefighters said.\nHowever, inside the building, firefighters found light smoke and a small fire caused by an overheated, portable patient and visitor temperature reading machine in the front office, according to the department.\nTrending on WWMT:Both the fire and its smoke were contained, but were estimated to have caused $7,000 in damages, firefighters said."}, {"id": "730d14a3-7d84-489d-8823-8d64f9b1fd7a", "title": "US says Russia advance on Kharkiv is  all but over  ", "date": "2024-06-08 00:45", "url": "https://www.yahoo.com/news/us-says-russia-advance-kharkiv-213236954.html", "message": "The White House said Friday that Russia’s offensive in Ukraine’s northeastern Kharkiv region has stalled and is unlikely to advance any further.\nJohn Kirby, the White House national security spokesperson, said the arrival of U.S. weapons has helped change the trajectory of the battle around Kharkiv, which Russian forces mounted a major attack on around the middle of May.\n“They have been able to thwart Russian advances, particularly around Kharkiv,” Kirby said.\nThe renewed push sparked fears that Ukraine would be stretched thin as it also defends against Russian forces pushing forward in the eastern Donetsk and Luhansk regions.\nRussia made some gains in Kharkiv when the offensive was launched, capturing towns and progressing toward the city of Kharkiv, but forces are still locked into fighting north of the city, including major battles around the town of Vovchansk."}, {"id": "c78559e9-b6c3-4683-a3cd-65023072ad83", "title": "Rishi Kapoor Posed For Photographer In Place of Ranbir , Paparazzo Reveals  He Had A Glass In His Hands  ", "date": "2024-06-08 10:15", "url": "https://www.news18.com/movies/rishi-kapoor-posed-for-photographer-in-place-of-ranbir-paparazzo-reveals-he-had-a-glass-in-his-hands-8925739.html", "message": "Veteran paparazzo Varinder Chawla recently reminisced about the complex yet endearing relationship between the late actor Rishi Kapoor and his son, Ranbir Kapoor, with Mumbai’s ever-eager paparazzi.\nVarinder recounted an incident where one of his photographers, determined to snap Ranbir Kapoor, decided to stake out outside Ranbir’s house.\nAfter waiting for over six hours, Rishi Kapoor emerged with a glass in his hand and engaged the photographer in a surprisingly gentle conversation, “It was late in the night.\nBut my photographer was adamant, he said he wants his photo, so Rishi said, ‘He won’t come out, you click my picture and leave’.\nFondly referred to as Chintu Ji, Rishi Kapoor left an indelible mark on the Hindi film industry."}, {"id": "1d516c22-9a8e-47a5-91cf-b642fef01c16", "title": "Pakistan : FIR on Baloch rights activist Mahrang sparks outcry", "date": "2024-06-08 13:45", "url": "https://news.webindia123.com/news/Articles/World/20240608/4204482.html", "message": "The Quetta police have filed a First Information Report (FIR) against Baloch rights activist Mahrang Baloch and several others, alleging their involvement in a protest against enforced disappearances and extrajudicial killings on May 18 that disrupted traffic on Court Road.\nAccording to the FIR, the protesters forcibly entered the Quetta Press Club by breaking the lock, where they purportedly delivered speeches and shouted slogans against Pakistan.\nThe FIR against Baloch has ignited a legal battle and sparked widespread condemnation from journalists and activists.\nhttps://x.com/Alijanmaqsood12/status/1799107296028701046 Exiled human rights activist Gulalai Ismail said, \"Strongly condemn the registration of FIR against Mahrang Baloch.\nAs tensions continue to simmer, Balochistan stands at a critical juncture, grappling with questions of democracy and freedom of expression."}, {"id": "17276e96-ff75-4e5a-b136-0689f47ccfa4", "title": "Can the SNP hold these streets where Nicola Sturgeon once ruled ? ", "date": "2024-06-08 09:45", "url": "https://www.heraldscotland.com/politics/viewpoint/24374459.can-snp-hold-streets-nicola-sturgeon-ruled/", "message": "The so-called Battle of Kenmure Street (Image: free)The Battle of Kenmure Street features prominently in Mr Stephens’ election literature along with the war in Gaza.\nHe’s keen to stress that this is more than electioneering in a constituency where the Muslim community is prominent.\nOf the 14 doors opened to Mr Stephens and me, 12 are firm, no-messing-about SNP supporters.\nREAD MOREClimate activists and Palestinian campaigners killing book festivalsAs Labour and Tories unite in silence over EU, can SNP break through?\nMr Stephens, though, has had to graft for every political reward that has come his way."}, {"id": "73137bbf-758e-4091-b4ca-109d78b999e1", "title": "Everything announced during Summer Game Fest 2024", "date": "2024-06-08 04:00", "url": "https://www.eurogamer.net/everything-announced-during-summer-game-fest-2024", "message": "No fear if you missed the showcase though as below you'll find everything announced during Summer Game Fest 2024.\nIn this eight-player co-op game, you'll have to survive the horrors of the night but zombies aren't the only danger - this game has permadeath.\nBlumhouse Games' slateHorror then invaded Summer Game Fest 2024 again with the first look at the slate from Blumhouse Games.\nIt will be arriving in 2nd July 2024 on PC, PlayStation 4, PS5, Xbox One and Xbox Series X/S.\nPhantom Blade 0Summer Game Fest 2024 ended with a new trailer for Phantom Blade 0 - and it was all gameplay."}]