[{"id": "ab3d3fdc-44c0-41f0-bd96-b39e38b9cfe8", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-16 04:00", "url": "https://abcnews.go.com/International/top-isis-leader-somalia-target-us-airstrike/story?id=111160552", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "6c39dc09-fe71-4d81-a86b-37cee173d696", "title": "US targeted Islamic State group leader in airstrike last month : Report", "date": "2024-06-16 01:00", "url": "https://www.washingtonexaminer.com/policy/defense/3046728/us-islamic-state-group-leader-airstrike-last-month/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "U.S. forces launched an airstrike last month in Somalia targeting the leader of the Islamic State group, Abdulqadir Mumin.\nThe Office of the Director of National Intelligence lists Mumin as the leader and founder of the Islamic State group’s Somalia affiliate, which has between 100 and 400 members.\nThe unnamed U.S. officials said he became the global leader of the terrorist group after his predecessor, Abu al-Hassan al-Hashimi al-Qurayshi, died in combat in October 2022 in Syria.\nIraq and Syria are home to the largest concentrations of Islamic State group members, but U.S. forces have been effective against leadership there.\n“Somalia remains central to the security environment in East Africa,” according to AFRICOM."}, {"id": "70c9b735-0eee-48aa-ab95-fef11ab6c956", "title": "Lebanon Hezbollah targets Israeli military positions in fresh retaliatory strikes", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah targets Israeli military positions in fresh retaliatory strikesIran Press TVSaturday, 15 June 2024 11:32 AMHezbollah has carried out a fresh round of strikes against Israeli military positions in the north in response to the recent Israeli assassination of a top commander in southern Lebanon.\nSami Abdallah, better known by the nom the guerre Abu Taleb, was assassinated along with three other people in the Israeli strikes that targeted a residential building in the southern Lebanese town of Jwaya on Tuesday.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006.\nHezbollah's greatest achievement is the fact that there are tens of thousands of displaced people in the north,\" Gordin said."}, {"id": "950ad66c-e2b8-40ca-81a2-67757f28aa6b", "title": "Responding to Hezbollah strategic offensive – J - Wire", "date": "2024-06-16 12:15", "url": "https://www.jwire.com.au/responding-to-hezbollahs-strategic-offensive/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Responding to Hezbollah’s strategic offensiveRead on for articleHezbollah is burning a swathe through northern Israel.\nThe Nasser unit is a division-sized formation responsible for Hezbollah’s operations along the border with Israel.\nThe main problem with the IDF’s assertion is that it ignores the strategic logic of Hezbollah’s operations.\nHezbollah isn’t simply abusive; it is waging a strategic war with clear long-term and intermediate strategic objectives.\nUnder Hezbollah’s control, Lebanon is not an actual country."}, {"id": "6f5b4b02-21fa-46a3-a650-02ffa830e4b8", "title": "Gaza : 8 Israeli soldiers killed in one of the deadliest attack - IDF", "date": "2024-06-16 12:00", "url": "https://dailypost.ng/2024/06/16/gaza-8-israeli-soldiers-killed-in-one-of-the-deadliest-attack-idf/", "domain": "dailypost.ng", "domain_classification": "Unknown", "message": "No fewer than eight Israeli soldiers were killed in southern Gaza.\nThe Israel Defense Forces (IDF) said the deadliest single incident involving its troops since October 7 happened on Saturday.\n“The current assessment is that the ‘Nemera’ armored vehicle was hit as a result of an explosion of a roadside bomb.\nIn addition, on the vehicle there were engineering tools that included explosive material.\n“The explosion was significant and may have been caused by the ignition of the explosive material on the vehicle."}, {"id": "849a951a-75d4-4f6d-ab1c-211d3d8df954", "title": "Four civilians killed as Russia launches widespread missile attack on Ukraine", "date": "2024-06-16 13:00", "url": "http://www.myanmarmuslim.net/news/20240616955b599042.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The governor of the Kursk region, Roman Starovoit, said a shopping centre and a school stadium were hit in the missile attack.\nAn apartment building in Kharkiv region was severely damaged in the attack (Kharkiv Regional Prosecutor’s Office/ via AP)“There are many casualties: dead and wounded,” he said on Telegram.\nDozens of people were killed and injured in an attack there over Russia’s New Year holiday weekend.\nIn Ukraine, five people were injured in the night-time attack on the city of Chuhuiv, in the Kharkiv border region, regional governor Oleh Syniehubov said.\nThe Russian missiles used on Thursday included Iskander ballistic missiles, Kalibr cruise missiles, guided aviation missiles and adapted S-300 anti-aircraft missiles."}, {"id": "18bf3a52-2bec-4d14-a1da-2b905c359919", "title": "Houthis claim attack which damaged united kingdom ", "date": "2024-06-16 10:15", "url": "http://www.myanmarmuslim.net/news/20240616048f599949.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“Vessel at anchor and all crew are safe.”Houthi Brigadier General Yahya Saree issued a statement claiming the attack, saying the vessel later sank.\nShip-tracking data from MarineTraffic.com analysed by The Associated Press identified the vessel targeted as the Rubymar.\nLater on Monday, the UKMTO and Ambrey said a second vessel came under attack in the Gulf of Aden.\nThe Houthis later claimed the attack, but instead said they targeted a second vessel other than the Sea Champion in that assault.\nThose strikes targeted mobile anti-ship cruise missiles, an explosive-carrying drone boat and an “unmanned underwater vessel”, Central Command said."}, {"id": "359efd02-0eb5-41fa-bc1b-3025e72abda9", "title": "Lebanon Hezbollah warns of  decisive  response to Israeli expansion of war", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah warns of 'decisive' response to Israeli expansion of warIran Press TVSaturday, 15 June 2024 8:50 AMA senior official of Lebanon's Hezbollah resistance movement has warned the Israeli regime of a \"decisive\" response in case of expanding the scope of its war on Lebanese soil.\nThe senior Hezbollah official cautioned the Israeli regime against any further actions and said, \"You saw how we responded to the assassination of Commander Abu Taleb and his companions.\"\nThe Israeli regime has repeatedly attacked southern Lebanon since October 7, 2023, when it launched a ferocious war on the besieged Gaza Strip that has so far killed about 37,300 Palestinians, most of them women and children.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006."}, {"id": "4623d7b1-863c-4ff2-9da9-77dcacfae305", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nOthers suggested the drones may be so-called quadcopters – small, four-rotor drones that are commercially available.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries."}, {"id": "7f3b2e3b-21c5-48a5-ba93-094878d4c4a4", "title": "What can be learned from the sinking of ships in the Red Sea", "date": "2024-06-16 11:30", "url": "https://www.jpost.com/middle-east/article-806426", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Iranian-backed Houthis successful attacks on two ships in the Red Sea, in which crew have been harmed and ships left adrift, illustrates how the international community has completely failed in its obligations.\nThe recent attacks have increased the danger to shipping in the Red Sea and Gulf of Aden.\nLike many things in this conflict, Iran often has ships snooping around and nothing is done against them while Iran’s proxies attack commercial ships.\nThese attacks are increasing and there is no solution put forward by the international community to stop them.\nToday, Iran’s proxies primarily do as they want and Israel suffers and the crew of commercial ships suffer."}, {"id": "53846571-bdef-4d76-b4c0-66ce54fcd49e", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-16 13:45", "url": "https://dunyanews.tv/en/World/818891-US-military-targets-Houthi-radar-sites-in-Yemen-after-a-merchant-sailor-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingWorld World US military targets Houthi radar sites in Yemen after a merchant sailor goes missingUS military targets Houthi radar sites in Yemen after a merchant sailor goes missingFollow on Published On: Sun, 16 Jun 2024 17:46:25 PKTDUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "55e7ad25-c76a-4e2f-a5b1-d40bd2388ad1", "title": "Palestinian resistance rocket attacks Zionist settlement of Sadirot", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Palestinian resistance rocket attacks Zionist settlement of SadirotIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- News sources announced on Friday night that the rocket attacks by the Palestinian resistance from Gaza towards the Zionist settlement of Sadirot.\nFrom Shahab Palestinian news agency, Saraya al-Quds resistance group announced that the Zionist settlement of Sadirot in the Gaza Strip was targeted by rocket attacks.\nAccording to this report, the alarm of a missile attack has sounded in the Zionist settlements bordering Gaza.\nAccording to IRNA, after more than seven months have passed since the Zionist regime invaded the Gaza Strip without any results and achievements, this regime is sinking more and more into its internal and external crises.\nDuring this period, the Zionist regime has not achieved anything other than crime, massacre, destruction, war crimes, violation of international laws, bombing of relief organizations and famine in this region."}, {"id": "d68a96f0-8416-4bc4-901e-0c7401f3ef4e", "title": "21 Filipino seafarers from Houthi - attacked ship rescued , 1 more missing", "date": "2024-06-16 06:15", "url": "https://www.sunstar.com.ph/manila/21-filipino-seafarers-from-houthi-attacked-ship-rescued-1-more-missing", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "THE Department of Migrant Workers (DMW) confirmed on Saturday, June 15, 2024, the successful rescue of 21 out of the 22 Filipino seafarers on board a ship that was attacked by the Houthi rebels in the southern Red Sea.\nAt least 17 Filipino crew members of the Galaxy Leader remain in the hands of the Houthi rebels after they attacked the vessel in November 2023.\nHe said the administration of President Ferdinand Marcos Jr. imposed a whole-of-government approach to help Filipino seafarers attacked by the Houthi rebel group in the Red Sea.\nTwo Filipino seafarers were also killed while 11 others were safely rescued and repatriated following a missile attack by Houthi to a bulk carrier True Confidence.\n“The return of the two seafarers’ remains are expected to be home soon,” said Cacdac."}, {"id": "d5fd730c-dc5a-4361-bf27-17bf1208efb4", "title": "Israel - Hamas update : Eight Israel Defence Forces soldiers killed in deadliest incident in months", "date": "2024-06-16 04:00", "url": "https://www.9news.com.au/world/israel-hamas-update-eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-incidents-for-the-idf-since-october-7/d5f6b01e-b860-4197-a9f9-22557ac45fdd", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defence Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nIsrael identified one of the dead soldiers as Captain Wassem Mahmoud, Deputy Company Commander in the Engineering Battalion.\nVarious other ministers expressed their sorrow at the deaths, including defence minister Yoav Gallant, foreign minister Israel Katz and national security minister Itamar Ben Gvir.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defence Directorate in Gaza said."}, {"id": "bc38bb6a-800f-4779-ac1e-1b6e34fac9f5", "title": "IDF releases names of 5 more soldiers killed in Rafah explosiom", "date": "2024-06-16 06:45", "url": "https://www.ynetnews.com/article/skmtpknra", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The serious incident occurred in the early hours of Saturday morning, when the massive explosion occurred in an armored vehicle near the Tel a-Sultan refugee camp.\nThe names of two other fallen soldiers are expected to be released later on Sunday.\nInside the armored vehicle there were eight soldiers who were killed.\"\nIt was developed in Israel, entered service in 2016 and replaced the Puma combat armored engineering vehicle.\nIt is based on a regular infantry armored personnel carrier, but includes some improvements and adjustments and can carry 10 soldiers."}, {"id": "c730fc8f-c4ea-41d3-8f04-786be43ad5e3", "title": "US Naval forces rescue crew from Greek - owned ship struck by Houthis in Red Sea By Reuters", "date": "2024-06-16 08:45", "url": "https://www.investing.com/news/commodities-news/us-naval-forces-rescue-crew-from-greekowned-ship-struck-by-houthis-in-red-sea-3486012", "domain": "investing.com", "domain_classification": "Unknown", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "3a8eed01-30bc-484b-9ede-7a749ad84ac8", "title": "UPDATE 1 - US Naval Forces Rescue Crew from Greek - owned Ship Struck by Houthis in Red Sea", "date": "2024-06-16 13:45", "url": "https://www.newsmax.com/newsfront/us-navy-red/2024/06/16/id/1168908/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to maneuver.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "7779256f-f6bd-47fe-a0bb-be6767baea0e", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616981c599015.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning."}, {"id": "4920eacc-3dda-4e99-b7d8-6e02b10bfa37", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-16 10:45", "url": "http://www.myanmarmuslim.net/news/20240616866a599077.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning."}, {"id": "caad8748-ecc4-41a1-b1d7-9cdfceaf6d7d", "title": "Two Arrested in Allegedly Gang - Related Costa Mesa Shooting", "date": "2024-06-16 03:30", "url": "https://mynewsla.com/crime/2024/06/15/two-arrested-in-allegedly-gang-related-costa-mesa-shooting-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men have been arrested on suspicion of attempted murder for a shooting connected to a memorial for a man stabbed to death in Costa Mesa earlier this week, authorities said Saturday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive.\nPolice were able to identify two suspects connected to the Friday morning shooting and identified them as Eric Garcilazo, 19, and Elmer Suarez-Morales, 20, both of Costa Mesa.\nOfficers located Suarez-Morales on Friday afternoon, who was pulled over in a vehicle and arrested without incident.\nAnyone with information on the stabbings or shooting was asked to call Costa Mesa police at 714-754-5097."}, {"id": "9d7faaa8-b739-4db5-a4da-5240508b0082", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:30", "url": "https://apnews.com/article/auburn-maine-armed-standoff-fire-aad7f7d1eb430d5c49fb1455daeff5e1", "domain": "apnews.com", "domain_classification": "International", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting."}, {"id": "f37be0dd-0a11-45ba-b184-e761a5e253ea", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 04:00", "url": "https://www.kiro7.com/news/national/maine-police-kill/RPPFZUK46GNQTDU6JAU6FLW6OE/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "1d82b912-aeac-4bbb-8b49-81cb199646d2", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 03:45", "url": "https://tulsaworld.com/ap/national/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_b68e7e72-ff4c-5ed2-ae83-e1aa64104f60.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus."}, {"id": "f69c1c49-5510-458b-8a44-edb3ed41eae8", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 02:30", "url": "https://www.wfmz.com/news/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_d2a8eba8-2d13-50ef-a7e9-e3f47733e660.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday.\n(Russ Dillingham/Sun Journal via AP)"}, {"id": "4efe9e23-3755-4375-8a58-9be0d1c01b51", "title": "Hezbollah rockets damaged 35 % of Israeli settlements in Metula town : Mayor", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah rockets damaged 35% of Israeli settlements in Metula town: MayorIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- The rocket attacks of the Lebanese resistance movement Hezbollah have damaged 35% of Israeli settlers' houses in al-Metula town in northern occupied Palestine, according to the town's mayor.\nThe Israeli regime's Channel 12 quoted the mayor as saying that more than 190 houses in this settlement, that is, about 35% of its houses, were damaged in Hezbollah's missile attacks.\nHezbollah's missiles have caused heavy damage to the infrastructure, electricity network and agricultural lands of Metula town, he added.\nMeanwhile, The Zionist Army Radio announced that Lebanon's Hezbollah fired more than 60 rockets into occupied Palestine on Friday.\nEarlier, Hebrew sources reported a massive fire in the Baram area in northern occupied Palestine following Hezbollah's rocket attacks and the efforts of four firefighting teams to control the fire."}, {"id": "205c5f57-4e6f-4b55-825a-bc269290b37b", "title": "US warns of further retaliation if Iran - Winning Bet Picks", "date": "2024-06-16 09:30", "url": "http://www.myanmarmuslim.net/news/2024061657a599886.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Mr Sullivan said Iran should expect “a swift and forceful response” if it, and not one of its proxies, “chose to respond directly” against the US.\nIran has tried to distance itself from the drone strike, saying the militias act independently of its direction.\nThe Biden administration has so far appeared to stop short of directly targeting Iran or senior leaders of the Quds Force within its borders.\nThe statement from Iran on the Behshad and Saviz ships appeared to signal Tehran’s growing unease over the US strikes across the region.\nThe ships are registered as commercial cargo ships with a Tehran-based company the US treasury has sanctioned as a front for the state-run Islamic Republic of Iran Shipping Lines."}, {"id": "72f30c85-f3e8-42b1-a060-7318be2f39f9", "title": "Israel Hamas War News Live Updates : Israel army says eight soldiers killed in Gaza", "date": "2024-06-16 00:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-palestine-war-news-live-updates-gaza-rafah-lebanon-hamas-ceasefire-june-16-june-17/liveblog/111026807.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "For months, the United States, France, and other mediators have tried to halt the tit-for-tat strikes between Israel and Hezbollah, a powerful militia and political faction backed by Iran.\nIsrael has warned that it is prepared to take stronger action to dislodge Hezbollah militants from southern Lebanon.\nThis week, both sides escalated their attacks, raising concerns about another front in the conflict as Israel continues its offensive against Hamas in the Gaza Strip.\nIt was unclear if Gallant was speaking for the entire Israeli government.“ As we fight a just war, defending our people, France has adopted hostile policies against Israel,” Gallant wrote on social media.\n“Israel will not be a party to the trilateral framework proposed by France.”Stay with TOI for latest updates:"}, {"id": "2c4474a5-fe67-4fb0-b1bc-1bb396f458cc", "title": "Cuba Does Not Approve of US Submarine Presence - Deputy Foreign Minister", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/cuba/cuba-240615-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Cuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterSputnik News20240615MEXICO CITY (Sputnik) - The Cuban government was notified of the USS fast attack submarine Helena visiting the US naval base in Cuba's Guantanamo, but Havana does not approve of such visits, Cuban Deputy Foreign Minister Carlos Fernandez de Cossio said.\n\"We were aware of their presence because, in accordance with the procedures that we have followed for years, the United States informed us in advance.\nUS Southern Command (SOUTHCOM) said Wednesday the USS fast attack submarine Helena made a pre-planned deployment to the US naval base at Guantanamo Bay, Cuba.\nThe deployment followed the Russian naval force's arrival in Cuba for naval exercises.\nUS officials previously noted that the Russian naval deployment to Cuba does not pose a threat to the United States."}, {"id": "aca60cf8-1b14-45cd-a430-baf6d2907104", "title": "Israel rescues hostage Noa Argamani from Hamas captivity in Gaza , newly released footage shows", "date": "2024-06-16 06:30", "url": "https://nypost.com/2024/06/16/world-news/israel-rescues-hostage-noa-argamani-from-hamas-captivity-in-gaza-newly-released-footage-shows/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza.\nYou’re safe, we’re taking you to the vehicle.”Argamani, a 26-year-old China-born Israel citizen, was one of four hostages rescued during the operation.\n8 Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza on June 8.\n“We’re from the Yaman (Police) and Shabak (ISA),” one person explains to Argamani inside the vehicle.\nIsrael Foreign Ministry/UPI/Shutterstock8 Argamani, a 26-year-old China-born Israel citizen, Supernova music festival on Oct. 7 when Hamas attacked."}, {"id": "e097e843-e44a-440a-853f-f67530a58aca", "title": "Maine police kill armed man after a night of gunfire and burned homes that left a man missing", "date": "2024-06-16 01:30", "url": "https://www.gjsentinel.com/news/us/maine-police-kill-armed-man-after-a-night-of-gunfire-and-burned-homes-that-left/article_63110243-5875-5bd6-9a66-b7c5a8573c4b.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday."}, {"id": "ee30f5a0-f3c5-4c66-83e4-11aaec60a69a", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7", "date": "2024-06-16 01:30", "url": "https://kvia.com/news/us-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nThe Israeli military has so far released the names of six of the eight soldiers killed in the incident.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said."}, {"id": "a8055214-9ed7-4c5b-87a9-b54d496c2b63", "title": "Why Russia Bond With North Korea Is a Danger to the World", "date": "2024-06-16 04:15", "url": "https://www.yahoo.com/news/why-russia-bond-north-korea-030000285.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "North Korea has likely received military aid in return that has increased the threat it poses to the US and its allies in East Asia.\nSatellite imagery shows arms transfers from North Korea to Russia took off after that.\nPutin will be in North Korea on Tuesday and Wednesday, according to South Korea’s Dong-A Ilbo newspaper.\nNorth Korea has also tested a close-range ballistic missile with an estimated range of about 110 kms.\nMore North Korean arms transfers to Russia would increase Ukraine’s need for US as well as European military assistance."}, {"id": "afe1b1f1-6412-445c-b9c2-7b771497ebf7", "title": "Ukraine Proves It Can Target the Russian Air Force Weakest Link", "date": "2024-06-16 09:45", "url": "https://www.businessinsider.com/ukraine-proves-it-can-target-russian-air-forces-weakest-link-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "AdvertisementBut these were pinprick attacks designed to embarrass the Kremlin and demonstrate that nowhere in Russia is safe from Ukrainian attack.\nThe aircraft didn't appear to catch on fire, suggesting the damage wasn't catastrophic, perhaps to be expected from small drones with small warheads.\nThe Akhtubinsk attack suggests that Russian electronic warfare capacity has sufficient breadth to cover the front, but not depth to protect the Russian interior.\nMuch like Russia's vaunted T-14 Armata, the Su-57 has been conspicuous by its absence from the Ukraine war.\nAdvertisementEven with American-made F-16 fighters arriving soon, Ukraine's air force probably can't drive off Russian jets lobbing glide bombs from 50 miles behind Russian lines, safe behind ground-based air defenses."}, {"id": "e8299e53-5562-462c-ad46-0c230d8d0574", "title": "Why Russia Bond With North Korea Is a Danger to the World", "date": "2024-06-16 04:00", "url": "https://www.bnnbloomberg.ca/why-russia-s-bond-with-north-korea-is-a-danger-to-the-world-1.2085704", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "North Korea has likely received military aid in return that has increased the threat it poses to the US and its allies in East Asia.\nSatellite imagery shows arms transfers from North Korea to Russia took off after that.\nPutin will be in North Korea on Tuesday and Wednesday, according to South Korea’s Dong-A Ilbo newspaper.\nNorth Korea has also tested a close-range ballistic missile with an estimated range of about 110 kms.\nMore North Korean arms transfers to Russia would increase Ukraine’s need for US as well as European military assistance."}, {"id": "4d55731b-129c-4015-bee5-06181114c9f1", "title": "Sgt . Yaakov Levi killed in battle in Gaza", "date": "2024-06-16 12:00", "url": "http://www.israelnationalnews.com/news/391608", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF cleared for publication this morning (Sunday) that Sergeant Yakir Ya'akov Levi, 21, from Hafetz Haim, a soldier from the 601st Engineering Battalion, 401st \"Iron Tracks\" Brigade, fell in battle in the Gaza Strip.\nYesterday (Saturday), eight soldiers were killed in an APC explosion in the southern Gaza city of Rafah in one of the highest casualty incidents in Gaza the IDF has suffered in months.\nCommenting on the incident, IDF Spokesperson, Rear Admiral Daniel Hagari, said on Saturday night, \"Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\"\nInside the armored vehicle were the eight soldiers who were killed,\" said Hagari.\n\"Following this difficult incident, a team of experts from the Ministry of Defense and the IDF will examine the armored vehicle and all the details of the incident until we reach findings,\" he added."}, {"id": "4b16d74c-033f-4fbe-a404-c48586906c27", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-16 01:30", "url": "https://www.gjsentinel.com/news/world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_0c7fd223-4da2-51ac-9314-e470d602ea06.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat's what its leaders and experts tell The Associated Press, whose journalists visited U.S. ships off Yemen in recent days."}, {"id": "86b284e2-3497-484f-8060-f909c2de4027", "title": "US Navy says faces most intense combat since World War II against Yemen", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-isna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Navy says faces most intense combat since World War II against YemenISNA - Iranian Students' News AgencySat / 15 June 2024 / 09:40The US-led campaign to protect Israeli interests in the Red Sea has escalated into the \"most intense\" running sea battle the Navy has faced since World War II, according to an AP report quoting American military commanders and experts.\nEric Blomberg told the AP aboard the USS Laboon warship in the Red Sea.\nBryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute, told the AP, \"this is the most sustained combat that the US Navy has seen since World War II.\"\nYemen initiated its naval operations in the Red Sea in October to help bring the US-Israeli genocide in Gaza to a halt.\nThe Yemeni leader vowed that they will continue to target American warships in the Red Sea and beyond, including the aircraft carrier USS Dwight D. Eisenhower."}, {"id": "912dc98c-b74a-4fa6-8578-9ce32bfe2cbe", "title": "Iranian commander renews vow to avenge Syria strike that killed two generals", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616093e599898.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A top military commander on Saturday renewed Iran’s promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two Iranian generals.\nGeneral Mohammad Bagheri, Iran’s joint chief of staff, told mourners gathered for the funeral of general Mohammad Reza Zahdi that Iran will decide when and how to stage an “operation” to take revenge.\nGen Zahdi was the highest ranking commander killed in Monday’s attack.\nIn all, 12 people were killed in the strike – seven Iranian Revolutionary Guard members, four Syrians and a Hezbollah militia member.\nTensions have flared against the backdrop of the six-month-old Israel-Hamas war in Gaza, and raised renewed fears of a broader regional conflict."}, {"id": "db620a44-e128-40c0-975f-e1c0278da1a2", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7 - LocalNews8 . com", "date": "2024-06-16 00:00", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7-2/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nThe Israeli military has so far released the names of six of the eight soldiers killed in the incident.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said."}, {"id": "c8c41230-3c41-4b5b-9d13-b6c2951124ef", "title": "The previous 5 No . 12 picks of NBA draft : What can OKC Thunder expect ? ", "date": "2024-06-16 00:00", "url": "https://okcthunderwire.usatoday.com/lists/the-previous-5-no-12-picks-of-nba-draft-what-can-okc-thunder-expect/", "domain": "okcthunderwire.usatoday.com", "domain_classification": "Unknown", "message": "The 2024 NBA draft is less than two weeks away, which means the Oklahoma City Thunder will soon add a lottery talent to their young core.\nThe youngest first seed in league history owns the No.\n12 pick via the Houston Rockets,The Thunder will get a chance to add a role player to their young trio of Shai Gilgeous-Alexander, Chet Holmgren and Jalen Williams.\nOr perhaps OKC can feel frisky and swing for the fences knowing it has room for error.\n12 selections and what they did in their rookie seasons:"}, {"id": "e2e41be8-6090-4483-b273-863ef1b8904b", "title": "US military targets rebel radar sites after merchant crew abandons ship", "date": "2024-06-16 11:45", "url": "https://jcpost.com/posts/fb1ae4ef-f881-4adf-bfba-cb76fbb19a33", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "4db32148-57e4-4ed5-b49f-22939cbd54d8", "title": "US military targets rebel radar sites after merchant crew abandons ship", "date": "2024-06-16 13:00", "url": "https://hayspost.com/posts/fb1ae4ef-f881-4adf-bfba-cb76fbb19a33", "domain": "hayspost.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "626a10a4-a745-4d16-99d7-c3dc274746da", "title": "8 Israeli soldiers killed in Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 01:00", "url": "https://www.houstonpublicmedia.org/npr/2024/06/15/nx-s1-5007398/8-israeli-soldiers-killed-in-gaza-in-deadliest-attack-on-israeli-forces-in-months/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Israel's military said on Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\n(Ohad Zwigenberg | AP)JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "6eed4986-ccda-4f37-b3ae-c4835f3e7329", "title": "US strikes Houthi radar sites after ships attacked | Northwest Arkansas Democrat - Gazette", "date": "2024-06-16 13:00", "url": "https://www.nwaonline.com/news/2024/jun/16/us-strikes-houthi-radar-sites-after-ships-attacked/", "domain": "nwaonline.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n\"These radars allow the Houthis to target maritime vessels and endanger commercial shipping,\" Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n\"The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,\" Central Command said.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage."}, {"id": "984436a8-49a9-4a90-a3d0-7ad5b1b2d9d8", "title": "Baghdad airstrike kills Iran - Winning Bet Network", "date": "2024-06-16 13:45", "url": "http://www.myanmarmuslim.net/news/20240616985b598958.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An airstrike on the logistical support headquarters of an Iran-backed militia in central Baghdad has killed a high-ranking militia commander, militia officials said.\nAn anonymous US official confirmed the country’s forces conducted a strike on a vehicle in Baghdad on Monday against the group Harakat al-Nujaba.\nThursday’s strike killed two people and wounded five, according to two militia officials who spoke on condition of anonymity because they were not authorised to speak publicly.\nHeavy security was deployed around the location of the strike on Baghdad’s Palestine Street and Iraqi war planes could be seen flying overhead.\nAsked if Israel had involvement in Thursday’s strike in Baghdad, an Israeli military spokesperson declined to comment."}, {"id": "ddbf0db5-919e-4b2b-8ecc-f478bd67a19e", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 05:15", "url": "https://www.prokerala.com/news/articles/a1539783.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Baghdad, June 16 : A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "1862a1bf-21b2-4199-8bbe-b0c32260c9e2", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 11:30", "url": "https://www.yahoo.com/news/8-israeli-soldiers-killed-southern-153147879.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel's military said Saturday, June 15, that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\n(AP Photo/Ohad Zwigenberg, File)JERUSALEM (AP) — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after."}, {"id": "bd15b836-09de-4631-b7e2-78c3e8e2386e", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://komonews.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "komonews.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "a9affecd-8907-4245-8b6f-2835e1749e52", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://www.wcti12.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "418fb9cd-a9e4-4362-9bf1-3b36c68da470", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 06:45", "url": "https://www.thestatesman.com/world/iraqi-shiite-militia-claims-missile-attack-on-israel-1503310538.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on “a site in Haifa”, Xinhua news agency reported.\nIt provided no further details about the targeted location or any resulting casualties.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "35db1a82-916d-49ff-aedc-5b86d2cce481", "title": "Israeli prime minister vows to turn Hamas strongholds  into ruins  ", "date": "2024-06-16 11:00", "url": "http://www.myanmarmuslim.net/news/20240616020f599925.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israel’s Prime Minister Benjamin Netanyahu has warned people living in Gaza to leave as he vowed to turn parts of the territory “into ruins”.\n“All the places that Hamas hides in, operates from, we will turn them into ruins.\nMr Netanyahu also said the “first phase” of the counter operation had ended, and that Israel had fought off the majority of Hamas militants.\nHamas’ military wing claimed it was holding dozens of Israeli soldiers captive in “safe places” and tunnels in the Gaza Strip.\nThe Israeli military confirmed that a number of Israelis were abducted but would not give a figure."}, {"id": "32682b7f-3647-4881-812a-bde61a9628d7", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:00", "url": "https://wjla.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wjla.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "deb2c3a6-b546-4810-bf91-c5da0f942934", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 03:30", "url": "https://gazette.com/ap/international/8-israeli-soldiers-killed-in-southern-gaza-in-deadliest-attack-on-israeli-forces-in-months/article_c08b0b07-8cc9-5286-9a79-3fcb884eac0b.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsIsrael’s military says that eight soldiers have been killed in southern Gaza in the deadliest attack on Israeli forces in months"}, {"id": "912dcc55-47a7-408f-865b-57fdf9a0510c", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://wlos.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wlos.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "aefdb229-b44e-4a49-803c-7f707f9e5a5b", "title": "Iraqi Shiite Militia Claims Missile Attack On N . Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338215/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-N-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BAGHDAD, Jun 16 (NNN-NINA) – A Shiite in Iraq, yesterday, claimed responsibility for an attack with a missile, on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement that, its fighters launched an attack at dawn yesterday, with a long-range al-Arqab upgraded cruise missile, on“a site in Haifa.”It provided no further details about the targeted location or any resulting casualties.\nThe militia stressed that, the attack was carried out“in solidarity with the people in the Gaza Strip” and pledged to continue its attacks on“the enemy's strongholds.”Earlier yesterday, the movement claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and U.S. targets in the region, since the outbreak of the Gaza conflict on Oct 7, last year.– NNN-NINA"}, {"id": "e008d061-e7a8-4c05-9017-eaf63b6f5d5d", "title": "Iraqi Shiite Militia Claims Missile Attack On Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338213/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Baghdad, June 16 (IANS) A Shiite in Iraq has claimed responsibility for an attack with a missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "5342332c-85a0-4c37-8617-2c2ad5e3d2ae", "title": "Eight more Israeli soldiers killed in south Gaza : Report", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Eight more Israeli soldiers killed in south Gaza: ReportIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Eight Israeli soldiers were killed in an explosion that blew up a military vehicle of the Zionist regime in the south of the Gaza Strip, according to a report.\nAl Mayadeen news channel said that an anti-armor missile blew up a \"Tiger\" military vehicle of the Zionist regime on Saturday.\nAccording to the news channel, eight Israeli soldiers were killed in the Palestinian resistance operation.\nMeanwhile, the Al-Qassam Brigades, the military wing of Hamas, announced on Saturday that it destroyed an Israeli D-9 type bulldozer with an Al-Yassin 105 rocket in Tel al-Sultan area, west of Rafah, in the south of the Gaza Strip.\n6125**4354NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "115612eb-2729-44a1-83fb-884bc4e5ec47", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://turnto10.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "067f19d1-d727-4d25-8df2-b4ec9ad39139", "title": "8 Israeli soldiers killed in southern Gaza", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658056/8-israeli-soldiers-killed-in-southern-gaza", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "Attack on Israeli forces was the deadliest in months🔊 Listen to thisIsraeli army bulldozers are seen near the Gaza Strip border, in southern Israel, on Thursday.\nJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after."}, {"id": "390cc960-99df-4f04-b84a-d7a545e5f575", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 01:00", "url": "https://foxbaltimore.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "0215003e-569c-492c-a65b-b130cb364a6c", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://news3lv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "77382321-cd74-40ee-8d3c-7c282072870d", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 00:45", "url": "https://lasvegassun.com/news/2024/jun/15/8-israeli-soldiers-killed-in-southern-gaza-in-dead/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsTsafrir Abayov / Associated PressJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after."}, {"id": "71a5c70a-a65c-4c82-984a-4b3b6d26d5f6", "title": "Israel rejects Macron initiative to defuse Hezbollah conflict", "date": "2024-06-16 01:30", "url": "https://news.yahoo.com/news/israel-rejects-macron-initiative-defuse-150000834.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Israel’s defence minister has rejected Emmanuel Macron’s initiative to work together on defusing an escalating conflict along the northern border with Lebanon.\nBut Yoav Gallant on Friday ruled out joining a plan pushed by the French president that included France, the United States and Israel forming a contact group to try to find a solution.\n“As we fight a just war, defending our people, France has adopted hostile policies against Israel,” Mr Gallant said in a statement.\nHezbollah has ruled out ending hostilities until there is a ceasefire between Israel and Hamas, which has so far proved elusive.\nUS President Joe Biden’s envoy Amos Hochstein is expected to arrive in Israel on Monday to help calm tensions, Axios reported."}, {"id": "3c78be2b-811e-47f6-a43b-7366c985d03f", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 03:30", "url": "https://www.nbcmontana.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "3546a618-6205-4ff8-8bfc-21cb8bf8d6a0", "title": "APC tragedy in Rafah : Names of five soldiers who fell cleared for publication", "date": "2024-06-16 04:15", "url": "http://www.israelnationalnews.com/news/391590", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "- Staff sergeant Stanislav Kostarev, 21, from Ashdod.\n- Staff sergeant Orr Blumovitz, 20, from Pardes Hanna-Karkur.\n- Staff sergeant Oz Yeshaia Gruber, 20, from Tal Menashe.\nOn Saturday night, it was cleared for publication that one of the eight IDF soldiers killed in Rafah was Captain Wassem Mahmoud , 23, from Beit Jann.\nCommenting on the incident, IDF Spokesperson, Rear Admiral Daniel Hagari, said on Saturday night, \"Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\""}, {"id": "c5a52c4d-06a0-4d19-9ffd-7577e6e05306", "title": "Crew Abandons Cargo Ship Hit By Houthi Missile Strikes In Gulf Of Aden : US", "date": "2024-06-16 02:30", "url": "https://article.wn.com/view/2024/06/16/Crew_Abandons_Cargo_Ship_Hit_By_Houthi_Missile_Strikes_In_Gu/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The crew of a bulk cargo carrier that was damaged in a missile attack by Yemen's Huthi rebels in the Gulf of Aden has abandoned the ship, the US military said Saturday.\n...... read full story"}, {"id": "0603f60f-a685-4e8d-a4e2-092bbd0e0a15", "title": "Man seriously injured in reported stabbing", "date": "2024-06-16 11:00", "url": "https://www.yahoo.com/news/man-seriously-injured-reported-stabbing-092439249.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police were called to Heneage Road in Grimsby on Saturday evening [BBC]A 35-year-old man has been left seriously injured after a reported stabbing in Grimsby.\nHumberside Police was called at about 18:50 BST on Saturday to assist other emergency services on Heneage Road.\nThe man was taken to hospital to receive treatment for serious injuries to his back, the force said.\nFollow BBC East Yorkshire on Facebook, X (formerly Twitter) and Instagram.\nSend your story ideas to eastyorkslincs.news@bbc.co.ukFurther news from Hull and East YorkshireRelated internet links"}, {"id": "2cf5048f-0973-4973-9ebf-5d605eb98e52", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas -- China Economic Net", "date": "2024-06-16 02:00", "url": "http://en.ce.cn/main/latest/202406/16/t20240616_39038453.shtml", "domain": "en.ce.cn", "domain_classification": "Unknown", "message": "GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage."}, {"id": "90cb3a9f-1e34-4d09-b609-66cd339e0f13", "title": "Russian journalist killed in Ukraine drone strike : Media", "date": "2024-06-16 11:00", "url": "https://www.hurriyetdailynews.com/russian-journalist-killed-in-ukraine-drone-strike-media-197507", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Russian journalist killed in Ukraine drone strike: MediaMOSCOWA Russian journalist has been killed in a drone attack in eastern Ukraine, his news organisation said Sunday, two days after the death of another correspondent near the front line.\n\"Our correspondent Nikita Tsitsagi was killed during an attack by Ukrainian army drones,\" News.Ru posted on Telegram.\nOn Thursday, a journalist for Russian state television was killed and another wounded in a Ukrainian drone strike in Golmivsky, a Russian-controlled village close to the front line in the Donetsk region.\nThe Russian foreign ministry accused Ukraine of deliberately targeting the journalists.\nPresident Vladimir Putin said earlier this month that \"at least 30\" Russian journalists had been killed since the start of the conflict in Ukraine."}, {"id": "b458bb9c-c557-4435-9a62-edf1976f4183", "title": "Germany : Man wielding ax in Hamburg shot by police", "date": "2024-06-16 13:00", "url": "https://timesofoman.com/article/146756-germany-man-wielding-ax-in-hamburg-shot-by-police", "domain": "timesofoman.com", "domain_classification": "Unknown", "message": "Hamburg: Police in the northern German city of Hamburg on Sunday shot a man who attempted to attack passersby with a pickaxe, authorities said.\nThe disturbance took place in the downtown St Pauli district of the city, near where 40,000 Dutch fans were marching, ahead of the Euro 2024 soccer match against Poland later.\nOne officer fired a warning shot before several other shots were fired and the man fell to the ground, local media reported.\nSecurity has already been tightened ahead of Sunday's soccer match with hundreds of Hamburg and federal police officers deployed.\nOn Friday, police in eastern Germany shot dead a man who went on the rampage, stabbing one man to death, before gatecrashing a house party for the championship's opening match."}, {"id": "041629a9-569d-4757-8cfb-0b5c6839c718", "title": "Gallatin neighbors fearful after home explosion believed to be intentional", "date": "2024-06-16 04:45", "url": "https://www.wsmv.com/2024/06/16/gallatin-neighbors-fearful-after-home-explosion-believed-be-intentional/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "GALLATIN, Tenn. (WSMV) - A mid-morning boom that neighbors thought was a lightning strike, a sonic boom even, turned out to be an incident many won’t forget on Chaffin Court.\nThat boom, which shook homes over half a mile from the blast site, was caused by a home explosion investigators believe to be resulting from a natural gas leak.\n“The glass on this [front door] was leaning over.”Multiple neighbors reported shattered glass on the outside of their homes.\n[PREVIOUS: Woman critically injured after Gallatin home explosion, official says]“[My son said] She’s on her way back, she’s out walking,” Perdue recalled.\nThey said a gas line exploded.”The cause of the explosion remains under investigation, but investigators with the Tennessee Bureau of Investigation believe the blast was intentional."}, {"id": "96a0ae67-b6be-4f66-8fc7-f0e21e8ca7d7", "title": "Vladimir Putin marks anniversary of annexation of Ukrainian regions", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616841f599104.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin has insisted that the residents of four Ukrainian regions illegally annexed by Moscow a year ago “made their choice — to be with their fatherland”.\nIn an address released in the early hours to mark the first anniversary of the annexation, Mr Putin insisted it was carried out “in full accordance with international norms”.\nMeanwhile, in Ukraine, air defences shot down 30 out of 40 Iranian-made kamikaze drones aimed at the Odesa, Mykolaiv and Vinnytsia provinces overnight, the Ukrainian air force said.\nRomania’s Ministry of National Defence said on Saturday that “a possible unauthorised entry” into its national air space occurred overnight amid the bombardment.\nRussia’s Defence Ministry said on Saturday that it had shot down nine Ukrainian rockets fired at its southern Belgorod region, which borders Ukraine."}, {"id": "01b57309-74d5-4424-b1f1-05df77602b6f", "title": "8 Israeli Soldiers Killed in Southern Gaza", "date": "2024-06-16 06:00", "url": "https://www.theepochtimes.com/world/8-israeli-soldiers-killed-in-southern-gaza-5669358", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "JERUSALEM—Israel’s military said Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\nThe troops were killed in an explosion, the army said, without elaborating.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian terrorists in Gaza."}, {"id": "3b336963-7437-4be7-a7c4-9b1facfb8198", "title": "Ukraine uses long - Pro Gambler Choice", "date": "2024-06-16 09:45", "url": "http://www.myanmarmuslim.net/news/20240616519b599479.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "One of the officials said the US is providing more of these missiles in a new military aid package signed by President Joe Biden on Wednesday.\nThe two US officials would not provide the exact number of missiles given last month or in the latest aid package.\nUS officials say Ukraine for the first time has begun using long-range ballistic missiles, striking a Russian military airfield in Crimea (Mstyslav Chernov/AP)“The key now is speed,” Ukraine President Volodymyr Zelensky tweeted.\nPresident Biden signed into law today the support package approved by Congress, which includes Ukraine aid.\nVideos on social media last week showed the explosions at the military airfield, but officials at the time would not confirm it was the ATACMS."}, {"id": "6a181bc3-8b21-47c3-8a7d-4c03742b3f7b", "title": "Eight Israeli soldiers killed in southern Gaza", "date": "2024-06-16 05:00", "url": "https://www.afr.com/world/middle-east/eight-israeli-soldiers-killed-in-southern-gaza-20240616-p5jm5y", "domain": "afr.com", "domain_classification": "Unknown", "message": "Jerusalem | Israel’s military said on Sunday it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries destined for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nThe “tactical pause” announced by the military, which applies to about 12 kilometres of road in the Rafah area, falls far short of a complete ceasefire in the beleaguered territory that has been sought by the international community, including Israel’s top ally, the United States.\nIf it holds, the limited halt in fighting could help address some of the overwhelming needs of Palestinians that have surged even more in recent weeks with Israel’s incursion into Rafah."}, {"id": "6f075ce8-7073-4d41-9702-6ec4eccf83dc", "title": "Nearby Iranian ship ignores distress call of ship attacked by Houthis", "date": "2024-06-16 03:45", "url": "https://www.jpost.com/breaking-news/article-806366", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Anna Meta ship responded on Saturday to the distress call of the Verbena, a Palauan-flagged, Ukrainian-owned, Polish-operated bulk cargo carrier, and took the crew to safety.\nThe ship was attacked in the Gulf of Aden last week by the Yemen-backed Houthis using cruise missiles, and the distress call indicated that Verbena was abandoning the ship, The US Army's Central Command (CENTCOM) stated in a Saturday night X post.\nThe vessel's crew struggled to contain fires following the strike.\nThe post added that an Iranian frigate was eight nautical miles away from the ship at the time of the distress call and did not respond.\n\"This continued malign and reckless behavior by the Iranian-backed Houthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden,\" the statement added."}, {"id": "15fd6236-f139-4d0e-ac99-58c4a7896d68", "title": "8 soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 02:00", "url": "https://article.wn.com/view/2024/06/16/8_soldiers_killed_in_southern_Gaza_in_deadliest_attack_on_Is/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\n...... read full story"}, {"id": "0745c9b0-5477-44f9-92f5-cb9a7f52847b", "title": "2 Killed , 4 Injured In Explosion In Pakistan", "date": "2024-06-16 12:00", "url": "https://menafn.com/1108338812/2-Killed-4-Injured-In-Explosion-In-Pakistan", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Islamabad, June 16 (IANS) Two people were killed and four others in an explosion of an improvised explosive device in Pakistan's northwestern Khyber Pakhtunkhwa province on Sunday, official sources said.\nThe incident happened in the Kurram district of the province, where a vehicle carrying civilians was hit by a roadside planted device, the sources told Xinhua news agency.\nThe injured people were shifted to a nearby hospital, where four of them were in critical condition.\nThe vehicle was completely destroyed in the explosion, and the cordoned off the area for investigation.\nNo group or individual has claimed the attack yet."}, {"id": "c1fd83e9-5434-4747-9d65-db3534b726ce", "title": "Sydney knife attacker shot dead after killing six people in Bondi", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616123c599868.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosUpdated: 5pmAn attacker who fatally knifed six people in a Sydney mall was shot dead by police in the beachside suburb of Bondi on Saturday, police said, as hundreds fled the scene.\nThe assailant was shot by a police officer after he attacked shoppers in the busy Westfield Bondi Junction shopping centre, a police statement said.\nAn Irish man who is living and working Bondi told Newstalk he was inside the shopping centre when the attack happened.\nAyush Singh, 25, was working in a cafe in the mall when he saw the attack and then heard gunshots as police responded.\nThe other witness said they saw a woman lying on the ground and took shelter in a jewellery store."}, {"id": "b77a44bf-f4a5-4b61-bb0f-999c2f9fc30b", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://bakersfieldnow.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "6dd8a516-da2e-4f27-841f-b1339713c425", "title": "Rishi Sunak was given a  secret briefing  after Putin feared nuclear submarine Kazan was detected without warning off the coast of Scotland this month", "date": "2024-06-16 02:30", "url": "https://www.dailymail.co.uk/news/article-13534619/rishi-sunak-secret-briefing-russia-kazan-havana.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Rishi Sunak was given a 'secret briefing' after a Russian nuclear submarine was spotted off the coast of Scotland earlier this month, it has been revealed.\nThe 13,800-tonne submarine Kazan passed by Britain's nuclear naval base in Faslane without crossing into British waters, prompting swift reports back to the Permanent Joint Headquarters in Northwood, London, The Express reported.\nCuba's foreign ministry said the vessels carried no nuclear weapons, an assertion echoed by U.S. officials.\nRussian pro-war Telegram channels boasted that Kazan has 'guided missile weapons' on board as it passes close to the American coastline, around 25 miles east of Florida.\nBoth the Admiral Gorshkov and the Kazan are normally key vessels in Putin's nuclear strike force."}, {"id": "aac942ac-98e1-4d1d-9840-7f849c06ee90", "title": "Woman stabbed multiple times next to ATM ; police search for suspect", "date": "2024-06-16 00:00", "url": "https://www.yahoo.com/news/woman-stabbed-multiple-times-next-213942847.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (FOX 5/KUSI) — Authorities are searching for an armed suspect after a 25-year-old pregnant woman was brutally attacked in Mira Mesa on Saturday, authorities said.\nThe suspect then reportedly pushed the victim to the ground before stabbing her two more times in the upper body.\nSan Diego Police released the below photos of the suspect to FOX 5/KUSI.\nSan Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)San Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)Anyone with more information is asked contact the San Diego Police Department’s Northeastern Division at 858-538-8026 or Crime Stoppers at 888-580-8477.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "6b156d82-3e32-4732-b9ab-6e1eb75c3b6d", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://www.krcrtv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "krcrtv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "4afd18f6-ea0c-498f-b961-c6d2104864fe", "title": "Israel announces daily Gaza  pause  for aid deliveries", "date": "2024-06-16 11:00", "url": "https://www.al-monitor.com/originals/2024/06/israel-announces-daily-gaza-pause-aid-deliveries", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 16, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory.\nIsrael has long defended its efforts to let aid into Gaza including via its Kerem Shalom border near Rafah, blaming militants for looting supplies and humanitarian workers for failing to distribute them to civilians.\nThe military said the pause was already in effect and part of efforts to \"increase the volumes of humanitarian aid\" following discussions with the UN and other organisations.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected.\nIsrael's hardline National Security Minister Itamar Ben Gvir said Sunday the humanitarian pause announced by the military was part of a \"crazy and delusional approach\"."}, {"id": "7f0c828d-429f-42f7-99dd-dc4805fc9373", "title": "Iran Update , June 15 , 2024 | Institute for the Study of War", "date": "2024-06-16 02:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-june-15-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, June 15, 2024Johanna Moore, Alexandra Braverman, Kitaneh Fitzpatrick, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nWest Bank: Israeli forces engaged PIJ and the al Aqsa Martyrs Brigades fighters in Kfar Dan.\n[2]Hamas and the Nasser Salah ad Din Brigades conducted mortar and rocket attacks targeting Israeli forces along the Netzarim Corridor on June 15.\nHamas and the al Aqsa Martyrs’ Brigades conducted rocket propelled grenade attacks targeting IDF vehicles.\nThe Martyr Abu Ali Mustafa Brigades launched a salvo of rockets targeting Israeli forces stationed at the Kerem Shalom border crossing."}, {"id": "444ad74d-4297-4547-b1a8-70c7f52d231e", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 04:00", "url": "https://www.ivpressonline.com/news/nation/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_53e77bc2-0dd7-55e3-a621-657231f34c15.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "04cd6745-2515-4563-a5bd-7c13770d4404", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 05:30", "url": "https://www.thesunchronicle.com/news/nation_world/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_1d541218-005f-51f1-b52c-c4c9d0ff3a1e.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Maine police kill armed man after a night of gunfire, burned homes and another person deadA Maine State Police tactical team has killed a man on a rooftop after an hourslong standoff in which he shot at officers and two homes burned down"}, {"id": "183c6e20-2f50-4857-a373-52ec90f9d2c9", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:15", "url": "https://kitchener.citynews.ca/2024/06/15/explosions-heard-as-maine-police-deal-with-armed-individual/", "domain": "kitchener.citynews.ca", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting."}, {"id": "8a7f466b-3825-4173-877c-d91adc894d1b", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 10:45", "url": "https://ottawa.citynews.ca/2024/06/15/explosions-heard-as-maine-police-deal-with-armed-individual/", "domain": "ottawa.citynews.ca", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting."}, {"id": "1aabf89a-ccdd-45da-a177-aafd91f3ac26", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 13:45", "url": "https://www.ivpressonline.com/news/nation/maine-police-kill-armed-man-after-a-night-of-gunfire-and-burned-homes/article_53e77bc2-0dd7-55e3-a621-657231f34c15.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "Becoming windy late.\nHigher wind gusts possible.\nBecoming windy late.\nWSW winds at 10 to 15 mph, increasing to 20 to 30 mph.\nHigher wind gusts possible."}, {"id": "4c2ab2b8-7ed8-4f98-918f-667b9eb3e959", "title": "French Army head Schill talks force modernization , Ukraine war lessons", "date": "2024-06-16 14:30", "url": "https://www.yahoo.com/news/french-army-head-schill-talks-140000403.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Philippe Desmazes/AFP via Getty Images)Which key capabilities will the French Army present at Eurosatory?\nThe French army is an army of operational deployment and is a reference in Europe owing to its skills in aerocombat, the quality of its equipment and its operational experience.\nConsequently, what adjustments is the French Army making to training doctrines and equipment priorities?\nThe French Army started to deploy Scorpion in 2021, one of the most ambitious modernization programs among Western land forces.\nThis rapid deployment made it possible to mobilize more than 500 French Army soldiers in a few days."}, {"id": "e1c22f6f-4682-4bce-86e8-2558c8d9b34c", "title": "US Navy faces most intense combat since WWII against Yemen : Report", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Navy faces most intense combat since WWII against Yemen: ReportIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- The ongoing combat against Yemen is considered the most intense running sea battle the US Navy has faced since World War II, media outlets have reported.\n\"This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\n… If you let it fester, the Houthis are going to get to be a much more capable, competent, experienced force.\"\nFrom the outset of war in Gaza in October 2023, over 37,000 mostly women and children have been killed in the enclave.\n7129**9417NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "23193160-a4d9-4d7f-b108-bec7ff99219b", "title": "What to look out for at Eurosatory , Europe biggest defense show", "date": "2024-06-16 07:15", "url": "https://www.defensenews.com/digital-show-dailies/eurosatory/2024/06/16/what-to-look-out-for-at-eurosatory-europes-biggest-defense-show/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "European governments have raised their defense budgets “so the business is there,” and military planners attending the show will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing.\nLook out at Eurosatory for hardy, expendable tactical drones, as well as stealthy drones that can operate close to the battle.\nDeep firesWith artillery being key on the Ukrainian battlefield, cannons and rocket artillery will be a major topic at Eurosatory 2024, with at least 10 manufacturers showcasing their systems, Beaudouin said.\n“We’re at the dawn, but only at the dawn, of a new definition of armored vehicles,” Beaudouin said.\n“War always takes us by surprise, and forces us to adapt.”Rudy Ruitenberg is a Europe correspondent for Defense News."}, {"id": "40b03cef-f54a-4375-8451-803b1c7c3eed", "title": "Kim Jong Un pledges to launch three more spy satellites in 2024", "date": "2024-06-16 10:15", "url": "http://www.myanmarmuslim.net/news/20240616898f599045.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosNorth Korean leader Kim Jong Un said his country will launch three additional military spy satellites, build more nuclear weapons and introduce modern unmanned combat equipment in 2024.\nMr Kim’s comments were made during a ruling Workers’ Party meeting to set state goals for next year.\nHe set forth plans to fire three more military spy satellites in 2024 in addition to the country’s first reconnaissance satellite launched in November.\nNorth Korea calls the moves US-led invasion rehearsals.\nSouth Korea’s spy agency said last week that North Korea will likely launch military provocations and cyberattacks ahead of its neighbour’s parliamentary elections in April and the US presidential election in November."}, {"id": "83ed0b21-7425-47ff-a32b-e4b042fbebbb", "title": "Annalee Newitz on the sci - fi roots of the current  psyop  war", "date": "2024-06-16 13:30", "url": "https://www.salon.com/2024/06/16/annalee-newitz-on-the-sci-fi-roots-of-the-current-psyop/", "domain": "salon.com", "domain_classification": "Unknown", "message": "Paul Linebarger, author of the foundational textbook “Psychological Warfare,” also became a prominent science fiction author under the pseudonym Cordwainer Smith.\nAt least in his first edition Linebarger saw ending psychological warfare as integrally connected to waging it.\nSo what we know today as psychological warfare in the United States really does grow out of that moment.\nChapter 1, \"The Mind Bomb,\" deals primarily with early Cold War psyops, from World War II through the 1960s, though with some stage-setting: Freud's identification of the unconscious, and what followed.\nBut you can also have a culture bomb, like Wonder Woman — and Wonder Woman could not be stopped."}, {"id": "2f5ee80e-a35d-4632-8f4c-02a3a801400d", "title": "Annalee Newitz on the sci - fi roots of the current  psyop  war", "date": "2024-06-16 11:00", "url": "https://www.yahoo.com/news/annalee-newitz-sci-fi-roots-100006682.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Paul Linebarger, author of the foundational textbook “Psychological Warfare,” also became a prominent science fiction author under the pseudonym Cordwainer Smith.\nAt least in his first edition Linebarger saw ending psychological warfare as integrally connected to waging it.\nSo what we know today as psychological warfare in the United States really does grow out of that moment.\nChapter 1, \"The Mind Bomb,\" deals primarily with early Cold War psyops, from World War II through the 1960s, though with some stage-setting: Freud's identification of the unconscious, and what followed.\nBut you can also have a culture bomb, like Wonder Woman — and Wonder Woman could not be stopped."}, {"id": "71ffc444-58ae-431d-881e-5d6d064a8d18", "title": "Nagastra - 1 : India first indigenous suicide drone", "date": "2024-06-16 06:30", "url": "https://www.dnaindia.com/analysis/report-new-standard-for-tactical-warfare-nagastra-1-is-india-first-indigenous-suicide-drone-3093593", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Loitering munitions can circle above a target area and wait for the right moment to strike.\nThis advanced technology was developed by Solar Industries in Nagpur and marks an important achievement for the ‘Atmanirbhar Bharat’ (‘Self-Reliant India’) initiative.\nSolar Industries took on the arduous task of manufacturing several kinds of weaponized drones and the successful production of the Nagastra-1 is a good beginning.\nThe Indian Army has ordered the purchase of 480 drone munitions from Economic Explosives Ltd (EEL), a company fully owned by Solar Industries, as part of an emergency consignment.\nAfter successful inspection from May 20 to May 25, EEL has delivered the first batch of 120 drone munitions to the Ammunition Depot in Pulgaon."}, {"id": "c3b61eb5-88af-43d4-99e0-40f9e2f86f8e", "title": "Every Israeli , both Jews and Arabs , equal in life and death - editorial", "date": "2024-06-16 04:45", "url": "https://www.jpost.com/opinion/article-806347", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Wassem Mahmoud, a Druze Israeli who proudly served his country until his last breath.\nThe tragic deaths of Mahmoud and the seven other IDF soldiers underscore a pressing issue in Israeli society that must be urgently addressed: racism.\nThe Druze community must be equal partners not only in battle and mourning but also in life.”Tarif is correct.\n(credit: AMMAR AWAD/REUTERS)However, their contributions are often overshadowed by systemic racism and social discrimination that persist in Israeli society.\nIsraeli society must acknowledge and combat racism to create a more inclusive and cohesive nation."}, {"id": "10c38d56-0a5f-4227-bb19-b79a239c65d5", "title": "US military still has an edge , but China is catching up with hi - tech weapons", "date": "2024-06-16 01:00", "url": "https://www.scmp.com/news/china/military/article/3266740/us-military-still-has-edge-china-catching-hi-tech-weapons", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "This is the third article in a series about China’s military development, from weapons and aircraft to its role in the global supply chain and how it compares with the United States.\nWashington expressed “deep concerns” and repeatedly warned about the PLA’s regional military build-up as Beijing stepped up drills near Taiwan.\nChina’s defence industry is “robust” as a majority of the companies are state-owned with strong connections to the central leadership and “generous” funding, Heath said.\nOnly two countries – China and Russia – have such weapons in service.\nAccording to an annual report on China’s military power published in October, Beijing has the “world’s leading hypersonic arsenal” and has dramatically advanced its supersonic missile technologies in the past two decades."}, {"id": "f7e802f6-9a97-4948-afd2-84dd36c5c444", "title": "Protecting the Homeland : Stories of the victims of the APC explosion in Gaza", "date": "2024-06-16 12:00", "url": "http://www.israelnationalnews.com/news/391610", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Eight IDF soldiers from the 601st Battalion of the Iron Tracks Brigade 401 were killed on Saturday in the explosion of an APC in the Tel-Sultan neighborhood in Rafah.\nRabbi Zechariah Rabinowitz, his teacher, eulogized: \"Yakir Levi, of blessed memory, was a very bright, friendly, and courteous individual.\nThe last time he visited the yeshiva, Yakir sat with me for a deep learning session with a sparkle in his eyes.\nRabbi Zechariah Rabinowitz, his teacher at the Shalavim yeshiva, eulogized: \"Shalom loved the service of God, he knew this was the truth and loved the yeshiva and his surroundings.\nThe Hesder Yeshiva Union expressed deep sorrow at the fall of the soldiers Sergeant Yakir Yaakov Levi, Sergeant Shalom Menachem, and Sergeant Elyahu Moshe Zimbalist."}, {"id": "80642859-ef05-48ba-aa2b-b0dac0fade8a", "title": "Protecting the Homeland : Stories of the victims of the APC explosion in Gaza", "date": "2024-06-16 11:45", "url": "https://www.israelnationalnews.com/news/391610", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Eight IDF soldiers from the 601st Battalion of the Iron Tracks Brigade 401 were killed on Saturday in the explosion of an APC in the Tel-Sultan neighborhood in Rafah.\nRabbi Zechariah Rabinowitz, his teacher, eulogized: \"Yakir Levi, of blessed memory, was a very bright, friendly, and courteous individual.\nThe last time he visited the yeshiva, Yakir sat with me for a deep learning session with a sparkle in his eyes.\nRabbi Zechariah Rabinowitz, his teacher at the Shalavim yeshiva, eulogized: \"Shalom loved the service of God, he knew this was the truth and loved the yeshiva and his surroundings.\nThe Hesder Yeshiva Union expressed deep sorrow at the fall of the soldiers Sergeant Yakir Yaakov Levi, Sergeant Shalom Menachem, and Sergeant Elyahu Moshe Zimbalist."}, {"id": "a2d21c78-f019-44a0-b4e7-988d742b7bc5", "title": "North Korea building roads , walls inside Demilitarized Zone Yonhap", "date": "2024-06-16 07:15", "url": "https://www.philstar.com/world/2024/06/16/2363309/north-korea-building-roads-walls-inside-demilitarized-zone-yonhap", "domain": "philstar.com", "domain_classification": "Unknown", "message": "North Korea building roads, walls inside Demilitarized Zone — YonhapA South Korean soldier stands guard near a military facility (R, green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju on June 11, 2024.\nSEOUL, South Korea — North Korea's military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nWhen asked about the report, the South Korean military said in a statement that it was \"closely tracking and monitoring the activities of the North Korean military\", and that \"further analysis is required\".\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture."}, {"id": "444c9921-8e2c-41e0-8056-a01919a4470d", "title": "What to look out for at Eurosatory , Europe biggest defense show", "date": "2024-06-16 11:30", "url": "https://www.c4isrnet.com/digital-show-dailies/eurosatory/2024/06/16/what-to-look-out-for-at-eurosatory-europes-biggest-defense-show/", "domain": "c4isrnet.com", "domain_classification": "Unknown", "message": "European governments have raised their defense budgets “so the business is there,” and military planners attending the show will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing.\nLook out at Eurosatory for hardy, expendable tactical drones, as well as stealthy drones that can operate close to the battle.\nDeep firesWith artillery being key on the Ukrainian battlefield, cannons and rocket artillery will be a major topic at Eurosatory 2024, with at least 10 manufacturers showcasing their systems, Beaudouin said.\n“We’re at the dawn, but only at the dawn, of a new definition of armored vehicles,” Beaudouin said.\n“War always takes us by surprise, and forces us to adapt.”Rudy Ruitenberg is a Europe correspondent for Defense News."}, {"id": "67c98e68-517f-492c-b6e1-e5fa5c8f1cd2", "title": "Arcade Archives Vs . Star Luster gameplay", "date": "2024-06-16 00:45", "url": "https://nintendoeverything.com/arcade-archives-vs-star-luster-gameplay/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "As part of its latest live stream, Hamster showed off its latest Arcade Archives game – that being Vs. Star Luster.\nThe player uses the Star luster “G.A.I.A” to fight the invader “Battura” who is trying to cause a big bang.\nThe Arcade Archives series has faithfully reproduced many classic Arcade masterpieces.\nHave a look at the Arcade Archives Vs. Star Luster gameplay below.\nGameplayArcade Archives Vs. Star Luster is located on the Switch eShop."}, {"id": "c7ba91cd-3abc-4766-ab6a-a72d610114bc", "title": "Modern warfare no longer solely physical domain : IAF chief V R Chaudhari – Indian Defence Research Wing", "date": "2024-06-16 04:00", "url": "https://idrw.org/modern-warfare-no-longer-solely-physical-domain-iaf-chief-v-r-chaudhari/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Modern warfare no longer solely physical domain: IAF chief V R Chaudhari| BySOURCE: PTIModern warfare is no longer a solely physical domain, but a dynamic and ever-evolving landscape increasingly influenced by complex data networks and advanced cyber technologies, Air Chief Marshal VR Chaudhari said on Saturday.\nIt is no longer solely physical domain.\nAs leaders you all need to adapt, innovate and leverage technology effectively for proving decisive in winning wars, the Air Chief Marshal said.\nAs you embark on this extraordinary journey, let the core values of Indian Air Force-mission, integrity and excellence be your guiding beacon, he advised the cadets.\nThe ceremony included presentation of ‘Wings’ to the Flight Cadets, officers of Indian Navy, Indian Coast Guard, and officers from friendly foreign countries who successfully completed their flying training."}, {"id": "3a27135f-033e-4162-873d-760447d9170a", "title": "Bf - 109 -  hybrid  models , extended version addon - IL - 2 Sturmovik : 1946", "date": "2024-06-16 04:00", "url": "https://www.moddb.com/games/il-2-sturmovik-1946/addons/bf-109-hybrid-models-extended-version", "domain": "moddb.com", "domain_classification": "Unknown", "message": "L-2 Sturmovik (Ил-2 Штурмовик) is a WWII combat flight simulator video game, focused on the air battles of the Eastern Front.\nIt is named after the Soviet Ilyushin Il-2 ground-attack fighter, which played a prominent role in this theatre and is the single most produced military aircraft design to date.\nAlong with its sequels, IL-2 Sturmovik is considered one of the leading World War II flight simulators."}, {"id": "0d7f72ae-f27e-436d-bafe-0cccf026e20c", "title": "  Dragon Ball : Sparking ! Zero  hands - on preview", "date": "2024-06-16 10:45", "url": "https://www.rappler.com/technology/gaming/dragon-ball-sparking-zero-preview-summer-game-fest/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Veterans and newcomers alike will likely enjoy the experience of 'Dragon Ball Sparking!\nIt’s been 15 years since the last Dragon Ball Budokai Tenkaichi game, and Dragon Ball: Sparking!\nIt would’ve been great to test out the split-screen feature that’s included in the final version of Dragon Ball Sparking!\nDragon Ball Sparking!\nDragon Ball Sparking!"}, {"id": "a5df59d4-8bd8-460b-a1ae-6944428bda54", "title": "  House of the Dragon  Season 2 Review : Song of Grief & Guilt", "date": "2024-06-16 11:30", "url": "https://time.com/6987842/house-of-the-dragon-season-2-review/", "domain": "time.com", "domain_classification": "Unknown", "message": "Season 1 ended with the spilling of first blood, when Aegon’s brother Aemond (Ewan Mitchell) watched his dragon, Vhagar, devour Rhaenyra’s son Lucerys (Elliot Grihault).\nInstead, this harrowing season exposes the unique forms of grief and guilt that result when one nation—and the family that leads it—declares war on itself.\nMatt Smith as Daemon Targaryen and Emma D'Arcy as Rhaenyra Targaryen in House of the Dragon Season 2.\nHis older brother, Rhaenyra’s heir Jacaerys (Harry Collett), is at Winterfell, confirming the loyalty of the Starks.\nEwan Mitchell in House of the Dragon Season 2 Ollie Upton—HBOThe Cargylls aren’t the only ominous doppelgangers we encounter this season."}, {"id": "af35ad2f-c8c6-4630-9ac3-8f3f681486be", "title": "Nokor building roads , walls inside Demilitarized Zone – Yonhap", "date": "2024-06-16 03:30", "url": "https://manilastandard.net/news/314459953/nokor-building-roads-walls-inside-demilitarized-zone-yonhap.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -North Korea’s military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nSouth Korean authorities said it was likely accidental, and Yonhap quoted a military spokesman as saying some of the North Koreans were carrying work tools.\nThen, South Korea resumed blasting K-pop songs and news broadcasts at the North, using loudspeakers installed at the border.\nIt has previously threatened artillery strikes against the South Korean loudspeakers – a psychological warfare tactic that dates back to the 1950-53 Korean War."}, {"id": "bee5732e-10f8-403d-864f-a209e61993e4", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658059/ukraine-employs-a-flexible-defense-while-waiting-for-new-western-ammo-to-get-to-the-front", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukrainian firepower has been improving since U.S. lawmakers approved a much-needed military aid package this spring, though not quickly enough to halt the Russian offensive in eastern Ukraine.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago.\nOne unit in the Chasiv Yar area said a quarter of its casualties happen while transporting troops to and from front-line positions.\nTor, the commander of the Kotyky unit in Chasiv Yar, said Russia’s ever-present drones have made it impossible to mask especially large troop movements."}, {"id": "8ae112ad-61a0-433f-aadd-aeef7516e7e8", "title": "Ukrainian Writer - Soldier Says All Russians Are to Blame for Invasion", "date": "2024-06-16 13:30", "url": "https://www.businessinsider.com/ukrainian-writer-soldier-russia-invasion-blames-all-russians-war-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Within a week of the invasion, Mykhed, a renowned author who has published nine books, had enlisted in the Ukrainian Armed Forces, and his former home had been destroyed by a Russian attack.\nCentral to the work is his view that the war is not Putin's but a war carried out by all Russians.\nIt's not Putin who is pulling the trigger in Bucha,\" he says, referencing the massacre that took place in 2022.\nIn late February, Ukrainian President Volodymyr Zelenskyy said 31,000 Ukrainian soldiers had been killed since Russia launched the invasion.\nNevertheless, the war in Ukraine rages on, and Mykhed offers me a stark reminder of that fact when talking about his book."}, {"id": "717e4c19-e34d-40d8-8f88-62e7d78ea345", "title": "Pentagon secret anti - vax campaign against China reveals Manila is seen as nothing more than consumable", "date": "2024-06-16 13:45", "url": "https://www.globaltimes.cn/page/202406/1314223.shtml", "domain": "globaltimes.cn", "domain_classification": "Unknown", "message": "Illustration: Liu Rui/GTReuters published a report on June 14 that angered the people of the Philippines.\nBy November 2021, the death toll in the Philippines due to COVID-19 reached over 48,000.\nCurrently, under the brainwashing of the US, the Philippine government has adopted a confrontational policy toward China, leading to increased tension in both China-Philippine diplomatic and economic relations due to the South China Sea issue.\nThe Filipinos should see clearly that the US never truly wants to help the Philippines develop.\nAs a geopolitical \"pawn,\" the Philippines is seen as nothing more than a \"consumable\" by the US."}, {"id": "21dcd5b1-7552-4908-b0a6-c7f7ddbfd3f8", "title": "My Eternal Quest to Find My Present - Proof Dad a Gift He Wont Return", "date": "2024-06-16 11:30", "url": "https://www.yahoo.com/lifestyle/eternal-quest-present-proof-dad-094000411.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "You know it won’t go well when he opens something and you have to explain it.\n“You know, I could buy a BMW if I wanted to,” my dad would say (though he faithfully took the Metra train every day to work).\nInstead, my dad goes to the store once a day to buy a bag of spinach and an orange.\nBefore his 16th birthday, like she did for each of her nine sons’ birthdays, my grandma asked my dad what he wanted for dinner.\nI spent a good deal of time walking the wooden floors of Ace Hardware, where my dad went for grout-related matters or to find replacement light bulbs for my mom’s old lamps."}, {"id": "03791987-f3e5-44bd-8b40-bdc543178413", "title": "Ukrainian writer and soldier says all Russians are to blame for the invasion :  It not Putin who is pulling the trigger in Bucha  ", "date": "2024-06-16 13:30", "url": "https://www.yahoo.com/news/ukrainian-writer-soldier-says-russians-123351504.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Oleksandr Mykhed is a Ukrainian author who became a soldier following the Russian invasion.\nWithin a week of the invasion, Mykhed, a renowned author who has published nine books, had enlisted in the Ukrainian Armed Forces, and his former home had been destroyed by a Russian attack.\nMeeting me in London to discuss the book, Mykhed appears a hardened and determined figure, shaped by a conflict already stretching into its third year.\nIt's not Putin who is pulling the trigger in Bucha,\" he says, referencing the massacre that took place in 2022.\nIn late February, Ukrainian President Volodymyr Zelenskyy said 31,000 Ukrainian soldiers had been killed since Russia launched the invasion."}, {"id": "cd950b3d-46ff-40a1-be9d-4a63193df8bf", "title": "Ukrainian writer and soldier says all Russians are to blame for the invasion :  It not Putin who is pulling the trigger in Bucha  ", "date": "2024-06-16 13:30", "url": "https://www.yahoo.com/news/ukrainian-writer-soldier-says-russians-123351447.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Oleksandr Mykhed is a Ukrainian author who became a soldier following the Russian invasion.\nWithin a week of the invasion, Mykhed, a renowned author who has published nine books, had enlisted in the Ukrainian Armed Forces, and his former home had been destroyed by a Russian attack.\nMeeting me in London to discuss the book, Mykhed appears a hardened and determined figure, shaped by a conflict already stretching into its third year.\nIt's not Putin who is pulling the trigger in Bucha,\" he says, referencing the massacre that took place in 2022.\nIn late February, Ukrainian President Volodymyr Zelenskyy said 31,000 Ukrainian soldiers had been killed since Russia launched the invasion."}, {"id": "a2196d23-e46e-4f13-9bba-2d3cfad4cf03", "title": "Wyoming History : Battle Of The Rosebud Started … ", "date": "2024-06-16 02:30", "url": "https://cowboystatedaily.com/2024/06/15/wyoming-history-battle-of-the-rosebud-started-great-sioux-wars-of-1876/", "domain": "cowboystatedaily.com", "domain_classification": "Unknown", "message": "It’s called the Battle of the Rosebud by historians, and the Battle Where the Girl Saved Her Brother by the Cheyenne and other native tribes.\n“He gets on and they ride out through the Northern Cheyenne battle line.\n(Cowboy State Daily Staff)The New York Herald carried an account of the Battle of the Rosebud on Saturday, June 24, 1876.\n(Cowboy State Daily Staff)Cheyenne’s Democratic Leader reports on June 24, 1876, the results of the Battle of the Rosebud from a correspondent with Crook.\n(Cowboy State Daily Staff) Arrow left Arrow rightNatives ‘Magnificently Mounted’Journalists embedded with Crook reported that the native warriors were skilled."}, {"id": "e994718d-6bee-4d65-9a5f-72646e381afc", "title": "More Gazans Killed As Israeli Strikes Continue", "date": "2024-06-16 04:00", "url": "https://menafn.com/1108338239/More-Gazans-Killed-As-Israeli-Strikes-Continue", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Eight Israeli were killed in the southern Gaza Strip Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nFour others were killed in separate attacks in the south, medics said.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza."}, {"id": "e00ec5fd-b69d-4b3d-9f34-5e25fda39258", "title": "Russia and Belarus launch second stage of tactical nuclear weapons drills", "date": "2024-06-16 02:00", "url": "https://www.heraldscotland.com/news/national/24379585.russia-belarus-launch-second-stage-tactical-nuclear-weapons-drills/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "During the second stage of the drills that began on Tuesday, Russian and Belarusian troops will undergo joint training in non-strategic nuclear weapons used in combat, the Defence Ministry said.\nThe Russian military had trained separately during the initial stage of the manoeuvres before joint drills with Belarusian forces.\nLast year, Russia moved some of its tactical nuclear weapons into neighbouring Belarus, which also borders Ukraine and Nato members Poland, Latvia and Lithuania.\nTactical nuclear weapons include air bombs, warheads for short-range missiles and artillery munitions and are meant for use on a battlefield.\nMr Putin pointed at the country’s nuclear doctrine that envisages the use of nuclear weapons in case of a threat to its sovereignty and territorial integrity."}, {"id": "cd56182a-f969-44b7-b58b-0d4730a26681", "title": "Veteran , 96 , continues quest for medal over wound suffered in Korean War", "date": "2024-06-16 10:45", "url": "http://www.myanmarmuslim.net/news/20240616740e599204.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Mr Meyer has provided the Army with documents to back up his assertion that he was wounded in combat in June 1951.\nAn Army review board in April issued what it called a final rejection of Mr Meyer’s request for a Purple Heart, citing insufficient documentation.\n“At first I didn’t know that I had been wounded,” Mr Meyer wrote in a sworn statement that was part of his rejected appeal.\nThe Army’s Office of Public Affairs said it does not comment on ongoing litigation.\n“The Sergeant Major of the Army’s Office is engaging with Mr. Meyer’s family and looking into the situation,” spokesperson Master Sgt."}, {"id": "ab3132ff-ad3c-42e2-9420-cc4fb2e0622f", "title": "Monument to wartime malaria victims unveiled on Okinawa isle | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-16 08:45", "url": "https://www.asahi.com/ajw/articles/15307493", "domain": "asahi.com", "domain_classification": "Unknown", "message": "TAKETOMI, Okinawa Prefecture--A memorial ceremony was held for victims of a disastrous wartime relocation program by the Japanese military that left hundreds of islanders dead from malaria.\nAbout one-third of them died from malaria, either in Iriomotejima or after their return to Haterumajima following Japan’s defeat in the war.\nThe decision to move the islanders was made as the bloody Battle of Okinawa was getting under way.\nRelatives of the victims, as well as local school children, came to offer prayers that the tragedy would not be forgotten.\nHis siblings also contracted malaria, and five of the seven died, including his older brother who was killed in action."}, {"id": "6718a806-7793-4fb4-886d-a74e30752799", "title": "Biden Holds LA Fundraiser As Trump Courts Michigan", "date": "2024-06-16 05:45", "url": "https://www.urdupoint.com/en/world/biden-holds-la-fundraiser-as-trump-courts-mic-1836001.html", "domain": "urdupoint.com", "domain_classification": "Unknown", "message": "His turn with the stars means Biden skipped a huge international peace conference for Ukraine on Saturday in Switzerland, with Vice President Kamala Harris attending instead.\nBut Biden's team said the fundraiser was a \"show of force with leaders across the entertainment industry sending a clear signal: they are united and enthusiastic about reelecting President Biden and Vice President Harris.\"\nIn Los Angeles, Biden and Obama, under whom he served as vice president, will take part in a conversation moderated by late-night US comic Jimmy Kimmel.\nThe Democrat is expected to go on the offensive on issues like abortion and democracy where his campaign thinks Trump is vulnerable.\nTheir last debates, in 2020, were tension-filled affairs, with Biden at one point snapping \"will you shut up, man?\""}, {"id": "36f18490-074a-4c6d-8eca-e5a13766104d", "title": "China views Taiwan  elimination  as national cause : Taiwan president", "date": "2024-06-16 05:15", "url": "https://economictimes.indiatimes.com/news/defence/china-views-taiwans-elimination-as-national-cause-taiwan-president/articleshow/111032429.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelChina views the annexation and \" elimination \" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina staged war games around Taiwan shortly after Lai's inauguration.Lai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.Speaking in Kaohsiung in the south of the island on the 100th anniversary of the founding of the Whampoa Military Academy, Lai said today's cadets must recognise the challenges of the \"new era\".\n\"The biggest challenge is to face the powerful rise of China, (which is) destroying the status quo in the Taiwan Strait and regards Taiwan's annexation and the elimination of the Republic of China as the great rejuvenating cause of its people,\" he said, using Taiwan's formal name.China' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.Wang Huning, the fourth-ranked leader in China's ruling Communist Party, told a Saturday forum in China about relations with Taiwan that \"reunification is a historical necessity for the great rejuvenation of the Chinese nation\", vowing to \"smash any separatist plots\".Lai, at the event attended by senior military officials and also the top U.S. diplomat in Kaohsiung, Neil Gibson, said the cadets must defend Taiwan against being annexed by China and that the island's future can only be decided by its people.\n\"We really must be able to distinguish between ourselves and our enemies and between friend and foe, and absolutely cannot accept the defeatism of 'the first battle is the last battle',\" Lai said, referring to a theory that Taiwan could collapse as soon as China launched any attack.The academy was founded in China's Guangzhou - then known in English as Canton - in 1924, more than a decade after the establishment of the Republic of China, which overthrew the last emperor.Set up with the help of the Soviet Union to give China a professional military loyal to the nascent state, it moved to Nanjing, Chengdu and finally Kaohsiung after the defeated Republican government fled to the island in 1949 at the end of a civil war won by Mao Zedong and his communist forces.China says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "fd3b69d5-48b6-489c-aa98-cf8a9b39c0e9", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 05:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/china-views-taiwans-elimination-as-national-cause-taiwan-president-says/articleshow/111032207.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "KAOHSIUNG: China views the annexation and \" elimination \" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina staged war games around Taiwan shortly after Lai's inauguration.Lai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.Speaking in Kaohsiung in the south of the island on the 100th anniversary of the founding of the Whampoa Military Academy , Lai said today's cadets must recognise the challenges of the \"new era\".\n\"The biggest challenge is to face the powerful rise of China, (which is) destroying the status quo in the Taiwan Strait and regards Taiwan's annexation and the elimination of the Republic of China as the great rejuvenating cause of its people,\" he said, using Taiwan's formal name.China' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.Wang Huning, the fourth-ranked leader in China's ruling Communist Party, told a Saturday forum in China about relations with Taiwan that \"reunification is a historical necessity for the great rejuvenation of the Chinese nation\", vowing to \"smash any separatist plots\".Lai, at the event attended by senior military officials and also the top U.S. diplomat in Kaohsiung, Neil Gibson, said the cadets must defend Taiwan against being annexed by China and that the island's future can only be decided by its people.\n\"We really must be able to distinguish between ourselves and our enemies and between friend and foe, and absolutely cannot accept the defeatism of 'the first battle is the last battle',\" Lai said, referring to a theory that Taiwan could collapse as soon as China launched any attack.The academy was founded in China's Guangzhou - then known in English as Canton - in 1924, more than a decade after the establishment of the Republic of China, which overthrew the last emperor.Set up with the help of the Soviet Union to give China a professional military loyal to the nascent state, it moved to Nanjing, Chengdu and finally Kaohsiung after the defeated Republican government fled to the island in 1949 at the end of a civil war won by Mao Zedong and his communist forces.China says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "c5d78abd-1cd3-4629-ac0f-8cce097e712a", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 06:15", "url": "https://www.rappler.com/world/asia-pacific/china-views-taiwan-elimination-national-cause-taiwan-president-lai-ching-te/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a “separatist.” China staged war games around Taiwan shortly after Lai’s inauguration.\nLai says only Taiwan’s people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina’ Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai’s remarks.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "11037783-95c7-47ba-aee4-0d5583320ce2", "title": "China views Taiwan  elimination  as national cause , President Lai Ching - te says - World", "date": "2024-06-16 10:15", "url": "https://www.dawn.com/news/1840262/china-views-taiwans-elimination-as-national-cause-president-lai-ching-te-says", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "China views the annexation and “elimination” of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military’s premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a “separatist”.\nLai says only Taiwan’s people can decide their future and has repeatedly offered talks with Beijing but has been rebuffed.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "94618849-2b99-4012-9604-80d0f3b1e704", "title": "China sees annexation of Taiwan as  great national cause , Taiwanese prez warns", "date": "2024-06-16 07:45", "url": "https://www.firstpost.com/world/china-sees-annexation-of-taiwan-as-great-national-cause-taiwanese-prez-warns-13783006.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a ‘separatist’.\nChina staged war games around Taiwan shortly after Lai’s inauguration.\nAdvertisementLai says only Taiwan’s people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "f65e379f-eddd-4f75-ba95-9ea753512d80", "title": "China Views Taiwan  elimination  as National Cause , Taiwan President Says", "date": "2024-06-16 13:45", "url": "https://www.newsmax.com/world/globaltalk/taiwan-china/2024/06/16/id/1168906/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "China views the annexation and \"elimination\" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist.\"\nChina' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "18eb0150-4b97-466f-b56a-b537871ba4e1", "title": "Iran to react if Israel conducts broad raid on Lebanon : Israeli media", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iran to react if Israel conducts broad raid on Lebanon: Israeli mediaIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Media outlets of the Israeli regime warned their leaders in Tel Aviv that if the regime launches a full-scale attack on Lebanon, Iran is likely to get involved.\nThe anchor added that the Israeli army is worn out and completely reliant on US weapons, and its internal front is completely defenseless, so the authorities should think well before deciding to expand the war.\nMoreover, the Radio Israel reported earlier that the cabinet of this regime decided to call up another 50,000 reserve soldiers to be ready in case of any increase in engagement in the Lebanese front.\nMeanwhile, deputy secretary-general of Hezbollah Sheikh Naim Qassem had previously warned that if the Israeli regime seeks to engage in a full-scale war, Hezbollah is prepared to confront it.\n4208**9417NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "8fb9a3bf-4c7d-4c15-8f19-b9c94f914dde", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 05:00", "url": "https://www.yahoo.com/news/china-views-taiwans-elimination-national-041848871.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Ann WangKAOHSIUNG, Taiwan (Reuters) - China views the annexation and \"elimination\" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nLai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "a67e4a42-0708-492f-bdcf-41d0b9b9043e", "title": "Napoleon hat sells for €1 . 9m at auction - Bet Winners Guide", "date": "2024-06-16 10:00", "url": "http://www.myanmarmuslim.net/news/20240616974c599021.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosA faded and cracked felt hat worn by Napoleon Bonaparte has fetched €1.9 million at an auction of the French emperor’s belongings.\nA visitor looks at the hat before the auction (Christophe Ena/AP)But the bidding quickly jumped higher until Jean Pierre Osenat, president of the Osenat auction house, designated the winner.\n“We are at €1.5 million for Napoleon’s hat… for this major symbol of the Napoleonic epoch,” he said, as applause rang out in the auction hall.\nWhile other officers customarily wore their hats with the wings facing front to back, Napoleon wore his with the ends pointing toward his shoulders.\nThe entrepreneur spent more than half a century assembling his collection of Napoleonic memorabilia, firearms, swords and coins before his death in 2022."}, {"id": "a1a6ab86-1b4b-4283-ad84-3aeaaaf23976", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 06:15", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217464/China-views-Taiwan", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Taiwanese President Lai Ching-te visits Republic of China Military Academy, an officer training academy, for its 100th anniversary celebrations in Kaohsiung, Taiwan June 16, 2024.\n(Reuters)China views the annexation and \"elimination\" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "cc8f586d-24a2-4912-90a7-1941ee751852", "title": "  Weep Over Fall of Our Fighter : PM Benjamin Netanyahu As Eight Israeli Soldiers Killed In Southern Gaza", "date": "2024-06-16 02:00", "url": "https://www.news18.com/world/israel-hamas-war-eight-idf-soldiers-killed-as-fighting-continues-in-gazan-city-of-rafah-8933938.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Prime Minister Benjamin Netanyahu on Saturday expressed grief over the killing of eight Israeli soldiers in the southern Gaza Strip.\nThis comes as Israeli forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nPrime Minister Netanyahu, this evening:“Citizens of Israel, today we paid a heart-rending price in our just war in defense of our homeland.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nThe deaths of the soldiers may complicate the political situation facing Prime Minister Benjamin Netanyahu, a week after centrist former general Benny Gantz quit the government, accusing Netanyahu of having no proper strategy for Gaza."}, {"id": "da3ae161-4803-43eb-90ab-acaffa94fce8", "title": "BOOK NOOK : Remembering the 80th anniversary of D - Day", "date": "2024-06-16 13:45", "url": "https://www.daytondailynews.com/lifestyles/book-nook-remembering-the-80th-anniversary-of-d-day/AVZ6QYF43FBNXLUPBDZ6NQPGYQ/", "domain": "daytondailynews.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "d60944cc-8786-46bf-a4e7-9bc1fec0a30c", "title": "Australia and New Zealand honour their war dead with dawn services on Anzac Day", "date": "2024-06-16 11:15", "url": "http://www.myanmarmuslim.net/news/20240616470f599521.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosHundreds of thousands of people gathered under a full moon across Australia and New Zealand for dawn services on Thursday to commemorate their war dead on Anzac Day.\nMr Albanese trekked to the memorial in the town of Isurava over two days with Papua New Guinea Prime Minister James Marape.\nWords that adorn the Memorial at Isurava on the Kokoda Track where I was honoured to commemorate Anzac Day at a moving ceremony, together with PNG Prime Minister James Marape.\nChina’s foreign minister Wang Yi visited Papua New Guinea at the weekend to discuss with Mr Marape building closer relations.\nIn New Zealand, Mr Luxon told the crowd that the country had to thank its military personnel for their freedom and democracy."}, {"id": "c4b5119f-d05c-411b-ad9e-b5e4e5cad7fe", "title": "Olivia Colman and Benedict Cumberbatch seen together for a SECOND time as they film remake of Hollywood classic War Of The Roses - where they play married couple", "date": "2024-06-16 00:45", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13534559/Olivia-Colman-Benedict-Cumberbatch-War-Roses.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "They are two titans of the British acting world who look delighted to be working together for the first time in their illustrious careers.\nBut Olivia Colman and Benedict Cumberbatch will soon be at each others' throats – their new film is a remake of the dark divorce comedy The War Of The Roses.\nThe Crown star Colman, 50, and Sherlock's Cumberbatch, 47, were seen shooting their first scenes in the pretty Devon resort town of Salcombe last week.\nColman, who plays Ivy, wore a navy and white striped jumper and wide-leg trousers as she kissed Cumberbatch, who plays husband Theo, in a blue-grey jacket.\nProducers Searchlight Pictures say of the plot: 'Life seems easy for picture-perfect couple Theo and Ivy: successful careers, great kids, an enviable sex life."}, {"id": "28214a29-a7fd-4a5a-aff4-7626e57e6976", "title": "On This Day , June 16 : Sara Jane Olson captured after 20 years on the run", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/day-june-16-sara-jane-070006512.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On This Day, June 16: Sara Jane Olson captured after 20 years on the runOn June 16, 1999, police arrested Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army, which kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009.\nOn June 16, 1963, the Soviet Union put the first woman into space, cosmonaut Tereshkova.\nIn 1999, police arrested Sara Jane Olson, formerly known as Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army that kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009."}, {"id": "b400fd92-790c-4ed2-b1b7-a0d96ed0535f", "title": "US military seizes Iranian missile parts bound for Houthi rebels", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616287a599709.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosUS Navy Seals seized Iranian-made missile parts and other weaponry from a ship bound for Yemen’s Houthi rebels in a raid last week in which two commandos went missing, the US military said on Tuesday.\nThe seized missile components included types likely to have been used in those attacks.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nA United Nations resolution bans arms transfers to Yemen’s Iranian-backed Houthi rebels.\nTehran has long denied arming the rebels, despite physical evidence, numerous seizures and experts tying the weapons back to Iran."}, {"id": "fa72142e-6555-42f0-9275-07bc3b7e9d15", "title": "235 officers , including 22 women , join Air Force", "date": "2024-06-16 06:30", "url": "https://www.newindianexpress.com/thesundaystandard/2024/Jun/16/235-officers-including-22-women-join-air-force", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "NEW DELHI: The Combined Graduation Parade (CGP) was held at the Air Force Academy at Dundigal near Hyderabad on Saturday to mark the culmination of the training of 235 flight cadets of flying and ground duty branches of the Indian Air Force.\n“The graduating officers included 22 women officers who got commissioned in various branches of the IAF,” said an official statement.\nNine officers from the Indian Navy, nine from the Indian Coast Guard, and one officer from the friendly foreign countries were also awarded ‘wings’ on completion of flying training, it added.\nThis is also the first CGP where 25 cadets, who joined the National Defence Academy four years ago for ground duty branches, were commissioned as officers.\nFive of these officers have been commissioned in the administration branch, three in the logistics branch and 17 in the technical branch of the Air Force."}, {"id": "471d69f5-7419-467b-b53c-5e6395bcfa36", "title": "Russia a No - Show at  Swiss Peace Conference  ", "date": "2024-06-16 01:00", "url": "https://pjmedia.com/rick-moran/2024/06/15/russia-a-no-show-at-swiss-peace-conference-n4929918", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "But whenever Ukraine decides to sue for peace, the cost of rebuilding the shattered nation is approaching half a trillion dollars.\nAt the moment, the United States is standing four-square behind Kyiv.\nAnd that means the United States needs to enforce those rules, norms, and principles or they're just words on a piece of paper.\nAnd many in the West see no other way than continuing the war against Russia.\nI don't think Biden is dumb enough to start a war with Russia over Ukraine."}, {"id": "e1de500d-231c-4b08-8456-3aa3785e4e48", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 12:00", "url": "https://www.the-star.co.ke/news/world/2024-06-16-israel-announces-military-pause-on-gaza-road-to-let-in-aid/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nAid agencies have repeatedly reported difficulties in distributing aid around Gaza."}, {"id": "7b177232-d21c-46ef-aa50-a2bc1f5151ce", "title": "Africa Great Green Wall to miss 2030 goal", "date": "2024-06-16 13:45", "url": "https://dunyanews.tv/en/Business/818867-Africa%5C", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Africa's Great Green Wall to miss 2030 goalBusiness Business Africa's Great Green Wall to miss 2030 goalUnlikely to meet a decade-end goal of reinstating 100m hectare of landFollow on Updated On: Sun, 16 Jun 2024 15:45:07 PKTLONDON/DAKAR (Reuters) – Africa's Great Green Wall, which is meant to restore degraded landscapes and boost economies across the continent, is low on cash and unlikely to meet a 2030 completion goal, the president of the most recent UN summit on desertification told Reuters.\nWith no centralised monitoring strategy, coordinating the work across the 11 African countries involved has been especially challenging, Donwahi said.\nThose pledged funds are also being spread across different projects that may be dedicated to international development, but not necessarily to the Great Green Wall, Donwahi said.\nEven so, it is unclear where the project will get the remaining billions needed to get back on track.\nDonwahi said more investment would be needed from international donors, the private sector and Green Wall countries themselves."}, {"id": "3bc7228c-4d63-4d2e-8154-88a24fa92f84", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.myjoyonline.com/israel-announces-military-pause-on-gaza-road-to-let-in-aid/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Israel is under pressure from its allies to enable sufficient aid to reach those living in GazaThe Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nAid agencies have repeatedly reported difficulties in distributing aid around Gaza."}, {"id": "04ff9f2e-cc06-4893-b2bf-65e9be19d1e5", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.bbc.co.uk/news/articles/cgeepk8rp9xo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "A spokesman for ActionAid, which is helping to deliver supplies in Gaza, told the BBC that the pause would help aid getting in but that they needed more details about logistics.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe number of aid trucks entering Gaza continues to be well below what agencies have said is required.\nOCHA reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day."}, {"id": "16e6404e-c86a-44ce-99fd-3735e72fd7c6", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.bbc.com/news/articles/cgeepk8rp9xo", "domain": "bbc.com", "domain_classification": "International", "message": "They will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nOCHA reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day."}, {"id": "dc66fa38-64c0-4e24-90cc-5703e0003cc4", "title": "Japan PM calls for global efforts to achieve lasting peace in Ukraine", "date": "2024-06-16 00:30", "url": "https://english.kyodonews.net:443/news/2024/06/83d22adbb7a5-japan-pm-calls-for-global-efforts-to-achieve-lasting-peace-in-ukraine.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 14 hours ago - 09:05 | All, World, JapanJapanese Prime Minister Fumio Kishida on Saturday called for global efforts to achieve a \"just and lasting peace\" in Ukraine as the world's major powers, the United States and China, are divided over how to deal with Russia's invasion of its neighbor.\nThe Soviet Union, of which Russia and Ukraine were both a part, suffered the world's worst nuclear accident in 1986 at Chernobyl.\nJapan experienced the Fukushima Daiichi nuclear plant crisis triggered by a devastating earthquake and tsunami in March 2011.\nDuring the two-day meeting through Sunday, about 100 representatives of countries and international institutions, including some 60 leaders, will exchange views on peace proposals for Ukraine, according to the Swiss government.\nRelated coverage:Dozens of leaders gather in Switzerland at critical time for UkraineG7 needs to keep tackling Indo-Pacific issues as priority: Japan PMOPINION: Ukraine peace process must start with Swiss summit"}, {"id": "dde7afb9-c98d-4e65-b5c1-3fc6ba232063", "title": "Israel can dig in or declare victory and gain advantages", "date": "2024-06-16 13:45", "url": "https://forward.com/opinion/623581/israel-can-dig-in-or-declare-victory-and-gain-advantages/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Meanwhile, Israel continues to bleed — eight soldiers were killed on Saturday in the deadliest mishap for the IDF in six months.\nThat would probably bring massive rocket attacks on Tel Aviv and central Israel — something Israel has not yet really experienced.\nYet Israel is one of the exceptions: Its multi-front war in 1967 was among the most successful military efforts in recent history.\nYet Hamas would claim victory, perhaps giving tailwind to jihadis everywhere (America and Europe being no exception).\nIn exchange for assuming such a risk, Israel would expect a series of rewards and advantages."}, {"id": "a1363db9-75f1-474f-b125-29f8d540824b", "title": "Eight Israeli soldiers and 19 Palestinians killed as fighting continues in Rafah - 16 - Jun - 2024", "date": "2024-06-16 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400483", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Eight Israeli soldiers have been killed in a blast in the southern Gaza Strip, the military says, as its forces continue to push into the city of Rafah, with strikes in several areas of Gaza killing at least 19 Palestinians, residents and medics say.\nAccording to the Israel Defense Forces (IDF), the Israeli soldiers were in an armoured carrier that detonated on Saturday while carrying combat engineering materials, apparently in contravention of standard practice.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nAt least 15 people were killed by Israeli air strikes on two houses in Gaza City suburbs, according to residents.\nAt least 37,296 Palestinians have been killed in Israel's military campaign against Hamas, according to the Gaza health ministry."}, {"id": "d44573c1-356a-496d-955a-074d72607dfc", "title": "  Elimination  of Taiwan is China great national cause , Lai says | Politics News", "date": "2024-06-16 11:15", "url": "https://www.aljazeera.com/news/2024/6/16/elimination-of-taiwan-is-chinas-great-national-cause-lai-says", "domain": "aljazeera.com", "domain_classification": "International", "message": "Taiwan’s president tells military academy cadets that the main challenge they face is the strong rise of Beijing.\nChina views the “annexation” and “elimination” of Taiwan as its great national cause, Taiwan’s President William Lai Ching-te said, telling cadets at the military’s premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory.\nChina also deployed aircraft in Taiwan’s airspace and staged a major military drill around Taiwan shortly after Lai’s inauguration.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "d52bfbaa-fc50-43a8-8ad4-83fee1321e0c", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/israel-announces-military-pause-gaza-080608938.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel announces military pause on Gaza road to let in aidIsrael is under pressure from its allies to enable sufficient aid to reach those living in Gaza [Anadolu]The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter, but emphasised that there is no ceasefire and combat would continue in Rafah.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97."}, {"id": "6a620bf2-cf5e-4428-b148-134351cff002", "title": "Jujutsu Kaisen : Will Sukuna Return to Yuji Body Once Again ? Gege Akutami Hints New Move", "date": "2024-06-16 14:30", "url": "https://www.pinkvilla.com/entertainment/anime/jujutsu-kaisen-will-sukuna-return-to-yujis-body-once-again-gege-akutami-hints-new-move-1317283", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "As the Jujutsu Kaisen manga nears its climax, fans are considering the conclusion of Yuji Itadori and Ryomen Sukuna's story arc.\nSukuna might return to Yuji's bodyA Reddit theory suggests that after Ryomen Sukuna is removed from Megumi Fushiguro's body by Jujutsu Sorcerers, the King of Curses may return to Yuji Itadori's body, according to u/KazuyaProta.\nManga creator Gege Akutami may kill off both characters together after Sukuna reenters Yuji's body, as Yuji might consider dying in combat honorific.\nImmense Durability: Even in Yuji's body, Sukuna can use cursed energy to bolster his host's resilience.\nAdvertisementALSO READ: Jujutsu Kaisen Chapter 262 Cliffhanger Has Rika's Life In Question; Here's All We Know"}, {"id": "0423184f-c86b-4d2b-85fd-54c0936dd24a", "title": "IDF Names Six Soldiers Killed in Saturday Rafah Blast , and Two Killed in Northern Gaza - Israel News", "date": "2024-06-16 11:30", "url": "https://www.haaretz.com/israel-news/2024-06-16/ty-article/.premium/idf-names-five-soldiers-killed-in-saturdays-rafah-blast-and-two-killed-in-northern-gaza/00000190-1fd3-d4b4-a7d6-dff30cc60000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "The Israeli army released on Sunday the names of two reservists killed in a tank explosion in northern Gaza, as well as the names of six of the eight soldiers killed in Rafah on Saturday."}, {"id": "e6362765-330d-4a87-857f-1e5292c52897", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 06:15", "url": "https://www.thestandard.com.hk/breaking-news/section/6/217460/Eight-Israeli-soldiers-killed-as-fighting-continues-in-Rafah", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)Eight Israeli soldiers were killed in the southern Gaza Strip on Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza."}, {"id": "4c49cfea-7ed1-4c31-a4d3-17b05b143633", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 09:00", "url": "https://www.stabroeknews.com/2024/06/16/news/world/eight-israeli-soldiers-killed-as-fighting-continues-in-rafah/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "JERUSALEM/CAIRO, (Reuters) – Eight Israeli soldiers were killed in the southern Gaza Strip yesterday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities."}, {"id": "22740dfa-5621-4840-800a-3f29defce589", "title": "Putin peace terms slammed at Ukraine summit", "date": "2024-06-16 11:30", "url": "https://www.myjoyonline.com/putin-peace-terms-slammed-at-ukraine-summit/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Italy's Prime Minister Giorgia Meloni called the Russian president's plan \"propaganda\" which effectively suggested that Ukraine \"must withdraw from Ukraine\".\nA draft declaration issued at the summit reaffirms Ukraine's territorial integrity and unambiguously rejects any nuclear threat against the country.\nMr Putin revealed his terms ahead of the two-day Summit on Peace in Ukraine which is aimed at discussing the basic principles for ending the war.\nMr Putin has already ruled out any kind of peace process on Ukraine’s terms.\nThe Swiss summit comes after G7 leaders agreed to use interest from frozen Russian assets to help Ukraine defend itself against the invading Russian forces."}, {"id": "a4f54c07-5f61-4363-aa7a-413dfc8734ae", "title": "Justice Road : A Perspective on the Synder Act", "date": "2024-06-16 04:15", "url": "https://www.yahoo.com/news/justice-road-perspective-synder-act-035457915.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "America paid veterans of theAmerican Revolutionary War in Indian land grants and it hadn’t even acquired the land from the Natives yet.\nShe and my grandfather, Eugene Seelye, were born before the Snyder Act (Indian Citizenship Act) of 1924.\nOur family couldn’t escape the oppressions any better than any other Native family.\nThey weren’t naïve about the irony, but if they had to defend America to defend Native America, they were willing to do that.\nMany Native Americans had become citizens by treaty, allotment, or special act of Congress for their service in the military after World War I."}, {"id": "d258cef2-dadb-4f60-a67e-0e046938a82c", "title": "Tim Collins to meet with Troubles victim group over legacy remarks", "date": "2024-06-16 11:30", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/tim-collins-to-meet-with-troubles-victims-group-over-legacy-remarks/a620498532.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "The former Colonel of the Royal Irish Regiment, Tim Collins is running as a candidate for the Ulster Unionist Party in North Down (Andrew Parsons/PA)Westminster candidate Tim Collins is to meet with a group representing victims of the Northern Ireland Troubles after he was criticised for remarks about the Government’s Legacy Act, his party leader Doug Beattie has said.\nUlster Unionist leader Mr Beattie praised the retired colonel who he described as an “exceptional orator” and “very thoughtful”.\nThe Ulster Unionist Party opposes the Legacy Act in which investigations for unresolved Troubles have moved to a new truth recovery body, the Independent Commission for Reconciliation and Information Recovery (ICRIR).\nIf people knew the Tim Collins I know, the Tim Collins who would not take body armour in a combat situation until he made sure every single one of his men were issued body armour.\n“I said to Tim you need to bring these people back to that pro-union family once more and he said then he wanted to run for the Ulster Unionist Party."}, {"id": "355abd8d-fba1-4b76-8829-0dee259bf9c4", "title": "Released Israeli hostage describes return from Hamas captivity", "date": "2024-06-16 04:45", "url": "https://www.jpost.com/israel-hamas-war/article-806369", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Almost seven months after she and her daughters returned from Hamas captivity, Doron Katz Asher explained the struggles of continuing with daily life after being held captive in a Saturday Facebook post.\nAsher was kidnapped on October 7 at Kibbutz Nir Oz with her two daughters, Raz, 5, and Aviv, 3.\nAsher explained that she continues to experience \"nightmares at night, fear of noises, and questions from [her] little girls who don't understand why this happened to them—dealing with tough questions that break my break.\"\n\"And it's mainly putting on a smiling mask to raise the girls in a happy home even though my heart is bleeding.\"\nShe wrote that the experience caused her to \"discover how wonderful the people of Israel are with all their help and support. \""}, {"id": "9ee79ebe-ef85-495c-8aaa-3c19ed283580", "title": "Biden holds LA fundraiser as Trump courts Michigan", "date": "2024-06-16 06:30", "url": "https://www.gjsentinel.com/news/national/biden-holds-la-fundraiser-as-trump-courts-michigan/article_665aff82-686d-50d6-9b6a-8db3fffb5363.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Republican former US president Donald Trump has courted Black voters -- traditionally more supportive of Democratic candidates -- as he campaigns in 2024 for another term in the White House"}, {"id": "ce395196-3e95-467e-8fcc-a462d47d3e99", "title": "Press Briefing by IDF Spokesperson RAdm . Daniel Hagari - June 15 , 2024", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-idf01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press Briefing by IDF Spokesperson RAdm.\nDaniel Hagari- June 15, 2024IDF Press ReleaseJune 15, 202415.06.24IDFThis is a difficult evening,Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\nIDF representatives delivered the hard news to the families, and are currently with them at this difficult time.\nPlease respect the bereaved families, our first commitment in the IDF is to them, and we will not deviate from this principle.\nIDF troops are making progress in the defeat of the Hamas military wing, focusing on dismantling the Rafah Brigade's capabilities."}, {"id": "a10df0a9-b738-474e-b2da-c3fc277e49d1", "title": "Walter Dods , Jr ., Jay H . Shidler , donate Akaji sculpture to UH Mānoa RISE | University of Hawaiʻi System News", "date": "2024-06-16 01:30", "url": "https://www.hawaii.edu/news/2024/06/15/akaji-sculpture-dedication-rise-grand-opening/", "domain": "hawaii.edu", "domain_classification": "Unknown", "message": "Reading time: 2 minutesUniversity of Hawaiʻi at Mānoa alumni Walter Dods, Jr .\nThe sculpture, “ RISE ,” was installed outside the Walter Dods, Jr .\nRISE Center, and dedicated in a special ceremony prior to the official grand opening of the center on June 15.\nRISE was built under a public-private partnership between UH , UH Foundation and Hunt Companies Hawaiʻi.\nUH Foundation recently moved its headquarters to the second and third floors of the Charles Atherton House at RISE ."}, {"id": "20937ab6-458f-487d-ae61-2eedc5858453", "title": "The 8 Great Families of  House of the Dragon  explained", "date": "2024-06-16 07:30", "url": "https://timesofindia.indiatimes.com/web-series/news/english/the-8-great-families-of-house-of-the-dragon-explained/articleshow/111034047.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "\" House of the Dragon \" takes place two centuries before \"Game of Thrones\" and features several of the same noble houses.\nThe Targaryens maintained peace for many years, but after King Viserys I's reign, a conflict over the succession to the Iron Throne began.\nCorlys is a naval leader and explorer who supports Rhaenyra Targaryen in the civil war.\nSer Otto Hightower served as Hand of the King to both King Viserys I and King Jaehaerys Targaryen.\nTheir house is not mentioned in \"Game of Thrones\" and is likely extinct by that time.House Strong House Strong plays a significant role in \"House of the Dragon.\""}, {"id": "283ada00-42af-4489-b25f-8ceb08070eaf", "title": "Naarok0fKor Fusion War 2024 file - Guntoberfest mod for Doom II", "date": "2024-06-16 04:00", "url": "https://www.moddb.com/mods/guntoberfest/downloads/naarok0fkor-fusion-war-2024", "domain": "moddb.com", "domain_classification": "Unknown", "message": "====================================================================Title : Naarok0fKor Fusion War 2024.wadAuthors : Naarok0fKorDoomworld.comDeviantart.comModdb.com====================================================================* Play Information *Engine : GZDoom 4.10 with Doom2.wad.\nLevels : Map01 is my latest original map from my master WAD, Deimos base.wad.\n[Volcanic outpost]Map02 is my latest original map from my master WAD, Deimos base.wad.\nFiles : Naarok0fkor Fusion War 2024.WAD.\n-Naarok0fkor Fusion War 2024.WAD-CATSvisorBASE2.10.3.pk3-CATSvisorC1.10.3.pk3-CATSvisorC1.10.3_dynamics.pk3Compatibility : CATSvisor 1.10.3 -->Moddb.com widescreenCommlink : Send links of Battle reports, Deathmatch reports, Screenshots & Youtube videos on my ModDb page& Doomworld..."}, {"id": "af044778-4011-4c38-bffc-6372afa052b7", "title": "Russians lost another 1 , 160 soldiers and 58 artillery systems", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/russians-lost-another-1-160-040818409.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The General Staff of the Armed Forces of Ukraine reported that Russia lost another 1,160 soldiers and 58 artillery systems over the past 24 hours.\nSource: General Staff of the Armed Forces of UkraineDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:526,310 (+1,160) military personnel;7,956 (+0) tanks;15,269 (+6) armoured combat vehicles;13,913 (+58) artillery systems;1,104 (+1) multiple-launch rocket systems;853 (+0) air defence systems;359 (+0) fixed-wing aircraft;326 (+0) helicopters;11,159 (+11) strategic and tactical UAVs;2,296 (+3) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,967 (+56) vehicles and tankers;2,325 (+3) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "d1b07b48-6412-4ed5-aba6-8aed8cd0a6bd", "title": "Sam McBride : Day the Pope tapped his toe to the swagger of  The Sash  ", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/comment/sam-mcbride-day-the-pope-tapped-his-toe-to-the-swagger-of-the-sash/a843240098.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "The Royal Irish Regiment returned to Rome last week to celebrate the complexity of IrishnessThe band of the Irish Brigade in the Vatican on June 12, 1944.\nAfter the liberation of Rome in June 1944, Pope Pius XII invited the British army’s 38th (Irish) Brigade to the Vatican.\nThe band of the Irish Brigade in the Vatican on June 12, 1944.\nIreland’s neutrality during World War II is complicated.\nHe won the Military Cross in World War I, the Distinguished Service Order in World War II, and was also twice mentioned in dispatches."}, {"id": "faa01098-c8d5-401a-a4c2-f4d6ac0ea854", "title": "Israel announces limited military pause to increase Gaza aid", "date": "2024-06-16 12:00", "url": "https://saudigazette.com.sa/article/643629/World/Mena/Israel-announces-limited-military-pause-to-increase-Gaza-aid", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "GAZA — The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter, but emphasized that there is no ceasefire and combat would continue in Rafah.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nA spokesman for ActionAid, which is helping to deliver supplies in Gaza, told the BBC that the pause would help aid getting in but that they needed more details about logistics.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97."}, {"id": "cc0b698a-d338-4a33-8a18-690add1c80d4", "title": "IAF contingent participates in combat exercise  Red Flag  in Alaska – Indian Defence Research Wing", "date": "2024-06-16 13:45", "url": "https://idrw.org/iaf-contingent-participates-in-combat-exercise-red-flag-in-alaska/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "IAF contingent participates in combat exercise ‘Red Flag’ in Alaska| BySOURCE: IANSAn Indian Air Force (IAF) contingent participated in Exercise Red Flag 2024 conducted at Eielson Air Force Base, Alaska of the United States Air Force, from June 4-14.\nThis was the second edition of Exercise Red Flag 2024, which is an advanced aerial combat training exercise, held four times a year by the US Air Force.\nThe exercise witnessed the participation of the Indian Air Force along with the Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), German Luftwaffe, and the US Air Force (USAF).\n“IAF contingent participated with the Rafale aircraft and personnel comprising of aircrew, technicians, engineers, controllers and subject matter experts.\nRed Flag is an air combat exercise conducted with multiple scenarios designed to provide realistic combat settings."}, {"id": "e426d4e2-b223-40a9-a955-555fc396d242", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "7394b221-b283-4852-a4ab-762f24a83eef", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 06:00", "url": "https://www.brisbanetimes.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "778f26a1-f1e9-490d-8957-1e5993a08c2e", "title": "Entertaining lineup at Illinois State Fair", "date": "2024-06-16 05:45", "url": "https://www.agrinews-pubs.com/community-contributed/2024/06/16/entertaining-lineup-at-illinois-state-fair/", "domain": "agrinews-pubs.com", "domain_classification": "Unknown", "message": "Illinois State FairAug. 8-18, 801 Sangamon Ave.Springfield, IllinoisSPRINGFIELD, Ill. — The Arena will host a variety of family-friendly events during the 2024 Illinois State Fair, Aug. 8-18.\nMonsters of Destruction take over The Arena Thursday, Aug. 8, with an all-out monster truck thrill show featuring exhilarating truck battles.\nParticipating monster trucks include Against the Grain, Redneck Rampage, American Scout, Crusharoo and War Wizard.\nGet up close with these monster trucks and meet the drivers at the Pit Party, open two hours before the show.\nGrandstand LineupFive-time Grammy award-winning, multiplatinum rap icon Lil Wayne will headline the Illinois State Fair Grandstand on Wednesday, Aug. 14."}, {"id": "e7c5c5d3-870b-4b50-b40d-a43c08e72961", "title": "India lags in antibacterial research amid mounting global antimicrobial resistance crisis", "date": "2024-06-16 11:30", "url": "https://www.businesstoday.in/industry/pharma/story/india-lags-in-antibacterial-research-amid-mounting-global-antimicrobial-resistance-crisis-433486-2024-06-16", "domain": "businesstoday.in", "domain_classification": "Unknown", "message": "India contributes only 1% to the global antibacterial research and development (R&D) pipeline, according to data released by the World Health Organization (WHO).\nThe WHO highlighted that 84% of antibacterial R&D is concentrated in high-income countries, with another 12% in upper-middle-income economies.\nThis translates to a limited number of new antibacterial agents being developed in these regions.\nThe report identifies a need for new, innovative antibacterial agents to combat drug-resistant bacteria.\nThe report called for greater transparency and collaboration in the pipeline, noting that this could stimulate more interest and funding for innovative antibacterial agents."}, {"id": "a4566b8f-f4d0-4ae2-9b26-bbb7d45f7390", "title": "Shunned by West , Russian army deserters live in fear", "date": "2024-06-16 02:30", "url": "https://www.yahoo.com/news/shunned-west-russian-army-deserters-020856757.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kazakh rights campaigner Artur Alkhastov said Russian deserters stand virtually no chance of receiving refugee status in the Central Asian country.\nBut like Kazakhstan, activists say the country hosting a Russian military base is also not a safe destination.\nTwo Russian deserters have been detained by Russian military personnel in Armenia over the past two years.\n- 'Support deserters' -Activists say that if Western countries want to better support Ukraine they should offer asylum to Russian deserters.\nRussian deserters should be welcomed in the West, not stigmatised for having served in the Russian army, said a spokeswoman for InTransit, an organisation that helps men flee the war."}, {"id": "9f2a23f1-2df6-436e-b4b6-319e9dff26d1", "title": "Tim Collins to meet with Troubles victim group over legacy remarks", "date": "2024-06-16 10:45", "url": "https://www.kentonline.co.uk/news/national/tim-collins-to-meet-with-troubles-victims-group-over-legacy-remarks-120532/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "The former Colonel of the Royal Irish Regiment, Tim Collins is running as a candidate for the Ulster Unionist Party in North Down (Andrew Parsons/PA)Westminster candidate Tim Collins is to meet with a group representing victims of the Northern Ireland Troubles after he was criticised for remarks about the Government’s Legacy Act, his party leader Doug Beattie has said.\nUlster Unionist leader Mr Beattie praised the retired colonel who he described as an “exceptional orator” and “very thoughtful”.\nThe Ulster Unionist Party opposes the Legacy Act in which investigations for unresolved Troubles have moved to a new truth recovery body, the Independent Commission for Reconciliation and Information Recovery (ICRIR).\nHe added: “I think the one that I had to speak to him most about is the issue about legacy and understanding legacy a bit more.\nIf people knew the Tim Collins I know, the Tim Collins who would not take body armour in a combat situation until he made sure every single one of his men were issued body armour."}, {"id": "af2deac9-a97d-481f-b612-c4d8c9225dd6", "title": "IAF Rafale aircraft participate in Red Flag exercise in Alaska", "date": "2024-06-16 13:30", "url": "https://economictimes.indiatimes.com/news/defence/iafs-rafale-aircraft-participate-in-red-flag-exercise-in-alaska/articleshow/111039680.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelNew Delhi: The Indian Air Force's Rafale fighter jets carried out complex missions along with F-16 and F-15 combat aircraft at a multi-nation mega military exercise in Alaska in the US.\n\"The transatlantic ferry of Rafale fighter aircraft was enabled by the IL-78 air-to-air refuellers while the transportation of personnel and equipment was undertaken by C-17 Globemaster aircraft,\" the ministry said.Red Flag is an air exercise conducted with multiple scenarios designed to provide realistic combat settings.This was the first time the IAF Rafale aircraft participated in this exercise.\n\"In spite of the challenging weather and almost sub-zero temperatures, the IAF maintenance crew worked diligently to ensure serviceability of all the aircraft throughout the duration of the exercise and all assigned missions could be undertaken with more than 100 sorties being flown during the exercise,\" the ministry said.\n\"Key takeaways from the exercise included insight on interoperability with international partners and a collaborative understanding of employment philosophy in a multinational environment,\" it said.\n\"Enriched with the Red Flag exercise experience, the IAF keenly looks forward to hosting the participating contingents from other countries during Ex-Tarang Shakti-2024, which is the first ever Indian multinational air exercise to be held later this year,\" it said."}, {"id": "80569b24-7454-44e7-aa42-4fe13866ac4f", "title": "I walked streets of Llandudno to see if tourist  dirty  and  litter strewn  claims really stand up - David Powell", "date": "2024-06-16 08:15", "url": "https://www.dailypost.co.uk/news/north-wales-news/walked-streets-llandudno-see-tourists-29341018", "domain": "dailypost.co.uk", "domain_classification": "Unknown", "message": "I wandered around the town on foot looking for how much more routine litter is supposedly sullying these streets.\nIn truth, the good news for Llandudno is it was quite hard to find despite what the visitor claimed.\nI spotted some old Corona bottles and lager cans on a verge behind the old Pier Pavilion site by Llandudno Pier.\nEven the industrial sized wheelie bins in the back streets behind Llandudno's many hotels were neat and tidy - and colourful.\nBut, for the most part, Llandudno seems to be winning the war on garbage."}, {"id": "b0f54249-9f6d-4831-ace9-62fad05493e7", "title": "World Day to Combat Desertification and Drought 2024 : Date , history , significance and all you need ... ", "date": "2024-06-16 13:00", "url": "https://article.wn.com/view/2024/06/16/World_Day_to_Combat_Desertification_and_Drought_2024_Date_hi/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "World Day to Combat Desertification and Drought 2024: Droughts, land degradation and desertification are disasters that have become frequent over the last few years.\nWith the growing population and the demands, healthy land cover is constantly diminishing.\nThis has further led to the depletion of natural resources, droughts,... read full story\"Growing populations coupled with unsustainable production and consumption patterns fuel demand for natural resources, putting excessive pressure on land to the point of degradation.\nDesertification and drought are driving forced migration, putting tens of millions of people each year at risk of displacement,\""}, {"id": "be8643eb-2aaf-4edd-9a92-5ab7e4a38c8e", "title": "Epic Story of 16th - Century Japanese Civil War to Open at Broadwater Mainstage", "date": "2024-06-16 09:30", "url": "https://rafu.com/2024/06/epic-story-of-16th-century-japanese-civil-war-to-open-at-broadwater-mainstage/", "domain": "rafu.com", "domain_classification": "Unknown", "message": "From left, Masako Nikuma, Yukari Black, Tomoko Karina, Clement Bowen and Luce Metrius in “Castles in the Crimson Flame,” performed two weekends this month at the Broadwater’s Main Stage in Hollywood.\nEnsemble Tenshi, a production company that previously produced the award-winning play “Shizuka – 静” (Broadway World Regional Award, Los Angeles), delivers their new epic play at Hollywood Fringe Festival in June.\n“Castles in the Crimson Flame” takes the audience to the warring states period, Sengoku Jidai, 16th-century Japan, when all the powerful lords battled each other, aiming to conquer and unify Japan.\nYet, she aims to become the most powerful woman in Japan.\nCast: Yukari Black, Clement Bowen, Alexander Collins, Tomoko Karina, Stan Kowalski, Luce Metrius, Masako Nikuma, Dan Pousson, Vasilissa Zhuravleva."}, {"id": "40db69e4-f11e-42e9-bfe9-0b7c63f303dc", "title": "A Juneteenth history lesson , remembrance at Civil War soldier grave site in Riverhead", "date": "2024-06-16 12:00", "url": "https://www.newsday.com/long-island/juneteenth-civil-war-david-chippie-jyjq48pz", "domain": "newsday.com", "domain_classification": "Unknown", "message": "On Saturday, a memorial service was held at Chippie's grave at Riverhead Cemetery, to honor his service and commemorate Juneteenth.\nSome had a family history of military service.\nAlexander Newton, also a member of the 29th Connecticut Volunteer Infantry Regiment.\na Black resident of Riverhead who served in the 29th Connecticut Volunteer Infantry Regiment during the Civil War.\nAlexander Newton, also a member of the 29th Connecticut Volunteer Infantry Regiment."}]