[{"id": "ca916574-22e0-494d-ad83-bf525f6ee061", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-17 00:00", "url": "http://www.k101fm.net/syndicated-article/?id=1569647", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "(SOMALIA) — A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual’s name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "7d697247-0112-40f4-a2d6-d28954734ccc", "title": "Gaza : 71 Palestinians killed , 197 injured by Israelis bombings last48hours - The Muslim News", "date": "2024-06-17 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-71-palestinians-killed-197-injured-by-israelis-bombings-last48hours/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): 71 Palestinians were killed, 197 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 48 hours, reports the Health Ministry.\nThis has increased the number of Palestinians killed by Israeli forces to 37,337 and 85,299 injured since last October, according to the Ministry of Health in the besieged enclave.\nAdditionally, the warplanes targeted a house near the Emirates field hospital in central Rafah, according to eyewitnesses.\nThey said that Israeli warplanes targeted a house of al-Khatib family in the refugee camp, killing four people, including an infant, and injuring others.\nAnother airstrike targeted a house of an-Najjar family in the refugee camp, resulting in the killing of two people and injuring others."}, {"id": "8e337092-f655-4794-8e66-8cc3ebd4bb56", "title": "Hezbollah and Hamas in Lebanon exchange fire with Israel", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/202406177e599938.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The military wing of the Palestinian group Hamas said it had fired rockets from Lebanon into northern Israel on Monday, triggering Israeli airstrikes on the Lebanese side of the border.\nThe exchange lasted about half an hour and Israel’s Iron Dome could be clearly seen intercepting rockets from Lebanon.\nAbout three hours later, Israel’s air force carried out airstrikes on “Hezbollah targets” inside Lebanon, Israeli military spokesman Avichay Adraee posted on X, formerly known as Twitter, adding that details would follow later.\nBy Israeli military estimates, Hamas has already fired 7,000 rockets into Israel during the current war.\n(AP Photo/Ariel Schalit, File)The exchange of fire came as Lebanon’s militant group Hezbollah said its fighters attacked at least three Israeli military posts along the border around sunset on Monday."}, {"id": "5cebf0eb-1ac8-43a2-8105-d231661bfcde", "title": "U . S . Navy Rescues Crew of Stricken Cargo Ship Attacked by Houthis", "date": "2024-06-17 09:15", "url": "https://theaviationist.com/2024/06/17/u-s-navy-rescues-crew-of-cargo-ship-attacked-by-houthis/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Twenty four civilian crew members from a cargo vessel struck by a Houthi uncrewed surface vessel in the Red Sea have been rescued by the United States Navy.\nM/V Tutor, a 229-meter Liberian flagged bulk cargo vessel, came under attack by a Houthi uncrewed surface vessel (USV) while sailing in the southern Red Sea on June 12, 2024.\nFootage showing the Moments right before as well as right after the Liberian-Flagged, Greek-Owned Bulk Cargo Ship, M/V Tutor was Struck on June 10th by a Houthi One-Way Surface Attack Drone while Transiting the Southern Red Sea.\nUKMTO WARNING INCIDENT 083 ATTACK UPDATE 004 The crew of the vessel has been evacuated by military authorities.\nLightweight guided missiles tailored for use against small surface and air targets have been trialled and deployed by various nations."}, {"id": "eb695ad3-bf0f-4d32-8236-b0169656debd", "title": "Report : Attack that killed 8 IDF soldiers caused by anti - tank missile", "date": "2024-06-17 09:15", "url": "https://www.yahoo.com/news/report-attack-killed-8-idf-084229168.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli soldiers stand around the flag-draped casket of Israeli soldier Wassem Mahmoud, who was killed when an armoured personnel carrier exploded near the southern Gaza city of Rafah, during his funeral in Beit Jann.\nEight Israeli soldiers have been killed in fighting in Rafah in the southern Gaza Strip, the armed forces said on Saturday.\nIlia Yefimovich/dpaThe Israeli army assumes that an anti-tank missile was used in Saturday's attack on an Israeli armoured vehicle in Rafah in the southern Gaza Strip, which killed eight soldiers, according to Israeli media.\nIt was initially reported that it was unclear whether the explosion was caused by an anti-tank missile or a booby trap.\nDue to the many deaths and the catastrophic humanitarian situation, Israel's actions in the Gaza war are internationally controversial."}, {"id": "4459654c-95f1-416c-ab27-3a0f5677925d", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 03:45", "url": "https://www.bangkokpost.com/life/arts-and-entertainment/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "ddaed280-4abd-46b8-86d8-a78b2bb56c55", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 01:15", "url": "https://www.bangkokpost.com/life/social-and-lifestyle/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "aca00942-bae3-46ee-ac45-3fbb4b60f826", "title": "US Navy rescues crew from ship struck by Houthis", "date": "2024-06-17 01:00", "url": "https://www.brecorder.com/news/40308779/us-navy-rescues-crew-from-ship-struck-by-houthis", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO: The US Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen’s Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nCrew evacuated from vessel hit by Houthis, search for sailor continuesOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship’s crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "59373c6a-101d-4c81-9c38-3fcc5963f66c", "title": "Woman , 24 , arrested in fatal gang shooting in Anaheim , police say", "date": "2024-06-17 00:00", "url": "https://www.ocregister.com/2024/06/16/woman-24-arrested-in-fatal-gang-shooting-in-anaheim-police-say/", "domain": "ocregister.com", "domain_classification": "Unknown", "message": "A 24-year-old woman suspected of fatally shooting a man and injuring another in gang-related crimes in a residential Anaheim neighborhood was arrested on Saturday, June 15, authorities said.\nAt around 2:30 a.m. on Saturday, Jose Andres Abrego was shot and another victim was stabbed at a home along the 800 block of West Cottonwood Circle, according to the Anaheim Police Department.\nThe victims were taken to a hospital by a witness before authorities arrived.\nJannett Cureno, 24, fled the scene and was later arrested in Santa Ana on suspicion of the shooting and the stabbing, police said.\nAnaheim Police have asked anyone with information about the shooting to contact the Anaheim Police Department Homicide Detail at 714-321-3669 or Orange County Crime Stoppers at 855-TIP-OCCS."}, {"id": "35a12e76-db91-4ead-8227-73f492c4468b", "title": "New  Nostradamu predicts when World War III will begin and it just days away", "date": "2024-06-17 00:00", "url": "https://www.kenyan-post.com/2024/06/new-nostradamus-predicts-when-world-war.html", "domain": "kenyan-post.com", "domain_classification": "Unknown", "message": "Sunday, June 16, 2024 - An astrologer dubbed “New Nostradamus” is predicting the start of World War III is mere days away.\nKushal Kumar said back in May that World War III would begin on June 18.\n“Watch the developing war scenario in hotspots across the globe as days pass by,” Kumar wrote.\nEven if WWIII doesn’t come to pass in a matter of days, state officials warn it is a serious concern.\nThe Doomsday Clock, a representation of how close the planet is to nuclear war, was also set its closest to midnight — 90 seconds away — for a second year in a row"}, {"id": "32be1c23-b83e-4373-af41-0067c6c3c18d", "title": "Putin Invasion of Ukraine : Are Airbus Satellite Images Helping Russia Wage War ? ", "date": "2024-06-17 09:15", "url": "https://www.spiegel.de/international/world/putins-invasion-of-ukraine-are-airbus-satellite-images-helping-russia-wage-war-a-3ab1e690-91a7-4b46-8915-d7e0c0b5054d", "domain": "spiegel.de", "domain_classification": "Local - Europe", "message": "The high-definition images that Airbus delivers from an altitude of 630 kilometers and more are particularly valuable for nations at war.\nThat is why satellite photos can be so valuable when planning precise airstrikes.\nAs such, Ukraine – which has access to such images through its allies – has an advantage over the Russian invaders.\nBut the Ukrainian military suspects that Russian President Vladimir Putin’s military is helping itself to images from Western satellite operators immediately before launching airstrikes – with some of those photos potentially coming from Airbus-controlled satellites.\nMight the Russian military be tasking Western satellites to spy on Ukraine?"}, {"id": "52adc12c-8186-4960-8e14-00265b8f793d", "title": "Israel Netanyahu says Gaza offensive has  only started  ", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617064c599881.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said Israel has “only started” a fierce offensive in the Gaza Strip in response to Hamas’ unprecedented attack on his country.\nMr Netanyahu delivered the pronouncement in a nationally televised address as Israel pressed ahead with a third day of heavy airstrikes in Gaza.\nIn the war’s third day, Israel was still finding bodies from Hamas’ weekend attack into southern Israeli towns.\nThe UN said more than 123,000 people have fled their homes in Gaza – many after Israeli warnings of imminent bombardment.\nEgypt’s state-run Al-Ahram newspaper said on Monday that Egyptian officials are trying to mediate a release of Palestinian women in Israel’s prisons in exchange for Israeli women captured by militants."}, {"id": "47cdb18e-778d-4556-9ce9-a3e72a048f36", "title": "Massive expansion of Pine Gap spy base integrates Australia into US nuclear war planning", "date": "2024-06-17 08:15", "url": "https://www.wsws.org/en/articles/2024/06/17/kziv-j17.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Over the past four years, the joint US-Australian Pine Gap spy base in the Northern Territory has undergone the largest expansion in its history.\nSatellite photo of Pine Gap in 2020 [Photo: Google Earth]It has previously been documented that Pine Gap receives and processes information from two Orion geosynchronous signals intelligence satellites over the Indian Ocean.\nThat makes Pine Gap more a central military planning headquarters than simply a spy base.\nAs with the stationing of the B-52s in the north, there has been no discussion or announcement, let alone a popular mandate sought for the Pine Gap expansion.\nThe Pine Gap expansion began under the former Liberal-National Coalition government and has proceeded seamlessly since Labor was installed in the May 2022 federal election."}, {"id": "5d6ac48f-090e-4f6e-98df-ac6ee9d7eca6", "title": "Gotcha ! Authorities Nab Accused Assailant After Police Rescue Stabbing Victim At CNBC HQ Lot", "date": "2024-06-17 00:00", "url": "https://dailyvoice.com/new-jersey/bergenfield/gotcha-authorities-nab-accused-assailant-after-police-rescue-stabbing-victim-near-cnbc-hq/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Patel, who sources said had previously been seen in the area, tapped on her car window.\nThe victim, who didn't know Patel, opened the window, and he reached in with a knife, one of them told Daily Voice.\nShe rushed by ambulance to the trauma unit at Hackensack University Medical Center and was later released after being treated, the prosecutor said.\n\"[Patel] was a stranger to the victim, and the attack was unprovoked,\" Musella noted.\nPatel was booked into the Bergen County Jail a short time later to await a first appearance in Central Judicial Processing Court in Hackensack."}, {"id": "6674718a-760c-4e8d-bdb7-bd6b3c49b557", "title": "Russian warships near Florida aim to intimidate . US Navy views them like targets", "date": "2024-06-17 09:30", "url": "https://www.foxnews.com/opinion/russian-warships-near-florida-aim-intimidate-navy-views-them-more-like-target-practice", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "This being the Russian navy, they wisely brought along an oiler for refueling and a salvage tug, just in case.\nNo way will Russia risk her in the Black Sea, where Ukraine’s shore defense batteries and drones have already sunk Russian navy ships like the Moskva.\nA posse of U.S. Coast Guard and Navy ships and planes, with an assist from Canada, is picking up every move of Putin’s tiny task force.\nThe U.S. Coast Guard National Security Cutter Stone is sleek, fast and new, having been delivered in 2020.\nCLICK HERE TO GET THE FOX NEWS APPSo, just consider the Russian warships drilling off the Atlantic coast as \"target practice.\""}, {"id": "3c17f865-bd8f-4d21-89e8-507b5610d461", "title": "Haiti declares curfew as it tries to restore order after weekend jailbreak", "date": "2024-06-17 01:00", "url": "http://www.myanmarmuslim.net/news/20240617331c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“The police were ordered to use all legal means at their disposal to enforce the curfew and apprehend all offenders,” said a statement from finance minister Patrick Boivert, the acting prime minister.\nHaiti’s National Police has roughly 9,000 officers to provide security for more than 11 million people, according to the UN.\nA second Port-au-Prince prison containing around 1,400 inmates was also overrun.\nMr Henry took over as prime minister following Mr Moise’s assassination and has postponed plans to hold parliamentary and presidential elections, which have not happened in almost a decade.\nThe prime minister, a neurosurgeon, has shrugged off calls for him to resign and did not comment when asked if he felt it was safe to come home."}, {"id": "13ed3e58-f587-4583-82d7-400ab12933b5", "title": "Germany to resume Afghan deportations via Uzbekistan - Newspaper", "date": "2024-06-17 03:45", "url": "https://www.dawn.com/news/1840410/germany-to-resume-afghan-deportations-via-uzbekistan", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "FRANKFURT: Ger­many’s government is holding talks with Uzbekistan to enable deportations from Germany to Afghanistan without direct consultations with the Taliban, according to a report in German magazine Der Spiegel on Sunday.\nIt stopped deportations to Afghanistan after the Tali­ban took power in 2021.\nThe Uzbek government wants to sign a formal migration agreement with Germany before a deal on deportations, the Spiegel report said.\nOfficials had been carrying out an “intensive review for several mon­ths… to allow the deportation of serious criminals and dangerous individuals to Afghanistan”, Interior Minister Nancy Faeser told journalists.\nDeportations to Afgha­nis­tan from Germany have been completely stopped since the Taliban retook power in 2021."}, {"id": "49a2e4df-c7b9-44f2-a721-a6f50a8ecf5a", "title": "Ukraine hits Russian oil facilities as Zelensky joins D", "date": "2024-06-17 01:15", "url": "http://www.myanmarmuslim.net/news/20240617303e599687.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In Belgorod, a drone hit an oil depot overnight, governor Vyacheslav Gladkov said, causing an explosion and a fire in one of the oil reservoirs.\nThat threat came after Nato allies said they would allow Ukraine to use weapons they deliver to Kyiv to attack Russian territory.\n“Let the US and its allies feel the impact of direct use of Russian weapons by others,” he said.\nMr Putin deliberately did not name potential recipient countries of Russian weapons, Mr Medvedev said.\nKremlin spokesman Dmitry Peskov said the use of western weapons against Russia “can’t be left without consequences, and those consequences will certainly follow”."}, {"id": "9901a1d6-6749-49ff-9ba1-abf013f354d5", "title": "Israel army to pause daytime fighting along route in Gaza to help with aid", "date": "2024-06-17 02:30", "url": "https://www.newschannel5.com/world/israel-at-war/israels-army-says-it-will-pause-daytime-fighting-along-a-route-in-southern-gaza-to-help-flow-of-aid", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nIt could help address the overwhelming needs of Palestinians that have surged in recent weeks with Israel's incursion into Rafah.\nThe army said that the daily pause would begin at 8 a.m. and last until 7 p.m. and continue until further notice.\nHard-hit northern Gaza, an early target in the war, is served by goods entering from the north.\nWhile the army insisted “there is no cessation of fighting” in southern Gaza, it also said the new route would be open during daytime hours “exclusively for the transportation of humanitarian aid.”The fighting continued."}, {"id": "773dbe30-bc19-4807-9c84-5b4fc30399cc", "title": "US military shoots down missiles and drones as it faces threats in Middle East", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617319a599626.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US forces in the Middle East are facing increasing threats after a Navy warship shot down missiles appearing to head toward Israel on Thursday.\nThe official said one projectile was shot down and another struck, but according to early reports no one was injured.\nA US official said they do not believe the missiles — which were shot down over the water — were aimed at the warship.\nAn array of other drone attacks over the past three days did target US bases, including one in southern Syria on Thursday that caused minor injuries.\nThe most recent drone attack was Thursday at al-Asad Air Base in western Iraq."}, {"id": "679b7684-6b72-4ac2-9778-ecac58b29be8", "title": "Man fatally stabbed at homeless encampment in Long Beach", "date": "2024-06-17 00:00", "url": "https://www.presstelegram.com/2024/06/16/man-fatally-stabbed-at-homeless-encampment-in-long-beach/", "domain": "presstelegram.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at an encampment near the Los Angeles River in Long Beach on Saturday, June 15, authorities said.\nJust before 9 a.m., the victim was involved in an argument at the encampment along Long Beach Boulevard when someone stabbed him, according to the Long Beach Police Department.\nIt was not clear whether the suspect and victim knew each other, and a motive for the stabbing was under investigation.\nLong Beach Police are asking anyone with information regarding the stabbing to contact Homicide Detectives Ethan Shear or Chasen Contreras at 562-570-7244.\nAnonymous tips may be submitted through “LA Crime Stoppers” by calling 800-222-TIPS (8477)."}, {"id": "f18b4475-631c-48a4-b4db-e3e29676c4e8", "title": "Israel resists US pressure to pause the war to allow more aid into Gaza Strip", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/2024061714b599931.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In the Gaza Strip, Israeli troops tightened their encirclement of the largest city amid continued battles with Hamas militants.\nAl Jazeera TV reported that a strike late on Friday hit a school in Gaza City where many were taking refuge, causing casualties.\nTwenty-four Israeli soldiers have been killed in the Gaza Strip since the start of the ground operation.\nIsraeli military officials said their forces have encircled densely built-up Gaza City and began on Friday to launch targeted attacks on militant cells.\nIsrael says Hamas has extensive military infrastructure in the city, including a network of underground tunnels, bunkers and command centres."}, {"id": "cf057a0b-04ba-4190-9301-6f588b8c4586", "title": "Accused in Pannun murder for hire plot extradited to united states ", "date": "2024-06-17 03:45", "url": "https://www.geo.tv/latest/549801-accused-in-pannun-murder-for-hire-plot-extradited-to-usa", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Pro-Khalistan Sikh leader and Sikhs For Justice (SFJ) General Counsel Gurpatwant Singh Pannun (centre).\n— Photo by authorLONDON: Indian citizen and Indian spy agency RAW’s agent accused of attempting to kill Sikh leader Gurpatwant Singh Pannun in New York has been extradited to the US ahead of an expected federal court appearance.\nNikhil Gupta has been charged with murder for hire linked to a foiled plot to assassinate Gurpatwant Singh Pannun, a dual US and Canadian citizen who advocates for an independent Sikh state called Khalistan.\nThe Justice Department alleges that Gupta, 52, is an associate of an Indian government “senior field officer” and that together they and others helped plot the assassination of Pannun.\nAround that time in Canada, on June 18, gunmen shot and killed another Sikh separatist leader, Hardeep Singh Nijjar, outside a Sikh temple in British Columbia."}, {"id": "d0527bdb-f665-48ce-a316-f4fb0e2a2ca6", "title": "Russo - Ukraine War - 16 June 2024", "date": "2024-06-17 03:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-16.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nAccording to preliminary information, since the beginning of the day Russian forces loss totaled 122 occupants dead and wounded, 31 Russian personnel shelters and ammunition depots were affected.\nNine assault actions in the area of Verkhnyokamiansky and Rozdolivka were repelled by the Defense Forces units.\nRussian troops have repelled seven counterattacks by assault detachments from the 36th Marine Brigade and the 13th National Guard Brigade."}, {"id": "6cc1d41c-0539-4e72-a37d-7d3718a0e2d5", "title": "Nikhil Gupta , suspect in plot to kill Gurpatwant Singh Pannun , extradited to US | India News", "date": "2024-06-17 01:00", "url": "https://timesofindia.indiatimes.com/india/nikhil-gupta-suspect-in-plot-to-kill-gurpatwant-singh-pannun-extradited-to-us/articleshow/111046905.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Typically, extradited defendants must appear in court within a day of their arrival in the country.\n\"US federal prosecutors have alleged that Gupta was working for an Indian official to facilitate the murder-for-hire plot against Pannun, and that he hired a hitman and paid $15,000 in advance.\nGupta, through his attorney Rohini Musa, has also denied the charges, claiming that he has been \"unfairly charged.\n\"In a petition to the Indian Supreme Court, Musa stated that there is \"nothing on record to link the Petitioner to the massive alleged plot to assassinate the alleged victim.\nIt is expected that Sullivan will raise the issue with his Indian counterpart, Ajit Doval, during their meeting."}, {"id": "ac94abef-d06e-4dc9-a877-edce7e2992a4", "title": "Hezbollah aggression pushing region toward broader conflict , IDF spokesperson says", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/article/hkty2thh0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Hezbollah's escalating aggression is pushing the region toward a broader conflict, IDF Spokesperson Rear Admiral Daniel Hagari warned on Sunday.\nIDF Spokesperson Rear Admiral Daniel Hagari in message to Hezbollah ( Video: IDF Spokesperson's Unit )\"Hezbollah is jeopardizing the future of Lebanon - so that it can be a shield for Hamas.\nHe emphasized Israel's commitment to protecting its citizens, saying, \"Israel has a duty to defend the people of Israel.\nA rare and quiet day unfolded along Israel's northern border, a region that has been the epicenter of conflict for months.\nIDF airstrikes in southern Lebanon ( Video: IDF Spokesperson's Unit )Despite the lull, Israel continued its strikes throughout the day, and Hezbollah's inactivity does not indicate a shift in its strategy."}, {"id": "49585410-1d9a-43da-be96-63afb0cfc8f7", "title": "Man goes on trial for murder of ex - girlfriend in Fukuoka", "date": "2024-06-17 09:15", "url": "https://japantoday.com/category/crime/man-goes-on-trial-for-murder-of-ex-girlfriend-in-fukuoka", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "A 32-year-old man went on trial Monday for killing his 38-year-old ex-girlfriend in Fukuoka City last year.\nDuring the opening session of his lay judge trial at the Fukuoka District Court, Susumu Terauchi said: \"I stabbed her, but I didn't lie in wait to ambush her,” Kyodo News reported.\nHe said Terauchi was on his way to a shop near Hakata Station to pay his mobile phone bill and unexpectedly met the victim.\nWhen he asked if he could talk to her, she ignored him and he \"exploded with emotion,” the defense said.\nStreet surveillance camera footage near where Kawano’s body was found showed Terauchi quarreling with Kawano as they walked along a street."}, {"id": "51d62bd4-aff6-4a98-b33d-11237dda2a1a", "title": "Netanyahu tells Israel  we are at war  as Hamas launches unprecedented attack", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/20240617005d599940.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Netanyahu tells Israel ‘we are at war’ as Hamas launches unprecedented attackPrime minister Benjamin Netanyahu has told Israel that it is “at war” with Hamas militants that rule the Gaza Strip, after they launched a major, multi-front attack on the country.\nAt least 40 people in Israel have been killed and hundreds wounded, making the unprecedented surprise early morning attack by Hamas the deadliest in Israel in years.\nPolitical commentators lambasted the government over its failure to anticipate what appeared to be a Hamas attack unseen in its level of planning and co-ordination.\nIt said its forces were engaged in gunfights with Hamas militants who had infiltrated Israel in at least seven locations.\nThe shadowy leader of Hamas’ military wing, Mohammed Deif, announced the start of what he called “Operation Al-Aqsa Storm”."}, {"id": "73bf88eb-f65f-49f5-8c70-cd8a3fe12224", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.smh.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "44703d3b-86ab-4330-a32a-03438cffd0e0", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.theage.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "43ce4037-4a32-441c-8973-e34a20899ecf", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:00", "url": "https://www.watoday.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "076d38c0-fe4c-4841-80e3-33bda5bc3c23", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.brisbanetimes.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "5dc708ab-c1e6-48f4-83c6-2a971d3992f2", "title": "Man Stabbed To Death at Homeless Encampment in Long Beach", "date": "2024-06-17 03:45", "url": "https://mynewsla.com/crime/2024/06/16/man-stabbed-to-death-at-homeless-encampment-in-long-beach/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at a homeless encampment along the Los Angeles River in Long Beach, authorities said Sunday.\nThe suspect fled the scene before officers arrived, the Long Beach Police Department reported.\nOfficers dispatched to the area of the Los Angeles River and Long Beach Boulevard at about 8:50 a.m. Saturday found the victim suffering from a stab wound to the upper body.\n“Through their preliminary investigation, detectives determined the victim and a male adult suspect engaged in a verbal altercation, which escalated when the suspect stabbed the victim,” police said.\nLong Beach police urged anyone with information regarding the stabbing to call them at 562-570-7244."}, {"id": "ba7eb37a-8c29-46df-bf0a-f0eaab814d95", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/taiwan-not-seeking-war-china-031055911.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Incoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiIncoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiTAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "a6792242-1f05-45b9-bff2-f29b751ce145", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://gazette.com/news/us-world/taiwan-is-not-seeking-war-with-china-defence-minister-says/article_362df78a-b32b-5b8f-94c0-a418a30a68a5.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "TAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "918f5536-6e6e-4e25-9887-743d7bd69464", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday  as deployment stretches on", "date": "2024-06-17 09:15", "url": "https://www.moneycontrol.com/news/world/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on-12750256.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "43bee614-9dbe-4cd9-9a86-0f5542321942", "title": "House of the Dragon : All dragons and dragonriders", "date": "2024-06-17 03:15", "url": "https://www.polygon.com/23381183/house-dragon-all-dragons-riders-vhagar", "domain": "polygon.com", "domain_classification": "Unknown", "message": "House of the Dragon season 1 saw a lot of politicking.\nBut by the final episode, the dragons — and their use in the coming Dance of the Dragons — take center stage.\nAs we see in episode 10, even with the proper rider, dragon warfare can lead to calamitous consequences.\nSunfyreRider: Aegon TargaryenA bright-gold dragon with pink-membraned wings, Sunfyre is the dragon of Aegon Targaryen and a swift flier, though far from the biggest of the Targaryens’ remaining dragons.\nBecause of this, the dragon remains fairly small by the time House of the Dragon picks up with Jace."}, {"id": "0858d763-4b9a-4131-b9aa-4d385ddf69a2", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 07:00", "url": "https://toronto.citynews.ca/2024/06/17/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nAnd as far as the Houthi forces watching his postings, Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\nThe carrier also has been the most-deployed carrier among the U.S.’s entire fleet over the last five years, according to an analysis by the U.S.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "3721fe57-71fe-45c5-9b83-8d25bc4a2d92", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 08:15", "url": "https://www.ivpressonline.com/news/world/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/article_6993c935-9dfd-5e32-b086-205138833530.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "56b80c2b-deb8-477f-afef-1e4db1826a4d", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-17 03:30", "url": "https://www.tvguide.co.uk/schedule/91b9e802-7ae2-5081-828f-31486e9a0725/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 17 June Share Add toCalendar +SAS Season 4 Episode 7 of 10 S SubtitlesA Hollywood blockbuster needs an authentic Second World War SAS jeep within two weeks.\nIt's a tight deadline but military equipment collector Bruce Crompton is determined to meet it, as the wartime SAS is a passion of hisCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 17 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "07a37eaf-4c58-4234-9b2e-2b4aad113598", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 06:30", "url": "https://www.mymotherlode.com/news/national/general-election/3376603/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "US aircraft carrier counters false Houthi claims with ‘Taco Tuesdays’ as deployment stretches on View PhotoABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\nAfter one false Houthi claim, Hill responded by posting images of cinnamon rolls and muffins in the bakery on board the Eisenhower — a subtle jab at the claims.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nAnd as far as the Houthi forces watching his postings, Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\nThe carrier also has been the most-deployed carrier among the U.S.’s entire fleet over the last five years, according to an analysis by the U.S."}, {"id": "e972a86f-5910-4f6a-a6f2-7cbe5a421347", "title": "North Korea hates the South propaganda loudspeakers . But how effective are they , really ? ", "date": "2024-06-17 04:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3266853/north-korea-hates-souths-propaganda-loudspeakers-how-effective-are-they-really", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "South Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nThe loudspeakers deployed by South Korea to wage psychological warfare against North Korea have faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\n02:43 North Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nNorth Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nWhat appear to be North Korean loudspeakers are pictured from across the border in South Korea on June 11."}, {"id": "5f4effca-5987-46d2-ad03-c4a672033865", "title": "8 superhero games we wish were made ( and who could develop them ) ", "date": "2024-06-17 03:30", "url": "https://bamsmackpow.com/posts/superhero-games-we-wish-were-made-who-could-develop-them-01hzge7wrdhr", "domain": "bamsmackpow.com", "domain_classification": "Unknown", "message": "8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel.\n8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel"}, {"id": "1084fa5a-9c1a-46ec-bace-24d135ff1e78", "title": "Ukraine summit strives for consensus , way forward uncertain", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/world/ukraine-summit-strives-consensus-way-forward-uncertain", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Over 90 countries attended the two-day talks at a Swiss Alpine resort at the behest of Ukrainian President Volodymyr Zelenskiy, billed as a \"peace summit\" even though Moscow was not invited.\n\"We are responding to Russia's full-scale invasion of Ukraine not only with a full-scale defence of human life, but also with full-scale diplomacy,\" Zelenskiy said.\nNo peace talks have been held for more than two years.\n[[nid:678352]]No country came forward to host another such meeting, with notable silence from Saudi Arabia, mooted as a possible future venue.\n\"Of course we...understand perfectly that a time will come when it will be necessary to talk to Russia,\" Ukrainian Foreign Minister Dmytro Kuleba said."}, {"id": "dd4ac6bc-db8e-49eb-8796-3b8b9b5b09bb", "title": "Sean Parnell :  Vindicated  By  Family Court System  After Custody Battle", "date": "2024-06-17 05:00", "url": "https://www.breitbart.com/politics/2024/06/16/sean-parnell-fathers-day-vindicated-family-court-system-custody-battle/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Sean Parnell, a former senatorial and congressional candidate in Pennsylvania, revealed in a Father’s Day update that he has been “vindicated” by the “family court system” after a custody battle with his ex-wife.\n“On this Father’s Day, I wanted to share a significant personal update,” Parnell began.\n“After enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAfter enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAs a father in family court the deck will always be stacked against you."}, {"id": "00ca3798-f1b8-41f9-a393-44c3faa6b1c1", "title": "Jabalia showdown : IDF paratroopers clash with Hamas in unconquered stronghold", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/magazine/article/byan3ynbc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "At 18:45 comes the pinnacle of the day’s battle as a huge blast shakes the Jabaliya refugee camp.\nAs in any neighborhood IDF ground operates, the water and electricity systems were cut off as soon as the Jabaliya refugee camp was occupied.\nThe IDF announced in December that Southern Command’s 162nd Division had completed its ground operations by defeating Hamas’ Jabaliya battalion and that the forces left had taken operational control of the city.\nHamas terrorists also eat the displaced people’s food.\nThe last of the soldiers pulled out last Thursday, completing three weeks of the IDF’s first operation in the Jabaliya refugee camp."}, {"id": "afc8c974-d0a7-44eb-ab4e-420a34ac2b55", "title": "Sanctifying the profane : the Russian Orthodox Church at the front", "date": "2024-06-17 09:15", "url": "https://globalvoices.org/2024/06/17/sanctifying-the-profane-the-russian-orthodox-church-at-the-front/", "domain": "globalvoices.org", "domain_classification": "Unknown", "message": "Kirill Shamiev and Ksenia Luchenko, both Visiting Fellows at the European Council on Foreign Relations, wrote for the Russia Post about the role of the Russian Orthodox Church in Putin’s regime and the full-scale Invasion of Ukraine.\nThe Russian Orthodox Church has actively participated in Russia’s full-scale war against Ukraine since the very beginning.\nChurch TV channels — the Moscow Patriarchate’s widely watched Spas and the Orthodox “patriotic” channel Tsargrad — stress the sanctity of the war.\nVasiliev had served in the town’s church for over 20 years and was close to the military leadership stationed there.\nHe also claimed that about 100 Orthodox priests were on the front line every day, many of them not for the first time."}, {"id": "29da0fd2-8ca6-4cf6-a292-5f597c776317", "title": "Between hollow rhetoric and war : how sanctions work – and why they often dont | US foreign policy", "date": "2024-06-17 00:15", "url": "https://www.theguardian.com/us-news/article/2024/jun/17/between-hollow-rhetoric-and-war-how-sanctions-work-and-why-they-often-dont", "domain": "theguardian.com", "domain_classification": "International", "message": "It was known as the Megarian decree, and it was arguably the first recorded case of economic sanctions.\nThe Peloponnesian war, pitting Athens against Sparta, erupted a year later, and some ancient historians believe it was triggered by the Megarian sanctions.\nThe current thicket of western sanctions on Russia are a clear failure in those terms.\nUS-led sanctions were also instrumental in persuading Tehran to the negotiating table to accept significant limitations on its nuclear programme in return for sanctions relief.\n“Biden came in saying there is going to be a review of the use of sanctions and we are going to be far more judicious about using them, and Biden winds up using sanctions more than any other president.”"}, {"id": "5ddb5e83-eb05-4513-8f66-94aeabd2c2fa", "title": "Israeli Defense Industry Sees Surge in European Demand", "date": "2024-06-17 09:15", "url": "https://themedialine.org/top-stories/israeli-defense-industry-sees-surge-in-european-demand/", "domain": "themedialine.org", "domain_classification": "Unknown", "message": "European countries are increasingly purchasing Israeli defense technology due to regional security concernsIn the past few years, there has been a notable surge in global interest, orders, and sales within the Israeli defense industry.\n… none of that is going to change—especially when we are talking about Israeli systems that are defensive in nature.\nAs a result, interest in these defense systems surged, according to the companies.\nDefense industry profits surgeAs the war continues, these defense companies are capitalizing on increasing demand, resulting in a profit surge.\n“The Israel defense industry is already extremely large; this war will cause it to grow.”"}, {"id": "46d39830-3c45-42d5-ad8c-69a3699ad7fc", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:00", "url": "https://www.moneycontrol.com/news/world/south-koreas-loudspeakers-face-questions-over-reach-into-north-12750048.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "9d88b95b-1868-4623-a550-6cbb863478e8", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/asia/south-koreas-loudspeakers-face-questions-over-reach-north", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SEOUL - The loudspeakers deployed by South Korea to wage psychological warfare against North Korea faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nMr Kim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea's own loudspeakers in the area further diminish the reach of South Korea's psychological warfare.\nNorth Korea's broadcasts are less aimed at winning over people in the South and more at \"suppressing\" the South's broadcasts by overpowering or muddling the message, he said.\n[[nid:689268]]At least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "2d339161-1c2e-43f7-aa90-c40240e86809", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-16/south-korea-loudspeakers-north-14204857.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "South Korean soldiers work next to a military facility (Green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju, South Korea, June 10, 2024.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nKim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea’s own loudspeakers in the area further diminish the reach of South Korea’s psychological warfare.\nNorth Korea’s broadcasts are less aimed at winning over people in the South and more at “suppressing” the South’s broadcasts by overpowering or muddling the message, he said.\nAt least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "44d35530-c0a2-4d36-9eed-52dcb161c06f", "title": "Re : Western media language , narrative erase Israel responsibility , – Palestinian - American journalist – Middle East Monitor |", "date": "2024-06-17 03:15", "url": "http://www.huewire.com/re-western-medias-language-narrative-erase-israel-responsibility-palestinian-american-journalist-middle-east-monitor-2/", "domain": "huewire.com", "domain_classification": "Unknown", "message": "It’s the bias these outlets it like in Germany, the non-commercial TV-Stations had ruled as theirprinciples of news reporting had circulated as an policy paper, of how to report and naming and framing, of the ongoing warfare waged in the occupied palestinian territories, between Israeli military forces and regional militia groups of armed palestinian fighters (Named as terrorist groups) is done, in these TV Stations, so right from the beginning of this war, it was a the: Good and Evil, attacks and killings which got applied by this agreement for the editing and creating of reports, to differentiate military actions by allies in the region, or of those who they feel more alienated, to their situation, the suffering and their armed fightings against the Israeli military forces.\nSource link"}, {"id": "9769a6fe-7f44-426b-b552-3f6632a17e92", "title": "Chael Sonnen Ready To Fight  Overrated  Jorge Masvidal In A Boxing Match", "date": "2024-06-17 00:00", "url": "https://www.lowkickmma.com/chael-sonnen-fight-overrated-jorge-masvidal/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Blasting Jorge Masvidal for his foolish business practices and claiming he couldn’t remember the last time Masvidal won a fight.\nChael Sonnen Speaks on Looming Jorge Masvidal Fight“This whole thing was just part of the process,” Chael Sonnen began, speaking on the Anderson Silva fight (H/T MMA Fighting).\n“I’m boxing Jorge Masvidal.\n“Masvidal’s a little bit overrated, in all fairness, within his own mind,” Chael Sonnen said.\n“It just keeps getting worse for Jorge Masvidal."}, {"id": "3cb0274d-0be7-4b06-b7ca-c6ec3b348b63", "title": "More than 80 nations back talks to ease path to peace in Ukraine", "date": "2024-06-17 03:30", "url": "https://www.bostonglobe.com/2024/06/16/world/more-than-80-nations-back-talks-ease-path-peace-ukraine/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But Zelensky has long argued that a lasting peace in Ukraine can be achieved only with Russia’s full withdrawal.\nUkraine’s Western allies have said little about possible peace talks with Russia.\nAdvertisementSuch talks, he said, would build on the gathered nations’ endorsement of “the notion of sovereignty and territorial integrity” outlined in the United Nations Charter.\nTo end the war, diplomatic backing could strengthen Ukraine’s hand in eventual peace talks.\nHe said Ukraine was already in talks with countries that had indicated an interest in hosting such a meeting."}, {"id": "85d1d597-ed57-4fd1-9eb5-eceb8fae5d7e", "title": "Netanyahu criticizes military plans for 11 - hour daily pauses in fighting", "date": "2024-06-17 00:15", "url": "https://www.foxnews.com/us/israeli-prime-minister-netanyahu-criticizes-militarys-plans-daily-pauses-fighting", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu was critical of plans announced Sunday by his military to hold 11-hour pauses in fighting along a main road into Gaza to facilitate getting aid into the bomb-stricken area.\nReuters reported that the Israeli military announced daily pauses in battle from 5 a.m. to 4 p.m. local time between Kerem Shalom Crossing and Salah al-Din Road, then northwards.\nISRAELI WAR CABINET MINISTER BENNY GANTZ QUITS NETANYAHU'S EMERGENCY GOVERNMENTNetanyahu’s reaction highlights heightened political tensions over aid being delivered into Gaza, where international groups have warned of a growing humanitarian crisis.\nBBC ANCHOR ASKS IF ISRAELI FORCES WARNED PALESTINIANS AHEAD OF HOSTAGE RESCUE MISSION: DEFEATS ‘THE PURPOSE’Last Sunday, Israeli war cabinet minister Benny Gantz quit Netanyahu’s emergency government, saying the prime minister was making \"total victory impossible.\"\n\"Months after the October disaster, the situation in the country and in the decision-making cabinet has changed,\" Gantz added."}, {"id": "d1b295ab-06b0-47b5-a451-8a2ec3813031", "title": "US military : Is there a draft in 2024 ? ", "date": "2024-06-17 03:30", "url": "https://www.fox4news.com/news/military-defense-bill-draft-2024", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "While there isn't currently a draft in place, Congress and the president can reinstate the draft and force male citizens to serve in the military in the event of a national emergency or war that all-volunteer military can't adequately support.\nRELATED: US military draft: What you need to knowHere's what you need to know about the military draft.\nThe military draft - officially known as the Selective Service System - requires nearly all male U.S. citizens and male immigrants ages 18 to 25 to register with the government, in accordance with federal law.\nAccording to the Selective Service, the draft, if implemented, would have similarities to that of the Vietnam War.\nIn the event a national emergency required a draft, the Selective Service has protocol in place for when that happens."}, {"id": "bc1372c9-1be0-40d3-a2b0-5417ec1c1cb8", "title": "  House of the Dragon  Character Scorecard : Season 2 Premiere", "date": "2024-06-17 03:30", "url": "https://www.vulture.com/article/house-of-the-dragon-season-2-premiere-characters-ranking-scorecard.html", "domain": "vulture.com", "domain_classification": "Unknown", "message": "Rhaenyra and Alicent grieve and contemplate and try to prevent the men in their lives from setting the world on fire.\nSo let’s assess our most and least valuable players as the Dance of the Dragons kicks off in earnest.\n— Tries to have his chaotic counterpart killed but hires two idiots who mess it up and kill someone else.\nThink about it all for a second: His son married Rhaenyra and then “died” — a faked death, but still — under mysterious circumstances.\nBut I’m going to go with “the instant he kicked the dog.”Did I think it was going to escalate from there straight to beheading a child in front of his mother?"}, {"id": "a6a28a48-a9b9-4e32-b48d-69cb65079877", "title": "IAF contingent participates in Exercise Red Flag 2024 at Alaska", "date": "2024-06-17 00:15", "url": "https://news.webindia123.com/news/Articles/India/20240617/4206385.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "An Indian Air Force (IAF) contingent participated in Exercise Red Flag 2024, conducted at Eielson Air Force Base, Alaska, of the United States Air Force, from June 4 to June 14, the Ministry of Defence said in a release on Sunday.\nThis was the second edition of Exercise Red Flag 2024, which is an advanced aerial combat training exercise held four times a year by the US Air Force.\nAccording to the release, the exercise witnessed the participation of the Indian Air Force along with the Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), German Luftwaffe, and the US Air Force (USAF).\nRed Flag is an air combat exercise conducted with multiple scenarios designed to provide realistic combat settings.\nEnriched with the Red Flag exercise experience, the IAF keenly looks forward to hosting the participating contingents from other countries during Ex-Tarang Shakti-2024, which is the first-ever Indian multinational air exercise to be held later this year, the release added."}, {"id": "ec5eb0e9-9ae4-4246-a80f-a74916bf1272", "title": "Russia sets closed espionage trial for US reporter Gershkovich", "date": "2024-06-17 09:30", "url": "https://www.swissinfo.ch/eng/russia-sets-closed-espionage-trial-for-us-reporter-gershkovich/80921797", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia sets closed espionage trial for US reporter Gershkovichreuters_tickers4 minutesBy Guy FaulconbridgeMOSCOW (Reuters) -Russia’s espionage trial of detained Wall Street Journal reporter Evan Gershkovich, who denies charges of collecting secrets for the Central Intelligence Agency (CIA), will be held behind closed doors, the trial court said on Monday.\nThe first American journalist to be detained on spy charges in Russia since the Cold War more than three decades ago, Gershkovich has repeatedly denied the charges.\nThe Journal says that Gershkovich was doing his job and deny he is a spy.\nRussia said Gershkovich was caught “red-handed”.\nThe enterprise sits at the heart of the Urals region, where Russia conducts some of its most secret weapons production and research."}, {"id": "8e5fe2b1-3c76-4b4a-8fa7-0a097ca6af32", "title": "PD : Motorcyclist dies after crashing into curb in Battle Creek", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/pd-motorcyclist-dies-crashing-curb-013310630.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PD: Motorcyclist dies after crashing into curb in Battle CreekBATTLE CREEK, Mich. (WOOD) — The driver of a motorcycle died Sunday afternoon after crashing, according to police.\nAround 3 p.m., Battle Creek Police were called to the intersection of Beckley Road and Helmer Road S for a crash.\nOfficers found that the driver, a 36-year-old woman, was headed south on Helmer Road, turning left onto eastbound Beckley Road when she hit the southside curb of Beckley.\nShe was taken to the hospital but died in the ambulance while enroute, according to police.\nFor the latest news, weather, sports, and streaming video, head to WOODTV.com."}, {"id": "a052e09d-a7a2-4f71-9844-af1acc15916f", "title": "  House of the Dragon  Season 2 Episode 1 Recap :  A Son For A Son  ", "date": "2024-06-17 03:00", "url": "https://decider.com/2024/06/16/house-of-the-dragon-season-2-episode-1-recap/", "domain": "decider.com", "domain_classification": "Unknown", "message": "Remember the stirring tracking shot that closed out season 1 of House of the Dragon?\nRhaenyra’s husband-uncle Prince Daemon Targaryen (Matt Smith) is raring to incinerate enormo-dragon Vhagar and Prince Aemond Targaryen (Ewan Mitchell), her one-eyed rider.\n“A son for a son.” Go off, Daemon, you ruthless weirdo.\nBefore anything else, she is compelled to see where Lucerys “Luke” Velaryon and his dragon Arrax bought it.\nstream 'house of the dragon' for free Max is currently offering a one-week free trial to new subscribers."}, {"id": "dc2fb947-3888-49a2-b8f6-06253713ee6e", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://rock1067.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "rock1067.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "194287e5-6de7-4402-bc10-c0a35ccbca72", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://wqmf.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "wqmf.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "ca98a1d5-cd71-49f3-a648-09a961d80c97", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1015.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1015.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "05535c9b-0b7d-49cc-8405-a85cb20c6af2", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://newstalk1049.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "newstalk1049.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}]