[{"id": "efc90b7f-db6c-4d2c-a1b3-41c3f9eefc03", "title": "Al - Bureij battalion Salah Jamil Muhammad Emad eliminated by Israel", "date": "2024-05-05 12:00", "url": "https://www.jpost.com/israel-hamas-war/article-799901", "message": "In the attack, several other terrorists who were with him in the terrorist infrastructure of the organization were eliminated.\nIDF airstrike targets Hamas terrorist infrastructure.\nAt the same time, Gaza Division soldiers attacked a Hamas launching area, which contained rockets that were ready to be launched to Israel's south, with artillery fire.\nIn the past day, fighter jets and aircraft of the Air Force attacked additional terror targets in Gaza, including military buildings, terrorist infrastructures, and weapons warehouses.\nAir Force aircraft directed by the Gaza Division killed three Hamas terrorists in the Jabaliya area, including a deputy company commander and two other terrorists from the organization."}, {"id": "fc0dd01d-bc45-4f09-823c-158fd8e44fe3", "title": "Middle East updates : Truce talks resume in Cairo – DW – 05 / 05 / 2024", "date": "2024-05-05 15:30", "url": "https://www.dw.com/en/middle-east-updates-truce-talks-resume-in-cairo/live-68999937", "message": "The Palestinian militant group Hamas said Sunday the latest round of talks in Cairo had finished after \"in-depth and serious discussions.\"\nThe report said Hamas representatives would travel late Sunday to Doha, where Hamas has a political office, to consult with their chiefs.\nIsraeli Prime Minister Benjamin Netanyahu has said he would be willing to agree to a pause in fighting to allow hostages to be released.\nMeanwhile, CIA Director Bill Burns is expected in Doha for emergency discussions on the truce effort with Qatar's prime minister, according to an official cited by news agencies on Sunday.\nBurns has acted as a key interlocutor for the US in talks between Israel, Hamas, Egypt and Qatar over securing a deal."}, {"id": "053d05d3-a6e4-4398-85be-0e6a763dd34a", "title": "Australian police kill 16 - year - old boy after stabbing with  hallmark of terrorism", "date": "2024-05-05 09:30", "url": "https://nypost.com/2024/05/05/world-news/australian-police-kill-16-year-old-boy-after-stabbing-with-hallmarks-of-terrorism/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nAPThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi."}, {"id": "bae3169e-6b1d-402f-9fd2-40a28f67e2dd", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354779.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks."}, {"id": "ca6c24bf-3f30-4397-854f-30d8c7e423f9", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354241.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks."}, {"id": "925c1903-11e7-49e1-b804-a20037391f91", "title": "Hezbollah rocket barrage wounds two in Kiryat Shmona", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/breaking-news/article-799905", "message": "At least two people were lightly wounded after Hezbollah fired a barrage of several dozen rockets toward Kiryat Shmona on Sunday.\nThe Ziv Medical Center received two patients who were wounded by shock waves from the rocket fire.\nHezbollah took responsibility for the rocket fire, saying it launched dozens of Katyusha and Falaq rockets toward Kiryat Shmona in response to an earlier Israeli airstrike on Meiss El Jabal in southern Lebanon.\nA MDA ambulance hit by rocket shrapnel in Kiryat Shmona.\nNorthern residents issue demands to governmentOrganizations representing residents of northern Israel issued a joint statement on Sunday, expressing concerns about a ceasefire agreement reportedly being discussed between Hezbollah and Israel."}, {"id": "ed5087ce-3c61-4fee-b786-5dd390551583", "title": "Australian police shoot dead  radicalised  teenager after knife attack in Perth", "date": "2024-05-05 05:00", "url": "https://www.scmp.com/news/asia/australasia/article/3261462/australian-police-shoot-dead-radicalised-teenager-after-knife-attack-perth", "message": "The teenager “rushed” at police who responded by shooting him twice with tasers before firing a single fatal shot, they said.\nWestern Australian police shot and killed a “radicalised” 16-year-old boy with a knife who stabbed a man in a Perth car park, police and the state premier said on Sunday.\nPolice body camera images showed the teenager refused officers’ demands that he put down the knife, the police chief said.\n03:14 Authorities rule out terrorism in deadly Sydney knife attack Authorities rule out terrorism in deadly Sydney knife attackPolice believe the teenager sent “relevant messages” to some members of the Muslim community who immediately called police, he said, without giving details of the messages.\nTwo days after the mall attack an Assyrian Christian bishop was brutally stabbed during a live streamed service in western Sydney."}, {"id": "1f3ff3a3-d54f-446b-843a-c5ff3370fc7e", "title": "Australian police shoot boy dead after stabbing with  hallmark of terrorism - World", "date": "2024-05-05 06:30", "url": "https://www.brecorder.com/news/40301829/australian-police-shoot-boy-dead-after-stabbing-with-hallmarks-of-terrorism", "message": "SYDNEY: Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia's capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had \"hallmarks\" of terrorism but was yet to be declared a terrorist act, police said.\n\"At this stage it appears that he acted solely and alone,\" Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\n\"We are a peace-loving nation and there is no place for violent extremism in Australia,\" Albanese said on social media platform X.\nGun and knife crime is rare in Australia, which consistently ranks among the safest countries in the world, according to the federal government."}, {"id": "09015456-8184-4076-9462-e04e24e55880", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 15:30", "url": "https://www.hurriyetdailynews.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike-193163", "message": "Hezbollah launches rockets at Israel after deadly south Lebanon strikeBEIRUTA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nHezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\"."}, {"id": "44218931-be8e-4ac6-adfe-f6ab9a27995f", "title": "Police in Australia shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 07:30", "url": "https://www.yahoo.com/news/police-australia-shoot-boy-dead-062748293.html", "message": "The car park in Perth where the stabbing and shooting occurred - Australian Broadcasting Corporation vi APPolice in Western Australia have shot dead a boy after he stabbed a man in Perth, in an attack authorities said indicated terrorism.\nThe apparently random attack, in the car park of a hardware store in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nState Police Commissioner Col Blanch said when police were called to the car park, the youth lunged at officers with the knife and was shot.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi."}, {"id": "269b8284-525f-4aa8-b324-52dc90e075df", "title": "Australian police shoot 16 - year - old boy dead after stabbing", "date": "2024-05-05 05:00", "url": "https://www.theglobeandmail.com/world/article-australian-police-shoot-16-year-old-boy-dead-after-stabbing/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThere were signs the 16-year-old, armed with a kitchen knife, had been radicalized online, state authorities said, adding they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised news conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi."}, {"id": "7d0e1b54-8430-423b-a094-6166014cf561", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 12:45", "url": "https://economictimes.indiatimes.com/news/defence/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/articleshow/109859718.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas 's unprecedented October attack on southern Israel sparked the war in Gaza.Fighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.Lebanon's state-run National News Agency said the strike in Mais al-Jabal killed \"four people from a single family\", updating an earlier reported toll of three dead in the raid it said was carried out by Israeli aircraft.It identified them as a man, a woman and their children aged 12 and 21, and said two other people were wounded.A Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".Mais al-Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.Hezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".The Lebanese movement has repeatedly declared that only a ceasefire in Gaza will put an end to its attacks on Israel, which it says are in support of Gazans and its ally Hamas.Both the United States and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.In Lebanon, at least 390 people have been killed in nearly seven months of cross-border violence, mostly militants but also more than 70 civilians, according to an AFP tally.Israel says 11 soldiers and nine civilians have been killed on its side of the border.Tens of thousands of people have been displaced on both sides."}, {"id": "1953f10e-31b4-488b-a3f2-165e93d3f3d3", "title": "These are the terrorists eliminated near Tulkarem", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389402", "message": "The IDF and ISA on Saturday night announced the names of the terrorists killed in a nearly 13-hour operation near Tulkarem.\n\"Over the last few hours, during a joint IDF, ISA, and Israel Police counterterrorism activity, a Hamas terrorist cell was neutralized in the area of Tulkarem,\" the statement read.\n\"As part of the counterterrorism activity, the forces located the terrorists in the town of Deir al-Ghusun and engaged in fire, eliminating four terrorists.\n\"The four terrorists who were eliminated in the area of Tulkarem were:\"1.\nTamer Abed Allatif Rajeh Rajeh - a Hamas operative from the town of Shuweika."}, {"id": "b0d769ec-3bf4-438a-b0c3-3257a8eb6bc9", "title": "Israel nuclear doctrine after Iran aggression", "date": "2024-05-05 06:30", "url": "https://www.israelnationalnews.com/news/389415", "message": "Any continuing Israeli posture of deliberate nuclear ambiguity could cause terrorist-mentoring Iran to overestimate the first-strike vulnerabilities of Israel's nuclear forces.\nBut if relevant Israeli doctrine were made more obvious to Tehran - that is, if rendered more consistently plain that Israel's nuclear assets met payload and delivery system objectives - Israel's nuclear forces could more reliably serve their existential security functions.\nAny continued ambiguity over Israel’s nuclear posture could create the erroneous impression of a state that is unwilling to retaliate.\nThere are persuasive connections between a selectively disclosed Israeli nuclear doctrine and Iranian perceptions of Israeli nuclear deterrence.\nAnother concerns the relationship between greater policy “openness” and the perceived capacity of Israel's nuclear forces to penetrate Iran’s active defenses."}, {"id": "44c2caed-c0f7-47db-b7de-8a22e4279939", "title": "IDF eliminates top PIJ commander who helped carry out October 7 attacks", "date": "2024-05-04 21:00", "url": "https://www.jpost.com/breaking-news/article-799817", "message": "A joint attack by the IDF and the Shin Bet (Israel Security Services) killed one of the top commanders of the Palestinian Islamic Jihad (PIJ), the IDF announced on Saturday.\n(credit: IDF SPOKESPERSON'S UNIT)The terrorist, Imam Zerev, was killed by Israel Air Force fighter jets in southern Gaza.\nIDF kills Imam Zerev in southern Gaza.\n(Credit: IDF Spokesperson's Unit).\nTwo other terrorists from PIJ were killed in the same air strike."}, {"id": "b6866113-a012-40ed-b208-ea227c15123d", "title": "World News : Australian police shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 11:45", "url": "http://www.gdnonline.com/Details/1311419/Australian-police-shoot-boy-dead-after-stabbing-with-hallmarks-of-terrorism", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia's capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had \"hallmarks\" of terrorism but was yet to be declared a terrorist act, police said.\n\"At this stage it appears that he acted solely and alone,\" Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.\nGun and knife crime is rare in Australia, which consistently ranks among the safest countries in the world, according to the federal government."}, {"id": "2f496b26-c8fb-4f10-8d45-d68130669865", "title": "World News : Australian police shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 15:30", "url": "http://www.gdnonline.com/Details/1311419", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia's capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had \"hallmarks\" of terrorism but was yet to be declared a terrorist act, police said.\n\"At this stage it appears that he acted solely and alone,\" Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.\nGun and knife crime is rare in Australia, which consistently ranks among the safest countries in the world, according to the federal government."}, {"id": "ebdd9474-e1a2-4217-b748-cb6a9037ac69", "title": "Explosion at DRC displaced person camp kills at least 9", "date": "2024-05-03 19:00", "url": "https://www.voanews.com/a/explosion-at-drc-displaced-persons-camp-kills-at-least-9-/7596984.html", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack."}, {"id": "c5ebe398-1ca7-4c3f-b2ac-b3bbeb24cce8", "title": "Explosion at DRC displaced person camp kills at least 9 - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-04 16:30", "url": "https://www.newdelhitimes.com/explosion-at-drc-displaced-persons-camp-kills-at-least-9/", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack."}, {"id": "2182edf0-f1b9-4247-843c-bd7a38c62dad", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 13:15", "url": "https://www.al-monitor.com/originals/2024/05/hezbollah-launches-rockets-israel-after-deadly-south-lebanon-strike", "message": "May 5, 2024 — Beirut (AFP)Official media in Lebanon said an Israeli strike Sunday on a southern village killed four family members, with Hezbollah announcing retaliatory attacks, in the latest cross-border violence since the Gaza war erupted.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon."}, {"id": "f30ae845-fdb4-44c9-ad4d-f3c0a1d2d9bf", "title": "4 killed in Israeli strikes in S . Lebanon - Xinhua", "date": "2024-05-05 15:30", "url": "https://english.news.cn/20240505/2e6299d9a3b8480090eea4fb5e8773f9/c.html", "message": "BEIRUT, May 5 (Xinhua) -- Four people were killed and three others were injured on Sunday in an Israeli airstrike on the southeast village of Mays al-Jabal, Lebanese military sources told Xinhua.\nThe military sources, who spoke anonymously, said that the missile attack by an Israeli warplane destroyed a house in Mays al-Jabal, killed four people of the same family, and wounded three others, including a member of the Lebanese Civil Defense team.\nMeanwhile, the Lebanese armed group Hezbollah said its fighters targeted the northern Israeli city of Kiryat Shmona with dozens of rockets in retaliation to Israeli strikes in southern Lebanon without specifying the casualties.\nA Lebanese military source told Xinhua that about 20 surface-to-surface missiles were launched from southern Lebanon toward northern Israel, some of which were intercepted by Israeli Iron Dome missiles.\nThe confrontations between Hezbollah and Israel have killed 449 people on the Lebanese side, including 283 Hezbollah members and 84 civilians, according to Lebanese security sources."}, {"id": "fe2ba6bc-ed64-44d5-9d1c-ed978775685a", "title": "Russo - Ukraine War - 04 May 2024", "date": "2024-05-05 06:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-04.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nLyman axis: the Ukrainian Defense Forces repelled 7x attacks in the vicinities of Serebryans'ke forestry (Luhansk oblast), Terny (Donetsk oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Nevs'ke (Luhansk oblast), Terny, Yampolivka, Tors'ke (Donetsk oblast).\nKherson axis: Russia does not abandon its intention to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River."}, {"id": "0da11b39-0dd1-4451-b97c-f65cc5a10cae", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:15", "url": "https://www.edp24.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "dab65086-c66c-4e88-81e5-6bcc3984d6b9", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 10:00", "url": "https://www.bournemouthecho.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "5c0e50de-e3d6-4c5e-959d-c2d0b79b8b54", "title": "Police shoot dead  radicalised  teenager after he stabbed man | Bradford Telegraph and Argus", "date": "2024-05-05 08:00", "url": "https://www.thetelegraphandargus.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "762de87d-1126-4d42-81ca-5354c711925b", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:00", "url": "https://www.lancashiretelegraph.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "a11ae688-ede8-4533-b079-1572ad646fa3", "title": "Terror strikes IAF convoy in J & K , one soldier dead", "date": "2024-05-04 23:45", "url": "https://www.dailypioneer.com/2024/page1/terror-strikes-iaf-convoy-in-j-k--one-soldier-dead.html", "message": "The attack occurred near Shashidhar when the convoy vehicles were moving towards Sanai Top in the district's Surankote area.\nFive Indian Army personnel including two officers were \"killed in action\" in the Kalakote forest area of Rajouri on November 22.\nTwo terrorists, including a top commander of LeT identified as Quari, were also killed in the two-day long gunfight.\nQuari was said to be the mastermind behind several attacks, including the killing of 10 civilians and five Army personnel in the district.\nIn May last year, five more Army personnel were killed and a major-rank officer was injured in Chamrer forest during an anti-terrorist operation."}, {"id": "179122de-c711-4915-b75f-2c721f3c6bf1", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:30", "url": "https://www.eadt.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "26cf27d2-2a30-42fe-af8c-276db65ebaf5", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 09:30", "url": "https://www.yorkpress.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "340a82dc-557b-458f-8e18-e25b8e02a273", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 09:30", "url": "https://www.theboltonnews.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "1853dc33-eaef-4817-992f-cfaaf1caf79f", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.thenorthernecho.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "06373787-2a1c-4bc3-befc-86dbd9381096", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 09:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "f0f5eaf4-31c8-4775-b5f4-a238854efcf8", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:30", "url": "https://www.lbc.co.uk/world-news/82ff8645e2d8492a995683330ae7da66/", "message": "A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth.\nThe teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "42611c0f-1022-4a6c-b4d3-3de55d3e6447", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:45", "url": "https://www.eveningnews24.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "cc559208-05fb-45b2-9ad6-90002af43f1c", "title": "Armies need their own drone air force flown by specialist soldiers , study says", "date": "2024-05-04 10:00", "url": "https://www.yahoo.com/news/armies-own-drone-air-force-090001538.html", "message": "The air war in Ukraine has become a cat-and-mouse game where drones must constantly evolve.\nRUSI envisions each drone battalion being equipped with everything needed to conduct a variety of UAV operations.\nThis would include \"situational awareness UAVs optimized for tactical reconnaissance; tactical strike UAVs; ISR [reconnaissance] UAVs able to penetrate into operational depth; operational strike UAVs; and platform-launched effects designed specifically to synchronize with and enable other weapons systems.\"\nTo support friendly ground troops in contact with the enemy, flocks of expendable reconnaissance drones would operate up to 5 miles beyond the enemy front line.\n\"It therefore makes sense to concentrate UAV operation if UAVs are parts of a mass precision strike complex,\" the report concluded."}, {"id": "31938a8e-e395-436e-bf76-655e6d2cb626", "title": "Armies need their own drone air force flown by specialist soldiers , study says", "date": "2024-05-04 10:00", "url": "https://www.yahoo.com/news/armies-own-drone-air-force-090001120.html", "message": "The air war in Ukraine has become a cat-and-mouse game where drones must constantly evolve.\nRUSI envisions each drone battalion being equipped with everything needed to conduct a variety of UAV operations.\nThis would include \"situational awareness UAVs optimized for tactical reconnaissance; tactical strike UAVs; ISR [reconnaissance] UAVs able to penetrate into operational depth; operational strike UAVs; and platform-launched effects designed specifically to synchronize with and enable other weapons systems.\"\nTo support friendly ground troops in contact with the enemy, flocks of expendable reconnaissance drones would operate up to 5 miles beyond the enemy front line.\n\"It therefore makes sense to concentrate UAV operation if UAVs are parts of a mass precision strike complex,\" the report concluded."}, {"id": "16a73210-ec61-4167-8920-e9d7f01d787a", "title": "Fetterman slams protesters offered education by Houthi terrorists :  Reevaluate things  ", "date": "2024-05-03 18:30", "url": "https://www.wcti12.com/news/nation-world/fetterman-slams-protesters-offered-education-by-houthi-terrorists-reevaluate-things-sen-john-fetterman-d-pa-yemen-sanaa-university-terrorism-group-israel-palestine-gaza-college-student-protests", "message": "Sen. John Fetterman, D-Pa., on Friday cautioned U.S. student protesters against accepting an offer from a terrorist group to continue their studies in the Middle East.\nYemen's Houthi militia, a terrorist group by the State Department, now says U.S. students expelled for pro-Palestine demonstrations will be welcomed at the country's Sanaa University, Reuters .\nReacting to the news, Sen. Fetterman blasted protesters for drawing such support.\n“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” the senator .\nSen. Fetterman has been a vocal ally of Israel during the war, a stance not shared by some of his more progressive colleagues in the Democratic Party."}, {"id": "45abc4db-5cee-4901-839b-e32c5a906189", "title": "Australian police shoot boy after stabbing in Perth", "date": "2024-05-05 06:00", "url": "https://www.rte.ie/news/2024/0505/1447455-australian-police-shoot-boy-after-stabbing-in-perth/", "message": "Australian police have said they have shot dead a boy after he stabbed a man in a Perth car park, in an attack authorities said had indicated terrorism.\nThe attack, in the suburb of Willetton late last night, had \"hallmarks\" of terrorism but was yet to be declared a terrorist act, police said.\n\"We are a peace-loving nation and there is no place for violent extremism in Australia,\" Mr Albanese said on social media platform X.\nMy thoughts are with those who have been affected by the incident in the Perth suburb of Willetton overnight.\nGun and knife crime is rare in Australia, which consistently ranks among the safest countries in the world, according to the federal government."}, {"id": "2bafd5d3-ff9a-4439-a282-e876713140a3", "title": "Fetterman slams protesters offered education by Houthi terrorists :  Reevaluate things  ", "date": "2024-05-03 19:45", "url": "https://wsbt.com/news/nation-world/fetterman-slams-protesters-offered-education-by-houthi-terrorists-reevaluate-things-sen-john-fetterman-d-pa-yemen-sanaa-university-terrorism-group-israel-palestine-gaza-college-student-protests", "message": "Sen. John Fetterman, D-Pa., on Friday cautioned U.S. student protesters against accepting an offer from a terrorist group to continue their studies in the Middle East.\nYemen's Houthi militia, a terrorist group by the State Department, now says U.S. students expelled for pro-Palestine demonstrations will be welcomed at the country's Sanaa University, Reuters .\nReacting to the news, Sen. Fetterman blasted protesters for drawing such support.\n“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” the senator .\nSen. Fetterman has been a vocal ally of Israel during the war, a stance not shared by some of his more progressive colleagues in the Democratic Party."}, {"id": "2e38b538-794d-475a-8659-6c21714e3c91", "title": "Fetterman slams protesters offered education by Houthi terrorists :  Reevaluate things  ", "date": "2024-05-03 19:00", "url": "https://kfdm.com/news/nation-world/fetterman-slams-protesters-offered-education-by-houthi-terrorists-reevaluate-things-sen-john-fetterman-d-pa-yemen-sanaa-university-terrorism-group-israel-palestine-gaza-college-student-protests", "message": "Sen. John Fetterman, D-Pa., on Friday cautioned U.S. student protesters against accepting an offer from a terrorist group to continue their studies in the Middle East.\nYemen's Houthi militia, a terrorist group by the State Department, now says U.S. students expelled for pro-Palestine demonstrations will be welcomed at the country's Sanaa University, Reuters .\nReacting to the news, Sen. Fetterman blasted protesters for drawing such support.\n“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” the senator .\nSen. Fetterman has been a vocal ally of Israel during the war, a stance not shared by some of his more progressive colleagues in the Democratic Party."}, {"id": "91140d45-fd6b-45c3-97c1-5496dd19a984", "title": "Fetterman slams protesters offered education by Houthi terrorists :  Reevaluate things  ", "date": "2024-05-03 19:30", "url": "https://ktul.com/news/nation-world/fetterman-slams-protesters-offered-education-by-houthi-terrorists-reevaluate-things-sen-john-fetterman-d-pa-yemen-sanaa-university-terrorism-group-israel-palestine-gaza-college-student-protests", "message": "Sen. John Fetterman, D-Pa., on Friday cautioned U.S. student protesters against accepting an offer from a terrorist group to continue their studies in the Middle East.\nYemen's Houthi militia, a terrorist group by the State Department, now says U.S. students expelled for pro-Palestine demonstrations will be welcomed at the country's Sanaa University, Reuters .\nReacting to the news, Sen. Fetterman blasted protesters for drawing such support.\n“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” the senator .\nSen. Fetterman has been a vocal ally of Israel during the war, a stance not shared by some of his more progressive colleagues in the Democratic Party."}, {"id": "385a554e-1cb6-410a-a9c6-b4426bdb9e00", "title": "Islamic Jihad commander killed in Rafah , says Israeli army", "date": "2024-05-05 09:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/islamic-jihad-commander-killed-in-rafah-says-israeli-army/articleshow/109852449.cms", "message": "NEW DELHI: A top commander of the Islamic Jihad Rafah Brigade who commanded the Islamic Jihad's elite forces during October 7 attack was killed in an airstrike on Rafah, the Israel Defense Forces (IDF) announced on Saturday, Xinhua news agency reported.Aiman Zaarab \"commanded and directed\" the Islamic Jihad's special soldiers during the October 7 attack on Kibbutz Sufa and the Sufa military post on the Gaza Strip's border.He also led multiple strikes and had been leading the Islamic Jihads' preparations for a battle against the Israeli forces in the southern Gaza Strip in recent days, according to the statement.In addition to Zaarab, two additional Islamic Jihad operatives were killed during the operation, according to the IDF.Meanwhile, Hamas has said that it would not agree to any Gaza ceasefire that does not involve a complete end to the war.Calling Israeli PM Netanyahu's stance on sending ground soldiers into Rafah as the main stumbling point in ceasefire talks, Hamas official said, \"We are eager to reach an agreement, but not at any cost,\" further adding \"full responsibility for insisting on entering Rafah instead of ceasing the aggression\"."}, {"id": "14ab903a-e785-4744-9472-5fb942f9dd8f", "title": "Islamic Jihad commander killed in Rafah : Israeli Army", "date": "2024-05-05 06:15", "url": "https://www.dailyexcelsior.com/islamic-jihad-commander-killed-in-rafah-israeli-army/", "message": "Jerusalem, May 5: The Israel Defense Forces (IDF) announced on Saturday that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the Oct. 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, said the IDF in a statement.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for a combat in the southern Gaza Strip against the Israeli military, according to the statement.\nAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added."}, {"id": "532c1ec5-2b5e-43c5-bb31-f5e60ff9eccd", "title": "  Radicalised  teenager shot dead by police after stabbing man in the back in Australia", "date": "2024-05-05 10:00", "url": "https://www.independent.co.uk/news/world/australasia/perth-australia-teenager-shot-dead-b2539883.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian city of Perth.\nHe was shot dead after Tasers failed to subdue him and he lunged towards officers while armed with a knife.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” he added.\nThe 40-year-old attacker in the mall attack was shot dead by police, who have yet to reveal the man’s motive."}, {"id": "55e33a38-84f7-4bc2-a6e1-7ce48cf3a277", "title": "Islamic Jihad commander killed in Rafah : Israeli army", "date": "2024-05-05 06:15", "url": "https://www.thestatesman.com/world/islamic-jihad-commander-killed-in-rafah-israeli-army-1503297279.html", "message": "The Israel Defense Forces (IDF) has announced that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the October 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, the IDF was quoted as saying on Saturday by Xinhua news agency.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for combat in the southern Gaza Strip against the Israeli military, according to the IDF statement.\nAdvertisementAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added."}, {"id": "bce7e979-fab4-4aff-80d8-5f07b2f20a19", "title": "Perth stabbing : Australian police shoot dead boy after attack with  hallmark of terrorism", "date": "2024-05-05 05:15", "url": "https://www.khaleejtimes.com/world/perth-stabbing-australian-police-shoot-dead-boy-after-attack-with-hallmarks-of-terrorism", "message": "ReutersPublished: Sun 5 May 2024, 8:01 AMAustralian police said on Sunday (May 5) they shot dead a boy after he stabbed a man in Western Australia's capital Perth, in an attack authorities said indicated terrorism, but was yet to be declared a terrorist act.\nThere were signs the 16-year-old boy armed with a kitchen knife had been radicalised online, state authorities said.\nThe police added that they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack on the bishop came only days after a deadly mass stabbing in the Sydney beachside suburb of Bondi that claimed the lives of six people.\nGun and knife crime is rare in Australia, which consistently ranks among the safest countries in the world, according to the federal government."}, {"id": "68dc0d14-12e7-4972-b39f-be2321c25d4c", "title": "Looking back at history : events from May 1924 - Oakdale Leader", "date": "2024-05-03 19:00", "url": "https://www.oakdaleleader.com/209-living/looking-back-history-events-may-1924/", "message": "The month of May has been home to many historical events over the years.\nIodized salt is introduced in the United States on May 1.\nLudendorff ran under the banner of the National Socialist Freedom Movement, which was standing in for the banned Nazi Party.\nOn the day of her death, Lyons allowed three men into her home, likely hoping to rehabilitate them.\nThe United States Border Patrol is created on May 28 to prevent illegal entry into the United States from Mexico and Canada."}, {"id": "268c1df0-a0ee-4a6d-a829-6e56777cf5c2", "title": "N Korea plotting attacks on embassies , Seoul says", "date": "2024-05-03 19:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/04/2003817373", "message": "N Korea plotting attacks on embassies, Seoul saysAFP, SEOULSouth Korea’s spy agency yesterday said that Pyongyang was plotting “terrorist” attacks targeting Seoul’s officials and citizens overseas, with the South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries.\nNorth Korean leader Kim Jong-un, right, visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang on Friday.\nAs a result, the North may be “plotting retaliation” against South Korean embassy staff on such pretenses, NIS added.\nThis marked the highest number of defections by North Korean elites to the South since 2017, Seoul said.\nThe consul, also an intelligence agent, had been monitoring Pyongyang’s illicit activities, including drug trafficking and the production of counterfeit banknotes, according to South Korean reports."}, {"id": "e26cdbcb-7641-42df-a114-2c129ff41acf", "title": "Russo - Ukraine War - 03 May 2024", "date": "2024-05-03 21:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-03.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nRussian forces launched air strikes in the vicinities of Verkhn'okam'yans'ke, Spirne, Ivano-Dar'ivka and New York (Donetsk oblast).\nRussian forces launched air strikes in the vicinities of Vovche, Kalynove, Zhelanne, Vesele, Novoselivka Persha, Komyshivka, Karlivka (Donetsk oblast)."}, {"id": "b0b90a98-f925-47b8-a8d4-8c254b3559f2", "title": "IDF eliminates top Islamic Jihad commander Aiman Zaarab , who played key role in October 7 massacre", "date": "2024-05-05 09:30", "url": "https://www.firstpost.com/world/idf-eliminates-top-islamic-jihad-commander-aiman-zaarab-who-played-key-role-in-october-7-massacre-13767269.html", "message": "The Israeli military said that the Jihadist commander Aiman Zaarab was killed in an Israeli airstrike which was conducted on Saturday.\nThe IDF also mentioned that the Saturday strikes killed two other Islamic Jihad fighters as well.\n🔴ELIMINATED: Aiman ZaarabZaarab was one of the Islamic Jihad Rafah Brigade commanders, responsible for the Islamic Jihad Nukhba force's attack on Kibbutz Sufa and the Sufa military post during the October 7 massacre.\nAlong with Zaarab, two additional Islamic Jihad terrorists… pic.twitter.com/Kh5l2Nk7rI — Israel Defense Forces (@IDF) May 4, 2024What was Zaarab’s role?\nAt least 10 people were killed during their operation in the Southern Israeli town after Islamic Jihad militants infiltrated the region on motorbikes."}, {"id": "e8c61730-5907-4f71-9bc2-7fff85e9c1e0", "title": "UK Could Need an Israeli - Style Iron Dome Air Defense , Says US General", "date": "2024-05-05 11:15", "url": "https://www.businessinsider.com/why-uk-israeli-style-iron-dome-air-defense-sec-analyst-2024-5", "message": "The UK is considering developing an air defense system akin to Israel's Iron Dome.\nAdvertisementFormer US National Security Advisor General HR McMaster has said the UK must prepare for possible future conflicts by building an Israeli-style Iron Dome air defense system.\nIndeed, the UK is considering developing its own Iron Dome air defense system amid growing tensions with Russia and its allies.\nThe Israeli modelMissiles launched from the Iron Dome defense system attempt to intercept a rocket fired from Gaza strip.\nRelated storiesIsrael's short-range Iron Dome is a mobile all-weather air defense system that has been in service since 2011."}, {"id": "0e29fcd9-e35a-4390-a1cd-7a6fb4b9dbf1", "title": "US Marines official reveals details of friendly fire towards IDF drones - Israel News", "date": "2024-05-05 09:45", "url": "https://www.jpost.com/israel-news/article-799885", "message": "According to Marine Lt.-Col. Michael Pruden, the IDF destroyed 40% of its own uncrewed aerial systems (UAS).\nIDF has previously acknowledged accidental knockdowns of its own dronesPruden clarified that the IDF has also previously acknowledged accidental knockdowns of its drones.\n\"How am I putting a small UAS in the sky, thousands of these things, and not telling anybody about it, especially your ground-based air defense and counter-UAS [elements]?\"\nIsrael’s current defense system includes Arrow 3, an exoatmospheric hypersonic anti-ballistic missile, and Arrow 2, an endoatmospheric anti-ballistic missile built by Israel Aerospace Industries.\nThe laser air defense system, the Iron Beam, will join as another line of defense."}, {"id": "c083a2ed-4a10-4c94-81cf-e05704ded593", "title": "Rafah offensive and war in Gaza : Threat of a dangerous escalation", "date": "2024-05-04 06:45", "url": "https://www.firstpost.com/opinion/rafah-offensive-and-war-in-gaza-threat-of-a-dangerous-escalation-13767004.html", "message": "Rafah and RegionWithin the region, there is apprehension about the Rafah offensive.\nIn case of the Rafah offensive going ahead, there is all likelihood that the engagements from Hezbollah into northern Israel will grow.\nConclusionLike the Israeli strike on the Iranian consulate in Damascus, the Rafah offensive too threatens to escalate the conflict if launched.\nWhile the Iran-Israel spat was short, the Rafah offensive could spread very fast.\nThe only face-saving exit for either of the parties is an early and long lasting ceasefire in Gaza before any offensive in Rafah."}, {"id": "9baacff0-2f55-479f-9d30-f9fb4f914d4f", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 10:30", "url": "https://www.yourlocalguardian.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "554039fd-0823-45b2-ba5e-cc5b079c41c0", "title": "Australian Muslims claim  double standard  in police handling of hate crime incidents – International Shia News Agency", "date": "2024-05-04 12:15", "url": "https://en.shafaqna.com/367278/australian-muslims-claim-double-standard-in-police-handling-of-hate-crime-incidents/", "message": "Shafaqna English- Australian Muslims claim ‘double standard’ in police handling of hate crime incidents, ead of the Australian National Imams Council (ANIC) said.\nAn April 13 knife attack in a mall in Sydney, Australia killed six people before police killed the attacker.\nDays later, Australian police said the attacker had mental health problems that led to the isolated act and that the attack was not related to terrorism.\n“One was described as a mental health issue, the other one was labeled a terrorist act.\nEmphasizing that the language used by police did not help the situation, Al-Suleiman said they conveyed their concerns about a double standard to authorities but got unsatisfactory feedback."}, {"id": "89ef4dc9-b832-4b7d-a297-5a96546279a7", "title": "Ukraine wiped out 100 Russian troops at once in a strike showcasing the range and power of its new US ATACMS", "date": "2024-05-04 05:45", "url": "https://www.businessinsider.in/international/news/ukraine-wiped-out-100-russian-troops-at-once-in-a-strike-showcasing-the-range-and-power-of-its-new-us-atacms/articleshow/109819475.cms", "message": "Ukrainian forces took out more than 100 Russian soldiers with an ATACMS missile, per OSINT analysts.\nAdvertisementA Ukrainian ATACMS long-range missile strike killed more than 100 Russian soldiers in an occupied region 50 miles from the front line, according to OSINT and military analysts.\nOsinttechnical said at least one of the missiles struck a gathering of more than 100 Russian soldiers, with hundreds of M74 APAM bomblets falling on them.\nThe US had previously sent ATACMS with a shorter range to Ukraine, but the versions sent recently can travel about 190 miles — which puts higher-value targets in Ukraine's crosshairs.\nThe US sent Ukraine ATACMS with a shorter range last fall, which enabled Ukraine to destroy Russian helicopters and airfields behind the front lines, but not go after more distant targets."}, {"id": "50436409-29de-4bed-bd74-c17dd83ce325", "title": "Teenagers and terrorism : What is being done ? ", "date": "2024-05-03 20:45", "url": "https://www.brisbanetimes.com.au/national/vulnerable-cohort-what-is-it-about-teenagers-and-terrorism-and-what-is-being-done-20240502-p5foez.html", "message": "AdvertisementNor is the link yet clear between the six charged this week and the church attacker, though one described him as a “mate”.\nThey had comprised half of ASIO’s “priority counter-terrorism caseload” just a couple of years ago, and “it’s picked up again”, he said.\nASIO Director-General Mike Burgess told the press club that young terror suspects were not a new problem.\nMuslim leaders have slammed authorities for not exploring alternatives to the counter-terrorism raids in Sydney last month.\nThe speed with which police designated the church stabbing a terrorist incident, just hours after it occurred, remains another source of grievance."}, {"id": "8769fb58-181f-4581-86a2-88d4edb1b422", "title": "Israeli forces kill Hamas gunmen in overnight raid near West Bank Tulkarm", "date": "2024-05-05 06:15", "url": "https://www.deccanherald.com/world/israeli-forces-kill-hamas-gunmen-in-overnight-raid-near-west-banks-tulkarm-3008337", "message": "Hamas, the Islamist group which Israel has been fighting in Gaza, had also been building its fighting network in the West Bank before the start of the war.\nDuring the raid, the Israeli army levelled a two-storey house with a bulldozer in an operation that lasted more than 12 hours.\nAccording to Palestinian Health Ministry records, nearly 500 Palestinians have been killed by Israeli forces or Jewish settlers in the West Bank or East Jerusalem since Oct. 7.\nPalestinians want the West Bank and Gaza, which Israel captured in the 1967 Middle East war, as the core of an independent state with East Jerusalem as its capital.\nMore than 34,000 Palestinians have been killed in Israel's seven-month-old assault on the Gaza Strip, say health officials in the Hamas-ruled enclave."}, {"id": "2d2a6ef8-3911-4aaf-8464-ad5305fc7348", "title": "Opinion | Red Flag for India as China Disbands SSF with AI Warfare on Mind", "date": "2024-05-05 15:45", "url": "https://www.news18.com/opinion/opinion-red-flag-for-india-as-china-disbands-ssf-with-ai-warfare-on-mind-8878871.html", "message": "The PLA now comprises four arms — the three new forces plus the pre-existing Joint Logistics Support Force — and four services, the PLA Ground Force (PLAGF), PLA Navy (PLAN), PLA Air Force (PLAAF) and PLA Rocket Force (PLARF).\nIt relied on network information systems, informationised weapons and equipment and was supposed to be conducted in the land, sea, air, space, cyber electromagnetic and cognitive domains.\nThe IFS intends to enhance the PLA’s combat capability by utilising the network information system, including cyberattacks, to cripple the enemy’s chain of command system.\nChina is also looking into using AI to help in the guidance, detection and identification of targets by missiles.\nInstead, it will wage an asymmetrical war using a combination of information warfare and AI."}, {"id": "011a9e41-6b47-4d1b-9aa6-6579ebf806c9", "title": "Progress in Gaza cease - fire talks , but little chance of ending war", "date": "2024-05-04 19:00", "url": "https://www.nydailynews.com/2024/05/04/israel-hamas-cease-fire-talks-progress-no-end-to-war/", "message": "Hamas has called for a complete end to the war and withdrawal of all Israeli forces from Gaza.\nA senior Israeli official, speaking on condition of anonymity to discuss ongoing negotiations, played down the prospects for a full end to the war.\nIsraeli strikes early Saturday on Gaza killed at least six people.\nA strike in the Nuseirat refugee camp in central Gaza killed three people, according to hospital officials.\nOnce inside Gaza, the convoy was commandeered by Hamas terrorists, before UN officials reclaimed it."}, {"id": "494fb2c7-1135-4405-9ff7-f9c86fd108db", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 16:30", "url": "https://thefrontierpost.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/", "message": "BEIRUT (AFP): A local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon’s Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas’s unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed “four civilians”.\nHezbollah in a statement said it fired “dozens of Katyusha and Falaq rockets” at Kiryat Shmona in northern Israel “in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal”."}, {"id": "e17f19b5-5025-4c5e-922c-73a62898bff5", "title": "The US Military China Missile Problem Is Getting Worse", "date": "2024-05-04 08:30", "url": "https://www.businessinsider.com/us-military-china-missile-problem-getting-worse-2024-5", "message": "American warships and bases in the Pacific are within reach of an increasingly worrying threat, a daunting missile force unlike any the US has faced in combat before.\nWith these missiles, China is signaling that it could attack US bases and ships in the region with little to no warning, Clark said.\nDepartment of DefenseThere's a lot more to the Chinese Rocket Force than these weapons, though.\nThat said, the US and its allies can't afford to assume the Rocket Force won't be ready should conflict come.\nIn other words, how the US prepares itself and adapts to the Chinese Rocket Force gives it the best shot at avoiding a fight altogether."}, {"id": "0f7eb036-6aee-49ea-b6f7-5c4ce2a07aa0", "title": "Russian attacks across Ukraine kill 4 people , injure 19 over past day", "date": "2024-05-05 09:45", "url": "https://www.yahoo.com/news/russian-attacks-across-ukraine-kill-082004803.html", "message": "Russian attacks across Ukraine killed four people and injured 19 over the past day, regional authorities said on May 5.\nRussian forces targeted nine of Ukraine's oblasts – Chernihiv, Zaporizhzhia, Mykolaiv, Dnipropetrovsk, Sumy, Odesa, Kherson, Kharkiv, and Donetsk.\nRussian troops attacked settlements in Donetsk Oblast 19 times over the past day, according to Governor Vadym Filashkin.\nRussian forces attacked Kharkiv, targeting the city's Osnovianskyi and Industrialnyi districts.\nRussian forces struck the regional center of Odesa Oblast with missiles, injuring a man and two women, Governor Oleh Kiper reported."}, {"id": "617b1189-fc43-4b41-bee1-a4d1812a29ed", "title": "Joe Biden needs to look to the past : Use a little tough love to bring Israel to heel", "date": "2024-05-05 10:30", "url": "https://www.yahoo.com/news/joe-biden-needs-look-past-100500596.html", "message": "Since prolonging this needless slaughter keeps him in power, Israeli Prime Minister Benjamin Netanyahu will not end it on his own.\nPresident Joe Biden must stop sending weapons and money to Israel.\nTwo U.S. presidents — Gerald Ford and George H. W. Bush — used this kind of tough love to bring Israel to heel.\nMeanwhile, they’re burning political capital hard earned by John Tower, Bill Clements, Phil Gramm, Kay Bailey Hutchison, George H.W.\nBush, George W. Bush and Rick Perry, along with consultants such as Karl Rove."}, {"id": "4a1170bb-4451-4e26-bca5-6507697ecedc", "title": "The united kingdom could need an Israeli - style Iron Dome air defense system , says former US national security advisor", "date": "2024-05-05 11:30", "url": "https://www.yahoo.com/news/uk-could-israeli-style-iron-102958571.html", "message": "The UK could need an Israeli-style Iron Dome air defense system, says former US national security advisorThe UK is considering developing an air defense system akin to Israel's Iron Dome.\nFormer US National Security Advisor General HR McMaster has said the UK must prepare for possible future conflicts by building an Israeli-style Iron Dome air defense system.\nIndeed, the UK is considering developing its own Iron Dome air defense system amid growing tensions with Russia and its allies.\nThe Israeli modelMissiles launched from the Iron Dome defense system attempt to intercept a rocket fired from Gaza strip.\nIsrael's short-range Iron Dome is a mobile all-weather air defense system that has been in service since 2011."}, {"id": "6af97118-d399-41eb-a167-167c64792f15", "title": "Sunday morning news brief , May 05 - The Times of India", "date": "2024-05-05 04:00", "url": "https://timesofindia.indiatimes.com/brief/sunday-morning-news-brief-may-05/liveblog/109850664.cms", "message": "08:27 (IST) May 05According to police sources, she was found at a farmhouse in Kalenahalli near Hunsur taluk of Mysuru.\nShe was taken to Bengaluru for questioning.\nThe farmhouse where she was found allegedly belongs to Rajagopal, said to be Revanna's personal assistant."}, {"id": "4c45e898-9f1b-49fc-a2de-c3b642282c9c", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.wimbledonguardian.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "5b2469ce-80a2-428a-a7dc-54d53184b477", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.thecomet.net/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "9a7c4049-2c43-4839-8fa5-4843e0002c39", "title": "Police shoot dead  radicalised  teenager after he stabbed man | Richmond and Twickenham Times", "date": "2024-05-05 07:30", "url": "https://www.richmondandtwickenhamtimes.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "d976a479-fc4e-4cf2-a63b-4c33287de2be", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.eveshamjournal.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "b10c4cfe-e5a7-447a-b26b-a628921dfba1", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.glasgowtimes.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "355796f4-9c2a-4b0e-abc4-11b17ad711eb", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:30", "url": "https://www.wirralglobe.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "6c7d8525-6534-4e77-b7db-3fd804f486d6", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 07:15", "url": "https://www.thisislocallondon.co.uk/news/national/24299882.police-shoot-dead-radicalised-teenager-stabbed-man/", "message": "The teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\nThe boy had been participating in a programme for young people at risk of radicalisation, Mr Blanch added.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}]