[{"id": "36d5fbd8-c5ab-4159-ac35-60b82fffbe3c", "title": "Tropical Storm Hone : Hawaii faces flooding and road closures as three Cyclones stir in Pacific", "date": "2024-08-27 03:30", "url": "https://timesofindia.indiatimes.com/world/us/hawaii-faces-flooding-and-road-closures-as-three-cyclones-stir-in-pacific/articleshow/112821416.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tropical storm Hone brings heavy rain to HawaiiImpact on Big IslandPrecautions against future fires amid Tropical Storm HoneHurricane Gilma and Tropical Storm Hector gain strengthThree tropical cyclones were active in the Pacific Ocean on Monday, bringing varied effects to different regions.\nTropical Storm Hone caused significant rainfall and flash floods in Hawaii , while Hurricane Gilma and Tropical Storm Hector were gaining strength and moving eastward.The impacts of these storms led to road closures and power outages to potential future flooding concerns.Tropical Storm Hone, pronounced \"hoe-NEH,\" caused road closures, downed power lines, and damaged trees in parts of the Big Island , according to William Ahue, a forecaster at the Central Pacific Hurricane Center in Honolulu.\n\"No major damage that we know of yet,\" news agency AP quoted Big Island mayor Mitch Roth as saying.\nAdditionally, four schools on the Big Island were closed because of power outages and flooded roads.\n\"We were experiencing tropical storm winds and heavy pounding rain through the night.\""}, {"id": "1938de76-bca4-468a-b6c3-d88c78353d9b", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 01:00", "url": "https://wacotrib.com/ap/national/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific/article_523a390c-d295-52ee-b6ec-61bb86c89914.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone which brought heavy rain to Hawaii, Hurricane Gilma which was gaining strength and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "207895ff-7315-4097-a7b8-759dbb981f7e", "title": "Back - to - Back Hurricanes : Hawaii Could Face Gilma Less Than a Week After Hone", "date": "2024-08-27 01:15", "url": "https://www.theepochtimes.com/us/back-to-back-hurricanes-hawaii-could-face-gilma-less-than-a-week-after-hone-5713050", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone began its pass of the islands as a Category 1 Hurricane on Aug. 25, diminishing to a tropical storm in the process.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center/National Weather ServiceThe Hawaiian Islands could face back-to-back storms as the National Hurricane Center (NHC) forecasts Hurricane Gilma to arrive within striking distance by Labor Day Weekend—less than one week after Hurricane Hone.\nThere are currently three named storms in the Pacific, with Tropical Storm Hector following behind Gilma."}, {"id": "22c4e854-baa8-4621-8d66-8604b30d7cb0", "title": "Magnitude 5 . 9 earthquake recorded off coast of Darwin", "date": "2024-08-27 03:30", "url": "https://www.dailymail.co.uk/news/article-13782683/Magnitude-5-9-earthquake-recorded-coast-Darwin-Northern-Territory.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A powerful magnitude 5.9 earthquake has been recorded off the coast of Darwin.\nThe earthquake was recorded in the Banda Sea with a depth of 62km at about midday on Tuesday.\nThe powerful quake just hours after a magnitude 3.0 tremor hit Victoria's Gippsland region 190km south-east of Melbourne at 7.54pm on Monday night.\nMeanwhile, residents in NSW's Upper Hunter region and beyond were rattled by a magnitude 5.0 earthquake just after 12pm on Friday.\nIt came just hours after a magnitude 3.2 earthquake shook the nearby town of Muswellbrook at 1.10am with another magnitude 2.5 quake felt at 2.30am."}, {"id": "7e021dc2-2ac1-48fb-ba58-1644b0ccbb42", "title": "No more  wildfires of note  burning in B . C . ", "date": "2024-08-27 02:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-of-note-1.7305489", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "There are no longer any \"wildfires of note\" burning in British Columbia, with the B.C.\nThe Corya Creek wildfire, about 170 kilometres northeast of Terrace, B.C., was the last fire to be tagged with the label, which was lifted on Monday.\nFire information officer Emilie Peacock cautions the changing status doesn't mean the wildfire season is over.\nMore than 10,000 square kilometres of land has been burned in B.C.\nLast year's record wildfire season saw more than 28,000 square kilometres of land burned and forced the evacuations of communities in regions including the Okanagan and Shuswap."}, {"id": "3a877bba-18c0-4286-8e66-469b40f794e9", "title": "Forecasters monitoring disturbance in Atlantic after weeks of relative calm", "date": "2024-08-27 01:15", "url": "https://www.tampabay.com/hurricane/2024/08/26/forecasters-monitoring-disturbance-atlantic-after-weeks-relative-calm/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "After weeks of relative calm in the tropics, forecasters are monitoring a disturbance in the central Atlantic that could slowly develop over the next week.\nForecasters gave the disturbance a 0% chance of developing over the next 48 hours and a 20% chance of doing so over the next week.\nThe next named storm in the 2024 Atlantic hurricane season will be Francine.\n• • •Tampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters.\nForecasters predict ‘extremely active’ 2024 hurricane season."}, {"id": "48309c0a-326e-4da7-b6eb-bfcee95a1f49", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "6636c2b2-3362-4916-a6e6-fe2aca3a73d7", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "5e85cb99-4e33-4212-8207-56b2608637d4", "title": "  Pretty scary : Tropical Storm Hone lashes parts of Hawaii Island as a Cat 1 hurricane", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/26/pretty-scary-tropical-storm-hone-lashes-parts-hawaii-island-cat-1-hurricane/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "(HONOLULU) - Tens of thousands of Hawaii Electric customers were without power across the state as Tropical Storm Hone moved through the islands over the weekend.\nIt upgraded to a Category 1 Hurricane late Saturday as it brushed the southern point of Hawaii Island on Sunday.\nAs of late Sunday evening, Hone was downgraded back to tropical storm as it pulled away from the islands.\nAt 11:30 a.m. Sunday, roughly 18,000 HECO costumers were without power across the state, the majority of them on Hawaii Island.\nHawaii Island residents can report damages from Hurricane Hone here or call (808) 935-0031."}, {"id": "81d0ecda-7b14-4c0a-b83a-4a6fc037662f", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/bc-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "3ffe118a-12b4-4033-a5cf-20deea26bc5f", "title": "Hurricane forecasters track disturbance in Atlantic Ocean | Hurricane Center", "date": "2024-08-27 03:15", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/hurricane-forecasters-track-disturbance-in-atlantic-ocean/article_c596eb90-b9e7-5009-8fff-48be440eb86c.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "297f3673-8248-48f5-bc27-ff4f2f0c0061", "title": "Impacts of the drought across the Shenandoah Valley", "date": "2024-08-27 04:15", "url": "https://www.whsv.com/2024/08/27/impacts-drought-across-shenandoah-valley/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "For a second year in a row, the Shenandoah Valley is facing the worst of it.\nFour out of the top five Ag producing counties in the state, are in the Shenandoah valley.\nAn idea of how impactful the drought really is:For the Shenandoah Valley, 4 out of the top 5 Ag producing Counties are in the SV.\nSoybeans instead of corn”Along the Shenandoah River is the Burnshire Dam in Shenandoah county.\nThe Virginia Department of Forestry says drought stress impacts the trees, but more so it’s going to be from disease or invasive insects."}, {"id": "275d2598-3648-40b4-b011-3594e90491d9", "title": "Moderate earthquake , 5 . 9 mag has occurred near Kepulauan Babar , Indonesia", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/moderate-earthquake-5-9-mag-has-occurred-near-kepulauan-babar-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake magnitude 5.9 (ml/mb) has struck on Tuesday, Kepulauan Babar, Indonesia (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmzd.\nId of event: us6000nmzd.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Kepulauan Babar, Indonesia."}, {"id": "62e5179b-94a6-4aba-9a5e-312bfe5aa601", "title": "Local farmers in desperate need of drought assistance", "date": "2024-08-27 03:45", "url": "https://www.wsaz.com/2024/08/27/local-farmers-desperate-need-drought-assistance/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "HURRICANE, W.Va. (WSAZ) - An awareness meeting was held Monday in Hurricane to inform West Virginia farmers about programs to assist them during this historic drought.\nJoshua Lewis, the District Director of the Farm Service Agency, spoke at the meeting, held at the Holiday Inn Express, to inform people of assistance available through the agency.\nI mean, I know the big farmers has gotta have help, but us small farmers has to have help also,” Black said.\nI put it on Facebook, had everybody to share it,” said Jeanette Waller, a local farm owner.\nThe Farm Service Agency said farmers have until the end of the calendar year to apply and need to make sure to keep all receipts to get accurate funding."}, {"id": "b9f357dd-4f79-448e-98af-f1b269ad66af", "title": "Light earthquake 4 . 5 mag , 60 km S of Kangding , China", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-60-km-s-of-kangding-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Tuesday, 60 kilometers (37 miles) from Kangding in China.\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000nmvn.\nEpicenter of the earthquake was 66 km (41 miles) from Kangding (c. 100 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 60 km S of Kangding, China."}, {"id": "2a315a0a-5dc1-43e0-8a1e-7f9c0ba8943a", "title": "Light earthquake , 4 . 5 mag strikes near Pondaguitan in Philippines", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-strikes-near-pondaguitan-in-philippines-20/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Monday, 121 km SE of Pondaguitan, Philippines (75 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmyj.\nId of event: us6000nmyj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 121 km SE of Pondaguitan, Philippines."}, {"id": "9801252f-6e42-4b07-8696-60316bd1d8e7", "title": "Rain , cooler weather end campfire ban on Vancouver Island - Victoria Times Colonist", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/local-news/rain-and-cooler-weather-bring-end-to-campfire-ban-on-vancouver-island-9437434", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Fire danger ratings across most of Vancouver Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said recent rains and cooler temperatures will allow it to lift the campfire ban on Vancouver Island as of noon on Wednesday.\nFire danger ratings across most of the Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said in a statement.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "815633e8-ccda-42ad-8102-c7cab579b1c9", "title": "Light earthquake : M4 . 9 quake has struck near Santa Maria in Philippines", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-m4-9-quake-has-struck-near-santa-maria-in-philippines-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has occurred on Friday, 35 kilometers (22 miles) from Santa Maria in Philippines.\nIds that are associated to the earthquake: us7000n8mg.\nThe earthquake was roughly at a depth of 35 km (22 miles).\nExact location of earthquake, longitude 126.7652 East, latitude 8.0167 North, depth = 35 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 35 km E of Santa Maria, Philippines."}, {"id": "4313124d-05a0-4e8e-abb5-4d4979979f50", "title": "Disaster unemployment assistance available to Vermonters who lost work during July 9 - 10 flooding​", "date": "2024-08-27 03:30", "url": "https://www.necn.com/news/local/disaster-unemployment-assistance-available-to-vermonters-who-lost-work-during-july-9-10-flooding/3318228/", "domain": "necn.com", "domain_classification": "Unknown", "message": "The U.S. Department of Labor has approved federal disaster unemployment assistance for Vermonters who lost work because of the flooding from the remnants of Hurricane Beryl on July 9 and 10, the state Labor Department said Monday.\nLast week, President Joe Biden approved a major disaster declaration for parts of the state that were hit by the flooding, including individual assistance disaster, which covers unemployment assistance, for residents in Addison, Caledonia, Chittenden, Essex, Lamoille, Orleans and Washington counties, the state said.\nHeavy rains washed out roads in Vermont in the latest round of flooding to hit the state.\n“Vermonters across the State have found their lives, homes, and businesses impacted again by this recent disaster,” Labor Commissioner Michael Harrington said in a statement.\nThe Labor Department will determine if the individual is eligible for regular unemployment or should apply for the federal benefit."}, {"id": "1cc1cd55-564d-4321-92a1-e2f3438a4342", "title": "Clean - up efforts begin on Hawaii island as Hurricane Hone passes through", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/clean-efforts-begin-hawaii-island-012519326.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HILO, Hawaii (KHON2) — Hawaii island is cleaning up from Hurricane Hone.\nWhile no severe damages were reported, major roads remain closed and some have been without power since Saturday night.\nKauai County: No major impacts from Hone, monitoring looming storms in Eastern PacificFrom Kohala to Kau, Hone dumped over a foot of rain on parts of Hawaii island and some roads were damaged.\nSome volcano residents had power back on by 9 p.m. on Sunday night.\nThe county is hosting two hazard mitigation meetings over the next two days where residents can provide comments and feedback."}, {"id": "83b3c1cc-8393-4444-906c-9815984e055e", "title": "UN Secretary General Antonio Guterres issues climate SOS at earthquake - hit Tonga summit - as he warns that rapidly rising sea levels are  putting this Pacific paradise in peril  ", "date": "2024-08-27 00:15", "url": "https://www.dailymail.co.uk/news/article-13779281/Earthquake-rattles-opening-day-PIF-summit-Tonga.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The UN Secretary General Antonio Guterres has issued a climate SOS at the Tonga summit, warning that rising sea levels are 'putting this Pacific paradise in peril'.\nHe did this at a meeting of the Pacific Islands Forum, whose member countries are among those most imperilled by climate change.\nIt comes as a 6.6 magnitude earthquake rattled the opening day of the Pacific Islands Forum Leaders Meeting.\nNext month the United Nations General Assembly holds a special session to discuss rising seas.\nUnited Nations Secretary-General Antonio Guterres addressed Monday's opening ceremony, which celebrated the diversity of the region."}, {"id": "4781803c-1bae-4b4a-ba0f-491f6528b100", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.vernonmorningstar.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "vernonmorningstar.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "b01e05ab-6444-4cec-aec5-d5519159b73d", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.cloverdalereporter.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "cloverdalereporter.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "cf5b8847-0de5-4432-9cc1-27714e60fea3", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 01:00", "url": "https://www.clearwatertimes.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "clearwatertimes.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "27ffde7f-4272-413d-ac75-ce525af6b302", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.mapleridgenews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "mapleridgenews.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "f5b5c29c-39c3-47b9-b9a8-8048b7c3a627", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.sookenewsmirror.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "sookenewsmirror.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "da27c226-8c7e-449b-9644-0a9c7876c97d", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.westerlynews.ca/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "westerlynews.ca", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "f65f1086-54b6-48c1-a13f-6695bcdc3d22", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.kelownacapnews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "711dc9aa-b548-4e51-a023-bf3d334f6bfb", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 03:45", "url": "https://www.hawkesburygazette.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "db704d0d-a0f4-4a5a-9b15-c287eb8a0b9b", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:15", "url": "https://www.bunburymail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=30776", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "0864082e-0a29-4e13-9d9e-79823a759bf5", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:15", "url": "https://www.bunburymail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "e6979771-479b-462a-9703-0f9a1910ad8f", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.merimbulanewsweekly.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14264", "domain": "merimbulanewsweekly.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "5a03baee-6b2a-4086-a5d0-903c3f33fc28", "title": "Severe storm threat in forecast for Chicago area this week – NBC Chicago", "date": "2024-08-27 02:30", "url": "https://www.nbcchicago.com/news/local/severe-storm-threat-could-bring-heavy-rain-damaging-winds-to-chicago-area/3532611/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area is going to see near-record heat and oppressive humidity on Tuesday, but the threat of severe weather also exists, with gusty winds and heavy rain possible.\nAccording to the Storm Prediction Center, the Chicago area is at a “slight” risk of severe weather Tuesday, with wind gusts up to 60 miles per hour and heavy rains possible.\nThose readings could threaten records in Chicago, but more importantly could cause heat indices of 110-to-115 degrees across the area.\nThe threat of rain will continue into Wednesday, with isolated showers and thunderstorms possible throughout the day.\nStay tuned to the NBC Chicago app and the NBC 5 Storm Team for all the latest weather news and information."}, {"id": "b9a87606-b6a4-47f5-85d3-b8dfef1e311f", "title": "B . C . lifts last  wildfire of note  designation , as number of blazes drops below 300 - Medicine Hat NewsMedicine Hat News", "date": "2024-08-27 01:30", "url": "https://medicinehatnews.com/news/national-news/2024/08/26/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "lifts last ‘wildfire of note’ designation, as number of blazes drops below 300By The Canadian Press on August 26, 2024.\nWildfire Service, *MANDATORY CREDIT* A view of the Cory Creek wildfire is seen near Witset, B.C., in an Aug. 19, 2024, handout photo.\nWildfire Service, *MANDATORY CREDIT*Share this story:VANCOUVER – There are no longer any “wildfires of note” burning in British Columbia, with the BC Wildfire Service saying favourable weather has allowed crews to make good progress in the province’s battle against hundreds of blazes.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "4bd49817-0c0e-4a85-9124-43cd30bc12f0", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.westernadvocate.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "westernadvocate.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "9e26a084-25ea-4a69-ae7f-1a96b53e715e", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:15", "url": "https://www.stalbertgazette.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436655", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "VANCOUVER — There are no longer any \"wildfires of note\" burning in British Columbia, with the BC Wildfire Service saying favourable weather had allowed crews to make good progress in the province's battle against hundreds of blazes.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "e7799f3d-44a0-4af1-8b41-5d55114fe816", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:00", "url": "https://www.richmond-news.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "9c0dea82-7012-4885-8ada-2f8a0001f4cf", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 01:15", "url": "https://www.nsnews.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "42a26679-d6b7-41f1-b78e-7873174d073c", "title": "Iowa Mosquito Population Making Comeback | NEWSRADIO 1040 WHO", "date": "2024-08-27 01:30", "url": "https://whoradio.iheart.com/content/2024-08-26-iowa-mosquito-population-making-comeback/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Iowa State University entomologist Ryan Smith credits regular rains and flooding for the booming populations.\nIowa has more 50 types of mosquitoes.\nIowa State reports so this year, 19 mosquito samples have tested positive for WNV, and one human case reported (in Harrison County).\nIn 2023, 96 mosquito samples tested positive for WNV, and 17 human cases were identified.\nTheir presence can really be a problem, especially in northwest Iowa, a known hot spot for this type of WNV-carrying mosquito,” Smith said."}, {"id": "0157ccdd-8da0-4b92-b1e2-3011b0dd728f", "title": "Iowa Mosquito Population Making Comeback", "date": "2024-08-27 00:45", "url": "https://woc1420.iheart.com/content/2024-08-26-iowa-mosquito-population-making-comeback/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Iowa State University entomologist Ryan Smith credits regular rains and flooding for the booming populations.\nIowa has more 50 types of mosquitoes.\nIowa State reports so this year, 19 mosquito samples have tested positive for WNV, and one human case reported (in Harrison County).\nIn 2023, 96 mosquito samples tested positive for WNV, and 17 human cases were identified.\nTheir presence can really be a problem, especially in northwest Iowa, a known hot spot for this type of WNV-carrying mosquito,” Smith said."}, {"id": "2f068a46-3b17-476d-8c0c-6b179dff6654", "title": "Storms drop significant amount of hail along South Coast - Boston News , Weather , Sports", "date": "2024-08-27 01:15", "url": "https://whdh.com/news/storms-drop-significant-amount-of-hail-along-south-coast/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(WHDH) - Pop-up thunderstorms that hit parts of southern New England dropped a significant amount of hail on several South Coast communities Monday.\nVideos and photos documented hail falling across the South Coast and Cape Cod.\nThe National Weather Service documented additional flooding in Dennis.\nThe National Weather Service issued several severe thunderstorm warnings and flash flood warnings Monday.\nA larger severe thunderstorm watch was scheduled to remain in effect across much of southern New England until 7 p.m.Stay with 7NEWS on-air and online for the latest updates on severe weather."}, {"id": "b88629f5-2eb1-4c05-b8c8-a9d9cb093d35", "title": "The 2024 hurricane season is not dead : Ryan Phillips – NBC 6 South Florida", "date": "2024-08-27 04:15", "url": "https://www.nbcmiami.com/weather/hurricane-season/the-2024-hurricane-season-is-not-dead-some-reminders-ryan-phillips/3401747/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The 2005 hurricane season was an extreme example of epic atmospheric performance orchestrated, in tandem, with epic fatigue for all who endured it.\nIt was 15 years later that a hurricane season combined the right ingredients to produce more storms (30) with more Gulf Coast landfalls than 2005.\nThe Hurricane season is on.\nBut as it stands, I’m left with a few sturdy reminders to share as we enter the heart of the season.\nA late-August lull has produced doubt about what the second part of hurricane season may look like."}, {"id": "9aaf181a-6ca3-4f15-8124-3d0c787fe965", "title": "Emergency Declaration Issued For More Counties In New York State", "date": "2024-08-27 02:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/emergency-declaration-issued-for-more-counties-in-new-york-state/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "New York State issued another \"Disaster Emergency.\"\nNearly two dozen Long Island homes have been determined to have major damage and roughly 17-hundred Suffolk County homes have some damage.\nPresident Biden Approves Emergency Declaration for Suffolk CountyPresident Biden Speaks At West Point Commencement Getty Images loading...Late Sunday, Hochul announced that President Joe Biden had approved her request for a federal Emergency Declaration for Suffolk County.\n\"An Emergency Declaration can be declared for any occasion or instance in which the president determines federal assistance is needed,\" Hochul's Office states.\nKathy Hochul told the New York State Department of Environmental Conservation to issue an \"emergency declaration\" in nearly 20 counties."}, {"id": "bc6bc044-59d4-4c10-8cdb-9b03a7d4edc2", "title": "Marin County supervisors green - light new Stinson Beach home", "date": "2024-08-27 02:00", "url": "http://www.sfchronicle.com/climate/article/stinson-beach-house-18488767.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "A one-story, 1,296-square-foot house is proposed to be built on the last vacant waterfront plot in Stinson Beach.\nLauren Segal/Special to the ChronicleThe Marin County Board of Supervisors has denied efforts to block a proposed house on the last vacant beachfront property in Stinson Beach.\nThe proposed house has been assessed at a value of $3.6 million.\nBut in the intervening decades, concerns about environmentally sensitive habitat and sea level rise have made development more difficult.\n“The county just paid for this great sea level rise study,” said Elizabeth Brekhus, a lawyer representing two neighbors, at the meeting."}, {"id": "9716b994-253b-4670-a977-8d34a04156a8", "title": "Crabs , stingrays & fish dying in Little Sarasota Bay after Hurricane Debby", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/crabs-stingrays-fish-dying-little-003336036.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SARASOTA, Fla. (WFLA) — Hurricane Debby dropped massive amounts of rain on Sarasota County, inundating some neighborhoods with feet of water.\nSarasota Bay Estuary Program Director Dr. David Tomasko said samples collected in Lower Sarasota Bay show run-off from the storm is impacting water quality in the area weeks later.\nNHC monitoring potential tropical disturbance in AtlanticLast week, sampling conducting in Little Sarasota Bay found low to virtually no oxygen on the sea floor.\nTomasko said restoring the historic tidal connection would help flush pollutants out of Sarasota Bay after storms like Debby.\nWhat we have seen in Little Sarasota Bay is the same thing we saw after Hurricane Ian and our water quality in Little Sarasota Bay is the worst part, even though it doesn’t get the greatest amount of runoff in the area.”The estuary program will be back out later this week to collect additional samples in lower Sarasota Bay."}, {"id": "cf59ef5b-2e78-4d73-b405-7f9d6e2c5def", "title": "Fires in Brazil Sao Paulo state under control : authorities", "date": "2024-08-27 02:45", "url": "https://www.digitaljournal.com/world/fires-in-brazils-sao-paulo-state-under-control-authorities/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Amid prolonged drought, Sao Paulo state is experiencing its worst month of August for fires in decades - Copyright Japan's Ministry of Defense/AFP HandoutFires that have razed thousands of hectares of forest in Brazil’s Sao Paulo state have been brought under control, authorities said Monday, though an alert for fresh blazes remained in place.\nSince last Thursday, some 2,700 fires had been reported in the vast agricultural state, with more than 40 municipalities placed on high alert.\nAmid prolonged drought, Sao Paulo state is experiencing its worst August for fires in decades, with more than 3,480 separate blazes identified, according to INPE, the National Institute for Space Research.\nSeveral fires are still raging in the Brazilian Amazon, which is battling the largest number of blazes recorded in nearly two decades.\nExperts and authorities say climate change has exacerbated the dry, hot conditions for fires, most of which are set illegally to clear land for agriculture."}, {"id": "a225a8d2-c283-4c1d-bff3-9a0861bce4a3", "title": "How the Havasupai Tribe warns of flooding during monsoon season", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/27/how-havasupai-tribe-warns-flooding-during-monsoon-season/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "“We had multiple thunderstorms across the area, multiple warnings issued both Wednesday and again on Thursday,” said National Weather Service Flagstaff Meteorologist-In-Charge Brian Klimowski.\nGiven its location and limited access to cell service, the Havasupai Tribe says it does not have a warning system in place.\nAnd that’s really what we rely on most heavily when something like this occurs,” said Havasupai Tribe Spokesperson Abbie Fink.\nLast week’s monsoon was not the first time this area dealt with flooding.\nKlimowski says it’s important to have an escape plan before hiking in a canyon or an area prone to flooding."}, {"id": "2d45d509-c01c-4371-b362-7c4a94d7a1d8", "title": "Suffolk County eyes FEMA funds to repair trail of storm damage", "date": "2024-08-27 03:00", "url": "https://www.newsday.com/long-island/suffolk/fema-suffolk-county-storm-emergency-declaration-otf0boh8", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Suffolk County officials said the dam would have to be replaced, joining a list of homes, roads and other facilities damaged by the record rainfall.\n“What we're facing is an ecological, an environmental, and an economic disaster,” Suffolk County Executive Edward P. Romaine told Newsday on Monday.\nWhat to know Suffolk County officials are eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nare eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nSign up for the Suffolk news this week newsletter The biggest news, politics and crime stories in Suffolk County, in your inbox every Friday at noon."}, {"id": "d232c8f6-365e-4bd4-99b4-00812c6cc231", "title": "Power outage update : Hawaiian Electric working to restore power to 1 , 902 on Big Island , 64 in Upcountry Maui , and 62 on Oʻahu : Maui Now", "date": "2024-08-27 02:00", "url": "https://mauinow.com/2024/08/26/power-outage-update-hawaiian-electric-working-to-restore-power-to-1902-on-big-island-64-in-upcountry-maui-and-62-on-o%CA%BBahu/", "domain": "mauinow.com", "domain_classification": "Unknown", "message": "Hawaiian Electric crews continue work to restore power to the remaining customers impacted by Tropical Storm Hone.\nAs of 10:30 a.m., power restoration continued at the following locations:On Hawaiʻi Island, power has been restored to customers in North Kohala, Volcano and Punalu‘u.\nCustomers in these areas are urged to call the Hawaiʻi Island Trouble Line at 808-969-6666 if they are still without electricity.\nOn Maui, crews are working to restore most of the remaining 64 Upcountry customers later today.\nEven if customers don’t see crews in their area, HECO advises that work is being done to restore power to their communities."}, {"id": "ece39582-3b00-4ca3-b107-8ed1cfa0ffe6", "title": "Fires in Brazil Sao Paulo state under control : authorities", "date": "2024-08-27 02:00", "url": "https://www.ktbs.com/news/national/fires-in-brazils-sao-paulo-state-under-control-authorities/article_01d1e09e-c2fc-5162-af9e-fa4d42b8e9f0.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "c03c7a09-07bf-43c3-8e49-9f1def0c1d86", "title": "What are all those black spots on the Sun ? ", "date": "2024-08-27 04:15", "url": "https://www.yahoo.com/news/those-black-spots-sun-014216821.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The past few nights have been prime opportunities to witness something we call “sunspots”, splotches of black dots on the surface of the Sun.\nThey are inherently cooler than their surroundings, appearing as black splotches to us from ~93,000,000 miles away.\nThe Sun operates on roughly 11 year cycles where sunspot counts rise and fall throughout the cycle.\nIn fact, sunspot counts like we’re seeing haven’t been seen in over 20 years.\nThis has resulted in brief moments just before sunset where spots can be seen with the naked eye."}, {"id": "e6809371-f86d-42fe-b616-a2eaff2a7e4a", "title": "HHS calls for blood donors nationwide as Red Cross faces emergency blood shortage", "date": "2024-08-27 01:15", "url": "https://www.kiro7.com/news/hhs-calls-blood-donors-nationwide-red-cross-faces-emergency-blood-shortage/FP5DTJM6XNAG5O5KJKNFUUW33Y/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "95cd9a70-9cbe-43e3-b56f-f634c96556f0", "title": "Milton water department continues to work on water discoloration", "date": "2024-08-27 03:45", "url": "https://www.wsaz.com/2024/08/26/miltons-water-department-continues-work-water-discoloration/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "MILTON, W.Va. (WSAZ) - On August 16, Milton residents turned on their water and brown-yellowish color came flooding out.\n“I just don’t trust it,” Evans said.\n“We just want clean water.\nIf we pay the bills they should have clean water.\nThey shouldn’t go to meetings to beg for clean water.”Evans says he doesn’t trust the water and drinks bottled water, but he knows change is not going to come overnight."}, {"id": "8d404bc5-20b6-4119-bb17-da782171534f", "title": "What is sea level rise and why does it matter to our future ? ", "date": "2024-08-27 00:45", "url": "https://www.globalissues.org/news/2024/08/26/37490", "domain": "globalissues.org", "domain_classification": "Unknown", "message": "It is worth noting that ocean circulation patterns, such as the Gulf Stream, can lead to regional differences in sea level rise.\n© Unsplash/Omar Eagle Sea level rise is threatening the tourism industry in places like St Lucia in the Caribbean.\nWarmer water grows in volume, a process known as thermal expansion, which is a significant contributor to sea level rise.\nWhat can be done to counter sea level rise?\nHow the UN helpsCountering sea level rise requires a comprehensive and internationally coordinated approach, which the United Nations is uniquely equipped to lead."}, {"id": "6d8cccf7-7e11-4359-816a-85479f3952a4", "title": "UN chief issues  SO for Pacific Islands worst hit by warming ocean", "date": "2024-08-27 00:15", "url": "https://www.yahoo.com/news/un-chief-issues-sos-pacific-235746888.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"I am in Tonga to issue a global SOS – Save Our Seas – on rising sea levels,\" he said.\nWater expands as it warms, contributing to sea level rise, he said.\n\"Pacific islands are uniquely exposed.\nThis is a region with an average elevation just one to two metres above sea level,\" Guterres said.\nWithout cuts to global emissions, the Pacific Islands can expect additional sea level rise of 15 cm (5.9 inches) by 2050 and 30 days a year of coastal flooding, he said."}, {"id": "6c06bb4d-6679-4211-a001-cef8d201f84d", "title": "UN chief warns of rising sea level risk to Islands", "date": "2024-08-27 03:45", "url": "https://www.rte.ie/news/world/2024/0827/1466852-un-pacific-islands/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "United Nations Secretary-General Antonio Guterres said ocean temperatures are rising in the Pacific Islands at three times the rate worldwide, and its population was \"uniquely exposed\" to the impact of rising sea levels.\n\"I am in Tonga to issue a global SOS – Save Our Seas – on rising sea levels,\" he said.\n\"Water expands as it warms, contributing to sea level rise,\" he said.\nThis is a region with an average elevation just one to two metres above sea level,\" Mr Guterres said.\nWithout cuts to global emissions, the Pacific Islands can expect additional sea level rise of 15cm by 2050 and 30 days a year of coastal flooding, he said."}, {"id": "078f00b1-d6cb-456d-b191-3715eb2b2eb3", "title": "UN chief issues  SO for Pacific Islands worst hit by warming ocean", "date": "2024-08-27 02:45", "url": "https://www.asiaone.com/world/un-chief-issues-sos-pacific-islands-worst-hit-warming-ocean", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "\"I am in Tonga to issue a global SOS – Save Our Seas – on rising sea levels,\" he said.\nWater expands as it warms, contributing to sea level rise, he said.\n\"Pacific islands are uniquely exposed.\nThis is a region with an average elevation just one to two metres above sea level,\" Guterres said.\nWithout cuts to global emissions, the Pacific Islands can expect additional sea level rise of 15 cm by 2050 and 30 days a year of coastal flooding, he said."}, {"id": "6538ac8d-7a43-4c52-b5cd-59430510627e", "title": "Celebrities Ignore Deadly Wildfire Smoke Engulfing Brazil Largest City Under Socialist President", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/environment/2024/08/26/celebrities-ignore-deadly-wildfire-smoke-engulfing-brazil-largest-city-socialist-president/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "The current spread of wildfires, under socialist President Luiz Inácio Lula da Silva, is the worst in over a decade.\nMost affected states are deep in the Brazilian Amazon, though the nation’s capital and Sao Paulo are also experiencing high levels of unhealthy air quality.\nThe state of Sao Paulo is facing the highest number of fire outbreaks since 1998, the first year that INPE began tracking Amazon fires.\nAs of Sunday, officials documented a record 3,482 fires in Sao Paulo this month, dwarfing the August previous record of 2,444 wildfires in 2010.\nLula’s Environment Minister Marina Silva reiterated the allegedly unprecedented nature of fires ravaging the swamplands of Sao Paulo at the emergency meeting."}, {"id": "09fc8089-63ba-4a5c-82f7-707d345753bc", "title": "Charges considered over yacht sinking", "date": "2024-08-27 02:00", "url": "http://usa.chinadaily.com.cn/a/202408/27/WS66cd2c2ea31060630b92516d.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Italian Coast Guards carry a body on a rescue boat in Porticello harbor near Palermo, with a third body at the back of the boat on Aug 21, 2024, two days after the British-flagged luxury yacht Bayesian sank.\n[Photo/Agencies]Prosecutors in Italy say the sinking of the superyacht Bayesian off the coast of Sicily, that left seven people dead, could results in charges of manslaughter and negligent shipwreck.\nThe Financial Times newspaper reports that the boat went down rear first, suggesting that compartments at the back of the boat may have become flooded.\n\"The important thing is that when the yacht reaches the surface the sea must be calm.\nThe yacht should be recovered exactly as it is, in one piece, with the aim of maintaining it as intact as possible.\""}, {"id": "e1475104-a584-41a8-8c3d-b5af27c92572", "title": "Charges considered over yacht sinking", "date": "2024-08-27 03:45", "url": "http://africa.chinadaily.com.cn/a/202408/27/WS66cd2c2ea31060630b92516d.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Italian Coast Guards carry a body on a rescue boat in Porticello harbor near Palermo, with a third body at the back of the boat on Aug 21, 2024, two days after the British-flagged luxury yacht Bayesian sank.\n[Photo/Agencies]Prosecutors in Italy say the sinking of the superyacht Bayesian off the coast of Sicily, that left seven people dead, could results in charges of manslaughter and negligent shipwreck.\nThe Financial Times newspaper reports that the boat went down rear first, suggesting that compartments at the back of the boat may have become flooded.\n\"The important thing is that when the yacht reaches the surface the sea must be calm.\nThe yacht should be recovered exactly as it is, in one piece, with the aim of maintaining it as intact as possible.\""}, {"id": "53433104-f266-40eb-9417-7d103e9880ec", "title": "Flooding : Is it time to stop living in basements ? ", "date": "2024-08-27 01:15", "url": "https://www.canadianunderwriter.ca/insurance/flooding-is-it-time-to-stop-living-in-basements-1004249749/", "domain": "canadianunderwriter.ca", "domain_classification": "Unknown", "message": "And that doesn’t take into account the largely overlooked human and social consequences on our communities of flooding.\nFrom cellars designed to store coal, to basements converted into living environmentsIn the past, cellars were dark, damp, utilitarian spaces designed to store coal and other provisions.\nThe use of basements as living spaces has become a particularly popular practice in Québec, but also elsewhere in northeast North America.\nBy regulating the use of basements, it would be possible to significantly reduce the cost and consequences of damage.\nBy taking action, we will be helping to reduce inequalities and ensure a better living environment for all."}, {"id": "b34996ea-b2af-4d20-a5d9-668da3760642", "title": "Artificial Intelligence Predicts Earthquakes With Unprecedented Accuracy", "date": "2024-08-27 04:15", "url": "https://scitechdaily.com/artificial-intelligence-predicts-earthquakes-with-unprecedented-accuracy/", "domain": "scitechdaily.com", "domain_classification": "Unknown", "message": "Researchers at the University of Texas have developed an AI that predicted 70% of earthquakes during a trial in China, indicating potential for future quake risk mitigation.\nAI Earthquake Prediction BreakthroughA new attempt to predict earthquakes with the aid of artificial intelligence has raised hopes that the technology could one day be used to limit earthquakes’ impact on lives and economies.\nTrial Results and Global ImplicationsThe AI was trained to detect statistical bumps in real-time seismic data that researchers had paired with previous earthquakes.\nOnce trained, the AI gave its forecast by listening for signs of incoming earthquakes among the background rumblings in the Earth.\nOne of the next steps is to test the AI in Texas since the state experiences a high rate of minor- and some moderate-magnitude earthquakes."}, {"id": "44b10af4-323d-4313-a334-409627bfcce1", "title": "Abilene experiences moderate drought as drought reaches largest extent in Texas since December 2023", "date": "2024-08-27 00:15", "url": "https://www.yahoo.com/news/abilene-experiences-moderate-drought-drought-213000830.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Abilene experiences moderate drought as drought reaches largest extent in Texas since December 2023ABILENE, Texas.\n(KTAB/KRBC) – According to the Texas Water Development Board, Abilene is experiencing moderate drought conditions.\nDrought in Texas reached its largest extent since December 2023, and an additional 20 percent is vulnerable to drought in the coming weeks.\nThe National Weather Service predicted that we won’t see any improvements any time soon.\nAt 7,900 acre-feet, the lake’s conservation storage sits at 533 acre-feet."}]