[{"id": "31b662f1-4e01-4449-8a37-6ae0dc64a9a2", "title": "Abraham Foxman describes antisemitism at DNC , Jews meet in secret", "date": "2024-08-22 00:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-815794", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Holocaust survivor and former Antidefamation League national director Abraham Foxman expressed concern on Wednesday that the situation for Jews in the US had deteriorated to the point that they had to meet in secret at events like the Democratic Party National Convention.\nFoxman's alarm came after an Agudath Israel of America DNC event on rising antisemitism against Orthodox Jews was disrupted by anti-Israel activists.\n\"Brick by brick, wall by wall, Zionism will fall,\" the activists chanted in a video published by Agudath Israel.\nAfter 50 years fighting antisemitism in America, I could not have imagined a time Jews would have to meet in secret locations in Chicago at DNC.\"\nThe ADL noted that the event was not about Zionism and that Agudath Israel had been targeted for being \"visibly Jewish.\""}, {"id": "e1f1f100-4eea-4ddb-a0f2-ddea25d298c2", "title": "Candace Owens Says She Was  Encouraged  To Talk Negatively About Black People After Anti - Semitic Conspiracies", "date": "2024-08-22 00:00", "url": "https://www.enstarz.com/articles/235591/20240821/candace-owens-says-she-was-encouraged-talk-negatively-about-black-people-after-anti-semitic.htm", "domain": "enstarz.com", "domain_classification": "Unknown", "message": "Candace Owens came under fire after a video of her making inflammatory remarks about Israel went viral over the weekend.\nhttps://t.co/iX9Uihpw7p — Candace Owens (@RealCandaceO) August 18, 2024\"No.\nShapiro — who is Jewish, called Owens' comments \"disgraceful,\" blasting her \"faux sophistication\" on the topic in November.\nJeremy Boreing, chief executive of the publication, shared in an online statement that the \"Daily Wire and Candace Owens have ended their relationship.\"\nIn 2021, the author joined 'The Daily Wire' to host a political talk show titled 'Candace.'"}]