[{"id": "7b56d95c-db4b-4ee8-a46a-334d28ee11b9", "title": "Spain recognizing Palestinian statehood was a big surprise", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804727", "message": "Last summer, we joined the Touro University faculty on a Jewish history course comprised of a study abroad program in Spain and Portugal.\nThe course consisted of extensive lectures and practical fieldwork, visiting sites in both countries that were relevant not only to Jewish history but also to the current Jewish community.\nSignificant progress has been made there, and a modern Spanish Jewish community exists, but any attempt at memorializing their notorious Inquisition seems performative, at best.\nTo wit: In Spain, the Spanish Inquisition and its accompanying expulsion are memorialized by small, embedded wall plaques at several key locations.\nIndeed, anti-Zionism isn’t antisemitism, until it is – and this includes the searing contempt with which Israel is treated because it is a Jewish state."}, {"id": "e53cb775-24b1-43cc-8e0c-0382d23678d8", "title": "Jewish Culture Fest held Sunday in Providence", "date": "2024-06-03 03:00", "url": "https://turnto10.com/news/local/jewish-culture-fest-held-sunday-in-providence-adam-greenman-federaation-mezuzah-klutz-yiddish-kosher", "message": "Rhode Island's Jewish Culture Fest was held Sunday on Elmgrove Avenue, just outside the Jewish Community Center in Providence, hosted by the Jewish Alliance of Greater Rhode Island.\nAccording to Adam Greenman, president and CEO of the Jewish Alliance, the first-of-its-kind event in the state was meant as a way to \"celebrate everything we love about Jewish culture, in a time when antisemitism is rising.\"\nALSO SUNDAY IN PROVIDENCE:Greenman noted it was an opportunity to showcase \"music, dance, art, comedy and, of course, the food,” adding, It is a lot harder to hate people when you have a better understanding of who they are, and that’s our goal.”The free event ran from 11 am to 6:30 pm."}, {"id": "a39699c4-a299-4652-9f48-65ffb0b696a8", "title": "The Cost of Exaggerating the Gaza Protests | Washington Monthly", "date": "2024-06-03 17:30", "url": "https://washingtonmonthly.com/2024/06/03/the-cost-of-exaggerating-the-gaza-protests/", "message": "Daniel J. Boorstin would understand the inordinate focus on a relatively small number of violent campus protests as a “pseudo-event” that exists for the sake of being reported.\nEncampments, walkouts, protests, and sit-ins took place at almost 140 campuses—most of them poorly attended and alienated from majority opinion.\nTo that point, The Washington Monthly’s Marc Novicoff and Robert Kelchen recently ran the numbers that suggest that the Gaza protests were primarily an elite school phenomenon.\nHowever, even in elite institutions, the protests did not necessarily reflect campus sentiment.\nWhy does the media habitually platform this fringe?”The prioritization of pseudo-events over reality is a media vice."}, {"id": "9a51de44-df72-42a1-875c-31a3f2981019", "title": "A conversation for the times", "date": "2024-06-03 10:30", "url": "https://www.jwire.com.au/opposition-criticises-thegover-nment-for/", "message": "Browse > Home News / A conversation for the times – J-WireA conversation for the timesRead on for articleSky News Host Sharri Markson and Federal Opposition Leader Peter Dutton headlined “Behind the Scenes Conversation” at a sold-out function held at Sydney’s Moriah College.\nJCA President Ian Sandler welcomed Senator Dave Sharma, Senator Sarah Henderson, Senator Holly Hughes, Julian Leeser, Kelly Sloan, Richard Shields, and guest of honour, Peter Dutton, who had come to Sydney especially for this event.\nMs Markson opened saying “We live in dark times at the moment, but I want today to be uplifting because there is reason for hope”.\nIn conclusion, Peter Dutton said that “the fight will never be over”.\nIn response to the question of whether support for Hamas is a breach of the law, Senator Sharma said, “It should be”."}, {"id": "7d35bf74-9e36-4704-9eb5-99485d028fbd", "title": "Marchers chanted for the release of hostages in Gaza | Nation and World", "date": "2024-06-03 01:00", "url": "https://www.reviewjournal.com/news/nation-and-world/parade-for-israel-in-nyc-focuses-on-solidarity-3061063/", "message": "People hold Israeli flags and signs ahead of the annual Israel Day Parade on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)NYPD officers are seen ahead of the annual Israel Day Parade on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)Family members of Israeli hostages march during the annual Israel Day Parade on Fifth Avenue on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)People hold signs and Israeli flags ahead of the annual Israel Day Parade on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)Participants march during the annual Israel Day Parade on Fifth Avenue on Sunday, June 2, 2024, in New York."}, {"id": "3eb4f7a4-c390-469c-84de-5963b51e3d96", "title": "The Palestinian Ironclad , Inalienable Right To Resist", "date": "2024-06-03 01:45", "url": "https://www.patheos.com/blogs/gracecoloredglasses/2024/06/the-palestinians-ironclad-inalienable-right-to-resist/", "message": "Basic collective human rights – “self-determination, national independence, territorial integrity, national unity, and sovereignty without outside interference” – are essential and universally legitimate.\nHuman rights are our birthright.\nPalestinians’ human rights were stolen from them generations ago.\nThe Palestinian struggle to achieve their basic collective right is a struggle against the entity that is preventing its realization.\nWarsaw was a prime example of taking up arms in pursuit of human rights."}, {"id": "54b3391c-f49b-4927-ad22-4fa01ad029c4", "title": "Annual NYC parade for Israel draws thousands under heightened security measures", "date": "2024-06-03 00:45", "url": "https://www.krcrtv.com/news/nation-world/annual-nyc-parade-for-israel-kicks-off-with-heightened-security-measures-israel-day-on-fifth-hamas-war-gaza-hostages-palestine-middle-east-fifth-avenue-manhattan-antisemitism-nypd", "message": "An annual New York City parade for Israel that draws thousands of people kicked off Sunday with heightened security and a focus on solidarityThe parade comes almost eight months after the unprecedented Oct. 7 attack by Hamas, the deadliest in Israel's history.\nCrowds of spectators lined the route of what this year is being called \"Israel Day on Fifth.\"\nThere was never a thought of canceling the parade this year, Treyger said, despite what he termed an astronomical rise in antisemitism.\nThat includes drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators all along the parade route.\nWe're not going to allow any unlawfulness and any disruption of any celebration of one's heritage in this city,\" New York City Mayor Eric Adams said at a security briefing."}, {"id": "7c81c91e-3d98-48f8-9038-afbf67cdfe6f", "title": "Parade for Israel in NYC Focuses on Solidarity This Year as Gaza War Casts a Grim Shadow", "date": "2024-06-03 04:15", "url": "https://www.theepochtimes.com/us/parade-for-israel-in-nyc-focuses-on-solidarity-this-year-as-gaza-war-casts-a-grim-shadow-5661268", "message": "NEW YORK—Marchers chanted for the release of hostages in Gaza on Sunday at a New York City parade for Israel that drew thousands of people under heightened security.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\n“Everybody wants hostages back.\nThat included drones, K-9 units, bike patrols, fencing and barriers, and designated entry points for spectators along the parade route.\nIsrael blames Hamas for civilian deaths, accusing it of operating from dense residential areas."}, {"id": "62e0813a-466f-44a5-b7bd-4b5dcf27499f", "title": "New York City parade focuses on Israel , solidarity under shadow of Hamas war", "date": "2024-06-03 00:30", "url": "https://www.voanews.com/a/new-york-city-parade-focuses-on-israel-solidarity-under-shadow-of-hamas-war/7639814.html", "message": "Marchers chanted for the release of hostages in Gaza on Sunday at a New York City parade for Israel that drew thousands of people under heightened security.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\nNew York Police Department officials employed measures typically used for high-profile events such as New Year's Eve and July 4.\nThat included drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators along the parade route.\nIsrael blames Hamas for civilian deaths, accusing it of operating from dense residential areas."}, {"id": "313a1d8c-163e-4825-929b-8a1863664a72", "title": "Online Learn - A - Thon Honoring Rabbi Riskin Will Focus on Jewish Values and Challenges", "date": "2024-06-03 08:15", "url": "https://www.5tjt.com/online-learn-a-thon-honoring-rabbi-riskin-will-focus-on-jewish-values-and-challenges/", "message": "Originally an innovation of the Covid-19 pandemic, Ohr Torah Stone’s online global pre-Shavuot Learn-a-Thon is set to happen on June 9 for the fifth year.\nRabbi Riskin immigrated to Israel from New York, and founded Ohr Torah Stone in 1983; now the organization has a network of 32 schools, education, and social justice programs in Israel and around the world.\nRabbi Sarel Rosenblatt, who leads OTS’s Beren-Machanaim Hesder Yeshiva, will discuss antisemitism and Islam, reflecting Ohr Torah Stone’s commitment to learning about and engaging with other religions.\nShavuot has an extra personal significance at Ohr Torah Stone as it is close to Rabbi Riskin’s birthday.\n“Rabbi Riskin continues to be an inspiration, and his vision is a light to all of us at Ohr Torah Stone,” Rabbi Brander says."}, {"id": "d2290879-0c7a-4a25-ac0a-908d5e20015e", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow", "date": "2024-06-03 01:15", "url": "https://www.kiro7.com/news/national/parade-israel-nyc/UNTTADWLBEAK72K22EUAZMVXC4/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "bd9165dd-bde4-43b7-b58e-9551f600263b", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow - WSVN 7News | Miami News , Weather , Sports", "date": "2024-06-03 06:15", "url": "https://wsvn.com/news/us-world/parade-for-israel-in-nyc-focuses-on-solidarity-this-year-as-gaza-war-casts-a-grim-shadow/", "message": "NEW YORK (AP) — Marchers chanted for the release of hostages in Gaza on Sunday at a New York City parade for Israel that drew thousands of people under heightened security.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\n“Everybody wants hostages back.\nThat included drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators along the parade route.\nOver 36,430 Palestinians have been killed in Gaza by Israel’s offensive, according to Gaza’s Health Ministry."}, {"id": "6ec21b34-e400-4dfc-99c0-738e67fbc4bc", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow", "date": "2024-06-03 08:00", "url": "https://lasvegassun.com/news/2024/jun/02/parade-for-israel-in-nyc-focuses-on-solidarity-thi/", "message": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadowNEW YORK (AP) — Marchers chanted for the release of hostages in Gaza on Sunday at a New York City parade for Israel that drew thousands of people under heightened security.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\n“Everybody wants hostages back.\nThat included drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators along the parade route.\nIsrael blames Hamas for civilian deaths, accusing it of operating from dense residential areas."}, {"id": "79d0233d-4174-43b2-81fa-5657648bf8eb", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow", "date": "2024-06-03 01:30", "url": "https://www.wsbradio.com/news/national/parade-israel-nyc/UNTTADWLBEAK72K22EUAZMVXC4/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e8a06d14-777c-4091-ae41-f4ed8bcd1d05", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow", "date": "2024-06-03 04:00", "url": "https://isp.netscape.com/news/story/0001/20240603/6a1cd208437ee8e6a7332ce28c29d8a6", "message": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadowNEW YORK (AP) — Marchers chanted for the release of hostages in Gaza on Sunday at a New York City parade for Israel that drew thousands of people under heightened security.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\nAbout 100 hostages remain in Gaza, along with the bodies of around 30 more.\n“Everybody wants hostages back.\nThat included drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators along the parade route."}, {"id": "cff7ca28-6753-41b7-b982-b8ddfac4009b", "title": "Parade for Israel in NYC focuses on solidarity as Gaza war casts a grim shadow", "date": "2024-06-03 06:45", "url": "https://www.theday.com/state/20240603/parade-for-israel-in-nyc-focuses-on-solidarity-as-gaza-war-casts-a-grim-shadow/", "message": "People holding Israeli flags gather for the annual Israel Day Parade on Fifth Avenue on Sunday, June 2, 2024, in New York.\nThe parade was held almost eight months after the Oct. 7 Hamas attack in southern Israel that triggered the war in Gaza.\nPeople hold Israeli flags and signs ahead of the annual Israel Day Parade on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)People holding Israeli flags gather ahead of the annual Israel Day Parade on Fifth Avenue on Sunday, June 2, 2024, in New York.\n(AP Photo/Yuki Iwamura)Family members of Israeli hostages march during the annual Israel Day Parade on Fifth Avenue on Sunday, June 2, 2024, in New York."}, {"id": "c54da8cb-7239-477c-8073-b27ebf787a6c", "title": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadow", "date": "2024-06-03 03:30", "url": "https://www.virginislandsdailynews.com/ap/national/parade-for-israel-in-nyc-focuses-on-solidarity-this-year-as-gaza-war-casts-a/article_7fa92460-21c2-5a1a-b247-8c5e0a02e5ee.html", "message": "Parade for Israel in NYC focuses on solidarity this year as Gaza war casts a grim shadowMarchers chanted for the release of hostages in Gaza at a New York City parade for Israel that drew thousands of people under heightened security"}]