[{"id": "1e39b8a3-7692-4b38-8475-48a5ec74ced4", "title": "Jewish writers boycotted during Israel - Hamas war - The Jerusalem Post", "date": "2024-06-04 10:45", "url": "https://www.jpost.com/international/article-804434", "message": "Does this little slice of the literary world even matter?It does.\nThe anti-Israel sentiment in the literary world could have a searing effect on Jewish literature.\nBut Jewish authors are still feeling unsafe.\nThey are endangering that which the literary world is supposed to hold most dear: the free exchange of ideas.\nIn a literary world allegedly dedicated to free speech, what great works of literature will be lost with this censorship?"}, {"id": "3d8e73c2-bda1-461b-beec-366c2e764146", "title": "Columbia University alumnus donates $260 million to Israeli university", "date": "2024-06-04 01:45", "url": "https://www.dailymail.co.uk/news/article-13491191/Columbia-University-alumnus-donates-260-million-Israeli-university.html", "message": "A Columbia grad who was 'active in World War II' has donated $260 million to Israel's Bar-Ilan University.\nBoth gifts were made in the face of fierce pro-Palestine processions that have surfaced across the US over the past several months.\nA Columbia grad who was 'active in World War II' has donated $260 million to Israel's Bar-Ilan University.\nIt’s just the beginning,' added political Hank Sheinkopf, offering the insight to the famously pro Israel New York Post.\n'Dear university students in the United States of America, you are standing on the right side of history.'"}, {"id": "1f3b80f7-35a7-430d-9f26-0308e8405c94", "title": "Anti - Palestinian discrimination investigation opens at UNC following complaint", "date": "2024-06-04 03:45", "url": "https://www.dailytarheel.com/article/2024/06/university-title-vi-investigation-anti-palestinian-discrimination", "message": "Khalili wrote that this email failed to acknowledge Israel's violence against Palestinians and address Islamophobia or Palestinians by name, while it did address antisemitism and Israel.\nA counter protester, UNC religious studies professor, began shouting “Nazis” at the protestors supporting Palestine and was escorted away by UNC Police.\nKhalili wrote that while the incident was reported to UNC’s Equal Opportunity and Compliance Office, all complaints were dismissed.\nSUBSCRIBE NOWProposed remediesWithin the complaint, Khalili called for the OCR to review and establish ongoing monitoring of the actions UNC takes in response to complaints of discrimination against Palestinian students.\nAn investigation into the discrimination of Jewish students at the University is also currently being conducted by the OCR."}, {"id": "ce7ec789-44ed-48a2-bda5-8fe386845351", "title": "Terrorism and the Israel - Palestine conflict", "date": "2024-06-04 08:15", "url": "https://independentaustralia.net/politics/politics-display/terrorism-and-the-israel-palestine-conflict,18653", "message": "The history of the Israel-Palestine conflict makes clear that we have not learned from the horrors of the past, Dermot Daley writes.\nThe world recoiled at the use of explosives on civilian targets within the UK to create fear and awe.\nWhen, in 1948, a new Jewish State was created in Palestine – as with the 1917 Balfour Declaration – the existing populace was not consulted.\nPoliticians have rushed forward to claim that the actions of Hamas and the IDF cannot be compared.\nWe urgently need to redefine what constitutes terrorism and we must wash the blood off our hands and publicly step up as defenders of true justice."}, {"id": "35ace6da-dae6-4505-b3e4-9ccf8d2b6bf5", "title": "Community rallies for A . S . divestment resolution with market and march", "date": "2024-06-04 04:15", "url": "https://dailynexus.com/2024-06-03/community-rallies-for-a-s-divestment-resolution-with-market-and-march/", "message": "The efforts preluded a vote within the Associated Student Senate on a divestment resolution, rallying campus support for the University to cut ties to military contractors.\n“The People’s Market for Gaza” took place from 4-5 p.m. at People’s Park in Isla Vista with roughly 50 attendees.\nFrom People’s Park, organizers lead a procession of roughly 100 people toward the front of Embarcadero Hall.\nProtestors chanted at the guests, “Students, students we won’t rest, until UCSB Divests,” before continuing to Loma Pelona Center for the Senate meeting.\nEvent organizers gave instructions to event participants to sign up for public comment for the Senate meeting that night where senators would vote on a divestment resolution."}, {"id": "6b3788a4-4c6b-49aa-9b00-795d85a5696e", "title": "Latest Articles", "date": "2024-06-04 17:00", "url": "https://freerepublic.com/tag/*/index?more=4242124", "message": "Daily Readings from the USCCB“Is it lawful to pay the census tax to Caesar or not?\nShould we pay or should we not pay?” Knowing their hypocrisy he said to them, “Why are you testing me?\nBring me a denarius to look at.” Mark 12:14–15These Pharisees and Herodians were sent to trap Jesus in His speech.\nThese men were very politically minded and loved to pick sides and find fault with others.\nSo they came to Jesus with what appeared to be an innocent question."}, {"id": "7da08dd3-9e70-4475-b429-8a7acc54ae0c", "title": "Chicago truck driver raises awareness for childhood friend held hostage in Gaza", "date": "2024-06-04 15:30", "url": "https://pantagraph.com/news/state-regional/government-politics/chicago-truck-driver-raises-awareness-for-childhood-friend-held-hostage-in-gaza/article_a4f2b546-1ee9-5d1d-beb9-5bfc99542e30.html", "message": "To Smith, he’s like a brother.\n“I wouldn’t want nobody else to drive the truck,” Smith said, clutching the Star of David around his neck.\nHersh’s family had no idea if he was alive until April 24, when Hamas released a three-minute video of him in captivity.\n“I had given up hope.”Hersh’s parents launched an international campaign, Bring Hersh Home, to raise awareness for the hostage crisis.\n“But I’m just here to spread awareness about all the hostages.”The truck was concocted by Jeff Aeder, a close friend of Hersh’s family."}, {"id": "cb549210-b7f8-460f-9e9f-ce1b1c0b9cbc", "title": "Chicago truck driver raises awareness for friend held hostage in Gaza", "date": "2024-06-04 10:45", "url": "https://www.chicagotribune.com/2024/06/04/chicago-truck-driver-raises-awareness-for-childhood-friend-held-hostage-in-gaza/", "message": "“I always know that.”Twelve hours a day, six days a week, Smith drives the truck through the Chicago area, raising awareness for the scores of Israeli hostages held captive by Hamas.\nTo Smith, he’s like a brother.\n“I wouldn’t want nobody else to drive the truck,” Smith said, clutching the Star of David around his neck.\nHersh’s family had no idea if he was alive until April 24, when Hamas released a three-minute video of him in captivity.\n“But I’m just here to spread awareness about all the hostages.”The truck was concocted by Jeff Aeder, a close friend of Hersh’s family."}]