[{"id": "e0fa9bdc-55f1-4943-9098-d86ed7c82509", "title": "French Director Michel Hazanavicius Voices Fears Over Rising Antisemitism :  How Could I Have Become So Evil In Such A Short Time ? ", "date": "2024-08-07 11:30", "url": "https://www.yahoo.com/news/french-director-michel-hazanavicius-voices-101429772.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "French Director Michel Hazanavicius Voices Fears Over Rising Antisemitism: “How Could I Have Become So Evil In Such A Short Time?”Oscar-winning director and screenwriter Michel Hazanavicius has voiced his fears over rising antisemitism in a heart-felt opinion piece in France’s Le Monde newspaper.\nIn his opinion piece, Hazanavicius said that until recently his Jewishness had been just one aspect of his identity, to which he did not give much thought, but this was now changing.\nTo react as a Jew, to think as a Jew, basically to be Jewish above all,” he wrote.\nThe opinion piece comes amid a sharp rise in the number of recorded antisemitic incidents in Europe and North America, in the wake of Hamas’s October 7 attack on Israel.\nWhy does every Jew who says or does something stupid have to take all his people with him?"}, {"id": "fc312cc3-7b7a-4ac7-8885-08b16c969000", "title": "Deadline", "date": "2024-08-07 13:30", "url": "https://deadline.com/print-article/1236033547/", "domain": "deadline.com", "domain_classification": "Unknown", "message": "Oscar-winning director and screenwriter Michel Hazanavicius has voiced his fears over rising antisemitism in a heart-felt opinion piece in France’s Le Monde newspaper.\nIn his opinion piece, Hazanavicius said that until recently his Jewishness had been just one aspect of his identity, to which he did not give much thought, but this was now changing.\nTo react as a Jew, to think as a Jew, basically to be Jewish above all,” he wrote.\nThe opinion piece comes amid a sharp rise in the number of recorded antisemitic incidents in Europe and North America, in the wake of Hamas’s October 7 attack on Israel.\nWhy does every Jew who says or does something stupid have to take all his people with him?"}, {"id": "ac996023-cd1f-46e9-9d40-110aba8221c6", "title": "Kamala Harri VP pick disappoints some who hoped for a new milestone : the first Jewish vice president", "date": "2024-08-07 00:45", "url": "https://fortune.com/2024/08/06/kamala-harris-vp-walz-shapiro-jewish/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Republicans, meanwhile, tried to paint Harris’ choice as a snub to Jewish voters, a traditionally Democratic constituency that former President Donald Trump has tried to court in this year’s race.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\nOnly 30% of Jewish voters supported Trump in 2020, while 69% supported Biden, according to AP VoteCast, a sweeping survey of the electorate.\nThat made Jewish voters one of the religious groups where support for Biden was strongest."}, {"id": "b2a308b1-87a6-4d78-b85c-adcd2ebaefea", "title": "Some Democratic backers of Josh Shapiro see a missed chance for a Jewish vice president", "date": "2024-08-07 00:45", "url": "https://www.local10.com/news/politics/2024/08/06/some-democratic-backers-of-josh-shapiro-see-a-missed-chance-for-a-jewish-vice-president/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Josh Shapiro speaks before Democratic presidential nominee Vice President Kamala Harris and her running mate Minnesota Gov.\nJosh Shapiro, who was one of Harris’ finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\n“That’s just called stewardship and accountability.”Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro."}, {"id": "ed0f3a36-56d6-45e0-ba52-e6c6bca4b70b", "title": "Some Democratic backers of Josh Shapiro see a missed chance for a Jewish vice president", "date": "2024-08-07 00:30", "url": "https://www.wsls.com/news/politics/2024/08/06/some-democratic-backers-of-josh-shapiro-see-a-missed-chance-for-a-jewish-vice-president/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Josh Shapiro speaks before Democratic presidential nominee Vice President Kamala Harris and her running mate Minnesota Gov.\nJosh Shapiro, who was one of Harris’ finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\n“That’s just called stewardship and accountability.”Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro."}, {"id": "49921f2d-88b3-4d55-b2ed-c6b77c830dc0", "title": "North Carolina Lawmaker Accused of Antisemitism for Repeated Attacks on  Zios , Israel", "date": "2024-08-07 21:45", "url": "https://www.algemeiner.com/2024/08/07/north-carolina-lawmaker-accused-antisemitism-repeated-attacks-zios-israel/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "A member of the Raleigh City Council in North Carolina who recently filed for re-election has come under fire for regularly attacking Israel and Zionists, despite her job having no apparent responsibilities concerning Middle Eastern affairs.\nDuring the time a ceasefire resolution was before the council, Black posted on Threads, a social media platform similar to X/Twitter: “I was gifted a kuffiyeh tonight for pushing a ceasefire vote.\nI am a Raleigh City Council member.”Black later took to Threads to complain about someone taking issue with her speaking at the event.\nUsing the name @mary.poppinn, Black is active on Threads, where she regularly derides Israel and its supporters.\nHow can it be that our City Council representative, the one who is supposed to ‘represent’ us, is one of the greatest threats to my community’s safety?"}, {"id": "2318d940-a0cc-41fb-960f-cd8ff1e14220", "title": "He fights antisemitism and is close to the Jewish community : All about Kamala Harris", "date": "2024-08-07 07:45", "url": "https://www.ynetnews.com/article/rkedk9e5a", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "3 View gallery Tim Walz participates in event at Chabad in MinnesotaAll in all, Walz has very positive attitudes toward Israel.\nHe has spoken about the need to ensure the security of the State of Israel.\n3 View gallery Vice President Kamala Harris named Minnesota Gov.\nRegarding the campus demonstrations directed against Jewish students, Walz said: \"When Jewish students tell us that they feel unsafe, we have to believe them.\nSenior officials in the Jewish community in Minnesota describe Harris' new deputy as \"a good person.\""}, {"id": "234fae59-27cc-47d6-ab52-61c5220b0767", "title": "Minnesota Jewish leaders highlight VP pick Tim Walz platform", "date": "2024-08-07 00:00", "url": "https://www.jpost.com/diaspora/article-813633", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "With Shapiro, as the second Jewish Vice Presidential nominee in history, came antisemitic attacks over his support of Israel.\nWalz,\" Roberts said.\nShapiro,\" Roberts said.\nWalz has an understanding of rural and urban America, two important things Kieffer Leonard said have been missing from the Democratic Party.\n\"Certainly expressing some of the most important principles with respect to the Jewish community, and Israel and antisemitism.\""}, {"id": "1df378e5-8f72-4154-b0c1-217381fa1caa", "title": "Jewish group accuse police of letting Islamist extremism go unchallenged", "date": "2024-08-07 14:15", "url": "https://www.express.co.uk/news/politics/1933264/police-row-explodes-jewish-group", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "West Midlands Police address Birmingham disorderThe Campaign Against Antisemitism has accused the country’s police of emboldening the far-right after months of ignoring extremist Islamist protests.\nThe Campaign Against Antisemitism has now responded, telling the Express that the police bear responsibility for the violence after months of letting extremist pro-Gaza activists “go unchallenged”.\nA spokesman for the Jewish group blasted: “The violence that we are seeing now on the streets of Britain is appalling, and we welcome the urgent and robust response from the authorities.\nNotwithstanding our repeated calls to crack down on extremists on our streets over the past year, they were allowed to go unchallenged.\nRead our Privacy PolicySpeaking last night, a top officer from West Midlands Police reacted to the distressing scenes of weapon-wielding Asian men attacking and intimidating journalists, describing the riot as mostly law-abiding."}, {"id": "16448924-ef3d-45da-9c45-5fb304bee6ec", "title": "Harvard Campus Disruptions | Harvard Magazine", "date": "2024-08-07 00:00", "url": "https://www.harvardmagazine.com/2024/07/harvard-continuing-challenges", "domain": "harvardmagazine.com", "domain_classification": "Unknown", "message": "That would require training faculty members on new teaching methods and educating the community about religious literacy.\nThe details of implementation will be telling, and its effect assumes the public distinguishes between a Harvard voice and those of individual community members.\nBeyond the headline issues, faculty members feel unconsulted on matters ranging from Harvard’s investment in Allston and decisions about budgets to worries about political and donor pressures on campus discourse.\nUnfortunately, such concerns radiate beyond student and faculty views of the campus culture and parameters for speech and protest.\n’98 (for the 350th, in 1986), still resonate:…Here, imagineA spirit moves, John Harvard walks the yard,The books stand open and the gates unbarred."}, {"id": "ad49e833-2271-402f-8d30-8b5719f3425d", "title": "European Maccabi Youth Games are an absolute winner", "date": "2024-08-07 17:45", "url": "https://www.thejc.com/community/european-maccabi-youth-games-are-an-absolute-winner-u2ig633g", "domain": "thejc.com", "domain_classification": "Unknown", "message": "Hockey players at the European Maccabi Youth Games (Photo: Jamie Gordon)“I’ve had an amazing time,” said Alex Levin, 17, of the winning futsal team, who lives in Finchley.\nBasketball at the European Maccabi Youth Games (Photo: Jamie Gordon)While Team GB walked away with the most medals, the week was about much more than just sport, he said.\nWhile the event was held in the diaspora – and was the first European Maccabi Youth Games to be hosted by Maccabi GB – Israel was never far from the delegates’ thoughts.\nTriumphant delegates at the European Maccabi Youth Games (Photo: Jamie Gordon)He added that it was equally meaningful for the participants from the diaspora.\n“The Maccabi Youth Games play a role in strengthening this resilience, as well as in emphasising the mind-body-spirit connection that is integral to the development of the young athlete and the young Jew.”"}, {"id": "a7be01f4-0534-49f5-b432-dee343f22638", "title": "Josh Shapiro and the unmaking of a vice president", "date": "2024-08-07 11:45", "url": "https://www.jwire.com.au/josh-shapiro-and-the-unmaking-of-a-vice-president/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home Featured Articles / Josh Shapiro and the unmaking of a vice president – J-WireJosh Shapiro and the unmaking of a vice presidentRead on for articleThere was probably more than one reason why Vice President Kamala Harris chose Minnesota Gov.\nIt may well be that Shapiro rubbed Harris the wrong way in their interviews when she was auditioning potential candidates.\nIf winning the election and “saving democracy” from alleged threats by former President Donald Trump and the Republicans were primary goals, then Shapiro was her best bet.\nJosh Shapiro speaks during an event with U.S. Vice President and 2024 Democratic presidential candidate Kamala Harris and her running mate, Minnesota Gov.\nWhen then Vice President Al Gore choose Connecticut Sen. Joe Lieberman to be his running mate, the decision was hailed as a brilliant political move by the Democratic Party’s nominee."}, {"id": "92f8ae5d-f270-4c02-a68e-dc24425adc23", "title": "Harri pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions – Boston Herald", "date": "2024-08-07 17:30", "url": "https://www.bostonherald.com/2024/08/07/harris-pick-of-walz-amps-up-excitement-in-midwestern-states-where-democrats-look-to-heal-divisions/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "By JOEY CAPPELLETTI, Associated PressEAU CLAIRE, Wis. (AP) — Vice President Kamala Harris declared herself and her new running mate, Minnesota Gov.\nWalz’s addition to the ticket has soothed some tensions, signaling to some leaders that Harris had heard concerns about another leading contender for the vice presidential slot, Gov.\nTim Walz and Democratic presidential nominee Vice President Kamala Harris speak at a campaign rally in Philadelphia, Tuesday, Aug. 6, 2024.\n(AP Photo/Matt Rourke)Democratic presidential nominee Vice President Kamala Harris and her running mate Minnesota Gov.\nThe vice president eventually climbed into her motorcade, and it pulled away before they could interact."}, {"id": "8f754b18-eff5-4dc8-97bb-5e192d4dadb0", "title": "Harri pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions – Twin Cities", "date": "2024-08-07 17:45", "url": "https://www.twincities.com/2024/08/07/harris-pick-of-walz-amps-up-excitement-in-midwestern-states-where-democrats-look-to-heal-divisions/", "domain": "twincities.com", "domain_classification": "Unknown", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone."}, {"id": "e89e7b2d-3ff0-48f2-a45a-a37010eb780b", "title": "Harri pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions – Reading Eagle", "date": "2024-08-07 17:45", "url": "https://www.readingeagle.com/2024/08/07/harris-pick-of-walz-amps-up-excitement-in-midwestern-states-where-democrats-look-to-heal-divisions/", "domain": "readingeagle.com", "domain_classification": "Unknown", "message": "For information on submitting an obituary, please contact Reading Eagle by phone at 610-371-5018, or email at obituaries@readingeagle.com or fax at 610-371-5193.\nMost obituaries published in the Reading Eagle are submitted through funeral homes and cremation services, but we will accept submissions from families.\nIn addition to the text of the obituary, any photographs that you wish to include can be attached to this email.\nPlease put the text of the obituary in a Word document, a Google document or in the body of the email.\nWe also request that your full name, phone number and address are all included in this email."}, {"id": "184e5adf-94fd-476f-8772-39ce974f3f1a", "title": "  We are the underdog : Harris introduces running mate Walz as a coach , veteran and protector of reproductive rights", "date": "2024-08-07 03:45", "url": "https://www.yahoo.com/news/underdogs-harris-introduces-running-mate-025541993.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "'We are the underdogs': Harris introduces running mate Walz as a coach, veteran and protector of reproductive rightsPHILADELPHIA — Vice President Kamala Harris introduced her running mate to the nation at a raucous rally in Pennsylvania’s biggest city Tuesday, playing up Minnesota Gov.\nThousands of supporters roared as Harris and Walz alternated between playing up his bio and taking shots at former President Donald Trump and his running mate, Sen. JD Vance, R-Ohio.\nVice President Kamala Harris and Minnesota Governor Tim Walz (Pete Kiehart for NBC News)“I set out to find a partner who can help build this brighter future,” Harris said.\nShe shouted out that Walz “was known as one of Capitol Hill’s best marksmen, winning a bipartisan sharpshooting contest year after year.”“I’m telling you, Tim Walz will be ready on Day One,” she said.\nBut Tim Walz, he’s good.”Earlier in the day, Vance campaigned in Philadelphia."}, {"id": "09131bef-17e4-4a7b-9517-971fb18dbf78", "title": "Harri pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions – Loveland Reporter - Herald", "date": "2024-08-07 17:30", "url": "https://www.reporterherald.com/2024/08/07/harris-pick-of-walz-amps-up-excitement-in-midwestern-states-where-democrats-look-to-heal-divisions/", "domain": "reporterherald.com", "domain_classification": "Unknown", "message": "Harris’ pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions"}, {"id": "d761c9e5-e22b-4951-b40a-7ffa5fc14420", "title": "Kamala Harris : We are the underdogs , but we have momentum", "date": "2024-08-07 01:15", "url": "https://www.yahoo.com/news/kamala-harris-underdogs-momentum-004117858.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kamala Harris: We are the underdogs, but we have momentumKamala Harris and Tim Walz made their debut at a rally in Philadelphia - Getty ImagesKamala Harris described herself and Tim Walz as “the underdogs” in the race to defeat Donald Trump as she introduced her running mate to supporters in Philadelphia on Tuesday night.\nHarris and Walz embrace - ReutersThe pair clasped hands as Ms Harris grinned and, with her other hand, pointed at Mr Walz to the cheering audience.\nKamala Harris and Tim Walz - Reuters11:03 PM BSTCheers as Harris and Walz walk on stageBeyonce’s song “Freedom” played before an announcer introduced Kamala Harris and Tim Walz as “the next president and vice president of the United States”.\n“Let me tell you about my friend, Kamala Harris, someone I’ve been friends with for two decades.\nTim Walz and Kamala Harris are true public servants who have spent their lives working tirelessly on behalf of the American people."}, {"id": "aa7dcfb4-56fe-4be0-94f4-84b573334aae", "title": "Kamala Harris : We are the underdogs , but we have momentum", "date": "2024-08-07 02:00", "url": "https://www.aol.co.uk/news/kamala-harris-underdogs-momentum-004117795.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Harris and Walz embrace - ReutersThe pair clasped hands as Ms Harris grinned and, with her other hand, pointed at Mr Walz to the cheering audience.\nKamala Harris and Tim Walz - Reuters11:03 PM BSTCheers as Harris and Walz walk on stageBeyonce’s song “Freedom” played before an announcer introduced Kamala Harris and Tim Walz as “the next president and vice president of the United States”.\n“Let me tell you about my friend, Kamala Harris, someone I’ve been friends with for two decades.\nCommenting on the choice of Mr Walz he added: “My view on this is it just highlights how radical Kamala Harris is.\nTim Walz and Kamala Harris are true public servants who have spent their lives working tirelessly on behalf of the American people."}]