[{"id": "2bd875b8-e35c-4871-94ad-f9fe1deca7e9", "title": "Israel says killed key Hezbollah operative in drone strike", "date": "2024-06-18 12:00", "url": "https://www.naharnet.com:443/stories/en/305968-israel-says-killed-key-hezbollah-operative-in-drone-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A member of Hezbollah has been killed by an Israeli drone strike on a car in southern Lebanon, the country's state-run National News Agency reported.\nHezbollah issued a statement on Monday identifying the member killed in the drone strike near the village of Shehabiyeh as Mohammad Ayoub.\nIt said Ayoub was involved in recent months in promoting and planning attacks from southern Lebanon against Israel.\nIsrael said it killed Ayoub as part of its activities “to impede Hezbollah’s military build-up in terms of weaponry and its stockpiling of weapons” that would be used against Israel.\nSince Oct. 8., more than 400 people have been killed in Lebanon — most of them Hezbollah fighters but also more than 70 civilians and non-combatants."}, {"id": "5a163914-e2c0-4b13-82b5-26bb37ba147a", "title": "Ukraine unveils its deadly new drone boat set", "date": "2024-06-18 01:30", "url": "https://www.dailymail.co.uk/news/article-13540513/Ukraine-unveils-deadly-new-drone-boat-set-strike-fear-hearts-Russias-Black-Sea-Fleet-kamikaze-Stalker-372-mile-range-race-speeds-46mph-sea.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine has unveiled a deadly new set of drone boats which it plans to use to devastating effect against Russia’s Black Sea Fleet.\nThe kamikaze Stalker 5.0 vehicle has a 372-mile operational range and can race at speeds of 46mph over the sea thanks to its 60-horsepower speedboat engine.\nUkrainian officials first made details of the unmanned vessel, which can carry explosive payloads of up to 150kg, public at the Black Sea Security Forum.\nIn March, one of Putin's most modern warships, The $65mn Sergey Kotov, which only came into service in 2022, was reportedly struck by an exploding kamikaze sea drone attack near Feodosia, in occupied Crimea.\nHowever, The SBU's stand out attack remains its experimental kamikaze drone hit on Vladimir Putin's £3 billion bridge linking Russia to Crimea, which triggered a huge explosion."}, {"id": "f7130ab0-2c37-422b-a8ee-e920e0a14d2d", "title": "Somali Army Forces Kill 28 al - Shabab Militants in Airstrike", "date": "2024-06-18 10:00", "url": "https://warsheekh.com/somali-army-forces-kill-28-al-shabab-militants-in-airstrike/", "domain": "warsheekh.com", "domain_classification": "Unknown", "message": "International partners backed Somali army forces, killing 28 al-Shabab militants in an airstrike in a rural area on the border between the Galgadud and Middle Shabelle regions on Tuesday night.\nAdvertisements highlighted a senior military commander, Abdinur Yusuf Qadaye, stating that the targeted militants were planning attacks on army positions and local communities.\nThe government forces and their international partners, however, prevented the attack.\nOperations against the al-Shabab group remain ongoing in the Galgadud and Middle Shabelle regions, with increased efforts from both ground and air forces by the army, local people, and international allies.\nAccording to a military official who declined to be named, at least 11 other soldiers were wounded in the explosion."}, {"id": "8a5da16e-09e8-4f8c-8226-9155b0b1e61c", "title": "Netanyahu disbands war cabinet as pressure grows on Israel northern border", "date": "2024-06-18 05:30", "url": "https://www.euractiv.com/section/global-europe/news/netanyahu-disbands-war-cabinet-as-pressure-grows-on-israels-northern-border/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Netanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nThe Israeli military said on Monday it had killed a senior operative in one of Hezbollah’s rocket and missile sections in the area of Selaa in southern Lebanon.\nNetanyahu had faced demands from the nationalist-religious partners in his coalition, Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, to be included in the war cabinet.\nThe forum was formed after Gantz joined Netanyahu in a national unity government at the start of the Gaza war in October.\nGantz and Eisenkot both left the government last week, over what they said was Netanyahu’s failure to form a strategy for the Gaza war."}, {"id": "58132e0e-0892-4f26-9d88-cf901a71874a", "title": "PLA Navy submarine force makes historic breakthroughs", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/china/2024/06/china-240617-globaltimes01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "PLA Navy's submarine force makes historic breakthroughsGlobal TimesBy Liu Xuanzun Published: Jun 17, 2024 09:29 PMThe submarine force of the Chinese People's Liberation Army (PLA) Navy has made historic breakthroughs in torpedo and missile capabilities.\nWen Xuexing, a captain at a submarine detachment of the PLA Navy, made the remarks in a report by China Central Television (CCTV) in celebration of the 70th founding anniversary of the PLA Navy's submarine force.\nWen's unit is the PLA Navy's first-ever submarine unit, which is also a \"seed unit\" of submarines responsible for testing and training, according to the CCTV.\nThe PLA Navy's submarines enable the Chinese people to develop economy in peace and have no fear of any invasion, Wen said.\nAccording to media reports, the PLA Navy now operates Type 039 series conventional submarines, Type 09III nuclear-powered attack submarines and Type 09IV nuclear-powered ballistic missile submarines, with more advanced models under development."}, {"id": "739de113-e2aa-421c-b338-799174abd563", "title": "U . S . Navy Rescues Crew from Vessel Struck by Houthis", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240617-usn03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "U.S. Navy Rescues Crew from Vessel Struck by HouthisUS Navy17 June 2024From Carrier Strike Group TWO Public AffairsRED SEA -- Sailors assigned to the Dwight D. Eisenhower Carrier Strike Group (IKECSG) airlifted the crew of a merchant vessel attacked by Iranian-backed Houthis in the Red Sea, June 15.\nThe Liberian-flagged, Greek-owned bulk cargo carrier M/V Tutor was struck by an Iranian-back Houthi uncrewed surface vessel (USV) while sailing in the international waters of the Southern Red Sea, June 12.\nFrom there, helicopters from Helicopter Sea Combat Squadron (HSC) 7 transported the group to USS Dwight D. Eisenhower (CVN 69).\n\"It's humbling to watch the Strike Group provide assistance and rescue the crew of M/V Tutor,\" said Rear Adm. Marc Miguez, commander, IKECSG, Carrier Strike Group 2.\n\"Despite these senseless attacks on innocent mariners just doing their job, the Philippine Sea crew stand ready to help preserve safety of life at sea, always,\" said Capt."}, {"id": "493829e9-1cb3-4132-b889-5924f6a0378c", "title": "Rebels arrested in connection to attempted attack on Myanmar chief", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/myanmar/2024/myanmar-240617-rfa02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Rebels arrested in connection to attempted attack on Myanmar chiefMembers were allegedly arrested while in possession of explosives, junta media said.\nBy RFA Burmese 2024.06.17 -- Junta forces arrested 13 members of an urban guerrilla group on suspicion of planning an attack on the leader of Myanmar's military regime, Senior Gen. Min Aung Hlaing, state-run media reported.\nA state-controlled newspaper reported the plot on Monday, confirming that in all 13 people had been arrested in connection with the plot to attack the army chief, who led a 2021 coup, at a Yangon bridge opening in early June.\nMembers of anti-junta forces, speaking to Radio Free Asia on Monday, confirmed the arrests but a member of the Yangon UG People's Army group denied that the people arrested had been attempting to attack political officials.\nThe member of the Yangon UG People's Army, who declined to be identified for security reasons, said the military fabricated the attack plot to justify its arrests."}, {"id": "b54d6c19-4686-4f5f-9077-0163c32e2427", "title": "Netanyahu disbands war cabinet as pressure grows on Israel northern border", "date": "2024-06-18 04:15", "url": "https://www.swissinfo.ch/eng/netanyahu-disbands-war-cabinet-as-pressure-grows-on-israel", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Netanyahu disbands war cabinet as pressure grows on Israel’s northern border5 minutesBy James MackenzieJERUSALEM (Reuters) -Israeli Prime Minister Benjamin Netanyahu has dissolved the six-member war cabinet, an Israeli official said on Monday, in a widely expected move following the departure from government of centrist former general Benny Gantz.\nNetanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nThe forum was formed after Gantz joined Netanyahu in a national unity government at the start of the Gaza war in October.\nGantz and Eisenkot both left the government last week, over what they said was Netanyahu’s failure to form a strategy for the Gaza war.\nIsrael’s offensive has killed more than 37,000 Palestinians, according to Palestinian health ministry figures, and destroyed much of Gaza."}, {"id": "e250f76d-798c-4848-93ba-1c4dab838cc7", "title": "Hezbollah keeps up pressure on Israel days after commander death", "date": "2024-06-18 11:00", "url": "https://naharnet.com/stories/en/305954-hezbollah-keeps-up-pressure-on-israel-days-after-commander-s-death", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah kept up retaliatory attacks on Israel Saturday, days after a strike killed one of its top commanders, while a Palestinian group said one of its fighters was killed in south Lebanon.\nIsrael and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group's October 7 attack on Israel which triggered war in the Gaza Strip.\nIt also said \"several aerial targets were identified crossing from Lebanon into Israeli territory\" and striking in the Goren area.\n\"Aircraft struck a Hezbollah terrorist\" in south Lebanon's Aitaroun area, the Israeli military said, adding that \"artillery fired to remove a threat,\" also in the Aitaroun area.\nThe armed wing of Palestinian militant movement Islamic Jihad later said one of its fighters had been killed in south Lebanon."}, {"id": "0837db20-e829-4645-84b5-7985cecb7e71", "title": "Israel - Hamas : Benjamin Netanyahu disbands war cabinet after Benny Gantz quits government", "date": "2024-06-18 02:45", "url": "https://www.watoday.com.au/world/middle-east/benjamin-netanyahu-disbands-war-cabinet-after-key-partner-bolts-from-government-20240618-p5jmkt.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Jerusalem: Israeli Prime Minister Benjamin Netanyahu has dissolved the six-member war cabinet, an Israeli official said, following the departure from government of centrist former general Benny Gantz.\nNetanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nIsraeli Prime Minister Benjamin Netanyahu speaks during a news conference in Tel Aviv, Israel.\nCredit: APThe move was announced as US special envoy Amos Hochstein visited Jerusalem, seeking to calm the situation on the disputed border with Lebanon, where Israel said tensions with the Iran-backed Hezbollah militia were bringing the region close to a wider conflict.\nThe Israeli military said it had killed a senior operative in one of Hezbollah’s rocket and missile sections in the area of Selaa in southern Lebanon this week."}, {"id": "be08ecca-c280-4b8d-a8c0-ccece4c9ce28", "title": "South Lebanon village shaken by deadly Israeli strike", "date": "2024-06-18 11:00", "url": "https://naharnet.com/stories/en/305949-south-lebanon-village-shaken-by-deadly-israeli-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Plumes of smoke were still billowing Friday over a south Lebanon village after a deadly Israeli strike as shopkeepers swept shattered glass and vowed to stay put despite soaring cross-border violence.\nLebanon's official National News Agency said a building was hit in Jannata, 20 kilometers from the Israeli border.\nRescuers said at least nine people were wounded in the strike on Jannata, including an infant and two children.\n- 'We will not be displaced' -The strike, which the Israeli military has not commented on, comes on the heels of a major Hezbollah attack.\nHezbollah launched barrages of rockets and drones on Wednesday and Thursday targeting Israeli military sites across the border, after an Israeli strike earlier this week killed a senior commander."}, {"id": "9e49c14a-6047-4aae-815f-ee17523a242e", "title": "U . S . Navy Rescues Crew of Greek Ship that Houthis Attacked", "date": "2024-06-18 05:00", "url": "https://www.breitbart.com/national-security/2024/06/17/u-s-navy-rescues-crew-of-greek-ship-that-houthis-attacked/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Most of the Tutor’s two dozen crew members are Filipino.\n“Despite these senseless attacks on innocent mariners just doing their job, the Philippine Sea crew stand ready to help preserve safety of life at sea, always,” said Capt.\n(Yes, the commanding officer of the Philippine Sea is named “Captain Liberty.”)One member of the Tutor’s crew is reportedly missing.\nThe Philippine Department of Migrant Workers (DMW) said Philippine Embassy officials met the rescued crew members in the Bahrain port city of Manama.\nThe DMW said the repatriated crew members are traveling in the company of Labor Attache Hector Cruz and are expected home in the Philippines by Monday afternoon."}, {"id": "7447d3d1-d57e-493c-a417-2f5443d5d247", "title": "U . S . Navy Rescues Crew of Greek Ship that Houthis Attacked", "date": "2024-06-18 02:00", "url": "https://www.breitbart.com/middle-east/2024/06/17/u-s-navy-rescues-crew-of-greek-ship-that-houthis-attacked/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Most of the Tutor’s two dozen crew members are Filipino.\n“Despite these senseless attacks on innocent mariners just doing their job, the Philippine Sea crew stand ready to help preserve safety of life at sea, always,” said Capt.\n(Yes, the commanding officer of the Philippine Sea is named “Captain Liberty.”)One member of the Tutor’s crew is reportedly missing.\nThe Philippine Department of Migrant Workers (DMW) said Philippine Embassy officials met the rescued crew members in the Bahrain port city of Manama.\nThe DMW said the repatriated crew members are traveling in the company of Labor Attache Hector Cruz and are expected home in the Philippines by Monday afternoon."}, {"id": "ad4735a0-c8a2-4149-8784-7590c85f75a7", "title": "Ukraine robot boats are rewriting the rules of naval warfare", "date": "2024-06-18 06:15", "url": "https://www.defenseone.com/ideas/2024/06/ukraines-usvs-write-new-rules-asymmetric-naval-warfare/397430/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "Ukraine’s use of aerial drones and robot boats are hampering Russian naval operations in the Black Sea and rewriting the playbook for war planners concerned with maritime chokepoints.\nUkraine helped usher in a new phase of asymmetrical warfare at sea with an October 2022 attack on Russia’s primary naval base in Sevastopol.\nIn the future, Ukrainian USVs might shoot back – in May, Ukraine showed off a new USV outfitted with two R-73 air-to-air missiles.\nStrategists around the world have taken note of the changing dynamics at play in the Black Sea and the implications for flashpoints elsewhere.\nThe battle in the Black Sea is far from won, but serves as a defining moment for the evolution of Ukraine’s maritime force."}, {"id": "d3e2d38b-060d-4799-8857-0092364333b9", "title": "2024 NBA Draft FAQ : Top prospects , trade chips , Bronny James", "date": "2024-06-18 05:15", "url": "https://www.yardbarker.com/nba/articles/2024_nba_draft_faq_top_prospects_trade_chips_bronny_james/s1_13132_40497753", "domain": "yardbarker.com", "domain_classification": "Unknown", "message": "With the 2023-24 NBA season officially behind us, attention turns to the NBA Draft, which will be held on June 26 and 27.\nIn preparation for the two-day event, here are the answers to some of the biggest questions regarding the 2024 NBA Draft.\nThe second round of the 2024 NBA Draft, live from ESPN's Seaport District Studios in lower Manhattan, begins on June 27 at 4 p.m.\n1 overall pick after winning the NBA Draft Lottery for the first time in franchise history.\nThe full 2024 NBA Draft order, courtesy of Tankathon, can be found here."}, {"id": "e084eedb-d56e-4e5a-bf62-91f63d566f7f", "title": "News from the Star you should know about on Tuesday , June 18", "date": "2024-06-18 12:00", "url": "https://www.thestar.com/news/morning-digest/a-north-york-shooting-leaves-three-dead-pilot-project-helps-kids-beat-the-heat/article_1965b8a4-2d5b-11ef-a44f-17c8bf8d01e3.html", "domain": "thestar.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "3ecfc55b-e59b-419f-a7e4-1b3ee142a87c", "title": "Newly Elected Mayor Assassinated In Southern Mexico", "date": "2024-06-18 03:00", "url": "https://dailycaller.com/2024/06/17/salvador-villalva-flores-mayor-assassinated-southern-mexico/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "A newly elected mayor was assassinated Monday in Southern Mexico, The Associated Press (AP) reported.\nSalvador Villalva Flores, the recently elected mayor of a small coastal town in Guerrero, Mexico, was assassinated, according to AP.\nThis assassination is part of a disturbing trend of violence targeting political figures in Mexico.\nData Civica, a human rights organization, noted that around 34 political candidates were murdered in the months leading up to and following the June elections, AP reported.\nElected in 2021, Sanchez was ambushed and shot 19 times by gunmen from a white truck outside a gym before they fled the scene, CBS News reported."}, {"id": "c7f26b63-2653-47f7-985e-41dabb558b09", "title": "U . S . designates Iran - aligned Ansar Allah al - Awfiya as terrorist organization", "date": "2024-06-18 07:45", "url": "https://www.upi.com/Top_News/US/2024/06/18/designates-Ansar-Allah-al-Awfiya/7961718690969/", "domain": "upi.com", "domain_classification": "Unknown", "message": "The State Department under U.S. Secretary of State Antony Blinken on Monday designated the Iran-aligned Harakat Ansar Allah al-Awfiya as a terrorist organization.\nFile Photo by NATO Press/UPI | License PhotoJune 18 (UPI) -- The United States has designated Iraq-based Harakat Ansar Allah al-Awfiya as a terrorist organization as the Biden administration cracks down Iran proxy militias amid Israel's war in Gaza.\nThe U.S. State Department sanctioned the Iran-backed group as a Specially Designated Global Terrorist organization along with its 46-year-old secretary general, Muzhir Ma'lak al-Sa'idi.\nHarakat Ansar Allah al-Awfiya is part of the Islamic Resistance in Iraq, which has claimed responsibility for several recent attacks from Iraq and Syria targeting U.S. military, including a January drone strike that killed three U.S. service members in Jordan.\nThe U.S. State Department said Harakat Ansar Allah al-Awfiya was involved in the strike."}, {"id": "681e287e-23b3-4b43-a37c-cf309d5dfb38", "title": "  It Is Unsafe !: Chaos Erupts At New York City Council Meeting As Residents Flip Over Migrant Shelter Crime", "date": "2024-06-18 13:30", "url": "https://dailycaller.com/2024/06/18/new-york-city-council-meeting-crime-migrant-shelters/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Chaos erupted between New York City (NYC) residents and City Council member Crystal Hudson during a community meeting while discussing issues with a migrant shelter nearby, video shows.\nThe clip opens up with Hudson addressing an issue before briefly touching on a stabbing incident that occurred outside of a Clinton Hill migrant shelter.\n“Is there a universe where the city can safely have 3,200 single men together, can safely have —” he continued before Hudson could be heard cutting him off.\nWhile other residents could be heard shouting “It can’t,” the man stood up on his chair yelling, “It is unsafe!\nAuthorities later arrested 25-year-old Cristian Concepcion, who lived at the shelter, and confirmed the dispute was over a moped, the outlet reported."}, {"id": "96854c51-cfdd-47ff-84d2-6e2ff274146b", "title": "Netanyahu Dissolves Israeli War Cabinet", "date": "2024-06-18 11:45", "url": "https://www.theepochtimes.com/world/netanyahu-dissolves-israeli-war-cabinet-5670221", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel—Israeli Prime Minister Benjamin Netanyahu dissolved the war Cabinet that has overseen the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body quitted the government over frustration with the Israeli leader’s handling of the war.\nGovernment officials said Mr. Netanyahu would hold smaller forums for sensitive war issues, including with his security Cabinet, which includes right-wing governing partners who oppose cease-fire deals.\nThe war Cabinet was formed in the early days of the war, when Mr. Gantz, then an opposition party leader and Netanyahu rival, joined the coalition in a show of unity following the Oct. 7 attack on southern Israel by Hamas terrorists.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status."}, {"id": "dde1b45b-f0b3-404b-a2aa-b5ead88023e4", "title": "U . S . wants to avoid  greater war  along Lebanon - Israel border , envoy says", "date": "2024-06-18 11:00", "url": "https://www.yahoo.com/news/u-wants-avoid-greater-war-103724546.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah has been trading fire with Israel for the last eight months in parallel with the Gaza war.\nHochstein, special envoy to U.S. President Joe Biden, said he had been dispatched to Lebanon immediately following a brief trip to Israel because the situation was \"serious\".\nAnd what President Biden wants to do is avoid a further escalation to a greater war,\" Hochstein said on Tuesday.\nThe U.S. and France are engaged in diplomatic efforts to secure a negotiated end to the hostilities along Lebanon's border.\nHezbollah began trading fire with Israel on Oct. 8, a day after its Palestinian ally Hamas attacked southern Israel, sparking the Gaza war."}, {"id": "60e7b48c-0cc7-47dc-ba4b-b33461f49dd2", "title": "US Navy Rescues Crew of Cargo Ship Hit by Houthis in Red Sea", "date": "2024-06-18 11:00", "url": "https://sofmag.com/navy-rescues-crew-red-sea/", "domain": "sofmag.com", "domain_classification": "Unknown", "message": "US Navy Rescues Crew of Cargo Ship Hit by Houthis in Red SeaShare this articleThere has been an unprecedented increase in distress calls in the Red Sea since November.\nRED SEA – American sailors airlifted to safety the crew of a merchant vessel that was attacked by Iranian-backed Houthi rebels in the Red Sea.\nMembers of the Dwight D Eisenhower carrier strike group assisted the mariners from the MV Tutor, a Liberian-flagged, Greek-owned bulk cargo carrier.\nThe IKE Carrier Strike Group lived that ethos June 15, helping the crew of MV Tutor after they were attacked by Iranian-backed Houthis in the Red Sea.\n“It’s humbling to watch the Strike Group provide assistance and rescue the crew of M/V Tutor,” said Rear Adm. Marc Miguez, commander, IKECSG, Carrier Strike Group 2."}, {"id": "f7b567f0-0adc-41be-902c-d166105be0c0", "title": "U . S . tests Minuteman III nuclear ICBMs amid heightened geopolitical tensions – NaturalNews . com", "date": "2024-06-18 08:15", "url": "https://www.naturalnews.com/2024-06-17-us-tests-minuteman-iii-nuclear-icbms.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "U.S. tests Minuteman III nuclear ICBMs amid heightened geopolitical tensionsIn a series of routine exercises, the United States military conducted two tests of intercontinental ballistic missiles (ICBMs).\nHowever, concerns linger within Washington regarding the aging Minuteman III system, which first became operational in the 1970s.\nAdmiral Charles Richard, head of U.S. Strategic Command (USSTRATCOM), has previously voiced worries about the technical limitations of the Minuteman III, citing outdated documentation and maintenance difficulties.\nIn response to these challenges, the Pentagon recently awarded a $405 million contract to Boeing for the maintenance and service of the Minuteman III missiles.\nMore related stories:Ben Armstrong: Russia’s new NUCLEAR MISSILE test a WARNING to America."}, {"id": "9bef8940-c185-4a98-bcad-cfb053bdb04e", "title": "Authorities across U . S . grapple with rash of violence in final days of spring", "date": "2024-06-18 00:30", "url": "https://www.columbian.com/news/2024/jun/17/authorities-across-u-s-grapple-with-rash-of-violence-in-final-days-of-spring/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people including an 8-year-old who was shot in the head.\nIn Texas, fatal gunfire broke out at a Juneteenth celebration, with two people pronounced dead.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nChris Dennison, a sociology professor at the University of Buffalo who researches crime, said the arrival of seasonable weather presents more opportunities for crime and violence, amid heightened concerns about mental health issues and destructive outcomes."}, {"id": "e3943d26-0944-46c6-96f6-f40a2ec05f34", "title": "  Youve stabbed me , I love you  – Mother walks free after stabbing boyfriend after night out", "date": "2024-06-18 05:30", "url": "https://www.expressandstar.com/news/crime/2024/06/18/youve-stabbed-me-i-love-you-mother-walks-free-after-stabbing-boyfriend-after-night-out/", "domain": "expressandstar.com", "domain_classification": "Unknown", "message": "Chelsea Leigh Smith, 26, attacked her then partner in his Walsall flat on Saturday, March 23, this year after a night out.\nRing doorbell footage captured the lead up and aftermath of the attack, with Smith screaming at her boyfriend and then him screaming before shouting: \" You've f****** stabbed me, I love you.\"\nHer partner then staggered downstairs covering the walls of Oak Court, on the Yew Tree estate, in blood as he went and was found by police officers.\nHe told officers Smith had stabbed him and was still in the flat, he was then taken to hospital for his wounds.\nThe stabbing happened at Oak Court, Yew Tree estate, WalsallOfficers then arrested Smith, who denied any involvement in her partner's injuries."}, {"id": "1aa19364-92bd-4fe7-a02a-38223ae32a75", "title": "IDF general tells troops to continue Rafah operation until Hamas is defeated", "date": "2024-06-18 00:30", "url": "https://signalscv.com/2024/06/idf-general-tells-troops-to-continue-rafah-operation-until-hamas-is-defeated/", "domain": "signalscv.com", "domain_classification": "Unknown", "message": "By Aldgra FredlyContributing WriterThe Israel Defense Forces vowed to continue military operations in Rafah until the Hamas terrorist group is defeated.\nThis followed an explosion in southern Gaza that killed eight Israeli soldiers.\nIDF Southern Command chief Maj. Gen. Yaron Finkelman said at a Saturday meeting with commanders in Rafah that they must continue their fight against Hamas as the explosion is being investigated.\nThe crossing has had a bottleneck since Israeli ground troops moved into Rafah in early May.\nHamas terrorists killed approximately 1,200 people and abducted more than 250 hostages during their attack on Israel on Oct. 7, 2023."}, {"id": "4a53f756-d057-4736-bc5e-61063a410c44", "title": "Army names the M - SHORAD after Vietnam War Medal of Honor recipient", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-arnews01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Army names the M-SHORAD after Vietnam War Medal of Honor recipientBy U.S. Army Public Affairs June 15, 2024WASHINGTON -- The U.S. Army has named its newest integrated air defense system after Sgt.\nMitchell W. Stout, the only Air Defense Artillery Soldier to receive the Medal of Honor.\nFormerly known as Maneuver-Short Range Air Defense, the SGT STOUT will protect maneuvering forces by defeating, destroying or neutralizing unmanned aircraft systems, rotary and fixed-wing aircraft, rockets, artillery and mortars.\nThe first two SGT STOUT battalions are in Germany and at Fort Sill, Oklahoma, and the Army recently fielded its third battalion at Fort Cavazos, Texas, in February.\nMitchell W. StoutOn March 12, 1970, Sgt."}, {"id": "c295af73-251d-4a72-a2c9-6ee23bd61e93", "title": "U . S . Navy Rescues Crew from Vessel Struck by Houthis", "date": "2024-06-18 04:00", "url": "https://seapowermagazine.org/u-s-navy-rescues-crew-from-vessel-struck-by-houthis/", "domain": "seapowermagazine.org", "domain_classification": "Unknown", "message": "By Carrier Strike Group Two Public Affairs | June 16, 2024RED SEA –Sailors assigned to the Dwight D. Eisenhower Carrier Strike Group (IKECSG) airlifted the crew of a merchant vessel attacked by Iranian-backed Houthis in the Red Sea, June 15.\nThe Liberian-flagged, Greek-owned bulk cargo carrier M/V Tutor was struck by an Iranian-back Houthi uncrewed surface vessel (USV) while sailing in the international waters of the Southern Red Sea, June 12.\nA helicopter from Helicopter Maritime Strike Squadron (HSM) 74 airlifted 24 civilian mariners from Tutor to Ticonderoga-class guided-missile cruiser USS Philippine Sea (CG 58).\nFrom there, helicopters from Helicopter Sea Combat Squadron (HSC) 7 transported the group to USS Dwight D. Eisenhower (CVN 69).\n“It’s humbling to watch the Strike Group provide assistance and rescue the crew of M/V Tutor,” said Rear Adm. Marc Miguez, commander, IKECSG, Carrier Strike Group 2."}, {"id": "4793e186-e051-4aee-a26d-1a0e943e1478", "title": "IDF Claims Half of Hamas Battalions Destroyed in Rafah as US Pressures Israel to Avoid Major War with Hezbollah", "date": "2024-06-18 14:15", "url": "https://www2.cbn.com/news/israel/idf-claims-half-hamas-battalions-destroyed-rafah-us-pressures-israel-avoid-major-war", "domain": "cbn.com", "domain_classification": "Unknown", "message": "IDF Claims Half of Hamas Battalions Destroyed in Rafah as US Pressures Israel to Avoid Major War with HezbollahJERUSALEM, Israel – As Hezbollah terrorists seriously escalated projectile attacks on northern Israel over the last week, the Biden administration is urging the Jewish nation not to strike back so hard that it leads to all-out war.\nThe admonition comes as Israel claims it has destroyed half of the Hamas fighting forces in Rafah.\npic.twitter.com/cD1uzE7yik — Israel ישראל (@Israel) June 18, 2024It is impossible, however, according to Israelis who live there, to put up with near-daily shellings that have forced some 100,000 citizens from their homes in northern Israel for the better part of a year.\nBut Israeli forces claim they've now largely demolished two of the four Hamas battalions in Rafah and have seriously degraded the other two.\nAnalysts have pointed out Hamas deliberately raped and abused Israeli women to create such terror in the Jewish nation."}, {"id": "96027295-ff5f-4d73-8641-fc19bbf2a643", "title": "Turkey Helped Russia Foil Second Terrorist Attack In Moscow - Report", "date": "2024-06-18 10:00", "url": "https://www.i24news.tv/en/news/international/artc-turkey-helped-russia-foil-second-terrorist-attack-in-moscow-report", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Turkish security services helped prevent a second terrorist attack in Moscow after the deadly shooting at Crocus City Hall concert venue in March, reported Turkish newspaper Hürriyet.\n“After the first attack on the concert hall, the terrorist group planned a second attack.\nTurkish intelligence prevented this second major terrorist attack by contacting Moscow,” said the report.\nThe shooting at Russia's capital concert hall in March took lives of 145 people.\nRussia's intelligence services have accused Ukraine and the West of involvement in the attack."}, {"id": "263e6968-3957-4767-a6a7-bb3189db525d", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 02:45", "url": "https://www.kiro7.com/news/national/authorities-across/BCWAJAPAC3GLWOOVYBDNYLAM4U/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e637d430-97db-4c4c-980d-4c1636f6651e", "title": "Netanyahu dissolves influential War Cabinet", "date": "2024-06-18 02:45", "url": "https://www.stltoday.com/news/nation-world/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolted-from-government/article_8efa87a0-3fb8-57fe-92df-b57ae4fa0d65.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that oversaw the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "059995ac-8aed-4067-b760-6348686c65b3", "title": "Netanyahu dissolves influential War Cabinet", "date": "2024-06-18 00:30", "url": "https://omaha.com/news/nation-world/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolted-from-government/article_c1cf1bd9-a896-5bad-9edd-3733e6994e79.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that oversaw the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "2106d415-5a89-4312-8ee6-7b3e268a4542", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 09:15", "url": "https://www.cleveland19.com/2024/06/18/authorities-across-us-grapple-with-rash-violence-final-days-spring/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "(AP) - Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people, including an 8-year-old who was shot in the head.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nThe rash of violence is a counterpoint to FBI data pointing to a sharp drop in violent crime nationwide earlier this year.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays."}, {"id": "1392bd0c-247a-4a4b-8884-9cfad5adf582", "title": "Putin jets off for North Korean state visit and praises Kim Jong - un for backing his Ukraine invasion as Kyiv condemns  world loneliest bromance  ", "date": "2024-06-18 10:00", "url": "https://www.dailymail.co.uk/news/article-13541717/Putin-jets-North-Korean-state-visit-praises-Kim-Jong-backing-Ukraine-invasion-Kyiv-condemns-worlds-loneliest-bromance.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The United States voiced 'concern' on Monday about the trip because of the security implications for South Korea as well as Ukraine.\nSouth Korea this morning revealed Multiple North Korean soldiers have been killed or injured in a landmine explosion inside the Demilitarized Zone as South Korea fired warning shots.\nAs they fled, an unspecified number of North Korean soldiers were injured in a landmine explosion, the Yonhap News Agency reports, according to the AFP.\n'North Korean military suffers multiple casualties due to a mine explosion during work,' the report said, without giving further details.\nThe Joint Chiefs said they don't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "bfbe81b7-9cb7-4e03-ba85-efcdf5707871", "title": "Houthis Say Attacked US Destroyer , 2 Ships in Red , Arabian Seas", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240617-sputnik02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Houthis Say Attacked US Destroyer, 2 Ships in Red, Arabian SeasSputnik News20240617CAIRO (Sputnik) - Yemen's Ansar Allah rebel movement, also known as the Houthis, said that it had attacked a US destroyer and two commercial vessels in the Red and Arabian Seas.\n\"The missile unit and naval forces of our Yemeni armed forces carried out two military operations in the Red Sea,\" Houthi military spokesman Yahya Saree said on Sunday.\nThe spokesman said that the Houthis fired missiles at a US destroyer and the Captain Paris vessel in the Red Sea.\nHe also added that the movement attacked with drones the Happy Condor vessel in the Arabian Sea.\nThe Houthis have been launching attacks on commercial and military vessels in the region for months in response to Israeli military operations in the Gaza Strip."}, {"id": "675645cf-c197-47a6-a324-9c4e9130b57f", "title": "US recognition of Iraq group as terror org is significant", "date": "2024-06-18 09:15", "url": "https://www.jpost.com/middle-east/iran-news/article-806698", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The US State Department on Monday designated Iraqi-based militia Harakat Ansar Allah al-Awfiya as a terrorist group.\nThe IRI is an umbrella group for a large number of Iranian-backed militias in Iraq.\nThe Iranian-backed groups in Iraq carried out more than 100 attacks on US forces in Iraq and Syria from October through January.\nThe Iranian-backed groups in Iraq have sought to increase their attacks on Israel.\nIt was not clear if this was linked to the Iraqi groups."}, {"id": "d55b1da0-406e-4b7e-99ab-13aceeeec2f5", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 12:00", "url": "https://www.wfsb.com/2024/06/18/authorities-across-us-grapple-with-rash-violence-final-days-spring/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "(AP) - Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people, including an 8-year-old who was shot in the head.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nThe rash of violence is a counterpoint to FBI data pointing to a sharp drop in violent crime nationwide earlier this year.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays."}, {"id": "6428b6d0-190d-44fc-ac2b-445034f1cf29", "title": "Netanyahu Disbands War Cabinet as Pressure Grows on Israel Northern Border", "date": "2024-06-18 10:00", "url": "https://chronicle.lu/category/international-news/50277-netanyahu-disbands-war-cabinet-as-pressure-grows-on-israels-northern-border", "domain": "chronicle.lu", "domain_classification": "Unknown", "message": "Netanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nThe Israeli military said on Monday it had killed a senior operative in one of Hezbollah's rocket and missile sections in the area of Selaa in southern Lebanon.\nNetanyahu had faced demands from the nationalist-religious partners in his coalition, Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, to be included in the war cabinet.\nThe forum was formed after Gantz joined Netanyahu in a national unity government at the start of the Gaza war in October.\nGantz and Eisenkot both left the government last week, over what they said was Netanyahu's failure to form a strategy for the Gaza war."}, {"id": "5c9e1bd2-c8d9-4897-a9bc-c645911d7768", "title": "Netanyahu dissolves influential War Cabinet after key partner bolts from govt | World News", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/world-news/20240618/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolts-govt", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "The move to scrap the War Cabinet comes as Israel faces more pivotal decisions.\nThe lull continued even after Israeli military officials said they killed a key operative in Hezbollah’s rocket and missile department, Mohammed Ayoub, in a drone attack on Monday morning.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the War Cabinet, where he had observer status.\nWithout the support of Gantz’s party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "c9e56a37-243e-462f-84ff-f209896c6b89", "title": "Hamas a new challenge in Gaza : Terror groups competing for Israel attack", "date": "2024-06-18 12:00", "url": "https://www.jpost.com/israel-hamas-war/article-806703", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Hamas continues its attacks on the IDF in Gaza eight and a half months into the war.\nIncreasingly, several other terror groups in Gaza are also seeking to carry out daily attacks on Israeli forces.\nFor instance, on June 18, an article at Al-Mayadeen lists six terrorist groups, in addition to Hamas, that have carried out attacks in the last day.\nHamas is letting the other groups operate because it has often partnered with PIJ in Gaza.\nIsrael doesn’t usually differentiate between Hamas's losses and these other groups, but the bulk of the losses in the Gaza war have been suffered by Hamas."}, {"id": "0cbce800-8974-451a-83c2-cbf39c60d623", "title": "Anderson Lee Aldrich : Club Q shooter to be sentenced on federal charges for hate crimes and firearm violations", "date": "2024-06-18 14:00", "url": "https://us.cnn.com/2024/06/18/us/club-q-shooter-hate-crime-sentencing/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —The shooter who opened fire in a Colorado Springs LGBTQ+ nightclub, killing five people and injuring 19, is set to be sentenced for federal hate crime charges and firearm violations Tuesday.\nIn January, Anderson Lee Aldrich agreed to plead guilty to 74 federal hate crime charges and gun charges in connection with the shooting.\nSome patrons hid or played dead as Aldrich moved though the club, shooting indiscriminately.\nAnderson Lee Aldrich, center, sits during a court appearance in Colorado Springs in November 2022.\nThe shooter agreed in January to plead guilty to federal charges stemming from the Club Q shooting."}, {"id": "940ff656-8507-4314-ab36-3b66cb45bef4", "title": "Apple F1 film given release date in June 2025", "date": "2024-06-18 10:00", "url": "https://www.motorsport.com/f1/news/apples-f1-film-given-release-date-in-june-2025/10624379/", "domain": "motorsport.com", "domain_classification": "Unknown", "message": "Apple's Formula 1 film has been given a release date of 25 June 2025, as the production continues shooting footage at 2024 F1 events following delays caused by last year's Hollywood actors' strike.\nThe film will be available to view in international markets on 25 June 2025, before its release in North America takes place two days later on 27 June 2025.\nAn F1 press release announcing the film's release dates states: \"The global theatrical release will also include IMAX theatres.\ncars being filmed for new F1 film APEX starring Brad Pitt Photo by: Simon Galloway / Motorsport ImagesSeven-time F1 world champion Lewis Hamilton is a producer for the project, with the Mercedes driver also involved in writing the film's script.\n\"We've already got great footage with the demo drivers, who have done a great job, as all the [F1] drivers got to see in Austin [2023]."}, {"id": "08c02aba-bed5-421e-b336-60f8a9b5a18b", "title": "Netanyahu dissolves influential war Cabinet after key partner bolted from government", "date": "2024-06-18 05:30", "url": "https://isp.netscape.com/news/world/story/0001/20240618/76b4e165609bb3f0716c8599a83efa99", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Netanyahu dissolves influential war Cabinet after key partner bolted from governmentTEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that has overseen the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "999d0bdf-18c0-44ff-9fa0-2e759631ec92", "title": "  I whispered in her ear , asking her to tell my sister , my mother , I love them : A letter from Gaza", "date": "2024-06-18 04:45", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41418175.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "My mother died when I was six, so my big sister Samar became like my mother.\nPalestinian medics surround a baby wounded in the Israeli bombardment of Khan Younis in Gaza on Saturday, October 21, 2023.\nIt was so full of love, with my grandmother, my sister Samar, and my brother Mohammed.\nPicture: Abed Khaled/APBut I did not find Massah, nor her mother — my sister — not her father, not her aunts.\nI whispered in her tiny ear, asking her to tell my sister, my mother, that I love them dearly, and yearn for our reunion."}, {"id": "084e1133-d2d3-4c86-a02a-12a9bcd25d82", "title": "21 Pinoy seafarers from Houthi - attacked ship successfully repatriated", "date": "2024-06-18 10:15", "url": "https://www.sunstar.com.ph/manila/21-pinoy-seafarers-from-houthi-attacked-ship-successfully-repatriated", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "They were welcomed by DMW Secretary Hans Cacdac and Health Secretary Ted Herbosa along with other government officials at the Ninoy Aquino International Airport (NAIA).\nSearch operations for the one missing Filipino sailor are still ongoing.\nThe DMW has yet to confirm nor deny the statement of the White House that a Filipino sailor was “killed” in the incident.\nTwo Filipino seafarers were killed in another Houthi attack in the Gulf of Aden in March.\nThe group has been launching attacks on international vessels traveling the Red Sea region since last year in support of the Palestinians amid the ongoing war between Israel and Hamas."}, {"id": "d48af0ac-97a1-4b2f-b073-baf5a2cd3924", "title": "12 - y - o injured in shooting at Ocho Rios High", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240618/12-y-o-injured-shooting-ocho-rios-high", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "A 12-year-old female student has been admitted to the St Ann’s Bay Regional Hospital after being shot during an incident at the Ocho Rios High School in St Ann on Monday.\nReports are that a 14-year-old male student of a Pineapple, Ocho Rios address took a .23 pistol to school to show off to classmates.\nSenior Superintendent of Police Dwight Powell, the commanding officer for the St Ann Police Division, noted that Ocho Rios High is one of the institutions that have bought into the Safe Schools Programme.\nIt is unclear what impact this shooting incident will have on the programme at Ocho Rios High.\n“We are probing this shooting incident and we are following leads as to how and by what means the student came in possession of the firearm,” Powell said on Monday."}, {"id": "fad2f56c-70fe-4342-9a50-82c7406bb121", "title": "Netanyahu dissolves influential War Cabinet after key partner bolted from government | News , Sports , Jobs", "date": "2024-06-18 03:15", "url": "https://www.mauinews.com/wire/?category=5187&ID=329154", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "The move to scrap the War Cabinet comes as Israel faces more pivotal decisions.\nThe lull continued even after Israeli military officials said they killed a key operative in Hezbollah’s rocket and missile department, Mohammed Ayoub, in a drone attack on Monday morning.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the War Cabinet, where he had observer status.\nWithout the support of Gantz’s party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "f0474caf-ff30-4163-b13f-14e847ba6249", "title": "  They Chop Us Up Like Meat  – Ukraine at War Update for June 18", "date": "2024-06-18 06:45", "url": "https://www.kyivpost.com/post/34442", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Great to be back in the 🇺🇸 and meet @POTUS to prepare our #NATOSummit in July, where we will strengthen support to #Ukraine.\nToday we published new numbers on defence spending, showing 23 #NATO Allies now spend 2% of GDP on defence.\nNow we are already collecting the second batch of drones, which is soon to be sent to Ukraine,” Spruds told the military new site ArmyInform.\n“The increased tax burden on businesses will almost certainly restrict future investment and growth of non-military sectors,” the update reads.\nLatest Defence Intelligence update on the situation in Ukraine – 16 June 2024."}, {"id": "e2676266-d0f3-4b8d-97d0-6f9a62adfe41", "title": "US Navy developing new sea - launched nuclear missile", "date": "2024-06-18 10:15", "url": "https://www.yahoo.com/news/us-navy-developing-sea-launched-090758112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The United States Navy has begun developing a new sea-launched nuclear missile to compete with China, despite pushback from the Biden administration.\nIt is designed to compete with the nuclear weapons programmes of Russia and China, which have both been developing mid-range atomic weapons that could be deployed on the battlefield.\nBut as long as nuclear weapons exist we will remain a nuclear alliance, because a world where Russia, China and North Korea have nuclear weapons, and Nato does not, is a more dangerous world,” he said.\nChina has one of the fastest-growing nuclear stockpiles in the world and is thought to be developing more “tactical” nuclear weapons to be deployed on the battlefield without sparking a full-scale nuclear war.\nThe United States first deployed sea-launched nuclear cruise missiles in the mid-1980s, and withdrew them by 1993 at the end of the Cold War."}, {"id": "45dc5e64-d87f-4140-a416-3d263af917a7", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 04:45", "url": "https://www.yahoo.com/news/shooter-killed-5-colorado-lgbtq-041407133.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "ab151eef-167f-4835-833e-26a826773d67", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 04:45", "url": "https://abcnews.go.com/US/wireStory/shooter-killed-5-colorado-lgbtq-club-set-plead-111205523", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "449b9780-8e70-4079-81c5-b19709c1bcd5", "title": "24 YO shooter , who killed 5 at a Colorado LGBTQ+ club , set to plead guilty to federal hate crimes , gun charges", "date": "2024-06-18 12:00", "url": "https://www.firstpost.com/world/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes-13783637.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nUS District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "b3a7960f-4405-425b-9f0f-10f76d63f606", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 05:30", "url": "https://www.startribune.com/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/600374248/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "57329a0c-82e9-413f-b7d1-3e827f47736b", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 06:45", "url": "https://www.ksat.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "d7a28c44-a3ac-440f-a1d4-6b263f958222", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 08:15", "url": "https://www.clickondetroit.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "37a9c92b-5dd3-45e1-84e2-e332495dfcd7", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes – Winnipeg Free Press", "date": "2024-06-18 05:00", "url": "https://www.winnipegfreepress.com/world/2024/06/17/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nAldrich also pleaded no contest to hate crimes in that case.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "e8844684-230c-4649-bea7-79fc49ceed40", "title": "Club Q shooter to be sentenced on federal charges for hate crimes and firearm violations", "date": "2024-06-18 11:00", "url": "https://www.yahoo.com/news/club-q-shooter-sentenced-federal-092316840.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Club Q shooter to be sentenced on federal charges for hate crimes and firearm violationsThe shooter who opened fire in a Colorado Springs LGBTQ+ nightclub, killing five people and injuring 19, is set to be sentenced for federal hate crime charges and firearm violations Tuesday.\nIn January, Anderson Lee Aldrich pleaded guilty to 74 federal hate crime charges and gun charges in connection with the shooting.\nAldrich began the massacre at the club as patrons were gathering for Transgender Day of Remembrance, for which Club Q had scheduled a weekend of events, including a drag show.\nSome patrons hid or played dead as Aldrich moved though the club, shooting indiscriminately.\nOne trans man who worked as a drag king at Club Q told CNN after the shooting, “Our safety as queer people in Colorado Springs is now questioned."}, {"id": "e41c8c45-f9a4-4c55-a434-c5704d03cda7", "title": "Investigation reveals Israel Gaza strikes wipe out generations of families", "date": "2024-06-18 07:00", "url": "https://www.hurriyetdailynews.com/investigation-reveals-israels-gaza-strikes-wipe-out-generations-of-families-197555", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Investigation reveals Israel’s Gaza strikes wipe out generations of familiesGAZA STRIPThe Associated Press has shared an investigation into the increasing casualty count from Israel's attacks on Gaza, revealing that at least 60 Palestinian families lost at least 25 members between October and December.\nNearly a quarter of those families lost more than 50 family members in those weeks.\nRamy Abdu, chairman for the Geneva-based EuroMed Human Rights Monitor, which monitors the Gaza war, said dozens of his researchers in Gaza stopped documenting family deaths in March after identifying over 2,500 with at least three deaths.\nThe killing of families across generations is a key part of the genocide case against Israel, now before the International Court of Justice.\nTogether, the strikes killed more than 500 people, including the two bombings that wiped out the Salems and three others that killed 30 members of the al-Agha family."}, {"id": "e4e68bb7-8e09-4cee-895c-bd258619bb30", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 08:15", "url": "https://www.news4jax.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "6f046c6a-6adb-4533-a569-3468f753a753", "title": "US sanctions suppliers of weapons parts for Houthis", "date": "2024-06-18 04:00", "url": "http://www.israelnationalnews.com/news/391698", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The United States on Monday imposed new sanctions aimed at cutting off weapons, supplies and funding to the Iranian-backed Houthis rebels.\nThe sanctions were placed on two individuals and five entities that have facilitated weapons procurement for the Houthis, as well as an individual, a company and a vessel that have helped with commodities shipments, “the sale of which provides an important funding stream to the Houthis that aids in their weapons procurement,” the Treasury statement said.\nSeveral of the designated entities are based in China or procure materials for weapons from companies in China, according to the Treasury.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis.\nIn mid-January, with support from other countries, the US and Britain targeted just under 30 Houthi locations with 150 different weapons."}, {"id": "b7bd32c5-12bd-401a-ba41-8fbcd5258b85", "title": "US sanctions suppliers of weapons parts for Houthis", "date": "2024-06-18 02:45", "url": "https://www.israelnationalnews.com/news/391698", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The United States on Monday imposed new sanctions aimed at cutting off weapons, supplies and funding to the Iranian-backed Houthis rebels.\nThe sanctions were placed on two individuals and five entities that have facilitated weapons procurement for the Houthis, as well as an individual, a company and a vessel that have helped with commodities shipments, “the sale of which provides an important funding stream to the Houthis that aids in their weapons procurement,” the Treasury statement said.\nSeveral of the designated entities are based in China or procure materials for weapons from companies in China, according to the Treasury.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis.\nIn mid-January, with support from other countries, the US and Britain targeted just under 30 Houthi locations with 150 different weapons."}, {"id": "81dfd24b-abd5-4216-a092-eeb159b67f87", "title": "Club Q shooter to be sentenced on federal charges for hate crimes and firearm violations - LocalNews8 . com", "date": "2024-06-18 13:15", "url": "https://localnews8.com/news/national-world/cnn-national/2024/06/18/club-q-shooter-to-be-sentenced-on-federal-charges-for-hate-crimes-and-firearm-violations/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Andi Babineau and Zoe Sottile, CNN(CNN) — The shooter who opened fire in a Colorado Springs LGBTQ+ nightclub, killing five people and injuring 19, is set to be sentenced for federal hate crime charges and firearm violations Tuesday.\nIn January, Anderson Lee Aldrich pleaded guilty to 74 federal hate crime charges and gun charges in connection with the shooting.\nAldrich began the massacre at the club as patrons were gathering for Transgender Day of Remembrance, for which Club Q had scheduled a weekend of events, including a drag show.\nSome patrons hid or played dead as Aldrich moved though the club, shooting indiscriminately.\nOne trans man who worked as a drag king at Club Q told CNN after the shooting, “Our safety as queer people in Colorado Springs is now questioned."}, {"id": "42ca61b3-3c52-4c1f-bbc4-7d0f9c7ab834", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 05:15", "url": "https://www.kob.com/news/us-and-world-news/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "kob.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "171bf692-789f-47f2-b4a1-28da630d9d62", "title": "Ukraine claims responsibility for attack on Russian oil storage tanks", "date": "2024-06-18 14:15", "url": "https://www.irishexaminer.com/world/arid-41418658.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Ukraine claimed responsibility on Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov’s governor, Vasily Golubev.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said.\nThe unmanned aerial vehicles are also an affordable option while Ukraine waits for the arrival of more Western military aid."}, {"id": "66359b05-4019-4f93-b797-eeb7c7ff78a7", "title": "Israel warns of  devastating consequence as spike in fire with Lebanon risks wider conflict – NBC 6 South Florida", "date": "2024-06-18 00:45", "url": "https://www.nbcmiami.com/news/business/money-report/israel-warns-of-devastating-consequences-as-spike-in-fire-with-lebanon-risks-wider-conflict/3339287/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "A senior U.S. adviser will travel to Israel in a bid to simmer tensions at the Lebanon border, where recent rains of missiles have reignited the risk of a broader conflict.\nAmos Hochstein, a senior diplomatic adviser to the administration of U.S. President Joe Biden, is expected in Israel on Monday, an Israeli official told NBC News.\nOver the past week, Lebanese militant group Hezbollah has ramped up hostilities and cross-border missile attacks against targets in northern Israel, according to Israel Defense Forces and the Hezbollah-aligned al-Manar news outlet.\nIt comes amid a ramp-up in attacks by Hezbollah in recent weeks following repeat offensives against its neighbor since October.\n\"Israel will take the necessary measures to protect its civilians, until security along our border with Lebanon is restored."}, {"id": "5294428a-e594-43af-b865-da99a76a4e4a", "title": "RIGHT SPEAK : RU Attack on 8 Fronts , Fighting Continues on 6 of Them ; Half of C - Clashes On Pokrovsk Front ; UKR Gradually Pushing RU out of Kharkiv Oblast ; Drones Attacked 4 Regions of RU Federation ; UKR  prepares ground  for Attacks on Crimea ...", "date": "2024-06-18 07:15", "url": "http://www.rightspeak.net/2024/06/ru-attack-on-8-fronts-fighting.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (90) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "8ae952d4-5cd0-4047-9f8b-f5fbb2f04c86", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 08:45", "url": "https://www.fox19.com/2024/06/18/authorities-across-us-grapple-with-rash-violence-final-days-spring/", "domain": "fox19.com", "domain_classification": "Unknown", "message": "(AP) - Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people, including an 8-year-old who was shot in the head.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nThe rash of violence is a counterpoint to FBI data pointing to a sharp drop in violent crime nationwide earlier this year.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays."}, {"id": "c6b52073-747a-44e9-b94e-daac4f276d56", "title": "Club Q shooter to be sentenced on federal charges for hate crimes and firearm violations", "date": "2024-06-18 13:30", "url": "https://ktvz.com/news/national-world/cnn-national/2024/06/18/club-q-shooter-to-be-sentenced-on-federal-charges-for-hate-crimes-and-firearm-violations/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — The shooter who opened fire in a Colorado Springs LGBTQ+ nightclub, killing five people and injuring 19, is set to be sentenced for federal hate crime charges and firearm violations Tuesday.\nIn January, Anderson Lee Aldrich agreed to plead guilty to 74 federal hate crime charges and gun charges in connection with the shooting.\nAldrich began the massacre at the club as patrons were gathering for Transgender Day of Remembrance, for which Club Q had scheduled a weekend of events, including a drag show.\nSome patrons hid or played dead as Aldrich moved though the club, shooting indiscriminately.\nThe shooter agreed in January to plead guilty to federal charges stemming from the Club Q shooting."}, {"id": "0574cfe3-cd7d-4dcb-8558-fb778aff2476", "title": "NewsBusters Podcast : Alex Wagner Whines About Biden Debate In Advance", "date": "2024-06-18 06:30", "url": "https://newsbusters.org/blogs/nb/tim-graham/2024/06/17/newsbusters-podcast-alex-wagner-whines-about-biden-debate-advance", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "On Friday night, MSNBC host Alex Wagner whined that Donald Trump will be held to a much lower standard than Biden during the debates.\nJournalist Susan Glasser agreed, saying the MAGA base doesn't hold Trump \"accountable\" like...well, hostile leftist Democrat journalists.\nIf they did, it would be to satisfy viewers further to the left than Biden.\nThey are upset that Donald Trump's voters don't judge Trump in the same way that leftist MSNBC hosts judge Trump.\nBut earlier, Tapper asked Sen. Murphy if it was appropriate for President Biden to criticize the Supreme Court as \"out of kilter\" with public opinion."}, {"id": "3a4141ec-1cc8-4ba2-a96e-a66422944898", "title": "NewsBusters Podcast : Alex Wagner Whines About Biden Debate In Advance", "date": "2024-06-18 06:15", "url": "https://www.newsbusters.org/blogs/nb/tim-graham/2024/06/17/newsbusters-podcast-alex-wagner-whines-about-biden-debate-advance", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "On Friday night, MSNBC host Alex Wagner whined that Donald Trump will be held to a much lower standard than Biden during the debates.\nJournalist Susan Glasser agreed, saying the MAGA base doesn't hold Trump \"accountable\" like...well, hostile leftist Democrat journalists.\nIf they did, it would be to satisfy viewers further to the left than Biden.\nThey are upset that Donald Trump's voters don't judge Trump in the same way that leftist MSNBC hosts judge Trump.\nBut earlier, Tapper asked Sen. Murphy if it was appropriate for President Biden to criticize the Supreme Court as \"out of kilter\" with public opinion."}, {"id": "b5a80863-306e-4f9d-b652-1e6a8bca807e", "title": "Petroleum storage tanks on fire in Russia Rostov Oblast", "date": "2024-06-18 03:45", "url": "https://www.yahoo.com/news/petroleum-storage-tanks-fire-russias-025309368.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Several oil storage tanks in the town of Azov in Russia's southwestern Rostov region caught fire overnight on June 18 following a drone strike, Vasily Golubev, the regional governor, said.\nThe town of Azov, situated 16 kilometers (9.9 miles) from the Azov Sea, is home to 81,924 people.\nRostov Oblast borders Ukraine to the southeast.\nOn June 14, a drone attack in the city of Morozovsk in Russia's Rostov Oblast caused a fire and disruptions to the local power supply.\nKyiv officials say these attacks are carried out to undermine Russia's military operations and retaliate against Moscow's strikes on Ukrainian energy infrastructure."}, {"id": "3755a29b-9a8e-4cc6-867b-22de39f76635", "title": "Video Shows Russian Tank Hit by Mine Finished Off by Drone", "date": "2024-06-18 06:45", "url": "https://www.kyivpost.com/post/34430", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "A video circulating on social media reportedly captures a Russian tank being blown up by a mine and then finished off with a well-aimed strike by a Ukrainian drone .\nThe video initially shows the tank detonating after hitting a mine, followed by a powerful explosion, apparently caused by a Ukrainian drone strike.\nAdvertisementA Ukrainian military officer interviewed by Kyiv Post suggested that the tank destroyed during this operation could be a T-72.\nThe 68th Jaeger Brigade, a veteran formation of the War in Ukraine, previously shared a video showing the destruction of a Russian tank company in eastern Ukraine.\nHe disclosed that on the Pokrovsk axis, the Ukrainian Defense Forces had destroyed eight Russian tanks and disabled two more, which equates to a tank company."}, {"id": "ad75f26c-0a73-447d-8bf4-6701616b4132", "title": "Report : North Korea Added 20 Nukes to Its Arsenal in 2023", "date": "2024-06-18 02:00", "url": "https://www.breitbart.com/politics/2024/06/17/report-north-korea-added-20-nukes-to-its-arsenal-in-2023/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "North Korea is believed to possess 50 nuclear weapons – 20 more than in the past year, the Stockholm International Peace Research Institute (SIPRI) revealed in its annual report published on Monday on global militaries.\nIn its section on North Korea, SIPRI warned that evidence suggests communist dictator Kim Jong-un is “putting new emphasis” on Pyongyang’s nuclear assets.\n“It also completed the development of at least two types of land-attack cruise missile (LACM) designed to deliver nuclear weapons.”In 2023, SIPRI estimated that North Korea possessed 30 assembled warheads.\nNorth Korea has not tested a nuclear weapon since 2017 but regularly threatens to use its nuclear weapons against South Korea, in which it is in a state of formal war halted only by an armistice agreement signed in 1953.\nSouth Korea reacted to the trash balloons by reinstalling massive loudspeakers in the Demilitarized Zone (DMZ) used to broadcast hours of content – including news of South Korea, political messages, and Korean pop music – to the North."}, {"id": "81f3e8e6-3516-4db2-8cc3-92da129ffd70", "title": "Woman wanted in connection to fatal April stabbing arrested , DC police say", "date": "2024-06-18 04:30", "url": "https://www.yahoo.com/news/woman-wanted-connection-fatal-april-014552884.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Woman wanted in connection to fatal April stabbing arrested, DC police sayWASHINGTON (DC News Now) — A woman who was wanted by the Metropolitan Police Department (MPD) for a fatal stabbing that happened in April was arrested Monday.\nOfficers responded to the 1300 block of Peabody Street NW just after 11:20 p.m. on April 5 after receiving reports of an unconscious person inside an apartment.\nShe was charged with First Degree Murder while Armed – Felony Murder.\nMPD said she would be extradited to Washington, D.C.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "1a8e0e9a-ac6e-44d7-97f9-34b24e091bda", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-18 08:45", "url": "https://www.asahi.com/ajw/articles/15309918", "domain": "asahi.com", "domain_classification": "Unknown", "message": "(REUTERS)TAIPEI--Taiwan’s defense minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defense Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan’s defense ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "56e5bd80-0fd3-4cec-ba92-e4f94916fe1d", "title": "Sentry Aloha 24 - 2 : Joint Forces Showcase Advanced Combat Training", "date": "2024-06-18 08:00", "url": "https://theaviationist.com/2024/06/18/sentry-aloha-24-2-joint-forces-showcase-advanced-combat-training/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Exercise Sentry Aloha is a training drill hosted by the Hawaii Air National Guard’s 154th Wing.\nAircraft operations were conducted at various locations on the islands of Oahu, Hawaii, including Marine Corps Base Hawaii and Ellison Onizuka Kona International Airport at Keāhole.\nBlue Air fighters were employed in various scenarios, including protecting the A-10s during close air support operations in the Pohakuloa Training Area.\nCAS (Close Air Support) activities were managed by the airmen of the 25th Air Support Operations Squadron.\nit also provided an opportunity to develop specialized mission qualification training for participating fighter squadrons."}, {"id": "528054d3-cea9-4a73-b190-c6bf482088e1", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 13:15", "url": "https://www.bworldonline.com/world/2024/06/18/602556/taiwan-keeping-watch-after-chinese-submarine-surfaces-in-taiwan-strait/", "domain": "bworldonline.com", "domain_classification": "Unknown", "message": "TAIPEI — Taiwan’s defense minister said on Tuesday that they have a “grasp” of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defense Minister Wellington Koo said they have a “grasp” of the intelligence situation, but declined to say how they were monitoring it or give details.\n“We must be alert at all times, but not panic nor be apathetic, and calmly deal with the situation in the strait,” he added."}, {"id": "5d9820f3-0af4-455f-94fb-6f038a32a71b", "title": "Comment by Foreign Ministry Spokeswoman Maria Zakharova on the murder of Russian war correspondent Nikita Tsisagi", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240616-russia-mfa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Comment by Foreign Ministry Spokeswoman Maria Zakharova on the murder of Russian war correspondent Nikita Tsisagi16 June 2024 20:201144-16-06-2024On June 16, News.ru war correspondent Nikita Tsisagi was killed in the line of duty in the Donetsk People's Republic (DPR) as a result of a targeted drone attack launched by the armed forces of the Kiev regime.\nUkrainian terrorists deliberately sent a drone to swoop on the Russian journalist as he was doing a story in the vicinity of the Nikolsky Monastery off Ugledar.\nDeployed in the DPR zone of hostilities since 2022, Nikita Tsisagi was covering Ukrainian artillery, missile and drone attacks on Donetsk, Belgorod, and Moscow.\nOn June 13, Ukrainian terrorists launched a drone at a NTV filming crew, killing cameraman Valery Kozhin and gravely wounding war correspondent Alexey Ivliyev.\nThe cruel murder of Nikita Tsisagi is yet another grievous crime committed by the Bandera regime responsible for numerous civilian deaths."}, {"id": "2e39f544-0c22-4458-892f-4a7478caed78", "title": "James Bond : 007 # 6 - Comic Book Preview", "date": "2024-06-18 06:30", "url": "https://www.flickeringmyth.com/comic-book-preview-james-bond-007-6-2/", "domain": "flickeringmyth.com", "domain_classification": "Unknown", "message": "Dynamite Entertainment releases James Bond: 007 #6 on Wednesday, and we have the official preview of the issue for you below; check it out…As time runs out for 007 to stop the deployment of the STALVODA compound, he does what any good agent would do when faced with hopeless odds — he calls in an airstrike!\nUnfortunately, there is still the small matter of being stuck at ground zero when it arrives… Meanwhile, the snake in the grass at MI6 finally reveals himself — but is it too late for Bond to do anything about it?\nFeaturing a suitably steely cover by DAVE JOHNSON (100 Bullets, Superman: Red Son, Deadpool) and iconic interiors by RAPHA LOBOSCO (James Bond: Black Box), the finale of “Your Cold, Cold Heart” marks a milestone for first-time Bond author GARTH ENNIS and caps off a decade of James Bond comics at Dynamite!\nJames Bond: 007 #6 goes on sale on June 19th, priced $4.99."}, {"id": "ef9a73bb-8c9a-4953-9756-af48b9779dee", "title": "Ukrainian drone attacks on Russian oil refineries and infrastructure", "date": "2024-06-18 13:30", "url": "https://www.swissinfo.ch/eng/ukrainian-drone-attacks-on-russian-oil-refineries-and-infrastructure/81054660", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukrainian drone attacks on Russian oil refineries and infrastructurereuters_tickers4 minutesMOSCOW (Reuters) – Ukraine has been systematically targeting Russian energy infrastructure to try to disrupt Russia’s economy and its ability to fund its military effort.\nFollowing is a chronology of some of the main drone strikes on Russian oil refineries and infrastructure this year.\nMarch 16 – The Syzran oil refinery, controlled by Rosneft, burned for hours before the fire was brought under control after a strike by Ukrainian drones.\nMarch 13 – The Ryazan oil refinery was set ablaze after a drone attack.\nJan. 26 – The Tuapse oil refinery in southern Russia halted oil processing and output following a fire."}, {"id": "e829c3a4-c9f5-431b-a856-90afb6846fdb", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 11:45", "url": "https://timesofindia.indiatimes.com/world/europe/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/articleshow/111085436.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "KYIV : Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.Ukraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nMoscow’s army is pressing hard along the front line in eastern Ukraine, where a shortage of troops and ammunition in the third year of war has made defenders vulnerable.The attack set fire to an oil reservoir in Russia ’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nVasily Golubev.The blaze covered an area of 5,000 square meters (55,000 square feet) but there were no casualties, Russia’s Emergencies Ministry said.A Ukrainian official, speaking on condition of anonymity because he was not authorized to give the information to the media, said the attack was a special operation of Ukraine’s Security Service, known as SBU.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said.It was not possible to independently confirm the claim.Kyiv officials normally decline comment about attacks on Russian territory, though they sometimes refer obliquely to them.Ukrainian drone developers have been extending the weapons’ range for months, as Kyiv attempts to compensate for its battlefield disadvantage.\nThe unmanned aerial vehicles are also an affordable option while Ukraine waits for the arrival of more Western military aid."}, {"id": "3635d692-295a-4030-87e1-fc5975349c0c", "title": "Ukrainian Drone Attack Causes Fire at Russian Oil Facility", "date": "2024-06-18 13:00", "url": "https://time.com/6989684/ukraine-drone-attack-russia-oil-facility/", "domain": "time.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said.\nUkrainian drone developers have been extending the weapons’ range for months, as Kyiv attempts to compensate for its battlefield disadvantage."}, {"id": "7d31166c-bffd-4b4d-9e68-5873a60bc868", "title": "Putin hails North Korea support for Ukraine war ahead of Pyongyang visit", "date": "2024-06-18 10:00", "url": "https://www.thedailystar.net/news/world/russian-invasion-ukraine/news/putin-hails-north-koreas-support-ukraine-war-ahead-pyongyang-visit-3636436", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin on Tuesday hailed North Korea for \"firmly supporting\" Moscow's war in Ukraine ahead of a visit to Pyongyang set to boost defence ties between the two nuclear-armed countries.\nThe United States and its allies have accused North Korea of supplying Russia with much-needed arms, including ballistic missiles to use in Ukraine.\nThe North has denied giving Russia military hardware but, ahead of his trip, Putin thanked Kim Jong Un's government for helping the war effort.\n\"Their closest friends and the biggest supporters of the Russian war effort -- war of aggression -- (are) North Korea, Iran and China,\" Stoltenberg said.\nNorth Korea is eager for high-end military technology to advance its nuclear, missile, satellite and nuclear-powered submarine programs, according to experts."}, {"id": "bcf8e5db-6c61-4b89-8c1a-ea6713330e05", "title": "Killer Reveals Beheaded Tech CEO Last Words In Court", "date": "2024-06-18 03:00", "url": "https://dailycaller.com/2024/06/17/tyrese-haspil-fahim-saleh-ceo-last-words-court/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "The suspect revealed the final words of the slain tech CEO in court Monday, New York Post reported.\nTyrese Haspil, 25, admitted to killing his former boss, tech CEO Fahim Saleh, during his Manhattan Supreme Court trial.\nHaspil, previously Saleh’s trusted protégé, described the July 2020 attack, according to the New York Post.\nI remember tasing him in the back,” Haspil recounted calmly, New York Post reported.\nHis defense is pushing for a downgraded charge of manslaughter, according to the New York Post."}, {"id": "aea365d4-d572-447f-8e88-96ccc5828bcc", "title": "Ukraine claims responsibility for attack on Russian oil storage tanks", "date": "2024-06-18 11:45", "url": "https://www.breakingnews.ie/world/ukraine-claims-responsibility-for-attack-on-russian-oil-storage-tanks-1639421.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Ukraine claimed responsibility on Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov’s governor, Vasily Golubev.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said.\nThe unmanned aerial vehicles are also an affordable option while Ukraine waits for the arrival of more Western military aid."}, {"id": "a5839a64-c768-4413-b4b0-8c0f6f229ea5", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 03:15", "url": "https://www.yahoo.com/news/taiwan-keeping-watch-chinese-submarine-025558775.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nMilitary experts say the strategic waters off Taiwan's southwestern shores, where the largely shallow Taiwan Strait descends in depth, provide submarines a location for an ambush, making it a hot spot for militaries including China, Taiwan and the United States.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "7f8eab71-46a5-4b3e-b78d-f7aea0d278eb", "title": "Altered image falsely shared as  US aircraft carrier damaged by Huthi attack  ", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/altered-image-falsely-shared-us-023433648.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A satellite image of an aircraft carrier has been altered to add a crater to its flight deck and then shared in social media posts that presented it as evidence of damage caused by Yemen's Huthi rebels.\n\"The Eisenhower CVN-69 Nimitz-class aircraft carrier is said to have been attacked by the Huthi armed forces,\" read a simplified Chinese X post shared on June 3, 2024.\nSimilar posts sharing the manipulated imagery racked up over two million views after they were shared on X here and here, YouTube, and on Weibo.\nThe claim was also shared in English and Thai while AFP has previously debunked similar posts in Arabic.\nNo hole was visible in the deck of the ship in the Google Earth image."}, {"id": "0afeb352-08cb-4870-b8c2-f16aae7f194d", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 08:00", "url": "https://economictimes.indiatimes.com/news/defence/taiwan-keeping-watch-after-chinese-submarine-surfaces-in-taiwan-strait/articleshow/111079026.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelTAIPEI: Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.The narrow strait that separates Taiwan from China is a frequent source of tension.\n\"We must be fully alert to China's continued military harassment and grey zone threats and must always understand China's constant salami-slicing attempts to unilaterally change the status quo,\" Koo said.\n\"We must be alert at all times, but not panic nor be apathetic, and calmly deal with the situation in the strait,\" he added.\n\"We won't be the one provoking, and call on China not to be a troublemaker.\n\"Taiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "fab8c715-d0b7-4dda-94f1-4acc9cb6c656", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 04:45", "url": "https://www.aol.com/taiwan-keeping-watch-chinese-submarine-025558557.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Yimou LeeTAIPEI (Reuters) -Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "e7045114-3967-4e33-9c37-ff8b190a4f15", "title": "Taiwan on High Alert : Chinese Nuclear Submarine Surfaces in Sensitive Strait", "date": "2024-06-18 09:15", "url": "https://www.devdiscourse.com/article/law-order/2986432-taiwan-on-high-alert-chinese-nuclear-submarine-surfaces-in-sensitive-strait", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "5ec290bf-299f-44fe-b89b-6ec6f06ce8b9", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 11:15", "url": "https://www.yahoo.com/news/ukraine-claims-drones-hit-russian-105229458.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Vasily Golubev, the governor of the Rostov region, said that a Ukrainian drone attack caused a fire at an oil reservoir.\nThe Emergencies Ministry said over 70 firefighters are fighting the blaze that covers the area of 5,000 square meters.\n(Russian Emergency Ministry Press Service via AP)KYIV, Ukraine (AP) — Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "70c2af6a-9454-4790-a227-cc7b0eaf20d1", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 11:45", "url": "https://apnews.com/article/russia-ukraine-war-oil-fire-d0d524b488fb5fcc924a27523b65cdc4", "domain": "apnews.com", "domain_classification": "International", "message": "KYIV, Ukraine (AP) — Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe blaze covered an area of 5,000 square meters (55,000 square feet) but there were no casualties, Russia’s Emergencies Ministry said.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "e1c4bb42-896f-4258-bca3-950e6fd311fd", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 11:30", "url": "https://www.startribune.com/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/600374286/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv's forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin's war machine.\nThe attack set fire to an oil reservoir in Russia's Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe blaze covered an area of 5,000 square meters (55,000 square feet) but there were no casualties, Russia's Emergencies Ministry said.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "4e2372cd-57dc-4a0e-b6c2-d21e77c304fd", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 13:00", "url": "https://www.clickondetroit.com/news/world/2024/06/18/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Vasily Golubev, the governor of the Rostov region, said that a Ukrainian drone attack caused a fire at an oil reservoir.\nThe Emergencies Ministry said over 70 firefighters are fighting the blaze that covers the area of 5,000 square meters.\n(Russian Emergency Ministry Press Service via AP)KYIV – Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nRecommended VideosThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "a790a969-f0ca-44d0-ab5a-4f772ff5cdde", "title": "Mass shootings this weekend : Michigan splash pad shooting may or may not fit mass shooting definition , depending on who you ask", "date": "2024-06-18 00:30", "url": "https://abc7chicago.com/post/mass-shootings-weekend-michigan-splash-pad-shooting-may-not-fit-definition-depending/14966842/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "What is a mass shooting?\nThat depends on who you askThere are still misunderstandings about what constitutes a mass shooting and why.\nThere are still misunderstandings about what constitutes a mass shooting and why.\nThere are still misunderstandings about what constitutes a mass shooting and why.\nMore than two, simply in my view, would be a mass shooting,\" former longtime Orland Park Police Chief Tim McCarthy told the I-Team."}, {"id": "fa4cf259-4d2d-4531-8ef0-df97f0d9b67f", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 13:30", "url": "https://www.dailyexcelsior.com/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "Kyiv, Jun 18 : Ukraine claimed responsibility on Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nUkraine has in recent months stepped up aerial assaults on Russian soil, targeting refineries and oil terminals in an effort to slow down the Kremlin’s war machine.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe blaze covered an area of 5,000 square meters (55,000 square feet) but there were no casualties, Russia’s Emergencies Ministry said.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "d067270e-41d5-45d2-8751-36888b69cd8f", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze – Metro US", "date": "2024-06-18 12:30", "url": "https://www.metro.us/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/", "domain": "metro.us", "domain_classification": "Unknown", "message": "Vasily Golubev, the governor of the Rostov region, said that a Ukrainian drone attack caused a fire at an oil reservoir.\n(Russian Emergency Ministry Press Service via AP)Sign up for our Metro US email newsletter to get news, updates, and local insights delivered straight to your inbox!\nKYIV, Ukraine (AP) — Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "4d9a9000-2828-423c-9cac-4af48cd94260", "title": "For magistrates and judges , danger always lurks in the shadows", "date": "2024-06-18 03:30", "url": "https://nation.africa/kenya/news/for-magistrates-and-judges-danger-always-lurks-in-the-shadows--4661356", "domain": "nation.africa", "domain_classification": "Local - Africa", "message": "That a gun attack inside a courtroom was not far-fetched had been evident as late as four months earlier.\nHe is now a Supreme Court judge.\nWeeks earlier, Justice Mwilu and three Supreme Court judges had nullified that year’s presidential elections.\nJustice Nzioka was preparing a judicial report on the 2013 ethnic bloodletting in Tana River County, which implicated top police, political, intelligence and military officials in the mass murders.\nThe assassination of magistrates, judges and court officials, while rare in Kenya, is common in other countries, including the USA, India and Philippines."}, {"id": "1aa6991b-8c5d-464b-a8f8-9646e2538217", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 11:15", "url": "https://www.clickorlando.com/news/world/2024/06/18/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Vasily Golubev, the governor of the Rostov region, said that a Ukrainian drone attack caused a fire at an oil reservoir.\nThe Emergencies Ministry said over 70 firefighters are fighting the blaze that covers the area of 5,000 square meters.\n(Russian Emergency Ministry Press Service via AP)KYIV – Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nRecommended VideosThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "c471b00e-6a6c-4b3d-922a-308221c8da85", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 04:00", "url": "https://gazette.com/news/us-world/taiwan-keeping-watch-after-chinese-submarine-surfaces-in-taiwan-strait/article_5e5f0b70-b880-51ad-8636-cd054b9a0a75.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Yimou LeeTAIPEI (Reuters) -Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "4a53d188-6e45-4c01-ba36-de17a4c4f94e", "title": "One man dead , another wounded in Staten Island knife fight", "date": "2024-06-18 01:15", "url": "https://www.nydailynews.com/2024/06/17/one-man-dead-another-wounded-in-staten-island-knife-fight/", "domain": "nydailynews.com", "domain_classification": "Unknown", "message": "One man was killed and another was wounded in a Staten Island knife fight Monday, police and sources said.\nThe men, ages 41 and 37, got into a fight at the corner of Broad and Gordon Sts.\nBoth men, armed with knives, took swipes at each other until eventually the older man was stabbed in the chest and the younger in the leg, sources said.\nMedics rushed the 41-year-old man to Staten Island University Hospital, but he could not be saved.\nThe younger man was taken to Richmond University Medical Center, where he was expected to survive his injuries."}, {"id": "e28c5612-6185-41fc-9e0c-7f06d6356ff2", "title": "Rampage suspect pleads guilty in Jerome County", "date": "2024-06-18 11:30", "url": "https://magicvalley.com/news/local/crime-courts/brandalyn-maglaughlin-guilty-shooting-stabbing-jerome-county/article_9ba80216-2cfe-11ef-aa1e-27f2f15c4085.html", "domain": "magicvalley.com", "domain_classification": "Unknown", "message": "Brandalyn Michelle Maglaughlin, 43, pleaded guilty to aggravated battery, unlawful possession of a firearm and battery on a correction officer.\nFor the aggravated battery charge, the most serious, prosecutors will recommend a sentence of eight years’ fixed and four years indeterminate, but with retained jurisdiction, records say.\nMaglaughlin then picked up a handgun belonging to Lamm, court records say, and fired at him through a window when he fled his trailer, wounding him.\nShe eventually threw down the knife and gun when Jerome County deputies arrived at the scene, records say.\nShe was combative after being taken to the Jerome County Jail and spat at deputies as they attempted to book her and take her booking photo, records say."}, {"id": "99b30e45-b35a-4aad-b940-00d8a85f37e9", "title": "First Visuals : Nikhil Gupta Extradited To US In Pannun  Murder  Plot Case", "date": "2024-06-18 04:45", "url": "https://www.timesnownews.com/world/us/us-news/first-visuals-nikhil-gupta-extradited-to-us-in-gurpatwant-singh-pannun-murder-plot-case-article-111070802", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "Visuals of Nikhil Gupta who was extradited to the US Photo : ANINew Delhi: The Czech Republic Police has released the visuals of Nikhil Gupta , an Indian national, being extradited to the United States for his alleged involvement in a murder-for-hire plot against Sikh extremist Gurpatwant Singh Pannun on American soil.\nGupta was extradited to the US on June 14 (Monday) from the Czech Republic following his arrest in Prague a year ago.\nCharges Against Nikhil GuptaAccording to authorities in the United States, Nikhil Gupta is said to have claimed involvement in the movement of international narcotics and trafficking.\nAuthorities in the Czech Republic arrested Gupta on June 30 this year in accordance with an extradition treaty between the US and the Czech Republic.\nThrough his attorney, Nikhil Gupta has also denied the charges and said he has been \"unfairly charged\"."}, {"id": "4db7e7b2-e766-4777-8145-1e0f38066f3d", "title": "Taiwan Keeping Watch After Chinese Submarine Surfaces", "date": "2024-06-18 05:15", "url": "https://www.marinelink.com/news/taiwan-keeping-watch-chinese-submarine-514549", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "c71a812f-baac-44a8-b233-445ebb058227", "title": "Woodstock woman accused of stabbing little brother guilty on all counts", "date": "2024-06-18 00:45", "url": "https://www.fox5atlanta.com/news/cherokee-county-woman-accused-stabbing-little-brother-guilty-all-counts", "domain": "fox5atlanta.com", "domain_classification": "Unknown", "message": "articleA Woodstock woman who was accused of stabbing her little brother so severely that she punctured his lung was found guilty on all counts.\nShe was charged with stabbing her brother in his left chest, abdomen and shoulder with a knife that she grabbed from her purse during an argument.\nWoodstock and Cherokee County officials provided lifesaving treatment for the teen who was rushed to the hospital with a punctured left lung.\nIt resulted in a collapsed lung, a lacerated blood vessel in the lung and bruising and lacerations to the lung.\nA Cherokee County jury heard from six witnesses from the State, including her brother, their mother, three law enforcement officers and the trauma surgeon, and one witness from the Defense, Williams."}, {"id": "dbd0fd1b-795f-4faf-89ba-c60b8eded2a3", "title": "Drone strike ignites oil depot fires in Russia Rostov region", "date": "2024-06-18 06:00", "url": "https://tribune.com.pk/story/2472255/drone-strike-ignites-oil-depot-fires-in-russias-rostov-region", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Several oil storage tanks caught fire following a drone attack early Tuesday in Azov, a town located in Russia's southern Rostov region.\nVasily Golubev, the governor of Rostov region adjacent to Ukraine, stated on Telegram that initial reports indicate no casualties.\nThe Russian Ministry of Emergency Situations reported on Telegram that the fire had spread over an area of 5,000 cubic meters.\nUkraine, which lacks the vast arsenal of missiles available to Moscow, has focused on making long-range drones to strike targets deep inside Russia.\nUkraine has recently increased the frequency of its attacks on Russian soil, particularly against oil refineries."}, {"id": "e4859405-eeeb-4f1a-b4a4-f65f988369bf", "title": "Ukraine claims its drones hit a Russian oil facility , sparking a huge blaze", "date": "2024-06-18 13:15", "url": "https://www.wsls.com/news/world/2024/06/18/ukraine-claims-its-drones-hit-a-russian-oil-facility-sparking-a-huge-blaze/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Vasily Golubev, the governor of the Rostov region, said that a Ukrainian drone attack caused a fire at an oil reservoir.\nThe Emergencies Ministry said over 70 firefighters are fighting the blaze that covers the area of 5,000 square meters.\n(Russian Emergency Ministry Press Service via AP)KYIV – Ukraine claimed responsibility Tuesday for an overnight drone attack on a Russian oil facility that started a massive blaze in the latest long-range strike by Kyiv’s forces on a border region.\nRecommended VideosThe attack set fire to an oil reservoir in Russia’s Rostov region and more than 200 firefighters were at the scene, according to Rostov Gov.\nThe drones targeted two Rostov oil depots that have 22 oil reservoirs, the official said."}, {"id": "4c84c498-3cf8-44c1-adac-5ddced88894f", "title": "Putin hails N . Korea support for Ukraine war ahead of Pyongyang visit", "date": "2024-06-18 05:15", "url": "https://www.ewn.co.za/2024/06/18/putin-hails-n-koreas-support-for-ukraine-war-ahead-of-pyongyang-visit", "domain": "ewn.co.za", "domain_classification": "Unknown", "message": "SEOUL - Russian President Vladimir Putin on Tuesday hailed North Korea for \"firmly supporting\" Moscow's war in Ukraine ahead of a visit to Pyongyang set to boost defence ties between the two nuclear-armed countries.\nHistoric allies since North Korea's founding after World War II, Moscow and Pyongyang have drawn closer after Russia's invasion of Ukraine in 2022, with Putin increasingly isolated internationally and looking for friends.\nPutin's trip has triggered \"concern\" in Washington after the Pentagon said last month debris analysis proved North Korean ballistic missiles were already being fired on Ukraine's battlefields.\nBoth countries are under rafts on UN sanctions, Pyongyang since 2006 over banned nuclear and ballistic missile programs, and Moscow over the invasion of Ukraine.\n\"We know North Korean ballistic missiles are still being used to hit Ukrainian targets [and] there could be some reciprocity here that could affect security on the Korean peninsula,\" he said."}, {"id": "593ff04d-9fd6-4819-a5a2-45d5f99c43e8", "title": "CNO , CMC Sign Amphibious Warfare Ship Terms of Reference , Strengthening Navy - Marine Corps Team", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240617-usnpr01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "CNO, CMC Sign Amphibious Warfare Ship Terms of Reference, Strengthening Navy-Marine Corps TeamUS Navy - Press Release17 June 2024Chief of Naval Operations (CNO) Adm. Lisa Franchetti and Commandant of the Marine Corps (CMC) Gen. Eric Smith signed a Memorandum of Understanding (MOU) on Amphibious Warfare Ship Terms of Reference, June 12, 2024, demonstrating Navy and Marine Corps full alignment and commitment to amphibious ship readiness.\nWASHINGTON, (June 17, 2024) - Chief of Naval Operations (CNO) Adm. Lisa Franchetti and Commandant of the Marine Corps (CMC) Gen. Eric Smith signed a Memorandum of Understanding (MOU) on Amphibious Warfare Ship Terms of Reference, June 12, 2024, demonstrating Navy and Marine Corps full alignment and commitment to amphibious ship readiness.\n\"The Marine Expeditionary Unit is our crown jewel, and our Amphibious Warfare Ships are the most versatile, adaptable naval platforms in our inventory,\" said Smith.\n\"This MOU ensures consistency and uniformity in how each service talks about amphibious force readiness so we can better plan and execute naval operations.\n\"Our Navy - Marine Corps team generates combat power with global impact - unmatched by any other naval force every day,\" said Franchetti."}, {"id": "95f30967-2a89-4b5c-9843-4c825d4778f8", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 05:15", "url": "https://www.bostonglobe.com/2024/06/17/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-second-time-this-month/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "It said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South’s military observed increased North Korean construction activities along their heavily armed border to install suspected anti-tank barriers, reinforce roads and plant land mines.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nAdvertisementThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "b8962c0c-b596-4581-b904-9319644a3881", "title": "Hamas is devolving from a terror army to a guerilla force", "date": "2024-06-18 04:00", "url": "http://www.israelnationalnews.com/news/391700", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "“Hamas has no chance of standing against the IDF’s power on the battlefield, and therefore shifted to guerrilla tactics,” he said.\nFrom these hiding spots, said Inbar, Hamas fighters launch attacks on Israeli forces, aiming to inflict casualties and avoid direct confrontation.\nHamas is employing classic, age-old tactics of guerilla warfare,” Roggio said.\nThis depletion has forced Hamas to adapt its strategy, avoiding prolonged skirmishes with Israeli forces and instead focusing on hit-and-run attacks, according to the report.\nPeter Lerner, a spokesperson for the IDF, noted in the report that the IDF is adapting to Hamas’s transformation."}, {"id": "201487dd-8ad7-4df0-b736-4d8efdbf6182", "title": "Hamas is devolving from a terror army to a guerilla force", "date": "2024-06-18 06:30", "url": "https://www.israelnationalnews.com/news/391700", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "“Hamas has no chance of standing against the IDF’s power on the battlefield, and therefore shifted to guerrilla tactics,” he said.\nFrom these hiding spots, said Inbar, Hamas fighters launch attacks on Israeli forces, aiming to inflict casualties and avoid direct confrontation.\nHamas is employing classic, age-old tactics of guerilla warfare,” Roggio said.\nThis depletion has forced Hamas to adapt its strategy, avoiding prolonged skirmishes with Israeli forces and instead focusing on hit-and-run attacks, according to the report.\nPeter Lerner, a spokesperson for the IDF, noted in the report that the IDF is adapting to Hamas’s transformation."}, {"id": "c730df5f-1022-4ba6-ab06-5b7527a6d5a4", "title": "South Korean soldiers fire warning shots after North Korean troops", "date": "2024-06-18 04:30", "url": "https://apnews.com/article/north-korea-south-korea-border-tensions-warning-shots-2aa0eaef30dbc5801d5e787205b577a0", "domain": "apnews.com", "domain_classification": "International", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South’s military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "5cd76493-5f94-4a7e-9bba-2f3dab36aca2", "title": "South Korean Soldiers Fire Warning Shots after North Korean Troops Intrude for 2nd Time This Month", "date": "2024-06-18 07:00", "url": "https://www.newsmax.com/world/globaltalk/north-korea-south-korea-border-tensions-warning-shots/2024/06/18/id/1169098/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday’s incident occurred in a different area along the central frontline region.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "a75a26ea-2b12-4ae1-afbd-976e396c48aa", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 08:15", "url": "https://www.newsday.com/news/nation/north-korea-south-korea-border-tensions-warning-shots-x16337", "domain": "newsday.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire.\nSouth Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts."}, {"id": "c5d9fb72-59ed-4fd4-bb50-1d25a9b2e071", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.news4jax.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "b54006bf-c24a-4d2d-b2ae-51ea3c976eb5", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/18/fgn15-koreas-ld-tensions.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Seoul, Jun 18 (AP) South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border on Tuesday for the second time this month, South Korea's military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South's military didn't spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday's incident occurred in a different area along the central frontline region.\nIt said it doesn't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "61c87b2e-f253-42db-8a7a-551a378d55b8", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:30", "url": "https://www.smdailyjournal.com/news/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this/article_cd05d3f8-f236-57f6-a3ab-0a29d3055957.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "194e0bae-0a78-4e87-b7cf-b14fed9840d8", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for second time this month", "date": "2024-06-18 04:15", "url": "https://www.theglobeandmail.com/world/article-south-korean-soldiers-fire-warning-shots-after-north-korean-troops/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday’s incident occurred in a different area along the central front line region.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "0ca6dece-ecf7-4739-b28b-0f71b6f17439", "title": "US Aircraft Carrier Captain Playfully Counters Houthi False Online Claims of Hitting His Ship", "date": "2024-06-18 11:45", "url": "https://www.theepochtimes.com/world/us-aircraft-carrier-captain-playfully-counters-houthis-false-online-claims-of-hitting-his-ship-5670021", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "The other half of the information warfare effort has been Mr. Hill himself, a native of Quincy, Massachusetts, something noticeable immediately in his South Boston accent.\nAfter one false Houthi claim, Mr. Hill responded by posting images of cinnamon rolls and muffins in the bakery on board the Eisenhower—a subtle jab at the claims.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Mr. Hill said.\nAnd as far as the Houthi forces watching his postings, Mr. Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\n“I came to a revelation at some point in my career that, one of the things that all humans require is to be loved and valued,“ Mr. Hill said."}, {"id": "18fd4ce7-a71a-4e87-b9f0-be312121225d", "title": "South Korean Soldiers Fire Warning Shots After North Korean Troops Intrude for a 2nd Time this Month", "date": "2024-06-18 13:15", "url": "https://www.military.com/daily-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-2nd-time-month.html", "domain": "military.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "2c6567c0-5bf1-42b2-abe1-a68d1bf05ead", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.ksat.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "fc1bbb52-844c-47a8-b807-076846905c23", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 05:30", "url": "https://www.local10.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "local10.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "d8b719cf-d19c-41ba-9e0a-a33be37ad661", "title": "US aircraft carrier captain playfully counters Houthi false online claims of hitting his ship | News , Sports , Jobs", "date": "2024-06-18 03:15", "url": "https://www.mauinews.com/wire/?category=5187&ID=329141", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "The Houthis and social media accounts supporting them repeatedly have falsely claimed they hit or even sank the carrier in the Red Sea.\nWhile on board for about a day and a half, journalists escorted by sailors crisscrossed the nuclear-powered ship’s 1,092-foot (332-meter) length.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\n“My sailors, my ships are priceless — that’s not a calculus I want a captain to have,” said Capt.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "40fdcb97-c98e-4dbd-b171-edd5ed4b67cb", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:30", "url": "https://www.clickorlando.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "77403750-1af9-48d8-9b4e-cf16796b3236", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error | World News", "date": "2024-06-18 13:00", "url": "https://indianexpress.com/article/world/south-korean-soldiers-fire-north-troops-cross-border-9399711/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "21505126-7e89-415e-84e9-f18855c3c15e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 05:30", "url": "https://isp.netscape.com/news/world/story/0001/20240618/2aa0eaef30dbc5801d5e787205b577a0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in errorSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "e050a83e-2f55-4286-97a6-e88ac6d6eb76", "title": "How many F - 35s to buy ? Draft defense bills disagree", "date": "2024-06-18 00:45", "url": "https://www.defensenews.com/air/2024/06/17/how-many-f-35s-to-buy-draft-defense-bills-disagree/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Air Force’s FY25 budget proposal requested money to buy 42 F-35As, and the Navy and Marine Corps budgets would buy 13 F-35Bs and 13 F-35Cs.\nThe House’s version of the NDAA would drastically slash F-35 purchases, cutting the initial order down to 58.\nThe Air Force said those older Block 20 F-22s are not combat-capable and would cost too much to prepare for a fight.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "d47a624e-4858-4a52-8af8-9fcefc4acd04", "title": "Taiwan military drones unlikely to hasten US  hellscape  against mainland Chinese attack", "date": "2024-06-18 06:45", "url": "https://www.scmp.com/news/china/politics/article/3267023/taiwan-drones-unlikely-hasten-us-hellscape-against-mainland-chinese-attack", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The report said private contractors will provide second-generation short-range uncrewed aerial vehicles (UAVs), as well as miniature, target acquisition, surveillance, ship-based and land-based drones for military use.\nTaiwanese soldiers deploy an unmanned aerial vehicle during a drill simulating defence of an attack from the Chinese mainland.\nAccording to Lu, Taiwan is intensifying its efforts to keep pace with the mainland and the US, both of which are extensively using UAVs.\nBeijing regards Taiwan as part of China, to be reunited with the mainland by force, if necessary.\n“The military will continue to acquire various types of drones through multiple channels to rapidly build combat capabilities for defence operations,” he said."}, {"id": "d465d3a5-c0aa-4f64-87ac-5870b13b1514", "title": "UK approval of arms export licences to Israel dropped sharply at start of Gaza war , lowest in 13 years – Firstpost", "date": "2024-06-18 11:30", "url": "https://www.firstpost.com/world/uk-approval-of-arms-export-licences-to-israel-plunged-at-start-of-gaza-war-lowest-in-13-years-13783617.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AdvertisementThe United States and Germany increased arms sales to Israel after the start of the war with the Palestinian group Hamas in October last year.\nThis compares with the government approving 20 million pounds of arms sales to Israel for the same period in 2022, including small arms ammunition and components for combat aircraft, according to government data.\nAdvertisementMembers of Britain’s parliament and human rights groups have criticised the government for the lack of public information about arms sales to Israel since the start of the conflict.\nAdvertisementHe has resisted calls to halt arms transfers to Israel but has said the government adheres to a “very careful licensing regime”.\nBritain is expected to provide information about arms sales to Israel in the first half of this year in the coming months."}, {"id": "744aca42-0e56-4fcb-ba7c-4f5e5ab70796", "title": "BAE Systems Solves Issues : Marines Prepare for Next - Gen Amphibious Vehicle Deployment", "date": "2024-06-18 13:30", "url": "https://sofrep.com/news/bae-systems-solves-issues-marines-prepare-for-next-gen-amphibious-vehicle-deployment/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "#USMC pic.twitter.com/iYeE9AAw2oA #MarineCorps Amphibious Combat Vehicle (ACV) operated by Marines with the ACV Transition Training Unit (TTU) enters the water at @MCIWPendletonCA , June 21.\nFor decades, the Amphibious Assault Vehicle ( AAV ) has been the backbone of the Corps’ amphibious operations.\nWe’re talking about the new face of amphibious warfare, with the introduction of the Amphibious Combat Vehicle (ACV) variants.\nWe’re talking about the new face of amphibious warfare, with the introduction of the Amphibious Combat Vehicle (ACV) variants.\nA #MarineCorps Amphibious Combat Vehicle (ACV) operated by Marines with the ACV Transition Training Unit (TTU) enters the water at @MCIWPendletonCA, June 21."}, {"id": "e444c041-16f1-45b9-bdc3-d56b97e38622", "title": "France rethinks military light - drone acquisition as Army falls behind", "date": "2024-06-18 11:15", "url": "https://www.yahoo.com/news/france-rethinks-military-light-drone-105123364.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "All aerial drones that France sold to Ukraine were developed in-house by manufacturers without development input from the French armed forces, retired Maj. Gen. Claude Chenuil, a fomer military-acquisition executive, said during a round table discussion at Eurosatory.\nThe defense budget law included a target for the Army to have 3,000 tactical drones by 2025.\nThe directorate’s acquisition service is looking into financing of technology bricks that could underpin the development of new systems, he said.\nFour French drone makers – Parrot, Eos Technologie, Delair and Hexadrone – have delivered drones to Ukraine, where they seem to be doing “a good job,” Mancini said.\nFrance would need to finance a strategic reserve that would pay for maintaining an industrial capacity to scale up drone production in case of need, he said."}, {"id": "39bd3f18-c767-45f2-9364-61def0ec6c81", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:30", "url": "https://www.yahoo.com/news/south-korean-soldiers-fire-warning-030408052.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "76e877a4-a3fd-4fa9-b371-3fbc5ebd9d5a", "title": "South Korean Soldiers Fire Warning Shots After North Korean Troops Intrude for 2nd Time This Month", "date": "2024-06-18 04:30", "url": "https://www.news18.com/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-8935837.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "South Korean soldiers on Tuesday fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire.\nThe South’s military said it has been observing increased North Korean construction activity in frontline border areas, such as installing suspected anti-tank barriers, reinforcing roads and planting land mines."}, {"id": "cf4fbbf9-cadb-4202-9f44-c62041f91c3c", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.voanews.com/a/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/7660116.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals' heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South's military didn't spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday's incursion occurred in a different area along the central front-line region.\n\"Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,\" the joint chiefs said in a statement."}, {"id": "a0dc4686-9daa-458a-9cf6-4be4ad339edb", "title": "Arakan Army tells residents to evacuate ahead of attack on western Myanmar city", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/myanmar/2024/myanmar-240617-rfa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Arakan Army tells residents to evacuate ahead of attack on western Myanmar cityA battle for the administrative center of Maungdaw township follows the recent seizure of nearby junta camps.\nThe Arakan Army, or AA, told residents on Sunday that they should evacuate their homes by 9 p.m.\nThe Arakan Army has recently seized control of all junta camps in surrounding Maungdaw township, including several key border posts.\nResidents told RFA that Rohingya in junta uniforms and weapons have been seen at military camps inside the city.\nThey're facing shortages of food and medical supplies, an aid worker told RFA on condition of anonymity because of security reasons."}, {"id": "ceaf9fe7-1c2e-438d-a93f-827f1ef2bb21", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:30", "url": "https://www.startribune.com/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/600374230/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals' heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South's military didn't spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday's incursion occurred in a different area along the central front-line region.\n''Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,'' the joint chiefs said in a statement."}, {"id": "cac0f155-1132-4642-971b-bb6d936afedb", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:45", "url": "https://www.clickondetroit.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "90532082-ec5c-4be4-9f77-93448dbed671", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month | iNFOnews", "date": "2024-06-18 05:45", "url": "https://infotel.ca/newsitem/as-koreas-tensions/cp1699135774", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in errorVisitors gather to watch North Korean side from the Unification Observation Post in Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(AP Photo/Ahn Young-joon)Original Publication Date June 17, 2024 - 8:06 PMSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "0cfdeb5c-ddc8-4431-8098-a0c6d9dbce0f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month – Winnipeg Free Press", "date": "2024-06-18 03:45", "url": "https://www.winnipegfreepress.com/world/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nA North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "ceecbc14-cbd6-467e-a36b-0f2f96bf1eef", "title": "Taiwan President Tells Military Cadets to Be Ready to Defend Island Sovereignty", "date": "2024-06-18 03:00", "url": "https://www.theepochtimes.com/china/taiwan-president-tells-military-cadets-to-be-ready-to-defend-islands-sovereignty-5670037", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "‘Only with sovereignty can there be a country, and only with Taiwan can there be the Republic of China,’ Taiwanese President Lai Ching-te said.\n“The highest mission is to bravely shoulder the important responsibility of protecting Taiwan and maintaining peace and stability across the Taiwan Strait,” President Lai said.\nThe ROC Military Academy, previously known as the Whampoa Military Academy, was founded in China on June 16, 1924.\nIn his speech, President Lai pledged to strengthen the island’s national defense, continue pushing for defense reform, and improve the military’s combat effectiveness.\n“We reaffirm that maintaining peace and stability across the Taiwan Strait is indispensable to international security and prosperity."}, {"id": "4e4bfa64-13b9-4640-b9a7-9d9668497104", "title": "United Aircraft Corporation Delivers Another Batch of Su - 34 Jets to Russian Defense Ministry", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240617-sputnik03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "United Aircraft Corporation Delivers Another Batch of Su-34 Jets to Russian Defense MinistrySputnik News20240617Russia's Sukhoi Su-34 multirole fighter-bomber aircraft is designed by the Sukhoi Design Bureau.\nThe United Aircraft Corporation (UAC) has delivered a fresh batch of Su-34 frontline bombers to the Russian Defense Ministry under a state defense contract.\nThese bombers are currently in great demand in the air defense sector.\nThe Su-34 fighter-bomber is designed to destroy ground and air targets, as well as infrastructure protected by air defenses and located at a considerable distance from the home airfield.\nRussia's Sukhoi Su-34 is widely regarded as one of the most advanced and effective fighter-bomber aircraft in the world."}, {"id": "befa9f43-a809-42f2-86eb-d4fe624b9379", "title": "South Korea fires warning shots after North Korea soldiers cross border", "date": "2024-06-18 04:00", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/south-korean-fires-warning-shots-after-north-korean-soldiers-cross-border/articleshow/111071797.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "South Korean forces fired warning shots after North Korean troops breached the heavily guarded military demarcation line close to the border on Tuesday, according to a report from the Yonhap news agency which cited information from the country's Joint Chiefs of Staff.\nSouth Korean soldiers responded by broadcasting warnings and firing warning shots, prompting the North Korean soldiers to retreat.\nFollowing the incident, the South's military did not observe any further suspicious activities.This incident follows a similar incident that occurred on June 11, when South Korean soldiers fired warning shots to deter another group of North Korean soldiers who briefly crossed the MDL.\nAccording to the Joint Chiefs of Staff, Tuesday's incident took place in a different area along the central frontline region.\nThe South's military believes that the North Korean soldiers did not intentionally intrude across the border, and the North did not return fire.In recent weeks, the South's military has observed an increase in North Korean construction activity along the frontline border areas."}, {"id": "43f0e945-daf5-4889-ae2f-15c45b10cf0d", "title": "SKorea soldiers fire shots after NKorea troops intrude", "date": "2024-06-18 05:30", "url": "https://www.canberratimes.com.au/story/8666684/skorea-soldiers-fire-shots-after-nkorea-troops-intrude/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The South also fired warning shots last Tuesday after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday's incident occurred in a different area along the central frontline region.\nIt said it doesn't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "20863cd2-c96a-42ff-9eaf-b133e4a0a4c9", "title": "UK Conservative Party braces for brutal civil war", "date": "2024-06-18 03:45", "url": "https://www.politico.eu/article/uk-general-election-conservative-party-tories-rishi-sunak-successor/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Some activists fear the prospect of a Donald Trump-style takeover by radically-minded right-wingers sympathetic to the upstart Nigel Farage, leader of the rival Reform UK party.\nOthers speculate that an electoral collapse on this scale could threaten the very existence of the near-200-year-old Conservative Party.\nThat means the coming battle to pick Sunak’s successor will be one which defines the Conservatives’ future for years to come.\n“The stakes couldn’t be higher,” said Tim Bale, professor of politics at Queen Mary University London, and author of “The Conservative Party after Brexit.”“The contest between the two sides has the potential to really catch fire.”Under current party rules it will be down to those remaining Tory MPs who manage to hold onto their seats on July 4 to whittle down the various leadership candidates to a shortlist of two, before grassroots party members pick the winner in a final head-to-head ballot.\nThat gives Tory MPs an outsized role in shaping the party’s future — meaning that exactly who keeps their seat at the election, and who fails to do so, will be key to the outcome."}, {"id": "8c93255b-e94c-4ffd-b0b0-b38304a1941f", "title": "Without Putin what did Zelenskyy Swiss peace summit achieve ? ", "date": "2024-06-18 12:30", "url": "https://www.foxnews.com/opinion/no-putin-what-did-zelenskyys-swiss-peace-summit-achieve", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Approximately 100 nations, primarily from the Western world, participated in the Ukraine peace summit in Switzerland this past weekend.\nIs peace between Russia and Ukraine finally achievable now that the biggest war in Europe since World War II is well into its third year?\nNone of the key stakeholders in the conflict – Moscow, Kyiv, and Washington – are serious about achieving a peace settlement in Ukraine.\nUkrainian President Zelenskyy, at the close of the peace summit, stated that he would start negotiations \"tomorrow\" if Russia pulls out of \"our territories.\"\nMost Ukrainians continue to support the war effort, although their support of President Zelenskyy has declined."}, {"id": "cea1d8ce-47d5-456b-bd8d-31861b54c62a", "title": "Defense minister backs Lai warning against  defeatism  ", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240617-cna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Defense minister backs Lai's warning against 'defeatism'ROC Central News Agency06/17/2024 07:11 PMTaipei, June 17 (CNA) A day after President Lai Ching-te (čł´ć¸…ĺľ·) warned against \"capitulationism\" in a speech to military cadets, Taiwan's defense minister said it was a necessary posture given the country's asymmetrical defensive strategy.\nFormer President Ma Ying-jeou (é¦¬č‹±äąť) also said China had that strategy in a speech in 2020.\nDefense Minister Wellington Koo (éˇ§ç«‹é›„) did not explain that either, but said Monday prior to a legislative hearing that Taiwan accepting China's strategy of \"the first battle being the last battle\" would indeed be \"capitulationist.\"\nKoo also took issue with the criticism of Lai's speech by the foundation of former President Ma.\n(By Matt Yu, Luke Sabatier and Evelyn Kao)Enditem/lsNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "3f7b4c89-5a42-4d01-b15d-018395614bfa", "title": "US Navy showcases Sea Hunter Unmanned Surface Vehicle at LA Fleet Week", "date": "2024-06-18 04:00", "url": "https://seapowermagazine.org/us-navy-showcases-sea-hunter-unmanned-surface-vehicle-at-la-fleet-week/", "domain": "seapowermagazine.org", "domain_classification": "Unknown", "message": "By Program Executive Office Unmanned and Small Combatants (PEO USC) Public AffairsLOS ANGELES — The U.S. Navy showcased Sea Hunter, part of the U.S. Navy’s unmanned surface vehicles (USV) prototype fleet, during Los Angeles Fleet Week, May 22-27.\n“We welcomed the opportunity to showcase Sea Hunter at this year’s LA Fleet Week and to highlight our work in unmanned technology,” said Capt.\nMatthew Lewis, program manager of the Unmanned Maritime Systems program office.\nLast August, Sea Hunter was one of four USV prototypes to operate in Integrated Battle Program 23.2, the Navy’s third multi-domain unmanned capabilities exercise.\nDuring the exercise, Sea Hunter and three additional USVs transited to Japan and Australia for testing, operations with manned warships and experiments with advanced payloads."}, {"id": "29d3e169-ab9f-40d6-b9f1-8d6822082d37", "title": "South Korea Fires Warning Shots after North Korean Troops Intrude", "date": "2024-06-18 08:00", "url": "https://time.com/6989649/south-north-korea-fire-warning-shots-border-tensions/", "domain": "time.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South’s military observed increased North Korean construction activities along their heavily armed border to install suspected anti-tank barriers, reinforce roads and plant land mines.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nRead More: Why China, Russia, and North Korea Joining Forces in the Indo-Pacific Isn’t a Prelude to WarThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "d6b1c0da-cf4f-4a4c-a450-fb57a676abe2", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month – Brandon Sun", "date": "2024-06-18 04:45", "url": "https://www.brandonsun.com/world/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "A North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nA North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "cd65198c-6b5a-4139-a019-a7da8494c975", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:45", "url": "https://www.pentictonherald.ca/news/world_news/article_de5a7c0a-ceb8-5d62-9f55-2e9d5a0679fe.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "ca72ffc7-ce7f-403a-8fee-cf98f1c73b89", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:45", "url": "https://www.airdriecityview.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098278", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "c18bf141-bdf0-4bc3-825b-a10a544f434a", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://toronto.citynews.ca/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South’s military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "ff0fa251-9132-467b-8337-2ebb9702ee20", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.tricitynews.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "c5dd32bf-b528-4e53-af68-a6fa5ae88b61", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.newwestrecord.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "a8c55565-405d-4451-a4dc-e3b64fb141cb", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:00", "url": "https://www.richmond-news.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "29bec02a-4159-4f0f-9147-45125e6c7859", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:30", "url": "https://www.stalbertgazette.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098278", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "db229d2b-7906-403a-a9fc-6a0ba28fe973", "title": "Why the Royal Newfoundland Regiment was  so lucky  to have Padre Thomas Nangle", "date": "2024-06-18 09:15", "url": "https://www.cbc.ca/player/play/video/9.6424924", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Why the Royal Newfoundland Regiment was ‘so lucky’ to have Padre Thomas NangleNewsDuration 1:23Thomas Nangle was a priest in St. John’s who ministered to many of the same men with whom would later head into battle.\nBut historian Gary Browne says Nangle’s greatest act of service may have come after the war.\nOn June 25, CBC will air a special documentary about Newfoundland’s National War Memorial.\nIn this excerpt, Browne speaks about Nangle’s heroism."}, {"id": "2267a73b-3a8e-4a64-be8f-db71f70d7b21", "title": "Indian Astrologer Stands By Prediction , Claims World War 3 Is Days Away", "date": "2024-06-18 05:00", "url": "https://www.ndtv.com/offbeat/indian-astrologer-stands-by-prediction-claims-world-war-3-is-days-away-5913389", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "An Indian astrologer, dubbed \"New Nostradamus\", is gaining attention after predicting that the start of World War III is mere days away.\nNow, he has claimed that Tuesday, June 18, has the strongest planetary stimulus to trigger World War III.\nSpeaking to the outlet, Mr Kumar said that he used the Vedic astrology chart which is based on Hindu culture to make his predictions.\n\"Watch the developing war scenario in hotspots across the globe as days pass by,\" Mr Kumar said as per the New York Post.\nFor 2024, Nostradamus has even predicted that the climate crisis would get worse."}, {"id": "3ce79db7-9829-407a-9178-97435642654e", "title": "Where heroes lie - The Hindu", "date": "2024-06-18 04:30", "url": "https://www.thehindu.com/education/where-heroes-lie/article68277098.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "“Well, that’s just the way colonisers bulldozed their way everywhere changing things without anyone’s consent,” shrugged Amma, just as they reached their destination in a taxi.\nThe Japanese were stopped from making their way to the plains of India during the battle of Kohima in April 1944.\nIt is said the British and Indian side lost around 4000 men and the Japanese 7000,” noted Appa.\nAs we were ruled by the British, their war became our war and it came to our doorstep at this very place we are standing,” said Appa.\nThey reached the epitaph near the entrance:When You Go Home, Tell Them of Us and Say,/For Your Tomorrow, We Gave Our Today."}, {"id": "7afb5f51-a2cf-4143-916e-bb64ff245e7a", "title": "Links 6 / 18 / 2024 | naked capitalism", "date": "2024-06-18 11:45", "url": "https://www.nakedcapitalism.com/2024/06/links-6-18-2024.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "New York Times (Dr. Kevin)#COVID-19Climate/EnvironmentChina?\nGet ready folks, the world is about to be divided again.\nMy understanding is 3/4 of the divorces in the US are initiated by the wife.\nAttack, attack, attack DRB (Anthony L).\nOur No Longer Free PressThe Bezzle(Kevin W)Class WarfareAntidote du jour (via):And a bonus (guurst):See yesterday’s Links and Antidote du Jour here."}, {"id": "35ecd7a8-0957-45ef-ad62-7dcb2e93aa9f", "title": "Before his summit with North Korea Kim , Putin vows theyll beat sanctions together | World News", "date": "2024-06-18 13:00", "url": "https://indianexpress.com/article/world/summit-north-koreas-kim-putin-vows-beat-sanctions-together-9399862/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "In the North Korean capital of Pyongyang, the streets were decorated with Putin’s portraits and Russian flags.\nBefore heading to North Korea, Putin traveled to Yakutsk, a city in eastern Russia, where he reportedly planned to meet regional Gov.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met in September.\nObservers said the shipment violated a UN resolution banning the supply of luxury items to North Korea.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "4d6116fd-ba23-420b-b586-4af3292c11c5", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:00", "url": "http://www.middletownpress.com/news/world/article/south-korean-soldiers-fire-warning-shots-after-19519481.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP) AP A North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "2c887d1e-ef0d-44bb-b15e-eea9ea6796ca", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:30", "url": "https://www.mymotherlode.com/news/asia/3377162/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in error View PhotoSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South’s military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or wounded an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "a604bf9f-342a-4caa-83fd-22a858fa1e60", "title": "Caratacus : Roman Britain Greatest Rebel", "date": "2024-06-18 13:15", "url": "https://www.historyextra.com/membership/roman-britains-greatest-rebel/", "domain": "historyextra.com", "domain_classification": "Unknown", "message": "Amminus, who had apparently controlled Kent, fled to Rome, leaving Togidubnus and Caratacus in conflict.\nBy AD 43 Caratacus was becoming the most successful king in Britain, but his swift rise to power was unsettling his Roman paymasters.\nPlautius, we are told by Roman writer Dio Cassius, prevailed over both Caratacus and Togidubnus, urging both to comply with the wishes of the emperor.\nRealising that where the fugitive went the Roman army was soon to follow, she arrested Caratacus and handed him over to Rome.\nTacitus relates the arrival of Caratacus in Rome, and Claudius’s attempts to milk the situation for all it was worth."}, {"id": "d320f41a-26eb-420c-b9dd-8566fa2270fb", "title": "Israeli troops roam  like ducks in shooting range , unprepared for long war : Officer", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240617-presstv07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli troops roam 'like ducks in shooting range', unprepared for long war: OfficerIran Press TVMonday, 17 June 2024 10:15 AMA top Israeli officer has slammed the inability of the Tel Aviv regime to continue the devastating war in the Gaza Strip, saying that Israeli troops are unprepared and roam \"like ducks in a shooting range\" in the besieged territory.\nIsraeli media cited an unnamed officer as saying that the Israeli army is not prepared to continue the war in Gaza, saying, \"Troops roam on rooftops, near windows and inside homes in Gaza like ducks in a shooting range.\"\n\"Poor and failing management [of the Gaza war] has brought about an awkward situation, the gravity of which is unprecedented and unmatched,\" Oded Forer commented.\nIn the same context, Israeli journalist Ohad Hemo said Hamas has successfully rebuilt its presence in the Gaza Strip.\nIsraeli soldier commits suicide after return from GazaAdditionally, Israeli media outlets reported that an Israeli soldier had committed suicide a day after returning from Gaza."}, {"id": "a6e7a222-34d3-4fd6-9995-a8fa545338d4", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 08:00", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217527/Taiwan-keeping-watch-after-Chinese-submarine-surfaces-in-Taiwan-Strait", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "REUTERS/Stringer/File PhotoTaiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "3c6728ab-7416-4487-9713-26851f2be031", "title": "  Any means necessary : First Black female pilot in Air Force reflects on storied career", "date": "2024-06-18 12:30", "url": "https://www.yahoo.com/news/means-necessary-first-black-female-113048805.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "'Any means necessary': First Black female pilot in Air Force reflects on storied careerThe odds were stacked against her.\nIn 1981, Theresa Claiborne sits outside of a T-38 aircraft as she was training to become the first Black female pilot in the Air Force.\nClaiborne went on to become the second Black female pilot at United Airlines and went on to become a captain as well.\nAll of the Black female pilots come in their uniforms to take the girls up into the sky and hopefully inspire them early.\nThis article originally appeared on Abilene Reporter-News: Grit: First Black female pilot in Air Force reflects on storied career"}, {"id": "f0f33747-4a31-4afb-ad61-d92fb28d89f2", "title": "In a first , CDS releases its blueprint for warfare in cyberspace", "date": "2024-06-18 14:00", "url": "https://www.thehindu.com/news/national/in-a-first-cds-releases-its-blueprint-for-warfare-in-cyberspace/article68303975.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Acknowledging that cyberspace has emerged as a crucial and challenging domain in modern warfare, the Chief of Defence Staff General Anil Chauhan released India’s first joint doctrine for cyberspace operations during a meeting of the Chiefs of Staff Committee on Tuesday.\nThe joint doctrine is a keystone publication that will guide commanders of the armed forces in conducting cyberspace operations in today’s complex military operating environment, the Defence Ministry said in a statement.\nShared sovereigntyUnlike territorial limits in the traditional domains of warfare, such as land, sea, and air, cyberspace is a “global common and hence has shared sovereignty”, the statement noted.\nHostile actions in cyberspace can impact the nation’s economy, cohesion, political decision making, and the ability to defend itself.\n“This doctrine lays emphasis on understanding military aspects of cyberspace operations and provides conceptual guidance to commanders, staff and practitioners in the planning, and conduct of operations in cyberspace, as also to raise awareness in our warfighters at all levels,” the Ministry said."}, {"id": "4631bdb3-8fde-4221-bf62-1366e18f0b0c", "title": "How the first few hours of World War 3 declared by Iran and Russia will happen as Indian Nostradamus predicts it will start today", "date": "2024-06-18 11:30", "url": "https://www.dailystar.co.uk/news/world-news/how-first-few-hours-ww3-33052660", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\n(Image: LinkedIn/Canva)He claimed that the war was due to start on June 18 – today – and reiterated that same claim on Friday.\n“It's difficult to predict with certainty how long it would take for the UK to be invaded in a hypothetical World War III scenario."}, {"id": "645c9453-4ac3-4638-9e29-d212ba92eac1", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.kelownadailycourier.ca/news/world_news/article_9ea627ad-8549-5b89-aed0-16bf476f528b.html", "domain": "kelownadailycourier.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "92b50c81-4615-40b8-87ae-53d0b17837e1", "title": "South Korean troops fire warning shots as soldiers from North cross border", "date": "2024-06-18 10:00", "url": "https://guernseypress.com/news/world-news/2024/06/18/south-korean-troops-fire-warning-shots-as-soldiers-from-north-cross-border/", "domain": "guernseypress.com", "domain_classification": "Unknown", "message": "South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border on Tuesday for the second time this month, South Korea’s military said.\nThe South’s military observed increased North Korean construction activities along their heavily armed border to install suspected anti-tank barriers, reinforce roads and plant land mines.\nA North Korean military guard post is seen from Paju, South Korea, near the border (AP Photo/Ahn Young-joon)The South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the Military Demarcation Line (MDL).\nIt said it does not believe the North Korean soldiers intruded into the border intentionally and that the North did not return fire.\nThe South’s military has said the border area is dense with overgrown trees and plants that may have obscured the visibility of North Korean soldiers and caused them to cross the border."}, {"id": "c171002f-5623-4642-8174-2b6ee83b51d4", "title": "Remains of War of 1812 soldiers returned", "date": "2024-06-18 08:00", "url": "https://www.upi.com/Archives/1988/07/01/Remains-of-War-of-1812-soldiers-returned/3924583732800/", "domain": "upi.com", "domain_classification": "Unknown", "message": "FORT ERIE, Ontario -- Flag-draped caskets containing the remains of 28 American soldiers killed and buried in Canada during the War of 1812 have been returned to U.S. soil.\nDark clouds hung overhead as Canadian, American and British flags flew at half-staff over Old Fort Erie, where American and Canadian forces engaged in battle 176 years ago, during an hourlong repatriation ceremony Thursday.\nAdvertisementGeorge Hees, minister of Veteran Affairs for Canada, transferred responsibility for the skeletal remains to Thomas Niles, U.S.\n'There can be no truer an epilogue to the War of 1812,' Hees said.\nFort Erie Mayor Heinz Hummel noted that 'since the guns became silent' after the War of 1812, Canada and the U.S. have 'lived in peace.'"}, {"id": "37753809-00d4-49a3-95d8-90baef10143a", "title": "Israel  lied  about  tactical pause  as Rafah crossing destroyed : Govt . ", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240617-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israel 'lied' about 'tactical pause' as Rafah crossing destroyed: Govt.\nThe Kerem Shalom crossing is the main entry point for incoming aid to southern Gaza.\nThe Rafah crossing, also in southern Gaza, is another entry point for humanitarian assistance into the besieged territory.\nThe Government Information Office in Gaza called for the opening of the Rafah crossing to facilitate the delivery of humanitarian assistance to the people in Gaza, especially those in its northern parts.\nIt added that the Zionist regime has destroyed the passenger halls at the Rafah crossing as part of its crimes against the Palestinians in the Gaza Strip."}, {"id": "571513d5-2cdf-49bf-a665-0d0766c59e9c", "title": "World War 3 : Will World War III start today or on June 29 ? Here what  Indian Nostradamu predicts", "date": "2024-06-18 05:45", "url": "https://economictimes.indiatimes.com/news/new-updates/will-world-war-iii-start-today-or-on-june-29-heres-what-indian-nostradamus-predicts/articleshow/111074006.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Global Tensions and the Astrologer's JustificationA Comparison with Nostradamus's Prophetic VisionsHow does the world end according to Nostradamus?\nHe views the Vedic astrology chart as a \"map of our karma,\" using planetary alignments to pinpoint significant events.\n\"Kumar's prophecy gains credence from recent global events.\nNostradamus, in his work \"Les Propheties\" (\"The Prophecies\"), is believed to have foreseen events for the year 2024, including severe weather events, global turmoil, and even a new pope.\nSo, watch the developing war scenario in hotspots across the globe as days pass by.”"}, {"id": "2e3b4a6f-e2eb-4b5d-b01d-eb1a7406f1ec", "title": "Gaza Conflict : Dozens killed in refugee camps as Israel intensifies Rafah assault", "date": "2024-06-18 12:00", "url": "https://www.firstpost.com/world/gaza-conflict-dozens-killed-in-refugee-camps-as-israel-intensifies-rafah-assault-13783400.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Israeli tanks were operating inside Tel Al-Sultan, Al-Izba, and Zurub areas in Rafah’s west, as well as Shaboura at the heart of the city.\nThey also continued to occupy the eastern neighbourhoods and outskirts as well as the border with Egypt and the vital Rafah border crossing.\nPalestinian health officials said one man was killed in the morning by Israeli fire on the eastern side of Rafah.\nThe air force struck dozens of targets across the Gaza Strip in the past day, it added.\nNetanyahu refuses to end the war before Hamas is eradicated and the hostages are freed."}, {"id": "9ebb1c36-3de1-44ef-a381-e47985692ebe", "title": "Israeli forces deepen Rafah invasion , kill 17 in central camps", "date": "2024-06-18 10:00", "url": "https://www.moneycontrol.com/news/world/israeli-forces-deepen-rafah-invasion-kill-17-in-central-camps-12751144.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "09bbb9b3-1230-418b-b14e-df41edb91c3d", "title": "Israeli air strikes kill at least 17 at Gaza refugee camps as tanks push deeper into Rafah", "date": "2024-06-18 11:30", "url": "https://www.theglobeandmail.com/world/article-israeli-air-strikes-kill-at-least-17-at-gaza-refugee-camps-as-tanks/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Residents reported heavy bombardments from tanks and planes in several areas of Rafah, where more than a million people had taken refuge before May.\nMost of the population has fled northwards since then as Israeli forces invaded the city.\nIsraeli tanks were operating inside Tel Al-Sultan, Al-Izba, and Zurub areas in Rafah’s west, as well as Shaboura at the heart of the city.\nPalestinian health officials said one man was killed in the morning by Israeli fire on the eastern side of Rafah.\nThe Israeli military statement did not comment directly on the 17 deaths but said forces continued to operate against militant factions in central Gaza areas."}, {"id": "93553230-66a7-44f0-a1ee-1803556830b5", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:30", "url": "https://www.tricitynews.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "7298e3c4-f2c0-490f-b3e8-dec3ed7fea1e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:30", "url": "https://www.fitzhugh.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "f4562500-34c1-4790-9aad-bbaf594478e5", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:15", "url": "https://www.richmond-news.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "fc4ed8ab-4a6b-4479-8fd3-9554cd67e321", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:45", "url": "https://www.airdriecityview.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "8d397dea-ed2e-4cd3-afa0-efaa7da480fe", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:45", "url": "https://www.stalbertgazette.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "d4453982-eb48-4d76-b51c-f9cb1ccda1ec", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.burnabynow.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "ec2a08db-ba89-410b-a441-02540c16938e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.thereminder.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "e9962da7-7abc-47df-8388-656290aa3662", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:15", "url": "https://www.piquenewsmagazine.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "piquenewsmagazine.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "a301b98d-19fd-40f2-abd6-77068a35f0f4", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:00", "url": "https://www.thompsoncitizen.net/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "fe2868d8-8881-447a-8b50-e153081ab94f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:00", "url": "https://www.princegeorgecitizen.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "ecf83fd0-c911-457e-89fa-e8222d15892d", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.prpeak.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "85cdacfd-868f-47f3-9f23-1adb6b17907f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 09:00", "url": "https://www.newwestrecord.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "3805873a-640e-4118-a267-ae462d0d9586", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:30", "url": "https://www.thereminder.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "a7419fad-c081-47aa-beac-869a11e4e404", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:15", "url": "https://www.coastreporter.net/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "03064c1e-6b7a-46ea-9763-05084f78608f", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:45", "url": "https://www.fitzhugh.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098278", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "f356521d-7ca1-41e3-be52-55ff43b78ff3", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:45", "url": "https://www.burnabynow.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "0c334d40-a8de-4a48-ae92-170bfe1faa15", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:45", "url": "https://www.piquenewsmagazine.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "piquenewsmagazine.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "fcd7ad3f-36ce-4a78-af25-e78a27a3ad48", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 12:00", "url": "https://www.ivpressonline.com/news/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error/article_8cd6797a-1af2-5964-be72-83b6f8573e4f.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "ca47c6e1-5713-453c-9ea3-9e65ff881f0c", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 12:00", "url": "https://www.squamishchief.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "2ac5e49f-1692-47e1-bfa3-dd7becc938f3", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 12:00", "url": "https://www.tricitynews.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "bd721ae0-73e8-42df-bc40-baebb7059815", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 13:15", "url": "https://www.stalbertgazette.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098278", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "e1ca8fc1-c036-4e4d-96e8-b085d21abb19", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 13:00", "url": "https://www.airdriecityview.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098278", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nThe soldiers retreated after the South broadcasted warnings and fired warning shots, and the South’s military didn’t spot any suspicious activity after that, the joint chiefs said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "4b8d7136-6db0-4432-8807-3ffb3c8d5fd1", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 14:00", "url": "https://www.newwestrecord.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error-9098283", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month , the South's military said.\nSEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border.\nThe Joint Chiefs of Staff said that Tuesday’s incursion occurred in a different area along the central front-line region.\n“Our military is closely monitoring North Korean military activities in the front-line area while guarding against accidental situations,” the joint chiefs said in a statement."}, {"id": "5e335c77-4275-493e-a57b-ae14c28892ee", "title": "Estonia jails university professor from Russia for spying for Moscow", "date": "2024-06-18 12:45", "url": "https://abcnews.go.com/International/wireStory/estonia-jails-university-professor-russia-spying-moscow-111210317", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A university professor has been jailed in Estonia after being found guilty of spying for RussiaA university professor was jailed Tuesday in Estonia after being found guilty of spying for Russian military intelligence.\nThe Baltic nation, which borders Russia, has recently seen a rise in sabotage, electronic warfare and spying, all blamed on Moscow.\nEstonian officials are extremely hawkish about the threat from Russia and have convicted a number of people of spying for Russia in recent years.\nMorozov was arrested in January and accused of being involved in intelligence activities which undermined Estonia's security.\nPolitical relations between Russia and Estonia have been icy since 1991 when Estonia regained its independence from the former Soviet Union."}, {"id": "1cbbabb1-3814-4e23-bd17-293de97e4812", "title": "Israeli Forces Deepen Rafah Invasion , Kill 17 In Historic Refugee Camps", "date": "2024-06-18 12:00", "url": "https://www.ndtv.com/world-news/israeli-forces-deepen-rafah-invasion-kill-17-in-historic-refugee-camps-5915555", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Residents reported heavy bombardments from tanks and planes in several areas of Rafah, where more than a million people had taken refuge before May.\nMost of the population has fled northwards since then as Israeli forces invaded the city.\nPalestinian health officials said one man was killed in the morning by Israeli fire on the eastern side of Rafah.\nThe Israeli military statement did not comment directly on the 17 deaths but said forces continued to operate against factions in central Gaza areas.\nNetanyahu refuses to end the war before Hamas is eradicated and the hostages are freed."}, {"id": "f6bf64fd-79a7-48ff-8484-eab33d1fa1be", "title": "FirstUp : Putin in North Korea after 24 years , Modi to address farmers in Varanasi ... Top headlines today", "date": "2024-06-18 02:30", "url": "https://www.firstpost.com/explainers/firstup-putin-in-north-korea-after-24-years-modi-to-address-farmers-in-varanasi-top-headlines-today-13783329.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Russian president Vladimir Putin is set to visit North Korea this week for the first time in 24 years.\nReutersRussian President Vladimir Putin will visit North Korea today for the first time in 24 years.\nPutin will then visit Vietnam on 19 and 20 June, the Kremlin said.\nThis momentous event marked the end of monarchical rule in Egypt and the establishment of a republic led by President Muhammad Naguib.\nThe revolution, spearheaded by the Free Officers Movement, sought to modernise Egypt, end British influence, and address social inequalities."}, {"id": "4a235bf3-d4cb-46c7-8dd8-814ad28c4744", "title": "Gaza war : Israeli forces deepen Rafah invasion , kill 17 Palestinians in central camps", "date": "2024-06-18 11:15", "url": "https://www.scmp.com/news/world/middle-east/article/3267103/gaza-war-israeli-forces-deepen-rafah-invasion-kill-17-palestinians-central-camps", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Most of the population has fled northwards since then as Israeli forces invaded the city.\nThey also continued to occupy the eastern neighbourhoods and outskirts, as well as the border with Egypt and the vital Rafah border crossing.\nPalestinian health officials said one man was killed in the morning by Israeli fire on the eastern side of Rafah.\nThe Israeli military statement did not comment directly on the 17 deaths but said forces continued to operate against militant factions in central Gaza areas.\nNetanyahu refuses to end the war before Hamas is eradicated, and the hostages are freed."}, {"id": "9c483485-53bf-4e6a-a00b-e1a57614738a", "title": "Russians Withdrawing Troops From Important Direction Due To Successful AFU Attacks", "date": "2024-06-18 11:30", "url": "https://charter97.org/en/news/2024/6/18/599366/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Russians Withdrawing Troops From Important Direction Due To Successful AFU Attacks 18.06.2024, 8:2610,378The ISW has revealed the details.\nRussian occupants are shifting troops from Donetsk direction to Kharkiv direction because of successful attacks of the Ukrainian armed forces.\nThe occupiers, on the other hand, reportedly continued offensive operations north of Kharkiv near Liptsy and north-east of Kharkiv near the centre of Vovchansk and Vovchanski Khutori.\nAt the same time, according to the report, the occupants advanced west of Razdolivka in Donetsk Region.\nThus, Russian troops advanced south of Sokil (north-west of Avdiivka) and slightly advanced north of Umanske (west of Avdiivka)."}, {"id": "4c722c46-d48d-4bf6-b1f6-1ae8a89d129c", "title": "IAF To Get More Power With Gen - 5 Fighter", "date": "2024-06-18 04:30", "url": "https://www.rediff.com/news/special/iaf-to-get-more-power-with-gen-5-fighter/20240618.htm", "domain": "rediff.com", "domain_classification": "Unknown", "message": "IMAGE: A model of the 5th Generation Advanced Medium Combat Aircraft.\nPhotograph: ANI PhotoThe US has its F-22 Raptor, and F-35 Lightning II; Russia has its Sukhoi-57; China has its J-20 Chengdu, and J-31 Shenyang -- all of them 5th-generation (Gen-5) combat aircraft built to rule the skies.\nWith the experience gained from building the Tejas light combat aircraft (LCA), New Delhi is pushing its aircraft production monopoly, Hindustan Aeronautics Limited, to join hands with the Defence Research and Development Organisation's Aeronautical Development Agency (ADA) to build an Indian Gen-5 fighter, dubbed the Advanced Medium Combat Aircraft (AMCA).\nIMAGE: Models of India's futuristic indigenous aircraft including the 5th Generation Advanced Medium Combat Aircraft, LCA Mark 2 and naval Twin Engine Deck-based fighter jet showcased at the India Pavilion at Aero India in Bengaluru.\nPhotograph: ANI PhotoEngines for super-cruisingAnother key AMCA design challenge is to develop an indigenous, 'super-cruising' engine."}, {"id": "39b2d8ba-72e8-4458-b8c0-9774faa4d1df", "title": "Gaza war : At least 17 Palestinians killed by Israeli airstrikes on refugee camps", "date": "2024-06-18 13:30", "url": "https://www.theweek.in/news/world/2024/06/18/gaza-war-at-least-17-palestinians-killed-by-israeli-airstrikes-on-refugee-camps.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "At least 17 Palestinians in two of Gaza's refugee camps were killed in Israeli strikes on Tuesday.\nHeavy bombardments were reported in several areas as the Israeli forces pushed deeper into the southern city of Rafah.\nAccording to the Gaza health ministry, at least 37,372 Palestinians have been killed and around 85,452 wounded in Israeli attacks on Gaza.\nOver 500 Palestinians including 133 children had been killed by Israeli security forces since October last year raising concerns of unlawful killings.\nIsrael has intensified its Rafah attacks as Prime Minister Benjamin Netanyahu dissolved the war cabinet, tasked with the duty of overseeing the Gaza war."}, {"id": "58c81f46-f09e-4919-adce-08eeb0ffe4a4", "title": "Estonia jails university professor from Russia for spying for Moscow – Winnipeg Free Press", "date": "2024-06-18 13:00", "url": "https://www.winnipegfreepress.com/world/2024/06/18/estonia-jails-university-professor-from-russia-for-spying-for-moscow", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A university professor was jailed Tuesday in Estonia after being found guilty of spying for Russian military intelligence.\nThe Baltic nation, which borders Russia, has recently seen a rise in sabotage, electronic warfare and spying, all blamed on Moscow.\nEstonian officials are extremely hawkish about the threat from Russia and have convicted a number of people of spying for Russia in recent years.\nMorozov was arrested in January and accused of being involved in intelligence activities which undermined Estonia’s security.\nPolitical relations between Russia and Estonia have been icy since 1991 when Estonia regained its independence from the former Soviet Union."}, {"id": "4da389e3-2e59-4a0b-b8b7-52f52fc90077", "title": "Israeli forces deepen Rafah invasion , kill 17 in central camps - World", "date": "2024-06-18 11:45", "url": "https://www.brecorder.com/news/40308857/israeli-forces-deepen-rafah-invasion-kill-17-in-central-camps", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO: Israeli airstrikes on Tuesday killed at least 17 Palestinians in two of the Gaza Strip’s historic refugee camps and Israeli tanks pushed deeper into the enclave’s southern city of Rafah, residents and medics said.\nRafah offensive would lead to ‘humanitarian disaster’: UN chiefMost of the population has fled northwards since then as Israeli forces invaded the city.\nPalestinian health officials said one man was killed in the morning by Israeli fire on the eastern side of Rafah.\nThe Israeli military said it was continuing “precise, intelligence-based activity” in Rafah, killing many Palestinian gunmen over the past day in close-range combat and seized weapons.\nThe air force struck dozens of targets across the Gaza Strip in the past day, it added."}, {"id": "0a5ca879-7816-4303-9b01-f7242c71ee6e", "title": "Ranked : The 5 Worst Bombers of All Time", "date": "2024-06-18 01:15", "url": "https://nationalinterest.org/blog/buzz/ranked-5-worst-bombers-all-time-210494", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "These aircraft suffered from design flaws, poor performance, and high accident rates, marking them as some of the worst bombers in history.\nThese aircraft suffered from design flaws, poor performance, and high accident rates, marking them as some of the worst bombers in history.\nThe Worst Bombers in History: Disastrous Designs and Fatal Flaws\"The bomber emerged in the twentieth century as one of the most feared weapons in the world.\nLet’s consider some of the worst bombers of all time.\nBlackburn B-26 BothaPerhaps the worst bomber the Royal Air Force ever flew, the Blackburn B-26 Botha debuted in 1938 and performed poorly from the jump."}, {"id": "2507f01c-caa6-4b22-90e1-1855a3b17eac", "title": "Distributed Control System Market Anticipated to Reach $26 . 7", "date": "2024-06-18 11:00", "url": "https://www.openpr.com/news/3542814/distributed-control-system-market-anticipated-to-reach-26-7", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Distributed Control System Market Anticipated to Reach $26.7 billion by 2028 | Leading key players are Siemens, ABB, Schneider Electric, Emerson Electric Cohttps://www.marketsandmarkets.com/Market-Reports/distributed-control-system-market-239430160.htmlhttps://www.marketsandmarkets.com/pdfdownloadNew.asp?id=239430160https://www.marketsandmarkets.com/requestsampleNew.asp?id=239430160The global distributed control system market is projected to reach USD 26.7 billion by 2028 from an estimated USD 19.9 billion in 2023, at a CAGR of 6.1% during the forecast period.\nIts main function is to enable plant control through a network of supervisory and control elements distributed throughout the facility.\nDuring the forecast period, the services segment is projected to experience the highest growth in the Distributed Control System (DCS) market.\nDCS services encompass a wide range of offerings, such as maintenance, installation, upgrades, plant asset management, alarm management, lifecycle services, migration services, consulting, simulation, training services, and technical assistance.\nThe distributed control systems (DCS) plays an crucial role in this modernization effort by enabling advanced automation and control capabilities within the power grid."}, {"id": "881a4d4d-8426-4511-b5ac-48c97d6f389b", "title": "Estonia convicts a university professor from Russia for spying for Moscow", "date": "2024-06-18 14:00", "url": "https://www.startribune.com/estonia-jails-university-professor-from-russia-for-spying-for-moscow/600374306/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "A university professor was jailed Tuesday in Estonia after being found guilty of spying for Russian military intelligence.\nThe Baltic nation, which borders Russia, has recently seen a rise in sabotage, electronic warfare and spying, all blamed on Moscow.\nEstonian officials are extremely hawkish about the threat from Russia and have convicted a number of people of spying for Russia in recent years.\nMorozov was arrested in January and accused of being involved in intelligence activities which undermined Estonia's security.\nPolitical relations between Russia and Estonia have been icy since 1991 when Estonia regained its independence from the former Soviet Union."}, {"id": "5e91e8dd-e700-4738-91bd-d38052638fe0", "title": "WATCH : 40 Years Since the Battle of Orgreave", "date": "2024-06-18 13:15", "url": "https://consortiumnews.com/2024/06/18/watch-40-yrs-since-the-battle-of-orgreave/", "domain": "consortiumnews.com", "domain_classification": "Unknown", "message": "The Battle of Orgreave during the 1984 British miners strike took place exactly 40 years ago today, when police attacked pickets at a coking plant outside Sheffield.\nThey were addressed by Arthur Scargill, who led the miners’ union during the strike, Gareth Pierce, an attorney who represented arrested Orgreave strikers, and a host of other speakers.\nOn this day 40 years ago, 8,000 picketing miners were confronted by 6,000 police officers at the Orgreave coking plant.\nOn this day in 1984, thousands of picketing miners were attacked by riot police in the Battle of Orgreave.\n40 years on, we are still fighting for the truth, for justice, and for our right to strike."}, {"id": "e9004ff3-276f-4120-8dc7-a6978437737b", "title": "James May 20th Century - Dave", "date": "2024-06-18 03:30", "url": "https://www.tvguide.co.uk/schedule/4eef8f69-0035-5066-afd4-b5f84bec57ea/james-mays-20th-century", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "James May's 20th CenturyDave 9:30 AM to 10:00 AM Tuesday 18 June Share Add toCalendar +Take Cover!\nSeason 1 Episode 4 of 6 S SubtitlesThe presenter examines which ideas had the biggest influence on warfare in the last century, by taking a look at the difficulty of hitting targets from a biplane and flying an RAF jet.\nHe also discovers the qualities of camouflage paint and tries to use infrared cameras to search out a group of soldiersJames May's 20th Century airs on Dave at 9:30 AM, Tuesday 18 June .\n(Subtitles.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "aeb27878-0b20-4efb-9a53-9bd51d70455a", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 11:30", "url": "https://medicinehatnews.com/news/world-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this monthBy Kim Tong-hyung, The Associated Press on June 18, 2024.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL."}, {"id": "0cf5d83c-3b97-4ad0-b65e-73b19cef2e75", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:30", "url": "https://lethbridgeherald.com/news/world-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this monthBy Kim Tong-hyung, The Associated Press on June 18, 2024.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said."}, {"id": "0e91156a-2d39-436c-9c2c-120bee999344", "title": "IMRA - Monday , June 17 , 2024 IDF COS Ridicules Ben Gvir For Questioning Efficacy of Spatial Security In Tactical Pause", "date": "2024-06-18 04:00", "url": "http://www.imra.org.il/story.php?id=74180", "domain": "imra.org.il", "domain_classification": "Unknown", "message": "Ben Gvir was concerned that this daily 11 hour \"window\" would be exploitedby Hamas and others.\nRather than seriously address Ben Gvir's remarks, the Chief of Staffridiculed Ben Gvir for asking questions given that Ben Gvir had not servedas a commander in the IDF.\nMinister Avi Dichter joined in by suggesting that Ben Gvir should simplyaccept what the COS said.\nBen Gvir: We saw who was wrong before 7.10 and who was right when he wantedto constantly carry out targeted eliminations.\nSource:Security Cabinet - Moriah Asraf & Doron Kadosh23,167 subscribersMoriah Asraf & Doron KadoshDoron - 053-8312637Moriah - 050-4617948________________________________________IMRA - Independent Media Review and AnalysisSince 1992 providing news and analysis on the Middle East with a focus onArab-Israeli relationsWebsite: www.imra.org.il"}, {"id": "948e4d7a-725c-45a5-89fe-adf6065556c6", "title": "Bandai Namco rather glorious - looking Baten Kaitos RPG remasters are now on Steam", "date": "2024-06-18 11:15", "url": "https://www.rockpapershotgun.com/bandai-namcos-rather-glorious-looking-baten-kaitos-rpg-remasters-are-now-on-steam", "domain": "rockpapershotgun.com", "domain_classification": "Unknown", "message": "Another was Baten Kaitos on Gamecube, which - yes, we are finally getting to the point here - has just been rereleased on Steam in the shape of a Baten Kaitos I & II HD Remaster.\nI can't remember what I traded Baten Kaitos for either, which again, says it all.\nBattle-system-wise, Baten Kaitos is notable for smushing together active-timey combat with card-battling - the essence of your items and abilities are stored inside Magnus cards which are played in real time.\nEnjoy Baten Kaitos with even more vibrant visuals.\n・ All-new menu screens!"}, {"id": "8a493369-579b-453c-9779-f314cc2465e0", "title": "Black Myth : Wukong impresses with stunning visuals and intense boss battles · TechNode", "date": "2024-06-18 13:15", "url": "https://technode.com/2024/06/18/black-myth-wukong-demo-play-impresses-with-stunning-visuals-and-intense-boss-battles/", "domain": "technode.com", "domain_classification": "Unknown", "message": "Details: The demo of Black Myth: Wukong lasted for two and a half hours.\nSeveral domestic gaming media outlets and players shared their impressions of the demo on various social media platforms in the aftermath.\nEach battle is unique throughout the two and a half hours of gameplay, according to local gaming media outlet Youxi Putao.\nThe videos show that the combat system of Black Myth: Wukong emphasizes fast-paced and agile battles, particularly highlighting evasion and jumping.\nThe physical deluxe and collector’s editions of Black Myth: Wukong for PC are priced at RMB 820 ($113) and RMB 1,998 ($276) respectively."}, {"id": "5bd2ab35-b357-4613-96b7-0e9b9e254d2b", "title": "The Simpsons - Sky Showcase HD", "date": "2024-06-18 13:15", "url": "https://www.tvguide.co.uk/schedule/822a13b9-c2b9-5cd8-9e1b-bc763ebc9d61/the-simpsons", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "The SimpsonsSky Showcase HD 7:00 PM to 7:30 PM Tuesday 18 June Share Add toCalendar +My Mother the Carjacker Season 15 Episode 2 of 22 Repeat S SubtitlesHomer tries to help his fugitive mother Mona evade justice, but unwittingly delivers her into the hands of the police - who promptly put her on trial for sabotaging Mr Burns' germ warfare laboratory back in the 1960s.\nWith the guest voice of Glenn CloseThe Simpsons airs on Sky Showcase HD at 7:00 PM, Tuesday 18 June .\n(Subtitles, repeat.)\nLearn more about The Simpsons and other movie/drama on our drama pageTopics Movie ➝ Drama Animated Movie ➝ Drama Comedy Sitcom"}, {"id": "0d34bd78-9ce3-4169-949c-b0c2f706a8cd", "title": "Russia - Ukraine War : Delhi Court Denies Bail to Man Accused of Trafficking Indians to Russia for War Roles", "date": "2024-06-18 04:30", "url": "https://www.newsx.com/national/russia-ukraine-war-delhi-court-denies-bail-to-man-accused-of-trafficking-indians-to-russia-for-war-roles/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "A Delhi court has rejected the bail plea of Michael Elangovan Anthony, a Mumbai resident, accused of trafficking Indian citizens to Russia to serve in combat roles against Ukraine.\nThe court, presided over by Special Judge Atul Krishna Agrawal, highlighted the seriousness of the charges and the potential risk of evidence tampering if Anthony were released on bail.\nThe CBI’s investigation revealed that these individuals were deployed in active war zones against their will, putting their lives in severe jeopardy.\nThe court’s decision to deny bail was significantly influenced by the potential for Anthony to obstruct the ongoing investigation.\nThe judge emphasized the need to prevent any interference with the collection of further evidence and to avoid any assistance to other accused individuals still evading the law."}, {"id": "79deae1c-9f03-4299-a89b-a7cc80278c65", "title": "Column : What was the point of the Ukraine peace summit ? ", "date": "2024-06-18 11:45", "url": "https://www.chicagotribune.com/2024/06/18/column-ukraine-peace-summit-depetris/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "The entire event was less about making peace and more about elevating Ukraine’s own position for what an eventual peace should look like.\nAnd compromises will need to be forged if the war in Ukraine is to end.\nWith respect to Russia and Ukraine, we aren’t near that point yet.\nThe Ukrainian government rejected the proposal immediately, calling it an attempt by Putin to divert attention from the summit in the Swiss mountains.\nZelenskyy talks a lot about a “just peace” for Ukraine, which sounds good in theory."}, {"id": "ee1b1442-7add-414f-9847-456f933d8780", "title": "Louisiana Congressional Republicans back failed plan to return racist statue to Arlington Cemetery", "date": "2024-06-18 11:30", "url": "https://www.nola.com/gambit/news/the_latest/louisiana-congressional-republicans-back-failed-plan-to-return-racist-statue-to-arlington-cemetery/article_0bdba6e4-2ce8-11ef-9653-638300386fe6.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "It's not a deterrent and someone is gonna get hurtYes.\nIt shows you can't run from policeI'm more worried about a pothole wrecking my carVoteView Results"}, {"id": "e6367bc4-f09f-4086-b0a2-3841e3cd05b9", "title": "June 17th - 2024 Presidential Politics - Resistance Day 1246", "date": "2024-06-18 03:00", "url": "https://theconservativetreehouse.com/blog/2024/06/17/june-17th-2024-presidential-politics-resistance-day-1246/comment-page-4/", "domain": "theconservativetreehouse.com", "domain_classification": "Unknown", "message": "In an effort to keep the Daily Open Thread a little more open topic we are going to start a new daily thread for “Presidential Politics”.\nPlease use this thread to post anything relating to the JoeBama Administration and Presidency.\n“This is no small thing, to restore a republic after it has fallen into corruption.\nAnd if we do not try, it most certainly won’t be done.\nThe Founders’ Republic, and the larger war for western civilization, will be lost.”“But I tell you this: We will not go gently into that bloody collectivist good night."}, {"id": "c6853d71-4467-42f0-a93b-a04aa1963bee", "title": "The war between Russia and Ukraine Is Set to Grind on as a Peace Conference Packs Little Punch", "date": "2024-06-18 00:45", "url": "https://www.newsmax.com/globaltalk/russia-ukraine-war/2024/06/17/id/1168998/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "It did not zero in on the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nKyiv rejected those proposals as “absurd.”Zelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nRussia, after more than two years of fighting, has so far been unable to deliver a knockout punch and is looking abroad for help to fuel its war effort.\nWestern military analysts say Russia’s army lacks quality due to losses of junior officers in the fighting.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now."}, {"id": "5cc05beb-752c-434a-8a4b-a31b749567bc", "title": "US envoy Hochstein calls Lebanese - Israeli border situation  serious  ", "date": "2024-06-18 11:45", "url": "https://www.yahoo.com/news/us-envoy-hochstein-calls-lebanese-110854555.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Senior Advisor to the US President Amos Hochstein (L) meets with Lebanese Parliament Speaker Nabih Berri in Beirut.\n-/Parliament of Lebanon/dpaUS special envoy Amos Hochstein said Tuesday that his country was working to avoid \"a greater war\" between Israel and the pro-Iranian Hezbollah in south Lebanon, describing the situation as \"serious.\"\nThat is the effort here,\" Hochstein told reporters after holding talks with Lebanon's House Speaker Nabih Berri, a close ally of Hezbollah.\nHochstein has been trying to find a diplomatic solution between Israel and Hezbollah for months.\nSenior Advisor to the US President Amos Hochstein (L) meets with Lebanese Parliament Speaker Nabih Berri in Beirut."}, {"id": "a15f803a-a3c3-4ca2-ac9e-bbe4ebb8b494", "title": "PHOTOS : Soldiers recreate Utah Beach in annual obstacle course drill at Fort Carson", "date": "2024-06-18 03:15", "url": "https://gazette.com/military/fort-carson/photos-soldiers-recreate-utah-beach-in-annual-obstacle-course-drill-at-fort-carson/collection_d946ef55-b7df-596b-9aa6-e2d9a66c3915.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "You have permission to edit this collection."}, {"id": "bbd38a5b-715b-4749-9f40-22886b4379af", "title": "BEL Recruitment : Check Job Vacancies For Various Posts At Bharat Electronics Limited", "date": "2024-06-18 10:15", "url": "https://www.ndtv.com/education/bel-recruitment-check-job-vacancies-for-various-posts-at-bharat-electronics-limited-5914977", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Bharat Electronics Limited, a Government of India Enterprise under the Ministry of Defence and country's premier professional Electronics Company, is inviting applications for various positions.\nInterested and eligible candidates can visit the official website of the Bharat Electronics Limited for detailed information.\nThe exams for the various posts will begin at 9:15 am and get over at around 1:15 pm.\nThe complete details of the interview are available on the official website of the Bharat Electronics Limited.\nExecutive cadre for Chennai UnitBharat Electronics Limited (BEL) requires Ex-Servicemen on Fixed tenure basis in Executive cadre for Chennai Unit."}, {"id": "7cd07696-be7d-4761-b963-a15f31c77044", "title": "How the secret US anti - vax operation disrupted Sinovac distribution", "date": "2024-06-18 08:00", "url": "https://global.chinadaily.com.cn/a/202406/18/WS66712be7a31095c51c50985d_1.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Reuters identified 300 accounts on X (Twitter) matching descriptions shared by former US military officials familiar with the Philippines operation.\nMost social media accounts were created in the summer of 2020 and centered on the slogan #Chinaangvirus.\nThe anti-vax effort started in spring of 2020 expanding beyond Southeast Asia before it was terminated in mid-2021.\nSome of the set of fake social media accounts used by the US military \"were active for more than five years,\" according to Reuters.\nWhen the US military anti-vax operation kicked in, there were fewer than 20,000 detected cases in the country."}, {"id": "11582a82-127d-4ef7-b207-1637a06fe885", "title": "Rep . Wasserman Schultz :  There cant be an exception for Jewish victims  ", "date": "2024-06-18 11:30", "url": "http://www.israelnationalnews.com/news/391716", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Against the backdrop of a White House event discussing conflict-related sexual violence on Monday, US Representative Debbie Wasserman Schultz (D-FL) spoke to CNN's Dana Bash about the denial of the sexual violence perpetrated by Hamas terrorists against Israeli women on October 7th.\nIt is violating Israeli women.\"\nWasserman Schultz noted that she hosted a forum with Second Gentleman Douglas Emhoff during which representatives of the Israeli police showed videos taken by the terrorists of their acts of sexual violence.\nShe added: \"There can't be an exception for Jewish victims, there can't be an exception for Israelis.\nRep. Wasserman Schultz was also asked if she would be attending Prime Minister Netanyahu's address to Congress next month."}, {"id": "eea9e7e7-5916-4f3a-8cc7-5f8c96f6c4f8", "title": "Trash balloons and psychological warfare", "date": "2024-06-18 06:15", "url": "https://asianews.network/trash-balloons-and-psychological-warfare/", "domain": "asianews.network", "domain_classification": "Unknown", "message": "In fact, many experts believe propaganda broadcasting from the West as part of psychological warfare during the Cold War was instrumental in bringing down the Soviet Union and the Communist bloc in Eastern Europe.\nIn recent days, Pyongyang has sent hundreds of balloons filled with trash, including used toilet paper and cigarette butts, to the South.\nIn return, Seoul also decided to engage in psychological warfare.\nIn fact, anti-Pyongyang activists sent dozens of leaflet balloons recently in reaction to the North’s rubbish balloons.\nIn any case, Seoul should not rule out the possibility of engaging in old-style psychological warfare because it can work as a very viable bargaining chip."}, {"id": "e4266814-5a0a-45c9-b73d-c62732735e01", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 11:30", "url": "https://medicinehatnews.com/news/world-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in errorBy Kim Tong-hyung, The Associated Press on June 18, 2024.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border."}, {"id": "9f29a7f8-e5b0-4ebc-b9e1-4590e63a396d", "title": "South Korean soldiers fire warning shots after North Korean troops cross border , apparently in error", "date": "2024-06-18 13:15", "url": "https://lethbridgeherald.com/news/world-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-cross-border-apparently-in-error/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in errorBy Kim Tong-hyung, The Associated Press on June 18, 2024.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nTroops from the South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the border."}, {"id": "058e0cc7-7d81-4d17-abaf-ca80b68cef82", "title": "War between Russia and Ukraine set to grind on as a diplomatic conference packs little punch", "date": "2024-06-18 03:30", "url": "https://www.adn.com/nation-world/2024/06/17/war-between-russia-and-ukraine-set-to-grind-on-as-a-diplomatic-conference-packs-little-punch/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy walks during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nIt did not resolve the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nIt also faces challenges with insufficient manpower and a lack of fortifications, offering Russia the chance to make battlefield gains this summer.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now."}, {"id": "1450f59a-9028-46de-b597-87b1ab4bc635", "title": "Kremlin says NATO chief nuclear weapons remarks are an  escalation  ", "date": "2024-06-18 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240617-presstv02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Kremlin says NATO chief's nuclear weapons remarks are an 'escalation'Iran Press TVMonday, 17 June 2024 3:14 PMRussia has assessed the latest nuclear comments by the North Atlantic Alliance military bloc as an inadmissible \"escalation\" of ongoing political rivalry between world powers.\nThe Kremlin said on Monday the US-led NATO Secretary General Jens Stoltenberg's remarks pertaining to talks on deploying more nuclear weapons would only exacerbate the threat of atomic warfare.\n\"[A] world where Russia, China, and North Korea have nuclear weapons, and NATO does not, is a more dangerous world,\" the chief of the US-led North Atlantic Treaty Organization said.\nThey hold about 88 percent of the world's nuclear weapons, according to the Federation of American Scientists.\nThe United States has about 100 non-strategic B61 nuclear weapons deployed in five European countries - Italy, Germany, Turkey, Belgium, and the Netherlands, according to the Bulletin of the Atomic Scientists."}, {"id": "c402ccc4-029a-4e39-81bf-9d5cd23ed474", "title": "Before his summit with North Korea Kim , Putin vows theyll beat sanctions together – The Denver Post", "date": "2024-06-18 04:15", "url": "https://www.denverpost.com/2024/06/17/before-his-summit-with-north-koreas-kim-putin-vows-theyll-beat-sanctions-together/", "domain": "denverpost.com", "domain_classification": "Unknown", "message": "In the North Korean capital of Pyongyang, the streets were decorated with Putin’s portraits and Russian flags.\nBefore heading to North Korea, Putin traveled to Yakutsk, a city in eastern Russia, where he reportedly planned to meet regional Gov.\nBoth Pyongyang and Moscow deny accusations about North Korean weapons transfers, which would violate multiple U.N. Security Council sanctions that Russia previously endorsed.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met in September.\nObservers said the shipment violated a U.N. resolution banning the supply of luxury items to North Korea."}, {"id": "ab375441-2a2d-4a92-b902-b9129fcea86b", "title": "Israelis made to commit to no cooperation with arms sales , in Paris show", "date": "2024-06-18 10:00", "url": "https://www.ynetnews.com/business/article/byybcq0rc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Israelis visiting the Paris The Eurosatory 2024 arms show were made to sign a commitment they would not cooperate with Israeli companies that were banned from participation, over alleged war crimes.\nOrganizers said this was the result of a hasty decision taken because of the restrictions on Israeli participation, that was forced on them.\nA video from the event shows the area designated for the Israeli companies, now used as a storage space, located directly opposite the VIP room.\n2 View gallery Document Israeli visitors to Eurosatory 2024 made to signDespite the ban, the court's decision was not prominently displayed.\nInstead, a small sign was placed at the exit of the suburban train station leading to the exhibition."}, {"id": "b1b1dbac-abc2-4ff5-b145-cd177cdb8e55", "title": "Meeting fails at breakthrough to end war | The Arkansas Democrat - Gazette", "date": "2024-06-18 11:45", "url": "https://www.arkansasonline.com/news/2024/jun/18/meeting-fails-at-breakthrough-to-end-war/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine -- Russia and Ukraine are set to remain locked in battle for the foreseeable future after an international gathering billed as a first step toward peace delivered no eye-catching diplomatic breakthrough that might suggest a coming end to Europe's biggest conflict since World War II.\nIt did not resolve the bedrock -- and seemingly intractable, for now -- issue: Ukrainian land occupied by invading Russian forces.\nNear Kyiv's main war memorial, city resident Nataliia Kulbaka said she supported the idea of internationally backed peace talks but remained deeply distrustful of Russia.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nThat means the Kremlin's forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now."}, {"id": "9c95cf58-5895-4471-9fdc-42354089e52a", "title": "$10b crime fight boost", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240618/10b-crime-fight-boost", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Simpson’s presentation showcased the extensive efforts and substantial investments being made to improve crime fighting in Jamaica.\nAnother significant investment shared by the technical director on Monday was the state-of-the-art forensic pathology autopsy suite, on Orange Street, downtown Kingston, valued at $650 million, which he said is 98 per cent complete.\nA total of 63 sites are now connected to the microwave system, with a total investment of $1.5 billion.\nThe total investment, he revealed, represents $19.2 billion.\nSimpson pointed out that the multidimensional nature of the crime problem in Jamaica requires an integrated, multifaceted, and sustained response."}, {"id": "f3813bd3-70cb-4abc-a0e9-4ea874a35c4a", "title": "Before his summit with North Korea Kim , Putin vows theyll beat sanctions together", "date": "2024-06-18 04:15", "url": "https://www.news4jax.com/news/world/2024/06/18/before-his-summit-with-north-koreas-kim-putin-vows-theyll-beat-sanctions-together/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Recommended VideosIn the North Korean capital of Pyongyang, the streets were decorated with Putin’s portraits and Russian flags.\nBefore heading to North Korea, Putin traveled to Yakutsk, a city in eastern Russia, where he met regional Gov.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met in September.\nObservers said the shipment violated a U.N. resolution banning the supply of luxury items to North Korea.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "9910340a-4aa9-4034-b2b6-0c965e3b2326", "title": "Gaza conflict has caused major environmental damage , UN says", "date": "2024-06-18 12:30", "url": "https://www.yahoo.com/news/gaza-conflict-caused-major-environmental-114418868.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Each square metre of the Gaza Strip is now littered with more than 107 kilograms (236 lbs) of debris.\nThe U.N. assessment adds to concerns about the unfolding humanitarian crisis and the environmental costs of war, with Ukraine also recording widespread ecological damage over the past two years.\n\"Understanding the environmental impacts of war is a grand challenge of our time,\" said Eoghan Darbyshire, a senior researcher at the UK-based nonprofit Conflict and Environment Observatory.\nOver 92% of water in the Gaza Strip was then deemed unfit for human consumption.\nThe Gaza Strip had one of the highest densities of rooftop solar panels in the world, with the U.S.-based Centre for Strategic and International Studies estimating in 2023 some 12,400 rooftop solar systems."}, {"id": "5e30850b-5f91-4afc-b8f4-19b58e0771b4", "title": "Gaza conflict has caused major environmental damage , says UN", "date": "2024-06-18 12:45", "url": "https://www.moneycontrol.com/news/world/gaza-conflict-has-caused-major-environmental-damage-says-un-12751303.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "6d587c62-7bab-4edb-8f34-f003ad0de660", "title": "Before his summit with North Korea Kim Putin vows theyll beat sanctions together", "date": "2024-06-18 06:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/18/fgn16-nkorea-ld-russia.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Both Pyongyang and Moscow have denied accusations about North Korean weapons transfers, which would violate multiple UN Security Council sanctions Russia previously endorsed.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met for a summit in September.\nObservers said the shipment violated a UN resolution banning the supply of luxury items to North Korea.\nMoscow's ties with North Korea weakened after the 1991 Soviet collapse.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "b05d2fca-c9f4-40c0-b977-94176e939053", "title": "Ian McKellen Hospitalized After Falling Off Stage During West End Performance of Player Kings", "date": "2024-06-18 00:45", "url": "https://www.theatermania.com/news/ian-mckellen-hospitalized-after-falling-off-stage-during-west-end-performance-of-player-kings_1743281/", "domain": "theatermania.com", "domain_classification": "Unknown", "message": "Ian McKellen has been hospitalized after falling of the stage during a performance of Player Kings in the West End.\nAccording to spectators, McKellen, 85, fell off the front of the stage after losing his footing during the first act of the show, crying out in pain and halting the performance.\nAudience members were then evacuated with front-of-house staff tending to the actor as the house lights came up.\nThe event seemingly took place during the climactic battle that comes just before the intermission of the piece, a truncated version of Shakespeare’s Henry IV plays.\nThe show is due to tour after its run in the West End."}, {"id": "179c3bf4-a1ed-4601-bccb-4fece733ff15", "title": "UN : Gaza conflict caused major environmental damage - The Jerusalem Post", "date": "2024-06-18 14:00", "url": "https://www.jpost.com/israel-hamas-war/article-806754", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Each square metre of the Gaza Strip is now littered with more than 107 kilograms (236 lbs) of debris.\n\"Understanding the environmental impacts of war is a grand challenge of our time,\" said Eoghan Darbyshire, a senior researcher at the UK-based nonprofit Conflict and Environment Observatory.\nUNEP is mandated to assist countries with pollution mitigation and control in areas affected by armed conflict or terrorism.\nOver 92% of water in the Gaza Strip was then deemed unfit for human consumption.\nThe Gaza Strip had one of the highest densities of rooftop solar panels in the world, with the US-based Centre for Strategic and International Studies estimating in 2023 some 12,400 rooftop solar systems."}, {"id": "170cc3e6-8b72-48d2-b242-17a0c30fd002", "title": "EDITORIAL : Ukraine summit should be a start for negotiations to end the war | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-18 08:45", "url": "https://www.asahi.com/ajw/articles/15309657", "domain": "asahi.com", "domain_classification": "Unknown", "message": "Wrapping up the Summit on Peace in Ukraine, Ukrainian President Volodymyr Zelenskyy holds a news conference in Burgenstock, Switzerland, on June 16.\nThe reason the dialogue for peace has not progressed is solely due to Russia’s adamant refusal of calls for halting its relentless aggression against Ukraine.\nPutin effectively made unilateral demands for territorial cession by Ukraine, which are equivalent to a refusal to engage in dialogue.\nSwitzerland, the host country, narrowed the agenda for the Ukraine peace summit to three items: the safety of nuclear energy and installations; global food security; and issues related to deported and unlawfully displaced Ukrainian children and prisoners of war.\nDespite their critical stances toward Russia’s war, quite a few emerging countries remain distrustful and wary of the United States and Europe since they have arbitrarily imposed economic sanctions on Russia."}, {"id": "03b19d82-98cc-4308-b6dc-5eeddb8c064b", "title": "Putin praises North Korea for supporting war in Ukraine en route to rare visit", "date": "2024-06-18 14:00", "url": "https://www.cbc.ca/news/world/putin-north-korea-visit-1.7238033", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "After North Korea, Putin will visit Vietnam, which is also not a signatory to the jurisdiction of the ICC.\nIn this undated photo provided on Tuesday by the South Korea Defence Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\n(South Korea Defense Ministry/The Associated Press)Military, economic and other exchanges between North Korea and Russia have sharply increased since Kim visited Russia in September for a meeting with Putin, their first since 2019.\nWATCH l Explaining a foul dispute between the Koreas:Why North Korea’s dumping garbage on South Korea Duration 7:31 North Korea sent hundreds of balloons carrying cigarette butts, batteries and manure over South Korea.\nThe South's military said North Korea has been increasing construction activity in front-line border areas, such as installing suspected anti-tank barriers, reinforcing roads and planting land mines."}, {"id": "dfda9680-2df1-4064-8791-7df7b5edeb0c", "title": "Rheinmetall to provide Ukraine with Frankenstein tank capable of downing missiles and drones", "date": "2024-06-18 11:00", "url": "https://www.yahoo.com/news/rheinmetall-ukraine-frankenstein-tank-capable-075100470.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rheinmetall to provide Ukraine with Frankenstein tank capable of downing missiles and dronesA model depicting the probable appearance of the new Frankenstein tank.\nPhoto: RheinmetallRheinmetall AG, the German machine-building and arms industry concern, will provide Ukraine with hybrid Leopard tanks and Skyranger-Frankenstein air defence systems capable of shooting down Russian missiles and drones.\nSource: The TelegraphQuote: \"A new Frankenstein air defence tank designed to shoot down Russian drones and missiles is to be supplied to Ukraine by a top German arms firm.\nRheinmetall only recently developed the Skyranger, with sensors providing a 360-degree view of the battlefield and capable of countering drones.\nInitially, the plant will only repair Marder armoured vehicles and the older version of the Leopard tank."}, {"id": "30435b1d-486e-4e24-b54d-87d2d5a51898", "title": "UEFA Euro 2024 in Germany city guide : Leipzig", "date": "2024-06-18 11:45", "url": "https://www.bundesliga.com/en/bundesliga/news/uefa-euro-2024-in-germany-city-guide-leipzig-red-bull-arena-25372", "domain": "bundesliga.com", "domain_classification": "Unknown", "message": "With Leipzig's Red Bull Arena set to host games at UEFA Euro 2024 in Germany, get clued up on the stadium and the city in our guides.\nStadium: Red Bull ArenaLeipzig's Red Bull Arena has stood in its current form since 2004, when it was reconstructed within the city's old Zentralstadion in a manner similar to Chicago's Soldier Field.\nThe rebuild was done for the 2006 FIFA World Cup in Germany, where Leipzig hosted five games.\nHow to get to the Red Bull Arena:The Red Bull Arena is well connected in the Leipzig public transport network.\nRB Leipzig took over the stadium in 2010 and have called the Red Bull Arena home ever since."}]