[{"id": "c599cd88-34f2-408c-9009-61d1cd221b90", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537537.html", "message": "Image Source: IANS NewsGaza/Jerusalem, June 7 : At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside."}, {"id": "06d479f8-d0ea-494b-aa9f-12f59ce286d1", "title": "At least 30 killed after Israeli strikes on UN - run school in Gaza", "date": "2024-06-07 01:00", "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-un-school-attack-several-dead-injuredb-2550097-2024-06-07", "message": "He said 20 to 30 fighters were located in the compound, and many of them had been killed.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from the Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict."}, {"id": "94c28a4c-de30-46b5-9365-d357a74c41d2", "title": "Israeli strike on UN school kills dozens in Gaza", "date": "2024-06-07 00:15", "url": "https://www.swissinfo.ch/eng/israeli-strike-on-un-school-kills-dozens-in-gaza/79814706", "message": "Later Israel’s chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nU.S. and Israeli officials have told Reuters about half of Hamas’s forces have been killed in the conflict."}, {"id": "76dcd275-f4fd-4037-aa9a-9674f0780b1f", "title": "Gaza School Airstrike : Tragedy Amid Ceasefire Talks", "date": "2024-06-07 00:15", "url": "https://www.devdiscourse.com/article/law-order/2974510-gaza-school-airstrike-tragedy-amid-ceasefire-talks", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the U.N. school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nIn a separate Israeli airstrike on a house in Deir Al-Balah in central Gaza Strip, three Palestinians were killed and several others were wounded, medics said.\nThere was no immediate response from Israeli military on the two latest accounts.\nThe building was once used as a school, but with no schools now operating in Gaza it was being used as a shelter, he added."}, {"id": "3bbcf8ff-3372-45cd-b85c-1e14797f51aa", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://abcnews.go.com/Politics/deadly-gaza-strike-raises-us-concerns-civilians-despite/story?id=110907616", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPalestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public."}, {"id": "3556d606-f4ca-427a-8809-6faad56f546e", "title": "CNN Reports IDF Strike on Hamas HQ as  Israel Strike on UN School That Left Dozens Dead  ", "date": "2024-06-07 02:00", "url": "https://www.breitbart.com/the-media/2024/06/06/cnn-reports-idf-strike-on-hamas-hq-as-israel-strike-on-un-school-that-left-dozens-dead/", "message": "Eliminated: several Hamas and Islamic Jihad terrorists who embedded themselves inside of an @UNRWA school.\nIAF fighter jets conducted a precise strike on a Hamas compound embedded inside the school in the area of Nuseirat.\n“At least 45 people were killed in the strike, a spokesperson from Gaza’s Ministry of Health told CNN,” the story says.\nIn a statement, the IDF said:A short while ago, IAF fighter jets, directed by IDF intelligence and the ISA, conducted a precise strike on a Hamas compound embedded inside an UNRWA school in the area of Nuseirat.\nThe Times of Israel reported that the IDF believed 20-30 terrorists were in the compound at the time of the strike."}, {"id": "aa16dd76-234d-4878-a290-e0a8b887e273", "title": "Mayor of Gaza Nuseirat killed in Israeli strike – Ya Libnan", "date": "2024-06-07 00:45", "url": "https://yalibnan.com/2024/06/07/mayor-of-gazas-nuseirat-killed-in-israeli-strike/", "message": "Mayor of Nuseirat, Iyad al-Maghari was assented in the raid that targeted a municipal building in central Gaza.\nThe Palestinian mayor of Nuseirat refugee camp was killed by an Israeli airstrike, Palestinian medical and security sources said Thursday.\nIsraeli fighter jets carried out a raid on the Nuseirat camp, in which five Palestinians including the Mayor of Nuseirat, Iyad al-Maghari, were killed in the raid that targeted a municipal building in central Gaza.\n“The government of Israel has said that they are going to release more information about this strike, including the names of those who died in it.\nWe expect them to be fully transparent in making that information public,” State Department Spokesperson Matthew Miller said in a press briefing."}, {"id": "772477d8-1d56-48a0-8472-a95b22c57019", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://www.yahoo.com/news/deadly-gaza-strike-raises-us-012555174.html", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPHOTO: Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\nDeadly Gaza strike raises US concerns about civilians, despite precision munitions originally appeared on abcnews.go.com"}, {"id": "837f7f64-a616-4618-89a2-3d76bfb6f40f", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://knpr.org/npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "420c39af-1a3f-4a81-8b7e-7e904b31dc04", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.kalw.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "929b6d66-662a-433c-bb66-e588cb91db29", "title": "Dozens killed in Israeli strike on UN school in Gaza", "date": "2024-06-07 02:15", "url": "https://www.thestar.com.my/news/world/2024/06/07/dozens-killed-in-israeli-strike-on-un-school-in-gaza", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nIsrael's military assault on Gaza has killed more than 36,000 people, according to health officials in the territory, who say thousands more dead are feared buried under the rubble.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict."}, {"id": "f1227f7f-344f-49d2-8bf4-07d16f1ae392", "title": "Middle East Crisis update : Israel ups war talk against Hezbollah ; Yemen peace deal jeopardised as US moves to counter Houthis", "date": "2024-06-07 02:30", "url": "https://www.dailymaverick.co.za/article/2024-06-07-israel-ups-war-talk-against-hezbollah-yemen-peace-deal-jeopardised-as-us-moves-to-counter-houthis/", "message": "Israel ups war rhetoric as Hezbollah’s attacks raise alarmIsrael is escalating warnings against Hezbollah in Lebanon by threatening it could be forced into a war with the Iran-backed group, following increasingly deadly attacks.\n“Whoever thinks he can hurt us while we respond by sitting on our hands is making a big mistake,” said Netanyahu.\nBoth Hezbollah and Hamas are backed by Iran and designated as terrorist organisations by the US.\nThe US said on Wednesday it was pursuing a peaceful solution between Lebanon and Israel to prevent a full-scale conflict.\nIt described the attack as a precision strike on the school complex in the central Gaza area of Nuseirat."}, {"id": "4d91f04a-6b41-4741-abd3-e1b04ba82610", "title": "Israeli Strike Kills Dozens at Former School Where Civilians Were Sheltering | World News", "date": "2024-06-07 01:30", "url": "https://indianexpress.com/article/world/israeli-strike-kills-dozens-at-former-school-where-civilians-were-sheltering-9377149/", "message": "An Israeli airstrike hit a United Nations school complex in the central Gaza Strip that had become a shelter for thousands of displaced Palestinians, killing dozens of people, officials said early Thursday.\nLt. Col. Peter Lerner, an Israeli military spokesperson, said he was “not aware of any civilian casualties” as a result of the strike.\nIsraeli forces had twice postponed the strike so as to reduce civilian casualties, the military said.\nHe said the militants had used the compound to plan attacks on Israeli forces, although he did not provide specific examples.\nThe compound that was hit, in the central Gaza city of Nuseirat, had been operated by UNRWA, the main UN body that aids Palestinians in Gaza."}, {"id": "967c02e3-f7fd-4319-91bc-d97cf1b0ec4a", "title": "Press TVs news headlines", "date": "2024-06-07 04:00", "url": "http://www.presstv.ir/Detail/2024/06/07/726979/Heds", "message": "US-Israeli genocide in GazaMore Palestinian civilians are killed as Israel’s indiscriminate airstrikes and artillery fire continue to pound various parts of the besieged Gaza Strip.\nAn Israeli strike on a house in the Nusseirat refugee camp in central Gaza has killed the mayor of the camp and four members of his family.\nThe new attacks came after a deadly Israeli strike on a school in the Nusseirat camp killed at least 40 civilians, including nine women and 14 children.\nGaza school attackCondemnations are pouring in over Israel’s deadly airstrike on a UN-run school in central Gaza, which killed over 40 displaced Palestinian civilians sheltering there.\nUN Secretary General, Antonio Guterres condemned the attack as another horrific example of the price Palestinian civilians are paying to survive."}, {"id": "6fbc5523-f3bf-4aae-9f12-f1e48cb8c4dc", "title": "Whether Hezbollah Hit An Iron Dome Launcher Or Not , Its Almas Missiles Are A Problem For Israel", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/whether-hezbollah-hit-iron-dome-013811777.html", "message": "Several components of an active Iron Dome launcher appear to be missing.\nWhile it was struck, there was no indication of secondary explosions from the Tamir interceptors that fill the canisters in an active Iron Dome launcher.\n“This is the first time I've observed an Iron Dome launcher being hit.\nOn Wednesday, The IDF said it “was unaware of any damage to an Iron Dome launcher,” the Times of Israel reported .\nThe latest configuration of the Iron Dome system also have a demonstrated ability to shoot down drones and low-flying cruise missiles ."}, {"id": "103bceb6-96ad-4b9c-b1d4-3afc6e47f95a", "title": "State Dept : Israel Must Identify Hamas  Fighter Killed – One America News Network", "date": "2024-06-07 02:30", "url": "https://www.oann.com/newsroom/state-dept-israel-must-identify-hamas-fighters-killed/", "message": "The Israelis have released footage they say is evidence of those Hamas operations,” according to CNN.\n“Documents were [previously] found on the bodies of Hamas terrorists by Israeli first responders… They include detailed maps and show that Hamas intended to kill or take hostage civilians and schoolchildren,” according to NBC News.\nMeanwhile, U.S. State Department spokesman Matthew Miller asserted that the identities of the “Hamas fighters” should be identified, the BBC reported.\nAlthough Israel typically does so anyway, the U.S. rarely presses Israel to identify terrorists it has killed in airstrikes.\nTwo upper floors of the building’s classrooms were marked on an annotated aerial shot as the “locations of the terrorists,” according to the IDF."}, {"id": "f76d4611-43e7-404f-94e9-08148ce1d7e3", "title": "Israeli strike on UN school in Gaza leaves 40 dead - World", "date": "2024-06-07 03:30", "url": "https://www.dawn.com/news/1838296/israeli-strike-on-un-school-in-gaza-leaves-40-dead", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel’s assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\n“The occupation uses … false fabricated stories to justify the brutal crime it conducted against dozens of displaced people,” Thawabta told Reuters.\nAs people at the school cleared rubble from bloodstained classrooms, survivor Huda Abu Dhaher described waking up to the sound of rockets.\nCeasefire effortsIsrael announced a new military campaign in central Gaza on Wednesday as it battles fighters relying on hit-and-run tactics.\nIt says there will be no halt to fighting during the ceasefire talks, which have intensified since US President Joe Biden outlined a proposal."}, {"id": "3be5e962-8270-4a4e-ad92-14c16a96b7ae", "title": "Yemen Houthi rebels unveil solid - fuel  Palestine  missile that resembles Iranian hypersonic", "date": "2024-06-07 04:15", "url": "https://www.news-gazette.com/news/nation-world/yemens-houthi-rebels-unveil-solid-fuel-palestine-missile-that-resembles-iranian-hypersonic/article_daceb4be-a3bf-5fdc-979b-229ff3082c51.html", "message": "Yemen’s Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds"}, {"id": "21d9e6e3-107f-42a4-8987-c2daba6b8443", "title": "Disaster Drills : St . Joseph County first responders undergo crisis training", "date": "2024-06-07 01:00", "url": "https://wsbt.com/news/local/disaster-drills-first-responders-undergo-crisis-training-active-shooter-scenario-practice-target-hypothetical-police-firefighter-dispatch-emergency-management-south-bend-st-joseph-county-indiana", "message": "These departments all had to work together to manage active shooter and other disaster scenarios.\nWSBT 22 watched as they ran through their protocols to try and neutralize hypothetical targets, eliminate threats, and keep people safe in active shooter situations.\nKnown as ASIM, or active shooter incident management, the class was heralded by the students as informative and in depth.\nThe hypothetical situation continued to change and develop, something that police say can be helpful in potential future similar scenarios.\nKirsits tells WSBT 22 he was very impressed with the attendance from all the departments, and O’Chap says she feels her department is better able to respond to a potential active shooter situation now."}, {"id": "a437935b-51e6-4530-92cd-8193c6442d0e", "title": "Houthi rebels unveil solid - fuel  Palestine  missile resembling Iranian hypersonic | Nation and World", "date": "2024-06-07 02:45", "url": "https://www.reviewjournal.com/news/nation-and-world/yemens-houthi-rebels-unveil-solid-fuel-palestine-missile-resembling-iranian-hypersonic-3064034/", "message": "That’s a key concern for the Houthis as their missile launch sites have been repeatedly targeted by U.S. and allied forces.\nThis frame grab from video released by the Ansar Allah Media Office of Yemen's Houthi rebels on Wednesday, June 5, 2024, shows the launch of a Palestine missile from a rebel-controlled area of Yemen.\nYemen's Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds.\nThe logo in the bottom right reads in Arabic: \"Yemen War Media.\"\nFor their part, the Houthis described the Palestine as a “locally made” missile."}, {"id": "66305f28-0bc4-4890-b904-f951d7ee3f69", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kgou.org/politics-and-government/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "e6dddb07-9304-4482-960d-7b5b216e1542", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wcsufm.org/latest-from-npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "9bb6e27a-a1d1-4245-9094-8c93dbe85d78", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kedm.org/npr-national-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "def8161e-68ad-4da6-98b2-c209728b410c", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wbfo.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "ad23900c-90a8-4d74-875a-9f9b0bb1967f", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wxpr.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "c612478f-597d-4c58-b66b-9d836cdefdcd", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kpcw.org/npr-top-stories/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "785bd316-1515-46c3-a67d-6162263390ff", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.interlochenpublicradio.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "c03dceda-e6c4-434e-bbdb-7118473c7818", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.ijpr.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "6843b5d5-7bbc-4f65-872e-8ed08066a7f1", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wwno.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "81e31bcf-1227-4745-81ae-1d319d9c8948", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kios.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "79ad9ab8-437e-4245-8fe1-4fc6b01d204a", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.wdiy.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "28ed2ca2-1220-4f50-8ed8-fd45f7927246", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.publicradioeast.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "5cb4c56d-da2a-40c6-a1bf-a9adea8bac4e", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:00", "url": "https://www.wkms.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "8c05eaf6-432b-49e6-8f07-b29a6d1f717e", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:15", "url": "https://www.wutc.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "0c7fbe5d-b538-494b-801a-501467d28fe5", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.wcbe.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "d7090fc7-dbd4-4ae6-adf4-073307d5fd48", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.weaa.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "609ee606-8ae2-4b64-b187-317f2614408c", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:30", "url": "https://www.wxxinews.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "78e9add5-f6b0-4a4c-a521-d2ecc196be49", "title": "Charges filed in stabbing outside Union Station that left woman critically hurt – NBC Chicago", "date": "2024-06-07 01:30", "url": "https://www.nbcchicago.com/news/local/charges-filed-71-year-old-woman-stabbed-outside-union-station/3457463/", "message": "As a 71-year-old woman recovers at an area hospital following a horrifying stabbing outside of Chicago’s Union Station on Wednesday, the man accused of attacking her is now facing charges.\nAccording to Chicago police, 25-year-old Wilson Barreno was charged with multiple felonies, including attempted murder and aggravated battery in connection with the stabbing.\nRado was listed in critical condition after the attack, but her husband Alan told NBC Chicago that the sharp object missed his wife’s internal organs.\n“She was just walking down the street, coming back home and an arm went around her neck from behind.\nArlene called her husband after the attack, telling him that she “feels very lucky to be alive.”"}, {"id": "e78bb8c9-1d58-469d-bad6-505f13da3278", "title": "Houthi Group Claims Joint Aerial Attack With Iraqi Group Against Israeli Ships To Protest Gaza War", "date": "2024-06-07 04:30", "url": "https://www.outlookindia.com/international/yemen-houth-rebel-iraqi-group-attack-ships-haifa-post-israel-denies", "message": "Houthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: APHouthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: AP"}, {"id": "7c412701-804c-414d-9c00-023a7b589bef", "title": "False Flag On The Horizon ? The Strange Case Of The Destroyed Russian Nuclear Radar", "date": "2024-06-07 03:00", "url": "https://www.zerohedge.com/geopolitical/false-flag-horizon-strange-case-destroyed-russian-nuclear-radar", "message": "NATO has (until the past couple of days) enforced tight restrictions on how their weapons can be used by Ukraine.\nThat said, it’s not so much the weapons used that concerns me, it’s the specific targets that Ukraine supposedly chose.\nMeaning, the two stations destroyed by Ukrainian weapons are meant to act as an early warning system for nuclear attack.\nLet’s consider the ugly realities…First, the targeting of Russian nuclear defenses might make the Kremlin believe they are being prepped for a nuclear strike.\nThey might launch their own warheads in response to a non-nuclear strike (a fake strike or false flag)."}, {"id": "148dd82f-bed6-46b0-92b3-087f7f4e1dc1", "title": "Russia launches missile attacks on Ukraine , targets western oblasts", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/russia-launches-missile-attacks-ukraine-015302020.html", "message": "Russian forces launched a missile attack on Ukraine overnight on June 7, primarily targeting the country's western oblasts.\nPolish and other allied aircraft were scrambled to protect the country's own airspace in response to reports of the Russian missile attacks, the Operational Command of Poland's Armed Forces said on X.\nIn recent months, Russia has intensified its attacks against Ukraine's critical infrastructure in a renewed assault against the country's energy grid.\nAs a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15 but have dramatically increased in recent days.\nThe latest Russian mass-missile attack on May 31 caused further damage to energy infrastructure across the country."}, {"id": "5a8d4729-b022-429f-ab88-f553ff3fd011", "title": "As Zelensky visits for D - Day , Macron promises Ukraine Mirage aircraft to fend off Russian attacks", "date": "2024-06-07 00:15", "url": "https://www.bostonglobe.com/2024/06/06/world/zelensky-visits-d-day-macron-promises-ukraine-mirage-aircraft-fend-off-russian-attacks/", "message": "KHARKIV, Ukraine — French President Emmanuel Macron announced Thursday that France will provide Ukraine with its Mirage combat aircraft to help the country’s defense against Russia’s aggression.\nOn Wednesday, Russian President Vladimir Putin warned that Russia could provide long-range weapons to other countries so that they could strike Western targets.\n“We’re not talking about giving [Ukraine] weapons to strike Moscow, to strike the Kremlin,” Biden told ABC News.\n“Let the U.S. and its allies feel the impact of direct use of Russian weapons by others,” Medvedev wrote on his messaging app channel.\nPutin deliberately didn’t identify who would receive Russian weapons, Medvedev said, adding that they could go to anyone who considers the US and its allies their enemies."}, {"id": "8db83939-658e-4d47-9a7f-197a40ace00b", "title": "Ukraine Adopts Aggressive New Tactic with Western Blessing : Striking Inside Russia", "date": "2024-06-07 04:30", "url": "https://trendydigests.com/2024/06/07/ukraine-adopts-aggressive-new-tactic-with-western-blessing-striking-inside-russia/", "message": "Ukraine, with newfound backing from key Western nations, has initiated a radical shift in its military strategy by targeting Russian territories using Western-supplied arms.\nUkrainian forces now deploying reconnaissance drones to identify military targets within Russia and striking them, possibly with Western-supplied weapons.\nJulian Röpcke, a military observer, described the tactic’s effectiveness, noting that Ukrainian drones now track targets inside Russia, guiding Western weapon strikes.\nNevertheless, the Ukrainian official underscored that Russia continues its assault on Kharkiv using an array of other weaponry.\nThese tactical changes come amidst the backdrop of US President Joe Biden authorizing Ukraine to use US weapons for limited strikes inside Russia to defend Kharkiv."}, {"id": "d393195b-252d-4cb1-a30d-11391c79f0a2", "title": "  The Flabbergasting Question  ", "date": "2024-06-07 01:00", "url": "https://larouchepub.com/other/2024/5123-the_flabbergasting_question.html", "message": "International Peace Coalition Meeting‘The Flabbergasting Question’[Print version of this article]May 31—Today’s meeting marked the one-year anniversary of the International Peace Coalition, with 52 consecutive online weekly meetings.\nThe Schiller Institute circulated an emergency warning on these developments, and the story subsequently broke into the mainstream media, but is still not getting the attention it deserves.\nCol. Black asked the participants to consider the contrast in U.S. and Russian doctrines regarding the use of nuclear weapons.\nHelga Zepp-LaRouche called this the “flabbergasting question.” Bosshard said, “Politicians in the West are apparently unaware of the risks they are taking,” and suggested that they think Putin is bluffing.\nIn conclusion, Zepp-LaRouche reminded the participants of the upcoming Schiller Institute conference, saying that the Peace of Westphalia is a good historical reference."}, {"id": "2c665f28-a931-4813-b6bb-03d003dd0a7e", "title": "Mayor of Gaza Nuseirat killed in Israeli attack : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537539.html", "message": "Gaza, June 7 : The Palestinian Mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike, Palestinian medical and security sources have said.\nThe mayor was killed, along with a number of his family members, as an Israeli attack targeted a building in the camp on Thursday, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said al-Mughari's body was transferred to al-Aqsa Hospital in Deir al-Balah city in central Gaza.\nAl-Mughari, one of the cadres of the Hamas movement, was appointed mayor by acclamation, the sources noted.\nThe killing of al-Mughari came hours after the killing of about 35 Palestinians in an Israeli attack on a school affiliated with the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which was housing displaced people in the Nuseirat camp."}, {"id": "c24cef8e-5332-4c96-ac83-4892cd192903", "title": "Bibi warns of  intense op  against Hezbollah", "date": "2024-06-07 03:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/bibi-warns-of-intense-op-against-hezbollah/articleshow/110780256.cms", "message": "PM Netanyahu on Wednesday threatened a “very intense” military action along the border with Lebanon , where Israeli troops have exchanged near-daily fire with Hezbollah fighters .\n“We are prepared for a very intense operation in the north.\nOne way or another, we will restore security to the north,” he said during a visit to the border area.\nHezbollah said later it launched several attacks on Israeli positions, including a “guided missile” strike on an “Iron Dome platform in the Ramot Naftali barracks”."}, {"id": "da28f31a-a84f-4b93-88a4-9148719a1cc0", "title": "MW3 and Warzone : Mobile Suit Gundam Legends Event Rewards", "date": "2024-06-07 01:30", "url": "https://gameranx.com/features/id/500543/article/mw3-and-warzone-mobile-suit-gundam-legends-event-rewards/", "message": "Call of Duty: Modern Warfare 3 and Warzone has seen a range of crossovers in its lifetime, with more undoubtedly to come.\nThe Mobile Suit Gundam Legends crossover has brought new outfits to MW3 and Warzone, along with an event which has a stylish Bruen MK9 blueprint as the ultimate reward.\nMore Call of Duty guidesMW3 and Warzone: How to unlock the JAK Requiem | Call of Duty: Warzone – Where to Find Loot Hot Zones | Modern Warfare 3: What is Demolition Mode?\n| Modern Warfare 3: What is Hyper Cranked?\n| MW3 and Warzone: How to get Free Pride Cosmetics | Modern Warfare 3: Every New Killstreak | Season 4 | Modern Warfare 3: What are Playlist Modifiers?"}, {"id": "401b6598-c0d1-43b2-a9a1-94e4bee403b5", "title": "Silac Pathammavong", "date": "2024-06-07 04:30", "url": "https://www.courant.com/obituaries/silac-pathammavong-newington-ct/", "message": "Silac “Richard” Pathammavong, 91, of Newington, beloved husband of the late Praseuth Pathammavong, passed away peacefully on Tuesday, April 30, 2019 at Vernon Manor.\nBorn in Laos to the late La and Khammy Pathammavong, he started his distinguished military career by serving in WWII with the French guerrilla forces during the Japanese occupation of French Indochina.\nIn 1968, he was promoted to brigadier general and assigned to the Commander-in-Chief’s staff of the Royal Lao Army.\nHe loved to watch boxing matches and warfare movies, but his true passion was his family who will miss him dearly.\nA funeral service will be held at 1 PM Saturday, May 11 at the funeral home."}, {"id": "9d3b4fa9-4c07-4c63-9538-01d085c1b604", "title": "Air Power Projection Celebrates 75th Anniversary", "date": "2024-06-07 03:15", "url": "https://www.miragenews.com/air-power-projection-celebrates-75th-anniversary-1251558/", "message": "Department of DefenceMoments in history: 75th anniversary of the Fleet Air ArmThe Royal Australian Navy (RAN) recently marked the 75th anniversary of rising above the waves and developing a fully integrated aerial combat force.\nThis creation of the now Fleet Air Arm was cemented into history on May 25, 1949, when the first light fleet carrier, HMAS Sydney III, arrived in Jervis Bay carrying the 20th Air Carrier Group comprising of the 816 and 805 Squadrons.\nWhile the current Fleet Air Arm has evolved into a sophisticated rotary-wing force, its original mandate remains the same: supporting military operations at sea.\nAcross its 75-year history, the Fleet Air Arm has been based on the NSW South Coast at HMAS Albatross, which continues to be the home of Navy's advanced, future-focused air assets.\nThe modern fleet of aircraft allows the Fleet Air Arm to deploy the Romeo across Anzac-class frigates, Hobart-class air warfare destroyers and the Canberra-class landing helicopter docks."}, {"id": "48dd49f5-a69f-4d0f-93dd-d854a688741e", "title": "Defence Exercise Concludes with Firepower Explosion", "date": "2024-06-07 01:30", "url": "https://www.miragenews.com/defence-exercise-concludes-with-firepower-1251489/", "message": "Department of DefenceExercise Rhino Run culminated in a 24-hour crescendo of combat power by 7th Battalion, the Royal Australian Regiment (7RAR), 1st Armoured Regiment and 1st Combat Engineer Regiment.\nThe exercise centred on 7RAR Battle Group Boar, but developed the full range of capabilities across the brigade, including the generation of an integrated Battle Group based on 10th/27th Battalion, the Royal South Australia Regiment.\nThe exercise evaluated the ability of combat teams and headquarters to plan and conduct tactical actions against a near-peer adversary, within a contemporary, combined arms setting.\nCommanding Officer 7RAR Lieutenant Colonel Von Lambert said it was a significant exercise for his unit, which will soon be re-linked with 5th Battalion, the Royal Australian Regiment, and relocated to Darwin.\n\"The key theme for us throughout Exercise Rhino Run has been readiness, and as part of that readiness it's an austere and expeditionary mindset,\" he said."}, {"id": "5697d956-b07e-452c-bbaf-44dd1b6e3781", "title": "D - DAY : 101 - year - old World War II veteran speaks on his time served after invasion in Normandy", "date": "2024-06-07 01:45", "url": "https://www.waff.com/2024/06/07/d-day-101-year-old-world-war-ii-veteran-speaks-his-time-served-after-invasion-normandy/", "message": "ARAB, Ala. (WAFF) - Thursday marked the 80th anniversary of D-Day, a turning point in World World II.\nI know some men who were there that didn’t come back.”His ties to the military extend far beyond just him, he has had brothers who have served in World War II and uncles who served in the first World War.\nOne of his uncles was killed in a poison gas attack in World War I. Carson says he considers himself lucky that similar tactics weren’t used as much in World War II.\nAfter the war, Carson kept the military in his life.\nHe went on to teach others how to work with military radio and served for a while at Redstone Arsenal."}, {"id": "7b705112-46aa-49e0-a44b-d162bae0675e", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 01:00", "url": "https://www.kiro7.com/news/world/d-day-anniversary/4FNPVI5HEBQGST57RTJ2NDBB7U/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "0899cbf5-8f4b-468e-b3b7-ac9e74add731", "title": "D - Day Anniversary Haunted by Dwindling Number of Veterans and Shadowed by Europe New War – The Yeshiva World", "date": "2024-06-07 02:30", "url": "https://www.theyeshivaworld.com/news/general/2289017/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war.html", "message": "Now bent with age, the dwindling number of World War II veterans joined a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy on the shores where they landed 80 years ago on D-Day.\nThe war in Ukraine shadowed the ceremonies in Normandy, a grim modern-day example of lives and cities that are again suffering through war in Europe.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nYou’re back here today at home, if I may say.”The French president awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II."}, {"id": "0c11ff7c-157d-45d7-81aa-3312cc2e8265", "title": "D - Day anniversary haunted by dwindling number of veterans , shadowed by Europe new war", "date": "2024-06-07 03:45", "url": "https://www.theday.com/nation/20240606/d-day-anniversary-haunted-by-dwindling-number-of-veterans-shadowed-by-europes-new-war/", "message": "World War II veterans listen during a ceremony to mark the 80th anniversary of D-Day, Thursday, June 6, 2024, in Normandy.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nHe flew 35 combat missions in all during World War II.\n(AP Photo/John Leicester)A World War II veteran arrives for ceremonies to mark the 80th anniversary of D-Day, Thursday, June 6, 2024, in Normandy.\nNormandy is hosting various events to officially commemorate the 80th anniversary of the D-Day landings that took place on June 6, 1944."}, {"id": "d512d836-f0e2-48dc-ad34-a025a471ace3", "title": "D - Day anniversary marked by dwindling number of veterans", "date": "2024-06-07 01:00", "url": "https://www.airforcetimes.com/veterans/2024/06/06/d-day-anniversary-marked-by-dwindling-number-of-veterans/", "message": "Now bent with age, the dwindling number of World War II veterans joined a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy on the shores where they landed 80 years ago on D-Day.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nHe flew 35 combat missions in all during World War II.\nShe was among a crowd of thousands of people that stretched for several miles along Utah Beach, the westernmost of the D-Day beaches.\n“They really were the golden generation, those 17-, 18-year-old guys doing something so brave,” said James Baker, a 56-year-old from the Netherlands, reflecting on Utah Beach."}, {"id": "74fcd005-ef14-41bc-9d0d-85a4e46515f1", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 01:00", "url": "https://www.wsbradio.com/news/world/d-day-anniversary/4FNPVI5HEBQGST57RTJ2NDBB7U/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "f33ef508-0f94-406e-8d30-a84636785fcf", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by war in Ukraine", "date": "2024-06-07 03:00", "url": "https://www.adn.com/nation-world/2024/06/06/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-war-in-ukraine/", "message": "(AP Photo/Virginia Mayo)OMAHA BEACH, France — As young soldiers, they waded through breaking waves and gunfire to battle the Nazis.\nThe war in Ukraine shadowed the ceremonies in Normandy, a grim modern-day example of lives and cities that are again suffering through war in Europe.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nYou’re back here today at home, if I may say.”The French president awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II."}, {"id": "c554cb38-f292-4957-af00-a449c4347588", "title": "Eurofighter programme set for additional Italian order boost", "date": "2024-06-07 00:15", "url": "https://www.flightglobal.com/defence/eurofighter-programme-set-for-additional-italian-order-boost/158681.article", "message": "The four-nation Eurofighter consortium appears to be close to securing another order boost from one of its partner countries, with Italy expected to announce a follow-on commitment in the near future.\nThe Italian air force requirement is to acquire new fighters to replace its oldest Tranche 1-standard examples.\nAlso supporting the programme momentum is a newly agreed programme of upgrades – the P4E package was approved by the partner nations via the NATO Eurofighter and Tornado Management Agency.\nP4E also will deliver an improved cockpit interface, defensive aids sub-system upgrades, and additional electronic warfare capability for German aircraft.\nIt also paves the way for a future Long-Term Evolution activity which will add new capabilities to the type, potentially including some technologies pulled forward from the Italian-Japanese-UK Global Combat Air Programme (GCAP) and the Future Combat Air System activity between France, Germany and Spain."}, {"id": "ac7173c4-ed0f-4d47-8a99-71a835319b92", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 00:30", "url": "https://www.gjsentinel.com/news/world/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war/article_ab3c3be1-e678-509f-bccc-18e5a1435737.html", "message": "FILE - U.S. soldiers stand on the remains of a house as they inspect damage in Carentan, in the Normandy region of France, June 15, 1944.\nThe 80th anniversary this week of D-Day is a mixed bag of emotions for French survivors of the Battle of Normandy.\nThey remain eternally grateful for their liberation from Nazi occupation in World War II but cannot forget its steep cost in French lives."}, {"id": "b0c2b5ae-9c24-40cf-83c5-10b7d76e70d4", "title": "Nebraska dedicates memorial to honor Vietnam veterans", "date": "2024-06-07 01:30", "url": "https://omaha.com/news/local/its-a-healing-nebraska-dedicates-memorial-to-honor-vietnam-veterans-living-and-dead/article_8ddb412a-2452-11ef-a849-ef5e1c2335b0.html", "message": "The chop-chop-chop of an incoming Huey helicopter offered a ray of hope to American soldiers hurt and alone in the jungles of Vietnam.\nNow that iconic sound, coming from a speaker atop a hill in Papillion, will play a role in helping heal the emotional wounds of Nebraska’s Vietnam War veterans and families of the fallen.\nNearly 50 years after the war, Nebraska has finally built its own Nebraska Vietnam Veterans Memorial.\n“But their country asked them, and they did it.”Nebraska is the last state to erect a Vietnam memorial, but the memorial plaza erected on a hill west of Walnut Creek Lake is one of the largest in the country.\nJack McManus, president of Vietnam Veterans of America, said memorials help heal the nation, and their importance cannot be overstated."}, {"id": "80220d82-4048-44ac-961d-44b08d861778", "title": "Nebraska dedicates memorial to honor Vietnam veterans", "date": "2024-06-07 02:30", "url": "https://journalstar.com/news/state-regional/its-a-healing-nebraska-dedicates-memorial-to-honor-vietnam-veterans-living-and-dead/article_16f067b3-0901-5474-90b4-a5904f1c53fb.html", "message": "The chop-chop-chop of an incoming Huey helicopter offered a ray of hope to American soldiers hurt and alone in the jungles of Vietnam.\nNow that iconic sound, coming from a speaker atop a hill in Papillion, will play a role in helping heal the emotional wounds of Nebraska's Vietnam War veterans and families of the fallen.\nNearly 50 years after the war, Nebraska has finally built its own Nebraska Vietnam Veterans Memorial.\nNebraska is the last state to erect a Vietnam memorial, but the memorial plaza erected on a hill west of Walnut Creek Lake is one of the largest in the country.\nJack McManus, president of Vietnam Veterans of America, said memorials help heal the nation, and their importance cannot be overstated."}, {"id": "576e097a-a9df-4d6c-a254-0f91e76949fa", "title": "New Orleans World War II Museum honors D - Day veterans | News", "date": "2024-06-07 01:00", "url": "https://www.theadvocate.com/baton_rouge/news/new-orleans-world-war-ii-museum-d-day-veterans-80th-anniversary/article_6248ebef-a8ff-5495-b4e3-25009491091a.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "bc0ffe3f-c613-46e9-8b18-4a226e7b35ab", "title": "Diminished Hamas switches to full insurgent mode in Gaza", "date": "2024-06-07 03:00", "url": "https://www.asiaone.com/world/diminished-hamas-switches-full-insurgent-mode-gaza", "message": "“In earlier months, Hamas fighters would intercept, engage and fire at Israeli troops as soon as they pushed into their territory,” Ibrahim told Reuters by phone.\nLerner, the IDF spokesman, agreed Israel faced a protracted battle to overcome Hamas, which has ruled the Gaza Strip since 2006.\nThe labyrinth, dubbed the Gaza metro by the Israeli military, is roughly half the length of the New York subway system.\nThe Israeli military said last week that it had taken control of the entire Gaza-Egypt land border to prevent weapons smuggling.\nGadi Eisenkot, a former Israeli military chief serving in Netanyahu’s war Cabinet, has proposed an Egyptian-led international coalition as an alternative to Hamas rule in Gaza."}, {"id": "1bb31846-cda6-453f-8ae6-33d5879ac769", "title": "Ukraine update : Biden delivers pointed rebuke to Putin and Trump ; Nato to expand cooperation with Kyiv", "date": "2024-06-07 02:30", "url": "https://www.dailymaverick.co.za/article/2024-06-07-biden-delivers-pointed-rebuke-to-putin-and-trump-nato-to-expand-cooperation-with-kyiv/", "message": "Biden, who has warned of Russian President Putin’s grand designs for the continent, was expected to meet with Ukrainian President Volodymyr Zelensky while in France.\nHe warned that if the allies failed there, “Ukraine will be subjugated and it will not end there.\nOne goal of the programme is to help make Ukraine a large-scale tech provider once the war ends.\nNato also wants to replicate some of the rapid tech adoption and deployment seen in Ukraine since the war started, Van Weel said.\nAt the conference, Nato and US officials frequently pointed to the rapid tech development in Ukraine since the start of the war with envy."}, {"id": "bf5a7a25-3716-4e45-a41c-006e771b08ee", "title": "  North Korea will react angrily : how a US bomber drill could backfire", "date": "2024-06-07 00:45", "url": "https://www.scmp.com/week-asia/politics/article/3265674/north-korea-will-react-angrily-how-us-bomber-drill-could-backfire", "message": "A B-1B bomber of the US Air Force (left) flies in formation with South Korean F-15K fighter jets (right) over the Korean peninsula on Wednesday.\nNorth Korea has previously called the bomber’s deployment on the Korean peninsula proof of US hostility.\nIt has responded to past flights of B-1Bs and other powerful US aircraft in South Korea by carrying out missile tests.\nA view of Kaesong, North Korea, from an observatory in the demilitarised zone in South Korea.\nOnly by growing stronger can we change North Korea,” he said in a Memorial Day speech at Seoul National Cemetery commemorating the country’s war dead."}, {"id": "6282e82b-da09-4f13-bc30-19e64c453917", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-07 03:30", "url": "https://www.tvguide.co.uk/schedule/d92d98a5-2225-5f36-a740-c8779dc05290/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Friday 7 June Share Add toCalendar +French Resistance Season 4 Episode 1 of 10 S SubtitlesEccentric military equipment collector Bruce Crompton is tasked with creating a display based on the French Resistance - a parachute basket filled with items the RAF would have dropped to the Resistance during the Second World WarCombat Dealers airs on Discovery Channel HD at 9:00 AM, Friday 7 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "59e06044-24e5-4b13-be4e-b30492949159", "title": "102 - year - old Central Texas World War II veteran reflects on his service during D - Day 80 - year anniversary", "date": "2024-06-07 01:00", "url": "https://www.kwtx.com/2024/06/06/102-year-old-central-texas-world-war-ii-veteran-reflects-his-service-during-d-day-80-year-anniversary/", "message": "WACO, Texas (KWTX) - Thursday marked eighty years since the allied invasion of Normandy in World War II, otherwise known as D-Day.\nAuthor, veteran, and survivor Ralph Graham was awaiting a flight overseas with fellow soldiers on the day that has now gone down in history as the beginning of the end of the war.\nJust a few weeks ago, Graham was featured in Washington, D.C. as a Grand Marshall in the National Memorial Day Parade.\n“We had a lot of fun, really.”Graham said he’s proud to still be able to represent and celebrate those who fought in World War II, just like him.\nHe recalls more war stories and his participation in the Battle of the Bulge, the third deadliest battle in American history, in his 2020 book 12 Minutes."}, {"id": "3419718a-5c8c-4e93-85ae-e843355ac3c3", "title": "World War II : Honoring and remembering Michigan veterans who fought , died during D - Day", "date": "2024-06-07 03:15", "url": "https://www.wilx.com/2024/06/06/world-war-ii-honoring-remembering-michigan-veterans-who-fought-died-during-d-day/", "message": "LANSING, Mich. (WILX) - Engaged in a fierce battle with German troops on June 6, 1944, 3,000 American soldiers and sailors died in the first 24 hours of the D-Day invasion.\nThe average age of those who died, just 27, but some as young as 16.\nIn Mid-Michigan, 94 Michigan veterans who lost their lives on D-Day will be honored in a wreath-laying ceremony.\nThe event organizer, Michele Fickes, hosted the wreath-laying ceremony to honor Michigan soldiers who died in France at the Evergreen Cemetery in Lansing.\n“It makes you into a person that is sacrificial, service-oriented, and that’s why veterans are so amazing."}, {"id": "8a3dcd9e-1639-4a72-b8bf-b3e02a8053cf", "title": "The World Marks 80th Anniversary Of D - Day Landings | Positive Encouraging K - LOVE", "date": "2024-06-07 04:15", "url": "https://www.klove.com/news/us-and-world/the-world-marks-80th-anniversary-of-d-day-landings-50567", "message": "UTAH BEACH, France (AP) — Twelve U.S. and British World War II veterans were given Legion of Honor awards by French President Emmanuel Macron on Thursday, the 80th anniversary of D-Day.\n“You came here because the free world needed each and every one of you, and you answered the call,?\n“There are things worth fighting for,” said World War II veteran Walter Stitt, who fought in tanks and turns 100 in July, as he visited Omaha Beach this week.\nConscious of the inevitability that major D-Day anniversaries will soon take place without World War II veterans, huge throngs of aficionados in uniforms and riding vehicles of the time, and tourists soaking up the spectacle, flooded Normandy for the 80th anniversary.\nAnd we ended up helping save the world,” said 98-year-old Anna Mae Krier, who worked as a riveter building B-17 and B-29 bombers."}, {"id": "40b733f2-42d7-4602-aa40-85949e80e5cb", "title": "Irish D - Day Catholics  owed great deal of gratitude  ", "date": "2024-06-07 00:15", "url": "https://www.bbc.com/news/articles/cg33j4rm9jlo", "message": "Dr Laura Patrick, a heritage officer for the Royal Irish Regiment, said it was difficult to tell the background of those who took part.\nDublin-based historian Diarmaid Ferriter said nationalist soldiers from across the island may have joined for the spirit of adventure, or for economic reasons.\n\"We know that a private in the Irish Army at the start of the Second World War was being paid 14 shillings a week,\" he explained.\n\"If you went into the British Army you were being paid over nine shillings a day.\nA decade ago, some 6,000 soldiers who deserted the Irish Army to fight for the British during World War Two were granted pardons."}, {"id": "5d7bf86f-bb7d-4de0-8f1b-560b48470a0b", "title": "D - Day anniversary", "date": "2024-06-07 02:15", "url": "https://www.smdailyjournal.com/news/national/d-day-anniversary/collection_e5551a48-2448-11ef-b7cc-ab26d03715d6.html", "message": "As young soldiers they waded ashore in Normandy through gunfire to fight the Nazis.\nA dwindling number of World War II veterans were joined by a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy in moving commemorations on and around those same beaches where they landed exactly 80 years ago on D-Day.\nRussia's full-scale invasion is a grim modern-day example of lives and cities that are again suffering through war.\nFrench President Emmanuel Macron awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nAmong the Americans was Edward Berthold who flew 35 combat missions in all as a pilot during World War II including one on D-Day."}, {"id": "0e1d1b32-e7a8-42ef-b8d7-3db3387d2012", "title": "George Clooney fretted to White House that wife Amal could face sanctions over ICC case against Israel : report", "date": "2024-06-07 04:15", "url": "https://nypost.com/2024/06/06/us-news/george-clooney-fretted-to-white-house-that-wife-amal-could-face-sanctions-over-icc-case-against-israel-report/", "message": "Hollywood superstar George Clooney rang up the White House last month to grumble about President Biden’s criticism of the International Criminal Court’s effort to issue arrest warrants against top Israeli officials, according to a report.\n“The ICC prosecutor’s application for arrest warrants against Israeli leaders is outrageous,” the president said in a May 20 statement.\nAFP via Getty ImagesICC prosecutor Karim Khan announced last month that his office would pursue arrest warrants for Netanyahu, 74, and Gallant, 65, as well as the Hamas leaders.\nThe White House and the Clooney Foundation for Justice did not respond to The Post’s request for comment.\nIn 2020, Clooney donated more than $500,000 in support of Biden’s White House bid."}, {"id": "4c2c1862-376a-414a-83ac-437e2b6fbf89", "title": "On 80th anniversary of D - Day , a Colorado WWII veteran reflects", "date": "2024-06-07 00:30", "url": "https://www.fortmorgantimes.com/2024/06/06/colorado-world-war-ii-veteran-john-indergand/", "message": "On 80th anniversary of D-Day, a Colorado WWII veteran reflects: “They knew they had to win at all costs” John Indergand enlisted in the U.S. Army at 19 and landed in Normandy weeks after historic invasion"}, {"id": "c3f46064-9fc9-422b-a224-1c81b691b13a", "title": "Russia uses thermobaric missiles in Chasiv Yar , Donetsk Oblast", "date": "2024-06-07 00:45", "url": "https://www.yahoo.com/news/russia-uses-thermobaric-missiles-chasiv-000000633.html", "message": "Russian troops are using multiple launch rocket systems (MLRS) with thermobaric missiles to strike Chasiv Yar in Donetsk Oblast, said Nazar Voloshyn, spokesman for the Khortytsia Operational and Strategic Troop Grouping, on national TV on July 6.\n\"The enemy is using multiple launch rocket systems with thermobaric ammunition in Chasiv Yar,\" a spokesman said.\nRead also: Elite HUR combat unit Kraken shows footage of ongoing Chasiv Yar battle\"They destroy everything left after strikes by their aviation,\" the spokesman said.\nVoloshyn added that the enemy constantly attacks the Chasiv Yar sector and keeps trying to advance there.\nRead also: Chasiv Yar in ruins: AP captures aftermath of intense Russian bombardmentThe spokesman added that the Armed Forces control Chasiv Yar, use all types of weapons against the Russians, and do not allow Russian troops to enter the city."}, {"id": "f55606b4-2c0c-4b4f-8485-1b2e148041b2", "title": "D - Day 80th anniversary : New memorial unveiled to honor veteran who made major strides during WWII", "date": "2024-06-07 03:00", "url": "https://www.fox29.com/news/d-day-80th-anniversary-new-memorial-unveiled-honor-veteran-who-made-major-strides-during-wwii", "message": "Veterans, their families and the community at large came together in Atlantic City for the long anticipated unveiling of the Bernie Friedenberg World WarII memorial on the 80th anniversary of D-Day.\nsaid Susan Friedenberg, daughter of Bernie Friedenberg.\nsaid Susan Friedenberg.\nThe veteran died in 2018 and now this memorial bears his name for the world to see.\nThey were right beside the men,\" Brill explained."}, {"id": "ab60ec72-4a3e-4102-bb64-ea2a1a478a09", "title": "Joseph Simes Obituary - Santa Ana , CA ( 1925 - 2017 ) ", "date": "2024-06-07 03:00", "url": "https://www.ocregister.com/obituaries/joseph-fred-simes-santa-ana-ca/", "message": "Simes, Joseph Fred, passed away on February 21, 2017 at the age of 91, surrounded by his loved ones.\nHe was born on April 18, 1925 in Cheyenne, Wyoming, but lived nearly all his life in southern California.\nA World War II Navy vet, he survived multiple battles and island invasions, including the Battle of Okinawa, when his ship, the destroyer USS Colhoun, was sunk by Japanese kamikaze fighters.\nAfter the war, he had a nearly forty-year career in household appliance repair and sales, including running his own business, Allied Appliance, for nearly thirty years.\nHe is survived by his wife, Dora of sixty-two years; his sons, Michael, Kevin, Colin and Alan; six grandchildren and one great-grandchild."}, {"id": "0ae9e603-45c1-498e-9045-9a146b618a69", "title": "Trump Marks 80th Anniversary Of D - Day", "date": "2024-06-07 02:30", "url": "https://www.oann.com/newsroom/trump-marks-80th-anniversary-of-d-day/", "message": "U.S. President Donald Trump tips the cap of a U.S. veteran of the Battle of Normandy as other veterans look on during the main ceremony to mark the 75th anniversary of the World War II Allied D-Day invasion of Normandy at Normandy American Cemetery on June 06, 2019 near Colleville-Sur-Mer, France.\nAdvertisementOn Thursday, Trump marked D-Day in a Truth Social Post.\nTruth Social: realDonaldTrumpHe recalled how many shed their blood and thousands gave their lives in defense of American freedom.\nThe 45th president delivered remarks at the Normandy American Cemetery and Memorial in Colleville-sur-Mer on this day five years ago.\nAround 73,000 American troops participated in D-Day, including more than 2,500 who made the ultimate sacrifice."}, {"id": "aec783ec-8a2e-4392-ab52-956255c7a272", "title": "Waverly Woodson Jr . Posthumously Awarded For D - Day Efforts", "date": "2024-06-07 01:00", "url": "https://blackamericaweb.com/2024/06/06/nearly-30-years-after-his-death-cpl-waverly-woodson-jr-a-black-medic-and-d-day-hero-is-finally-honored/", "message": "D-Day, Jr., a Black army medic who saved nearly 200 lives during D-Day in 1944, is being posthumously honored for his heroic efforts.\nThe Democrat and relatives of the Black medic had to fight for his important work to be recognized.\nLook for local chapters of organizations like the Black Veterans Project, the National Association for Black Veterans, Inc. (NABVETS) or Disabled American Veterans (DAV) that provide resources and assistance to veterans in need.\nWaverly Woodson, Jr., A Black Medic And D-Day Hero, Is Finally Honored appeared first on NewsOne.\nWaverly Woodson, Jr., A Black Medic And D-Day Hero, Is Finally Honored was originally published on newsone.com"}]