[{"id": "d463fcb2-571c-4ab3-a36f-5a793b50551a", "title": "Ukraine Claims First - Ever Fighter Jet Strike On Russian Territory", "date": "2024-06-11 00:45", "url": "https://www.shtfplan.com/headline-news/ukraine-claims-first-ever-fighter-jet-strike-on-russian-territory", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "Ukraine is touting that it has launched a successful airstrike by fighter jet inside Russian territory, Sky News is reporting, which is a significant first of the conflict.\nAn unidentified Ukrainian military source described to the UK outlet that an air-launched missile strike was conducted inside Russia’s Belgorod region Sunday, hitting a “Russian command node”.\nThe Ukrainian military source told Sky: “A Ukrainian Air Force (UAF) mission has struck a Russian command node in Belgorod.”“Whilst damage assessment is still occurring, it is confirmed as a direct hit,” the statement added.\nWhile there is as yet no indication that Ukraine actually used a Western fighter jet to attack Russia, which would be a massive escalation leaving Kiev open to huge retaliatory strikes, Ukraine forces are expected to receive their first F-16s this summer.\nThe fact that Ukrainian military officials are now boasting to UK outlets of having attacked Russian territory with air-launched missiles is perhaps a way of keeping up the pressure on partners and allies."}, {"id": "1df8d322-7932-4718-91ac-57eb43cd8fd1", "title": "Hezbollah shoots down Israeli drone over Lebanon", "date": "2024-06-11 02:15", "url": "https://www.prokerala.com/news/articles/a1538523.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, June 11 : Hezbollah has said that it shot down an Israeli drone over southern Lebanon.\nHezbollah said on Monday in a statement that its fighters ambushed a Hermes 900 drone armed with missiles and targeted it with air defence weapons before the drone carried out its attack, Xinhua news agency reported.\nA Lebanese military source told Xinhua news agency that a surface-to-air missile launched from southern Lebanon struck an Israeli drone, causing it to catch fire before landing in the vicinity of al-Rehan mountain in Jezzine district, situated deep in southern Lebanon.\nNearly half an hour later, an Israeli F-16 warplane attacked the wreckage of the drone, according to the source.\nLebanese security sources said that Hezbollah had heightened its military preparedness across all deployment zones several days ago in anticipation of potential military escalation due to repeated Israeli threats."}, {"id": "88c56732-3264-4535-b90a-3352bcfce0a3", "title": "Hezbollah Shoots Down Israeli Drone Over Lebanon", "date": "2024-06-11 02:15", "url": "https://menafn.com/1108317755/Hezbollah-Shoots-Down-Israeli-Drone-Over-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, June 11 (IANS) Hezbollah has said that it shot down an Israeli drone over southern Lebanon.\nHezbollah said on Monday in a statement that its fighters ambushed a Hermes 900 drone armed with missiles and targeted it with air defence weapons before the drone carried out its attack, Xinhua news agency reported.\nA Lebanese military source told Xinhua news agency that a surface-to-air missile launched from southern Lebanon struck an Israeli drone, causing it to catch fire before landing in the vicinity of al-Rehan mountain in Jezzine district, situated deep in southern Lebanon.\nNearly half an hour later, an Israeli F-16 warplane attacked the wreckage of the drone, according to the source.\nLebanese security sources said that Hezbollah had heightened its military preparedness across all deployment zones several days ago in anticipation of potential military escalation due to repeated Israeli threats."}, {"id": "d5b659f8-d60d-4602-9e62-c8c2c99d04b4", "title": "Woman accused of fatally shooting man as they committed Birmingham burglary indicted on felony murder", "date": "2024-06-11 00:15", "url": "https://www.al.com/news/2024/06/woman-accused-of-fatally-shooting-man-as-they-committed-birmingham-burglary-indicted-on-felony-murder.html", "domain": "al.com", "domain_classification": "Unknown", "message": "A 32-year-old woman has been indicted in the shooting death of a man in the parking lot of a west Birmingham apartment complex.\nJameria Henley is charged with felony murder in the July 13, 2023, killing of 33-year-old Nicholas Marquis Johnson.\nAccording to police and court documents, Henley and Johnson were in the course of committing a burglary when Henley somehow shot Johnson.\nNext, Shot Spotter indicated shots fired, and finally someone called reporting a person shot.\nShot Spotter registered at least 10 rounds fired."}, {"id": "fbf7608a-73ca-4719-b857-064d140eb8c2", "title": "Two Dead , Fires In South Lebanon After Israeli Strikes", "date": "2024-06-11 04:30", "url": "https://menafn.com/1108318236/Two-Dead-Fires-In-South-Lebanon-After-Israeli-Strikes-State-Media", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe agency also reported a \"violent airstrike\" on the border village of Khiam.\nThe Shiite Muslim movement later announced that one of its fighters was killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\nLebanese authorities and several international rights groups have accused Israel of using white phosphorus rounds in its strikes on its northern neighbour."}, {"id": "0e772154-dbd3-48f7-a87e-96ea16d73e72", "title": "4 US Citizens  Brutally Stabbed  In Park In China", "date": "2024-06-11 04:00", "url": "https://www.ndtv.com/world-news/4-us-citizens-brutally-stabbed-in-park-in-china-5863616", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Representational ImageFour American college instructors working in China were wounded in a reported stabbing at a public park, according to their employer and the US State Department.\nThe four were on academic exchange and worked as instructors at Iowa's Cornell College, which said they were wounded in a \"serious incident\".\nIowa Congresswoman Ashley Hinson said on X she was \"horrified\" that the Cornell College faculty members had been \"brutally stabbed\".\nGovernor Kim Reynolds said it was \"in touch with Iowa's federal delegation and the state department in response to this horrifying attack\".\nA US State Department spokesperson said it was \"aware of reports of a stabbing incident in Jilin, People's Republic of China\"."}, {"id": "bf09f036-5f81-4681-a40e-2684a9c935f2", "title": "Four American educators stabbed in park in northeast China , says US media and officials", "date": "2024-06-11 04:00", "url": "https://www.channelnewsasia.com/east-asia/four-american-educators-stabbed-park-northeast-china-united-states-media-officials-beihua-university-jilin-4401156", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "BEIJING: Four American educators from a small Iowa university were injured in a stabbing attack in a public park in northeast China's Jilin province on Monday (Jun 11), according to US media and US government officials.\n\"My brother, David Zabner, was wounded in the arm during a stabbing attack while visiting a temple in Jilin City, China,\" he said.\nNo statements on the incident have been issued by Chinese authorities or reports found in Chinese media.\nCollege spokesperson Jen Visser told CNN the US State Department was aware of reports of a stabbing incident in China and was monitoring the situation.\nThere are currently fewer than 900 American exchange students studying in China compared to over 290,000 Chinese students in the US, according to US data."}, {"id": "52ad8a6b-6df1-4ee5-88e2-79b2e435afd5", "title": "Gardaí probe if west Dublin stab attack is linked to  Eircode gang  wars", "date": "2024-06-11 02:30", "url": "https://www.independent.ie/irish-news/crime/gardai-probe-if-west-dublin-stab-attack-is-linked-to-eircode-gang-wars/a899929051.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "‘I was laughed out of it initially when I went to gardaí about the abuse I was getting from my ex-wife’"}, {"id": "c4c9b9d1-7808-4fe3-8d3e-6086aabbde28", "title": "American Educators Stabbed in China : A Shocking Incident", "date": "2024-06-11 03:15", "url": "https://www.devdiscourse.com/article/education/2978228-american-educators-stabbed-in-china-a-shocking-incident", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Four American educators from a small Iowa university were reportedly stabbed in a public park in northeast China's Jilin province over the weekend, according to U.S. media and U.S. government officials.\nThe educators from Cornell College were visiting a partner university in China when the attack occurred, said CNN.\nCollege spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner China school was Beihua University.\nThe US State Department was aware of reports of a stabbing incident in China and was monitoring the situation, said Visser.\nNo statements on the incident have been issued by Chinese authorities or reports found in Chinese media."}, {"id": "54ba7f85-16f8-486a-9d3f-c52680891488", "title": "Bond set at $5M for woman who stabbed , killed child outside Ohio grocery store", "date": "2024-06-11 02:15", "url": "https://www.wcpo.com/news/state/state-ohio/do-whatever-you-can-to-keep-this-monster-behind-bars-bond-at-5m-for-woman-who-stabbed-child-at-ohio-store", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "The first time Judge Nancy Russo spoke to Ellis, she refused to acknowledge the judge and answer questions.\nRusso read the indictment out loud, and Ellis could be seen smiling while listening to the allegations leveled against her.\nWood told the judge: \"Do whatever you can to keep this monster behind bars.\"\nAuthorities say Ellis followed the mother and her son, Julian, into the parking lot and then stabbed the child while he was in a grocery cart.\nWhen the mother tried to pull the boy out of the cart during the attack, Ellis stabbed her as well."}, {"id": "bb8d10d1-9dea-4544-a693-27b49beae8f9", "title": "4 Iowa instructors teaching at a Chinese university were attacked at a park", "date": "2024-06-11 04:15", "url": "https://timesofindia.indiatimes.com/world/us/4-iowa-instructors-teaching-at-a-chinese-university-were-attacked-at-a-park/articleshow/110888713.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "MOUNT VERNON : Four Iowa college instructors teaching in China were attacked in a reported stabbing while visiting a public park , Cornell College and the US State Department confirmed Monday.Cornell College President Jonathan Brand in a statement said the instructors were at the park with a faculty member from Beihua University when the attack occurred.\nCornell spokesperson Jen Visser in an email said the private school in Mount Vernon partners with Beihua University near Jilin City in northeastern China.The State Department said in a statement that it is aware of reports of a stabbing and that it is monitoring the situation.\nDetails on the extent of the instructors' injuries and whether the attack was targeted or random were unclear Monday.\nVisser said the college was still gathering information on what happened.US Rep. Mariannette Jane Miller-Meeks of Iowa wrote in a social media post that she was trying to reach the US Embassy to ensure the victims get good health care and return to the US as soon as possible.The attack happened as both Beijing and Washington are seeking to maintain people-to-people exchange to prevent bilateral relations from falling off.Chinese President Xi Jinping has unveiled a plan to invite 50,000 young Americans to China in the next five years, while Chinese diplomats say a travel advisory by the US State Department has discouraged Americans from going to China.Citing arbitrary detentions as well as exit bans that could prevent Americans from leaving the country, the State Department has issued the Level 3 travel advisory — the second highest warning level — for mainland China, urging Americans to “reconsider travel” there.\nSome American universities have suspended their China programs due to the travel advisory."}, {"id": "443ed79f-54ad-4d7d-b6fd-17b30d4daf6b", "title": "Satellite images show destroyed Russian equipment in occupied Crimea", "date": "2024-06-11 03:30", "url": "https://www.yahoo.com/news/satellite-images-show-destroyed-russian-015607752.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Satellite images show the aftermath of a Ukrainian strike on Russian military targets in the city of Dzhankoi in occupied Crimea, Radio Free Europe/Radio Liberty's investigative project Schemes reported on June 10, citing images from the Planet Labs satellite.\nUkrainian forces attacked Russian S-400 and S-300 anti-aircraft missile systems in several areas in occupied Crimea overnight on June 10.\nThe General Staff reported that an S-400 missile unit was hit near Dzhankoi.\nSchemes investigators did not find images verifying the Ukrainian military's claims of strikes on S-300 missile units in occupied Chornomorske and Yevpatoria.\nRead also: Ukraine war latest: Ukraine strikes Russian S-400, S-300 systems in occupied Crimea, General Staff saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "0356a668-0e4c-4162-a597-5c897bc9ce8d", "title": "4 Cornell College instructors injured in China , in what Iowa leaders calling a stabbing attack", "date": "2024-06-11 02:00", "url": "https://edition.cnn.com/2024/06/10/asia/china-4-us-cornell-college-instructors-attacked/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Four instructors from an Iowa college who were visiting their partner university were injured in a park in northeastern China on Monday in a stabbing incident, according to a school spokesperson.\nThe instructors from Cornell College in Mount Vernon, Iowa, were at a public park with a faculty member of their partner institution when they were injured “in a serious incident,” school President Jonathan Brand said in a statement to the college community.\nSchool spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner school is Beihua University.\nThe US State Department is aware of reports of a stabbing incident in China and is monitoring the situation, according to a spokesperson.\nThe campus of Cornell College in Mount Vernon, Iowa Courtesy Cornell CollegeNo students were participating in the program, according to the school."}, {"id": "defe0f6d-096c-4298-b412-36760c66a6db", "title": "4 Cornell College instructors injured in China , in what Iowa leaders calling a stabbing attack", "date": "2024-06-11 02:00", "url": "https://us.cnn.com/2024/06/10/asia/china-4-us-cornell-college-instructors-attacked/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Four instructors from an Iowa college who were visiting their partner university were injured in a park in northeastern China on Monday in a stabbing incident, according to a school spokesperson.\nThe instructors from Cornell College in Mount Vernon, Iowa, were at a public park with a faculty member of their partner institution when they were injured “in a serious incident,” school President Jonathan Brand said in a statement to the college community.\nSchool spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner school is Beihua University.\nThe US State Department is aware of reports of a stabbing incident in China and is monitoring the situation, according to a spokesperson.\nThe campus of Cornell College in Mount Vernon, Iowa Courtesy Cornell CollegeNo students were participating in the program, according to the school."}, {"id": "8a09b1a9-c3aa-4d94-9e08-49eb202bd46d", "title": "4 instructors from Iowa Cornell College injured in China in stabbing incident , school says", "date": "2024-06-11 02:30", "url": "https://krdo.com/news/national-world/cnn-world/2024/06/10/4-instructors-from-iowas-cornell-college-injured-in-serious-incident-in-china-school-says/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Sarah Dewberry and Yong Xiong, CNN(CNN) — Four instructors from an Iowa college who were visiting their partner university were injured in a park in northeastern China on Monday in a stabbing incident, according to a school spokesperson.\nThe instructors from Cornell College in Mount Vernon, Iowa, were at a public park with a faculty member of their partner institution when they were injured “in a serious incident,” school President Jonathan Brand said in a statement to the college community.\nSchool spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner school is Beihua University.\nThe US State Department is aware of reports of a stabbing incident in China and is monitoring the situation, according to a spokesperson.\nKim Reynolds said, “I am in touch with Iowa’s federal delegation and the state department in response to this horrifying attack."}, {"id": "73025f82-7b3f-4501-b86d-878acfed6ccf", "title": "Houston crime : Woman critically injured in stabbing on Desoto Street ; suspect detained", "date": "2024-06-11 01:15", "url": "https://www.fox26houston.com/news/houston-crime-woman-critically-injured-stabbing-desoto-street-suspect-detained", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "A woman is in critical condition following a stabbing incident at a northwest Houston apartment complex.\nFOX 26 Houston is now on the FOX LOCAL app available through Apple TV, Amazon FireTV, Roku and Google Android TV!\nAuthorities say the victim, who was stabbed by a male suspect, attempted to drive herself to the hospital.\n(Photo: Houston Police Department)DOWNLOAD THE FOX 26 HOUSTON APP BY CLICKING HEREA witness reported seeing the male suspect stab the female victim.\nThe suspect has been detained by police, and an investigation into the motive and circumstances of the attack is ongoing."}, {"id": "0c33f8cc-61f8-4a7e-b2ec-39c16f93f8b6", "title": "4 instructors from Iowa Cornell College injured in China , in what Iowa leaders calling a stabbing attack", "date": "2024-06-11 02:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/06/10/4-instructors-from-iowas-cornell-college-injured-in-serious-incident-in-china-school-says/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Four instructors from an Iowa college who were visiting their partner university were injured in a park in northeastern China on Monday in a stabbing incident, according to a school spokesperson.\nThe instructors from Cornell College in Mount Vernon, Iowa, were at a public park with a faculty member of their partner institution when they were injured “in a serious incident,” school President Jonathan Brand said in a statement to the college community.\nSchool spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner school is Beihua University.\nThe US State Department is aware of reports of a stabbing incident in China and is monitoring the situation, according to a spokesperson.\nKim Reynolds said, “I am in touch with Iowa’s federal delegation and the state department in response to this horrifying attack."}, {"id": "c2c508aa-11ad-48f1-b4b3-a65f3b71c3d9", "title": "4 instructors from Iowa college injured in China in  horrifying attack : Governor", "date": "2024-06-11 03:30", "url": "https://6abc.com/4-instructors-from-iowa-college-injured-in-china-in-horrifying-att/14933336/", "domain": "6abc.com", "domain_classification": "Unknown", "message": "4 instructors from Iowa college injured in China in 'horrifying attack': GovernorFour instructors from Cornell College in Iowa were injured in a \"serious incident\" while overseas in China, the university said in a statement Monday.\nThe incident took place in a public park in Jilin City, China, on Sunday, according to the statement.\nCornell College has a partnership with Beihua University and the instructors were accompanied by a local faculty member when the incident occurred, the university said.\nIowa Governor Kim Reynolds released a statement on X Monday, saying she's been in contact with Iowa's federal delegation and the state department \"in response to this horrifying attack.\"\nCornell College is a private liberal arts college in Mount Vernon, Iowa."}, {"id": "59cd6980-1a55-4968-a614-2d27b397cb2a", "title": "Man arrested for shooting his ex - girlfriend twice on West Side , SAPD says", "date": "2024-06-11 01:30", "url": "https://www.ksat.com/news/local/2024/06/11/man-arrested-for-shooting-his-ex-girlfriend-twice-on-west-side-sapd-says/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "The shooting happened around 4 p.m. on Monday in the 7600 block of Culebra Road.\nSAN ANTONIO – San Antonio police arrested a man accused of shooting his ex-girlfriend twice on the West Side.\nThe shooting happened around 4 p.m. on Monday in the 7600 block of Culebra Road.\nThe woman then drove through a CVS parking lot, and the man fired several gunshots at her vehicle, according to SAPD.\nAs officers were driving to the man’s address, he contacted SAPD to report a motor vehicle accident involving his ex-girlfriend, officials said."}, {"id": "82d5c5d7-5e28-4c74-81fe-af0a54fe1c06", "title": "Four Cornell College Educators Stabbed In Northeast China , Say US Officials : Report", "date": "2024-06-11 03:30", "url": "https://www.benzinga.com/news/24/06/39263166/four-cornell-college-educators-stabbed-in-northeast-china-say-us-officials-report", "domain": "benzinga.com", "domain_classification": "Unknown", "message": "Loading... Loading...Four American educators from a small Iowa university were reportedly stabbed in a public park in northeast China’s Jilin province over the weekend, according to U.S. media and U.S. government officials.\nWhat Happened: The educators from Cornell College were visiting a partner university in China when the attack occurred, reported Reuters on Tuesday.\nThe incident took place in Jilin City, and the partner university was Beihua University, according to College spokesperson Jen Visser.\nThe U.S. State Department is aware of the reports of the stabbing incident in China and is monitoring the situation, according to Visser.\nMoreover, China has urged the U.S. to reconsider its nuclear stance, following comments from a senior U.S. official about potentially increasing warheads to counter the growing nuclear capabilities of China, Russia, and North Korea."}, {"id": "b37c58c9-fa12-4efb-bd83-3fe164088fa8", "title": "70 - Year - Old Woman : 70 - year - old woman thrashed | Ludhiana News", "date": "2024-06-11 02:00", "url": "https://timesofindia.indiatimes.com/city/ludhiana/70-year-old-woman-thrashed/articleshow/110886684.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently70-year-old man stabbed in 'revenge' in Delhi, accused heldA 42-year-old man, Amit, was arrested for stabbing a 70-year-old in north Delhi.\nAmit claimed revenge for alleged mistreatment of his female friend, a maid at the victim's home, and carried out a knife attack without theft motive.\nMaoists kill villager, allege he was police informerIn Chhattisgarh's Kondagaon, Maoists shot dead a villager, accusing him of being a police informer.\nLudhiana: Acting on the orders of Punjab Women Commission , police have now registered an FIR against six accused for allegedly thrashing a 70-year-old woman in March at Kanech village.\nA case has now been registered on the complaint of Manjeet Kaur against Najadr Singh and his five unidentified aides."}, {"id": "a53d5bfc-1e32-49e6-931e-6559cb841679", "title": "Israel establishes new Iron Dome battalion amid rising drone attacks from Lebanon", "date": "2024-06-11 02:15", "url": "https://www.prokerala.com/news/articles/a1538520.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Jerusalem, June 11 : The Israeli military has said it has established a new battalion solely focused on operating the country's Iron Dome aerial defence system to better intercept the growing number of drones from Lebanon.\n\"The establishment of the battalion will enable the expansion of the Iron Dome batteries' deployment and improve Israel's aerial defence,\" the Israel Defense Forces (IDF) said on Monday in a statement.\nEarlier on Monday, four drones launched from Lebanon fell within the territory under Israeli control.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah towards Israel in solidarity with Hamas' attack on Israel on October 7.\nSince the beginning of the Gaza conflict, the Israeli military has intercepted 150 aircraft fired toward Israel from multiple fronts, according to army figures."}, {"id": "351b17df-a8dd-47df-a8c8-72f819995dac", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 01:45", "url": "https://abc11.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "33a833e4-3dad-424a-a616-0600ecce8fe4", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 01:30", "url": "https://abc13.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "39ed837f-1f03-410a-946b-a8b06b8aaf86", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 01:00", "url": "https://abc7.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "98dcf9e8-b488-44d4-8716-08ea0f69212f", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 02:45", "url": "https://abc7ny.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "a4a32267-ae33-418c-b4eb-48a69d544f60", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 01:30", "url": "https://abc7news.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "77128932-bea6-479f-acc7-92b6bdc33519", "title": "  She took everything from us ; Father of 3 - year - old murdered at Ohio grocery store speaks in court – WHIO TV 7 and WHIO Radio", "date": "2024-06-11 01:45", "url": "https://www.whio.com/news/local/she-took-everything-us-father-3-year-old-murdered-ohio-grocery-store-speaks-court/BQLRXEFENZGKXM3SO2VZA5BLOU/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "3b608a6f-c82e-45ab-92c4-dbe0c57649f6", "title": "Israel Establishes New Iron Dome Battalion Amid Rising Drone Attacks From Lebanon", "date": "2024-06-11 02:15", "url": "https://menafn.com/1108317744/Israel-Establishes-New-Iron-Dome-Battalion-Amid-Rising-Drone-Attacks-From-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Jerusalem, June 11 (IANS) The Israeli military has said it has established a new battalion solely focused on operating the country's Iron Dome aerial defence system to better intercept the growing number of drones from Lebanon.\n\"The establishment of the battalion will enable the expansion of the Iron Dome batteries' deployment and improve Israel's aerial defence,\" the Israel Defense Forces (IDF) said on Monday in a statement.\nEarlier on Monday, four drones launched from Lebanon fell within the territory under Israeli control.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah towards Israel in solidarity with Hamas' attack on Israel on October 7.\nSince the beginning of the Gaza conflict, the Israeli military has intercepted 150 aircraft fired toward Israel from multiple fronts, according to army figures."}, {"id": "5e732262-5755-45b2-85f6-48c9932e1271", "title": "Suspect in fire , shooting at Miami apartment building in custody : Mayor", "date": "2024-06-11 00:30", "url": "https://abc30.com/suspect-in-fire-shooting-at-miami-apartment-building-in-custody-m/14932047/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Suspect in fire, shooting at Miami apartment building in custody: MayorA person suspected of shooting a worker at a Miami residential building and \"intentionally\" starting a fire that quickly engulfed the complex is in custody, authorities said.\nET on Monday at Temple Court Apartments, according to Miami Mayor Francis Suarez.\nResponding firefighters rescued more than 40 people, including some from their balconies, the mayor said, calling their actions \"heroic.\"\nFirefighters discovered the fire on the third floor of the apartment building, according to Miami Fire-Rescue spokesperson Lt. Pete Sanchez.\nThe building is a wood-frame structure, which \"explains the intensity and the rapid spread of the fire,\" he said."}, {"id": "96bce75d-8d24-4872-b6af-fbfbf885e51b", "title": "Saab 37 Viggen Fighter : The Only Jet to Ever Catch an SR - 71 Blackbird", "date": "2024-06-11 00:00", "url": "https://nationalinterest.org/blog/buzz/saab-37-viggen-fighter-only-jet-ever-catch-sr-71-blackbird-211380", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The Swedish Saab JA-37 Viggen managed to lock onto an SR-71, a rare feat due to the Blackbird's superior speed.\nSummary and Key Points: The SR-71 Blackbird, the fastest plane to ever fly, retired decades ago but remains unmatched in legacy despite modern jets like the F-22 and F-35.\nThe Swedish Saab JA-37 Viggen managed to lock onto an SR-71, a rare feat due to the Blackbird's superior speed.\nSR-71 Blackbird vs. Saab 37 Viggen: A Cold War Aerial EncounterThe fastest plane to ever fly retired from service decades ago.\nWhen the American-made SR-71 Blackbird was introduced during the Cold War, its innovative technologies, electronics, and avionics pushed it to feats never before seen."}, {"id": "f60088e0-70e0-4903-b18a-ef6a65ca91c5", "title": "Houthis claim : We arrested an American - Israeli spy network", "date": "2024-06-11 03:15", "url": "https://www.israelnationalnews.com/news/391413", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels claimed on Monday they had arrested members of an “American-Israeli spy network”, The Associated Press reported.\nMaj. Gen. Abdulhakim al-Khayewani, head of the Houthis’ intelligence agency, announced the arrests, claiming the spy network had first operated out of the US Embassy in Sanaa.\nAl-Khayewani depicted the spy network as having worked for decades to infiltrate Yemen’s economy, agriculture, health system and other sectors to destroy them, according to AP.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis.\nIn mid-January, with support from other countries, the US and Britain targeted just under 30 Houthi locations with 150 different weapons."}, {"id": "da003d51-c9c4-4927-a899-3727e626c3ef", "title": "U . S . Army Officer Confirms Russian A - 50 Radar Jet Was Shot Down With Patriot Missile", "date": "2024-06-11 00:30", "url": "https://www.yahoo.com/news/u-army-officer-confirms-russian-225524455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Elements of a German Patriot air defense system stand on a snow-covered field in Miaczyn, southeastern Poland, in April 2023.\nMost dramatically, a string of Russian aircraft was downed over Russian territory that borders northeastern Ukraine.\nA screen capture from a Ukrainian Air Force video shows images of three Russian helicopters and two Russian fighters painted on the side of a Patriot air defense system.\nhttps://www.twitter.com/magictouch190/status/1800259370992726351With all this in mind, it’s not surprising that Ukraine’s highly valued, long-reaching Patriot air defense system was tasked against the A-50.\nIn demonstrating the vulnerability of Russian aircraft patrolling over the Sea of Azov, the January 15 shootdown might have been expected to push these assets back."}, {"id": "f53b06f7-4a78-402c-a18c-38a1c22678a5", "title": "Czech PM suspects Russia involvement in foiled arson attack on Prague buses", "date": "2024-06-11 03:30", "url": "https://www.yahoo.com/news/czech-pm-suspects-russia-involvement-011835788.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Czech Prime Minister Petr Fiala said on June 10 that Russia may be linked to an attempted arson attack on Prague city buses last week.\nAccording to police, he had been in Czechia for five days prior to the failed attack.\nFiala stated during a news conference that the attack might have been organized and funded by Russia.\nIn May, the Polish government arrested nine people from a Russian spy ring in connection to alleged sabotage plots.\nPolish Prime Minister Donald Tusk said in an interview that acts of alleged sabotage include \"beatings, arson, and attempted arson,\" not just in Poland but in other countries as well."}, {"id": "baae648d-cdbf-4205-83d0-821392deea07", "title": "North Olmsted offering community counseling services after fatal stabbing at Giant Eagle", "date": "2024-06-11 00:00", "url": "https://www.news-herald.com/2024/06/10/north-olmsted-offering-community-counseling-services-after-fatal-stabbing-at-giant-eagle/", "domain": "news-herald.com", "domain_classification": "Unknown", "message": "Ellis stole two knives from the Volunteers of America Thrift Store next to the Giant Eagle near Lorain Road and Dover Center Road in North Olmsted, authorities said.\nAfter obtaining the weapons, she walked next door to Giant Eagle.\nA 3:03 p.m., North Olmsted Police Dispatch received several 911 calls reporting that a Black woman dressed in all black was stabbing people in the parking lot of Giant Eagle, according to authorities.\nOfficers arrived and located Ellis walking toward Dover Center Road still carrying the kitchen knife used in the attack, police said.\nEllis was taken into custody without resistance and was transported to the North Olmsted Jail."}, {"id": "addd66d6-0df7-433e-8aa1-1569a34b9401", "title": "The Latest | UN endorses US - backed cease - fire plan as Blinken holds talks on Gaza", "date": "2024-06-11 01:30", "url": "http://www.middletownpress.com/news/article/the-latest-blinken-holds-talks-on-gaza-in-the-19506546.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Jehad Alshrafi/AP Smoke rises in the Palestinians Al Fara'a refugee camp in the occupied West Bank following an Israeli military raid, Monday, June 10, 2024.\nMajdi Mohammed/AP Israeli military officers march in the Palestinians Al Fara'a refugee camp in the occupied West Bank following an Israeli military raid, Monday, June 10, 2024.\nMajdi Mohammed/AP Israeli military officers march in the Palestinians Al Fara'a refugee camp in the occupied West Bank following an Israeli military raid, Monday, June 10, 2024.\nJehad Alshrafi/AP Smoke rises in the Palestinians Al Fara'a refugee camp in the occupied West Bank following an Israeli military raid, Monday, June 10, 2024.\nAdvertisement Article continues below this adIsrael rescued a fourth hostage from a nearby apartment in the same raid on Saturday afternoon."}, {"id": "6daba8ae-1b9e-4070-9a1f-8538f16f6a53", "title": "BRICS Expresses Its  Grave Concern  Over Gaza Violence", "date": "2024-06-11 04:00", "url": "https://www.ndtv.com/world-news/brics-expresses-its-grave-concern-over-gaza-violence-5863130", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Israel has been continuing its military offensive in Gaza since Hamas launched attack in October 2023.\nThe BRICS nations on Monday expressed grave concern over the \"unprecedented\" escalation of violence in the Gaza Strip as a result of Israeli military operations and reaffirmed their support for Palestine's full membership in the United Nations.\nThey expressed grave concern over increasing attacks by Israel in Rafah, saying it would compound the \"dire\" humanitarian situation.\nThe ministers expressed \"serious concern at Israel's continued blatant disregard of international law, the UN Charter, UN resolutions and Court orders\", according to the statement.\nOver 35,000 people have been killed in Gaza in the Israeli offensive, according to Hamas-run authorities in Gaza."}, {"id": "7f7449bf-725c-4f0b-bd4b-0b6518518c28", "title": "Armed gardaí are hunting for convicted killer suspected of stabbing Dublin dad ( 34 ) to death", "date": "2024-06-11 02:30", "url": "https://www.independent.ie/irish-news/crime/armed-gardai-are-hunting-for-convicted-killer-suspected-of-stabbing-dublin-dad-34-to-death/a99611969.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Armed gardaí are hunting for convicted killer suspected of stabbing Dublin dad (34) to deathChief suspect had previously served time in jail for the ­killing of a womanFather stabbed to death at house in Finglas named locally, as manhunt underway for chief suspect in attackRobin Schiller Today at 03:30Armed gardaí are searching for a convicted killer who is suspected of stabbing a Dublin man to death over the weekend."}, {"id": "2665c847-37aa-4153-a895-aacaa97243f1", "title": "War buskers : Ukraine musicians raise money to send drone to front line for brother", "date": "2024-06-11 02:15", "url": "https://www.washingtonexaminer.com/news/world/3034622/war-buskers-ukraine-musicians-raise-money-drone-front-line/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "For hundreds of thousands of Ukrainian soldiers, that has meant years of service on the front lines of a grueling war against invading Russian forces.\n(Joel Gehrke, Washington Examiner)They have a more grave purpose, as well — they are raising money to raise money for purchase a first-person drone, one of the civilian technologies that Ukrainian forces have used with lethal effectiveness in the war.\nThey are far from unique among street musicians, also known as buskers, in Lviv.\n“Most of them are raising money,” said Mavdryk, the hotel receptionist.\n“All of them are raising money for the army, but not all give 100% of their raised money."}, {"id": "a49ed64d-4203-485a-aa02-9ca72716495d", "title": "USS Mason Enters the Mediterranean Sea After Seven Months in the Red Sea", "date": "2024-06-11 00:15", "url": "https://seapowermagazine.org/uss-mason-enters-the-mediterranean-sea-after-seven-months-in-the-red-sea/", "domain": "seapowermagazine.org", "domain_classification": "Unknown", "message": "The guided-missile destroyer USS Mason (DDG 87) sails in the Gulf of Aden Nov. 25, 2023.\nNaval Forces Europe and Africa / U.S. Sixth Fleet Public Affairs, June 8, 2024MEDITERRANEAN SEA – Arleigh Burke-class guided-missile destroyer USS Mason (DDG 87) transited the Suez Canal and entered the Mediterranean Sea, June 7, 2024.\nWhile operating in the Red Sea, Mason supported maritime security and stability in the Middle East, providing assurance to maritime traffic by deterring threats to the international rules based order and freedom of navigation.\nHeadquartered in Naples, Italy, NAVEUR-NAVAF operates U.S. naval forces in the U.S. European Command (USEUCOM) and U.S. Africa Command (USAFRICOM) areas of responsibility.\nU.S. 6th Fleet is permanently assigned to NAVEUR-NAVAF, and employs maritime forces through the full spectrum of joint and naval operations."}, {"id": "c8a7df9c-f2c9-4292-bc98-252f82abc358", "title": "Vancouver man with  religious delusion acquitted in wife 2021 stabbing death", "date": "2024-06-11 02:30", "url": "https://www.yahoo.com/news/vancouver-man-religious-delusions-acquitted-000609219.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PORTLAND, Ore. (KOIN) — A Vancouver man accused of stabbing his estranged wife to death in 2021 as part of a religious “prophecy” has been found not guilty by reason of insanity, according to court documents.\nJesus told him to make a sacrifice for the good of all,” according to court documents.\nOregon’s minimum wage set to increase in July 2024According to court documents, Murrah sought therapy between August 2020 and November 2021.\nDuring that period, he consistently reported “hallucinations, hearing voices, psychosis, and religious delusions”, court documents stated.\nCourt documents show Monica filed for a restraining order against her husband in July 2020 amid their ongoing divorce."}, {"id": "2ee3b515-6bcb-4cd4-b7ee-6cb86a6342aa", "title": "Yogi Adityanath : Yogi condemns cowardly terror attack on pilgrims in Kashmir | Lucknow News", "date": "2024-06-11 03:30", "url": "https://timesofindia.indiatimes.com/city/lucknow/yogi-condemns-cowardly-terror-attack-on-pilgrims-in-kashmir/articleshow/110887393.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recentlyUP CM Yogi Adityanath condemns 'cowardly attack' on pilgrims in Jammu-KashmirCM Yogi Adityanath condemned the terrorist attack on pilgrims in Jammu and Kashmir's Reasi district, expressing condolences for the victims and directing officials to ensure the injured receive proper treatment.\nReasi terrorist attack: Kapil Sharma, Hina Khan, Aly Goni and other celebs condemn the attack on pilgrimsA terrorist attack on a bus carrying pilgrims from the Shiv Khori cave shrine in Jammu and Kashmir's Reasi district has shocked the nation.\nDelhi, Mumbai On Alert After Attack On Bus With Pilgrims At J&Ks ReasiDelhi and Mumbai on high alert after bus attack on pilgrims in Jammu and Kashmirs Reasi district.\nLucknow: Uttar Pradesh chief minister Yogi Adityanath on Sunday termed the terror attack on a bus carrying pilgrims in Reasi district of Jammu & Kashmir as a “cowardly act” and expressed grief over the loss of lives.“The cowardly attack on pilgrims in Jammu & Kashmir is extremely sad.\nThe incident took place around 6.10 pm near Teryath village in Reasi district."}, {"id": "2e284c9b-655d-4694-9171-91faa40a09fc", "title": "Bail set at $5M for woman accused of fatally stabbing 3 - year - old outside an Ohio store", "date": "2024-06-11 00:15", "url": "https://abc6onyourside.com/news/local/bail-set-at-5m-for-woman-accused-of-fatally-stabbing-3-year-old-outside-an-ohio-store", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "CLEVELAND (AP) — Bail was set at $5 million Monday for a woman who authorities say fatally stabbed a as he sat in a grocery cart outside an .\nEllis first told the judge “I don’t know,” then stopped answering despite multiple requests by the judge.\nRusso then asked Ellis why she wasn't answering, and Ellis again remained silent.\nIn the courtroom, Ellis said she asked assistant Cuyahoga County Public Defender Linda Hricko not to read her indictment.\nWhen Russo asked if Hricko did, Ellis whispered no but Hricko nodded her head yes."}, {"id": "993851e7-ef54-4013-ac79-a29b3a62dcf8", "title": "Rudy Tomjanovic Credits Clyde Drexler For Keeping 1995 Houston Rockets Afloat", "date": "2024-06-11 02:00", "url": "https://www.si.com/fannation/backinthedaynba/rudy-tomjanovic-credits-clyde-drexler-for-keeping-houston-rockets-afloat-in-1995-championship-seas-01j01z1haa25", "domain": "si.com", "domain_classification": "Unknown", "message": "“The only reason we made it is because it was Clyde”Hall of Famer and 2024 Chuck Daly Lifetime Achievement recipient Rudy Tomjanovich reveals the driving force behind the second of his back to back championships with the Rockets@NBA_Coaches | @TheFrankIsola @GregAnthony50 pic.twitter.com/XjZEmMgXbm"}, {"id": "ecbca2bc-bb44-4f41-961a-6093ef5d653f", "title": "Julian Wood stabbing suspect SMIRKS in court as three - year - old father pleads with judge to  keep this monster behind bars  ", "date": "2024-06-11 01:15", "url": "https://www.dailymail.co.uk/news/article-13515371/Julian-Woods-killer-Bionca-Ellis-smirks.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "She even turned directly towards the camera and grinned, before pleading not guilty to the charges stemming from Wood's murder at the Giant Eagle grocery store in North Olmstead, Cleveland on June 2.\nBut just moments later, Wood's grieving father, Jared Wood, pleaded for the judge to 'do everything you can to keep this monster behind bars' and prosecutors announced they would seek the death penalty.\nIt remains unclear why Ellis allegedly attacked the family as they left the grocery store.\nPolice say Ellis had no previous connection with the Wood family and have called the attack 'entirely a random act of violence.'\nIt was about 45 minutes later that Ellis appeared in court and pleaded not guilty."}, {"id": "f16343be-6065-498b-8e9e-80dba253ca58", "title": "4 instructors from Iowa Cornell College injured in  serious incident  in China , school says - LocalNews8 . com", "date": "2024-06-11 01:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/10/4-instructors-from-iowas-cornell-college-injured-in-serious-incident-in-china-school-says/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Sarah Dewberry and Yong Xiong, CNN(CNN) — Four instructors from an Iowa college who were visiting their partner university were injured in a park in northeastern China on Monday in a stabbing incident, according to a school spokesperson.\nThe instructors from Cornell College in Mount Vernon, Iowa, were at a public park with a faculty member of their partner institution when they were injured “in a serious incident,” school President Jonathan Brand said in a statement to the college community.\nSchool spokesperson Jen Visser told CNN the stabbing incident happened in Jilin City and the partner school is Beihua University.\nThe US State Department is aware of reports of a stabbing incident in China and is monitoring the situation, according to a spokesperson.\nKim Reynolds said, “I am in touch with Iowa’s federal delegation and the state department in response to this horrifying attack."}, {"id": "de08ac66-fb7c-4a60-8cc9-7059ac2e6926", "title": "Monster Stabs a Toddler to Death , Smirks in Court", "date": "2024-06-11 02:00", "url": "https://www.independentsentinel.com/monster-stabs-a-toddler-to-death-smirks-in-court/", "domain": "independentsentinel.com", "domain_classification": "Unknown", "message": "A woman is accused of killing a 3-year-old boy in a grocery store parking lot in Cleveland.\nThe 32-year-old named Bionca Ellis was seen stalking 3-year-old Julian Wood and his mother before killing the boy with a knife.\nWith Julian still in the grocery cart seat, Ellis is accused of stabbing the boy in the face and the back.\nLast week, a Cuyahoga County grand jury indicted Ellis on charges that include murder, aggravated murder, attempted murder, felonious assault, and endangering children.\nThis monster killed a 3 year old boy in a grocery store parking lot in Cleveland, Ohio."}, {"id": "c224d244-3c74-4898-9987-bbade5d267b6", "title": "French police officer allegedly shoots teenager dead while fleeing control", "date": "2024-06-11 04:15", "url": "https://gulfnews.com/world/europe/french-police-officer-allegedly-shoots-teenager-dead-while-fleeing-control-1.1718075936234", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Caen: French police were questioning an officer on Monday after the fatal shooting of a 19-year-old man as he fled an attempted control of a vehicle for speeding, prosecutors said.\nThe driver refused to stop and sped away before being forced to halt by a second police car.\nOne person escaped while another was detained and charged on suspicion of robbery because the vehicle had been reported as stolen.\n\"The officer then used a stun gun\" while a colleague drew and \"used her service weapon, fatally striking him in the chest\".\nThe officer who fired the shot was still being held for questioning on Monday evening by the police's IGPN internal affairs department."}, {"id": "46c9b2ec-c2d8-4781-9720-5f743429e94f", "title": "Four US college instructors stabbed in public park in China", "date": "2024-06-11 02:30", "url": "https://www.yahoo.com/news/four-us-college-instructors-hurt-011521932.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Four US college instructors stabbed in public park in ChinaThe instructors had been visiting a local temple on Monday when they were attacked by a man with a knife [Reuters]Four US university tutors are in hospital after they were stabbed by an unknown assailant at a public park in China.\nThe Iowa Cornell College instructors were injured in a \"serious incident\" during a daytime visit to the park in Jilin province, northern China, a college statement said.\nIowa Representative Adam Zabner said his brother, David, was one of the four instructors injured in the incident, which he described as a stabbing.\nMr Zabner said his brother had been stabbed in the arm at Beishan Park and was recovering in hospital.\nCornell College said the four instructors had been teaching \"as part of a partnership with a university in China\"."}, {"id": "00e80637-a041-4cc7-b1ec-3d8345d98b38", "title": "US Cornell College instructors injured in assault in China , school says", "date": "2024-06-11 02:30", "url": "https://www.bbc.co.uk/news/articles/c844q27v732o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Four US university tutors are in hospital after they were stabbed by an unknown assailant at a public park in China.\nThe Iowa Cornell College instructors were injured in a \"serious incident\" during a daytime visit to the park in Jilin province, northern China, a college statement said.\nIowa Representative Adam Zabner said his brother, David, was one of the four instructors injured in the incident, which he described as a stabbing.\nMr Zabner said his brother had been stabbed in the arm at Beishan Park and was recovering in hospital.\nCornell College said the four instructors had been teaching \"as part of a partnership with a university in China\"."}, {"id": "db6f379f-513d-4953-a440-8467187737e7", "title": "Gaza violence : BRICS expresses  grave concern  over  unprecedented  escalation", "date": "2024-06-11 03:30", "url": "https://www.siasat.com/gaza-violence-brics-expresses-grave-concern-over-unprecedented-escalation-3042430/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "New Delhi: The BRICS nations on Monday expressed grave concern over the “unprecedented” escalation of violence in the Gaza Strip as a result of Israeli military operations and reaffirmed their support for Palestine’s full membership in the United Nations.\nThey expressed grave concern over increasing attacks by Israel in Rafah, saying it would compound the “dire” humanitarian situation.\nThe ministers expressed “serious concern at Israel’s continued blatant disregard of international law, the UN Charter, UN resolutions and Court orders”, according to the statement.\nIsrael has been continuing its military offensive in Gaza as part of its retaliation to the unprecedented attack on Israeli cities by Hamas on October 7.\nOver 35,000 people have been killed in Gaza in the Israeli offensive, according to Hamas-run authorities in Gaza."}, {"id": "95702b76-55b1-4233-80f9-c4d2b284b484", "title": "BRICS expresses  grave concern  over  unprecedented  escalation of violence in Gaza", "date": "2024-06-11 00:45", "url": "https://www.theweek.in/wire-updates/national/2024/06/11/del149--brics-gaza-graveconcern.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "New Delhi, Jun 10 (PTI) The BRICS nations on Monday expressed grave concern over the \"unprecedented\" escalation of violence in the Gaza Strip as a result of Israeli military operations and reaffirmed their support for Palestine's full membership in the United Nations.\nThey expressed grave concern over increasing attacks by Israel in Rafah, saying it would compound the \"dire\" humanitarian situation.\nThe ministers expressed \"serious concern at Israel's continued blatant disregard of international law, the UN Charter, UN resolutions and Court orders\", according to the statement.\nIsrael has been continuing its military offensive in Gaza as part of its retaliation to the unprecedented attack on Israeli cities by Hamas on October 7.\nOver 35,000 people have been killed in Gaza in the Israeli offensive, according to Hamas-run authorities in Gaza."}, {"id": "a98d2765-fa5a-49fd-b33c-3de03359d200", "title": "How Israeli Raid Freed 4 Hostages , Killed at Least 274 Palestinians in Gaza", "date": "2024-06-11 02:15", "url": "https://www.newsmax.com/world/globaltalk/israel-palestinians-hamas-war-hostages-casualties/2024/06/10/id/1168220/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "The Israeli raid caught everyone off guard, from the Hamas militants guarding four hostages in two different buildings to the thousands of civilians who soon found themselves running for their lives through a blistering crossfire.\nBy the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nHere's how it unfolded, according to the Israeli military and Palestinian witnesses.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "5898ae10-1647-4102-a9f8-ed9b7b268232", "title": "Yemen Houthis Upset US Middle East Security Calculations", "date": "2024-06-11 04:15", "url": "https://www.wilsoncenter.org/article/yemens-houthis-upset-us-middle-east-security-calculations", "domain": "wilsoncenter.org", "domain_classification": "Unknown", "message": "The emergence of the Houthi missile-and-drone capability as a major factor in Middle East security is just such an event.\nThe Houthis targeted six commercial vessels in the Red Sea and, in addition, one each in the Arabian and Mediterranean Seas.\nThe Houthis and IranFew, if any, US or Middle East analysts foresaw the Houthis, a Zaidi Shia minority in a Sunni-dominated country, becoming a major factor in Red Sea security.\nWhether the Houthis will end their Red Sea attacks if and when there is a ceasefire in the Israel-Hamas War remains to be seen.\nWhether the Houthis will end their Red Sea attacks if and when there is a ceasefire in the Israel-Hamas War remains to be seen."}, {"id": "6bfd9145-82ce-4aa6-a656-66683810370c", "title": "Brockton stabbing injures 2 – NECN", "date": "2024-06-11 02:30", "url": "https://www.necn.com/news/local/2-injured-in-brockton-stabbing/3256210/", "domain": "necn.com", "domain_classification": "Unknown", "message": "One man is dead and another is seriously injured after a stabbing Monday in Brockton, Massachusetts.\nPolice in Brockton responded to Melrose Avenue shortly after 6:45 p.m. to find two victims suffering from severe stab wounds.\nThe Plymouth County District Attorney's Office said one victim was brought to Good Samaritan Hospital in Brockton, where he was pronounced dead.\nThe other male victim was brought to South Shore Hospital in Weymouth.\nBrockton police said they were looking for the person responsible."}, {"id": "d1f3e3eb-ad6c-4b1d-972d-617c99aa1a78", "title": "MPD : Woman charged with murder after stabbing boyfriend", "date": "2024-06-11 00:30", "url": "https://www.yahoo.com/news/mpd-woman-charged-murder-stabbing-222559413.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MEMPHIS, Tenn. — A woman has been charged with second-degree murder after police say she stabbed her boyfriend to death.\nShe said that Ford allegedly pushed her and she grabbed two brand-new knives that were still inside the plastic packaging.\nShe said that Ford allegedly pushed her into a wall, got on top of her and started hitting her in the face with an open hand.\nMPD: Couple arrested, police say man pointed gun at woman and babyHarper says she turned and “somehow” stabbed Ford in the torso.\nHarper admitted to investigators that she’d stabbed Ford in the past."}, {"id": "8ab5d622-8b96-4aef-a6b5-4fb870495e4f", "title": "The Library of Congress wants more visitors . Spider - Man , Santana and Lincoln are on deck", "date": "2024-06-11 00:00", "url": "https://www.startribune.com/library-of-congress-launches-new-collecting-memories-exhibit-in-a-bid-to-draw-more-tourists/600372451/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "WASHINGTON — The Library of Congress is unveiling an eclectic new exhibit drawing on the institution's vast historical archives and designed to make the library a more popular and accessible destination for visitors and tourists.\n''These items are an expression of our collective history,'' said Carla Hayden, the official librarian of Congress.\nThe new exhibit is part of a campaign to make the Library of Congress more attractive to everyday tourists and school groups.\n''You usually don't go to the Library of Congress because you don't know that the Library of Congress is more than just a library,'' Rubinstein said.\nThe 127 items on display are all drawn from the Library of Congress' own internal collections, which number more than 178 million pieces."}, {"id": "e8d1a1ef-4fe3-4f57-8cee-88e3a229a43c", "title": "Tom Cruise Mission : Impossible 8 Co - Star Reveals One Request He Had For The Film , And Because Christopher McQuarrie  Delivered , Im So Pumped", "date": "2024-06-11 02:00", "url": "https://www.cinemablend.com/movies/tom-cruise-mission-impossible-8-shea-whigham-request-film-christopher-mcquarrie-delivered", "domain": "cinemablend.com", "domain_classification": "Unknown", "message": "That’s because director/co-writer Christopher McQuarrie “delivered” on a request the actor had for Mission: Impossible 8, and I’m pumped to see it onscreen.\nDuring his time on Dead Reckoning, Whigham asked McQuarrie to craft a specific kind of scene for him to perform in the follow-up, which he described as follows:I said to Christopher McQuarrie on [Mission: Impossible – Dead Reckoning]: ‘I don’t want a bigger trailer.\nBy the end of Mission: Impossible - Dead Reckoning, it’s unclear if Jasper Briggs’ view on Ethan Hunt has softened or if he still considers him a threat.\nMission: Impossible 8 opens in theaters on May 23, 2025.\nAll of the released Mission: Impossible movies can be streamed with a Paramount+ subscription."}, {"id": "ab0dd6d3-23fc-45ea-9ec6-616819668a3e", "title": "Jammu : Reasi militant attack on pilgrims is a worrying turn for the region", "date": "2024-06-11 03:15", "url": "https://scroll.in/article/1069099/why-the-militant-attack-on-pilgrims-is-a-worrying-turn-for-the-jammu-region", "domain": "scroll.in", "domain_classification": "Unknown", "message": "Hub of religious tourismWhen it comes to religious tourism in the Hindu-majority Jammu region, Reasi district tops the chart.\nWhile it is one of the most revered Shiva shrines in Jammu region, its management and functioning was institutionalised only in 2008 when the state government passed The Jammu & Kashmir Shri Shiv Khori Shrine Act.\nA new challengeSunday’s attack has emerged as a fresh challenge for the security forces in the Pir Panjal region.\nAt the same time, there has been a resurgence of militant attacks in the mountainous Pir Panjal belt of Jammu region.\n“The attack is part of a nefarious design to somehow spread turmoil to the Jammu region but we are determined to thwart such an attempt,” Sinha told reporters in Jammu."}, {"id": "f494afeb-8950-44b2-a539-45d625078235", "title": "Library of Congress launches new  Collecting Memorie exhibit in a bid to draw more tourists – Metro US", "date": "2024-06-11 01:45", "url": "https://www.metro.us/library-of-congress-launches-new-collecting-memories-exhibit-in-a-bid-to-draw-more-tourists/", "domain": "metro.us", "domain_classification": "Unknown", "message": "People visit the exhibit, “Collecting Memories: Treasures from the Library of Congress,” during a media preview at the Library of Congress, Monday, June 10, 2024, in Washington.\nWASHINGTON (AP) — The Library of Congress is unveiling an eclectic new exhibit drawing on the institution’s vast historical archives and designed to make the library a more popular and accessible destination for visitors and tourists.\n“We want people to see themselves in our exhibit.”The new exhibit is part of a campaign to make the Library of Congress more attractive to everyday tourists and school groups.\n“You usually don’t go to the Library of Congress because you don’t know that the Library of Congress is more than just a library,” Rubinstein said.\nThe 127 items on display are all drawn from the Library of Congress’ own internal collections, which number more than 178 million pieces."}, {"id": "084dc76f-7c63-45ba-a477-4f8ba75b0d03", "title": "Workers Struggles : The Americas", "date": "2024-06-11 01:45", "url": "https://www.wsws.org/en/articles/2024/06/11/awoy-j11.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The attack took place as the teachers, members of section 22 of the teachers’ union, CNTE, were blocking the Francisco Madero avenue.\nArgentine university workers conduct 48-hour strikeUniversity workers across Argentina carried out a 48-hour strike last Tuesday and Wednesday.\nA spokesperson for the University workers union (CONADU) declared that the struggle will have to get “deeper” but gave no details.\nNorth Carolina airport contract workers demand an end to poverty wagesContract workers at North Carolina’s Charlotte Douglas International Airport staged a demonstration June 4 to demand an end to poverty wages, obtain affordable healthcare and better working conditions.\nThe threatened strike action would have been the first since the right-to-strike was stripped from TTC workers in 2011 by the provincial Liberal government just as workers were moving into strike action at that time."}, {"id": "a5651365-c448-48cd-9c2f-17cdd0d7b17f", "title": "Persistent and Growing List of Lies about Israel", "date": "2024-06-11 01:30", "url": "https://ricochet.com/1654129/persistent-and-growing-list-of-lies-about-israel/", "domain": "ricochet.com", "domain_classification": "Unknown", "message": "It’s also worthwhile to assess whether these lies affect Israel’s running of the war.\nShe cites what she says appears to be Israel’s intention to destroy Palestinians as a group “in whole or in part”, a key clause in the Convention against Genocide.\nThey have no reservations about telling lies about the enemy (Israel); this is supported by their belief in taqqiya, their commitment to protect the faith.\nThey are determined to destroy Israel and its people, whatever the cost.\nWhy the international community thinks the Palestinians or Hamas will change their attitudes is wishful thinking."}, {"id": "24465557-9a00-4df3-bf3e-a097b97528a5", "title": "The Library of Congress wants more visitors . Spider - Man , Santana and Lincoln are on deck", "date": "2024-06-11 01:45", "url": "https://lasvegassun.com/news/2024/jun/10/the-library-of-congress-wants-more-visitors-spider/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "The Library of Congress wants more visitors.\nSpider-Man, Santana and Lincoln are on deckWASHINGTON (AP) — The Library of Congress is unveiling an eclectic new exhibit drawing on the institution’s vast historical archives and designed to make the library a more popular and accessible destination for visitors and tourists.\n“These items are an expression of our collective history,” said Carla Hayden, the official librarian of Congress.\n“You usually don't go to the Library of Congress because you don't know that the Library of Congress is more than just a library,” Rubinstein said.\nThe 127 items on display are all drawn from the Library of Congress' own internal collections, which number more than 178 million pieces."}, {"id": "c5fea6c1-c14b-4840-98ca-99b0b7ea6835", "title": "Two people stabbed , seriously injured in Brockton , police say", "date": "2024-06-11 01:45", "url": "https://www.yahoo.com/news/two-people-stabbed-seriously-injured-004609224.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One man dead, another seriously injured in Brockton double stabbing, police sayA double stabbing in Brockton on Monday night that left one man dead and another seriously injured is under investigation.\nToday at 7:40 pm, @MassStatePolice were notified of a double stabbing at 23 Melrose Ave.\nDownload the FREE Boston 25 News app for breaking news alerts.\nFollow Boston 25 News on Facebook and Twitter.\n| Watch Boston 25 News NOW"}, {"id": "0408da06-27ae-40b5-bed8-ee4b15989392", "title": "South Korea fires warning shots at North Korea troops for violating border", "date": "2024-06-11 02:30", "url": "https://www.yahoo.com/news/south-korea-fired-warning-shots-015533091.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "South Korean soldiers fired warning shots after North Korean troops violated the border earlier this week, according to media reports.\nSeoul’s military said South Korean soldiers fired warning shots at the time.\nAfter our military issued warning broadcasts and warning shots, they retreated northward,” Seoul’s Joint Chiefs of Staff (JCS) said.\nNorth Korea began sending balloons carrying waste and animal faeces south across the border last month in response to propaganda sent north by South Korean activists.\nSouth Korea resumed loudspeaker broadcasts on Sunday, blaring K-pop music and world news toward the northern side."}, {"id": "9ee85953-0316-4898-96c2-29502f63f76a", "title": "South Korea fires warning shots at North Korea troops for violating border", "date": "2024-06-11 04:00", "url": "https://www.telegraph.co.uk/world-news/2024/06/11/north-korea-south-border-warning-shots/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "South Korean soldiers fired warning shots after North Korean troops violated the border earlier this week, according to media reports.\nYonhap news agency reported on Tuesday that North Korean soldiers briefly crossed the heavily fortified border before retreating back to their territory on Sunday.\nSeoul’s military said South Korean soldiers fired warning shots at the time.\nAfter our military issued warning broadcasts and warning shots, they retreated northward,” Seoul’s Joint Chiefs of Staff (JCS) said.\nNorth Korea began sending balloons carrying waste and animal faeces south across the border last month in response to propaganda sent north by South Korean activists."}, {"id": "3791d1a6-397f-4967-8d7f-910abf25f76c", "title": "Patton Prayer : Discussing the famed general with author Alex Kershaw", "date": "2024-06-11 00:30", "url": "https://www.marinecorpstimes.com/news/your-military/2024/06/10/pattons-prayer-discussing-the-famed-general-with-author-alex-kershaw/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "And while that tale has certainly been well-plodded, author and historian Alex Kershaw latest book, “Patton’s Prayer: A True Story of Courage, Faith, and Victory in World War II,” offers a deep dive into the course altering decision making surrounding the Bulge.\nI want a prayer.’ Thus, Patton’s Prayer was born.\nYou can say they were just praying for survival, but it does show how much faith matters to people who didn’t think they were going to live.\nOne of the reasons why he calls on his chaplain is that he didn’t think his men were praying enough.\nPatton’s prayer was answered."}, {"id": "4c71bd5b-db25-4991-b7a4-a1b670132fbd", "title": "Patton Prayer : Discussing the famed general with author Alex Kershaw", "date": "2024-06-11 00:00", "url": "https://www.navytimes.com/news/your-military/2024/06/10/pattons-prayer-discussing-the-famed-general-with-author-alex-kershaw/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "And while that tale has certainly been well-plodded, author and historian Alex Kershaw latest book, “Patton’s Prayer: A True Story of Courage, Faith, and Victory in World War II,” offers a deep dive into the course altering decision making surrounding the Bulge.\nI want a prayer.’ Thus, Patton’s Prayer was born.\nYou can say they were just praying for survival, but it does show how much faith matters to people who didn’t think they were going to live.\nOne of the reasons why he calls on his chaplain is that he didn’t think his men were praying enough.\nPatton’s prayer was answered."}, {"id": "c82cbd36-2c4c-434f-9c30-cee76eac1b0f", "title": "Israel Must Lead the Jewish Community in its Fight Against Global Antisemitism", "date": "2024-06-11 04:00", "url": "https://www.frontpagemag.com/israel-must-lead-the-jewish-community-in-its-fight-against-global-antisemitism/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "The Jewish state has to figure out how to fight on many fronts and lead the charge against this worldwide scourge.\nBy creating a “Jewish Agency to Combat Antisemitism,” Israel can take the lead in this fight.\nAs Israel’s greatest external advocates, Diaspora Jews’ must continue their unwavering defense of the Jewish state in the public square.\nBy establishing the “Jewish Agency to Combat Antisemitism,” and rallying Jewish communities and allies worldwide, Israel can pave the way for a brighter, more secure future for the Jewish people.\nBy committing to combat antisemitism in all its forms, Israel ensures a thriving Jewish future free from persecution and ostracization."}, {"id": "cd4029d7-6d8a-43a6-a12a-e02676fba47e", "title": "Workshop examines media role to fight fake news , misinformation", "date": "2024-06-11 03:30", "url": "https://www.khmertimeskh.com/501503754/workshop-examines-medias-role-to-fight-fake-news-misinformation/", "domain": "khmertimeskh.com", "domain_classification": "Unknown", "message": "Workshop examines media’s role to fight fake news, misinformationKin Phea (L), Director General of the International Relations Institute of Cambodia, awards a certificate to a journalist at the ‘Third Mekong Journalism Training Workshop on the Role of Media’ at the Royal Academy of Cambodia.\nKin Phea (L), Director General of the International Relations Institute of Cambodia, awards a certificate to a journalist at the ‘Third Mekong Journalism Training Workshop on the Role of Media’ at the Royal Academy of Cambodia.\n“The Internet has become a powerful battleground for spreading fake news and misinformation,” Kin Phea, Director General of the International Relations Institute of Cambodia (IRIC), told Khmer Times yesterday.\n“In the fight against fraud, the ASEAN region has focused on digital literacy, censorship and the battle against fake news in the media,” he said.\nPhea said yesterday that misinformation can lead to social unrest, economic challenges and a threat to national security."}, {"id": "197363c9-d239-4421-8548-13c634d5e1c3", "title": "Black ops 6 file size estimates are all wrong", "date": "2024-06-11 03:15", "url": "https://www.windowscentral.com/gaming/no-call-of-duty-black-ops-6-wont-require-30985-gb-of-storage-space-at-launch", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "What you need to knowCall of Duty: Black Ops 6 was revealed during the 2024 Xbox Showcase on June 9.\nThe Call of Duty: Black Ops 6 store page on Xbox listed the game's storage space requirement as more than 309 GB.\nCall of Duty: Black Ops 6 will bundle together with the existing Call of Duty HQ launcher, which includes Modern Warfare 2, Modern Warfare 3, and Warzone, in all available languages.\nActivision has also verified that the actual install size for Call of Duty: Black Ops 6 will be available closer to launch.\nThe same confusion has also led some to mistakenly label Call of Duty: Black Ops 6 DLC."}, {"id": "6c84b035-a5d7-4d02-b68a-aeecb0e2beac", "title": "Taiwan arrests former Chinese navy captain whose speedboat entered Taipei harbour", "date": "2024-06-11 03:00", "url": "https://www.yahoo.com/news/taiwan-arrests-former-chinese-navy-023027197.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "By Ben BlanchardTAIPEI (Reuters) - A Chinese man arrested after his speedboat illegally entered a Taipei harbour is a former navy captain who could have been probing the island's defences, senior Taiwanese officials said on Tuesday.\nOver the past year or so there have been 18 similar cases, mostly involving Taiwan controlled islands that sit next to the Chinese coast, Kuan said.\nTaiwan Defence Minister Wellington Koo, also speaking to reporters at parliament, said the boat incident could be another example of China's \"grey zone\" tactics against the island.\n\"These grey zone tactics have always existed,\" Koo said.\nIn March, two Taiwanese fishermen strayed into Chinese waters near the Taiwan-controlled Kinmen islands, which sit next to China's coast."}, {"id": "6c9ac6d3-40a4-46fc-a349-812557334035", "title": "Combatting UN hostility : Israel should bar entry to UN officials", "date": "2024-06-11 03:30", "url": "https://www.jpost.com/opinion/article-805779", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The decades-long cold war waged through and by the United Nations against Israel is now a hot war – a direct conflict with major strategic implications.\nThe question for Israel is how to respond and effectively counter the UN involvement in this form of deadly political warfare.\nSimilarly, in 2009, when the renamed but otherwise unchanged Human Rights Council created a hopelessly biased commission led by Judge Richard Goldstone to “investigate” the first Gaza war, Israel refused to cooperate.\nHowever, her replacement – a Dutch politician with a history of hostility towards Israel – was admitted.\nIn addition, officials from the UN Human Rights Council were barred from entering after they led a series of blatantly biased “investigations” for the reports of the special rapporteur for Palestine."}, {"id": "9e51a5b5-e12c-4cf5-beb6-83b4b0c63f0b", "title": "Author puts a  face  on wartime Japan through cartoon satire | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-11 00:45", "url": "https://www.asahi.com/ajw/articles/15268928", "domain": "asahi.com", "domain_classification": "Unknown", "message": "Writer Juan Takai is a war junkie, but not the type who ducks bullets to get the story.\nRather, the 29-year-old prefers to delve into historical materials to put a human face on war.\n“Cartoons still reflected the creators’ affection for British and American culture in the early days of the war,” Takai said.\nMonthly reports issued by the wartime Special Higher Police provided a treasure trove of materials for his books.\nTakai’s interest in topics related to World War II stems from his grandfather’s decision to volunteer to serve in the Imperial Japanese Navy."}, {"id": "f9aa7ec2-4f7e-48cb-83d7-a87a4116c75a", "title": "Fort Carson hosts Ivy Mass 2024 : largest joint task force training", "date": "2024-06-11 03:30", "url": "https://www.yahoo.com/news/fort-carson-hosts-ivy-mass-002205969.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(FT. CARSON, Colo.) — On Monday, Fort Carson held a large-scale training exercise that integrated air, ground, cyber, and space-based systems called Ivy Mass.\nMajor General David S. Doyle, the Commanding General for the 4th Infantry Division and Fort Carson said it is crucial training; especially as threats continue to develop overseas.\n“So, by training to do this, we’re better prepared to do it when the time comes.”This Ivy Mass training marked the largest joint task force training using all military branches in Fort Carson’s history.\nSpectators from the Pentagon and contractors from army defense companies were also on-site to look for ways to improve military tech.\nIt features a tethered drone that can knock out radio signals, pinpoint flight durations, and serve as a target locator."}, {"id": "66e0aac6-9821-46fa-af82-c1bb10a68884", "title": "Russia Is Testing A First Person View Remote Controlled Tank Conversion In Ukraine", "date": "2024-06-11 01:45", "url": "https://www.yahoo.com/news/russia-testing-first-person-view-004532637.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "How Russia might look to employ the concept remains unclear, but there is a historical precedent for using remote controlled tanks in mine-clearing operations, or it could even be used as a crude 'first-person view' (FPV) tank.\nIt looks as if the turret either has first-person view (FPV) controls, or that the tank as a whole has an FPV control option.\nA separate frame subsequently shows a soldier maneuvering the tank's top turret using said remote control system.\nFitting tanks with remote controls, specifically for mine clearing, is something the U.S. military has done in the past .\nAnother possibility is that it could be deployed as an FPV tank of sorts, where it might be used for basic but extremely dangerous tasks."}, {"id": "148fe78e-979d-4b4a-b30a-6e2c2e085f93", "title": "Russia Is Testing A First Person View Remote Controlled Tank Conversion In Ukraine", "date": "2024-06-11 02:30", "url": "https://news.yahoo.com/news/russia-testing-first-person-view-004532637.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "How Russia might look to employ the concept remains unclear, but there is a historical precedent for using remote controlled tanks in mine-clearing operations, or it could even be used as a crude 'first-person view' (FPV) tank.\nIt looks as if the turret either has first-person view (FPV) controls, or that the tank as a whole has an FPV control option.\nA separate frame subsequently shows a soldier maneuvering the tank's top turret using said remote control system.\nFitting tanks with remote controls, specifically for mine clearing, is something the U.S. military has done in the past .\nAnother possibility is that it could be deployed as an FPV tank of sorts, where it might be used for basic but extremely dangerous tasks."}, {"id": "cb75c40d-c80f-477d-b0eb-b594fb4536d2", "title": "The  duped  Sri Lankans fighting in Russia Ukraine war", "date": "2024-06-11 04:15", "url": "https://www.yahoo.com/news/duped-sri-lankans-fighting-russias-034116321.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "With no communication for months, and reports of at least 16 Sri Lankans killed and 37 wounded, distraught families are pleading with politicians for help.\nThe government says around a dozen Sri Lankans are being held prisoners of war in Ukraine, after being lured there in pursuit of work.\n- 'Dangerous' -In parliament, Sri Lankan deputy defence minister Premitha Tennakoon did not specify how many citizens were fighting on each side of the conflict.\n\"If Sri Lankans are in a dangerous situation, it's the duty of the government... to ensure that they are safely returned,\" Balasuriya said.\n- 'Duped' -At least 22 Sri Lankans who joined Russian forces have managed to desert, escape and return home, defence officials said."}, {"id": "1eeb1778-3b41-49e5-849b-d5fbc3b7082a", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-06-11 03:15", "url": "https://gamingbolt.com/page/5438?fbclid=846", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "There would be only a few people who don't know anything about video games and those who know even a bit about games the few of the very first name they'll be able to recall would be street fighter .\n... Read More"}, {"id": "d5c564c6-3ec5-4f50-8aa8-1325f3e876ff", "title": "Episode 9 - Kaiju No . 8 - Anime News Network", "date": "2024-06-11 00:45", "url": "https://www.animenewsnetwork.com/review/kaiju-no-8/episode-9/.211710", "domain": "animenewsnetwork.com", "domain_classification": "Unknown", "message": "The giant attack of winged kaiju is a significant challenge for the Kaiju Defense Force.\nIt's interesting seeing a large number of giant-sized kaiju, as opposed to the large number of smaller kaiju we saw with the mushroom monster a few episodes back.\nThe actual designs of the winged kaiju might initially evoke thoughts of Rodan, one of the more famous pterodactyl-like giant monsters.\nI like that there was an obvious power difference and a high need for tactical adjustments to meet the kaiju threat.\nThat said, the new heroic unit types—Kikoru's sick giant axe and the feral and aggressive kaiju number 6—are also supremely cool, so I can't complain about the execution there."}, {"id": "2434ce8b-e7ad-409d-beb2-b9322b66f2dd", "title": "North Korea Sends More Balloons As Kim Jong Un Sister Warns Of New Counteraction", "date": "2024-06-11 04:00", "url": "https://www.ndtv.com/world-news/north-korea-sends-more-balloons-as-kim-jong-uns-sister-warns-of-new-counteraction-5863483", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In recent weeks, North Korea has sent hundreds of balloons into the South.\nNorth Korea has sent hundreds more trash-carrying balloons toward South Korea, Seoul's military said Monday, after Kim Jong Un's powerful sister warned of further responses if the South keeps up its \"psychological warfare\".\nSeoul's military said the North had sent more than 300 trash-carrying balloons overnight, but that the winds had not worked in Pyongyang's favour.\nThe cycle of escalation will likely continue and \"North Korea will do something beyond our imagination,\" Kim said.\n\"North Korea may have already miscalculated, as South Korea's democracy cannot simply turn off NGO balloon launches the way an autocracy would expect.\""}, {"id": "4b866e08-98c6-42ff-823a-7fea9d1e16ed", "title": "Russia - Ukraine war : List of key events , day 837", "date": "2024-06-11 03:00", "url": "https://www.aljazeera.com/news/2024/6/11/russia-ukraine-war-list-of-key-events-day-837", "domain": "aljazeera.com", "domain_classification": "International", "message": "Russia-Ukraine war: List of key events, day 837As the war enters is 837th day, these are the main developments."}, {"id": "02fe0c53-11d5-41d8-bb0e-6e13c1f9d5dd", "title": "South Korean troops fired warning shots after North Korean soldiers crossed land border reports say", "date": "2024-06-11 04:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/11/fgn9-skorea-tensions.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Seoul (South Korea), Jun 11 (AP) South Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday.\nSome North Korean soldiers who were engaged in unspecified work on the northern side of the border briefly crossed the military demarcation line on Sunday, South Korea's Joint Chiefs of Staff said.\nThose North Korean soldiers returned to their territory after South Korea's military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nThe Koreas' mine-strewn land border is the world's most heavily armed border, with hundreds of thousands of combat troops facing each other.\nThe border-crossing incident came amid rising tensions over North Korea's recent launches of trash-carrying balloons."}, {"id": "5c5c6190-a5e4-4fd5-b21a-3df39788ffd4", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border – Winnipeg Free Press", "date": "2024-06-11 02:15", "url": "https://www.winnipegfreepress.com/world/2024/06/10/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-crossed-land-border-reports-say", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nFILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "3ca27bf2-5f3b-4d2f-8a6d-c5b8f2b49dad", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 02:45", "url": "https://www.news-gazette.com/news/nation-world/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/article_6a42a851-ceda-5bfb-9226-b71e7c828c2a.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "53276352-3e30-4545-9ae7-41a7ca3d67cb", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border – Brandon Sun", "date": "2024-06-11 04:15", "url": "https://www.brandonsun.com/world/2024/06/10/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-crossed-land-border-reports-say", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nFILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "d44de901-ce6e-4d4d-9a32-a066d0199a22", "title": "WWII Veteran Marries Near Normandy D - Day Beaches", "date": "2024-06-11 00:00", "url": "https://www.aarp.org/home-family/voices/veterans/info-2024/wwii-harold-terens-jeanne-swerlin-wedding.html", "domain": "aarp.org", "domain_classification": "Unknown", "message": "CARENTAN-LES-MARAIS, France — Together, the collective age of the bride and groom was nearly 200.\nBut World War II veteran Harold Terens and his sweetheart, Jeanne Swerlin, proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nShe giggled and gasped, “Really?”With champagne flutes in hand, they waved through an open window to the adoring crowds outside.\nTerens looked dapper in a light blue suit and matching pink kerchief in his breast pocket."}, {"id": "c97469b3-ae00-4bd3-845e-26958305ac75", "title": "Best of Beth Ashley : Is a better world still in our grasp ? ", "date": "2024-06-11 00:15", "url": "https://www.marinij.com/2024/06/10/best-of-beth-ashley-is-a-better-world-still-in-our-grasp/", "domain": "marinij.com", "domain_classification": "Unknown", "message": "Last week I lived through World War II again.\nThe history of World War II was my history, too.\nA Marine officer I knew wrote of his anguish over the inhuman acts his men had committed.\nWatching “The War” on the television, I could only reflect on the enormity of what the whole world lived through.\nToday is a far cry from 1945, when a better world seemed to be in our grasp."}, {"id": "394afadc-4c70-4b95-9da0-3cffe4bef720", "title": "Paper Mario : The Thousand - Year Door review on Nintendo Switch", "date": "2024-06-11 02:15", "url": "https://nintendoeverything.com/rapid-review-paper-mario-the-thousand-year-door/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Paper Mario: The Thousand-Year Door was one of just a handful of games where the eager adventurer could whet their appetite for grinding battles to level up, collecting money, and adding to their item stash at every new town.\nThough not quite a follow-up to Mario RPG, this tale of the Mushroom Kingdom’s charismatic cast is cut from the same cloth as it and the original Paper Mario’s predecessor.\nMario and a partner can work together in battle utilizing skills that can weaken, stun, and obliterate enemies through careful usage.\nConsidered to be one of the best Mario RPG experiences of all time, Paper Mario: The Thousand-Year Door’s presence on the Switch feels meant to be.\nPaper Mario: The Thousand-Year Door copy provided by the publisher for the purposes of this review."}, {"id": "bb5fc314-6ada-490f-a12e-f9922caf4da5", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 02:00", "url": "https://www.whec.com/national-world/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "whec.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nThose North Korean soldiers carrying construction tools — some of them armed — immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools.\nSouth Korea said North Korea has installed its own border loudspeakers in response but hasn’t turned them on yet."}, {"id": "6b1f9ab5-eb66-484b-8f00-1eb455dd9448", "title": "Russia :  We Can Shoot Down Anyone , Anywhere  ", "date": "2024-06-11 00:45", "url": "https://www.shtfplan.com/headline-news/russia-we-can-shoot-down-anyone-anywhere", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "Is this just another warning that Russia intends to put out there and that the West and Ukraine intend to violate?\nF-16s have already been the source of several “red line crossings” in which Russia has exercised restraint and avoided retaliation.\nThis isn’t the first time Russia has warned that it intends to destroy the Western-supplied warplanes.\nPutin To U.S.: Russia Will DESTROY F-16s Used By UkraineFortunately, World War 3 is being held off by Russia’s restraint even in the face of major provocation from the West and NATO (North Atlantic Treaty Organization.)\n“As for [our ability] to shoot [them] down, we can shoot down anyone, anywhere,” Kartapolov insisted."}, {"id": "90cd0919-fe8b-49ad-9e0b-100a40d7e1b6", "title": "Everything shown during Ubisoft Forward 2024", "date": "2024-06-11 01:00", "url": "https://www.eurogamer.net/everything-shown-ubisoft-forward-2024-1", "domain": "eurogamer.net", "domain_classification": "Unknown", "message": "The Ubisoft Forward 2024 showcase has drawn to close.\nYou'll find all of the announcements below, along with their accompanying trailers, for everything shown during Ubisoft Forward 2024.\nRainbow 6 Siege is out now on PC, Playstation 4, PlayStation 5 and Xbox.\nBrawlhallaWe then got a quick slate of games, while some had been present during the pre-show, three titles made their first appearance during Ubisoft Forward 2024.\nLet's start with the extended gameplay walkthrough::And now the combat and stealth:Hope a game caught your eye during the Ubisoft Forward 2024!"}, {"id": "bc64f62a-e0ec-4cd3-a4de-58edc99906dd", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 02:30", "url": "https://www.yahoo.com/news/south-korean-troops-fired-warning-013456419.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "221d00a2-6e37-4e48-bcb9-e15d8926a236", "title": "South Korean troops fire warning shots after North Korean soldiers briefly cross border", "date": "2024-06-11 04:00", "url": "https://www.yahoo.com/news/south-korean-troops-fire-warning-032107111.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea’s military said Tuesday, amid soaring animosities between the rivals over the North’s recent trash-carrying balloon launches.\nSome North Korean soldiers who were engaged in unspecified work on the northern side of the border briefly crossed the military demarcation line on Sunday, South Korea’s Joint Chiefs of Staff said.\nThose North Korean soldiers immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nIt said North Korea had not conducted any other suspicious activities.\nSouth Korea said North Korea has installed its own border loudspeakers in response but hasn’t turned them on yet."}, {"id": "7cf2dba2-aee6-4414-ac44-94f869f03b55", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 04:00", "url": "https://www.aol.com/south-korean-troops-fired-warning-013456609.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea’s military said Tuesday, amid soaring animosities between the rivals over the North's recent trash-carrying balloon launches.\nSome North Korean soldiers who were engaged in unspecified work on the northern side of the border briefly crossed the military demarcation line on Sunday, South Korea’s Joint Chiefs of Staff said.\nThose North Korean soldiers immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nIt said North Korea had not conducted any other suspicious activities.\nSouth Korea said North Korea has installed its own border loudspeakers in response but hasn't turned them on yet."}, {"id": "e13bdb6d-865e-439d-8e7f-33e432760762", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 02:30", "url": "https://apnews.com/article/south-korea-north-korea-border-warning-shots-35039dd56da6fe7c4fe7605baffd6e3a", "domain": "apnews.com", "domain_classification": "International", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nThose North Korean soldiers carrying construction tools — some of them armed — immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools.\nSouth Korea said North Korea has installed its own border loudspeakers in response but hasn’t turned them on yet."}, {"id": "42a4c4c6-3f1a-40fb-a7e6-dbc18fbdcb2f", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:45", "url": "https://www.ksat.com/news/world/2024/06/11/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL – South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "a7cba0b4-22d6-479f-89a2-594e3501e120", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:00", "url": "https://www.clickondetroit.com/news/world/2024/06/11/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL – South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "a50c013b-dbd5-4270-a6f6-489b94354fba", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:15", "url": "https://www.local10.com/news/world/2024/06/11/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "local10.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL – South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "ff6f66b2-3ccc-4e5a-9b0d-4e8be68ced3d", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:15", "url": "https://www.clickorlando.com/news/world/2024/06/11/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL – South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "4397bc12-00f5-4598-b721-fdd2f4469fe9", "title": "Did You Know That The Final Civil War Battle Took Place in Texas ? ", "date": "2024-06-11 02:45", "url": "https://ksfa860.com/ixp/151/p/final-civil-war-battle-texas/", "domain": "ksfa860.com", "domain_classification": "Unknown", "message": "We took a ferry ride to Fort Sumter, the site of the first shots fired of the Civil War (April 12, 1861).\nMerrell Merrell loading...Merrell Merrell loading...Where Was The Last Battle of The Civil War?\nIf I wanted to visit the location of the final battle of the Civil War, I wouldn't have to travel out of state.\nA sliver of land between Brownsville and the Gulf of Mexico is home to the final battle of the Civil War - the Battle of Palmito Ranch.\nThe Final Soldier Killed in the Civil WarSince Palmito Ranch was the site of the war's final battle, the last soldier killed in the Civil War also happened in Texas."}, {"id": "8aa47ed4-6a5b-4fa5-a1a4-97c087ced6dc", "title": "Did You Know That The Final Civil War Battle Took Place in Texas ? ", "date": "2024-06-11 04:15", "url": "https://kfox95.com/ixp/151/p/final-civil-war-battle-texas/", "domain": "kfox95.com", "domain_classification": "Unknown", "message": "We took a ferry ride to Fort Sumter, the site of the first shots fired of the Civil War (April 12, 1861).\nMerrell Merrell loading...Merrell Merrell loading...Where Was The Last Battle of The Civil War?\nIf I wanted to visit the location of the final battle of the Civil War, I wouldn't have to travel out of state.\nA sliver of land between Brownsville and the Gulf of Mexico is home to the final battle of the Civil War - the Battle of Palmito Ranch.\nThe Final Soldier Killed in the Civil WarSince Palmito Ranch was the site of the war's final battle, the last soldier killed in the Civil War also happened in Texas."}, {"id": "86967841-50f9-4d18-b79e-054c6e27400e", "title": "PUTIN will go to war with NATO if he beats Ukraine - Former CIA director tells US and Europe to wake up", "date": "2024-06-11 00:30", "url": "https://www.kenyan-post.com/2024/06/putin-will-go-to-war-with-nato-if-he.html", "domain": "kenyan-post.com", "domain_classification": "Unknown", "message": "Speaking to The Sun, Petraeus said Putin has been \"very clear\" about bringing a new war to Europe.\nThe world \"should listen\" to Putin as he \"tells us what he believes\", the former CIA boss warned.\nPetraeus said: \"The Ukraine war could expand in the region if Putin succeeds in Ukraine.\nIn order to defeat Putin, the West must do \"everything humanly possible\" to help Ukraine, Petraeus urged.\n\"The reality is a difficult one and yet another reason why we should be doing all that we can to help Ukraine in every possible way.\""}, {"id": "167fbea1-ba40-4a83-97ed-ca5882baa1fb", "title": "Hendersonville WWII veteran celebrates 100th birthday by getting a workout in", "date": "2024-06-11 03:15", "url": "https://wlos.com/community/carolina-moment/hendersonville-wwii-veteran-celebrates-100th-birthday-working-out", "domain": "wlos.com", "domain_classification": "Unknown", "message": "George S. Droney celebrated his 100th birthday on May 31 at one of his favorite places, Pump House Fitness in Hendersonville.\nHe's just guided me, and I tried to carry that on through my life.”In 1978, George S. retired from his career.\nMy doctor said, 'if you go, you better take me,'\" George S. said.\nSon, George R., said it’s been hard and that they “are getting through it together.”His son speaks warmly about their familial bond and its longevity.\nWhen asked what the secret to a long life is, the faithful George S. laughs when he says, “What’s the secret?"}, {"id": "cd94e5a5-e276-4607-ac11-9fd3394fe74f", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:00", "url": "https://www.wsls.com/news/world/2024/06/11/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "FILE - South Korean army soldiers patrol along the barbed-wire fence in Paju, South Korea, near the border with North Korea, on April 23, 2024.\nSouth Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea's military said Tuesday, June 11.\n(AP Photo/Ahn Young-joon, File)SEOUL – South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 meters (165 feet) after they likely lost their way.\nThe reports said most of the North Korean soldiers were carrying pickaxes and other construction tools."}, {"id": "906f5619-6734-41ee-90c0-f86696db2cb9", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:15", "url": "https://www.smdailyjournal.com/news/world/south-korean-troops-fired-warning-shots-after-north-korean-soldiers-briefly-crossed-land-border/article_a0d47942-7eb3-5131-9386-09857f928dba.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "5ddd4e41-0f95-4cfd-af1b-487fd8b9ac52", "title": "UK mum plea for advice as  anxiou husband pushes move to New Zealand to avoid  threat of war  ", "date": "2024-06-11 03:00", "url": "https://www.newshub.co.nz/home/lifestyle/2024/06/uk-mum-s-plea-for-advice-as-anxious-husband-pushes-move-to-new-zealand-to-avoid-threat-of-war.html", "domain": "newshub.co.nz", "domain_classification": "Unknown", "message": "Writing under an alias, the woman revealed that her husband has even been offered a job in New Zealand, although she is currently unemployed.\n\"DH [dear husband] wants to move us all to NZ because he's had a job offer and he's increasingly concerned about the threat of war (we are in the UK),\" she wrote.\n\"We have one DS [dear son] who is just about to start school in September and is currently getting settled into the idea/going to taster sessions.\n\"I'm not enthusiastic as you can tell but DH thinks it's a smart move.\nAIBU [am I being unreasonable] to want to dig my feet in about this and say no?\""}, {"id": "eb61450b-8cef-4c78-8da6-05f5ac554bbe", "title": "IDF strikes Hezbollah targets in Lebanon : Five reported dead", "date": "2024-06-11 03:30", "url": "https://www.jpost.com/breaking-news/article-805816", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF attacked multiple Hezbollah terror targets in southern Lebanon on Monday night, including in the city of Hermel deep in Lebanese territories.\nThe IDF attacked a Hezbollah base in the city of Hermel deep in Lebanon on Monday night, killing five people, according to Lebanese reports.\nThese attacks are now defined as the deepest point where the Israeli air force attacked, according to reports in Lebanon.\nSince the 2006 war with Israel, Hezbollah has increased its capabilities, positioning itself as a defensive force against Israel.\nThe Israeli official emphasized the strategic dilemma the country faced: attacking Hezbollah could cause significant civilian casualties, while inaction could leave Israel vulnerable to rocket attacks."}, {"id": "d55fbf6b-3e6c-4c85-bc7e-5ac55f3925c4", "title": "South Korea fires warning shots at North Korea troops for violating border", "date": "2024-06-11 03:15", "url": "https://www.aol.co.uk/news/south-korea-fires-warning-shots-015533925.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "North-South border - REUTERSSouth Korean soldiers fired warning shots after North Korean troops violated the border earlier this week, according to media reports.\nSeoul’s military said South Korean soldiers fired warning shots at the time.\nAfter our military issued warning broadcasts and warning shots, they retreated northward,” Seoul’s Joint Chiefs of Staff said.\nNorth Korea began sending balloons carrying waste and animal faeces south across the border last month in response to propaganda sent north by South Korean activists.\nKim Yo-jong threatened further retaliation against South Korea, saying “it will undoubtedly witness the new counteraction of the DPRK [Democratic People’s Republic of Korea] if provocations continue”."}, {"id": "0f4383c3-6774-4b73-a7b6-1f87b8e88bf7", "title": "C3F Holds Change of Command Ceremony > U . S . Pacific Fleet > News", "date": "2024-06-11 00:45", "url": "https://www.cpf.navy.mil/Newsroom/News/Article/3802034/c3f-holds-change-of-command-ceremony/", "domain": "cpf.navy.mil", "domain_classification": "Unknown", "message": "Here's how you knowAn official website of the United States government"}, {"id": "3c55c47d-3786-4416-a1be-4efc2c8e59d4", "title": "Spain PSOE - Sumar government cynically endorses ICJ but refuses to accuse Israel of genocide", "date": "2024-06-11 03:00", "url": "https://www.wsws.org/en/articles/2024/06/10/nvco-j10.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Thus, the PSOE-Sumar government is cynically endorsing the ICJ but declaring that it is “neutral” on the genocide.\nThus, the PSOE-Sumar government remains complicit in using Spanish territorial waters and ports to arm Israel.\nIt calls for the PSOE-Sumar government to impose arms embargos, sanctions on Israel and to break diplomatic relations with the country.\nA campaign of strikes and political struggles must link the fight against genocide in Gaza to the fight against imperialist war and capitalism.\nWorkers and youth cannot wait for the union bureaucracies or middle-class groups like Podemos to organise a genuine struggle against the Gaza genocide."}, {"id": "946d26ac-ac9a-462d-be0d-03418bcf3abe", "title": "Most Jewish Americans support President Biden over Trump , study finds", "date": "2024-06-11 02:30", "url": "https://www.10news.com/politics/america-votes/presidential-election/most-jewish-americans-support-president-biden-over-trump-study-finds", "domain": "10news.com", "domain_classification": "Unknown", "message": "A majority of Jewish Americans say they'll be voting to reelect President Joe Biden over former President Donald Trump come Election Day, a recent survey found.\nThis year, the survey found 61% of voters would likely choose to vote President Biden into office again over 23% who would pick Trump.\nMeanwhile, Trump has said that President Biden has \"abandoned Israel,\" and that any Jewish Americans who will vote for the current president are betraying their culture and \"should be ashamed of themselves.\"\nTrump has also called the president's response to antisemitism and recent war protests weak.\nBut the survey shows most Jewish Americans don't fully agree with the GOP leader, with 56% saying they approve strongly or approve somewhat of how President Biden is doing as president, compared to 40% disapproving."}, {"id": "2f59b843-cdc9-4099-93a6-162cbe65a6ec", "title": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land border", "date": "2024-06-11 03:00", "url": "https://lasvegassun.com/news/2024/jun/10/south-korean-troops-fired-warning-shots-after-nort/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "South Korean troops fired warning shots after North Korean soldiers briefly crossed land borderAhn Young-joon / AP, fileSEOUL, South Korea — South Korean soldiers fired warning shots after North Korean troops violated the land border earlier this week, South Korea’s military said Tuesday, amid soaring animosities between the rivals over the North's recent trash-carrying balloon launches.\nSome North Korean soldiers who were engaged in unspecified work on the northern side of the border briefly crossed the military demarcation line on Sunday, South Korea’s Joint Chiefs of Staff said.\nThose North Korean soldiers immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nIt said North Korea had not conducted any other suspicious activities.\nSouth Korea said North Korea has installed its own border loudspeakers in response but hasn't turned them on yet."}, {"id": "f3c3699b-7741-41d4-bfa6-414dd98de8d5", "title": "There Are No Civilians in Gaza | Frontpage Mag", "date": "2024-06-11 04:00", "url": "https://www.frontpagemag.com/there-are-no-civilians-in-gaza/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "It’s also why those same ‘civilians’ held Israeli hostages prisoner and could be trusted not to inform on them.\n62% in Gaza are happy with the performance of Hamas during the war and 59% want Hamas to stay in power.\nDefeating Hamas without civilian casualties is impossible because the Islamic terrorist group not only operates among civilians, but is rooted in the society of Gaza.\nInstead we must reckon with the reality that there are few civilians in Gaza or in the Muslim world.\nThere are no civilians in Gaza."}, {"id": "33e26ee0-ea76-4ed7-bd55-8b8452580487", "title": "Diaspora Affairs Minister details ministry activities since October 7 - Israel Politics", "date": "2024-06-11 00:00", "url": "https://www.jpost.com/israel-news/politics-and-diplomacy/article-805809", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Minister of Diaspora Affairs and Combating Antisemitism Amichai Chikli and Elan Carr, former United States Special Envoy for Combating Antisemitism and CEO of the Israeli-American Council, engaged in a lively discussion on antisemitism with Jerusalem Post editor-in-chief Zvika Klein at the Jerusalem Post Conference on Monday.\nChikli reported on the ministry’s activities since the beginning of the war.\nElan Carr described the importance of the Israeli-American Council, explaining that it is an American Jewish organization that is meant to unify, strengthen, and engage the Israeli-American community.\nHe pointed out that the American Jewish community could use a dose of Israeli optimism and pride.\nThe Minister of Diaspora Affairs and Combating Antisemitism and the Israeli-American Council sponsored a portion of the Jerusalem Post Annual Conference."}, {"id": "626e5765-d605-4103-9eac-cf58d0dc9b59", "title": "Teller County official slams posts by Colorado GOP chair Dave Williams , asks for resignation", "date": "2024-06-11 01:45", "url": "https://gazette.com/politics/teller-county-official-slams-posts-by-colorado-gop-chair-dave-williams-asks-for-resignation/article_b116c13c-2759-11ef-b49d-0f35e8b85185.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "To a message from the GOP chair asking all Republicans to burn Pride flags, Dan Williams balked.\n“We will not burn flags in Teller County; that’s not who we are.”The commissioners’ meeting happened to be on the 80th anniversary of D-Day.\nWhat if the soldiers who fought for freedom on D-Day heard about the message of the GOP, Dan Williams said.\n“The reason I had to get this off my conscience is because Dave Williams does not speak for Dan Williams.” (The two are not related.)\nIn reference to D-Day, Dan Williams held up a jar of sand he collected on a visit to Omaha Beach in Normandy in 1998."}, {"id": "cc963655-cef9-4c12-8995-4821e0c039f1", "title": "ASCALON Gun Marks New Milestone in Firing Series", "date": "2024-06-11 02:30", "url": "http://defense-update.com/20240610_ascalon-gun-marks-new-milestone-in-firing-series.html", "domain": "defense-update.com", "domain_classification": "Unknown", "message": "KNDS recently completed a test firing series with the 140mm ASCALON gun, demonstrating the applicability of the new gun design for current and future main combat systems, including the Main Ground Combat System (MGCS).\nDuring the tests series company personnel demonstrated an easy and quick gun caliber change, replacing a 120mm barrel with the 140mm in less than one hour.\nSInce it began, the system was fired several hundreds of times from gun mounts in 120 and 140mm barrels.\nThe next important step is firing tests from a Main Battle Tank (MBT) in 2025.\nThe system KNDS designed ASCALON with an open architecture to serve as a basis for cooperative development of a combat gun platform within the framework of the Franco-German MGCS program, laying the foundationsfor the future standard of European tank gun and ammunition."}, {"id": "28ac4817-e56d-4b31-888a-a812e103f197", "title": "Black Ops 6 : Everything We Learned About The Next Call Of Duty", "date": "2024-06-11 01:45", "url": "https://kotaku.com/call-of-duty-black-ops-6-direct-everything-we-know-1851531121", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "Call of Duty: Black Ops 6 had its big blowout during Xbox’s Summer Game Fest Showcase, and got a focused presentation of its own right afterwards.\nHere’s a rundown of some of the biggest details we learned about the upcoming shooter:The kids are calling it omnimovementOmnimovement is perhaps the biggest addition Black Ops 6 is bringing to the franchise.\nFrank Woods, the tortured legacy character that the Black Ops subseries absolutely refuses to let die, will be back in Black Ops 6 along with a new cast of characters who will be compromised after a mission gone wrong, which prompts them to go rogue and unravel a conspiracy entirely on their own.\nFidelity and detailTreyarch is broadly upping the fidelity of the series with Black Ops 6, and this includes features such as updated damage models.\nSo far though, Black Ops 6 is making a decent first impression, and might just get me back into the fold."}, {"id": "542c3378-7fb3-4588-a9cf-eb43736510df", "title": "Prodigy Personal Mythology : Remembering The  Fallen Angel  Of Mobb Deep", "date": "2024-06-11 00:00", "url": "https://menafn.com/1108317529/Prodigys-Personal-Mythology-Remembering-The-Fallen-Angel-Of-Mobb-Deep", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Albert Johnson, aka Prodigy, (left) and Kejuan Muchita, aka Havock, of the hip hop duo Mobb Deep in New York in 2006.\nBut having relapsed into a negative lifestyle, this UFO made him feel like a“fallen angel .”Prodigy discusses pain, God and visions on the Combat Jack show in 2014.\n'Positive and negative war'Prodigy often rapped about a positive and negative war but against real or imagined structures of power.\nThus, Prodigy's most mature project shows that his positive and negative war could be a mythical metaphor for a microcosmic and personal struggle.\n“The Good Fight”Seven years after Prodigy's passing, a notable song from the Book of Revelation,“The Good Fight ,” is suggestive of how this fallen angel aligned himself between conflicting forces."}, {"id": "c6897b7f-1416-41e2-abfc-a234af0b6f71", "title": "Gears of War 6 Confirmed To Be In Development", "date": "2024-06-11 00:00", "url": "https://gameranx.com/updates/id/500915/article/gears-of-war-6-confirmed-to-be-in-development/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "However, that left many wondering what would be the fate of Gears of War 6, which seemed like it was DOA after no announcements for several years.\nHowever, despite the prequel title coming, things are still moving forward with the franchise.\nThis was revealed in a piece on Xbox Wire, where the developers of the most recent games, The Coalition, stated that Gears of War 6 was indeed happening.\nAfter all, it highlights how the franchise not only isn’t dead, but there are two titles coming to it sooner rather than later.\nIn contrast, while the two games that came from The Coalition were good, their sales and impact weren’t nearly as strong."}, {"id": "fe864f42-ebf0-448d-92de-47292e6dfa22", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-11 03:30", "url": "https://www.tvguide.co.uk/schedule/0aaf93f3-99a7-5ec8-96d5-1ecd7f567270/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Tuesday 11 June Share Add toCalendar +Dunkirk Season 4 Episode 3 of 10 S SubtitlesBruce Crompton heads to Dunkirk after finding a picture in his attic that was given to him by a soldier who was there during the famous evacuationCombat Dealers airs on Discovery Channel HD at 9:00 AM, Tuesday 11 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "672209cd-3587-4743-9f45-35e5a3d07e6b", "title": "Nigeria Front Against Desertification", "date": "2024-06-11 02:00", "url": "https://leadership.ng/nigerias-front-against-desertification/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "The theme of this year’s event, “Land Restoration, Desertification and Drought Resilience,” demands that humanity confront this crisis head-on or risk permanent disfigurement of the only world it knows.\nThese statistics bare the existential peril that desertification poses to humanity’s future on Earth.\nIf left unchecked, accelerating desertification can potentially unravel human civilisation’s social, economic, and political fabric.\nThe regions most vulnerable to desertification tend to be in the developing world – places that have contributed the least to catalysing climate change yet bear the increasingly severe brunt of its impacts.\nUltimately, the battle against desertification, land degradation, and drought transcends borders, ideologies, and generations."}, {"id": "4c0d56ea-79f0-4715-abb6-ca155eaa4df3", "title": "Intensified Drone Conflict in Kharkiv : A New Phase of the Ukraine - Russia War", "date": "2024-06-11 02:15", "url": "https://trendydigests.com/2024/06/11/intensified-drone-conflict-in-kharkiv-a-new-phase-of-the-ukraine-russia-war/", "domain": "trendydigests.com", "domain_classification": "Unknown", "message": "The escalation marks a new phase in the war, with drone warfare becoming a prominent feature in the struggle for control over the contested region.\nIn recent developments, Russia and Ukraine have engaged in an intense drone and missile conflict in the Kharkiv area.\nRussian air defenses reportedly intercepted Ukrainian drones over Krasnodar and Crimea, while Ukrainian drones have targeted critical locations such as Sevastopol and Belgorod.\nRelevant articles:– Ukraine-Russia war – live: Kyiv ‘strikes Russian air defences’ in Crimea after downing a Su-57 stealth jet, Yahoo!\nVoices, 06/10/2024– Ukraine war latest: Zelensky says Russia’s Kharkiv offensive failed; Ukraine hits Russian Su-57 aircraft for first time, Kyiv Independent, 06/09/2024Glad you enjoyed above story, be sure to follow TrendyDigests on Microsoft Start."}, {"id": "f9d235b9-da45-4a3d-b7f5-5c3fbe094ec8", "title": "F1 news - JV slams  personal  Daniel Ricciardo comments ,  joke  penalty addressed", "date": "2024-06-11 00:00", "url": "https://www.planetf1.com/news/jacques-villeneuve-slams-personal-daniel-ricciardo-comments-joke-penalty", "domain": "planetf1.com", "domain_classification": "Unknown", "message": "The most heated battle arguably came not on the track, but off it as Jacques Villeneuve and Daniel Ricciardo went at it verbally.\nWith Ricciardo saying: “I think he’s hit his head a few too many times.\nRead more – Jacques Villeneuve hits back at ‘personal’ Daniel Ricciardo comments as war of words continuesFans call Daniel Ricciardo penalty a ‘joke’Ironically, Ricciardo delivered a solid performance in Canada to finish a grand prix in the points for the first time this season, claiming P8 even after being handed a five-second penalty for a false start.\n“Joke” and “robbed” were words used by fans on social media who did not take too kindly to that stewards’ verdict.\nThe full radio transcript through this saga has now emerged, which included a sarcastic “amazing” from Ocon to his race engineer Josh Peckett."}, {"id": "f3bdcf44-0332-443e-b96c-b11d55eac74d", "title": "BCPD : Men arrested for stealing scrap metal from former plant", "date": "2024-06-11 01:45", "url": "https://www.yahoo.com/news/bcpd-men-arrested-stealing-scrap-232735009.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "BATTLE CREEK, Mich. (WOOD) — Two men were arrested after several break-ins were reported at an old packaging plant in Battle Creek, police say.\nScrap metal worth thousands of dollars was stolen, police said.\nThey arrested the men, who police say were stealing more scrap metal from the site.\n“Police would like to remind neighbors that the former Graphic Packaging Plant is not vacant and has contractors working inside.\nThe names of the men arrested were not released by police."}, {"id": "d595c713-8e6d-41b8-8f59-6ceabdf98458", "title": "Ucraina , Mosca : 7 feriti negli attacchi di Kiev sul Donetsk", "date": "2024-06-11 01:00", "url": "https://www.giornaledibrescia.it/italia-e-estero/ucraina-mosca-7-feriti-negli-attacchi-di-kiev-sul-donetsk-ejhu2jjw", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "ROMA, 11 GIU - Nelle ultime 24 ore le forze armate ucraine hanno effettuato 49 attacchi contro l'autoproclamata Repubblica popolare di Donetsk, con un bilancio di sette feriti: lo riferiscono le autorità filorusse della regione ucraina.\nTre persone sono rimaste ferite invece in attacchi russi che ieri hanno colpito il villaggio di Tsvitkovo, nella regione ucraina meridionale di Zaporizhzhia: lo rendono noto le autorità locali, citate dai media di Kiev.\nQuattro bombe aeree guidate hanno causato la distruzione di diverse abitazioni ed edifici annessi."}, {"id": "de1e1929-2f63-42d3-ac77-10e3144ee967", "title": "Middle East Crisis update : UN Security Council adopts US resolution backing Gaza ceasefire", "date": "2024-06-11 01:30", "url": "https://www.dailymaverick.co.za/article/2024-06-11-un-security-council-adopts-us-resolution-backing-gaza-ceasefire-israel-unswayed-by-gantzs-exit/", "domain": "dailymaverick.co.za", "domain_classification": "Unknown", "message": "Ambassadors of the Security Council vote in favour of the draft resolution on a ceasefire in Gaza during a meeting at UN Headquarters in New York on 10 June 2024.\nUN Security Council adopts US resolution backing Gaza ceasefireThe United Nations Security Council adopted a US-crafted resolution endorsing its ceasefire plan for the Israel-Hamas war, a push that’s part of Washington’s wide campaign to keep up momentum for a proposal to which neither side has fully committed.\nIt welcomed the US-backed truce proposal announced by President Joe Biden on 31 May and urged Hamas to accept it.\nWhile Israel said its forces killed around 100, the Hamas-run health ministry in Gaza said the death toll exceeded 270.\nOne fundamental disagreement — which has dogged talks since the beginning — is that Hamas has generally insisted on a permanent ceasefire."}, {"id": "4d30eae3-14d1-4222-8136-002ae20431e4", "title": "Pressure mounts on Israel as Gantz quits", "date": "2024-06-11 02:15", "url": "http://europe.chinadaily.com.cn/a/202406/11/WS6667a6afa31082fc043cbc85.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Palestinians conduct a search and rescue operation among the rubble after Israeli warplanes targeted a house in the Nuseirat refugee camp area, Gaza, on Sunday.\nASHRAF AMRA/GETTY IMAGESJERUSALEM/GAZA — A key member of Israel's war cabinet quit Prime Minister Benjamin Netanyahu's government on Sunday, heaping domestic pressure on the Israeli leader as the conflict in Gaza rages.\nThat is why we are leaving the emergency government today with a heavy heart,\" Gantz said.\nNational Security Minister Itamar Ben Gvir demanded to join the war cabinet in place of Gantz.\nBlinken arrived in Egypt on Monday at the start of a regional tour to push for a much-awaited Gaza ceasefire."}, {"id": "b2fd054d-e0f2-418f-ab65-afc06de1a4eb", "title": "Pressure mounts on Israel as Gantz quits", "date": "2024-06-11 02:45", "url": "http://usa.chinadaily.com.cn/a/202406/11/WS6667a6afa31082fc043cbc85.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Palestinians conduct a search and rescue operation among the rubble after Israeli warplanes targeted a house in the Nuseirat refugee camp area, Gaza, on Sunday.\nASHRAF AMRA/GETTY IMAGESJERUSALEM/GAZA — A key member of Israel's war cabinet quit Prime Minister Benjamin Netanyahu's government on Sunday, heaping domestic pressure on the Israeli leader as the conflict in Gaza rages.\nThat is why we are leaving the emergency government today with a heavy heart,\" Gantz said.\nNational Security Minister Itamar Ben Gvir demanded to join the war cabinet in place of Gantz.\nBlinken arrived in Egypt on Monday at the start of a regional tour to push for a much-awaited Gaza ceasefire."}, {"id": "3caa63e2-a31b-4757-a58e-29d27d612ee3", "title": "Pressure mounts on Israel as Gantz quits", "date": "2024-06-11 04:15", "url": "http://africa.chinadaily.com.cn/a/202406/11/WS6667a6afa31082fc043cbc85.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Palestinians conduct a search and rescue operation among the rubble after Israeli warplanes targeted a house in the Nuseirat refugee camp area, Gaza, on Sunday.\nASHRAF AMRA/GETTY IMAGESJERUSALEM/GAZA — A key member of Israel's war cabinet quit Prime Minister Benjamin Netanyahu's government on Sunday, heaping domestic pressure on the Israeli leader as the conflict in Gaza rages.\nThat is why we are leaving the emergency government today with a heavy heart,\" Gantz said.\nNational Security Minister Itamar Ben Gvir demanded to join the war cabinet in place of Gantz.\nBlinken arrived in Egypt on Monday at the start of a regional tour to push for a much-awaited Gaza ceasefire."}]