[{"id": "e40d081f-347b-48d3-89be-615be0f0793e", "title": "Natural Disaster Doc Series  Violent Earth with Liev Schreiber  Trailer", "date": "2024-08-01 19:00", "url": "https://www.firstshowing.net/2024/natural-disaster-doc-series-violent-earth-with-liev-schreiber-trailer/", "domain": "firstshowing.net", "domain_classification": "Unknown", "message": "Natural Disaster Doc Series 'Violent Earth with Liev Schreiber' Trailer\"When Mother Nature speaks – listen.\"\nMax has posted the trailer for a documentary series called Violent Earth with Liev Schreiber, an \"in-depth examination into our natural world and its changing climate.\"\nViolent Earth with Liev Schreiber explores the unbelievable science behind epic natural disasters.\nSchreiber described Violent Earth as a \"cautionary tale\" about the increased frequency of violent storms, but he sees reason for hope in our growing understanding of them.\nViolent Earth with Liev Schreiber is a series is produced by Jing Feng and John Wasley, and executive produced by Nancy Duffy, Senior Vice President, Program Development at CNN."}, {"id": "13a53b21-890b-4466-9ff5-321a62356955", "title": "A tropical wave has a chance of becoming a storm , but will it affect Panama City Beach ? ", "date": "2024-08-01 19:00", "url": "https://www.yahoo.com/news/tropical-wave-chance-becoming-storm-160035783.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical wave has a chance of becoming a storm, but will it affect Panama City Beach?\nThe National Hurricane Center is giving a low chance — 20% — for development over the next 48 hours.\nIf sustained winds reach 39 mph, it could become Tropical Storm Debby, the fourth named storm of the 2024 Atlantic hurricane season.\nTropical cyclone is the generic term that covers all tropical systems, including tropical depression, tropical storm and hurricane.\nThe striped areas on a tropical outlook map indicate \"areas where a tropical cyclone — which could be a tropical depression, tropical storm or hurricane — could develop,\" said National Hurricane Center Deputy Director Jamie Rhome."}, {"id": "765603db-7d1f-4ba1-8d07-ac57164ec29a", "title": "August Weather Headlines", "date": "2024-08-01 18:00", "url": "https://www.whsv.com/2024/08/01/august-weather-headlines/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "HARRISONBURG, Va. (WHSV) - As July turns into August, the final month of summer has officially begun, but will the weather look any different from the last few dry months?\nWith late summer knocking on the doorsteps, tropical systems will start to become more common by the end of the month.\nActivity historically starts to climb late month into September.\nHowever, tropical systems become much more common from late August through October.\nThese types of systems often produce widespread, soaking rainfall, and is likely the sole way the region will break the drought."}, {"id": "89790bfc-c6c7-4300-8bcf-9c6d6de1c092", "title": "Hanahan mayor warns and advises residents ahead of hurricane season peak", "date": "2024-08-01 06:30", "url": "https://abcnews4.com/news/local/hanahan-mayor-warns-and-advises-residents-ahead-of-hurricane-season-peak-nfip-pinopolis-dam-christie-rainwater-flooding-floods-community-rating-system-premium-lake-moultrie-cooper-river", "domain": "abcnews4.com", "domain_classification": "Unknown", "message": "Hanahan Mayor Christie Rainwater penned a letter to residents Tuesday acknowledging community concerns about flooding and hurricane preparedness, while also advising residents on how to best stay safe during a storm.\nRainwater also shared that the city has been attempting to obtain flood insurance premium discounts for residents via the National Flood Insurance Program's (NFIP) Community Rating System.\nPoints are then used to reduce flood insurance premiums for policyholders.\nThe Hanahan Mayor claimed that residents now receive a 20 percent discount on their flood insurance premiums due to participation in the Community Rating System.\nThe letter comes as hurricane season reaches its peak, prompting many Lowcountry governments and emergency organizations to increase preparations for a major storm."}, {"id": "b44d1912-5247-49b6-b4ca-ce1ca96b6cfa", "title": "Florida on alert for tropical downpours as models shift disturbance to Gulf of Mexico", "date": "2024-08-01 13:45", "url": "https://www.fox35orlando.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "For several days, model forecasts consistently indicated that the tropical wave, now known as Invest 97L, would likely move into the Atlantic.\nHowever, by Thursday, the models have generally agreed that it will now track into the Gulf of Mexico and is expected to become tropical storm Debby.\nWhile the forecast intensity is still uncertain, we may see a tropical depression, tropical storm or potentially a hurricane.\nAs of 2 p.m. the tropical wave is producing disorganized showers and thunderstorms over Hispaniola, Puerto Rico, the southeastern Bahamas, and in the southwestern Atlantic and northeastern Caribbean Sea.\nAs of Thursday morning, the NHC says the tropical wave has a medium (70%) chance for development over the next seven days."}, {"id": "462bf0a5-b545-4a6e-b95c-111f644a0977", "title": "Hurricane preparedness : Tropical terms to get familiar with", "date": "2024-08-01 17:30", "url": "https://www.clickorlando.com/weather/hurricane/2024/08/01/hurricane-preparedness-tropical-terms-to-get-familiar-with/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Tropical Cyclone: Any tropical area of low pressure found anywhere around the world.\nPotential Tropical Cyclone: Designated by the National Hurricane Center when a disturbance that has not yet met all of the meteorological characteristics to become tropical but has the strong potential to become one.\nThe disturbance will receive this designation when it has a strong chance to bring tropical storm or hurricane conditions to land within 48 hours.\nTropical Outlook: Issued by the National Hurricane Center to highlight an area of disturbed weather that has a chance to develop into a tropical depression, storm or hurricane.\nTropical Advisory: Issued when a tropical depression develops."}, {"id": "37217a2c-a926-444a-b55b-424289ce1ec2", "title": "Renter vulnerabities", "date": "2024-08-01 15:00", "url": "https://laist.com/brief/news/climate-environment/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "laist.com", "domain_classification": "Unknown", "message": "Read on: To learn about common vulnerabilities of renting as the climate crisis worsens, and what is being done to combat the issue...\nNearly two years later, James and her husband are still trying to recover from the financial gut-punch of the storm.\nRyan Kellerman / NPR )As a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\n“Disaster creates disaster,” James says.\n\"Disaster creates disaster,\" says hurricane survivor Venus James."}, {"id": "84e61e9c-5eb5-485f-9e2c-01fe67f1f220", "title": "Vermont Inundated as 1 - in - 1 , 000 - Year Rainfall Event Destroys Homes , Prompts Rescues", "date": "2024-08-01 00:45", "url": "https://www.ecowatch.com/vermont-flooding-2024.html", "domain": "ecowatch.com", "domain_classification": "Unknown", "message": "The aftermath of flash flooding on Red Village Road in Lyndonville, Vermont on July 30 2024.\nNearly eight inches of rain fell in only six hours in St. Johnsbury — considered a one in a thousand year event, CNN reported.\nI had no idea this was coming,” said one of the town’s residents Vanessa Allen, as reported by The Associated Press.\nLyndonville and St. Johnsbury, located near state capital Montpelier, got the brunt of the flooding.\nVermont Emergency Management said about two dozen rescues had been executed in the area by 10 swift-water rescue teams."}, {"id": "48d109f1-c568-459d-a0cf-7f0df910d797", "title": "Tropical depression possible soon in Gulf of Mexico : What will it mean for Alabama ? ", "date": "2024-08-01 18:00", "url": "https://www.al.com/hurricane/2024/08/tropical-depression-possible-in-the-gulf-soon.html", "domain": "al.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Thursday continued to watch a tropical disturbance near Hispaniola that could become a tropical depression soon.\nHurricane center forecasters raised the probability of development from medium (60 percent) to high (70 percent) on Thursday afternoon.\n🌀 1pm Tropical Update: It's too soon to say if this system will have any impacts across our local area.\nThe problem is, it could be in the Gulf of Mexico or near the Florida peninsula when that happens.\nTwo of them — Alberto and Chris — were tropical storms that hit Mexico’s Gulf Coast."}, {"id": "3b0c444f-c12f-40ef-8659-6e14a9427532", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 02:15", "url": "https://www.pressdemocrat.com/article/news/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-d/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "A National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "d6218264-efcf-418a-a8ab-d21bba44f82b", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:15", "url": "https://www.kiro7.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "ea55ef2c-7d1c-405e-b10f-7a680f1c127c", "title": "Tropical Storm Carlotta strengthens over Pacific Ocean as it moves away from Mexico – Winnipeg Free Press", "date": "2024-08-01 15:00", "url": "https://www.winnipegfreepress.com/world/2024/08/01/tropical-storm-carlotta-strengthens-over-pacific-ocean-as-it-moves-away-from-mexico", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "MIAMI (AP) — Tropical Storm Carlotta is growing stronger over the Pacific Ocean as it moves away from Mexico and could become a hurricane by Thursday evening, forecasters said.\nThe National Hurricane Center in Miami said Thursday morning that Carlotta’s maximum sustained winds had grown to 60 mph (95 kph).\nThe system was centered about 345 miles (630 kilometers) southwest of Manzanilla, Mexico, moving northwest at 12 mph (19 kph).\nSwells generated by the storm will likely cause life-threatening surf and rip current conditions through the weekend along Mexico’s west-central mainland coast and the southern Baja California peninsula, the hurricane center warned."}, {"id": "d4d0420a-0800-4691-8377-6aeaab71a15e", "title": "Light earthquake : M4 quake has struck near Yuzhno - Sakhalinsk in Russia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-quake-has-struck-near-yuzhno-sakhalinsk-in-russia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Thursday, 140 km E of Yuzhno-Sakhalinsk, Russia (87 miles).\nEvent ids that are associated to the earthquake: us7000mzye.\nId of event: us7000mzye.\nExact time and date of earthquake 18/07/24 / 2024-07-18 05:53:25 / July 18, 2024 @ 5:53 am UTC/GMT.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 140 km E of Yuzhno-Sakhalinsk, Russia."}, {"id": "16c79bff-7077-449d-80d0-44bfe8c4d1e9", "title": "Light earthquake , 4 . 2 mag strikes near Bitung in Indonesia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-strikes-near-bitung-in-indonesia-8/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.2 (ml/mb) was reported 120 km E of Bitung, Indonesia (75 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 06:14:53 / 6:14 am (local time epicenter).\nThe epicenter of the earthquake was roughly 49.828 km (31 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 120 km E of Bitung, Indonesia."}, {"id": "dd52b0fd-6538-4d83-ba7d-447154f1cfd9", "title": "Light earthquake : M4 . 1 quake has struck near Ollagüe in Chile", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-1-quake-has-struck-near-ollague-in-chile-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) strikes 89 km WNW of Ollagüe, Chile (55 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 100.684 km (63 miles).\nExact location of earthquake, -69.0314° West, -20.8866° South, depth 100.684 km.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 89 km WNW of Ollagüe, Chile."}, {"id": "5f954974-c714-4092-a302-7a9b3938ae96", "title": "Light earthquake , 4 . 6 mag strikes near the Kermadec Islands", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-strikes-near-the-kermadec-islands-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported south of the Kermadec Islands (0 miles) on Tuesday.\nExact location of earthquake, longitude -178.1669 West, latitude -32.7492 South, depth = 10 km.\nEvent ids that are associated to the earthquake: us7000my2b.\nId of event: us7000my2b.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: south of the Kermadec Islands."}, {"id": "18b16386-457b-4050-93a5-2c4e1908a80c", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:15", "url": "https://www.wsbradio.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "c381e4f9-046b-45c0-8f7f-70e53845543a", "title": "Forecasters predict Tropical Storm Carlotta to grow into hurricane", "date": "2024-08-01 18:00", "url": "https://www.yahoo.com/news/forecasters-predict-tropical-storm-carlotta-170325708.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Carlotta off the western coast of Mexico is expected to grow into a hurricane, forecasters said.\nPhoto courtesy of NOAAAug. 1 (UPI) -- The National Hurricane Center said Thursday that Pacific Ocean Tropical Storm Carlotta is expected to become a hurricane late Thursday or Friday.\n\"This motion is expected to continue [Thursday], followed by a turn toward the west on Friday and a continued westward motion through the weekend,\" the National Hurricane Center said.\n\"Strengthening is forecast during the next couple of days and Carlotta is expected to become a hurricane today or [Friday].\"\nThe center said its tropical storm winds extend 60 miles from the eye."}, {"id": "10427868-b16c-4188-80c3-2a9bf28a7241", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:00", "url": "https://isp.netscape.com/news/story/0001/20240801/7872348db84f506598624e9fb9c2ae40", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "A National Weather Service flood warning was in effect for parts of central and northeastern Vermont into Wednesday night.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "fadb39a8-73d1-438f-ac09-0d4110be11df", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-08-01 10:00", "url": "https://www.wfae.org/energy-environment/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "wfae.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "e208148a-80e3-474f-871e-b96fdf1b0c12", "title": "Moderate earthquake , 5 mag has occurred near Panama", "date": "2024-08-01 04:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-mag-has-occurred-near-panama-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5 (ml/mb) was detected on Thursday, south of Panama (0 miles).\nEvent ids that are associated to the earthquake: us6000nh8m.\nId of event: us6000nh8m.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: south of Panama."}, {"id": "f3f614e5-a2d8-414f-9938-8481b7f0b0a9", "title": "Light earthquake , 4 . 3 mag has occurred near Zhangfeng in China", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-3-mag-has-occurred-near-zhangfeng-in-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 6 kilometers (4 miles) from Zhangfeng in China on Friday.\nAll ids that are associated to the event: us6000nh53.\nThe earthquake occurred at a depth of 12.956 km (8 miles).\nEpicenter of the earthquake was 62 km (39 miles) from Bhamo (c. 47 900 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 6 km NE of Zhangfeng, China."}, {"id": "cff476e6-f4bb-4ef9-baa8-c07e5009e682", "title": "Light earthquake 4 . 6 mag , 40 km E of Marihatag , Philippines", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-40-km-e-of-marihatag-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Thursday, 40 kilometers (25 miles) from Marihatag in Philippines.\nExact time and date of earthquake 18/07/24 / 2024-07-18 08:29:26 / July 18, 2024 @ 8:29 am UTC/GMT.\nThe earthquake occurred at a depth of 62.387 km (39 miles) below the earth’s surface.\nEarthquake epicenter was 71 km (44 miles) from Bislig (c. 67 600 pop), 63 km (39 miles) from Tandag (c. 29 000 pop), 84 km (52 miles) from Bah-Bah (c. 28 600 pop), 82 km (51 miles) from San Francisco (c. 18 500 pop), 64 km (40 miles) from Lianga (c. 13 600 pop), 64 km (39 miles) from Tagbina (c. 10 700 pop), 56 km (35 miles) from Hinatuan (c. 10 100 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 40 km E of Marihatag, Philippines."}, {"id": "3542ea99-6654-4e66-b25a-86e099666e5e", "title": "Light earthquake , 4 . 2 mag was detected near Misawa in Japan", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-was-detected-near-misawa-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 56 kilometers (35 miles) from Misawa in Japan on Friday.\nExact time and date of earthquake 19/07/24 / 2024-07-19 08:08:08 / July 19, 2024 @ 8:08 am UTC/GMT.\nThe epicenter was at a depth of 60.438 km (38 miles).\nThe epicenter was 65 km (41 miles) from Hachinohe (c. 239 000 pop), 68 km (42 miles) from Mutsu (c. 49 200 pop), 56 km (35 miles) from Misawa (c. 42 800 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 56 km NE of Misawa, Japan."}, {"id": "e0be91a2-2ee0-4da6-affa-67e0ce6f0e07", "title": "State Affairs committee looks into power outages after Hurricane Beryl", "date": "2024-08-01 02:30", "url": "https://www.fox7austin.com/news/state-affairs-committee-looks-power-outages-after-hurricane-beryl", "domain": "fox7austin.com", "domain_classification": "Unknown", "message": "Hurricane Beryl is gone and most of the power line repair work is done in Houston.\nOn Wednesday, members of the House State Affairs Committee brought back the CEO of CenterPoint Energy, Jason Wells, who issued another apology for how the power provider responded to the power outage.\nCommittee members expressed their frustration with the answers they've been getting, especially regarding how power poles are maintained.\nThose trees were not part of the CenterPoint vegetation reduction plan.\nWells told the committee more than 40 policy changes have been made, or are in the process of being implemented."}, {"id": "3ee4cf9b-dd9e-44fa-81aa-63dfa0778e24", "title": "Severe Storms in the Southeast US Leave 1 Dead and Cause Widespread Power Outages", "date": "2024-08-01 04:30", "url": "https://www.theepochtimes.com/us/severe-storms-in-the-southeast-us-leave-1-dead-and-cause-widespread-power-outages-5697417", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "CANTON, Ga.—A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday’s remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "59129f38-9147-4bac-aa28-caad89c60eb9", "title": "Non - Shocking Update For Western Montana Bitterroot River", "date": "2024-08-01 00:30", "url": "https://newstalkkgvo.com/ixp/117/p/update-for-western-montanas-bitterroot-river/", "domain": "newstalkkgvo.com", "domain_classification": "Unknown", "message": "If anything should close a portion of a river to the public, that's probably as good of an example as any.\nClark Fork and Blackfoot River closures were lifted earlier this week.\nThe July 24 severe thunderstorm in the Missoula area caused extensive damage to power lines, trees, and property in the west-central Montana area.\nThe Aftermath of the Severe Thunderstorm in Missoula, Montana - July 2024 The National Weather Service cited 80 mph winds at the Missoula Montana Airport and over 100 mph winds at the apex of Mount Sentinel.\nPowerful winds left behind a path of broken trees, downed power lines, failing traffic lights, and debris as far as the eye can see."}, {"id": "407e86a1-09b7-4c4c-990c-b00e25c094c7", "title": "Officials declare California wildfires have burned 5 times more area this year alone :  We are not just in a fire season , we are in a fire year  ", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/officials-declare-california-wildfires-burned-230000399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials declare California wildfires have burned 5 times more area this year alone: 'We are not just in a fire season, we are in a fire year'Wildfires in California burned more than 300,000 acres through the third week of July.\nIt is still relatively early in California's wildfire season, but it is unfortunately already off to a roaring start.\nThrough the third week of July, the number of acres burned had nearly tripled the average of the past five years, according to Cal Fire.\nThere have been more than 4,000 wildland fires and over 2,500 structural fires in California so far.\nWhy is an active wildfire season in California important?"}, {"id": "3e1e1ced-9b10-45a6-995a-eb67b61acc95", "title": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outages", "date": "2024-08-01 04:45", "url": "https://www.wabe.org/severe-storms-in-georgia-and-other-southeast-us-states-leave-1-dead-and-cause-widespread-power-outages/", "domain": "wabe.org", "domain_classification": "Unknown", "message": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outagesA huge tree on Old St. Augustine Road rests on downed power lines in Tallahassee, Fla., Friday, May 10, 2024.\nPowerful storms with damaging high winds threatened several states in the Southeast early Friday.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "4e68243c-d6c0-4d9d-9730-f42fc64fad90", "title": "A Vermont sheriff has lost his driveway to flood waters twice in one month", "date": "2024-08-01 00:30", "url": "https://www.bostonglobe.com/2024/07/31/metro/vermont-sheriff-has-lost-his-driveway-flood-waters-twice-one-month/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Three weeks ago, the remains of Hurricane Beryl swept through northern Vermont, sending violent flood waters into homes and businesses and washing away roadways.\nJennifer Hemond said the couple’s home insurance does not cover flooding to a driveway.\nA National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\nJennifer Hemond said a local group is trying to raise money to help residents in the Northeast Kingdom affected by the floods.\nJennifer Hemond said the challenges of the past month added to an already stressful time, as she worried about her husband’s health."}, {"id": "59ea264f-d503-4647-b7bf-33492af62a4c", "title": "Tropical wave changes direction . Is SC still in its path ? | Hurricane Wire", "date": "2024-08-01 19:00", "url": "https://www.postandcourier.com/hurricanewire/tropical-wave-south-carolina/article_e08ec038-5010-11ef-942b-132db4dcdcff.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "The system is a tropical wave, and it was predicted to follow a northwesterly course when it appeared on a National Weather Service map late last week.\nHad the system continued to follow that line, it could have been sitting off the South Carolina coast with a chance of developing into a tropical cyclone.\nThe predicted track has now shifted west, taking South Carolina out of its direct path for the time being.\nChances that the wave will develop into a more serious tropical cyclone over the next two days are pegged at 20 percent.\nA tropical wave is an elongated area of relatively low pressure that moves east to west across the tropics."}, {"id": "0e8dca4a-e483-42e0-abcc-8b434fee31e2", "title": "Heat builds again in B . C . after cool reprieve for wildfire crews", "date": "2024-08-01 19:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-aug-1-2024-1.7282111", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "The heat is building again in British Columbia after days of rainfall and cooler temperatures tempered fire behaviour across the province.\nwon't see the same prolonged heat wave as last month, temperatures will be a little higher at night.\nThe heat is renewing concerns for firefighting crews who gained some reprieve with the recent cool spell.\nCooke said higher temperatures overnight means there's less chance fire activity will slow down.\nare encouraged to be prepared for the continued higher risk of wildfire in the province,\" the ministries said."}, {"id": "2796b6bc-d893-440d-88bc-f88c388db6ae", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-01 15:30", "url": "https://www.tvguide.co.uk/schedule/3ed38262-a24b-5704-ba1b-f9728f0dfe9e/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 9:00 PM to 10:00 PM Thursday 1 August Share Add toCalendar +Hellfire in Hawaii Season 1 Episode 2 New S SubtitlesIn 2023, Maui faced the worst natural disaster in its history as hurricane-force winds fuelled wildfires.\nEyewitnesses film their attempts to escapeIn the Eye of the Storm airs on Discovery Channel HD at 9:00 PM, Thursday 1 August .\n(Subtitles, new.)"}, {"id": "da871c15-849b-4186-8651-7a9bf4c01b53", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 17:15", "url": "https://www.yahoo.com/news/vermont-gets-respite-flood-warnings-163306257.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nDownload the FREE Boston 25 News app for breaking news alerts.\nFollow Boston 25 News on Facebook and Twitter.\n| Watch Boston 25 News NOW"}, {"id": "7db3d7e6-117d-4990-9d79-56ee563fcbec", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 12:45", "url": "https://abcnews.go.com/US/wireStory/vermont-gets-respite-flood-warnings-us-senator-pushes-112470133", "domain": "abcnews.go.com", "domain_classification": "International", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "96e22265-12b2-49d7-af5d-78fe0c66ce08", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 15:00", "url": "https://www.clickondetroit.com/news/national/2024/08/01/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "0d186166-4f7a-43f6-a4d5-fb6ae8f8f670", "title": "Tropical depression may develop over the Gulf , NHC says | Hurricane Center", "date": "2024-08-01 14:00", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/tropical-depression-may-form-gulf-atlantic-hurricane-season/article_4dbc108d-83dd-592d-87a2-097996e9c65e.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "38b117ca-2198-44b6-963a-58aa60379cd5", "title": "Tropical depression may develop over the Gulf , NHC says | Hurricane Center", "date": "2024-08-01 14:00", "url": "https://www.nola.com/news/hurricane/tropical-depression-may-form-gulf-atlantic-hurricane-season/article_ba1003be-4ffb-11ef-ba21-4397c99e789a.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "b1a8b12c-e088-47f8-8845-e844052b445d", "title": "Charleston County prepares for severe storms with emergency exercise", "date": "2024-08-01 03:30", "url": "https://www.live5news.com/2024/07/31/charleston-county-prepares-severe-storms-with-emergency-exercise/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "NORTH CHARLESTON, S.C. (WCSC) - Multiple agencies participated in Charleston County’s full-scale exercise to simulate a hurricane and determine the best response strategies.\nThe Charleston County emergency management team, plus more than 110 people from law enforcement, EMS and public works participated in an emergency exercise Wednesday at the Emergency Operations Center.\nEach year, county officials look at ways to not only add to their emergency plan but also refine it to ensure its effectiveness.\nInterim Director for Emergency Management for Charleston County Ben Webster explains how these exercises test their abilities.\n“It gets everyone in the same room, it gets everybody communicating, making sure that plan works, making sure that communication structure works and making sure that command structure works,” Webster said."}, {"id": "29aa8c6d-f4d0-4497-8c6f-47a66f0b9028", "title": "Invest 97L Could Pose Threat To Florida | FM 96 . 9 The Game", "date": "2024-08-01 17:30", "url": "https://969thegame.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "969thegame.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "026021f5-2c46-4d88-9dfd-7866865196ea", "title": "Invest 97L Could Pose Threat To Florida | NewsRadio WFLA", "date": "2024-08-01 17:30", "url": "https://wflanews.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "c3fd6872-5523-4e74-a5bd-1696d9bdf515", "title": "Invest 97L Could Pose Threat To Florida | NewsRadio WIOD", "date": "2024-08-01 17:30", "url": "https://wiod.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wiod.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "a834cd2c-7ad1-41a2-8060-fe7e126bd488", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 17:15", "url": "https://991wqik.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "991wqik.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "ee9dc4a8-490b-4bd7-ad51-6341e5f5d040", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:00", "url": "https://sunny985.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "sunny985.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "54c1cf69-6851-424e-af94-e753e109001e", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:00", "url": "https://993thebeat.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "993thebeat.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "86bc878a-9439-4da3-a774-9174474a538a", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:15", "url": "https://kissfm1071.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "kissfm1071.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "a5b5a0cd-0bc7-4ad3-9524-a2049db6c178", "title": "Invest 97L Could Pose Threat To Florida | Vero Patriot", "date": "2024-08-01 18:15", "url": "https://veropatriot.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "1b8f3fa5-6186-4c8c-aeaa-abd78278228d", "title": "Invest 97L Could Pose Threat To Florida | WMMB - AM", "date": "2024-08-01 19:00", "url": "https://wmmbam.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wmmbam.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "9cc4846c-29c2-4b71-bb7e-548c1a8c81f0", "title": "Is New Jersey suffering quake envy ? ", "date": "2024-08-01 17:30", "url": "https://nj1015.com/is-new-jersey-suffering-quake-envy/", "domain": "nj1015.com", "domain_classification": "Unknown", "message": "New Jersey comes with so many disappointments you’d think we’d be immune to them.\nIt’s when there’s a quake big enough to be felt yet I don’t feel it.\nAs Dan Alexander reported there was yet another aftershock to the April earthquake whose epicenter was in Hunterdon County.\nIt reminds me of the one in August 2011 when a 5.9 quake hit in Virginia and was felt throughout New Jersey and much of the Northeast.\nSuddenly half the people in the building were excitedly running around asking others if “they felt it.” The rest of us were asking, “Felt what?”It was a matter of what part of the building you were in."}, {"id": "0014bc00-6b05-48b5-8cfc-5ba667f939d5", "title": "IOP first responders take part in full - scale exercise to prepare for hurricanes", "date": "2024-08-01 00:00", "url": "https://www.yahoo.com/news/iop-first-responders-part-full-214815305.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ISLE OF PALMS, S.C. (WCBD) – First responders on the Isle of Palms put their hurricane response skills to the test on Wednesday during a full-scale exercise involving an imaginary storm.\nIOP police officers busted through the doors of a room inside of the resort, which jumpstarted the exercise.\nFirst responders quickly tended to the four volunteers pretending to be victims who sustained injuries amid the chaos.\nAfter a few minutes, the helicopter landed, Maynard was loaded inside, and they were back in the air again, marking the end of the exercise.\nThe simulation was part of a larger multi-day exercise conducted by the Charleston County Emergency Management Department."}, {"id": "e03808fe-c60b-4f1a-95a5-fcc613494806", "title": "BC Issues Flood Warning , Watches After Landslide Blocks River , Forces Evacuations", "date": "2024-08-01 15:00", "url": "https://www.theepochtimes.com/world/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-5697836", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "A massive amount of debris from a landslide damming the Chilcotin River in British Columbia’s central Interior could give way within the next 24 to 48 hours.\nWagner told a news briefing that the riverbed below the slide is dry, and officials aren’t certain about the potential downstream impacts when the dam is breached.\nBut she says it’s clear there would be “a mass of water” coming down the Chilcotin, which flows south into the Fraser River.\nEvacuation orders span 107 square kilometres along the Chilcotin, with the regional officials saying the slide poses an “immediate danger to life and safety.”The district says 60 properties are covered by the orders, including 12 homes with an estimated 13 residents.\nWagner says the slide is “massive,” with material piled 30 metres high and stretching 600 metres in length, completely blocking the flow of the Chilcotin."}, {"id": "aa81eb09-2aa7-4d74-97a5-87b2e41ff4c0", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations – Winnipeg Free Press", "date": "2024-08-01 08:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/2024/08/01/b-c-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "WILLIAMS LAKE, B.C.\n– A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia’s central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nBut she said it’s clear there would be “a mass of water” coming down the Chilcotin, which flows south into the Fraser River."}, {"id": "414f2029-82e9-40a7-b97b-8fe82ae4567d", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 13:45", "url": "https://wacotrib.com/ap/national/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package/article_122e61b1-8a8f-5245-b33a-4c4d32a702b5.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "0b12e4f6-9c06-4609-b1a9-0d632d3bae8c", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:15", "url": "https://www.thewesterlysun.com/news/national/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_78c587fe-f2a2-5b99-bdb6-d4578689eade.html", "domain": "thewesterlysun.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way"}, {"id": "da55c8c2-f982-4f04-9170-4f658c26f6b1", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:00", "url": "https://www.krmg.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "d7b7b9af-6d21-4989-b261-9c590ea37f89", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:15", "url": "https://www.recorderonline.com/news/national_news/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_74b3d0e2-8c17-5dc9-acdb-aaec5902f7da.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” as more heavy rains hit northeastern and central Vermont on Wednesday"}, {"id": "fce0b7cf-ddfd-4de1-afe5-8c901c1402cf", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-08-01 00:00", "url": "https://www.kelownacapnews.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "4a92e7e5-30d2-4d3f-ab30-1c577147f61d", "title": "Valley News - Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-08-01 01:00", "url": "https://www.vnews.com/Why-does-Vermont-keep-flooding-It-s-complicated-but-experts-warn-it-could-become-the-norm-56293929", "domain": "vnews.com", "domain_classification": "Unknown", "message": "Vermont is flooding.\nWarming atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nHeavily manipulated riversVermont’s history of heavily manipulating its rivers and streams also plays a role in increased flooding, Vermont Agency of Natural Resources secretary Julie Moore said.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms."}, {"id": "2f87c29c-cadd-45f9-a709-6186630028d4", "title": "California experiencing most severe start to wildfire season in 16 years", "date": "2024-08-01 00:00", "url": "https://www.mercurynews.com/2024/07/31/california-experiencing-most-severe-start-to-wildfire-season-in-16-years/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "US reporter and former Marine freed by Russia in multi-country prisoner swap"}, {"id": "99dce60a-28eb-477f-86a9-17581bf6883d", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 00:15", "url": "https://www.yahoo.com/news/unrelenting-heat-keep-us-sweating-214255793.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Unrelenting heat to keep US sweating during final month of summerThe scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nPeople walk along the coast as the sun sets on the Pacific Ocean at Windansea Beach in La Jolla during a summer heat wave on July 23, 2024 in San Diego, California.\nAn active hurricane season in the Atlantic – with a possible new tropical system approaching the Southeast during the first week of August – could easily bring enough rain to exceed monthly normal precipitation for the final month of summer.\nOriginal article source: Unrelenting heat to keep US sweating during final month of summer"}, {"id": "33661862-f22c-451e-9788-3e236aa72ae5", "title": "A tropical depression could form in the Gulf this weekend . What the MS Coast forecast ? ", "date": "2024-08-01 15:00", "url": "https://news.yahoo.com/news/tropical-depression-could-form-gulf-135223752.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "A tropical depression could form in the Gulf this weekend.\nThe forecast for a disturbance in the Atlantic shifted west Wednesday evening and the system could now become a tropical depression in the eastern Gulf of Mexico by the weekend, the National Hurricane Center said.\nThe National Hurricane Center is tracking a disturbance that could become a tropical depression in the Gulf of Mexico this weekend.\nIt could become a tropical depression this weekend or early next week once it passes the islands, forecasters said.\nThe disturbance could either stall or become stronger in the Gulf of Mexico, Cantore said on CBS Mornings."}, {"id": "69935885-acd3-45b3-ab4d-e97a1a063a1b", "title": "California experiencing most severe start to wildfire season in 16 years", "date": "2024-08-01 01:00", "url": "https://www.eastbaytimes.com/2024/07/31/california-experiencing-most-severe-start-to-wildfire-season-in-16-years/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Click to share on Facebook (Opens in new window)"}, {"id": "80e277a3-c209-402f-847a-04f3cd991a91", "title": "China flooding : Death toll jumps to 30 , 35 others missing in southeast", "date": "2024-08-01 15:00", "url": "https://www.ctvnews.ca/world/death-toll-jumps-to-30-with-35-others-missing-in-an-area-hit-by-heavy-rains-in-southeastern-china-1.6985631", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "BEIJING, China -At least 30 people have died and 35 others are missing in a city in southeastern China after days of heavy rains tied to a tropical storm, state media said Thursday.\nThe death toll rose sharply from a previously reported four deaths in villages in Zixing, a city in Hunan province.\nEarlier this week, state broadcaster CCTV showed helicopters being used to get relief supplies into severely flooded areas in Zixing.\nChinese Premier Li Qiang, visiting flood-hit villages in Zixing, urged all-out efforts to find the missing as search and rescue work continued.\nTropical Storm Gaemi also brought heavy rain to northeastern China and North Korea, swelling the Yalu River, which divides the two countries."}, {"id": "ea0537c9-99fc-440e-b2f0-39f6dd3df11b", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 04:45", "url": "https://nypost.com/2024/07/31/us-news/unrelenting-heat-to-keep-us-sweating-during-final-month-of-summer/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nAugust US temperature outlookNOAA’s temperature outlook shows above-average temperatures across most of the contiguous US and the northeast half of Alaska.\nThe Plains, Southeast and Gulf Coast states are forecast to begin August with a heat wave bringing dangerous heat to those regions through next week.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far."}, {"id": "76ced849-7577-4e33-893b-3f105d50c8d5", "title": "House members demand solutions from CenterPoint in the wake of failures during Beryl – Houston Public Media", "date": "2024-08-01 00:45", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/07/31/495344/house-members-demand-solutions-from-centerpoint-in-the-wake-of-failures-during-beryl/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Screenshot/Texas HouseCenterPoint CEO Jason Wells faced another day of questioning from Texas lawmakers regarding the utility's response to Hurricane Beryl.\nCommittee Vice Chair Ana Hernandez (D-Houston) took Wells to task over the company's failures before, during, and after Beryl.\nThat included the question of how CenterPoint planned to accelerate its process of replacing wooden poles with more durable ones by the end of the hurricane season.\n\"It was a little over 3,000 poles,\" Wells said, \"and we have about 1.2 million on our distribution system, and we can do better, and we will do better by replacing those wooden poles with composite poles.\"\nFurther, Wells said the company expects to replace just 1,000 wooden poles with composite ones by year's end."}, {"id": "bfc29aa1-fbf0-4013-ab1e-c10ba910d2ba", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:15", "url": "https://www.mix941.com/syndicated-article/?id=1577018", "domain": "mix941.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "836d6e97-efb3-4748-89a5-063d9b4878a0", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1577018", "domain": "exploreseiowa.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "8e75dafe-514d-4020-a4f4-4f8b30924566", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:45", "url": "https://kjlhradio.com/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "kjlhradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "23d16f7d-62f8-4ad2-a1de-7be58cc6049f", "title": "Cape Fear residents prepare as tropical wave moves through the Caribbean", "date": "2024-08-01 03:30", "url": "https://www.wwaytv3.com/cape-fear-residents-prepare-as-tropical-wave-moves-through-the-caribbean/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Cape Fear residents prepare as tropical wave moves through the CaribbeanLELAND, NC (WWAY) — Meteorologists are closely watching the Caribbean, as a tropical wave makes its way to the US.\nOn Wednesday, WWAY went to the Ace Hardware on Village Rd.\nFor now, its too early to tell if the wave will develop into tropical storm Debby, or if it will head toward the Cape Fear.\nWe do have the hurricane items that we usually bring out front,” Barker said.\nTo stay informed on the tropical wave, you can visit our daily forecast."}, {"id": "30a5686e-280b-4554-99a0-c5c900486117", "title": "Brooklyn man traveled to Florida during hurricane to have sex with young girl", "date": "2024-08-01 15:00", "url": "https://kval.com/news/nation-world/brooklyn-man-traveled-to-florida-during-hurricane-to-have-sex-with-young-girl", "domain": "kval.com", "domain_classification": "Unknown", "message": "TALLAHASSEE, Fla. ( ) — A Brooklyn man was sentenced to 40 years in prison after he traveled to Florida during a hurricane to have sex with a minor.\nBergida's case was investigated by the Perry Police Department, the Florida Department of Law Enforcement and Homeland Security, the DOJ says.\nCourt documents continue, that while law enforcement was enforcing the storm-related curfew they came across a young girl and learned of Bergida's sexual exploitation.\nLaw enforcement quickly responded to a local motel where they arrested Bergida.\nAfter his prison sentence, Bergida will have to undergo a lifetime of supervised release and will have to register as a sex offender."}, {"id": "d73f9d88-2810-4de5-8018-88a02c8df103", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations | iNFOnews", "date": "2024-08-01 08:45", "url": "https://infotel.ca/newsitem/landslide-evacuation/cp1443944904", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Landslide blocking B.C.\nriver could give way within 24 to 48 hours: regional officialA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nTHE CANADIAN PRESS/HO-Central Cariboo Search and Rescue *MANDATORY CREDIT *Original Publication Date August 01, 2024 - 1:01 AMWILLIAMS LAKE, B.C.\n- A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours."}, {"id": "e32042f3-5f62-497c-8600-5c0223859c84", "title": "Guest column : Comprehensive emergency strategies help county prepare for hurricane season", "date": "2024-08-01 17:30", "url": "https://www.bryancountynews.com/opinion/guest-column-comprehensive-emergency-strategies-county-prepare-for-hurricane-season/", "domain": "bryancountynews.com", "domain_classification": "Unknown", "message": "The Bryan County Emergency Management Agency operates continuously to foster a resilient community.\nBeyond the Fire and Emergency Services Department, several key appointed and elected officials in Bryan County play pivotal roles in all phases of emergency management.\nThe Bryan County Public Works Department is crucial during and after storms.\nThrough strategic planning, experienced leadership, and comprehensive emergency management strategies, Bryan County is committed to building a resilient community.\nNicholas Beard is the Communications Manager for the government of Bryan County."}, {"id": "1e1df0d4-83db-4c81-9860-ca3459868b6c", "title": "Florida remains in storm potential path | News", "date": "2024-08-01 07:45", "url": "https://www.keysnews.com/news/florida-remains-in-storm-s-potential-path/article_2de8bad0-4f4b-11ef-9037-6be780c2e259.html", "domain": "keysnews.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "579ee459-0a79-4955-bc8b-fd910682c5f5", "title": "National - Carroll Broadcasting Inc . ", "date": "2024-08-01 18:15", "url": "https://wkjc.com/national/1b6035bf0100e87c0b49a7f53a2a33ef", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "c30c3628-84e5-4c0b-a7cb-e9a2efaff68d", "title": "Smoke Advisory extended ; monsoonal moisture arrives Thursday", "date": "2024-08-01 00:15", "url": "https://kesq.com/weather/local-forecast/2024/07/31/smoke-advisory-extended-monsoonal-moisture-arrives-thursday/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "The Smoke Advisory has been extended for parts of Riverside County due to elevated fine particle pollution in the air from wildfire smoke.\nA ridge of high pressure to our east will expand west and begin to steer monsoonal moisture into Southern California.\nAny storm that develops could bring heavy rain, lightning, and gusty winds.\nThe storm chances decrease for the weekend but remain in the forecast for the mountains and deserts through the middle of next week.\nThis weekend will also bring more heat, prompting an Excessive Heat Watch to be issued for Saturday and Sunday."}, {"id": "44983ec0-1098-4001-969c-c816931f67a7", "title": "Caribbean conservationists urge greater focus on disaster risk management", "date": "2024-08-01 07:30", "url": "https://jamaica-gleaner.com/article/news/20240801/caribbean-conservationists-urge-greater-focus-disaster-risk-management", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Caribbean conservationists are encouraging small island developing states (SIDS) to place greater attention on disaster risk management and prevention measures, so that the appropriate strategies are in place and actionable before the countries are devastated by natural disasters.\nSpeaking at a Global Conservation Connection webinar on Tuesday under the topic ‘Disaster Risk Management and Hurricanes in the Caribbean’, keynote speaker Dr Trevor Johnson Jr, from The Bahamas, a consultant with the Inter-American Development Bank and a regional disaster management specialist with the Pacific Disaster Center, stated that issues surrounding disaster management should be at the forefront of the agenda of all governments within the Caribbean region.\nHe argued that as disasters impacted every socio-economic sector, deliberate, laser-focused and pragmatic regional discourse is necessary, and that the issues of disaster risk management demand a full community approach.\n“Disaster risk management is everyone’s business,” he said.\nShe continued that St Lucia has had challenges with disaster risk management, particularly in the town of Soufrière, which is extremely vulnerable to hurricanes and storm surge damages."}, {"id": "e79a0e88-a50f-4938-bc13-8204dd3a7311", "title": "Minor Earthquake Felt in Parts of New York State", "date": "2024-08-01 18:15", "url": "https://wyrk.com/ixp/705/p/earthquake-tremor-new-york-felt-shake-ny-state-north/", "domain": "wyrk.com", "domain_classification": "Unknown", "message": "Several fault lines across the region have been a bit active as of late, as seismologists say an earthquake was felt in parts of New York state this week.\nAccording to the NESEC, around 551 earthquakes were recorded in New York state from 1737 to 2016.\nMinor Earthquake Felt in Parts of New York StateNBC reports that a 2.8 magnitude earthquake was felt in parts of Clinton and Franklin Counties in northern New York Monday.\n44 of Biggest Earthquakes to Shake New York State New York is no stranger to earthquakes.\nA 2008 study proposed that there may be an additional fault zone extending from the Ramapo Fault into southwestern Connecticut."}, {"id": "abb69b30-4e18-4430-9128-bff35593f340", "title": "Gulf Coast : Check your trees for storm readiness before the next storm hits", "date": "2024-08-01 01:15", "url": "https://www.yahoo.com/news/gulf-coast-check-trees-storm-225725306.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gulf Coast: Check your trees for storm readiness — before the next storm hitsBALDWIN COUNTY, Ala. (WKRG) — It’s not “if” a hurricane will hit our area, it’s “when”.\nBefore that happens, experts ask that people look up and check if their trees can weather the storm.\nOkaloosa County suspect in spider’s death arrested“Whole trees came down right from the roots,” that was during Hurricane Sally and since then Jack Ruck has been concerned about some of his trees.\nNorah O’Donnell leaving as anchor of CBS evening newscast after electionHe brought that concern to a workshop where Certified Arborist and Extension Agent Joel Potter said now is the time to check your trees.\nThe root system is also very important but so is what’s above the roots."}, {"id": "5b9deab3-7103-439e-9109-9e243e430cb9", "title": "Croatia reports its toughest day for firefighters as Balkan nations battle wildfires in a heat wave", "date": "2024-08-01 07:45", "url": "https://www.newsday.com/news/nation/balkans-wildfires-croatia-heat-wave-drought-u23758", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Croatia’s Firefighters’ Association said the demanding 24-hour period included responding to more than 100 fires with over 1,000 firefighters and 20 firefighting planes.\nIn North Macedonia, some 66 wildfires erupted over the past 24 hours.\nFirefighters gather near the wildfire in Tucepi, Croatia, late Tuesday, July 30, 2024.\nCountries like North Macedonia, Bulgaria and Albania have all sought help from abroad.\nFirefighters gather near the wildfire in Tucepi, Croatia, late Tuesday, July 30, 2024."}, {"id": "2738ee16-bbca-480a-af6e-712854af16ba", "title": "Megan Forecast : Turning up the heat and humidity", "date": "2024-08-01 03:15", "url": "https://www.10news.com/weather/san-diegos-weather-forecast-for-july-31-2024-turning-up-the-heat-and-humidity", "domain": "10news.com", "domain_classification": "Unknown", "message": "It's about to be feeling a lot more tropical in San Diego as monsoon flow returns bringing high humidity and a chance of showers and thunderstorms.\nHigh pressure over Texas will expand west, ushering in warmer and more humid conditions that will stick around well into next week.\nThe deserts will see the return of excessive heat with an Excessive Heat Watch issued for Saturday and Sunday.\nExpect high temperatures between 113 and 117 degrees and morning lows only dipping into the mid-80s to low-90s.\nThe high heat and above-normal temperatures are expected to last through at least August 9th, with less hot and humid conditions expected to follow."}, {"id": "0d558fb0-1d6c-40df-ab99-8b8c10acefc6", "title": "Powerful bow echo slams Omaha with hurricane - force winds", "date": "2024-08-01 06:30", "url": "https://www.yahoo.com/news/powerful-bow-echo-slams-omaha-033020443.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "– Severe thunderstorms rocked eastern Nebraska and southwestern Iowa on Wednesday, causing widespread power outages in the Omaha metro area.\n\"The windstorm that struck the OPPD service territory caused power outages to 220,545 customers,\" OPPD stated Wednesday night.\nDespite the flurry of severe weather, local authorities did not report any deaths associated with the event.\nThe region is expected to clear out from additional severe weather chances as a frontal boundary that has been slow to move finally begins its eastward advancement.\nOriginal article source: Powerful bow echo slams Omaha with hurricane-force winds"}, {"id": "8a871d17-83ed-4bd8-86df-7c008b1f5d06", "title": "B . C . landslide prompts flood warning hundreds of kilometres down the Fraser River", "date": "2024-08-01 17:30", "url": "https://www.timescolonist.com/bc-news/bc-landslide-prompts-flood-warning-hundreds-of-kilometres-down-the-fraser-river-9297544", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\n— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nBut she said it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River.\nThe province has warned people to stay away from the banks of the Chilcotin River below the slide all the way down to the Fraser River north of Hope, about 150 kilometres east of Vancouver.\nThe forecast centre says the eventual breach of the landslide debris could also lead to an \"outburst flood\" with a surge of water rapidly flowing downstream."}, {"id": "550bbe52-abee-4c72-a418-2cc18733a20e", "title": "FIRST ALERT : Tropical development still likely this weekend or early next week", "date": "2024-08-01 02:45", "url": "https://www.wmbfnews.com/2024/07/31/first-alert-slow-tropical-development-expected-by-weekend/", "domain": "wmbfnews.com", "domain_classification": "Unknown", "message": "MYRTLE BEACH, SC (WMBF) - An area of disturbed weather continues to approach the Bahamas and may develop into a tropical depression or tropical storm by this weekend or early next week.\nDevelopment of this system is unlikely during the next couple of days while it moves west-northwestward over portions of the Greater Antilles.\nThe chance of development sits at 20% over the next two days and 60% over the next five days.\nRight now, a westward trend of this system looks to bring impacts closer to Florida or even the Gulf of Mexico next week.\nAreas in the Gulf of Mexico and near Florida should monitor this chance of development closely."}, {"id": "f758b83b-c67b-432e-badc-8370cb9a4a7d", "title": "Met Office on weather triple whammy as thunderstorms , flooding , and 30C temperatures set to sweep united kingdom ", "date": "2024-08-01 01:45", "url": "https://www.mirror.co.uk/news/uk-news/met-office-weather-triple-whammy-33371511", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning over thunderstorms that will bring heavy rainfall and the risk of flooding to parts of the UK on ThursdayBrace yourselves for a wild weather ride, as the Met Office is warning of thunderstorms and hail lashing parts of the UK today, amid scorching temperatures already reaching up to 30C in many parts.\nWith heatwave temperatures, storm clouds, and flooding on the horizon, some could see a triple whammy of extreme weather on Thursday.\nThis follows two days of heatwave temperatures, which has seen many in the UK finally get a taste of hot summer weather.\nImage: Getty Images) Getty Images)Central, southern, and eastern England, along with South Wales, are set to face scattered but intense showers and thunderstorms later on Thursday.\nTemperatures are set to soar up to 30C from Hampshire to north London, while western Scotland is expected to experience the day's coolest temperatures, ranging between 17C and 18C."}, {"id": "6f5b3684-ce37-4253-9eb0-02380dd7b9b8", "title": "Wildfire safety tips from experts", "date": "2024-08-01 00:00", "url": "https://edition.cnn.com/travel/how-to-survive-avoid-wildfire/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "If you’re completely overrun by fire, take shelter inside your vehicle – you’re going to be much better off than outside of the vehicle.\nIf you’re trapped outside during a wildfireThe Oak Fire burns through trees on July 24, 2022, near Jerseydale, California.\nIf you're trapped outdoors in a fire, try to find downhill escape routes.\nJustin Sullivan/Getty ImagesIf you’re trapped outdoors with a wildfire approaching, call 911 and give them your exact location, Heggie said.\nMott said we should think ahead and prepare for wildfire but also “don’t worry yourself sick about it."}, {"id": "9e588164-a7ea-4fe3-bb4c-bd87d8354365", "title": "Broker on the P & C reinsurance sector in Florida today", "date": "2024-08-01 17:30", "url": "https://www.insurancebusinessmag.com/au/news/reinsurance/broker-on-the-pandc-reinsurance-sector-in-florida-today-499766.aspx", "domain": "insurancebusinessmag.com", "domain_classification": "Unknown", "message": "“Our growth has already taken us lengths ahead of where we were last year, and far more compared to where we were the year before, but we want to stretch even further.\nThis is an ambition, but it is also one driven very much by the way we have been able to grow so far.”"}, {"id": "84c2d16b-7290-463f-ab82-7e607f0eec6a", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 05:45", "url": "https://953thebear.com/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "953thebear.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast."}, {"id": "45edc99c-6f7e-4c56-a703-325b698c10af", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 02:30", "url": "https://wtug.com/ixp/532/p/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "wtug.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast."}, {"id": "37ce19ba-a83a-4089-b397-de971bcaf575", "title": "Severe storms in the Southeast US leave 1 dead and caus ... ", "date": "2024-08-01 05:45", "url": "https://accesswdun.com/article/2024/7/1255330", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "CANTON, Ga. (AP) — A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday's remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "bd259eab-e085-477e-9e8f-f91ccc67ea3a", "title": "Strong - to - severe storms could snarl rush hour in Chicago area – NBC Chicago", "date": "2024-08-01 01:30", "url": "https://www.nbcchicago.com/weather/severe-storms-could-bring-damaging-winds-heavy-rain-to-chicago-area/3507798/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area could wake up to strong-to-severe thunderstorms on Thursday, with the National Weather Service’s Storm Prediction Center upgrading the region to a “slight” risk of severe weather.\nAny storms that do develop could still produce rain and gusty winds, but may not reach severe limits.\nThe threat of rain in the Chicago area could stick around into Friday, as an area of low-pressure spins over Lake Michigan, shifting winds out of the north and bringing a few different waves of rain to the region.\nIt isn’t likely severe weather will develop from that system, but some embedded storms could form.\nThe next chance of rain doesn’t emerge until Tuesday, with temperatures cooling off after that system moves through."}, {"id": "426d29ea-c40f-4e1c-8ec4-9dc24114dfff", "title": "A Severe Thunderstorm Watch has Been Issued", "date": "2024-08-01 00:15", "url": "https://www.kcrg.com/2024/07/31/evening-storms-with-severe-weather-possible/", "domain": "kcrg.com", "domain_classification": "Unknown", "message": "CEDAR RAPIDS, Iowa (KCRG) - A Severe Thunderstorm Watch has been issued for our western counties until 1 a.m.Current severe weather alerts from the National Weather Service.\n(KCRG)Your First Alert: More severe storm chances late this evening into tonightStorms are likely tonight, with a threat of severe weather once again.\nThe Storm Prediction Center includes most of the viewing area in a slight risk for severe weather with this activity, with the chances somewhat higher in central and western Iowa.\nSevere Weather Outlook (KCRG)Storm Timing (KCRG)Flash flooding could develop in spots today with the potential for heavy rainfall.\nThe threat for severe weather looks lower, but be ready for a potential brief period of rain and some lightning to move through at times."}, {"id": "6914f624-51a4-4b49-8818-8ade0a1713c4", "title": "Live updates : Storms blast Omaha , closing Eppley Airfield , leaving 191 , 000 without power", "date": "2024-08-01 00:15", "url": "https://omaha.com/news/local/weather/live-updates-thunder-rattles-homes-132-000-without-power-as-severe-storms-hit-omaha/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Storms creating damaging wind gusts of 90 miles per hour, sideways rain and house-rattling thunder left at least 216,000 without power in the Omaha metro Wednesday evening, according to Omaha Public Power District's power outage alerts.\nNeighbors helped each other drag tree branches out of the road and survey damage to houses, which included downed fences, dislodged shingles on roofs and massive tree branches that narrowly missed vehicles.\n7:20 p.m.| The current power outage figures rival previous, memorable widespread Omaha power outages.\nWater pooled on the ground, tree branches swayed and several different sirens sounded through downtown.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "714d1bcb-1ad0-44e4-9073-3a2cc46a3798", "title": "Live updates : Storms blast Omaha , closing Eppley Airfield , leaving 191 , 000 without power", "date": "2024-08-01 00:15", "url": "https://omaha.com/news/local/weather/live-updates-storms-blast-omaha-closing-eppley-airfield-leaving-132-000-without-power/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Storms creating damaging wind gusts up to 100 mph, sideways rain and house-rattling thunder left at least 218,000 without power in the Omaha metro Wednesday evening, according to Omaha Public Power District's power outage alerts.\nThursday, Aug. 1:11:27 a.m.| Gardeners, Amanda Stastny is offering free native plants to anyone who can help her clean up storm damage in her yard.\n8:20 a.m.| All Douglas County Health Department Offices are closed Thursday due to the power outage caused by yesterday's storm, according to a DCHD spokesperson.\n7:20 p.m. | The current power outage figures rival previous, memorable widespread Omaha power outages.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "4c32f489-562a-40f4-8ee0-126aa513c7b8", "title": "In the US , Disasters Strike All Over the Country", "date": "2024-08-01 00:45", "url": "https://learningenglish.voanews.com/a/in-the-us-disasters-strike-all-over-the-country/7712635.html", "domain": "learningenglish.voanews.com", "domain_classification": "Unknown", "message": "But a study from the nonprofit Rebuild by Design and New York University says disasters happen everywhere across the country.\nThe study looks at information on hundreds of federally declared disasters from 2011 to about 2021.\nThe study finds that eight of the nine counties with the most federally declared disasters since 2011 are in Kentucky.\nDisasters in unexpected placesIn July 2022, at least 40 people died, and 300 homes were damaged when a flood struck Floyd County in eastern Kentucky.\nSince 2011, FEMA has paid more than $41 billion in aid following hurricanes, the most of any kind of disaster."}, {"id": "003829e6-67f0-4715-9a66-9180fb66a6a1", "title": "Tropical Track Shifts Toward Gulf - Louisiana Could Feel Effects", "date": "2024-08-01 11:15", "url": "https://talkradio960.com/ixp/33/p/tropical-track-shifts-toward-gulf-louisiana-could-feel-effects/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "Forecasters with the National Hurricane Center have been monitoring a tropical wave as it moved across the Atlantic Ocean.\nHere is the track forecast from the early morning hours of July 31st.\nNHC.noaa.gov NHC.noaa.gov loading...Over the past 12 to 24 hours track model forecasts have shifted more to the west.\nOne tropical model is particularly troublesome as it suggests the system will enter the Gulf of Mexico, strengthen, and then approach the Florida Panhandle.\nBy the way, should the system earn a name as a tropical storm it would be called Debby."}, {"id": "7ae0216b-3f37-46ac-9d67-68e962969171", "title": "Wildfires Can Create Their Own Weather , Further Spreading the Flames − An Atmospheric Scientist Explains How", "date": "2024-08-01 15:00", "url": "https://www.nakedcapitalism.com/2024/08/wildfires-can-create-their-own-weather-further-spreading-the-flames-%E2%88%92-an-atmospheric-scientist-explains-how.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "But how can a fire create weather?\nCSU/CIRA and NOAA I’m an atmospheric scientist who uses data collected by satellites in weather prediction models to better anticipate extreme fire weather phenomena.\nCooler air then rushes in to fill the void left by rising air.\nIf the temperature cools rapidly with elevation above the ground, then the rising air will always be warmer than its surroundings and it will keep rising.\nWhen conditions in the lower atmosphere are dry, this can lead to what’s known as dry lightning."}, {"id": "3fd99152-0f91-4658-a935-3c427b33f659", "title": "TROPICAL DEPRESSION : Hurricane Center Now Says Formation Likely Within Days", "date": "2024-08-01 19:00", "url": "https://bocanewsnow.com/2024/08/01/tropical-depression-hurricane-center-now-says-formation-likely-within-days/", "domain": "bocanewsnow.com", "domain_classification": "Unknown", "message": "National Hurricane Center update for Thursday afternoon.\nBY: WEATHER TEAM | BocaNewsNow.comBOCA RATON, FL (BocaNewsNow.com) (Copyright © 2024 MetroDesk Media, LLC) — The National Hurricane Center Thursday afternoon says there is a 70-percent chance that a tropical depression will form over the next several days.\nHere is the Thursday afternoon update from the National Hurricane Center.\nDevelopment of this system should be slow to occur during the next day or so while it moves west-northwestward over portions of the Greater Antilles.\nInterests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system."}, {"id": "c581dc01-102a-4c0a-bd4f-0c157a224448", "title": "Live updates : Severe storms blast Omaha , leaving 216 , 000 without power", "date": "2024-08-01 00:45", "url": "https://omaha.com/news/local/weather/live-updates-severe-storms-blast-omaha-leaving-216-000-without-power/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The massive wind storm brought down trees and branches, knocked over power lines and lifted heavy objects.\nWeather service: 'Peaceful weekend ahead'5:11 a.m.| Storm recovery workers will have good weather in which to work, the National Weather Service in Valley said Thursday morning.\n7:20 p.m. | The current power outage figures rival previous, memorable widespread Omaha power outages.\nA flood advisory due to excessive rainfall is also in effect until 9:15 p.m., according to the weather service.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "0cd639f3-d759-4589-a69a-5e8ea96dcb71", "title": "News Wrap : 1 dead in Colorado Stone Canyon wildfire", "date": "2024-08-01 02:15", "url": "https://www.wuft.org/shows/newshour/clip/news-wrap-1722463505", "domain": "wuft.org", "domain_classification": "Unknown", "message": "In our news wrap Wednesday, one person has been killed in a wildfire in Colorado, more storms are in the forecast as Vermont residents clean up the mess left by debilitating rain and flooding, Venezuelan President Maduro asked his country's Supreme Court to audit the contested presidential election and the Biden administration announced proposals aimed at stopping the flow of fentanyl from Mexico."}, {"id": "74607370-ebb6-4410-8553-47bc619f5c58", "title": "Canton to relocate fire department with federal funds after repeated flooding", "date": "2024-08-01 02:45", "url": "https://wlos.com/news/local/canton-relocate-fire-department-federal-funds-repeated-flooding-mayor-fire-chief-fire-station-town-hall-flood-plain-tropical-storm-hurricane-faciliyu", "domain": "wlos.com", "domain_classification": "Unknown", "message": "After a long wait, financial help for Canton is working its way through the U.S. Congress.\nA total of $5.8 million is in the pipeline in Washington, D.C. to come to Canton for the fire department to move out of the flood plain.\nIt was August 17, 2021, when remnants of Tropical Storm Fred swamped downtown Canton, including the fire station, nearby town hall and police department.\nThe height of the water inside the station is marked on the wall from Hurricane Ivan and Tropical Storms Frances and Fred.\n\"We had nine feet of water, 12 feet and then five feet last time with Fred,\" Wheeler said."}, {"id": "45355d78-19eb-46ff-936b-4bc2a62c00c2", "title": "Audit NZ sounds warning bell as Thames seawall construction confirmed", "date": "2024-08-01 18:45", "url": "https://www.nzherald.co.nz/nz/audit-nz-sounds-warning-bell-as-thames-seawall-construction-confirmed/OIM5UQXHTFDMHFQSCTCS62ECYU/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "A public meeting held in June presented various concept designs for protection against a half metre of sea-level rise and a one-in-100-year storm in Thames.\n“After taking on board public feedback from the meeting, the project’s governance team confirmed stop banks will be constructed where space allows along the Thames foreshore.\nIt was confirmed a workshop on project progress would be held this month for district councillors, followed by another public meeting.\nThe meeting would provide an update on project work to understand fluvial, or river, hazards and risks to Thames.\nThe project team also expected to have more information to share on the costs associated with protection construction."}, {"id": "57824a8a-7b9d-480e-9db9-f260def216d6", "title": "RAM Hurricane Engine Vs . Chrysler HEMI V8 : What The Difference ? ", "date": "2024-08-01 18:00", "url": "https://www.slashgear.com/1630878/ram-hurricane-engine-vs-chrysler-hemi-v8-what-difference-between/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The Ram 1500 truck has featured a choice of several engines over its lifespan, but one of the most celebrated (and marketed) has been the powerful V8 HEMI.\nThat variable timing optimizes cylinder firing in all gears, providing torque for towing but also reliable horsepower throughout the rpm range.\nAs the HEMI has aged, emissions standards have gotten stricter, and for the 2024 model year, this engine was phased out.\nThe Ram 1500 replaced it with the Hurricane, a new, smaller engine.\nThe Hurricane engine has six cylinders and two turbochargers — each turbocharger boosting three cylinders."}, {"id": "61c0f496-bc37-4d05-9edb-4f24d7d57708", "title": "Technically at war , South Korea offers flood relief to North Korea", "date": "2024-08-01 11:00", "url": "https://www.firstpost.com/world/technically-at-war-south-korea-says-ready-to-offer-flood-relief-to-north-korea-13799678.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "South Korea is ready to provide North Korea with relief supplies for damage caused by recent heavy rainfall, South Korea’s Red Cross said on Thursday, marking a rare outreach under the administration of President Yoon Suk Yeol to its neighbour.\nNorth Korean leader Kim Jong Un personally inspected the flooded areas and expressed grave concern over the damage, state media said on Monday.\nThere is a possibility of “significant human casualties” in North Korea, a Unification Ministry official said on Thursday.\nNorth Korea has cut off all lines of official communication with the South.\nMore rain was forecast for Sinuiju on Thursday and early Friday, according to South Korea’s weather agency."}, {"id": "3e21b5ce-2333-403b-96ce-40bbb54687b0", "title": "Wild flamingos spotted in Georgia", "date": "2024-08-01 06:15", "url": "https://www.foxcarolina.com/2024/08/01/wild-flamingos-spotted-georgia/", "domain": "foxcarolina.com", "domain_classification": "Unknown", "message": "“Now we have another new species on the island which is really cool,” amateur naturalist Joshua Wicker said.\nWhen Joshua Wicker and his family visited St. Simons Island a few weeks ago, they were tickled pink by what they saw.\n“They’re up on a big marsh on the inside of the island, and it was just like, ‘Oh there it is!’”During the trip, Wicker spotted five flamingos hanging out in the water.\nThis is Georgia,” Wicker thought when he first saw them.\nIf you’re interested in learning more about wildlife in the area, Joshua Wicker offers entertaining and educational videos on his page, Y’all, Be Looking!"}, {"id": "7c17aee7-9dab-4ddc-99ff-ba372ed38394", "title": "South Korea ? 14 new dams initiative sparks mixed reactions from residents , local governments", "date": "2024-08-01 08:15", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/371_379797.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "In regions frequently affected by torrential rains, the plan was welcomed, while significant concerns arose in areas that have previously experienced negative impacts from dam construction.\nThe 14 candidate sites for the dams include nine locations proposed by local governments and five selected by the ministry.\nMixed reactions to dam plansAreas that frequently suffer from flooding during torrential rains welcomed the government's dam initiative.\nSimilarly, local governments in Daegu and North Gyeongsang Province, which have long advocated for dam construction, are supportive of the new plans.\nEnvironmental groups are voicing strong opposition to the government's dam construction plan, questioning its effectiveness and warning of potential ecological damage."}, {"id": "be55293b-d3a8-4088-a43b-5c83d3890b02", "title": "Update : Damaging winds anticipated with thunderstorms in Dale and Houston counties Wednesday", "date": "2024-08-01 04:15", "url": "https://www.al.com/weather-alerts/2024/07/update-quarter-sized-hail-and-damaging-winds-anticipated-with-thunderstorms-in-southeast-alabama-wed.html", "domain": "al.com", "domain_classification": "Unknown", "message": "The National Weather Service issued an updated severe thunderstorm warning at 7:11 p.m. on Wednesday in effect until 7:30 p.m. for Dale and Houston counties.\nThe weather service adds, \"For your protection move to an interior room on the lowest floor of a building.\nUnfortunately, lightning is responsible for claiming the lives of approximately 20 people annually, as reported by the weather service.\nMastering wet roads: Safety tips for heavy rainfallWhen heavy rain pours, the risk of flooding and treacherous roads rises.\nAdvance Local Weather Alerts is a service provided by United Robots, which uses machine learning to compile the latest data from the National Weather Service."}, {"id": "1532e6f8-e413-41d8-bd14-fd66c17888be", "title": "Earthquakes equalize late , but Galaxy score in 89th minute , steal win", "date": "2024-08-01 08:15", "url": "https://www.mercurynews.com/2024/07/31/earthquakes-equalize-late-but-galaxy-score-in-89th-minute-to-steal-leagues-cup-win/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "SAN JOSE — The San Jose Earthquakes certainly had opportunities for another surprise Leagues Cup win against the LA Galaxy on Wednesday.\nSan Jose finally equalized in the 75th minute on Jeremy Ebobisse’s strike in the box, but Los Angeles responded with substitute Miguel Berry’s tap-in off a Miki Yamane assist in the 89th minute.\nSan Jose needs a Galaxy win of any kind to guarantee a spot in the Leagues Cup’s 32-team knockout round.\nBut if they can carry their upgraded quality of play from the Leagues Cup forward, things may be different down the stretch.\nYet it could be a step in the right direction, one that eventually leads to San Jose breathing rarefied air once again."}, {"id": "25781a6b-9005-47bc-b50d-d221754f8d63", "title": "Drivers warned to brace for spray , sudden flooding and road closures", "date": "2024-08-01 16:30", "url": "https://www.oxfordmail.co.uk/news/national/24491971.drivers-warned-brace-spray-sudden-flooding-road-closures/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "The Met Office has warned the conditions could lead to road closures, cancellations to train and bus services, and power cuts.\nFlooding of homes and businesses could also happen quickly, the forecaster warned, with damage to some buildings from floodwater, lightning strikes, hail or strong winds.\nShe added that parts of the warning zone could see up to 50mm of rain in an hour or two.\nHeading into Friday, she said there was still a chance of thunderstorms in the east of England, with temperatures of up to 30C.\nWhile on Saturday, outbreaks of rain are expected in the south of England, with the highest temperatures around 25C-26C."}, {"id": "483978c2-20a9-49a1-b6a4-48f1ee49e690", "title": "Jasper wildfire : Officials to provide update from Hinton Thursday afternoon", "date": "2024-08-01 17:45", "url": "https://globalnews.ca/news/10675397/jasper-wildfire-update-thursday-august-1/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailFederal, provincial and municipal leaders are scheduled to provide an update on the Jasper wildfire situation Thursday afternoon.\n“Extreme fire behaviour may begin as soon as tomorrow,” Jasper National Park said in an update Wednesday night.\nHighway 16 through Jasper National Park reopened to commercial traffic at 5 a.m. Thursday.\nFor now, commercial trucks, tractors and trailers with a registered gross vehicle weight exceeding 11,794 kilograms can use the highway during the following time periods:5 a.m. – 7 a.m. MT10 a.m. – 5 p.m. MT8 p.m. – 9 p.m. MTThe Jasper wildfire — dubbed the Jasper wildfire complex — remains out of control at about 32,500 hectares in size.\nFor the latest information on the wildfire status and danger across the province, visit the Alberta Wildfire website."}, {"id": "19152087-fcac-49e6-8e29-c2a4357ba437", "title": "2 . 2 magnitude earthquake shakes Hunterdon County in New Jersey", "date": "2024-08-01 00:45", "url": "https://www.yahoo.com/news/2-2-magnitude-earthquake-shakes-215747519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TEWKSBURY TOWNSHIP, N.J. (PIX11) – Maria Hadley has had enough earthquakes for a while.\n“I woke my husband and I’m like, ‘earthquake!’ and he’s like, ‘what?’ I’m like, ‘earthquake!’ He goes, ‘you’re dreaming, go back to sleep.\n'”More New Jersey NewsAccording to the USGS, another earthquake struck early Wednesday in Tewksbury Township, just a few minutes away from Hadley’s home, registering at 2.2 magnitude.\nWhen a 4.8-magnitude earthquake rocked the northeast on April 5, many of her plates and fine china crashed to the ground.\nMore Local NewsIf you live in or around Tewksbury Township, you may be curious when all this seismic activity will end."}, {"id": "7d3d2e78-e339-4be6-96f1-f174ee8021c7", "title": "Man runs over moving ground to narrowly escape landslide along B . C . river : rescuer | iNFOnews", "date": "2024-08-01 18:00", "url": "https://infotel.ca/newsitem/man-runs-over-moving-ground-to-narrowly-escape-landslide-along-bc-river-rescuer/it105975", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Vernon News Man runs over moving ground to narrowly escape landslide along B.C.\nImage Credit: THE CANADIAN PRESS/HO-Central Cariboo Search and Rescue *MANDATORY CREDIT*WILLIAMS LAKE, B.C.\nThe province said several helicopters were dispatched to assist with search and rescue efforts in the area.\nBortolussi said the rescued man sustained lower-body injuries during his escape, and he's in stable condition after spending the night atop the slide area.\nBortolussi said the search and rescue team is on standby as the landslide continues blocking the river, which is a popular rafting route."}, {"id": "e3820a61-50ec-4af0-921c-53faddf6494f", "title": "August begins with hot temperatures and a few isolated thunderstorms", "date": "2024-08-01 04:45", "url": "https://www.koaa.com/weather/august-begins-with-hot-temperatures-and-a-few-isolated-thunderstorms", "domain": "koaa.com", "domain_classification": "Unknown", "message": "Tonight's Forecast:Tonight will be mostly clear, but there will be some wildfire smoke in the air from fires in northern Colorado.\nPlains forecast: Low: 60s; High: 90s;Mostly sunny and hot, just shy of the triple digits in the eastern plains.\nWalsenburg and Trinidad forecast: Low: 60/60; High: 91/90;Mostly sunny for the first half of the day with hot temperatures.\nMountains forecast: Low: 40s/50s; High: 80s;The mountain valleys will be hot, with highs in the mid to upper-80s on Thursday.\nExtended outlook forecast:Friday will be similar to Thursday with hot temperatures, a hazy sky with wildfire smoke, and a chance of afternoon thunderstorms."}, {"id": "eaf9f9d6-e8f7-4adf-89e6-4d4399102b74", "title": "Loudoun County farmers can apply for emergency drought aid", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/loudoun-county-farmers-apply-emergency-220216628.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LOUDOUN COUNTY, Va. (DC News Now) — Farmers in Loudoun County are eligible for emergency loan assistance from the federal government due to the drought during this year’s growing season.\nU.S. Department of Agriculture (USDA) Secretary Thomas Vilsack declared Loudoun and 14 other Virginia counties as “primary natural disaster areas,” allowing the Farm Service Agency (FSA) to offer emergency loans and other assistance to farmers impacted by the drought.\nFarmers have eight months to apply for the loans.\nFarmers in Loudoun County specifically can also receive support through the Loudoun County Department of Economic Development and Virginia Cooperative Extension.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "02ea57dc-c6ba-4ad3-bd3d-080b9e59ff12", "title": "Banff , Lake Louise put out call for visitors amid Jasper National Park wildfire closure", "date": "2024-08-01 18:30", "url": "https://globalnews.ca/news/10675575/banff-lake-louise-still-open-to-visitors/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailTourism officials in Banff and Lake Louise, Alta., are reminding visitors that those mountain towns are open for business as Jasper National Park remains closed due to wildfires.\nIn a news release Thursday, Banff and Lake Louise Tourism said there are currently no wildfires threatening the Rocky Mountain communities.\n“We understand that the recent wildfire in Jasper has raised concerns among some travellers,” said Leslie Bruce, president and CEO of Banff and Lake Louise Tourism.\nOfficials said smoke from the Jasper wildfire and others in the region is moving through the region, but smokiness regularly changes.\nJasper National Park was evacuated on July 22 as wildfires encroached on the community."}, {"id": "de0465ea-e759-4bf5-be4f-6f45aff603df", "title": "Alf Coleman Road close to completion", "date": "2024-08-01 02:15", "url": "https://www.wjhg.com/2024/07/31/alf-coleman-road-close-completion/", "domain": "wjhg.com", "domain_classification": "Unknown", "message": "PANAMA CITY BEACH, Fla. (WJHG/WECP) - Alf Coleman Road is nearing completion and it has been two hundred days in the making.\n“When rains come, that area does tend to flood, the road was a low point, so the water tended to collect on the road.\nBy raising the road, we now make sure that is passable during storm events, that important for emergency evacuation.\nWhile Panama City Officials said that the road should be fully complete in 30 to 60 days, there should be some road closures in the meantime.\nThe city also has plans to make the road four lanes in the early 2030s."}, {"id": "a9e2ec97-dc61-4f5a-b37f-aab554947ab3", "title": "Corporate Hands | JN Money provides hurricane relief efforts to New Forest Primary", "date": "2024-08-01 07:30", "url": "https://jamaica-gleaner.com/article/news/20240801/corporate-hands-jn-money-provides-hurricane-relief-efforts-new-forest-primary", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Employees of JN Money Services Limited, the only Jamaican-owned remittance company, has recently pooled funds together to provide care packages for members of the New Forest Primary & Infant School community who were affected by Hurricane Beryl.\nThe company has also committed to assisting with the repairs to the infant division of the school, which was destroyed by the hurricane.\nHere, Martin Gooden (centre), consultant at JN Money Services Limited, takes time for a photo op after the care package handover with Sharon Anderson (right), principal of the New Forest Primary & Infant School, and Reuben Warren, vice-chair of the institution."}, {"id": "5d795d71-1f76-4e33-aa5d-4109a9999f14", "title": "Strong Winds and Heavy Rain Last Night - Brookings Radio", "date": "2024-08-01 18:00", "url": "https://www.brookingsradio.com/strong-winds-and-heavy-rain-last-night/", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "Volga was the first to report a 58 mph non-thunderstorm wind gust at 7:55 pm.\nA 60 mph thunderstorm wind gust was reported 7 miles SSW of Brookings from a personal weather gauge at 8:04 pm.\nA 53 mph thunderstorm wind gust was reported at the airport in Brookings at 8:17 pm.\nA Flash Flood warning was posted for Brookings County including Brookings, Volga, Sinai, Nunda, Bruce, Toronto and Elkton.\nBrookings saw 2.91 inches of rain in one hour with a storm total of 4.13 inches."}, {"id": "883a008c-e2cc-43f1-be1c-2b4c6fc6d34b", "title": "National Hurricane Center tracking possible tropical storm formation near Bahamas , Florida – ICSF", "date": "2024-08-01 08:30", "url": "https://www.icsf.net/newss/national-hurricane-center-tracking-possible-tropical-storm-formation-near-bahamas-florida/", "domain": "icsf.net", "domain_classification": "Unknown", "message": "A​ disturbance in the Atlantic continues to be watched for possible formation into a tropical storm, but there are multiple scenarios in play when it comes to the track of this system as it nears the Bahamas and the southeastern United States by this weekend.\nThe tropical wave that might eventually grow into a tropical depression or storm is located over the Leeward Islands, or near the “X” in the graphic below, according to the National Hurricane Center.\nC​omputer models suggest wind shear may be relatively light, and there’s plenty of warm ocean water ahead of this system to fuel its development near the Bahamas or the Gulf of Mexico.\nHowever, this rather large tropical disturbance will likely have to interact with land along the way, particularly Hispaniola and Cuba, but also possibly Florida.\nSo, it may take some time for one area of thunderstorms to persist over water, lower surface pressure and begin the process of developing a tropical depression, if that happens at all."}, {"id": "a0336538-d8e0-4965-8b66-7a3b8d586bfd", "title": "Visitors to Rio Hondo were amazed , but these goats merely grazed", "date": "2024-08-01 07:00", "url": "https://www.dailynews.com/2024/07/31/visitors-to-rio-hondo-were-amazed-but-these-goats-merely-grazed/", "domain": "dailynews.com", "domain_classification": "Unknown", "message": "A girl feeds a goat a piece of cabbage during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)College officials pet a baby goat during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)A college official cradles a baby goat during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)A goat is fed a carrot during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer) ExpandWild goats roamed the campus at Río Hondo College on Wednesday, July 31."}, {"id": "7ff272bf-8723-43a3-afca-90c5f7c7e9a7", "title": "Report : CenterPoint Plans To Pass Beryl - Related Expenses Onto Customers", "date": "2024-08-01 17:15", "url": "https://houstonseagle.com/1375398/report-centerpoint-plans-to-pass-beryl-related-expenses-onto-customers/", "domain": "houstonseagle.com", "domain_classification": "Unknown", "message": "CenterPoint Energy Inc. plans to pass on to their customers an estimated $2 billion in costs related to the powerful storm that ravaged Houston and the surrounding area.\nDuring an earnings call Tuesday (July 30), Chief Financial Officer Christopher Foster told investors and analysts the company will issue bonds to recover expenses related to the storm.\nBeryl drenched Houston with a summer’s worth of rain and brought 75 mph winds with gusts even higher.\nThe Beryl-related death toll climbed to more than 20 people in Texas, many of which are due to heat-related illnesses.\nNearly half of the deaths in Harris County have been attributed to heat exposure, according to the Harris County Institute of Forensic Sciences."}, {"id": "0bfaa55c-991e-46e0-aa8b-801d69d7daa1", "title": "CenterPoint CEO Jason Wells repeats need for rate hike", "date": "2024-08-01 16:30", "url": "http://www.lmtonline.com/news/houston-texas/article/centerpoint-energy-rate-hike-19612892.php", "domain": "lmtonline.com", "domain_classification": "Unknown", "message": "(Photo by Danielle Villasana/Getty Images) Danielle Villasana/Getty ImagesEmbattled CenterPoint Energy CEO Jason Wells reiterated his company's plan to raise rates for Houston customers, insisting the money is needed to \"make significant investments in our infrastructure.\"\n\"The company is on negative outlook with the credit rating agencies,\" Wells said, according to Houston Public Media.\nCenterPoint reported income of $228 million for the quarter ending June 30, up from $118 million the previous year.\nAdvertisement Article continues below this adWells also discussed the company's plans to replace the wooden poles that failed during Beryl, noting that less than half a percent of the wooden poles failed.\nWells said the utility plans to replace just 1,000 wooden poles with newer, composite ones by the end of the year."}, {"id": "c0810335-3af5-43ea-985f-b4e6ddc6ddae", "title": "I Saw Twisters And Loved It But This One Aspect Really Impacted Me", "date": "2024-08-01 04:30", "url": "https://www.cinemablend.com/movies/loved-twisters-but-one-aspect-really-impacted-me", "domain": "cinemablend.com", "domain_classification": "Unknown", "message": "Twisters is a movie I never planned to watch, at least in the theater.\nTwisters could have simply been a fun movie about chasing tornadoes and tornado wrangling.\nThe film doesn’t really take a stand and go \"maybe if people stopped doing this, then maybe there would be fewer tornadoes.\"\nTwisters potential impact may justify its existence and maybe create a demand for more standalone sequels to '90s movies.\nCould you hold on to bars in a pool and really protect yourself from flying away during a storm??"}, {"id": "5e52abad-4b62-4502-926f-a30852974231", "title": "Arson Suspect Arrested In Forest", "date": "2024-08-01 03:00", "url": "https://jamn1075.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "jamn1075.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "7eea822b-7f25-4889-8387-94cb903df182", "title": "Arson Suspect Arrested In Forest | 105 . 9 The Brew", "date": "2024-08-01 03:15", "url": "https://1059thebrew.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1059thebrew.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "fcef020f-ec82-44ac-b949-ec49fc6b67b8", "title": "Arson Suspect Arrested In Forest | News Radio 1190 KEX", "date": "2024-08-01 00:30", "url": "https://1190kex.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "fb9c2a0b-e4fe-4cc4-9244-8f4dd6f92b9d", "title": "Arson Suspect Arrested In Forest | 106 . 7 The Eagle", "date": "2024-08-01 00:15", "url": "https://1067theeagle.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1067theeagle.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "108abf58-18f1-4106-a63d-be38d582eb1c", "title": "Arson Suspect Arrested In Forest | Z100 Portland", "date": "2024-08-01 02:30", "url": "https://z100portland.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "z100portland.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "dd075a20-f2c8-429c-9763-dd1788a8f2d6", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:15", "url": "https://www.coastreporter.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "WILLIAMS LAKE, B.C.\n— A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours.\nWILLIAMS LAKE, B.C.\n— A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours.\nBut she says it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River."}, {"id": "c8b5a3ea-592b-4b39-8b48-370effeb83e8", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\n— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nBut she said it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River.\nThe province has warned people to stay away from the banks of the Chilcotin River below the slide all the way down to the Fraser River north of Hope, about 150 kilometres east of Vancouver.\nThe forecast centre says the eventual breach of the landslide debris could also lead to an \"outburst flood\" with a surge of water rapidly flowing downstream."}, {"id": "0416529e-f3fb-42d6-aca8-918081ec13d9", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "WILLIAMS LAKE, B.C.\n— A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours.\nWILLIAMS LAKE, B.C.\n— A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours.\nBut she says it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River."}, {"id": "ce9066f3-937d-4362-9688-13dc379f4e2a", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:00", "url": "https://www.fitzhugh.ca/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297540", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\n— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nBut she said it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River.\nThe province has warned people to stay away from the banks of the Chilcotin River below the slide all the way down to the Fraser River north of Hope, about 150 kilometres east of Vancouver.\nThe forecast centre says the eventual breach of the landslide debris could also lead to an \"outburst flood\" with a surge of water rapidly flowing downstream."}, {"id": "3b638dd7-0006-4dda-875c-86e78229c08c", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:45", "url": "https://energeticcity.ca/2024/08/01/b-c-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations/", "domain": "energeticcity.ca", "domain_classification": "Unknown", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "f4a51c79-1d5c-4f73-bfde-f51dafaebf5b", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 08:45", "url": "https://www.squamishchief.com/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\n— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nBut she said it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River.\nThe province has warned people to stay away from the banks of the Chilcotin River below the slide all the way down to the Fraser River north of Hope, about 150 kilometres east of Vancouver.\nThe forecast centre says the eventual breach of the landslide debris could also lead to an \"outburst flood\" with a surge of water rapidly flowing downstream."}, {"id": "6093c141-a225-47cd-a251-ad483d39790a", "title": "Brooklyn man traveled to Florida during hurricane to have sex with young girl", "date": "2024-08-01 15:00", "url": "https://foxillinois.com/news/nation-world/brooklyn-man-traveled-to-florida-during-hurricane-to-have-sex-with-young-girl", "domain": "foxillinois.com", "domain_classification": "Unknown", "message": "TALLAHASSEE, Fla. ( ) — A Brooklyn man was sentenced to 40 years in prison after he traveled to Florida during a hurricane to have sex with a minor.\nBergida's case was investigated by the Perry Police Department, the Florida Department of Law Enforcement and Homeland Security, the DOJ says.\nCourt documents continue, that while law enforcement was enforcing the storm-related curfew they came across a young girl and learned of Bergida's sexual exploitation.\nLaw enforcement quickly responded to a local motel where they arrested Bergida.\nAfter his prison sentence, Bergida will have to undergo a lifetime of supervised release and will have to register as a sex offender."}, {"id": "b44bc96f-6079-4b1c-862a-dc0c6d8a1640", "title": "Brooklyn man traveled to Florida during hurricane to have sex with young girl", "date": "2024-08-01 15:00", "url": "https://cbs2iowa.com/news/nation-world/brooklyn-man-traveled-to-florida-during-hurricane-to-have-sex-with-young-girl", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "TALLAHASSEE, Fla. ( ) — A Brooklyn man was sentenced to 40 years in prison after he traveled to Florida during a hurricane to have sex with a minor.\nBergida's case was investigated by the Perry Police Department, the Florida Department of Law Enforcement and Homeland Security, the DOJ says.\nCourt documents continue, that while law enforcement was enforcing the storm-related curfew they came across a young girl and learned of Bergida's sexual exploitation.\nLaw enforcement quickly responded to a local motel where they arrested Bergida.\nAfter his prison sentence, Bergida will have to undergo a lifetime of supervised release and will have to register as a sex offender."}, {"id": "e1411de0-cd2c-4532-ba65-72948939a39d", "title": "Wildfires rage in Balkans and Greece", "date": "2024-08-01 03:30", "url": "https://global.chinadaily.com.cn/a/202408/01/WS66aaebc0a3104e74fddb7f3d.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "ANTONIO BRONIC/REUTERSFierce wildfires, propelled by strong winds, ravaged areas of Greece and the Balkans on Tuesday, destroying forests and homes and forcing the evacuation of an Albanian resort town, local officials reported.\nThe area has experienced higher-than-normal temperatures and arid conditions throughout the previous month, establishing perfect circumstances for the outbreak of wildfires, according to scientists.\nIn recent years, Greece has experienced an increase in wildfire occurrences during progressively hotter and drier summers, a trend that scientists attribute to climate change.\nThe country has been grappling with hundreds of wildfires since May, coinciding with its record-breaking hottest June and longest-ever heatwave.\nEurope is experiencing the most rapid warming of any continent globally, with Greece among nations most severely impacted by the consequences of anthropogenic climate change, reported Euronews."}]