[{"id": "8a1fa9bd-10d8-4c50-b844-88456c14cb66", "title": "Ismail Haniyeh death explained by Hamas and Iranian media", "date": "2024-08-04 04:30", "url": "https://www.jpost.com/middle-east/article-813151", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Following the assassination of former Hamas political leader Ismail Haniyeh, there have been differing reports by Hamas and Iran regarding how he was killed, according to a Saturday report by the Arabic news outlet Al-Araby.\nKhaled Qaddoumi, Hamas's representative in Tehran, said that the assassination occurred through the targeting of Haniyeh's room with an \"aerial projectile,\" citing the explosion's impact on the room.\n\"The appearance of the place after the attack and the condition of the martyred leader Ismail Haniyeh's body clearly indicate that the targeting was by an aerial projectile, whether a missile or a shell.\"\nQaddoumi's remarks were consistent with what Khalil al-Hayya, senior head of Hamas in Gaza, stated in a press conference on Wednesday, hours after Haniyeh's assassination.\nThe Al-Araby report concluded that \"In the absence of a comprehensive official narrative, the execution of Ismail Haniyeh's assassination remains mysterious, despite the known identity of the perpetrators.\""}, {"id": "08a8259d-b244-41a5-9878-1c84f79ef824", "title": "Known Details about Haniyeh Assassination : A Bomb was smuggled and planted a few Months ago in the Apartment", "date": "2024-08-04 02:30", "url": "https://sarajevotimes.com/known-details-about-haniyehs-assassination-a-bomb-was-smuggled-and-planted-a-few-months-ago-in-the-apartment/", "domain": "sarajevotimes.com", "domain_classification": "Unknown", "message": "The bomb was hidden in the apartment about two months ago, some sources claimed.\nIranian officials and Hamas stated on Wednesday that Israel was responsible for the assassination, a view shared by several U.S. officials who wished to remain anonymous.\nTwo Iranian officials who described the nature of the assassination said they did not know how or when the explosive was placed in the room.\nIsrael decided to carry out the assassination outside Qatar, where Haniyeh and other senior members of Hamas’s political leadership reside.\nThe deadly explosion early Wednesday shattered windows and brought down part of the wall of the complex, according to photos and statements by Iranian officials."}, {"id": "b66726a9-cf20-468b-b468-1171a877f2d7", "title": "US President Biden appeals for Iran to stand down on Gaza conflict threat", "date": "2024-08-04 04:30", "url": "https://www.firstpost.com/world/us-president-biden-appeals-for-iran-to-stand-down-on-gaza-conflict-threat-13800617.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AdvertisementIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, ”I hope so.\nViolence in Gaza and West BankViolence continued on Saturday in the Palestinian territories.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "f33f5b33-30e8-42ce-9ebe-6a9a2b19b2fd", "title": "Hezbollah rockets pour into Israel North - The Jerusalem Post", "date": "2024-08-04 03:00", "url": "https://www.jpost.com/breaking-news/article-813144", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "One projectile landed in the area of Beit Hillel, and several fell in open areas, the IDF added.\nSome cities and towns where the sirens were heard included Kiryat Shmona, Metualla, Beit Hillel, HaGoshrim, and Kfar Yuval.\nSocial media footage showed a barrage of rockets crossing into the Upper Galilee from Lebanon in the early hours of Sunday as dozens of rockets were launched at the area.\nHowever, KAN news reported that a fire broke out in the moshav of Beit Hillel due to the launch.\nHeightened tensions in the Middle EastThe barrage comes as tension remains high between Israel and Lebanon's Hezbollah after Israel killed Hezbollah's military commander, Fuad Shukr, last week."}, {"id": "9f5569e2-be16-4ddc-91dd-04f6b4ff7646", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wbal.com/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "b0fc1fa0-a267-4ced-943e-ad2902d298d5", "title": "Israeli strike on Gaza school sheltering refugees kills 15", "date": "2024-08-04 02:00", "url": "https://www.odt.co.nz/news/world/israeli-strike-gaza-school-sheltering-refugees-kills-15", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "A Palestinian woman inspects the site of a former school, which was destroyed in an Israeli air strike.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "24027511-9784-4fdf-9eca-c3a3825f3b6b", "title": "Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced , Hamas says", "date": "2024-08-04 01:45", "url": "https://www.moneycontrol.com/news/world/israeli-strike-kills-at-least-10-palestinians-in-gaza-school-sheltering-displaced-hamas-says-12786293.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced, Hamas says"}, {"id": "a9e6c8e9-37af-4823-b513-82849ae682a3", "title": "10 Palestinians Killed In Israeli Airstrike On School In Gaza", "date": "2024-08-04 00:00", "url": "https://menafn.com/1108513929/10-Palestinians-Killed-In-Israeli-Airstrike-On-School-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Gaza, Aug 4 (IANS) At least 10 Palestinians were killed and dozens of others wounded in an Israeli on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school displaced people in Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and dozens of others, and the number of is expected to increase, Palestinian medical sources said.\nThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a \"hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,\" the statement added."}, {"id": "ed94afe6-eedd-46fe-869f-320dd6dca2a7", "title": "Middle East conflict : Iran - backed Hezbollah fires  dozen of rockets at Israel", "date": "2024-08-04 02:30", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/israel-iran-hamas-hezbollah-war-latest/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Hezbollah says it has launched “dozens” of rockets from Lebanon, as fears grow that a full-scale war with Israel could soon break out following the assassination of Hamas’s political leader in Tehran.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfar Kela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nIt comes amid reports that 50 rockets have been fired from southern Lebanon towards upper Galilee alone, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, Hamas’ top leader, a day after an Israeli strike in Beirut killed senior Hezbollah commander Fuad Shukr.\nThe escalating tensions have prompted Britain, the US and Australia to tell their citizens to evacuate Lebanon."}, {"id": "1cbc7d61-e99c-4909-b5b5-9de66e5522e2", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 02:30", "url": "https://www.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345114.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "ea67c6ee-cf3a-4209-9853-1e08da60b71d", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship", "date": "2024-08-04 04:30", "url": "https://abcnews.go.com/International/wireStory/suspected-missile-attack-yemens-houthi-rebels-hits-container-112548896", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, likely the first assault by the group since Israeli airstrikes targeted themDUBAI, United Arab Emirates -- A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nDetails reported by the two organizations suggested the vessel targeted was the Liberian-flagged container ship Groton, which had left Fujairah in the United Arab Emirates bound for Jeddah, Saudi Arabia.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "bcd80b50-d929-4682-9c2e-02817b5b9752", "title": "Suspected missile attack by Yemen Houthi strikes container ship ; first assault in 2 weeks – Firstpost", "date": "2024-08-04 02:30", "url": "https://www.firstpost.com/world/suspected-missile-attack-by-yemens-houthi-strikes-container-ship-first-assault-in-two-weeks-13800620.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileA suspected missile attack by Yemen’s Houthi rebels struck a container ship travelling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometres (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nMeanwhile Saturday, the US military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "5ae957e9-7e25-4d42-ae0f-5cc4122f5971", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 04:30", "url": "https://www.moneycontrol.com/news/world/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks-12786316.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Suspected missile attack by Yemen's Houthi rebels hits container ship in first attack in 2 weeks"}, {"id": "f3415936-757f-4b0a-8910-c7d2ffb5639a", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks – Winnipeg Free Press", "date": "2024-08-04 03:00", "url": "https://www.winnipegfreepress.com/business/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.\nIn the time since, Israel has killed at least 39,550 Palestinians in the Gaza Strip and 590 in the Israeli-occupied West Bank, Palestinian health officials say."}, {"id": "94c7e675-ba39-44b5-91dd-e034da8d6140", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6417", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "72b7c550-45c7-4a66-b036-19dce75ffb62", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "c3b5b030-338d-4ae0-9de9-5cc1ad350cef", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.newcastleherald.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "7312d8ce-73ca-4ba6-a7f4-f738381a0e7e", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 02:00", "url": "https://www.batemansbaypost.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "a70021f8-fea4-47cf-aec1-40565d8d334c", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 04:30", "url": "https://thesun.my/world/biden-voices-hope-iran-will-stand-down-but-is-uncertain-GK12813720", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WILMINGTON: U.S. President Joe Biden expressed hope Iran would stand down despite its threat to avenge the assassination of Hamas’ leader in Tehran, as fears mounted that Israel’s war against Palestinian militants in Gaza could escalate into a wider Middle East conflict.\nIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, “I hope so.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "dcfa53bb-ebb0-46db-a7d6-8a50d84bda36", "title": "Hezbollah Launches Barrage Of Rockets At Israel , Sparks Fears Of War In The Region", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108513957/Hezbollah-Launches-Barrage-Of-Rockets-At-Israel-Sparks-Fears-Of-War-In-The-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian group Hamas in Gaza.\nIran said on Saturday that it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "ac942174-885e-4de7-b70a-caf660175fa8", "title": "Fresh Attack Hit Merchant Vessel Off Yemen", "date": "2024-08-04 01:45", "url": "https://menafn.com/1108513950/Fresh-Attack-Hit-Merchant-Vessel-Off-Yemen", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SANAA, Aug 4 (NNN-SABA) – A merchant vessel in the Gulf of Aden, off Yemen, was struck by a second attack yesterday, just hours after an earlier attack on the same ship, according to Britain's Maritime Trade Operations (UKMTO).\nThe vessel was sailing 125 nautical miles east of Aden, when the incident occurred, the UKMTO said on social media.\nThe company's security officer reported that, the vessel was hit by a missile.\nHe stated, there was no fire, water ingress, or oil leak, adding that, the vessel is proceeding to its next of call, and authorities are investigating.\nEarlier, the UKMTO reported another attack on the same vessel, quoting the ship's master as saying, an explosion occurred in proximity, causing no damage.– NNN-SABA"}, {"id": "46ca27a4-fc6f-4787-bb0b-1fd0468de9a4", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wjol.com/syndicated-article/?id=1577376", "domain": "wjol.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "081232cf-d003-4ef0-8d03-398369b8c4b8", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.mycentraloregon.com/2024/08/03/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "mycentraloregon.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "81c9d4bd-56d1-4aa3-8004-d1fe3c115f6c", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.wlip.com/syndicated-article/?id=1577376", "domain": "wlip.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "d2e7fc5c-5339-42a1-af9a-e569443aa73f", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 00:30", "url": "https://www.gjsentinel.com/news/national/fears-of-middle-east-war-grow-after-hamas-leaders-killing/article_2f7df98d-542b-58a9-b9d6-a9f514c0bc5d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "An Israeli Navy corvette patrols along the coast of the northern port city of Haifa, as Iran said it expects Lebanon's Hezbollah movement to hit deeper inside Israel"}, {"id": "39bae176-24f7-47fd-bb94-c6099ddf8803", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 01:30", "url": "https://www.timesofearth.com/2024/08/04/israeli-strikes-kill-15-palestinians-in-gaza-school-nine-west-bank-militants/", "domain": "timesofearth.com", "domain_classification": "Unknown", "message": "GAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt’s foreign minister, Badr Abdelatty, stressed in a phone call with Iran’s acting foreign minister, Ali Bagheri Kani, that recent developments in the region were “unprecedented, very dangerous” and threatening to stability, Egypt’s government said."}, {"id": "fe20de6e-fda0-4ecf-8520-70a54f489208", "title": "This Week in Explainers : Why more and more people are ditching fast food ( It not health ) – Firstpost", "date": "2024-08-04 04:30", "url": "https://www.firstpost.com/explainers/this-week-in-explainers-why-more-and-more-people-are-ditching-fast-food-its-not-health-13800184.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Amid news of an assassination, regional tensions, and a historic prisoner swap, a story that caught the attention of readers is one on the fast food industry.\nBut the region is on edge once again after the assassination of Hamas political leader Ismail Haniyeh.\nIn the age of heightened geopolitical tensions, the Russia and West carried out a historic prisoner swap deal.\nIt’s the biggest prisoner swap between Russia and Western countries since the Cold War.\nReporter Evan Gershkovich greets his colleagues following his release as part of a 24-person prisoner swap between Russia and the United States on 1 August."}, {"id": "50af507f-a92a-4f0d-aa55-d5d99a696f8d", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks - LocalNews8 . com", "date": "2024-08-04 04:30", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, likely the first assault by the group since Israeli airstrikes targeted them.\nBut the resumption Saturday comes after the assassination of Hamas leader Ismail Haniyeh in Iran, the Houthis’ main benefactor, amid renewed concerns over the war breaking out into a regional conflict.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nPlease keep your comments respectful and relevant.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "a7cb1a06-35a4-456e-aaf2-2ff14c5c47a9", "title": "Iran says Hamas chief killed by  short - range projectile  ", "date": "2024-08-04 02:30", "url": "http://www.china.org.cn/world/2024-08/04/content_117348092.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器Iran's Islamic Revolution Guards Corps (IRGC) said on Saturday that Hamas Politburo Chief Ismail Haniyeh was assassinated by a \"short-range projectile loaded with an almost 7-kg warhead.\"\nThis photo shows Hamas Politburo Chief Ismail Haniyeh (C) in Tehran, Iran, July 30, 2024.\nThe statement added the \"terrorist\" attack had been designed and carried out by Israel with the U.S. government's support.\nThe IRGC stressed that \"the revenge for Haniyeh's blood will be definite,\" adding the \"adventurist and terrorist\" Israel would receive a \"decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality.\"\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit."}, {"id": "1af88daa-0732-46bb-985a-6fcfa16b0634", "title": "Israelis fear for hostages as Netanyahu celebrates  crushing blow against enemies", "date": "2024-08-04 00:00", "url": "https://edition.cnn.com/2024/08/03/middleeast/israel-awaits-iran-attack-gaza-war-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Tel Aviv, Israel CNN —As Prime Minister Benjamin Netanyahu celebrates what he sees as major victories against Hamas and Hezbollah this week, the mood in Tel Aviv is far from celebratory.\nOn Wednesday, Netanyahu said that his country “struck crushing blows” to the “the three H’s” – Hamas, the Houthis and Hezbollah, all Iranian-backed, all fierce Israeli foes.\nHamas also blamed Israel for the assassination of their political leader, Ismail Haniyeh, who was killed on Wednesday in Tehran.\nNetanyahu’s tone stands at odds with the mood on the ground in Tel Aviv, including among families of the hostages still in Gaza.\nPolls have repeatedly shown that most Israelis prioritize the release of hostages over continued war."}, {"id": "0e2d0579-f43b-4d6c-8152-2ace12af0fad", "title": "Israel - Gaza live updates : US to direct  multiple  posture changes in Middle East", "date": "2024-08-04 01:45", "url": "https://www.wjol.com/syndicated-article/?id=1577385", "domain": "wjol.com", "domain_classification": "Unknown", "message": "US to direct ‘multiple’ force posture changes in Middle EastU.S. Defense Secretary Lloyd Austin will direct “multiple” force posture changes in the Middle East to protect U.S. troops and help defend Israel, Pentagon deputy press secretary Sabrina Singh said during a briefing Friday.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\n-ABC News’ Fritz FarrowJuly 28, 2024, 12:35 PM EDTMiddle East Airlines delays flights following Israeli strike on LebanonLebanon’s flagship air carrier, Middle East Airlines, delayed departures of several inbound flights to Beirut on Sunday, the airline announced.\nThe IDF attack in Lebanon unfolded a day after a rocket strike killed 12 people in Majdal Shams, a town in Golan Heights."}, {"id": "a8ce00ff-ed2d-4255-8c8b-312531fcc2e8", "title": "Israel - Gaza live updates : US to direct  multiple  posture changes in Middle East - WEIS | Local & Area News , Sports , & Weather", "date": "2024-08-04 01:30", "url": "https://weisradio.com/2024/08/03/israel-gaza-live-updates-us-to-direct-multiple-posture-changes-in-middle-east/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "US to direct ‘multiple’ force posture changes in Middle EastU.S. Defense Secretary Lloyd Austin will direct “multiple” force posture changes in the Middle East to protect U.S. troops and help defend Israel, Pentagon deputy press secretary Sabrina Singh said during a briefing Friday.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\n-ABC News’ Fritz FarrowJuly 28, 2024, 12:35 PM EDTMiddle East Airlines delays flights following Israeli strike on LebanonLebanon’s flagship air carrier, Middle East Airlines, delayed departures of several inbound flights to Beirut on Sunday, the airline announced.\nThe IDF attack in Lebanon unfolded a day after a rocket strike killed 12 people in Majdal Shams, a town in Golan Heights."}, {"id": "d92d6e3d-be2b-48eb-af44-c8126cd06db8", "title": "Israel - Gaza live updates : US to direct  multiple  posture changes in Middle East", "date": "2024-08-04 03:00", "url": "https://www.wjnt.com/syndicated-article/?id=1577385", "domain": "wjnt.com", "domain_classification": "Unknown", "message": "US to direct ‘multiple’ force posture changes in Middle EastU.S. Defense Secretary Lloyd Austin will direct “multiple” force posture changes in the Middle East to protect U.S. troops and help defend Israel, Pentagon deputy press secretary Sabrina Singh said during a briefing Friday.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\nThe United States was given advanced notice ahead of Israel’s strike, according to a U.S. official familiar with matter.\n-ABC News’ Fritz FarrowJuly 28, 2024, 12:35 PM EDTMiddle East Airlines delays flights following Israeli strike on LebanonLebanon’s flagship air carrier, Middle East Airlines, delayed departures of several inbound flights to Beirut on Sunday, the airline announced.\nThe IDF attack in Lebanon unfolded a day after a rocket strike killed 12 people in Majdal Shams, a town in Golan Heights."}, {"id": "90529ef8-31d4-4180-b3fb-f5de57592e9c", "title": "Event honoring men killed in Somalia held in Westmoreland County", "date": "2024-08-04 02:30", "url": "https://www.wpxi.com/news/local/event-honoring-men-killed-somalia-held-westmoreland-county/3KD2VQVHLJAITBCJ5UXRPOP4ZY/", "domain": "wpxi.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "f2dfb425-d53a-4fb8-a38a-0340a4fee8ac", "title": "Indian Navy Eyes Boeing Multi - Mission Pod for P - 8I Fleet – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-navy-eyes-boeings-multi-mission-pod-for-p-8i-fleet/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Navy Eyes Boeing’s Multi-Mission Pod for P-8I Fleet| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Navy is keenly interested in Boeing’s newly developed Multi-Mission Pod (MMP) for its P-8 Poseidon anti-submarine aircraft.\nAs per information provided to idrw.org, Boeing and the Indian Navy are working now to identify sensors that they would like to include in the Multi-Mission Pod (MMP) for India’s P-8 fleet that might consist of Indian-made sensors.\nCurrently operating 12 P-8I variants of the Poseidon, the Indian Navy is constantly seeking to enhance the capabilities of its maritime patrol aircraft.\nBy integrating potential in-country developed sensors into the MMP, the Indian Navy could tailor the P-8I to specific operational requirements.\nIf the Indian Navy decides to adopt this system, it would not only bolster its anti-submarine warfare capabilities but also position itself at the forefront of maritime surveillance and reconnaissance."}, {"id": "c69cabbb-e635-4d20-ab0e-1b361c84c3d9", "title": "Njord : The Tumultuous Marriage of a Norse God of the Sea and a Goddess Giantess", "date": "2024-08-04 00:30", "url": "https://www.ancient-origins.net/myths-legends-europe/njord-tumultuous-marriage-norse-god-sea-and-goddess-giantess-009620", "domain": "ancient-origins.net", "domain_classification": "Unknown", "message": "Njord was the god Norse sailors and fisherman turned to in times of need.\nHe was a sea god with powers over the wind and the fertility of land along the coast.\nNjord – Norse god of the seas.\nAs Njord is a god of the sea, his abode was the sea, or more specifically, Nóatún (which means ‘Ship Enclosure’).\nAn illustration of the Norse god Njörðr, from an Icelandic 17th century manuscript."}, {"id": "9b7cbaac-3f5b-403e-a137-e5f66ec5fe99", "title": "Redon Systems Partners with Munitions India Limited for Advanced Munitions – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/redon-systems-partners-with-munitions-india-limited-for-advanced-munitions/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Redon Systems Partners with Munitions India Limited for Advanced Munitions| BySOURCE: AFIRedon Systems, a leading player in the Indian drone technology sector, has announced a strategic partnership with Munitions India Limited (MIL) to develop advanced munitions for its barrel-launched loitering munition, “Achuk”.\nThis collaboration marks a significant step towards enhancing the capabilities of the Indian Armed Forces.\nBy joining forces with MIL, Redon Systems reaffirms its commitment to making India self-reliant in military drone technology.\nThis partnership is expected to boost the operational efficiency and effectiveness of the Indian defense forces.\nBoth companies are optimistic about the potential of this collaboration and are committed to delivering cutting-edge solutions to meet the evolving challenges of modern warfare."}, {"id": "226575cd-8752-4b17-af88-e8016b111251", "title": "Zimbabwean Man Caught With USD 828 Million Worth of  Mutoriro  Meth in Australia – ZimEye", "date": "2024-08-04 02:30", "url": "https://www.zimeye.net/2024/08/04/zimbabwean-man-caught-with-usd-828-million-worth-of-mutoriro-meth-in-australia/", "domain": "zimeye.net", "domain_classification": "Unknown", "message": "Zimbabwean Man Caught With USD 828 Million Worth of ‘Mutoriro’ Meth in AustraliaSpread the loveSydney, Australia – In a significant drug bust, a Zimbabwean man has been apprehended in Sydney for allegedly smuggling 900 kilograms of methamphetamine, commonly known as “Mutoriro” in Zimbabwe, into Australia.\nThe illicit haul, valued at an astonishing USD 828 million, marks a dramatic escalation in the international narcotics trade involving the drug that has wreaked havoc in Zimbabwe.\nThis seizure will have a significant impact on the drug trade in New South Wales.”The Zimbabwean origin of the methamphetamine highlights a worrying trend.\nThe Australian Federal Police allege that the drugs were intended for distribution across the eastern seaboard, indicating a well-organized international drug syndicate.\n“This case underscores the global nature of the drug trade and the ongoing battle against narcotics that continue to devastate communities worldwide."}, {"id": "fc60ae93-5d26-451f-ba1e-b83a5a2b3ccb", "title": "Chinese warships off Alaska and Cambodia highlight role of near and far waters in sea power dominance", "date": "2024-08-04 02:00", "url": "https://japantoday.com/category/features/opinions/chinese-warships-off-alaska-and-cambodia-highlight-the-role-of-near-and-far-waters-in-sea-power-dominance", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "To understand the geopolitics of sea power, you need to understand two terms: “near waters” and “far waters.” Near waters are areas close to a country’s shoreline that are seen as important for its defense.\nFar waters are areas across the ocean that a country wants to be present in for economic and strategic interests.\nBut here’s the thing: The far waters of one country are the near waters of another, and that leads to tension.\nMore than shipbuildingChina is a global economic power, and that requires controlling its near waters and building a presence in far waters.\nIt raises the prospect of China’s ability to project power into its far waters – and near waters of the U.S.Albatrosses or hawks?"}, {"id": "13f16a03-dff6-42ab-a43b-17d9f44fee64", "title": "Prince George could make big change to his name - but it wont happen quite yet", "date": "2024-08-04 01:30", "url": "https://www.ok.co.uk/royal/prince-george-could-make-big-33339865", "domain": "ok.co.uk", "domain_classification": "Unknown", "message": "Whether it's William, George, Charles or Elizabeth, it's crucial that there are no overriding historical associations that could impact their future or draw negative comparisons.\nAnd while it may seem unlikely, this is an option that would be available to Prince George when his time as King arrives.\nFor such a common name, it's surprising that there had only been two kings named Charles before King Charles - but to say both had eventful reigns would be putting it mildly.\nPrince Albert, after his elder brother King Edward VIII abdicated, took on the name George and ascended to the throne as King George VI.\nThis was perceived as a symbol of stability and continuity from his father, King George V.While the concept of changing their names might seem perplexing in this digital era, it's highly probable that Prince William will adopt the title King William V upon succeeding his father, and Prince George is expected to eventually become King George VII."}, {"id": "8bf62b5c-df82-4c71-a784-a4d2a5e595e4", "title": "Daggerheart Testing Big Change in Post - Beta Development", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/daggerheart-testing-action-tracker-removal-in-post-beta-development/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "Daggerheart is considering the removal one of one of its combat mechanics – the Action Tracker subsystem.\nComicBook had the opportunity to play through a session of Daggerheart hosted by Darrington Press, Critical Role's game publishing arm.\nThe session, run by lead designer Spenser Starke, featured both character creation and a brief combat session with a notable exclusion – there was no Action Tracker.\nIn versions of Daggerheart made available to players, players placed tokens into the Action Tracker, and the GM used those tokens to activate various enemies on their turn.\nPlease note that this was a playtest session and there's no guarantee that the Action tracker subsystem will be removed from the final version of Daggerheart."}, {"id": "bd0fc24a-ce2a-4406-bbe1-4694484f9b7e", "title": "German engineering helps Ukrainian amputees walk again", "date": "2024-08-04 01:45", "url": "https://www.yahoo.com/news/german-engineering-helps-ukrainian-amputees-012137307.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The 42-year-old is among the first patients to be fitted for new prostheses in Germany with the help of an initiative to bring better care to Ukrainian amputees.\nHowever, the plan is to slowly hand over to the new prosthetics centre which the programme is helping to establish in Kyiv.\n\"We are looking to see what still needs to be ordered so that the prosthetics centre is fully equipped,\" said von Wolfersdorff.\nCurrently, the supply of prosthetics in Ukraine is \"catastrophic\", said Saiko, who spent nine months of his rehabilitation in Ukraine.\nWith his German prostheses, Saiko is managing to climb a staircase with ease, balance on a board or ride a bike -- even if the effort brings him out in a sweat."}, {"id": "98b01685-c54c-45fb-869d-baf0d9eaa20e", "title": "Indian Army Mulls Massive Expansion of K - 9 Vajra Fleet Amidst Evolving Threat Scenario – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-army-mulls-massive-expansion-of-k-9-vajra-fleet-amidst-evolving-threat-scenario/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army Mulls Massive Expansion of K-9 Vajra Fleet Amidst Evolving Threat Scenario| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Army is on the cusp of significantly bolstering its artillery firepower with the acquisition of an additional 100 K-9 Vajra self-propelled howitzers (SPH).\nHowever, the evolving geopolitical landscape, particularly the ongoing conflict in Ukraine, has prompted the Army to reassess its artillery requirements.\nThe increasing emphasis on mobility and survivability on the modern battlefield has led to a potential surge in demand for self-propelled artillery systems.\nConsequently, the Army is now contemplating an even more ambitious target of procuring up to 400 K-9 Vajra SPHs, necessitating an additional order of 200 units.\nThe initial batch of K-9 Vajra SPHs was optimized for desert warfare, primarily targeting the western border with Pakistan."}, {"id": "5f55111f-f78f-4a49-96ca-d54b15d158ec", "title": "  Big nerd culture : Hundreds of Utah wargamers gather to battle with dice , figurines", "date": "2024-08-04 01:45", "url": "https://www.ksl.com:443/article/51089259/big-nerd-culture-hundreds-of-utah-wargamers-gather-to-battle-with-dice-figurines", "domain": "ksl.com", "domain_classification": "Unknown", "message": "That's according to Shawn Bagley, an organizer for the Salt Lake Open, a series of gaming tournaments happening this weekend at the Utah State Fairpark.\nMarcus Kubryn, Calgary, plays Star Wars Armada during the Sci-Fi, Fantasy and Historical Tabletop Gaming Convention at the Utah State Fairpark in Salt Lake City on Saturday.\n\"Utah just has a big nerd culture in general,\" said tournament organizer Abigail Hansen.\nThe game system Hansen is overseeing at the Salt Lake Open has the same amount of participants.\nPlayers compete during the 2024 Salt Lake Open tabletop gaming convention Saturday at the Utah State Fairpark."}, {"id": "55f8416c-ae6b-4e08-8e78-969511839894", "title": "Former Catholic Memorial star Ryan Higgins repeats as A Shot For Life champion", "date": "2024-08-04 02:30", "url": "https://www.bostonherald.com/2024/08/03/former-catholic-memorial-star-ryan-higgins-repeats-as-a-shot-for-life-champion/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Many of the participants had their own family cancer stories, including recent Catholic Memorial grad Ryan Higgins.\nThe Catholic Memorial assistant coach and college-bound athlete took the court together, with Bruce rebounding for Ryan.\nMacDonough was put in touch with ‘A Shot For Life’ after moving to the Commonwealth from Vermont, following a stint with the Lone Wolf Athletics AAU squad.\nNow, ‘A Shot For Life’ encompasses seven sports, hosting tournaments to fundraise across New England.\nNo matter how big we get, the Massachusetts ‘A Shot For Life’ Challenge will always be really special, because I did it as a kid."}, {"id": "99151cb0-731c-4ab4-8936-5df74aeffac6", "title": "BAE Systems Receives $493 Million U . S . Army Contract To Produce Additional M109A7 Self - Propelled Howitzers And M992A3 Ammunition Carriers", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108510668/BAE-Systems-Receives-493-Million-US-Army-Contract-To-Produce-Additional-M109A7-Self-Propelled-Howitzers-And-M992A3-Ammunition-Carriers", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- PR Newswire) STERLING HEIGHTS,Mich., Aug. 2, 2024 /PRNewswire/ -- BAE Systems (LON: BA) received a $493 million contract to continue producing M109A7 Self-Propelled Howitzers (SPH) and M992A3 Ammunition Carriers for the U.S. Army.\nThe M109A7 ensures have the most modern artillery capabilities that are highly survivable, maintainable, proven, and responsive on the battlefield.\n(Credit: BAE Systems)Post this\"We are focused on producing and fielding modern artillery capabilities that provide the Army with overmatch in range, accuracy, and lethality,\" said Dan Furber, director of ground vehicle production for BAE Systems' Combat Mission Systems business.\n\"This contract ensures the ABCT will sustain operations of one of the most survivable indirect fire support systems for years to come.\"\nFor more information, please contact:Darby Dame, BAE SystemsMobile: +1 269 675 0273[email protected]@BAESystemsIncSOURCE BAE Systems, Inc."}, {"id": "9af18423-9dff-4454-a29e-139327db5af1", "title": "Hamas to shoulder blame for no progress on Gaza deal Netanyahu office adviser - World", "date": "2024-08-04 02:30", "url": "https://tass.com/world/1824993", "domain": "tass.com", "domain_classification": "Unknown", "message": "The radical movement Hamas should be blamed that the Cairo talks on a Gaza deal are not making progress, as Israel has not put forward any new demands, Dmitry Gendelman, an adviser to Israeli Prime Minister Benjamin Netanyahu’s office, told TASS.\nThe lack of progress is solely because of Hamas,\" he said.\n\"Those who suggest giving in to Hamas’ demands in order to get applause in the studios are reducing the chances of the hostages’ release,\" the office said.\nThe plan envisages a complete ceasefire and the release of Israeli hostages held by Hamas in exchange for the release of hundreds of Palestinian inmates from Israeli prisons.\nIn response, Israel launched a military operation in Gaza to eradicate Hamas’ military and political structure and to release all the hostages."}, {"id": "6baa0a5a-e18a-4da3-9c69-d262580e292c", "title": "Horror at deaths of 12 children unites Druze across borders . But Mideast wars tear at their bonds", "date": "2024-08-04 02:30", "url": "https://www.dailyexcelsior.com/horror-at-deaths-of-12-children-unites-druze-across-borders-but-mideasts-wars-tear-at-their-bonds/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The Druze religious sect began as a 10th-century offshoot of Ismailism, a branch of Shiite Islam.\nIn Israel, Druze are highly regarded for their loyalty to the state and their military service, with many entering elite combat units, including fighting in Gaza.\nHe urged Israeli Druze not to join the war in Gaza or the increasingly volatile confrontation across the Lebanese-Israeli border.\nBut rather than criticizing Druze in the Israeli army, Khair said he would rather speak positively of voices among Israeli Druze that have backed the Palestinian cause.\nAcross Majdal Shams, there was raw pain as the community buried 12 small white coffins in the span of 24 hours."}, {"id": "8d1e3c88-ac9b-4944-9aa8-9f35f9b41ec2", "title": "Economic aftershocks of war on Gaza felt across region experts", "date": "2024-08-04 02:30", "url": "http://jordantimes.com/news/local/economic-aftershocks-war-gaza-felt-across-region-%E2%80%94-experts", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "“Though not over, the war on Gaza has, to differing degrees, impacted several economies in the Arab region.\n“The postwar needs of the Gaza Strip will be enormous: All universities are destroyed, most hospitals are severely damaged, etc.\nAlso, the war on Gaza necessitates extraordinary efforts at rebuilding and the reconstruction would be much larger than for most other recent disasters,” Khouri added.\nKhouri also said that countries mostly affected by the war are Jordan, Egypt, Lebanon and the West Bank.\nKhoury also that the war on Gaza has had significant impacts on Jordan and the broader regional economy, affecting multiple sectors and exacerbating existing economic challenges."}, {"id": "359080f9-ba39-4a14-9017-b764e3ca51b8", "title": "Agent Zo : The woman who parachuted into Nazi - occupied Poland", "date": "2024-08-04 00:00", "url": "https://www.bbc.com/news/articles/cneej0r2n7go", "domain": "bbc.com", "domain_classification": "International", "message": "So who was the woman who went by the name of Zo, and what inspired her to acts of such defiance and bravery?\n\"It's really ironic,\" says Clare Mulley, historian and author of a new book, Agent Zo.\nAt one point, Mulley says, Zo leapt from the door of a moving train to evade an officer who had joined her in the carriage.\nFor Polish war hero Kazimierz Bilski, there was one thing for it.\nThe government-in-exile \"just can't believe that women should be given military legal status\", Mulley explains, and Zo was branded \"an insane feminist\"."}, {"id": "54485a10-7faa-467f-b8ce-bb292e5081a8", "title": "An Upcoming Magic : The Gathering Release Features Two Baldur Gate 3 Favorites", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/magic-the-gathering-bg3-astarion-karlach/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "• Friends – You gain life equal to the amount of life you gained this turn.\n• Feed – Target opponent loses life equal to the amount of life they lost this turn.\n• Friends – You gain life equal to the amount of life you gained this turn.\nKarlach, Fury of AvernusWhenever you attack, if it's the first combat phase of the turn, untap all attacking creatures.\nJust as the Magic: The Gathering Monty Python Secret Lair sets sold out completely within an hour of their timed release, the Baldur's Gate 3 items will likely sell out incredibly fast – especially since this won't be a print-on-demand release as many fans would like for it to be."}, {"id": "3d415065-b8cc-48c4-aac5-6205cbf29bbc", "title": "The Civil War Didnt  Settle  The Question Of State Secession", "date": "2024-08-04 03:00", "url": "https://www.zerohedge.com/political/civil-war-didnt-settle-question-state-secession", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "By Brian McGlinchey at Stark RealitiesSecessionist inclinations are on the rise in the United States, and are sure to intensify after Nov. 5 regardless of which party prevails.\nWhen that happens, you can expect the accompanying discourse will be peppered with assertions that states have no right to secede, with many declaring the question was “settled” by the Civil War.\nThough the Civil War has conditioned many Americans to associate secession with war — and to reflexively recoil from it on that basis — secession is not an inherently violent proposition.\nLooking back to the run-up to the Civil War, slavery-abolitionists themselves championed secession, pushing for northern states to abandon the union.\nOthers who attempt to deny states’ right of secession point to the Constitution’s lack of a provision for a parting of ways."}, {"id": "3dd070bf-d84d-40c7-9edb-d3b107d352c0", "title": "Bangladesh Students Step up Protests to Press PM Sheikh Hasina Resignation", "date": "2024-08-04 01:45", "url": "https://www.deccanchronicle.com/world/bangladesh-students-step-up-protests-to-press-pm-sheikh-hasinas-resignation-1814232", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Students Against Discrimination have asked their compatriots to cease paying taxes and utility bills from Sunday to pile pressure on the government.\n\"She must go because we don't need this authoritarian government,\" Nijhum Yasmin, 20, told AFP from one of many protests staged around Dhaka on Saturday.\nThe looming non-cooperation campaign deliberately evokes a historical civil disobedience campaign during Bangladesh's 1971 liberation war against Pakistan.\n- 32 children killed -Hasina, 76, has ruled Bangladesh since 2009 and won her fourth consecutive election in January after a vote without genuine opposition.\nThe protests had remained largely peaceful until attacks on demonstrators by police and pro-government student groups."}, {"id": "59bbca1e-3f6a-4960-a44c-539a7c5d483e", "title": "Bangladesh students call for nationwide civil disobedience", "date": "2024-08-04 03:00", "url": "https://www.thenews.com.pk/print/1216488-bangladesh-students-call-for-nationwide-civil-disobedience", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "— AFPDhaka: Student leaders rallied Bangladeshis on Saturday for a nationwide civil disobedience campaign as Prime Minister Sheikh Hasina´s government weathered a worsening backlash over a deadly police crackdown on protesters.\nStudents Against Discrimination, the group responsible for organising the initial protests, urged their compatriots to launch an all-out non-cooperation movement from Sunday.\nStudents are demanding a public apology from Hasina for last month´s violence and the dismissal of several of her ministers.\nHasina, 76, has ruled Bangladesh since 2009 and won her fourth consecutive election in January after a vote without genuine opposition.\nHasina´s government eventually imposed a nationwide curfew, deployed troops and shut down the nation´s mobile internet network for 11 days to restore order."}, {"id": "a70618f5-5dc0-457f-861f-be4a44fcdbdf", "title": "Renovated 2 BR / 1 BA Apartment Ktown w / 1 Parking", "date": "2024-08-04 00:45", "url": "https://www.radiokorea.com:443/bulletin/bbs/board.php?bo_table=c_realestate&wr_id=2289368", "domain": "radiokorea.com", "domain_classification": "Unknown", "message": "Renovated 2 BR/ 1 BA Apartment Ktown w/1 Parking지역 Los Angeles 종류 아파트 가격 $1,850 연락처 213-700-8753 문의(ASK) JanetNewly renovated 2 bed/ 1 bath unit in a private apartment complex on 2nd floor.\nThe dual pane windows are perfect to combat the heat and give you the peace and quiet from the city.\n라디오코리아는 이 글에 대한 내용을 보증하지 않으며, 이 정보를 사용하여 발생하는 결과에 대하여 어떠한 책임도 지지 않습니다.\n라디오코리아의 모든 게시물에 대해 게시자 동의없이 게시물의 전부 또는 일부를 수정 · 복제 · 배포 · 전송 등의 행위는 게시자의 권리를 침해하는 것으로 원칙적으로 금합니다.\n이를 무시하고 무단으로 수정 · 복제 · 배포 · 전송하는 경우 저작재산권 침해의 이유로 법적조치를 통해 민, 형사상의 책임을 물을 수 있습니다."}, {"id": "89309460-8f0e-4332-a1b9-1edff90eaf96", "title": "Why The New F / A - 18 Block III Super Hornet Is The Navy Next - Level Fighter", "date": "2024-08-04 03:00", "url": "https://www.slashgear.com/1632211/new-fa-18-block-iii-super-hornet-navy-fighter-jet/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The F/A-18 Hornet has long been one of the U.S. Navy's most powerful all-weather, carrier-capable, multirole combat aircraft.\nThe F/A-18 entered active service in 1983 for the U.S. Marine Corps, and made its Navy debut the following year.\nIt's decades older than fifth-generation aircraft like the F-22 and F-35, so one might wonder why it's still in operation.\nThe current F/A-18 is built by Boeing, and it's a far cry from the original aircraft.\nRecently, the U.S. Navy and Boeing introduced the F/A-18 Block III Super Hornet, which National Interest called the \"unstoppable Navy fighter.\""}, {"id": "9563541e-dba5-49d1-ae2c-84009045aab1", "title": "Commentary : No university classes on Wednesday afternoons ? Thanks , but no thanks", "date": "2024-08-04 00:00", "url": "https://www.channelnewsasia.com/commentary/singapore-university-undergraduate-student-mental-health-wellbeing-academic-stress-gap-day-four-day-week-4522131", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SINGAPORE: As a new academic year begins for Singapore undergraduates, more attention is being given to issues of student well-being.\nUniversity students face a wide range of pressures, especially academic stress.\nSeveral steps have been taken to combat the stress undergraduates face.\nThe National University of Singapore (NUS) recently announced its students will be able to take time off from 3pm to 6pm on Wednesdays.\nThis is to encourage “greater participation in out-of-classroom and student life activities” for a more holistic university experience."}]