[{"id": "16958586-ff8e-46c0-8ea7-11d10c1895cc", "title": "Houthis Report 16 Dead In Biggest Joint US - UK Airstrikes Since Gaza War Began", "date": "2024-06-01 00:15", "url": "https://www.zerohedge.com/geopolitical/houthis-report-16-dead-biggest-joint-us-british-airstrikes-gaza-war-started", "message": "Early on Friday Yemen's Houthis announced what appears to be the biggest mass casualty attack by the Western coalition since Red Sea hostilities began in the wake of Oct.7.\nThe joint British-U.S. airstrikes happened Thursday, and killed at least 16 people and wounded 35 others, according to Houthis statement.\nIllustrative: US military file imageThe strikes primarily focused on the port city of Hodeida, and the Houthis say that all killed there were civilians.\nIt said all the dead and nearly all the wounded from the strikes came from there.\n\"The strikes were taken in self-defense in the face of an ongoing threat that the Houthis pose,\" British Prime Minister Rishi Sunak announced."}, {"id": "2f756216-e720-41e6-98ac-28146a240928", "title": "German police officer still in serious condition after knife attack", "date": "2024-06-01 06:15", "url": "https://www.yahoo.com/news/german-police-officer-still-serious-043351693.html", "message": "German police officer still in serious condition after knife attackForensics officers inspect the crime scene where a knife-wielding attacker in the German city of Mannheim on Friday targeted a gathering by the anti-Islam right-wing group Pax Europa, according to members of the group.\nUwe Anspach/dpaThe condition remains serious of a German police officer who suffered life-threatening injuries when a knife-wielding attacker targeted a gathering by the anti-Islam right-wing group Pax Europa in the city of Mannheim, police said Saturday.\nPolice shot the so far unidentified attacker after he injured six people on Friday, with security sources telling dpa he suffered life-threatening injuries.\nA video apparently of the attack in the south-western city's main market square circulated online, showing a man stabbing several people at the Pax Europa event.\nA knife-wielding attacker who injured several people on a market square in the south-western German city of Mannheim has been shot by police."}, {"id": "4ca146c5-df42-4321-9384-5daf94b00170", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:15", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "ff5dcd19-93aa-465a-8609-6e694c58d699", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:45", "url": "https://www.wjol.com/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "fca09e3a-6659-419f-8c08-ecefd724c4f6", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:45", "url": "https://www.k101fm.net/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "a943a758-64f7-4ebb-a119-b540dc220c24", "title": "Four killed in Israeli strikes on Lebanon", "date": "2024-06-01 00:15", "url": "https://www.rte.ie/news/world/2024/0531/1452499-four-killed-lebanon/", "message": "Israeli strikes on south Lebanon killed four people including a paramedic and a woman, Hezbollah and affiliated rescuers said, with the Iran-backed group adding it had fired dozens of rockets in retaliation.\nThe operations room of the Hezbollah-affiliated Islamic Health Committee told AFP that \"an Israeli drone strike targeted an ambulance... One rescuer was martyred and another wounded\" in the border town of Naqura.\nThe Israeli military said in a statement that \"fighter jets struck a military structure\" in the Naqura area \"where a terrorist cell's activity was identified\".\n\"A terrorist\" in the Yarun area, elsewhere in south Lebanon, \"was also struck\", the statement said, adding that a drone from Lebanon was intercepted.\nNearly 450 people have been killed in Lebanon in more than seven months of cross-border violence\"20 health workers killed since 8 October\", he added."}, {"id": "60c4d278-0a1a-4803-b35f-a61a6feac03a", "title": "Russia pounds Ukrainian energy facilities with missile and drone barrage", "date": "2024-06-01 07:45", "url": "https://www.aljazeera.com/news/2024/6/1/russia-pounds-ukrainian-energy-facilities-with-missile-and-drone-barrage", "message": "Ukrainian officials say the attacks damaged infrastructure in five regions across the country.\nRussian forces have launched a barrage of missiles and drones across Ukraine that damaged energy infrastructure in five regions, according to Ukrainian officials.\n“Today morning the Russians launched another strike on Ukrainian energy facilities.\nSince March it is already the sixth massive, complex, missile and drone attack against the civilian energy infrastructure,” Ukrenergo said.\nUkrainian air defence shot down 35 of 53 Russian missiles and 46 of 47 Russian drones, the air force commander said."}, {"id": "a60e9978-ff4a-47c5-b27c-2ed57aea89ef", "title": "Russia major air attack damages Ukrainian energy infrastructure in 5 regions | India News", "date": "2024-06-01 06:15", "url": "https://timesofindia.indiatimes.com/india/decofice-introduces-technology-in-architecture-and-construction-setting-new-benchmarks-as-one-of-the-first-in-the-industry/articleshow/110611098.cms", "message": "KYIV : Russia launched a barrage of missiles and drones on Saturday, damaging energy facilities in five regions across Ukraine, officials said.Ukraine's national grid operator Ukrenergo said the attack damaged energy facilities in the eastern Donetsk, southeastern Zaporizhzhia, and Dnipropetrovsk regions, central Kyrovohrad region, and Ivano-Frankivsk region in the west.\n\"This morning, the Russians launched another strike on Ukrainian energy facilities.\nSince March, it is already the sixth massive, complex, missile and drone attack against the civilian energy infrastructure,\" Ukrenergo said.Ukrainian air defence shot down 35 of 53 Russian missiles and 46 of 47 Russian drones, the air force commander said.Since March, Russia has stepped up its bombardments of the Ukrainian power infrastructure, knocking out the bulk of the thermal and hydropower generation, causing blackouts, and pushing electricity imports to record highs.DTEK, Ukraine's largest private energy-generating company, said that during the attack its two thermal power plants had been hit and equipment \"seriously damaged.\n\"Regional officials reported that firefighters were extinguishing fires on several sites following the strikes.\nThere were no immediate reports of casualties."}, {"id": "6fe1f836-d258-4114-84f2-f36a6b51a5e5", "title": "Russia major air attack damages Ukrainian energy infrastructure in 5 regions | World News", "date": "2024-06-01 07:15", "url": "https://indianexpress.com/article/world/russias-air-attack-damages-ukrainian-energy-infrastructure-regions-9365213/", "message": "Russia launched a barrage of missiles and drones on Saturday that damaged energy facilities and critical infrastructure across Ukraine, injuring at least four people, and prompting President Volodymyr Zelenskiy to issue a fresh plea for more air defence assistance.\nThe sixth major Russian air attack on the Ukrainian power sector since March damaged energy facilities in the east, centre, and west, the national grid operator Ukrenergo said.\n\"Russia's main goal is to normalize terror, to use the lack of sufficient air defence and determination of Ukraine's partners,\" Zelenskiy said on the Telegram messaging app.\nAdditional \"Patriots\" and other modern air defence systems for Ukraine.\nRussia's defence ministry has said it is striking Ukraine's military-industrial complex and energy facilities in retaliation for Kyiv's strikes on Russian energy facilities."}, {"id": "793247a0-dabb-4a15-a206-e82e0ea566f1", "title": "Russia major air attack damages Ukrainian energy infrastructure in five regions – The Irish Times", "date": "2024-06-01 09:15", "url": "https://www.irishtimes.com/world/europe/2024/06/01/russias-major-air-attack-damages-ukrainian-energy-infrastructure-in-five-regions/", "message": "Photograph: Emile Ducke/The New York TimesRussia launched a barrage of missiles and drones on Saturday, damaging energy facilities in five regions across Ukraine, officials said.\nUkraine's national grid operator Ukrenergo said the attack damaged energy facilities in the eastern Donetsk, southeastern Zaporizhzhia, and Dnipropetrovsk regions, central Kyrovohrad region, and Ivano-Frankivsk region in the west.\n“Today morning the Russians launched another strike on Ukrainian energy facilities.\nSince March it is already the sixth massive, complex, missile and drone attack against the civilian energy infrastructure,” Ukrenergo said.\nUkrainian air defence shot down 35 of 53 Russian missiles and 46 of 47 Russian drones, the air force commander said."}, {"id": "7d46cee3-2691-426a-adce-a0a729ef1c4a", "title": "Russia Missile Barrage Targets Ukrainian Energy Facilities", "date": "2024-06-01 08:15", "url": "https://www.devdiscourse.com/article/headlines/2957595-russias-missile-barrage-targets-ukrainian-energy-facilities", "message": "Russia launched a barrage of missiles and drones on Saturday, damaging energy facilities in five regions across Ukraine, officials said.\nUkraine's national grid operator Ukrenergo said the attack damaged energy facilities in the eastern Donetsk, southeastern Zaporizhzhia, and Dnipropetrovsk regions, central Kyrovohrad region, and Ivano-Frankivsk region in the west.\n\"Today morning the Russians launched another strike on Ukrainian energy facilities.\nSince March it is already the sixth massive, complex, missile and drone attack against the civilian energy infrastructure,\" Ukrenergo said.\nUkrainian air defence shot down 35 of 53 Russian missiles and 46 of 47 Russian drones, the air force commander said."}, {"id": "f82d3ae0-a443-4c9f-8ef9-fdc6a5e548be", "title": "Blinken Says Ukraine Can Address Threats on  Russian Side of the Border  With US Weapons", "date": "2024-06-01 05:00", "url": "https://www.theepochtimes.com/world/blinken-says-ukraine-can-address-threats-on-russian-side-of-border-with-us-weapons-5660749", "message": "U.S. Secretary of State announces a change in the Biden administration’s policy toward the Ukrainian use of U.S.-donated weapons.\nU.S. Secretary of State Antony Blinken signaled on Friday that President Joe Biden’s administration has ratcheted forward support for Ukrainian military activity to deal with threats inside Russia’s borders but offered few specifics about the changing rules of engagement.\nUntil recently, NATO members have maintained a relative ban on Ukrainian forces using their donated weapons to strike across their eastern border into Russia’s internationally recognized territory.\nThose views have begun to shift amid a renewed Russian offensive in the Ukrainian border region of Kharkiv.\nMr. Blinken’s comments to reporters indicate the Biden administration is also beginning to loosen its restrictions on how Ukrainian forces fight, but he kept the details sparse."}, {"id": "804f8192-0f7e-4fe3-9629-f7047d365b10", "title": "Syrian President Assad visits Iran to express condolences over Raisi death", "date": "2024-06-01 09:15", "url": "https://naharnet.com/stories/en/305598-syrian-president-assad-visits-iran-to-express-condolences-over-raisi-death", "message": "Syrian President Bashar Assad has met with Iran's supreme leader in the capital Tehran and expressed his condolences over the death of President Ebrahim Raisi in a helicopter crash, state media reported Thursday.\nAssad met on Thursday with Iranian Supreme Leader Ayatollah Ali Khamenei and also expressed condolences over the death of Foreign Minister Hossein Amirabdollahian who was also killed in the helicopter crash earlier this month.\nAssad's trip took place as Iran opened a five-day registration period Thursday for hopefuls wanting to run in the June 28 presidential election to replace the late Raisi.\nHundreds of Iranian forces have been killed in the war though Tehran has long said it has only a military advisory role in Syria.\nRaisi, the country's foreign minister and others were found dead at the site of a helicopter crash after an hourslong search through a foggy, mountainous region of the country's northwest."}, {"id": "68277af9-0ebe-4e61-81f0-8c1098f5120d", "title": "China New Ship For A Drone - Powered Taiwan Invasion", "date": "2024-06-01 08:15", "url": "https://menafn.com/1108283236/Chinas-New-Ship-For-A-Drone-Powered-Taiwan-Invasion", "message": "Amid ongoing debates about the usefulness of aircraft carriers in future conflicts given their increasing vulnerabilities to sophisticated ISR and anti-ship weapons, China may consider a drone carrier concept in its Type 076 amphibious assault ship.\nDrone carriers provide a cost-efficient and feasible solution for middle-income countries to expand their airpower capabilities across great distances without needing land bases.\nHowever, drone carriers will not be a game-changer in military affairs until unmanned aircraft can achieve air superiority.\nIn a Taiwan conflict, China likely plans to use drone swarms from land and sea to overwhelm the island's air defenses.\nIts deck may house drones or the FC-31 stealth fighter, while it can also operate rotary-wing aircraft and deploy troops ashore in an invasion of Taiwan."}, {"id": "bd1debab-155c-4f89-ad92-242fd3f0af84", "title": "Tensions Escalate as Houthis Claim Missile Strike on USS Eisenhower Amidst US - UK Yemen Strikes", "date": "2024-06-01 04:30", "url": "https://trendydigests.com/2024/06/01/tensions-escalate-as-houthis-claim-missile-strike-on-uss-eisenhower-amidst-us-uk-yemen-strikes/", "message": "The Iranian-backed Houthi rebels in Yemen have asserted that they targeted the US Navy’s nuclear-powered supercarrier, the USS Dwight D. Eisenhower (CVN-69), with a missile attack in the Red Sea.\nAccording to Yahya Saree, the military spokesperson for the Houthis, the alleged strike was a retaliatory measure for the joint US and UK military operations in Yemen, which reportedly resulted in casualties including both combatants and civilians.\nThe Houthi claim of having launched a successful missile attack raises considerable concern, given the intensifying conflict and the strategic significance of the Red Sea as a vital shipping lane.\nThe Houthis’ claims, thus far unsubstantiated, reflect an ongoing narrative battle within the broader conflict in Yemen.\nRelevant articles:– Houthis Claim to Have Attacked U.S. Navy Aircraft Carrier, National Intererst, 05/31/2024– The Houthi’s wild claim to have struck a US aircraft carrier is pure fiction, Business Insider, 05/31/2024– Houthis claim to have launched missile attack on US aircraft carrier in wake of US-UK strikes on Yemen, The Independent, 05/31/2024– Houthis Claim Missile Attack On US Aircraft Carrier: What We Know, Newsweek, 05/31/2024Glad you enjoyed above story, be sure to follow TrendyDigests on Microsoft Start."}, {"id": "e1e3e71b-320e-4a76-aa51-dbc0a424f56b", "title": "Seoul defense chief accuses Russia of using North Korean weapons in Ukraine attack", "date": "2024-06-01 08:15", "url": "https://www.koreaherald.com/view.php?ud=20240601050043", "message": "South Korean Minister of National Defense Shin Won-sik delivers his remarks at the plenary session of the International Institute for Strategic Studies Shangri-La Dialogue in Singapore on Saturday.\n(Yonhap)SINGAPORE -- South Korean Defense Minister Shin Won-sik said Saturday growing evidence pointed to Russia getting weapons from North Korea to attack Ukraine and aiding the Kim Jong-un regime’s military program.\nHe said that North Korea, in return for providing Russia with weapons, was getting money and technology to expand its military power.\n“North Korea in particular is believed to have received satellite technology, especially military reconnaissance satellite technology,” he said.\nHe was asked about the barriers in South Korea for the country to supply Ukraine with weapons and possible ways to address them."}, {"id": "538712b7-cedc-402b-8b49-8846cd221a47", "title": "Seoul defense chief accuses Russia of using North Korean weapons in Ukraine attack", "date": "2024-06-01 07:15", "url": "http://www.koreaherald.com/view.php?ud=20240601050043", "message": "South Korean Minister of National Defense Shin Won-sik delivers his remarks at the plenary session of the International Institute for Strategic Studies Shangri-La Dialogue in Singapore on Saturday.\n(Yonhap)SINGAPORE -- South Korean Defense Minister Shin Won-sik said Saturday growing evidence pointed to Russia getting weapons from North Korea to attack Ukraine and aiding the Kim Jong-un regime’s military program.\nHe said that North Korea, in return for providing Russia with weapons, was getting money and technology to expand its military power.\n“North Korea in particular is believed to have received satellite technology, especially military reconnaissance satellite technology,” he said.\nHe was asked about the barriers in South Korea for the country to supply Ukraine with weapons and possible ways to address them."}, {"id": "f8010d85-08c4-41b4-a2ec-9b97913372ca", "title": "Irish police commissioner will speak to senior officers after former IRA member said he was behind the death of Lord Mountbatten", "date": "2024-06-01 01:45", "url": "https://www.dailymail.co.uk/news/article-13482587/Irish-police-commissioner-speak-senior-officers-former-IRA-member-said-death-Lord-Mountbatten.html", "message": "Garda Commissioner Drew Harris has said he will speak to senior officers following claims by a former IRA member that he was behind the death of Lord Mountbatten.\nMr Harris said that he will now speak with colleagues at the National Bureau of Criminal Investigation (NBCI) about the next steps in the case and whether or not an official investigation should be launched.\nAsked if Hayes (pictured) can expect to be questioned by gardaí in the near future, Mr Harris added: 'As I said, we have to commence an investigation.'\nHayes told the MoS he was in Co. Sligo at the time of the Mountbatten bombing.\nHe added: 'I blew up Earl Mountbatten in Sligo, but I had a justification: he'd come to my country.'"}, {"id": "666345e0-766a-4934-a7fe-5073d6895ec7", "title": "Polish aircraft scrambled during Russian missile attack on Ukraine", "date": "2024-06-01 08:15", "url": "https://www.yahoo.com/news/polish-aircraft-scrambled-during-russian-022205344.html", "message": "Polish aircraft scrambled during Russian missile attack on UkrainePoland has scrambled its aircraft during a Russian missile attack on Ukraine on the night of 31 May-1 June.\nSource: Operational Command of the Polish Armed Forces on Twitter (X)Quote: \"Be advised that Polish and allied aircraft are flying in Polish airspace, which may lead to increased noise levels, especially in the southeastern part of the country.\"\nBackground: Poland has regularly scrambled its aircraft during a Russian missile attack on Ukraine since February.\nSupport UP or become our patron!"}, {"id": "19429764-cb1c-45c7-970a-0d8445cde874", "title": "Man charged with murder over fatal stabbing of woman on Bournemouth beach", "date": "2024-06-01 00:15", "url": "https://www.independent.co.uk/news/uk/crime/bournemouth-beach-stabbing-charge-amie-gray-b2554807.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A man has been charged with murder after a woman was knifed to death in a double stabbing on a beach in Bournemouth.\nNasen Saadi, 20, was charged with murder and attempted murder on Friday over the stabbing of Amie Gray, 34, and another woman, Dorset Police said.\nMs Gray, from nearby Poole, was killed at Durley Chine Beach at 11.42pm last Friday.\nAmie Gray, from nearby Poole, was killed at Durley Chine Beach at 11.42pm last Friday ( Facebook )Police launched a murder investigation and arrested Saadi, from Croydon, on Wednesday."}, {"id": "70618fa3-2cae-474a-a863-53cdc6d7dc00", "title": "At Least Two Injured As Russian Army Attacks Odesa With Ballistic Missile", "date": "2024-06-01 01:00", "url": "https://menafn.com/1108282728/At-Least-Two-Injured-As-Russian-Army-Attacks-Odesa-With-Ballistic-Missile", "message": "(MENAFN- UkrinForm) On Friday evening, the Russian military attacked Odesa with a ballistic missile likely equipped with a cluster munition warhead.\n\"In the evening, the enemy attacked Odesa with a ballistic missile likely equipped with a cluster munition warhead,\" Oleh Kiper, the head of the Odesa regional military administration, posted on Telegram.\nIt is noted that Russian terrorists targeted the infrastructure.\nDeath toll from overnight missile attack on Kharkiv rises to six\"Two people suffered shrapnel wounds: A 28-year-old girl and a 37-year-old man.\nThey are receiving all necessary medical care,\" wrote Kiper."}, {"id": "d351a68c-3c5b-493e-9a09-3ca0776386bb", "title": "Body of slain woman found in unusual Vallejo location", "date": "2024-06-01 03:45", "url": "http://www.sfchronicle.com/crime/article/body-slain-woman-found-unusual-vallejo-location-19489339.php", "message": "A building on Walnut Avenue on Mare Island, which was the oldest Navy base on the West Coast when it shut down in 1996.\nCHRIS STEWART/SFCThe body of a woman found on Mare Island has been ruled a homicide, Vallejo police said Friday.\nOn Monday around 11:30 p.m., Vallejo police responded to a report of an unresponsive person on the 500 block of Walnut Avenue.\nThe Solano County Coroner’s office declared the death a homicide on Friday, according to Vallejo police.\n“That is not a common location for a homicide, on the island,” said Vallejo police spokesperson Sgt."}, {"id": "470de93a-e03e-41b0-96b0-6b44712832a4", "title": "World News | Houthis Attack US Carrier in Red Sea Following Deadly Strikes on Yemen", "date": "2024-06-01 02:15", "url": "https://www.latestly.com/agency-news/world-news-houthis-attack-us-carrier-in-red-sea-following-deadly-strikes-on-yemen-6004344.html", "message": "Sana'a [Yemen], June 1 (ANI): Yemen's Houthi rebels say that they have launched a missile strike on a United States aircraft carrier in the Red Sea in retaliation for recent deadly strikes by the US and UK in Yemen, Al Jazeera reported.\nThis marks the highest publicly acknowledged death toll from multiple rounds of strikes linked to the group's alleged assaults on shipping.\nThe campaign has forced shipping firms to seek alternative routes, impacting approximately 12 per cent of global trade that traverses the Red Sea.\nDespite retaliatory strikes by the US and UK aimed at degrading Houthi capabilities, the rebels have continued their assaults.\nIn their latest actions, they targeted a Greek-owned bulk carrier and other vessels in response to Israeli strikes on Gaza, Al Jazeera reported."}, {"id": "86e0fb6f-85d6-49fa-b12a-96df5236a892", "title": "Former MMA Fighter Pleads Guilty to Fatally Stabbing Man in Atlantic City Hotel Room", "date": "2024-06-01 03:15", "url": "https://www.yahoo.com/news/former-mma-fighter-pleads-guilty-024721684.html", "message": "Former MMA Fighter Pleads Guilty to Fatally Stabbing Man in Atlantic City Hotel RoomAndrew Osborne is scheduled to be sentenced on Aug. 22 for the September 2022 crimeAtlantic County Prosecutor's Office Andrew Osborne's mugshotA former MMA fighter from Philadelphia has pleaded guilty to a 2022 Atlantic City stabbing death.\nAccording to the release, Osborne admitted that he stabbed Wilkinson to death inside Wilkinson’s hotel room.\nDetectives from the Atlantic County Prosecutor’s Office’s Major Crimes Unit, along with the Philadelphia Police Department, later located and arrested the assailant.\nThe Atlantic County Prosecutor’s Office adds that Osborne is scheduled to be sentenced on Aug. 22 before Judge Bernard E. DeLury.\nThe investigation was carried out by the Atlantic County Prosecutor’s Office’s Major Crimes Unit and the Atlantic City Police Department."}, {"id": "4a9d05d7-2190-49c5-ae5f-9d9e2cbab5e0", "title": "Four killed in Israeli strikes on Lebanon as Nasrallah warns of Hezbollah reach", "date": "2024-06-01 09:30", "url": "https://www.thenationalnews.com/news/mena/2024/06/01/hezbollah-nasrallah-israel-naqoura/", "message": "Hezbollah, a Hamas ally, has regularly fired on Israel since the Palestinian militant group's October 7 attack on southern Israel started the war in the Gaza Strip.\nHezbollah chief Hassan Nasrallah in a televised address said that Hezbollah fighters were capable of going into northern Israel but had not done so.\nThe operations room later told AFP that an Israeli strike on the town of Adloun had killed a woman and wounded four other people.\nReuters“A terrorist” in the Yarun area, elsewhere in south Lebanon, “was also struck”, the statement said, adding that a drone from Lebanon was intercepted.\nA United Nations Interim Force In Lebanon (UNIFIL) peacekeeping force vehicle patrols in the southern coastal border Lebanese-Israeli town of Naqoura, Lebanon, Monday, June 6, 2022."}, {"id": "ae89575c-7ef5-486c-9e69-f0352b6ab0e9", "title": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stance", "date": "2024-06-01 04:15", "url": "https://sentinelcolorado.com/uncategorized/berlin-lets-ukraine-use-german-weapons-against-targets-in-russia-after-the-us-also-eases-its-stance/", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)Firefighters put out a fire on an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)Police officers cover a dead body after the Russian missile attack hit an apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024."}, {"id": "7807e252-7c2a-47c3-af42-d8089b1c13dc", "title": "Conn . congressional members : Allowing Ukraine to use U . S . arms in Russia wont escalate war", "date": "2024-06-01 03:15", "url": "https://www.theday.com/state/20240531/conn-congressional-members-allowing-ukraine-to-use-u-s-arms-in-russia-wont-escalate-war/", "message": "Two veteran members of Congress on Friday said they don't believe the expanded use of U.S. weaponry into Russian territory will escalate the war in Ukraine to a wider conflict.\nRussian President Vladimir Putin has threatened the use of tactical nuclear weapons if the war widens.\nIn the Russian campaign against Kharkiv, Himes said, Russian weapons with a 30-mile range are stationed 10 miles from the Ukraine border.\nI think Ukraine needs to use American arms to strike the sources of greatest damage and danger: the supply depots, the command centers, the missile sites which are raining terror on Ukrainian cities.\"\nBlumenthal said that if Russia unleashes nuclear weapons, the response could be \"absolutely brutal and savage for his country.\""}, {"id": "dd1d4c65-4c4c-40c0-a715-20132598ef5f", "title": "Three arrested in connection with Pittsburg man stabbing death", "date": "2024-06-01 02:15", "url": "https://www.mercurynews.com/2024/05/31/three-arrested-in-connection-with-pittsburg-mans-stabbing-death/", "message": "PLEASANT HILL — Three people were arrested Friday in connection with the stabbing death of a 37-year-old Pittsburg man earlier this year in Pleasant Hill, police said.\nSantiago Jacobo was found dead around 4:50 a.m. on Feb. 10 in the main parking lot of Pleasant Hill Park, located at 147 Gregory Lane.\nKristic said evidence showed the suspects planned, coordinated and carried out the attack on Jacobo after he finished his shift working as a custodian at Pleasant Hill Park.\n“Our thoughts and condolences remain with the Jacobo family,” Kristic said in the news release.\nAnyone with information related to the case can contact the police department’s investigations bureau at 925-288-4630."}, {"id": "7d52676a-4085-4f5e-b094-bf77caffe756", "title": "Plot to attack Salman Khan in Panvel farmhouse ? Police arrest 4 with links to gangster Lawrence Bishnoi", "date": "2024-06-01 06:30", "url": "https://www.businesstoday.in/india/story/plot-to-attack-salman-khan-in-panvel-farmhouse-police-arrest-4-with-links-to-gangster-lawrence-bishnoi-431682-2024-06-01", "message": "The police have arrested four individuals last week for planning another attack on Khan while he was en route to his Panvel farmhouse.\nRelated ArticlesGangster Lawrence Bishnoi, already suspected in the Bandra shooting, is believed to be behind both plots.\nThe Bishnoi gang had a detailed plan to target Khan.\nAccording to the FIR, Panvel Senior Inspector Nitin Thakre received a tip-off about the gang's presence in Panvel, leading to the arrests.\nAuthorities are currently interrogating the four suspects to establish any connections to the Bandra shooting."}, {"id": "272abd95-d72d-4842-a77a-356f4179478d", "title": "Houthi Rebels Claim Strike on USS Eisenhower amid U . S .- UK Operations in Yemen", "date": "2024-06-01 04:30", "url": "https://trendydigests.com/2024/06/01/houthi-rebels-claim-strike-on-uss-eisenhower-amid-u-s-uk-operations-in-yemen/", "message": "Yemen’s Houthi rebels have claimed a missile attack on the USS Dwight D. Eisenhower, a U.S. Navy aircraft carrier operating in the Red Sea.\nThe claim came after a series of coordinated U.S. and U.K. strikes against Houthi targets in Yemen, which reportedly resulted in multiple casualties.\nOn May 30 2024, the U.K. took part in a joint operation with U.S. forces to target Houthi military facilities in Yemen.\nThis operation took place in order to hinder the Houthi rebels’ capacity to attack international shipping in the Red Sea and Gulf of Aden.\nThe Houthi strikes on shipping are claimed to be in solidarity with Palestinians in Gaza and are seen as retaliatory measures against U.S.-led airstrikes."}, {"id": "768e252e-11df-47d9-bdb3-d56e40f4be70", "title": "Woman Stabbed on Whittier Hiking Trail ; Suspect Apprehended", "date": "2024-06-01 01:45", "url": "https://mynewsla.com/crime/2024/05/31/woman-stabbed-on-whittier-hiking-trail-suspect-apprehended/", "message": "A woman was stabbed on a Whittier hiking trail Friday but was expected to survive, and a suspect was quickly taken into custody.\nAccording to the Whittier Police Department, officers responded at 12:30 p.m. to a report of a stabbing on the Greenway Trail near Calmada Avenue.\n“The victim provided a description of the suspect, who was quickly apprehended by responding officers and detectives in the adjacent neighborhood.”The suspect was described only as a 35-year-old man whose name was not released.\nPolice said they will be maintaining “additional police resources in the area.”It was unclear what prompted the attack.\nAnyone with additional information was asked to contact Whittier police at 562-567-9240."}, {"id": "90d5439f-c06d-4e16-ac50-1557615cd259", "title": "Russia creeping advance is costing it 1 , 200 soldiers a day : Western intel", "date": "2024-06-01 05:00", "url": "https://www.businessinsider.in/defense/news/russias-creeping-advance-is-costing-it-1200-soldiers-a-day-western-intel/articleshow/110604081.cms", "message": "A Ukrainian military tank fires during military training as the war between Russia and Ukraine continues in Donetsk Oblast, Ukraine on May 28, 2024.\nDiego Herrera Carcedo/Anadolu via Getty ImagesRussia's casualties reached an average of 1,200 per day this month, according to UK intelligence.\nIt's the highest since the start of the war, likely due to costly offensives across the front lines.\nRussia's intense attacks across the front line have been costly, with the number of casualties per day reaching a new peak this month, according to new intelligence.\nThe assessment attributes the elevated casualty rate to Russia's brutal ongoing offensive, noting that Russia's ability to replenish its units is stretched thin due to its consistent losses."}, {"id": "9f3a3246-3c38-4aa4-aaea-7eaa4528068b", "title": "Richard England : Vandals at UNH , Elbit Systems distort truth about Gaza", "date": "2024-06-01 06:15", "url": "https://www.unionleader.com/opinion/op-eds/richard-england-vandals-at-unh-elbit-systems-distort-truth-about-gaza/article_6fd77a52-1cfc-11ef-ab25-e3ea8c737318.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "4b3ae8cf-ec28-4096-b749-5e0a7d2fcb9f", "title": "Clay Travis :  Were in a real war . Legal warfare is afoot and it time to return fire . ", "date": "2024-06-01 05:00", "url": "https://www.mediamatters.org/jesse-watters/clay-travis-were-real-war-legal-warfare-afoot-and-its-time-return-fire", "message": "Citation From the May 31, 2024, edition of Fox News' Jesse Watters PrimetimeCLAY TRAVIS (GUEST): Sooner or later you have to pick the chair up and smack the bad guy in the face in the wrestling ring.\nThey have sent a new message, which is they are going to try to put their chief political rivals in prison for the rest of their lives.\nThis can't be 30 or 40 years ago when everybody has a Manhattan in the country club and talks about the Republican Party.\nLegal warfare is afoot and it's time to return fire.\nJESSE WATTERS (HOST): Joe Biden not mentally fit enough to stand trial but maybe some of his comrades could take a steel chair to the head."}, {"id": "444c4039-d289-470c-b2df-8b91f18f89ad", "title": "Barred from combat , women working as codebreakers , cartographers and coxswains helped D - Day succeed", "date": "2024-06-01 02:15", "url": "https://www.columbian.com/news/2024/may/31/barred-from-combat-women-working-as-codebreakers-cartographers-and-coxswains-helped-d-day-succeed/", "message": "LONDON (AP) — What did you do in the war, Granny?\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nThe history of D-Day is often told through the stories of the men who fought and died when the Allies stormed the beaches of northern France on June 6, 1944.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nOften overlooked, their contributions have come into sharper focus as the number of living D-Day veterans dwindles and the world prepares for the 80th anniversary of the landings."}, {"id": "400c5c36-bdd9-48bc-a1e3-8af73fbbf0d8", "title": "Gaza Unrest - Live Event Reporting by Dunya News", "date": "2024-06-01 07:15", "url": "https://dunyanews.tv/en/Event-Reporting/167", "message": "Sat, 01 Jun 2024 14:08:31 PKTPrabowo says Indonesia willing to send peacekeeping troops to Gaza Indonesia’s president-elect, Prabowo Subianto, says his country is willing to send peacekeeping troops to enforce a ceasefire in Gaza if required.\nIsraeli forces there are completely stationed in the eastern areas of Rafah and tanks are pushing deeper into the main, central areas of Rafah district.\nSat, 01 Jun 2024 08:44:06 PKTDemocratic and Republican leaders in the US Congress have invited Netanyahu to deliver an address within weeks to lawmakers, House Speaker Mike Johnson has said.\nSat, 01 Jun 2024 08:13:13 PKTPrime Minister Netanyahu’s office has said Israel authorised negotiators to present the truce deal but reiterated the conflict won’t end until the “elimination” of Hamas’s capacity to make war and govern.\nSat, 01 Jun 2024 08:08:57 PKT"}, {"id": "c7383ced-7fd2-4023-84fe-54e50277c2c7", "title": "Special Military Operation Creating The Future of Warfare", "date": "2024-06-01 03:15", "url": "https://sputnikglobe.com/20240601/like-wwi-ukraine-conflict-is-reshaping-war-for-the-21st-century-1118727144.html", "message": "https://sputnikglobe.com/20240601/like-wwi-ukraine-conflict-is-reshaping-war-for-the-21st-century-1118727144.htmlLike WWI, Ukraine Conflict Is Reshaping War For the 21st CenturyLike WWI, Ukraine Conflict Is Reshaping War For the 21st CenturySputnik InternationalThe conflict in Ukraine is reshaping warfare in the 21st century, and just like WWI, it will be the generals who can adapt who will find success.\nHaig ordered frontal assaults, and not even the kind that were typical (though largely unsuccessful) during the early stages of the Great War.\nWhat Somme and many other battles in WWI proved was that the old way of fighting had come and gone.\nUkraine lost dozens of expensive tanks and thousands of men capturing and then holding the village.\nThey’re much too arrogant,” to put a cope cage on an Abrams, he said.The innovations on the battlefield in the Ukraine war are undoubtedly going to shape the next war and the war after that."}, {"id": "792f9a68-2b25-4aff-8a06-8cf9b0f68ae8", "title": "Warplanes : The F - 35 Was Too Much and Not Enough", "date": "2024-06-01 05:15", "url": "http://www.strategypage.com/htmw/htairfo/articles/2024060104222.aspx", "message": "The F-35 also carries three times as much fuel but the lighter F-16 can travel 4,200 kilometers on internal fuel while the heavier F-35 can only go 2,700 kilometers.\nDetails of these exercises have not been publicized but it apparently involves testing current and new F-35 capabilities and sharing that knowledge with other F-35 users.\nF-35 software was designed over a decade ago when much less was known about how combat aircraft software could be hacked, and already some basic changes in F-35 software architecture are underway to deal with that.\nThe F-35 software is more complex and omnipresent throughout the aircraft than in any previous warplane.\nSome major upgrades are needed in how F-35 software changes are made and how quickly."}, {"id": "0d6a0218-d6b4-4236-8a38-70b8525dd779", "title": "Britain Got Talent thrown into chaos as Ant and Dec are forced to intervene after act stops live show to honour the people of war - torn Ukraine", "date": "2024-06-01 09:15", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13483241/Britains-Got-Talent-Ant-Dec-Ukraine-Russian-war.html", "message": "Britain's Got Talent's last live semi-finals were thrown into chaos when singer The Dark Hero stopped the stop mid broadcast on Friday.\nHeading home after falling at the final hurdle, Denise and Stefan were visibly upset as they thanked the judges for the opportunity.\nThey were incredible both times #BGT'; 'My original (and still because of potential wildcard) favourites Denise & Stefan are out?\n'#bgt hopefully Denise, stefan get a wildcard and win it!!\nThey deserve the wildcard'; 'stefan & denise for the wildcard nobody more deserving!"}, {"id": "f5c12421-d54a-42c0-9913-8c3e4e67264b", "title": "Ukraine war : We have no Plan B if Ukraine falls , Estonian PM says", "date": "2024-06-01 00:15", "url": "https://www.bbc.com/news/articles/c722zxj0kyro", "message": "\"If every Nato country did this,\" says Estonia’s steely Prime Minister Kaja Kallas, \"Ukraine would win.\"\nWhat, I asked Prime Minister Kallas, is Estonia’s Plan B if Ukraine loses this war and Russia’s invasion ultimately succeeds?\n\"We have no Plan B for a Russian victory,\" she replies, \"because then we would stop focussing on Plan A\" - helping Ukraine push back the Russian invasion.\nIf Ukraine joins Nato, even without some territory, then that’s a victory because it will be placed under the Nato umbrella.\"\n'Denial is key to strategy'So just how vulnerable is Estonia to a future Russian invasion?"}, {"id": "8990b2d1-4087-4005-ba46-70557eba6d0f", "title": "Analysis - Biden tip - toes deeper into Ukraine conflict with arms decision", "date": "2024-06-01 00:15", "url": "https://www.fijitimes.com.fj/analysis-biden-tip-toes-deeper-into-ukraine-conflict-with-arms-decision/", "message": "Since Russia’s 2022 invasion of Ukraine, Biden’s administration had argued it was too risky to allow Ukraine to strike targets on Russia territory with U.S.-supplied weapons.\nBiden administration officials say the latest decision, which went into effect on Thursday, was narrowly tailored to the battle in the Kharkiv region.\nPhilip Ingram, a former British military intelligence officer, said Biden’s decision will reduce Kyiv’s need to draw troops away from critical battle fronts in the eastern Donbas region.\nBiden’s administration had been finalizing the decision since then.\n“I don’t think (the decision) is going to change the movement of the frontline that much, if at all."}, {"id": "9375b02f-900b-49fe-b2cb-418bc06bbee4", "title": "Professor Shines Light on Normandy Lost Paratroopers - UT Dallas Magazine | The University of Texas at Dallas", "date": "2024-06-01 00:30", "url": "https://magazine.utdallas.edu/2024/05/31/professor-shines-light-on-normandys-lost-paratroopers/", "message": "Rene E. Rabe, a paratrooper of the legendary 82nd Airborne Division during World War II.\nOfficers constantly promoted him because they understood that the paratroopers would follow him into extreme danger.\nA: Most paratroopers did not like to jump out of “perfectly good airplanes.” Many of them were petrified when they jumped.\nQ: Tell me about your personal connection (your dad) to World War II.\nWomen are the lead characters in The Lost Paratroopers."}, {"id": "e371d8e1-3384-44cc-a9c4-aaf03662bf7d", "title": "Ukraine war : We have no Plan B if Ukraine falls , Estonian PM says", "date": "2024-06-01 04:15", "url": "https://www.bbc.co.uk/news/articles/c722zxj0kyro", "message": "\"If every Nato country did this,\" says Estonia’s steely Prime Minister Kaja Kallas, \"Ukraine would win.\"\nWhat, I asked Prime Minister Kallas, is Estonia’s Plan B if Ukraine loses this war and Russia’s invasion ultimately succeeds?\n\"We have no Plan B for a Russian victory,\" she replies, \"because then we would stop focussing on Plan A\" - helping Ukraine push back the Russian invasion.\nVictory in Ukraine is not just about territory.\nIf Ukraine joins Nato, even without some territory, then that’s a victory because it will be placed under the Nato umbrella.\""}, {"id": "a7cb9c02-b5d8-4597-ad82-efec4424ff30", "title": "Russo - Ukraine War - 31 May 2024", "date": "2024-06-01 04:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-31.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nIt is highly likely that most Russian forces receive only limited training, and they are unable to carry out complex offensive operations.\nAccording to preliminary data, since the beginning of the day in this direction Russian forces has lost 64 occupiers and one tank.\nThe Defense Forces are taking measures to stabilize the situation and prevent the Russian forces from advancing.\nDefense forces inflict tangible losses to the occupiers, actively applying fire-threatening tools on the Russian forces' live force and equipment."}, {"id": "7ef07d05-a613-4bbc-bb0c-78236615dd36", "title": "Operation Iron Swords", "date": "2024-06-01 04:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-31.htm", "message": "Operation Iron Swords - Day 238 - 31 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nThe fighters directed an Air Force aircraft that killed a number of terrorists who were operating near Israeli forces.\nThe Israeli army praised the engineering activity with the assistance of the Egyptian army.\nControl of the Philadelphia axis comes only weeks after Israeli forces took control of the Rafah border crossing with Egypt, on May 7.\nAs a member of the war council, Gantz helped manage the Israeli attack on Gaza before tensions emerged as the military operation proceeded."}, {"id": "bef25d28-85c8-46ac-b5a2-75bd5c4ef18e", "title": "1066 and all what ? A quarter of adults dont know when the First World War or the Battle of Hastings was", "date": "2024-06-01 00:15", "url": "https://www.dailymail.co.uk/news/article-13482597/quarter-adults-dont-know-World-War-Battle-Hastings.html", "message": "This nation has been profoundly changed by the events of history including two world wars.\nYet a quarter of adults do not know when the First World War took place, a poll has revealed.\nAnd a small minority even believe that the victor in the Battle of Hastings was Robin Hood.\nThese questions were then put to 1,000 adults in research for online booking service Trainline.\nA quarter of the adults asked could not list the years in which the First World War took place."}, {"id": "3d620bca-a47c-4b87-ba2f-ae85e7a21e34", "title": "The Best Android and iOS Games of 2024", "date": "2024-06-01 04:30", "url": "https://n4g.com/news/2602036/the-best-android-and-ios-games-of-2024", "message": "60°The Best Android and iOS Games of 20242024 has become filled with games, and now is the perfect time to play some classic and new.\nCheck out the Best Android Games of 2024!"}, {"id": "8b9ca604-25ab-44e5-b7bd-b9ab73025770", "title": "Grizzy and the Lemmings - CBBC HD", "date": "2024-06-01 09:30", "url": "https://www.tvguide.co.uk/schedule/46a57042-cbb3-5567-b877-ed6b0c039649/grizzy-and-the-lemmings", "message": "Grizzy and the LemmingsCBBC HD 3:55 PM to 4:05 PM Saturday 1 June Share Add toCalendar +Bamboo Warfare Season 3 Episode 8 of 78 Repeat S SubtitlesGrizzy dismantles the toboggan built by the Lemmings in the log cabinGrizzy and the Lemmings airs on CBBC HD at 3:55 PM, Saturday 1 June .\n(Subtitles, repeat.)"}, {"id": "88fa4270-3ef6-4226-b7c7-392858a4455a", "title": "Grizzy and the Lemmings - CBBC", "date": "2024-06-01 09:30", "url": "https://www.tvguide.co.uk/schedule/0384c514-8fd0-5c87-9f16-00b3a17c4e58/grizzy-and-the-lemmings", "message": "Grizzy and the LemmingsCBBC 3:55 PM to 4:05 PM Saturday 1 June Share Add toCalendar +Bamboo Warfare Season 3 Episode 8 of 78 Repeat S SubtitlesGrizzy dismantles the toboggan built by the Lemmings in the log cabinGrizzy and the Lemmings airs on CBBC at 3:55 PM, Saturday 1 June .\n(Subtitles, repeat.)"}, {"id": "c17cad8f-f01b-4bf6-ad52-6fbdb302518d", "title": "Call of Duty : Black Ops 6 will release on PS4 and Xbox One , claims leaker", "date": "2024-06-01 09:15", "url": "https://www.tweaktown.com/news/98590/call-of-duty-black-ops-6-will-release-on-ps4-and-xbox-one-claims-leaker/", "message": "Call of Duty: Black Ops 6 is reportedly being released on PlayStation 4 and Xbox One in the form of a cross-gen bundle for multiple console generations.\nThe Season 4 update was rolled out to the two aforementioned titles and dataminers dug through all of the files looking for clues about the upcoming and highly anticipated, Call of Duty: Black Ops 6.\nThe dataminers discovered some files that appear to reveal a major aspect regarding the launch of upcoming title, and that is Black Ops 6 supposedly releasing on multiple generations via a \"cross-gen bundle\".\nIf there is a cross-gen bundle purchasable at launch it will mean Activision will be releasing Call of Duty: Black Ops 6 on the PlayStation 4, Xbox One, PlayStation 5 and Xbox Series X|S.\nWith all this in mind it makes sense for Activision to release a cross-gen bundle to bolster its sales numbers for Black Ops 6."}, {"id": "b8918158-780d-4943-b328-287c02d47a3e", "title": "Electronic Weapons : USAF Electronic Warfare Squadrons", "date": "2024-06-01 05:15", "url": "http://www.strategypage.com/%5Chtmw%5Chtecm%5Carticles%5C2024053103743.aspx", "message": "May 31, 2024: The United States Air Force has made a bold move by establishing two new electronic warfare squadrons.\nThis means which offensive electronic countermeasures; jamming or spoofing (deceptive signals) are best suited to protect aircraft, ships, and land bases.\nNo one took credit for the AIS signal manipulation, which is known as spoofing.\nAfter 2012 security researchers found even more ways to hack AIS and called for changes in the AIS software to make it more difficult to spoof.\nThe 563rd specializes in developing new EW software apps for EW that support specific EW needs of Air Force combat and support units."}, {"id": "36280ae7-688d-41d6-85ce-b46dd96fb88d", "title": "Battered , empty Myanmar town shows price of victory against junta", "date": "2024-06-01 07:30", "url": "https://www.thehindu.com/news/international/battered-empty-myanmar-town-shows-price-of-victory-against-junta/article68236504.ece", "message": "Gutted buildings, vacant windows and blocks bombed to rubble show the price paid by the western Myanmar town of Pauktaw for victory against the junta in the country's civil war.\nFighters from the Arakan Army (AA) ethnic minority armed group took control of the fishing port of 20,000 people in January, as the conflict sparked by the military's coup entered its fourth year.\nWhen a military helicopter hovered over Pauktaw and began shooting into the town last November, many fled in panic.\n\"There was no chance for us to take a single thing from our house,\" one woman now living outside the town told AFP.\nIn April, the AA warned residents of the town, which is home to an India-backed deep sea port, to leave ahead of a \"decisive\" battle."}, {"id": "12aaabe4-4de9-4e33-9dc0-522f4f3fc5ca", "title": "Trump conviction in New York and the 2024 crisis election - World Socialist Web Site", "date": "2024-06-01 04:45", "url": "https://www.wsws.org/en/articles/2024/06/01/bxnz-j01.html", "message": "The conviction of Donald Trump on 34 felony counts of falsifying business records in his trial in New York is a significant event in an election year dominated by an unprecedented and intensifying political crisis and factional warfare within the ruling class.\nFormer President Donald Trump speaks during a news conference at Trump Tower, Friday, May 31, 2024, in New York.\nThe conviction, rather, relates to the falsification of business records to cover up a tawdry sex scandal in the run-up to the 2016 election.\nIt is not clear what impact the conviction will have on Trump’s personal fate, though the former president responded by going on the offensive.\nA crisis such as that engulfing the United States and the entire world cannot be resolved by tinkering around the edges."}, {"id": "f9a48786-cec3-45b8-b6f2-37838ac16be9", "title": "When a brainwashed son brainwashes his mother", "date": "2024-06-01 09:30", "url": "https://www.americanthinker.com/blog/2024/06/when_a_brainwashed_son_brainwashes_his_mother.html", "message": "There were Jews displaced and Arabs displaced.\nSince that time, Israel numerous times has offered the Palestinian Arabs a state of their own side by side with Israel.\nThe Washington Post should serve as an educational adjunct for people like Eric, his mother, and others on the reality of the Middle East conflict.\nCome on, Washington Post.\nHe has been widely published in news sources such as The Economist, The New York Times, and The Washington Post."}, {"id": "c45b2e99-5742-453c-9f50-930895527739", "title": "Ancient Egyptians Tried to Surgically Treat Cancer , Study Finds", "date": "2024-06-01 04:00", "url": "https://gizmodo.com.au/2024/06/ancient-egyptians-tried-to-surgically-treat-cancer-study-finds/", "message": "Scientists have discovered archaeological evidence that ancient Egyptians attempted to surgically remove cancerous lesions, pushing the practice back to over 4,000 years ago.\nSkull 236 in particular was littered with tinier lesions across the skull, probably an indication of advanced, metastasized cancer.\nIf the team’s discovery is genuine, it would be the first documented instance of surgical cancer treatment recorded in human history.\nMore research and data will be needed to verify this hunch, however, as well as to confirm and expand their findings on cancer in the ancient world, they note.\n“Our aim is to complete the biography of cancer from the very beginning of human history.”"}, {"id": "642c4db8-4e69-4783-b47c-61a3a9f1b95c", "title": "Wars have been a constant of the human race , and they usually end the same way – from exhaustion – The Irish Times", "date": "2024-06-01 09:15", "url": "https://www.irishtimes.com/opinion/2024/06/01/lara-marlowe-wars-have-been-a-constant-of-the-human-race-and-they-usually-end-with-exhaustion/", "message": "Almost from the beginning of Russia’s full-scale invasion of Ukraine, politicians, historians and commentators have questioned how the war will end.\nCharles de Gaulle accomplished a similar feat by obtaining a seat on the UN Security Council for France after the second World War.\nBut one should not presume that a second Trump presidency would automatically spell defeat for Ukraine.\nTrump thinks like a horse trader ...[ The Irish Times view on the war in Ukraine: trading threats ]“Wars usually end from exhaustion,” Buhler went on.\nDemocracy is more likely to foster peace than international law, Buhler concluded."}, {"id": "f5f21962-62ad-421f-82cb-c728d9db8acb", "title": "World Outlander Day : Five of the best Scottish moments from epic drama", "date": "2024-06-01 04:15", "url": "https://www.dailyrecord.co.uk/scotland-now/world-outlander-day-five-best-32923205", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the latest news on Jamie and Claire every week - sign up to our weekly Everything OutlanderSomething went wrong, please try again later.\nOn June 1 every year, fans across the world share their favourite moments, quotes, and clips from the historical epic.\nOne of the most tender moments is where Claire comes across her soulmate speaking in Gaelic to his sister Jenny's baby."}, {"id": "230ad996-3235-49ac-a60e-e23138636643", "title": "Great North Battle 2024 Day 1 - NOW Toronto", "date": "2024-06-01 04:00", "url": "https://nowtoronto.com/event/great-north-battle-2024-day-1/", "message": "The Great North Battle returns for its 5th edition in Toronto!\nA true celebration of hip hop shining light on all of the elements with battles, showcases and workshops over 2 days.\nThen Beatbox Canada shall be hosting the seeding rounds/first battle rounds of both the solo/loopstation categories of our stacked international beatbox competition with judge and special guest showcases mixed in.\nOur partners in the world of battle rap are the premier battle league KOTD.\nThey will be hosting a 4 person on beat battle rap tournament with 4 hungry MCs all vying for title of champion."}, {"id": "c352cc43-b475-4f93-9ccc-2bc62e63f59a", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 01:30", "url": "https://www.smh.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "e2422b61-9e40-4443-8855-af49d9e91ab7", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 01:45", "url": "https://www.theage.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "6af5ad1a-f247-42ef-b73e-0ad2f3dec8fb", "title": "Thompson continues farm bill push after successful committee vote", "date": "2024-06-01 00:30", "url": "https://www.beefmagazine.com/policy/thompson-continues-farm-bill-push-after-successful-committee-vote", "message": "In the wake of last Friday’s bipartisan vote to pass a new farm bill out of the House Agriculture Committee, Chairman Glenn “GT” Thompson (R-Penn.)\nOn Wednesday, Thompson jointly authored an op-ed in The Hill with House Ways and Means Committee Chairman Jason Smith (R-Mo.)\nWhile the Agriculture Committee oversees programs that promote agriculture to foreign buyers, Ways and Means holds general jurisdiction over broader trade legislation.\nThe GCSA promotes voluntary carbon credit markets to stimulate carbon sequestration on farms and provide certainty and predictability for participants.\n“High-integrity voluntary carbon markets offer a promising tool to create new revenue streams for producers and achieve greenhouse gas reductions from the agriculture and forest sectors,” said Secretary of Agriculture Tom Vilsack."}, {"id": "a43bc82e-688b-41a3-b6db-2ea429703038", "title": "Tom Madden New Book  Planetary Lifeguard : Blowing The Whistle On Climate Change  Available On Amazon", "date": "2024-06-01 01:45", "url": "https://menafn.com/1108282140/Tom-Maddens-New-Book-Planetary-Lifeguard-Blowing-The-Whistle-On-Climate-Change-Available-On-Amazon", "message": "(MENAFN- ForPressRelease) Boca Raton, Fla., May 31, 2024 -- Interested in more about the ongoing fight against climate change?\nAuthor and CEO Tom Madden's new Planetary Lifeguard tells how we can rescue our planet by staying fully informed, armed with knowledge!\nPlanetary Lifeguard: Blowing the Whistle on Climate Change looks at the havoc carbon emissions from fossil fuels are causing mother earth and what we must do to save her.\nMadden, a former Atlantic City, NJ lifeguard created a Planetary Lifeguard to lead us to victory over global warming.\nOther books written by Madden include Wordshine Man, SPIN MAN, King of the Condo, Is there enough Brady in Trump to win the InSUPERable Bowl?"}, {"id": "7b8b68b5-dea2-4543-892a-36769e2b8150", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 02:15", "url": "https://www.watoday.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "317597af-c751-4f57-a12d-9a4bea6464a8", "title": "Austal united states Wins $516 Million Contract to Construct Navy Ocean Surveillance Ship", "date": "2024-06-01 00:15", "url": "https://gcaptain.com/austal-usa-wins-516-million-contract-to-construct-navy-ocean-surveillance-ship/", "message": "May 31 (Reuters) – Austal Ltd has secured a $516 million contract to construct the lead ship of the United States Navy’s ocean surveillance program, T-AGOS 25, the Australian defence shipbuilder said in an exchange filing on Friday.\nThe contract, announced on May 19, was originally for $113.9 million for a detailed design of the Auxiliary General Ocean Surveillance Ship T-AGOS 25 Class for the United States Navy, with options to design and construct up to seven such ships.\nOn Friday, the United States Navy exercised its option to modify the contract to construct a ship, allowing Austal to buy the materials required to continue building the surveillance vessel.\nIf all options under the contract are exercised, the cumulative value of the order amounts to $3.20 billion, Austal added.\nT-AGOS ships, operated by the United States Military Sealift Command (MSC), support the antisubmarine warfare (ASW) mission of the commanders of the Atlantic and Pacific Fleets, the shipbuilder said in its statement."}, {"id": "c49e8879-7747-413a-a8d3-555c700748e5", "title": "Steve Phillips Obituary", "date": "2024-06-01 05:15", "url": "https://www.orlandosentinel.com/obituaries/steve-f-phillips-fl/", "message": "PHILLIPS, JR., STEVE F., Colonel Steve Franklin Phillips, Jr., 86, passed away October 8, 2006.\nIn 1964 he was selected as the Battalion Commander of 1st Battalion, 2d Infantry of the 5th Infantry Division and began training his battalion for the eventual deployment to the Republic of Vietnam.\nIn September 1965, his battalion was sent to Vietnam and reflagged under the 1st Infantry Division where he remained the commander for 6 months and was then promoted to Colonel and designated as the 1st Brigade Commander, 1st Infantry Division.\nHe also was a member of the Society of the 1st Division; Worshipful Master of the Hancock Masonic Lodge No.\nSteve is survived by his loving wife of 61 years, Frances Eileen Phillips; daughter, Myra Gene Keleher and her husband Dennis ; sons, Steve F. Phillips, III, and John W. Phillips; brother, David Phillips; sisters, Clovis Steele, and Marian Phillips; grandchildren, Shannon Keleher, Amanda Keleher, Steve F. Phillips, IV, and Luis-Andrés Phillips."}, {"id": "00b9a08f-26a3-4a0c-9395-f37b9274e763", "title": "UN says Gaza aid not reaching the population", "date": "2024-06-01 09:15", "url": "https://naharnet.com/stories/en/305622-un-says-gaza-aid-not-reaching-the-population", "message": "The humanitarian aid allowed into the Gaza Strip is not getting to civilians in need, the United Nations said Friday, urging Israel to fulfil its legal obligations.\n\"The aid that is getting in is not getting to the people, and that's a major problem,\" Jens Laerke, spokesman for the U.N. humanitarian agency OCHA, told a media briefing in Geneva.\n\"We continue to insist that Israeli authorities' obligation under the law to facilitate delivery of aid does not stop at the border,\" said Laerke.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the army says are dead.\nIsrael's retaliatory offensive has killed at least 36,224 people in Gaza, mostly civilians, according to the Hamas-run territory's health ministry."}, {"id": "4b4f5525-d4b9-44e2-9133-941802a5eaab", "title": "Street Soldiers : Drake and Kendrick Lamar epic battle heats up", "date": "2024-06-01 01:30", "url": "https://www.foxla.com/news/street-soldiers-drake-and-kendrick-lamars-epic-battle-heats-up", "message": "The matchup between two Hip-Hop heavyweights, Drake and Kendrick Lamar, became Hip-Hop's version of boxing's epic showdown between Muhammad Ali and Joe Frazier in the fight of the century.\nIn one corner, we have multiple Grammy-winning artists, Kendrick Lamar.\nThe Kendrick Lamar - Drake battle heated up in the spring of 2024 and erupted with verbal blows being thrown and landing in both directions.\nBattle Rap legend Math Hoffa says the intensity and personal verbal attacks in the Drake–Kendrick showdown remind him of battle rap at its best - provocative, emotional, and above all, entertaining.\n\"The level of lyricism and creativity that came out of this, I'm hoping it’s going to put a spotlight on battle rap because a lot of things that I heard in this battle were bars that were constructed in battle rap for the past decade,\" Hoffa said."}, {"id": "feb4fc19-002e-4430-a14f-d31c349d11a9", "title": "French nurse dubbed  Angel of Dien Bien Phu  dies aged 99", "date": "2024-06-01 03:45", "url": "https://www.citizen.co.za/news/news-world/french-nurse-dubbed-angel-of-dien-bien-phu-dies-aged-99/", "message": "French nurse dubbed ‘Angel of Dien Bien Phu’ dies aged 99Genevieve de Galard, the \"Angel of Dien Bien Phu,\" died at 99, hailed for her \"exemplary devotion\" by French President Macron.\nGenevieve de Galard, a nurse dubbed the “Angel of Dien Bien Phu” for treating wounded during a defining 1954 battle in then French Indochina, has died aged 99, with President Emmanuel Macron on Friday hailing her “exemplary devotion”.\nOne of the evacuation planes she travelled in was destroyed by gunfire when she was about to leave Dien Bien Phu.\nThe English translation of her memoir, The Angel of Dien Bien Phu, was published in 2010.\nDefence Minister Sebastien Lecornu represented Paris at commemorations marking the 70th anniversary of Dien Bien Phu in May."}, {"id": "5abdf834-527b-4adc-ac15-0719ae0c3704", "title": "Biden details a 3 - phase hostage deal aimed at winding down the Israel - Hamas war", "date": "2024-06-01 00:30", "url": "https://www.wcax.com/2024/05/31/biden-says-hamas-is-no-longer-capable-carrying-out-another-major-attack-against-israel/", "message": "The second phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza.\n“And as long as Hamas lives up to its commitments, the temporary cease-fire would become, in the words of the Israeli proposal, ‘the cessation of hostilities permanently,’” Biden said.\nThe 4-1/2 page Israeli proposal was transmitted to Hamas on Thursday.\nBiden acknowledged that keeping the Israeli proposal on track would be difficult, saying there were a number of “details to negotiate” to move from the first phase to the second.\nThe outline of the new Israeli proposal is “nearly identical to Hamas’s own proposals of only a few weeks ago,” according to the Biden administration official."}, {"id": "fc131e81-4732-403b-8c78-996c8dec7835", "title": "Oil and gas giants ConocoPhillips and Chevron announce major acquisitions as industry consolidation continues", "date": "2024-06-01 04:45", "url": "https://www.wsws.org/en/articles/2024/06/01/culm-j01.html", "message": "ConocoPhillips, one of the leading oil and gas companies in the United States, announced Wednesday that it would be purchasing Marathon Oil for $22.5 billion.\nConocoPhillips is currently the third largest oil and gas producer in the Permian, which is the largest shale oil field in the US.\nThe past few years have seen an upsurge in the number of mergers and acquisitions in the oil and gas industry.\nThe consolidation of the oil and gas industry is also playing out amid the escalating NATO war against Russia in Ukraine.\nRussia is the third largest oil producer in the world, with 12 percent of global production."}, {"id": "1c9a7e27-dfbd-41fc-b0cd-46ffb3639dd2", "title": "Stonehenge solstice is mainstream now , but hippies once had to defy the law", "date": "2024-06-01 07:45", "url": "https://metro.co.uk/2024/06/01/stonehenge-solstice-mainstream-now-hippies-defy-law-20925737/", "message": "You couldn’t always reach Stonehenge solstice on a charity shuttle bus.\nBut just 25 years ago, attending solstice at the stones was banned.\nBut in brief, hundreds of a police blocked a convoy of New Age hippies in 140 vehicles, who were intending to set up camp weeks before the solstice.\nOn the summer solstice, the sun rises behind the Heel Stone in the north-east and its first rays shine into the stones.\nPhotos from 2023 show thousands gathered in front of the stones, chanting and dancing without interruption from law enforcement."}, {"id": "6b8933f3-4b36-456a-8fc7-cb3d31400812", "title": "Biden details a 3 - phase hostage deal aimed at winding down the Israel - Hamas war – Metro US", "date": "2024-06-01 00:15", "url": "https://www.metro.us/biden-says-hamas-is-no-longer-capable-of-carrying-out-another-major-attack-against-israel/", "message": "The second phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza.\n“And as long as Hamas lives up to its commitments, the temporary cease-fire would become, in the words of the Israeli proposal, ‘the cessation of hostilities permanently,’” Biden said.\nThe 4-1/2 page Israeli proposal was transmitted to Hamas on Thursday.\nBiden acknowledged that keeping the Israeli proposal on track would be difficult, saying there were a number of “details to negotiate” to move from the first phase to the second.\nThe outline of the new Israeli proposal is “nearly identical to Hamas’s own proposals of only a few weeks ago,” according to the Biden administration official."}, {"id": "d9c22616-7a1a-4e6e-ae29-d540d1dd9b44", "title": "15 years on , the Tamil survivors of Sri Lanka brutal civil war live in fear and disempowerment", "date": "2024-06-01 03:15", "url": "https://abcnews.go.com/International/wireStory/15-years-tamil-survivors-sri-lankas-brutal-civil-110734092", "message": "Sri Lanka's Tamil people still live in the shadow of defeat in the civil war that tore the country apart until it ended 15 years agoMULLAITIVU, Sri Lanka -- At the site of a bloody battlefield that marked the end of Sri Lanka’s civil war, Singaram Soosaimuthu fishes every day with his son, casting nets and reeling them in.\nThe former Tamil fighter lost both legs in 2009 as the nation’s generation-long civil war drew to a close and the Tamils retreated in defeat.\nBut defeat — bloody, protracted and decisive — has brought Sri Lanka's minority Tamil community to a point of despair.\n\"This has happened with all defeated communities in the world.”The island nation of 20 million is overwhelmingly ethnically Sinhalese, with the Tamil community making up about 11% of the population.\nA political alliance that the Tamil Tigers formed is fragmented with many leaders breaking away to form their own parties."}, {"id": "7fa38dcc-3e36-42b4-82fe-60ae1e70210d", "title": "15 years on , the Tamil survivors of Sri Lanka brutal civil war live in fear and disempowerment", "date": "2024-06-01 06:30", "url": "https://www.voanews.com/a/years-on-the-tamil-survivors-of-sri-lanka-s-brutal-civil-war-live-in-fear-and-disempowerment-/7638633.html", "message": "At the site of a bloody battlefield that marked the end of Sri Lanka's civil war, Singaram Soosaimuthu fishes every day with his son, casting nets and reeling them in.\nBut defeat — bloody, protracted and decisive — has brought Sri Lanka's minority Tamil community to a point of despair.\nThe island nation of 20 million is overwhelmingly ethnically Sinhalese, with the Tamil community making up about 11% of the population.\nDiscussing the Tamil Tigers' defeat, their past mistakes and even Prabhakaran's death is discouraged in Tamil society, especially in the diaspora.\nA political alliance that the Tamil Tigers formed is fragmented with many leaders breaking away to form their own parties."}, {"id": "c2109d38-ff5d-41d1-83d3-376445cbe1e1", "title": "15 years on , the Tamil survivors of Sri Lanka brutal civil war live in fear and disempowerment", "date": "2024-06-01 03:30", "url": "https://www.startribune.com/15-years-on-the-tamil-survivors-of-sri-lankas-brutal-civil-war-live-in-fear-and-disempowerment/600370224/", "message": "MULLAITIVU, Sri Lanka — At the site of a bloody battlefield that marked the end of Sri Lanka's civil war, Singaram Soosaimuthu fishes every day with his son, casting nets and reeling them in.\nBut defeat — bloody, protracted and decisive — has brought Sri Lanka's minority Tamil community to a point of despair.\nThe island nation of 20 million is overwhelmingly ethnically Sinhalese, with the Tamil community making up about 11% of the population.\nDiscussing the Tamil Tigers' defeat, their past mistakes and even Prabhakaran's death is discouraged in Tamil society, especially in the diaspora.\nA political alliance that the Tamil Tigers formed is fragmented with many leaders breaking away to form their own parties."}, {"id": "37f87296-4df3-43b2-849f-7a22ca930c18", "title": "200 people displaced after Battle Creek shelter closes", "date": "2024-06-01 03:15", "url": "https://www.yahoo.com/news/200-people-displaced-battle-creek-003941473.html", "message": "BATTLE CREEK, Mich. (WOOD) — Dozens of people have to find a new place to live after the Battle Creek Shelter closed its doors Friday.\nThe shelter didn’t have the funding and the doors officially closed before the weekend.\nNow, it’s trying to find a place for approximately 200 people who used the facility.\nMuskegon Rescue Mission, located about two hours away from the Battle Creek Shelter, stepped in to help.\nIts executive director said it is expecting 25 to 30 people to arrive over the next few days."}]