[{"id": "b518c23a-da3e-41df-becd-93c3869cb525", "title": "Syrian fighters belonging to Islamic Jihad killed in southern Lebanon", "date": "2024-05-09 02:00", "url": "https://www.longwarjournal.org/archives/2024/05/syrian-fighters-belonging-to-islamic-jihad-killed-in-southern-lebanon.php", "message": "Islamic Jihad published a statement on its official Telegram channel on Wednesday, grieving the deaths of three fighters belonging to its Syria branch, Ali al-Aswad Brigade.\nIslamic Jihad said the fighters died in southern Lebanon as a part of the al-Aqsa Flood operation against Israel.\nThose who rose on the borders of occupied Palestine in southern Lebanon as part of the al-Aqsa Flood battle while performing their combat duty,” said the statement.\nThe deaths of the Islamic Jihad fighters add to the growing evidence of foreign fighters aligned with the Iran-led Resistance Axis that are actively engaging Israel in the ongoing seven-month conflict.\nLess than a week before the strike on members of the Imam Hossein Brigade, Israel killed two Syrian fighters belonging to Islamic Jihad operating in southern Lebanon."}, {"id": "c1d24cdb-4bb3-47c5-8d24-a77a30b81e13", "title": "Haim Sabach , 20 - year - old infantry soldier , killed from mortar fire in northern Israel", "date": "2024-05-09 07:15", "url": "https://www.ynetnews.com/article/hynrxy5gc", "message": "Haim Sabach, a 20-year-old infantry soldier from Holon, was killed by a mortar shell fired from Lebanon at a military post in the Malkiya area of the Upper Galilee, the IDF announced Thursday moring.\nThis was in conjunction with numerous launches of rockets, anti-tank guided missiles (ATGMs), and anti-tank missiles by the terrorist group targeting frontline Israeli communities.\nIsraeli Air Force jets struck a military building associated with Hezbollah's Radwan force in southern Lebanon on Wednesday night.\nLebanese reports and Hezbollah's own statements assert that it launched rockets, ATGMs, and anti-tank missiles into Israel.\nAnti-tank missiles were also fired at Metula, Avivim, and surrounding areas; power outages occurred in Dovav and Avivim due to damage to a high voltage line."}, {"id": "0d0f8663-4e65-4195-8d5e-577ed6e46d34", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says", "date": "2024-05-09 08:45", "url": "https://www.yahoo.com/news/latest-rafahs-hospitals-run-fuel-075015257.html", "message": "Since then, more than 350 people have been killed in Lebanon, including 275 Hezbollah members and more than 70 civilians and non-combatants.\nIsrael’s military took control of the Palestinian side of the Rafah crossing early Tuesday after issuing evacuation orders for eastern parts of the city, home to some 100,000.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nAll three countries have been involved in months of talks aimed at halting the seven-month war between Israel and Hamas."}, {"id": "056418e0-d617-4d61-9bcb-d54d03366959", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says", "date": "2024-05-09 09:15", "url": "https://www.aol.com/latest-rafahs-hospitals-run-fuel-075015944.html", "message": "Since then, more than 350 people have been killed in Lebanon, including 275 Hezbollah members and more than 70 civilians and non-combatants.\nIsrael’s military took control of the Palestinian side of the Rafah crossing early Tuesday after issuing evacuation orders for eastern parts of the city, home to some 100,000.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nAll three countries have been involved in months of talks aimed at halting the seven-month war between Israel and Hamas."}, {"id": "e2e326a2-2fdc-4eaa-ba57-e79ce5d065d0", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says", "date": "2024-05-09 09:00", "url": "https://www.independent.co.uk/news/israel-ap-gaza-joe-biden-world-health-organization-b2542065.html", "message": "Israel’s military took control of the Palestinian side of the Rafah crossing early Tuesday after issuing evacuation orders for eastern parts of the city, home to some 100,000.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nThere was no comment from Israel’s military on the strike.\nThe Houthis insist their assaults will continue as long as Israel’s war on Hamas in the Gaza Strip goes on."}, {"id": "a748a2d9-ba61-426c-8353-e3f4972c2eb5", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says", "date": "2024-05-09 08:45", "url": "https://www.startribune.com/the-latest-rafahs-hospitals-will-run-out-of-fuel-in-3-days-who-says/600364702/", "message": "Israel's military took control of the Palestinian side of the Rafah crossing early Tuesday after issuing evacuation orders for eastern parts of the city, home to some 100,000.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nThere was no comment from Israel's military on the strike.\nThe Houthis insist their assaults will continue as long as Israel's war on Hamas in the Gaza Strip goes on."}, {"id": "4b84f413-ee83-4bf3-b323-e5cb977bf514", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says | iNFOnews", "date": "2024-05-09 09:00", "url": "https://infotel.ca/newsitem/ml-mideast-tensions-the-latest/cp1685276134", "message": "Since then, more than 350 people have been killed in Lebanon, including 275 Hezbollah members and more than 70 civilians and non-combatants.\nIsrael’s military took control of the Palestinian side of the Rafah crossing early Tuesday after issuing evacuation orders for eastern parts of the city, home to some 100,000.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nAll three countries have been involved in months of talks aimed at halting the seven-month war between Israel and Hamas."}, {"id": "b1b61cfc-0b60-4dde-ad9d-2926a2668115", "title": "Defense Secretary Lloyd Austin confirms U . S . paused Israel weapons shipment", "date": "2024-05-09 05:00", "url": "https://www.upi.com/Top_News/US/2024/05/08/Lloyd-Austin-confirms-Israel-weapons-pause/5831715220954/", "message": "Defense Secretary Lloyd Austin testifies during a Senate Appropriations Subcommittee on Defense hearing on the Department of Defenses' fiscal year 2025 budget request at the U.S. Capitol in Washington, D.C., on Wednesday.\nPhoto by Bonnie Cash/UPI | License PhotoMay 8 (UPI) -- Secretary of Defense Lloyd Austin confirmed Wednesday that the United States has paused sending a shipment of bombs to Israel over concerns of its impending ground invasion of the southern Gaza city of Rafah.\nResponding to Republican questions about the reports on the matter during a Senate Appropriations Committee hearing on the 2025 Defense budget, Austin reiterated that the United States' commitment to Israel's defense is \"ironclad\" and that the paused shipment of weapons was for re-evaluation.\nHowever, the United States, along with other nations and the United Nations, has now openly voiced opposition to the ground campaign, warning that it could equal a humanitarian catastrophe.\n\"So, it is not only a moral imperative, but it is also a strategic imperative that you protect civilians, and the two are not mutually exclusive."}, {"id": "334a8d0c-febc-4107-ab28-a74c05870edf", "title": "The Latest | Rafah hospitals will run out of fuel in 3 days , WHO says", "date": "2024-05-09 08:45", "url": "https://abcnews.go.com/International/wireStory/latest-rafahs-hospitals-run-fuel-3-days-110059249", "message": "Since then, more than 350 people have been killed in Lebanon, including 275 Hezbollah members and more than 70 civilians and non-combatants.\nIt then sent tanks to seize the nearby Rafah crossing with Egypt, shutting it down.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight Tuesday, including two large blasts early Wednesday.\nIn Lebanon, more than 370 people have been killed by Israeli strikes, including more than 70 civilians and non-combatants.\nAll three countries have been involved in months of talks aimed at halting the seven-month war between Israel and Hamas."}, {"id": "feb70adf-1067-479c-8866-1f6f2e0b8394", "title": "Israel says Hamas naval commander killed in Gaza strike", "date": "2024-05-09 06:15", "url": "https://www.bssnews.net/news/188010", "message": "JERUSALEM, May 9, 2024 (BSS/AFP) - The Israeli military said Wednesday arecent air strike had killed the commander of Hamas's naval unit in GazaCity, accusing of \"attacks\" against troops during the seven-month war.\nMohammed Ahmed Ali was killed in an air strike \"in the past day\", themilitary said in a statement.\nHamas's armed wing has been engaged in fierce battles with Israeli forcesacross the Gaza Strip since war erupted on October 7 following thePalestinian group's attack on southern Israel.\nAl-Qassam Brigades regularly launch rockets towards Israeli territory, andclaimed a barrage on Sunday at the Kerem Shalom crossing between Israel andGaza that killed four soldiers.\nIsrael's retaliatory military offensive in Gaza has killed at least 34,844people, most of them women and children, according to the Hamas-runterritory's health ministry."}, {"id": "bf2f0e5c-c21a-431b-9914-7c3fbf99b811", "title": "Rafah : Israeli military operations expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 02:00", "url": "https://us.cnn.com/2024/05/08/middleeast/rafah-israel-idf-ground-operation-intl-latam/", "message": "CNN —Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nPalestinians arrive at Al Kuwaiti Hospital in Rafah, Gaza, after Israeli air strikes on May 8.\nPlanet Labs, PBC Satellite images from May 6 and May 7 show damage in Rafah, Gaza.\nPlanet Labs, PBC Satellite images show Rafah, Gaza, before and during an airstrike."}, {"id": "5dd66e9f-2563-4da7-93da-e2160c880ed4", "title": "Trump to send  assassination squad to Mexico to wipe out drug cartels : Report", "date": "2024-05-09 07:30", "url": "https://timesofindia.indiatimes.com/world/us/trump-to-send-assassination-squads-to-mexico-to-wipe-out-drug-cartels-report/articleshow/109967026.cms", "message": "NEW DELHI: US President Donald Trump has vowed to send \" assassination squads \" to wipe out drug cartel leaders from Mexico if re-elected in the upcoming Presidential elections, according to a Rolling Stone report .According to report, the Republican presidential nominee told three of his associates that the US military has \"tougher killers\" that can be used to \"wage war\" on Mexico's drug cartels in the midst of the country's rising fentanyl problem .Calling out for a strike similar to the execution of ISIS leader Abu Bakr al-Baghdadi by the US military in 2019, Trump broached the notion of deploying special operations troops to carry out assassinations in Mexico's most notorious drug gangs, with or without the government's permission.Trump, according to the report, advised an ally that the US government should develop a \"kill list of drug lords\" that special forces might use to target or seize.Questioning the US government for not carrying out such strikes before, Trump said that removing cartel heads would strike fear in the hearts of \"the kingpins\" and cripple their drug operations.Trump has publicly promised to \"make appropriate use of Special Forces, cyber warfare, and other overt and covert actions to inflict maximum damage on cartel leadership, infrastructure, and operations\" if he returns to the White House.No specifics has been disclosed so far about the plans, such as how many such squads or troops would be sent to Mexico or level of cooperation with the Mexican government."}, {"id": "35ff9767-0d06-4eef-983b-6a1347a1abb1", "title": "China & Serbia Form Partnership After Depraved CIA Attack in Belgrade", "date": "2024-05-09 01:45", "url": "https://sputnikglobe.com/20240508/china--serbia-form-partnership-after-depraved-cia-attack-in-belgrade-1118343031.html", "message": "https://sputnikglobe.com/20240508/china--serbia-form-partnership-after-depraved-cia-attack-in-belgrade-1118343031.htmlChina & Serbia Form Partnership After Depraved CIA Attack in BelgradeChina & Serbia Form Partnership After Depraved CIA Attack in BelgradeSputnik InternationalThe two countries have grown closer after the twin tragedies of neoliberal deindustrialization and NATO’s attack on the Chinese embassy in Belgrade.\nAnd nobody prosecuted anybody for war crimes.”NATO’s attack on the former Yugoslavia, conducted after the UN Security Council’s rejection of the proposal, was illegal under international law.\nPreviously, the organization had acted more covertly, supporting efforts such as the CIA’s Operation Gladio which backed neo-Nazi paramilitary groups throughout Europe.\nMilitary secret services (or uncontrolled branches thereof) were involved in serious cases of terrorism and crime.\nThe phenomenon led to the loss of thousands of jobs and deindustrialization throughout Eastern Europe, with devastating consequences."}, {"id": "582627e0-02e1-49cd-952c-cd7a8b86be17", "title": "HYD : IDF Soldier Killed In Hezbollah Attack In Northern Israel – The Yeshiva World", "date": "2024-05-09 04:45", "url": "https://www.theyeshivaworld.com/news/israel-news/2282048/hyd-idf-soldier-killed-in-hezbollah-attack-in-northern-israel.html", "message": "The IDF announces that a soldier was killed in a Hezbollah mortar and missile attack on an army position near the northern community of Malkia on Wednesday.\nHaim Sabach HY’D, 20, from Holon, serving in the Border Defense Corps’ 869th Combat Intelligence Collection Unit.\nAdditionally, the IDF reports that another soldier sustained light injuries in the attack.\nHis death increased the total number of IDF soldiers killed since October 7th to 615.\nA total of 14 IDF troops were killed in attacks on the Lebanon border since October 8."}, {"id": "4d113a8c-2016-4bc4-b456-1f3eb90bfafc", "title": "Israeli strike on car in Baflay - Tyre kills four", "date": "2024-05-09 08:45", "url": "https://www.naharnet.com:443/stories/en/305069-israeli-strike-on-car-in-baflay-tyre-kills-four", "message": "A Lebanese security source said four Hezbollah members were killed in an Israeli strike on a vehicle in the country's south, the latest such raid in months of cross-border hostilities.\nThe civil defense reported \"four martyrs\" in an \"Israeli air strike\" on the main road in Baflay, adding that teams worked to put out the fire that erupted in the vehicle.\nThe Israeli army said fighter jets struck Hezbollah military structures in southern Lebanon on Wednesday in response.\nFive people including two Hezbollah fighters were killed Wednesday in an Israeli air strike on the border town of Odaisseh, a Lebanese security source said, with the Islamic Jihad Palestinian militant group reporting three fatalities among its ranks.\nOn Wednesday a Lebanese official said Israeli bombardment of south Lebanon since the start of the Israel-Hamas war has caused more than $1.5 billion in damage."}, {"id": "3d5e9ae2-9e88-47ef-a77a-4cccc1b672af", "title": "US determined to work with Pakistan to combat terrorism : State Dept spox", "date": "2024-05-09 03:30", "url": "https://dunyanews.tv/en/Pakistan/810403-US-determined-to-work-with-Pakistan-to-combat-terrorism:-State-Dept-spox", "message": "US determined to work with Pakistan to combat terrorism: State Dept spoxPakistan Pakistan US determined to work with Pakistan to combat terrorism: State Dept spoxMatthew Miller said that Pakistan has suffered greatly at the hands of terrorists.\nFollow on Updated On: Thu, 09 May 2024 07:55:32 PKTWASHINGTON (Dunya News) - US State Department spokesperson Matthew Miller said that the United States determined to work with Pakistan to combat terrorism, Dunya News reported.\nBriefing the media in Washington on Wednesday, Matthew Miller said that US remain committed to working with Pakistan to address the shared threat posed by terrorist groups throughout the region.\nMatthew Miller said that Pakistan has suffered greatly at the hands of terrorists, and we regret the loss of life and injuries sustained and offer our heart-felt condolences to those affected by these attacks.\nThose matters are for the government of Pakistan to decide.”"}, {"id": "88be0463-0204-4bd1-8e4a-ae288a03d115", "title": "RIGHT SPEAK : RU Proxy Reports ATACMS Hit On Luhansk Oil Depot ; Why UKR Should Keep Striking RU Oil Refineries ; UKR Launches Devastating Wave of Pinpoint Drone Strikes ; RU Unlikely to Capture Chasiv Yar by Target Date ; 120 C - Clashes on 7 Fronts...", "date": "2024-05-09 09:15", "url": "http://www.rightspeak.net/2024/05/ru-proxy-reports-atacms-hit-on-luhansk.html", "message": "Blog Archive: May 2024 (44) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "7917e61a-82f0-46f5-888d-c7f71c1e2c8b", "title": "Jammu & Kashmir : Three Terrorists Killed In Encounter In Kulgam , 40 - Hour Long Operation Concludes , Says Indian Army", "date": "2024-05-09 07:15", "url": "https://menafn.com/1108191858/Jammu-Kashmir-Three-Terrorists-Killed-In-Encounter-In-Kulgam-40-Hour-Long-Operation-Concludes-Says-Indian-Army", "message": "(MENAFN- Live Mint) \"The Indian Army on Thursday said that three terrorists were killed in an encounter with the security forces in the Redwani Payeen area of Kulgam in Jammu and Kashmir Army said that the operation which started on the intervening night of May 6-7, ended after a relentless vigil of approximately 40 hours.\\\"A Joint Operation, that commenced on the intervening night of 6-7 May in general area Redwani Payeen, Kulgam, has been concluded after a relentless vigil of approximately 40 hours.\n3 terrorists have been eliminated along with recovery of war-like stores, inflicting yet another hit on the terror ecosystem,\\\" said Chinar Corps, Indian Army, in a post on X,formerly Twitter.\\\"The Chinar Corps remains committed to maintaining peace and tranquility in Kashmir,\\\" it added Read: IAF Convoy Attack Highlights: 1 soldier killed after terrorist attack IAF convoy in J&K's Poonch; search onOn Tuesday, two terrorists, including wanted terrorist of Lashkar-e-Toiba Basit Dar, were killed in an encounter in the area.\nCheck-points were also set-up at several main roads Read: Pakistan rakes up Kashmir issue with Iran in meet to repair strained ties months after airstrikesOne IAF officer, Vikky Pahade, was killed and four others injured after their convoy was targeted.\nThe injured personnel were evacuated to Udhampur for treatment on IAF choppers's last rites were performed on Monday at his native place in Chhindwara, Madhya Pradesh, with full military honours.\nMENAFN09052024007365015876ID1108191858"}, {"id": "0014307d-4ea3-461c-bf92-7440bc0d70d9", "title": "Russia claims 8 injured in Ukrainian air strike on Belgorod Oblast", "date": "2024-05-09 08:45", "url": "https://www.yahoo.com/news/russia-claims-8-injured-ukrainian-074433310.html", "message": "A Ukrainian air strike on Russia's Belgorod Oblast injured eight people on May 9, Belgorod Oblast Governor Vyacheslav Gladkov claimed.\nBelgorod Oblast borders Ukraine's Sumy, Kharkiv, and Luhansk oblasts.\nRussia reportedly often uses Belgorod Oblast as a launching ground for cross-border missile strikes against Ukraine.\nRead also: Russia claims 6 killed, 35 injured in drone attack on Belgorod OblastWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.\nConsider supporting the Kyiv Independent."}, {"id": "6592fe27-c0d7-482b-a4d2-36509475a30b", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 04:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/08/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show/", "message": "(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "5ef8fa45-7ffe-438a-b9bf-97cfcc60ee72", "title": "How Nixon Invasion of Cambodia Triggered a Check on Presidential Power", "date": "2024-05-09 08:45", "url": "https://www.history.com/news/nixon-war-powers-act-vietnam-war-cambodia", "message": "By November 1973, the criticism had culminated in the passage of the War Powers Act.\nDid the War Powers Act Work?\n“Indeed, presidents have almost dared Congress to do something about the lack of respect they've shown to the War Powers Act.\nYet in 2008, a bipartisan movement to repeal the War Powers Act did not succeed.\n“In the power of the purse, Congress already has the power it needs to regulate presidential war plans,” says Logevall."}, {"id": "c36fcb3f-f849-41b3-8f30-2f17bc2cd7e2", "title": "Seven killed in terrorist attack in Pakistan : Police", "date": "2024-05-09 08:45", "url": "https://www.prokerala.com/news/articles/a1529595.html", "message": "Islamabad, May 9 : Gunmen in southwestern Pakistan executed at least seven people in their sleep, in what police on Thursday said was the second incident of ethnic terrorism in the same region within a month.\nThe attack occurred in the volatile coastal town of Gwadar where Pakistan's political ally China is building a deep-sea port, a project opposed by the West and locals alike.\nIt was the second incident targeting people from Punjab in the militancy-infested province of Balochistan in around three weeks.\nNo group has so far claimed responsibility for Thursday's attack, but police said they suspect the BLA.\nBaloch militant and political groups accuse China of stealing their land and resources including several hundred kilometres of shores."}, {"id": "50c99120-03eb-4f51-a2ba-9ee6b2aea69e", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 03:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/05/08/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show/", "message": "By Paul P. Murphy, Abeer Salman and Andrew Raine, CNN(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "bd4ca613-cfc2-41f8-be82-a18ff0839bbc", "title": "The working class must take up the fight against the genocide in Gaza and in defense of democratic rights", "date": "2024-05-09 09:00", "url": "https://www.wsws.org/en/articles/2024/05/09/pers-m09.html", "message": "The escalating global crackdown on the student protests raises the need for the working class to intervene against war and police dictatorship.\nThe working class must enter the fight against imperialist war.\nThe ruling class is so terrified of the peaceful student protests because they know it can arouse the working class.\nThe entire UAW membership must demand strike action, as the starting point of a broader counter-offensive by the entire working class.\nThe student movement anticipates a deeper revolutionary movement in the working class."}, {"id": "449feb67-dcc7-4b74-ad59-12d09424dec2", "title": "First Faculty - Led Pro - Palestinian Encampment Erected at The New School", "date": "2024-05-09 04:15", "url": "https://www.newsmax.com/us/protests-israel-gaza/2024/05/08/id/1164008/", "message": "In solidarity with their student activists, professors at The New School in New York City on Wednesday erected the first faculty-led pro-Palestinian encampment in the United States.\nRather than find the traditional quad or open-air space to build their tent city, the faculty chose a lobby in one of the school buildings.\nThe faculty have named their encampment the Refaat Alareer Faculty Solidarity Encampment, after a well-known writer and professor who was killed in an Israeli airstrike in December.\nLast week, the New York Police Department arrested 43 people at The New School when they responded to school requests to remove encampments.\n\"This is the first faculty-led encampment in the U.S. We hope it will not be the last."}, {"id": "59a83cf5-6e4d-47c4-a71d-6744a7034fba", "title": "BAE Systems Backs Guidance as Defense Spending Remains High 2nd Update", "date": "2024-05-09 08:45", "url": "https://www.morningstar.com/news/dow-jones/202405093105/bae-systems-backs-guidance-as-defense-spending-remains-high-2nd-update", "message": "The U.K. arms maker said on Thursday that its performance so far this year was in line with expectations, with defense spending remaining high in its key markets.\nChief Executive Charles Woodburn said the group expected sales growth, margin expansion and cash generation in the coming years.\nBAE Systems makes combat vehicles, ammunition, missile launchers and artillery systems, including the M777 howitzer that Ukraine has employed widely in its fight against Russia.\nIn March, BAE Systems received two U.S. army contracts: one valued at $754 million to produce armored multipurpose vehicles, and another of up to $318 million for technical and support services for M109 Self-Propelled Howitzers.\nBAE expects capital expenditure to rise this year, with a focus on maritime, munitions and combat vehicle production capacity."}, {"id": "bff65b9d-a285-42f7-b353-d39456d1d2be", "title": "Jammu & Kashmir : Three terrorists killed in encounter in Kulgam , 40 - hour long operation concludes , says Indian Army", "date": "2024-05-09 05:15", "url": "https://www.livemint.com/news/india/jammu-and-kashmir-terrorists-encounter-kulgam-indian-army-chinar-corps-11715227673897.html", "message": "The Indian Army on Thursday said that three terrorists were killed in an encounter with the security forces in the Redwani Payeen area of Kulgam in Jammu and Kashmir.\nThe Army said that the operation which started on the intervening night of May 6-7, ended after a relentless vigil of approximately 40 hours.\n\"A Joint Operation, that commenced on the intervening night of 6-7 May in general area Redwani Payeen, Kulgam, has been concluded after a relentless vigil of approximately 40 hours.\nAlso Read: IAF Convoy Attack Highlights: 1 soldier killed after terrorist attack IAF convoy in J&K's Poonch; search onOn Tuesday, two terrorists, including wanted terrorist of Lashkar-e-Toiba Basit Dar, were killed in an encounter in the area.\nThe third terrorist was killed in the Redwani Payeen area on Wednesday."}, {"id": "d5184b21-d3ba-4722-b8e0-bcd0093e1f95", "title": "Explained | Israel limited military operation in Rafah", "date": "2024-05-09 04:45", "url": "https://www.thehindu.com/news/international/rafah-israel-military-operation-invasion-explainer-gaza-palestine-netanyahu/article68150206.ece", "message": "Israeli tanks moved into the southern part of the city overnight, while warplanes bombed areas near the crucial Rafah border crossing, killing at least 23 Palestinians and injuring several others.\nThe military operation in Rafah: what, why and howIsrael ordered the Rafah evacuation after four of its soldiers were killed in a rocket attack claimed by the Hamas armed wing near Rafah on May 5.\nSoon after, the Israel Defence Forces (IDF) launched a “precise counterterrorism operation to eliminate Hamas terrorists and infrastructure” in eastern Rafah.\nThe Rafah crossing has been a lifeline for hundreds of thousands of people caught in the conflict.\nThe displaced Palestinians and residents, living in densely packed camps and apartments in Rafah, are entirely dependent on international aid for food and basic supplies arriving in Gaza from the Rafah border crossing."}, {"id": "5263965a-72ca-4c9f-ae6c-d97ec6b3d63f", "title": "Seven workers killed in terrorist attack in Gwadar port : police", "date": "2024-05-09 07:45", "url": "https://www.thehindu.com/news/international/seven-workers-killed-in-terrorist-attack-in-gwadar-port-police/article68156556.ece", "message": "At least seven workers were killed in a terrorist attack by unknown gunmen on May 9 in Pakistan's port city of Gwadar in the restive Balochistan province.\nAccording to Gwadar Police Station Station House Officer (SHO) Mohsin Ali, unidentified gunmen opened fire on a residential quarter near the Gwadar Fish Harbour in the Surbandar area, leaving seven dead and one injured, Geo News reported.\nBalochistan Chief Minister Sarfraz Bugti condemned the killing of the workers in Gwadar.\nThe Minister said the killing of workers is a cowardly move, terrorists will be dealt with strictly.\nSimilarly, on March 20, security forces acted swiftly and foiled a fierce attack after a group of gunmen stormed the Gwadar Port Authority (GPA) colony."}, {"id": "c0a4e235-4470-470d-8434-8df3a917f9d6", "title": "Lebanon security source says 4 Hezbollah dead in Israeli strike", "date": "2024-05-09 09:30", "url": "https://www.news18.com/world/lebanon-security-source-says-4-hezbollah-dead-in-israeli-strike-8883947.html", "message": "A Lebanese security source said four Hezbollah members were killed in an Israeli strike on a vehicle in the country’s south, the latest such raid in months of cross-border hostilities.\nThe Lebanese security source, requesting anonymity as they were not authorised to speak to the media, said that “four Hezbollah fighters were killed in an Israeli drone strike on their vehicle in Bafliyeh”, about 15 kilometres (10 miles) from the frontier.\nLebanon’s official National News Agency reported at least one dead in a strike on the same road, which it attributed to “enemy aircraft”.\nIsrael says 14 soldiers and nine civilians have been killed on its side of the border, including one on Wednesday.\nThree Israeli soldiers have been reported killed in north Lebanon this week."}, {"id": "8e58536c-9d5e-48fa-a1ca-d324431732b4", "title": "Trump Plans To Send  Kill Squads  To Take Out Mexican Cartel Heads : Report", "date": "2024-05-09 05:15", "url": "https://www.ndtv.com/world-news/trump-plans-to-send-kill-squads-to-take-out-mexican-cartel-heads-report-5621777", "message": "Trump also told an ally that the US government should have a \"kill list of drug lords\".\nIf re-elected, former US president Donald Trump has vowed to send \"assassination squads\" of US special forces into Mexico to take out the heads of drug cartels, according to a report.\nTrump also told an ally that the US government should have a “kill list of drug lords” that the US special forces should use to assign troops to kill or capture.\nTrump has publicly vowed to “make appropriate use of Special Forces, cyber warfare, and other overt and covert actions to inflict maximum damage on cartel leadership, infrastructure, and operations\" if he returns to the White House.\nThe proposal has been denounced by the Mexican president who called it “an offence to the people of Mexico”."}, {"id": "03d6d7af-2dbe-42fb-b648-b27883f5823c", "title": "17 - year - old girl dies after stabbing near Queens subway station : NYPD", "date": "2024-05-09 08:45", "url": "https://www.yahoo.com/news/17-old-girl-dies-stabbing-032429792.html", "message": "NEW YORK - A 17-year-old girl has died after a stabbing that occurred not far from a subway station in Queens, police say.\nThe incident happened at Queens Boulevard and 46th Street in Sunnyside, near the 46th Street-Bliss subway station.\nRELATED: SoHo shooting: NYC 16-year-old killed by attacker on bike ID'edAuthorities say the victim was stabbed in the neck.\nShe was rushed to Elmhurst Hospital, where she was pronounced dead.\nPolice say they are searching for a female suspect wearing a pink shirt, black shorts, and white sneakers who possibly fled aboard a northbound 7 train."}, {"id": "23c78093-db2a-47e0-ac9b-e9582bbeceff", "title": "Lebanon security source says five killed in Israeli strikes on south", "date": "2024-05-09 03:30", "url": "https://dunyanews.tv/en/World/810385-Lebanon-security-source-says-five-killed-in-Israeli-strikes-on-south", "message": "Lebanon security source says five killed in Israeli strikes on southWorld World Lebanon security source says five killed in Israeli strikes on southA Lebanese security source said five people were killed Wednesday in Israeli strikes.\nFollow on Published On: Thu, 09 May 2024 06:17:33 PKTBEIRUT (AFP) – A Lebanese security source said five people including two Hezbollah fighters were killed Wednesday in Israeli strikes on southern Lebanon, with a Palestinian armed group reporting three fatalities among its ranks.\nAccording to the Lebanese security source, \"two Hezbollah fighters\" were killed in an Israeli air strike on the border town of Adaisseh.\nA separate strike on the village of Khiam Wednesday killed three people who were likely \"Palestinian combatants\", the Lebanese source said.\nThe Israeli military said its \"fighter jets struck military structures... in the areas of Khiam, Adaisseh\" and other southern Lebanon towns."}, {"id": "fe517862-cbdb-4c62-a210-15f784681756", "title": "Russia Pro - Putin Elites | Foreign Affairs", "date": "2024-05-09 05:15", "url": "https://www.foreignaffairs.com/russia/russias-pro-putin-elites", "message": "Rather than fragmenting, Russia’s elites are becoming increasingly bellicose and marching in lockstep with the regime.\nThe conflict with Ukraine and, more broadly, the existential confrontation with the West have profoundly reinforced a sense of tunnel vision among the Russian elites.\nMany within Russia’s elites readily blur the distinctions between Islamist terrorists, Ukrainians, and Americans, viewing them as components of a world system defined by its hostility to Russia.\nThe exact nature of that victory remains vague in the minds of Russian elites, who instead seem to find more safety in Russia’s posture of aggression alone.\nFOREVER WARAmong Russian elites, the prevailing belief is that only a military defeat or a prolonged, severe financial crisis could halt their country’s momentum."}, {"id": "9ce16ca5-846a-4963-b425-743df8e86730", "title": "Hamas naval commander killed in Gaza : Israeli army", "date": "2024-05-09 03:15", "url": "https://www.prokerala.com/news/articles/a1529504.html", "message": "Israel-Hamas war: Egyptian officials in Tel Aviv to iron out ceasefire bottlenecks.\nImage Source: IANS NewsJerusalem, May 9 : Commander of Hamas' naval unit in Gaza City, Ahmed Ali, was assassinated in an Israeli airstrike, Israel Defense Forces (IDF) has announced in a statement.\nIDF and Shin Bet security agency said on Wednesday that an attack drone killed Ali in the Palestinian enclave, Xinhua news agency reported.\n\"Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip,\" according to the statement.\nDuring Israel's seven-month onslaught in Gaza, Ali was responsible for attacks on Israel and against ground troops operating in the Gaza Strip."}, {"id": "0cf3c963-ac24-4912-84c9-6eed3d870764", "title": "Hamas naval commander killed in Gaza : Israeli army", "date": "2024-05-09 07:00", "url": "https://www.thestatesman.com/world/hamas-naval-commander-killed-in-gaza-israeli-army-1503298594.html", "message": "Commander of Hamas’ naval unit in Gaza City, Ahmed Ali, was assassinated in an Israeli airstrike, Israel Defense Forces (IDF) has announced in a statement.\nIDF and Shin Bet security agency said on Wednesday that an attack drone killed Ali in the Palestinian enclave, Xinhua news agency reported.\n“Over the last few years, Ali has been involved in managing projects of Hamas’ Naval Unit in the Gaza Strip,” according to the statement.\nAdvertisementDuring Israel’s seven-month onslaught in Gaza, Ali was responsible for attacks on Israel and against ground troops operating in the Gaza Strip."}, {"id": "bda6dbd5-0996-4c09-8ea8-d64c5d00d7b5", "title": "Hamas Naval Commander Killed In Gaza : Israeli Army", "date": "2024-05-09 02:00", "url": "https://menafn.com/1108191304/Hamas-Naval-Commander-Killed-In-Gaza-Israeli-Army", "message": "(MENAFN- IANS) Jerusalem, May 9 (IANS) Commander of Hamas' naval unit in Gaza City, Ahmed Ali, was assassinated in an Israeli airstrike, Israel Defense Forces (IDF) has announced in a statement.\nIDF and Shin Bet security agency said on Wednesday that an attack drone killed Ali in the Palestinian enclave, Xinhua news agency reported.\n\"Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip,\" according to the statement.\nDuring Israel's seven-month onslaught in Gaza, Ali was responsible for attacks on Israel and against ground troops operating in the Gaza Strip."}, {"id": "4ba341e9-fdfc-475b-b272-a45bc9c30131", "title": "An Italian artist is attempting to recreate Picasso  Guernica  in less than a fortnight", "date": "2024-05-09 07:45", "url": "https://www.euronews.com/culture/2024/05/09/an-italian-artist-is-attempting-to-recreate-picassos-guernica-in-less-than-a-fortnight", "message": "By Christian MooreItalian artist Ercole Pignatelli is attempting to recreate Picasso's Guernica in front of a live audience in only 12 days.\nAn artist bears witnessObserving these events unfold in the press from his studio in Paris, the Spanish artist Pablo Picasso could already foresee, perhaps, this gathering ubiquity, this newly everyday terror of violence.\nIn the years since, Picasso’s Guernica has become an immovable waystone in the history of anti-war art, its reach of influence singularly wide.\nBut seven decades after the original left Milan, another Guernica now is taking shape again in the Palazzo Reale’s Caryatids Hall.\nHis 3.49 x 7.77 metre canvas has been set up in the Caryatids Hall opposite an equally sized copy of Picasso’s Guernica for him to draw and paint in dialogue with."}, {"id": "7e70af03-2f06-4c1d-87c0-f6bf2878100b", "title": "At least seven barbershop workers shot dead in Gwadar", "date": "2024-05-09 08:45", "url": "https://tribune.com.pk/story/2465794/at-least-seven-barbershop-workers-shot-dead-in-gwadar", "message": "At least seven barbershop workers were shot dead in Gwadar on Thursday after unidentified assailants broke into a residential quarter near Fish Harbour Jetty in the Sardar Bandar area and opened indiscriminate fire.\nFollowing the incident, the casualties were shifted to Gwadar Hospital and law enforcement started an investigation into the attack.\nRead Two confectionery shop workers killedCondemnationsPrime Minister Shehbaz Sharif strongly condemned the brutal attack in Gwadar.\nProvincial Interior Minister Mir Ziaullah Langau also condemned the Gwadar incident and called for accountability.\nEarlier on April 13, nine would-be economic migrants from Punjab were shot dead in the Noshki district of Balochistan."}, {"id": "35586c8e-c91c-45aa-af54-6563f9c4fe00", "title": "Canadian Parliament unanimously approves motion to blacklist IRGC", "date": "2024-05-09 06:00", "url": "http://www.israelnationalnews.com/news/389657", "message": "Canada’s House of Commons on Wednesday voted unanimously in support of a motion to add Iran's Revolutionary Guard Corps to an official list of terrorist organizations, CBC reported.\nThe motion came from a House justice committee report that, among other things, called on the government to designate the IRGC as a terrorist entity in Canada.\nThe Canadian government has been facing mounting pressure to declare the IRGC a terrorist group under the Criminal Code.\nFamilies of the victims of Flight PS752 have been calling on the government to list the IRGC as a terrorist organization for years.\nThe Liberals also voted in favor of a similar motion in 2018, noted CBC."}, {"id": "4a078778-f8c6-45ba-a05b-df9184d22f6a", "title": "New tech means defense outweighs offense , says Army Futures Command chief", "date": "2024-05-09 02:00", "url": "https://www.defenseone.com/technology/2024/05/new-tech-means-defense-outweighs-offense-says-army-futures-command-chief/396422/", "message": "New battlefield technologies mean that the defense is “dramatically” stronger than the offensive, Army Futures Command head Gen. James Rainey told reporters today.\nThis may mean Army units need to start using their tanks and infantry primarily to serve the needs of longer-range weapons such as artillery or rockets, Rainey added.\nArmy doctrine more typically has emphasized using long-range weapons to help armored and infantry units launch aggressive, fast-paced strikes that collapse enemy lines.\n“You're going to have to really put the work in to make sure you're successful.”Rainey advocated for weapons similar to those advocated by Zaluzhnyi: more unmanned systems, long-range weapons, and better command and control.\n‘I'm very interested in heavy lift unmanned systems,” Rainey said."}, {"id": "b2c53e99-110a-4edb-a7c8-d3245943ede7", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:00", "url": "https://www.yahoo.com/news/yemens-houthi-rebels-claim-2-063355081.html", "message": "(AP Photo)JERUSALEM (AP) — Yemen's Houthi rebels on Thursday claimed responsibility for two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage.\nMeanwhile, an adviser to Iran's supreme leader again threatened that Tehran could build a nuclear weapon if it chose to pursue atomic armaments.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA.\nThe Iranian city of Isfahan then apparently came under Israeli fire in recent weeks, despite being surrounded by sensitive nuclear sites."}, {"id": "5be314f9-f2d9-402c-8571-143dc1e35a7e", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:30", "url": "https://finance.yahoo.com/news/yemens-houthi-rebels-claim-2-063355415.html", "message": "JERUSALEM (AP) — Yemen's Houthi rebels on Thursday claimed responsibility for two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA.\nTehran launched a drone-and-missile attack on Israel last month after Israel’s apparent attack on an Iranian consular building in Syria killed two Iranian generals and others.\nThe Iranian city of Isfahan then apparently came under Israeli fire in recent weeks, despite being surrounded by sensitive nuclear sites."}, {"id": "ddffe809-f5db-45a5-ad0e-dbea874a6ed6", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:45", "url": "https://abcnews.go.com/International/wireStory/yemens-houthi-rebels-claim-2-attacks-gulf-aden-110057215", "message": "Meanwhile, an adviser to Iran's supreme leader again threatened that Tehran could build a nuclear weapon if it chose to pursue atomic armaments.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA.\nTehran launched a drone-and-missile attack on Israel last month after Israel’s apparent attack on an Iranian consular building in Syria killed two Iranian generals and others.\nThe Iranian city of Isfahan then apparently came under Israeli fire in recent weeks, despite being surrounded by sensitive nuclear sites."}, {"id": "44c53ab4-0268-476f-bea1-19cbdbc1c8da", "title": "Why the US is stopping some bomb shipments to Israel", "date": "2024-05-09 04:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/216195/Why-the-US-is-stopping-some-bomb-shipments-to-Israel", "message": "Washington paused one shipment consisting of 1,800 2,000-pound (907-kg) bombs and 1,700 500-pound bombs, according to U.S. officials.\nThey were part of an earlier approved shipment to Israel, not the recent $95 billion supplemental aid package the U.S. Congress passed in April.\nWHAT KIND OF DAMAGE CAN 2,000-POUND BOMBS CAUSE?\nLarge bombs like 2,000-pound bombs have an impact over a wide area.\nPresident Ronald Reagan imposed a six-year ban on cluster weapons sales to Israel after a Congressional investigation found that Israel had used them in populated areas during its 1982 invasion of Lebanon."}, {"id": "0940a881-0a3e-42f7-92cf-1d79c95e8c6c", "title": "Yemen Houthi Rebels Claim 2 Attacks in Gulf of Aden , Another Unreported in Indian Ocean", "date": "2024-05-09 09:30", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthi-shipping-attacks-israel-hamas-war/2024/05/09/id/1164016/", "message": "JERUSALEM (AP) — Yemen's Houthi rebels on Thursday claimed two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage, while also saying they targeted a ship in the Indian Ocean in a previously unreported assault.\nSaree in a prerecorded statement claimed attacks on the MSC Diego and MSC Gina.\nHe also claimed the Houthis targeted the MSC Vittoria, another container ship, in the Indian Ocean.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat."}, {"id": "b3048738-51af-4c63-8f73-689774a87ea9", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:30", "url": "https://www.clickondetroit.com/news/world/2024/05/09/yemens-houthi-rebels-claim-2-attacks-in-gulf-of-aden-another-unreported-in-indian-ocean/", "message": "(AP Photo)JERUSALEM – Yemen's Houthi rebels on Thursday claimed responsibility for two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage.\nMeanwhile, an adviser to Iran's supreme leader again threatened that Tehran could build a nuclear weapon if it chose to pursue atomic armaments.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA.\nThe Iranian city of Isfahan then apparently came under Israeli fire in recent weeks, despite being surrounded by sensitive nuclear sites."}, {"id": "d1ceecd4-c061-4e89-9b24-fa3d71005833", "title": "ISW analyses goals of Russia latest large - scale attacks on Ukraine", "date": "2024-05-09 07:30", "url": "https://www.yahoo.com/news/isw-analyses-goals-russias-latest-025426171.html", "message": "Experts at the Institute for the Study of War (ISW) believe that the latest Russian strikes are intended to degrade Ukraine's power grid and depleted air defences before the arrival of US security assistance.\nAnalysts note that this is the fifth large-scale Russian missile and drone strike on Ukrainian energy infrastructure since 22 March 2024.\nRussian forces continue to aggressively attack Ukrainian energy facilities with a limited series of large-scale missile and drone strikes, signalling that Russia is prioritising efforts to disrupt the power grid.\nArmenia's efforts to distance itself from Russia are increasingly forcing the Kremlin to acknowledge issues in the bilateral relationship.\nRussian Defence Minister Sergei Shoigu continues to highlight Russian formations involved in Russia’s invasion of Ukraine."}, {"id": "315f2856-4f43-4090-89ee-eecd72000f4c", "title": "Ukraine - Russia war live : Putin addressing the victory day parade", "date": "2024-05-09 09:15", "url": "https://www.telegraph.co.uk/world-news/2024/05/09/ukraine-russia-war-latest-news/", "message": "Russian President Vladimir Putin said today that there was nothing unusual in a planned exercise involving the practice deployment of tactical nuclear weapons, according to Russian news agencies.\n“There is nothing unusual here, this is planned work,” Putin said.\nHe met officers from what the Kremlin calls its special military operation in Ukraine on May 7.\nRussia said on Monday it would practise the deployment of tactical nuclear weapons as part of a military exercise after what Moscow said were threats from France, Britain and the United States."}, {"id": "cce1fc3e-258a-4d91-a109-affb2ff9f460", "title": "Pakistan Terror Attack : 7 Workers Killed , 1 Injured In Gwadar Firing", "date": "2024-05-09 07:15", "url": "https://www.freepressjournal.in/world/pakistan-terror-attack-7-workers-killed-1-injured-in-gwadar-firing", "message": "Representational ImageGwadar: Seven workers from Pakistan's Punjab were killed and another one was injured in a terrorist attack in the early hours of Wednesday night, ARY News reported, citing police.\nSeven people, who were sleeping, were killed and another one sustained injuries in the firing.\nRead Also Pakistan Couple Engaged In Alleged Visa Fraud & Human Trafficking Activities Arrested In LahoreAccording to ARY News, seven injured policemen were transferred to Taunsa Sharif THQ hospital for medical assistance.\nThe Punjab Police spokesperson confirmed an attempted terrorist attack on the Jhangi checkpoint.\nUpon receiving intelligence about the terrorist assault, law enforcement agencies promptly arrived at the scene and secured the area."}, {"id": "c44bb42e-0a37-4d30-8df1-c2f9e002071a", "title": "US Army Awards $861M Missile Launcher Deal | Lockheed Martin", "date": "2024-05-09 05:15", "url": "https://www.americanmachinist.com/news/article/55038461/us-army-awards-861m-missile-launcher-deal-lockheed-martin", "message": "Lockheed Martin Corp. has drawn a new U.S. Army contract worth $861 million to manufacture High Mobility Artillery Rocket Systems and provide related services over a five-year period.\nHIMARS is a lightweight mobile launcher that fires a range of ballistic weapons: Guided Multiple Launch Rocket System (GMLRS) rockets, Army Tactical Missile System (ATACMS) missiles, the next-generation Precision Strike Missile (PrSM), and Extended-Range GMLRS rockets.\nThe system is transportable via C-130 and larger aircraft for rapid deployment, with a launcher loader module and fire-control system mounted on a five-ton truck chassis.\nEach HIMARS launcher and carrier unit carries an estimated cost of $4.4 million.\nAccording to a Pentagon announcement, the contracted work will be assigned as individual production orders are received."}, {"id": "7b97e7b1-9c7f-46b5-b116-15d9d9a99aab", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:15", "url": "https://www.bostonglobe.com/2024/05/09/world/yemens-houthi-rebels-claim-2-attacks-gulf-aden-another-unreported-indian-ocean/", "message": "JERUSALEM (AP) — Yemen’s Houthi rebels on Thursday claimed responsibility for two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage.\nAdvertisementThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA.\nTehran launched a drone-and-missile attack on Israel last month after Israel’s apparent attack on an Iranian consular building in Syria killed two Iranian generals and others.\nThe Iranian city of Isfahan then apparently came under Israeli fire in recent weeks, despite being surrounded by sensitive nuclear sites."}, {"id": "d18dda78-152b-463e-b626-6dc3b5818060", "title": "J & K : Kulgam Encounter Ends After 40 Hrs , 3 Terrorist Killed", "date": "2024-05-09 04:45", "url": "https://www.news18.com/india/jk-kulgam-encounter-ends-after-40-hrs-3-terrorist-killed-8883478.html", "message": "Three terrorists have been killed in an encounter with security forces in south Kashmir’s Kulgam district after a forty-hour gunfight that began on Monday night and concluded on Thursday morning, the Indian Army said.\nOne terrorist was killed in a gunfight with security forces on Wednesday in Kulgam district, while two other ultras were killed a day earlier.\nDuring the searches of houses near the encounter site in the Redwani area of the district, a fresh exchange of fire took place with a terrorist hiding there.\nTwo ultras, including wanted terrorist of Lashkar-e-Toiba Basit Dar, were killed in the encounter with security forces on Tuesday, reported news agency PTI.\nInforming about the encounter, the Indian Army took to X and wrote, “A Joint Operation, that commenced on the intervening night of 06-07 May in general area Redwani Payeen, Kulgam, has been concluded after a relentless vigil of approximately 40 hours."}, {"id": "1d5c73f1-157e-4490-97d3-e4d96989f1bd", "title": "Yemen Houthi rebels claim 2 attacks in Gulf of Aden , another unreported in Indian Ocean", "date": "2024-05-09 07:30", "url": "https://www.whec.com/national-world/yemens-houthi-rebels-claim-2-attacks-in-gulf-of-aden-another-unreported-in-indian-ocean/", "message": "JERUSALEM (AP) — Yemen’s Houthi rebels on Thursday claimed responsibility for two missile attacks in the Gulf of Aden on two Panama-flagged container ships that caused no damage.\nMeanwhile, an adviser to Iran’s supreme leader again threatened that Tehran could build a nuclear weapon if it chose to pursue atomic armaments.\nSaree did not say why it took the rebels two day to claim the attacks.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\n“If Iran’s existence is threatened, we will have to change our nuclear doctrine,” Kharrazi said, according to IRNA."}, {"id": "507a9dc9-9338-43c6-ae41-e85e0c4dc89d", "title": "Rafah invasion : Israel shells Rafah as Biden vows arms suspension", "date": "2024-05-09 06:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-shells-rafah-as-biden-vows-arms-suspension/articleshow/109968615.cms", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "f5dc15de-b8cf-45cc-88dc-ba77b2fac56a", "title": "  So happy youre alive : Woman who survived horrific Bondi Junction massacre reunited with ex - soldier who saved her life", "date": "2024-05-09 01:45", "url": "https://www.perthnow.com.au/news/so-happy-youre-alive-woman-who-survived-horrific-bondi-junction-massacre-reunited-with-ex-soldier-who-saved-her-life-c-14600438", "message": "READ NOWCamera Icon Liya Barko, 35, reunites with Wayne Tolver Banks who helped save her after the Bondi Junction stabbing.\n“I’m so happy you’re alive,” Mr Tolver Banks replied.\nAs Cauchi launched his senseless knife attack on unsuspecting shoppers, Mr Tolver Banks said he recalled coming face-to-face with the offender.\nHe said the 40-year-old shook his head as if to indicate he was safe, before stabbing Ms Barko in the abdomen.\nNine Credit: NCA NewsWireIncredibly Mr Tolver Banks’ wife Michi had been standing by his side but was spared from Cauchi’s violent attack."}, {"id": "be5fd7fe-6b95-4d95-ad04-f46540774475", "title": "China Xi enjoys embrace of Europe renegades , Serbia and Hungary", "date": "2024-05-09 09:15", "url": "https://www.livemint.com/politics/chinas-xi-enjoys-embrace-of-europe-s-renegades-serbia-and-hungary-11715242107354.html", "message": "Chinese leader Xi Jinping extended his tour of Europe with stops in Serbia and Hungary, the two countries on the continent that have embraced Moscow and Beijing most warmly and challenged a U.S.-led world order.\nHungary, where the Chinese leader arrived late Wednesday, is poised to outdo Serbia’s fanfare as both vie for Chinese investments to boost their modest economies.\nXi didn’t make a publicized visit to the embassy, unlike the last time he was in Serbia when he laid a wreath at the compound.\nThe Serbian leader sought to draw parallels with Kosovo, which declared independence in 2008 but is still claimed by Serbia.\nXi’s stop in Serbia comes after a two-day visit in France, where the Chinese leader and French President Emmanuel Macron discussed Ukraine and trade."}, {"id": "8dca9bca-4ea8-42f7-b979-dd6185089a52", "title": "UC - Santa Cruz , Critical Race and Ethnic Studies Department : Striking for Hamas", "date": "2024-05-09 02:00", "url": "https://www.frontpagemag.com/uc-santa-cruz-critical-race-and-ethnic-studies-department-striking-for-hamas/", "message": "Editor’s note: Since the barbaric Hamas attacks against Israel on October 7th, American universities have become an undeniable locus of Jew hatred within our nation.\nThe Critical Race and Ethnic Studies Department at UC-Santa Cruz is #2 on our list.\nThe Critical Race and Ethnic Studies Department at UC-Santa Cruz has utterly abdicated its responsibility towards political neutrality and academic freedom, instead choosing to side with Hamas terrorists and their Jew-hating allies on the left in blatant disobedience of university policy.\nAs part of this “Global General Strike” CRES blatantly defied the authority of UC-Santa Cruz by refusing to hold classes or conduct university business.\nThis day is a day of solidarity with Palestinians in Palestine and around the world."}, {"id": "1372f452-6a8e-4ffe-89ce-453e81eeef83", "title": "Zelenskyy : Russia launches  Nazi  attack on Ukraine", "date": "2024-05-09 01:45", "url": "https://www.voanews.com/a/zelenskyy-russia-launches-nazis-attack-on-ukraine/7603951.html", "message": "Ukrainian officials said the massive Russian aerial attack that included 55 missiles and 21 drones damaged a power generation facility in the region of western Ukraine.\nDTEK, Ukraine's largest private electricity company, said Russian missiles inflicted “serious damage” on three of the company’s six thermal power plants in Ukraine.\nMeanwhile, Kosovo’s foreign minister, who is also the deputy prime minister, said there is “only one solution” to Russia’s war on Ukraine.\n“It can only be Russia to lose the war and Ukraine to win this war,” Donika Gervalla-Schwarz said in an interview with The Associated Press on Wednesday.\n“Ukraine hasn’t recognized the Republic of Kosovo as a state, but we really believe that we know exactly what Ukraine is going through,” she said."}, {"id": "046d9eac-2880-4ff8-9aab-c8b49b3e3f6d", "title": "Israel shells Rafah as Biden vows arms suspension", "date": "2024-05-09 06:30", "url": "https://www.al-monitor.com/originals/2024/05/israel-shells-rafah-biden-vows-arms-suspension", "message": "In an interview with CNN on Wednesday, Biden warned he would stop US weapons supplies to Israel if it pushed ahead with its long-threatened Rafah ground offensive.\nBiden told CNN that, \"If they go into Rafah, I'm not supplying the weapons that have been used... to deal with the cities.\"\nThe heavy shelling in Rafah overnight into Thursday followed a day of what the Israeli military said were \"targeted raids on the Gazan side of Rafah crossing\", in the city's east.\nA senior Hamas official said the latest round of negotiations would be \"decisive\".\nThe Hamas official had previously warned the Cairo talks would be Israel's \"last chance\" to free the hostages still in militants' hands."}, {"id": "a29c9e65-bebf-491e-acc1-3264e5a1f7a7", "title": "Philippine , US , Australian forces show off combined fires capabilities , destroy ship in Balikatan training event > U . S . Indo - Pacific Command > 2015", "date": "2024-05-09 03:30", "url": "https://www.pacom.mil/Media/News/News-Article-View/Article/3769528/philippine-us-australian-forces-show-off-combined-fires-capabilities-destroy-sh/", "message": "Philippine, U.S. and Australian military forces integrated land, sea and air platforms to simultaneously sense, target, strike and destroy a decommissioned ship off the western coast of Northern Luzon today.\nThe live-fire event demonstrated the capability of the force’s combined fires networks, joint and combined interoperability, and the high state of readiness between the U.S. and Armed Forces of the Philippines.\nIncorporating as many combined sensing and shooting platforms as possible, the objective of the maritime strike exercise was to test and validate the combined fires networks.\nThe CCC is responsible for integrating combined command and control functions between the U.S. and Philippine joint task forces executing the training.\nParticipating units included: the Philippine Navy’s BRP Jose Rizal (FF-150); the Philippine Air Force’s 7th tactical fighter squadron, flying the FA-50; the U.S. Air Force’s 13th Fighter Squadron, flying F-16 Fighting Falcons; Royal Australian Air Force No."}, {"id": "ea7100e7-0a96-4d0a-9aa2-9b63a7f99c11", "title": "Biden Widens Rift With Israel in Move That Paused Bomb Shipments", "date": "2024-05-09 00:00", "url": "https://www.livemint.com/news/world/biden-widens-rift-with-israel-in-move-that-paused-bomb-shipments-11715204480290.html", "message": "It marked the Biden administration’s most serious signal of displeasure over the conduct of the ongoing war against Hamas.\nThe administration also wants to preserve space for negotiators who have convened in Cairo this week to keep striving for a cease-fire and hostage deal between Israel and Hamas.\nBiden is facing domestic pressure for a solution with US elections just six months away.\nAt the same time, Israel has begun strikes in Rafah that could either pressure Hamas leaders into signing a cease-fire deal or scuttle the negotiations entirely.\nThe US recently signed a foreign-aid package that contains billions of dollars of fresh assistance for Israel."}, {"id": "17555966-09c3-431d-97fe-62b820f0f7c1", "title": "Prussian Prose", "date": "2024-05-09 06:15", "url": "https://www.takimag.com/article/prussian-prose/", "message": "Statue of Prinz Eugen, Palais Hofburg, Vienna Source: BigstockAt the end of World War II, the victorious Allies were convinced that Prussian militarism had played an important part in Hitler’s war in Europe.\nHerbert Marcuse, an overrated theorist of the Frankfurt School working for Uncle Sam, submitted a secret report that put all the blame for Nazism on capitalism.\nBut let’s return to Prussian militarism as compared with that of the Austrians.\nI’m half Spartan and rather proud of it, but it’s Uncle Sam who is the warmonger, not Uncle Fritz.\nWar is hell, and Uncle Sam is the greatest war-maker today."}, {"id": "df72b207-e846-4244-aa33-34a7fbaaa134", "title": "Brothers to be extradited over alleged fatal stabbing", "date": "2024-05-09 04:45", "url": "https://www.examiner.com.au/story/8622981/brothers-to-be-extradited-over-alleged-fatal-stabbing/", "message": "The brothers had been on the run since the early hours of Sunday after a 22-year-old man from Noble Park was killed and a 30-year-old man, also from Noble Park, was injured at an Ormond home in Melbourne's southeast."}, {"id": "2477f5a5-8efe-480d-98f5-ffbbdde80ff5", "title": "Ukraine war live updates : Putin says Russia  will not allow anyone to threaten u as Moscow revels in military pomp – NBC 7 San Diego", "date": "2024-05-09 09:00", "url": "https://www.nbcsandiego.com/news/business/money-report/ukraine-war-live-updates-moscow-revels-in-military-pomp-amid-gains-in-ukraine-russian-belgorod-region-attacked-injuring-8/3510342/", "message": "Russia's leadership and military have been out in force for the annual \"Victory Day\" military parade on Thursday.\nPresident Vladimir Putin, commander-in-chief of the armed forces, was flanked by veterans as he watched thousands of Russian troops, tanks, armored vehicles and weaponry parade through a mostly rainy Red Square in Moscow.\nRussia and the U.S. and U.K., are now more enemies than allies as the war continues in Ukraine.\nRussia's air defense systems destroyed 15 rockets launched from the RM-70 Vampir system, and one drone over the region, Russia's defense ministry said.\nPresident Vladimir Putin, commander-in-chief of the armed forces, is watching on as thousands of Russian troops, tanks, armored vehicles and weaponry are paraded through Red Square in Moscow."}, {"id": "4afef2c3-cd38-4f2d-83f4-572d69d2596c", "title": "Ukraine war live updates : Putin says Russia  will not allow anyone to threaten u as Moscow revels in military pomp – NBC Connecticut", "date": "2024-05-09 08:45", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-moscow-revels-in-military-pomp-amid-gains-in-ukraine-russian-belgorod-region-attacked-injuring-8/3286110/", "message": "Russia's leadership and military have been out in force for the annual \"Victory Day\" military parade on Thursday.\nPresident Vladimir Putin, commander-in-chief of the armed forces, was flanked by veterans as he watched thousands of Russian troops, tanks, armored vehicles and weaponry parade through a mostly rainy Red Square in Moscow.\nRussia and the U.S. and U.K., are now more enemies than allies as the war continues in Ukraine.\nRussia's air defense systems destroyed 15 rockets launched from the RM-70 Vampir system, and one drone over the region, Russia's defense ministry said.\nPresident Vladimir Putin, commander-in-chief of the armed forces, is watching on as thousands of Russian troops, tanks, armored vehicles and weaponry are paraded through Red Square in Moscow."}, {"id": "38c2babf-3d36-4b96-88ee-4c94dae4e070", "title": "7 killed in Pakistan Gwadar as terrorist open fire at sleeping workers", "date": "2024-05-09 07:30", "url": "https://timesofindia.indiatimes.com/world/pakistan/7-killed-in-pakistans-gwadar-as-terrorist-open-fire-at-sleeping-workers/articleshow/109969129.cms", "message": "(With ANI inputs)NEW DELHI: At least seven workers were killed and one was injured in a terrorist attack in Pakistan 's Gwardar in Punjab province on Wednesday night.The terrorist targeted workers sleeping at residential quarters near Fish Harbour Jetty in Gwadar's Sarband .\nAccording to police, the workers were from Sahiwal in Punjab.The bodies of the deceased and the injured were taken to a hospital and cops have initiated a probe to arrest the perpetrators.On May 1, at least seven policemen sustained injuries as terrorists launched an assault on a police checkpost in Punjab's Taunsa Sharif district, news agency ANI reported citing ARY News.This incident marks the second assault on the checkpoint within two months in the district.According to police officials, terrorists attacked the Jhangi checkpost, situated in Wahova, Dera Ghazi Khan.\nSix officers sustained injuries, Samaa TV reported.According to ARY News, seven injured policemen were transferred to Taunsa Sharif THQ hospital for medical assistance.\nThe Punjab Police spokesperson confirmed an attempted terrorist attack on the Jhangi checkpoint.He said that around 20 terrorists armed with grenades, rocket launchers, and laser-light guns attacked the checkpost.\nThe spokesperson stated that the terrorists launched their assault from various directions under the cover of darkness, but retreated as they ran out of ammunition, as per ARY News report.He further said that terrorists wanted to capture the police checkpost and take the policemen as captives."}, {"id": "4b32ac6e-cca1-48bc-80ee-4ec9ea583458", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 02:15", "url": "https://www.cbs58.com/news/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show", "message": "Israeli military operations in Rafah expand from airstrikes to ground operations, satellite images showPlanet Labs, PBC via CNN NewsourceBy Paul P. Murphy, Abeer Salman and Andrew Raine, CNN(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "cdf9c6ea-8161-4cca-8860-202228f65f4e", "title": "Advancing in Ukraine , Russia to mark victory in World War Two", "date": "2024-05-09 03:15", "url": "https://www.deccanherald.com/world/advancing-in-ukraine-russia-to-mark-victory-in-world-war-two-3014794", "message": "The 71-year-old Kremlin chief promised victory in the war, where Russian forces have been advancing against Ukrainian forces despite hundreds of billions of dollars in aid from the United States and its allies.\nUkraine and the West say Putin is engaged in an imperial-style land grab and have vowed to defeat Russia, which currently controls about 18% of Ukraine, including Crimea, and parts of four regions in eastern Ukraine.\nRussia says the lands, once part of the Russian Empire, are now once again part of Russia.\nIn Moscow it was already May 9, which became the Soviet Union's \"Victory Day\" in what Russians call the Great Patriotic War of 1941-45.\nRussian officials warn that the Ukraine war is entering the most dangerous phase to date - Putin has repeatedly warned of the risk of a much broader war involving the world's biggest nuclear powers."}, {"id": "8173ec27-992c-447c-857d-738ab852f3c0", "title": "Israel says Biden threat to stop arms  very disappointing  ", "date": "2024-05-09 06:30", "url": "https://www.thejournal.ie/israel-says-biden-threat-to-stop-arms-very-disappointing-6374562-May2024/", "message": "In an interview with CNN on Wednesday, Biden warned he would stop US weapons supplies to Israel if it pushed ahead with its long-threatened Rafah ground offensive.\n“If they go into Rafah, I’m not supplying the weapons that have been used… to deal with the cities,” Biden said.\n“Civilians have been killed in Gaza as a consequence of those bombs,” Biden said in his interview.\nThe heavy shelling in Rafah overnight into Thursday followed a day of what the Israeli military said were “targeted raids on the Gazan side of Rafah crossing”, in the city’s east.\nA senior Hamas official said the latest round of negotiations would be “decisive”."}, {"id": "cbba29d4-abf4-4957-afc5-344ce5b88311", "title": "  Most Wanted  Terrorist Among 3 Killed In J & K Encounter With Security Forces", "date": "2024-05-09 04:45", "url": "https://www.ndtv.com/india-news/most-wanted-terrorist-among-3-killed-in-j-k-encounter-with-security-forces-5622098", "message": "Encounter in J&K: The security forces have intensified search operations in the Union territory.\nIn a significant breakthrough, one of the National Investigation Agency's (NIA) most wanted terrorists and LeT commander was killed during an encounter with security forces on Wednesday night in Kashmir's Kulgam district.\nThree terrorists have been killed in the gunfight which broke out in the Redwani Payeen area of south Kashmir's Kulgam after security forces launched a search operation late on Monday night.\nApart from Dar, two LeT terrorists identified as Momin Gulzar and Fahim Ahmed Baba were also killed in the operation.\nThese killings include those of security personnel, civilians and minorities,” Inspector General of Police Kashmir V K Birdi told NDTV."}, {"id": "797cd9de-b0d8-462b-9ead-8312211ff342", "title": "Renewed rage of banditry", "date": "2024-05-09 01:45", "url": "https://punchng.com/renewed-rage-of-banditry/", "message": "The North-West and North-Central are the worst-hit regions in the renewed rage.\nKaduna, Katsina, Zamfara, Benue, and Plateau states have come under bloody attacks by bandits recently.\nWithin a week in mid-February, bandits slaughtered 12 persons and injured nine others in Makyali village in Kajuru LGA.\nOn March 7, bandits abducted 137 pupils from a school in Chikun LGA, Kaduna State.\nIn Katsina, bandits killed 24 persons in four communities in Sabuwa LGA in a night operation that lasted for one hour in late April."}, {"id": "1b0ba42f-e6e3-488d-bcc1-2c20fe2583c7", "title": "Now Ukraine Will Be Sending Prisoners to the Front Lines", "date": "2024-05-09 04:45", "url": "https://hotair.com/jazz-shaw/2024/05/08/now-ukraine-will-be-sending-prisoners-to-the-front-lines-n3788023", "message": "As we've discussed here frequently, it's no secret that Ukraine has been running low on troops needed to continue fighting the Russian invasion.\nThey've had far too many soldiers killed or captured and their recruiting efforts have produced lackluster results of late.\nIn Ukraine, convicts who were found guilty of \"serious crimes\" (murder, rape, terrorism, treason) will be ineligible for release under this program.\nI'm sure being stuck behind bars is no fun, but being sent to the front lines is no picnic either.\nThe prisoners are likely aware of how many of their former compatriots wound up coming home in body bags."}, {"id": "caad238b-3bf4-47ea-a65e-6e2211b1c197", "title": "Bangkok Post - Biden : US will not supply Israel with weapons to attack Rafah", "date": "2024-05-09 07:15", "url": "https://www.bangkokpost.com/world/2789805/biden-us-will-not-supply-israel-with-weapons-to-attack-rafah", "message": "Biden: US will not supply Israel with weapons to attack RafahA woman mourns Palestinians killed in Israeli strikes, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah, in the southern Gaza Strip, on Wednesday.\n\"If they go into Rafah, I'm not supplying the weapons that have been used historically to deal with Rafah, to deal with the cities, that deal with that problem,\" Biden said in an interview with CNN's Erin Burnett.\nWe're not going to — we're not going to supply the weapons and artillery shells used, that have been used.\"\nBiden said he did not consider Israel's operations in Rafah to date to qualify as a full-scale invasion because they have not struck \"population centres.\"\nBiden was also asked about Gaza protests on college campuses — specifically chants calling him “Genocide Joe” — that have erupted in recent weeks."}, {"id": "985e01d6-af67-48b5-8967-ebfa43a774c3", "title": "Biden Threatens to Withhold Weapons to Israel Over Rafah Invasion", "date": "2024-05-09 03:00", "url": "https://time.com/6976220/biden-halt-weapons-israel-rafah/", "message": "The move marked the Biden administration’s most serious signal of displeasure over the conduct of the ongoing war against Hamas.\n“Civilians have been killed in Gaza as a consequence of those bombs and other ways in which they go after population centers,” Biden said.\nAt the same time, Israel has begun strikes in Rafah that could either pressure Hamas leaders into signing a cease-fire deal or scuttle the negotiations entirely.\nBiden told CNN that Israel’s actions in Rafah—including air strikes near border areas—had not yet crossed the line.\n“A lot of it just depends on how things play out in Rafah and whether it gets worse.”"}, {"id": "690ca1ad-7c5a-4919-ad5b-e57b0d16d690", "title": "Is Pakistan playing with fire by aligning clandestinely with the ISK ? ", "date": "2024-05-09 08:45", "url": "https://www.southasiamonitor.org/index.php/spotlight/pakistan-playing-fire-aligning-clandestinely-isk", "message": "On 29th April 2023, a gunman fired on six people at a Shia mosque in the district of Guzara in Herat province, Afghanistan.\nSince the breakdown of the negotiations with Tehreek e Taliban Pakistan (TTP), Pakistan has been the victim of several TTP attacks.\nISK persecution of ShiasThe ISK, like its parent ISIS Central, regards the Shias as a polytheistic religion and refuses to recognize them as a part of Islam.\nWith every attack claimed by both ISIS Central and its affiliate ISK, the outfits have stressed the deliberate intent behind attacking the Shias.\nThe recent ISK attacks in Kabul and Herat are believed to have been carried out on the orders of and financial backing of the ISI."}, {"id": "eaab1ff7-3ff0-431a-9208-1d8f132ef4a4", "title": "Republicans question over  ironclad  commitment after arms shipment halt", "date": "2024-05-09 03:00", "url": "https://www.jpost.com/american-politics/article-800515", "message": "The State Department was slated to release its review of Israel's assurances to Congress on Wednesday but said the report will be out \"in the coming days.\"\nIron dome anti-missile system fires interception missiles as rockets fired from Lebanon, as it seen over Kiryat Shmona, March 5, 2024.\nIsrael is an urgent priorityThe Republican leaders noted that while the assistance funded by the supplemental appropriations bill will not be impacted, security assistance to Israel is an urgent priority that must not be delayed.\n\"These recent press reports and pauses in critical weapons shipments call into question your pledge that your commitment to Israel's security will remain ironclad,\" the letter said.\nThe leaders said they expect the Biden administration to push \"departments, agencies and industry\" to expedite contracting, production and delivery of weapons and munitions \"critical to defense of the United States and free world.\""}, {"id": "f57072b5-d840-4a48-80de-14044b1455d6", "title": "Brothers to be extradited over alleged fatal stabbing", "date": "2024-05-09 04:00", "url": "https://www.bendigoadvertiser.com.au/story/8622981/brothers-to-be-extradited-over-alleged-fatal-stabbing/", "message": "The brothers had been on the run since the early hours of Sunday after a 22-year-old man from Noble Park was killed and a 30-year-old man, also from Noble Park, was injured at an Ormond home in Melbourne's southeast."}, {"id": "6382e872-ed5d-4ee0-bd1f-f77550701ea6", "title": "Video allegedly showing murder of Israeli in Egypt published , authenticity investigated", "date": "2024-05-09 02:00", "url": "http://www.israelnationalnews.com/news/389646", "message": "תיעוד ערבי (לכאורה) של רצח הישראלי במצרים מהרשתA video allegedly showing the murder of Israeli businessman Ziv Kipper in the Egyptian city of Alexandria by an unknown terrorist organization was published online on Wednesday.\nIn the background, a man is heard saying “Shalom” in Hebrew and adding in Arabic, “from the children of Gaza”.\nIf the video is authentic, it confirms the suspicion that the murder was a terrorist attack.\nThe organization that published the video called itself the “Shaheed Muhammad Salah Group” and claimed that it was responsible for the murder.\nDespite the video and the announcement of the terrorist organization, officials in Egypt continue to claim that the incident was a robbery and that the background is criminal."}, {"id": "fbbe7852-da7e-4dab-9d4a-ff3a36179883", "title": "Russian attack on Nikopol kills 2 , injures 2", "date": "2024-05-09 07:30", "url": "https://www.yahoo.com/news/russian-attack-nikopol-kills-2-062249163.html", "message": "A Russian artillery attack on Nikopol in Dnipropetrovsk Oblast killed two people and injured two others, Governor Serhii Lysak reported on May 9.\nThe attack killed a 62-year-old man and a 65-year-old woman, while two men aged 39 and 67 were injured, Lysak said.\nTwo homes, a gas pipeline, a shop, and farm buildings were hit in the strike, and five apartment buildings were damaged.\nAt least six people, including a six-year-old girl and a 91-year-old woman, were injured in Nikopol on May 7 during a day of intense Russian attacks.\nRead also: Updated: Russia launches large-scale attack against Ukraine, hitting energy infrastructureWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "236fe98c-2b81-40bd-a13b-3e34377f9d20", "title": "Guns and explosive chemicals found at Adelaide home of defence analyst accused of terror plot , court hears | South Australia", "date": "2024-05-09 07:15", "url": "https://www.theguardian.com/australia-news/article/2024/may/09/artem-vasilyev-guns-explosive-chemicals-found-adelaide-alleged-terror-plot-cherry-gardens-ntwnfb", "message": "Extremist material, a 3D-printed gun and chemicals used in explosive and incendiary devices were found in the home of a defence scientific analyst accused of plotting a terror attack, a trial has been told.\n“There will be evidence that Mr Vasilyev had a firearms licence and had three registered firearms at his house in 2021 – perfectly legal.\n“It is not alleged or suggested that Mr Vasilyev committed a terrorist act.\n“If you’re wondering, FGC stands for ‘Fuck Gun Control’ and the ‘9’ stands for 9mm,” Hannebery told the jury.\nHannebery said Vasilyev told police he didn’t realise the FGC weapon produced by his printer would be functional and he thought he was making a model."}, {"id": "a5fd52b5-7d6a-4e1d-bff7-888888656e5b", "title": "Israel Coming Political Earthquake", "date": "2024-05-09 09:30", "url": "https://www.heritage.org/middle-east/report/israels-coming-political-earthquake", "message": "Political EarthquakeThe blunt commission report is likely to reorder the Israeli political establishment and send Prime Minister Olmert, his Kadima (Forward) party, and Amir Peretz, the incompetent Labor Party leader and Defense Minister, packing.\nPeretz should have never accepted the appointment as Defense Minister, concluded the report-something every child in Israel already knows.\nThese days, Mr. Barak is planning to replace the tainted Peretz and stage a comeback as a Labor leader and Defense Minister.\nSystemic FailureDecades of failed Israeli political leadership have endangered the nation's precarious security.\nHis approval rating is in the single digits, while Peretz as Defense Minister is the butt of jokes."}]