[{"id": "2eadda9b-5054-40d2-bf29-21078280d787", "title": "Trump Rhetoric vs . Harris Policies | The Jewish Press - JewishPress . com | Caroline B . Glick | 8 Av 5784 – Sunday , August 11 , 2024", "date": "2024-08-11 16:45", "url": "https://www.jewishpress.com/indepth/opinions/trumps-rhetoric-vs-harriss-policies/2024/08/11/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "American Jewish concerns and convictionsAccording to a Pew survey of American Jews from March, 89% of American Jews are supportive of Israel.\nA June 2024 survey of American Jews conducted by the American Jewish Committee showed that their commitment has only grown since Oct. 7.\nSeven percent of American Jews reported considering moving to another country as a result.\nTlaib and Bush, of course are outspoken in their hatred for Israel and for American Jews who support Israel.\nThis week pollster Richard Baris released a survey that found Harris’s support among Jews stands at a mere 52.7%, with 45.9% favoring Trump."}, {"id": "fc607550-3839-4ea8-95fe-914ad7ff4ede", "title": "A Spanish town embraces its Jewish history but is it true ? – The Forward", "date": "2024-08-11 21:30", "url": "https://forward.com/culture/641259/hervas-spain-jewish-history-sephardic-philosemitism-antisemitism/", "domain": "forward.com", "domain_classification": "Unknown", "message": "I was eager to see the community play, which is performed each year along the rocky Ambroz River at the bottom of the Jewish Quarter.\nOn elaborate sets, 300 actors, dancers, falconers, and jockeys reenact scenes of Spanish Christians defeating the Moors and discovering America, but leave out Spanish Jews.\nIn 1983, he published a book, The Jewish Quarter, which developed the narrative still repeated today.\nA tradition, lost and found“I’m Jewish,” Eladia Valle, a 95-year-old woman who grew up in the Jewish Quarter, told me.\nHer son suggested her great-great-great grandparents might have been conversos, but by identifying as Jewish, she was expressing a sense of pride in being from her working-class neighborhood, the Jewish Quarter."}, {"id": "91941100-e6d5-46df-a75e-0dacdad07d8e", "title": "Journalist Charged With Hate Crime for Covering Gaza Protest", "date": "2024-08-11 22:15", "url": "https://theintercept.com/2024/08/08/journalist-hate-crime-gaza-protest/", "domain": "theintercept.com", "domain_classification": "Unknown", "message": "An NYPD officer stands on the roof of the Brooklyn Museum in Brooklyn, N.Y., on May 31, 2024.\nHe is nonetheless facing charges for criminal mischief enhanced as a felony hate crime; one other person alleged to have driven participants to and from the executives’ homes is also facing criminal mischief hate crime charges.\nTo categorize the acts as a felony hate crime is, however, itself a troubling overreach.\nApplying the overreaching hate crime charges to a journalist covering the incident is beyond troubling; it is an outrage.\nIt is, however, on these spurious grounds that the hate crime charges are based."}, {"id": "cf2e9d20-2dfa-4186-a39c-6374f12613ba", "title": "Latest Articles", "date": "2024-08-11 06:30", "url": "https://freerepublic.com/tag/*/index?more=4257658", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "The ‘Eagleton Affair’ may not come immediately to mind, except to those who either were old enough to vote in 1972 or are true students of history and politics.\nThomas Eagleton was then a 42-year-old senator from Missouri who became George McGovern’s fifth or sixth choice for the VP slot after McGovern had secured the nomination.\nThe more preferred choices had already said no to McGovern, probably the furthest Left candidate ever to run for the Presidency at that time.\nWhen so many say no, there is usually a good reason for doing so.\nMcGovern was that reason."}]