[{"id": "89db7621-4bee-42b7-8a6e-515383cb774e", "title": "The American Jewish students fleeing from US campuses to Israel", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-806043", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Many are gap year students who plan to return home and attend an American college next school year.\nThe funds will go toward implementing the project, dubbed Terrapin Tisch, which aims to bring unaffiliated Jewish students to informal events by offering food, singing, and discussions.\nThe idea of empowering Jewish students “came from visiting campuses abroad – Hillel, Chabad, and Jewish fraternities and sororities.\nWherever there are Jewish students, we try to interest them in coming to Israel,” Isaacs told the Magazine.\n“I saw that out of a tremendous number of Jewish students, only a very small percentage gets involved in Jewish life there..."}, {"id": "970a6aa8-8030-4664-905e-03cc3dc67338", "title": "Right crusade against antisemitism : It a blatant effort to silence Jewish voices", "date": "2024-06-15 10:45", "url": "https://www.yahoo.com/news/rights-crusade-against-antisemitism-blatant-094504620.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It is wise to remember this, too, when throwing charges of antisemitism around too loosely.\nIn practice, it would mean that after the Holocaust, Jews would have learned only one thing: that extermination of their family and kin should be prevented.\nTo accuse someone like Gessen of antisemitism for daring to draw the comparison is to attempt to silence that distinctly Jewish form of critique.\nOnce again we may perceive here a denial of the Jewish moral voice, coupled with mass arrests of Jewish organizers and protesters, under the guise of genuine concern for Jews.\nNone of these are goals Jews should support; all are goals that Jews, as Jews, have good reason to resist."}, {"id": "11e109c5-5251-4c13-a010-f0cfcc5893bf", "title": "Aliyah Commandos fight to bring North American Jews home", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/aliyah/article-806049", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The goal of these conferences is to bring aliyah advocates together in Jerusalem “to try to brainstorm why we have failed so miserably.\nWith millions of Jews in America, the [aliyah] numbers are a drop in the bucket,” Wander expressed with frustration.\nThey also met with Rabbi Hershel Schachter, an influential American Orthodox rabbi and rosh yeshiva at Rabbi Isaac Elchanan Theological Seminary, the rabbinic program of Yeshiva University.\nIf everything was perfect in Israel, [aliyah] would be a no-brainer,” he remarked.\n“I have a common language with Orthodox Jews,” Wander said."}, {"id": "517d6483-6b47-4e0c-859b-0a23982d4b77", "title": "Despite global snubs , Jewish stories shine at Tribeca Film Festival", "date": "2024-06-15 15:45", "url": "https://www.ynetnews.com/culture/article/sj17yqirr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "This comes as less of a surprise in the United States where the Jewish community is regarded as a stable market share for ticket sales for waning independent cinema.\nEven Tom Nesher’s Israeli drama, Come Closer premiered there and even won the Viewpoints Award, the top prize in its category.\n5 View gallery Lia Elalouf as Eden in Come Closer ( Photo: Shai Peleg )Tom Nesher is the daughter of Israeli cinema icon Avi Nesher.\n5 View gallery Lia Elalouf as Eden in Come Closer ( Photo: PR )Congratulations turned to commiserations.\nCome Closer delves into her personal experience through a whirlwind of emotions into which she drifts, and all the to the bottom."}, {"id": "5fe66384-a92f-4e84-bf19-d7f09b1c7b9d", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-15 23:45", "url": "https://www.theage.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "9a291303-82c2-40c2-b9dc-f5e6e23596bf", "title": "British far - right and pro - Israel activists are fighting the Palestinian movement together", "date": "2024-06-15 09:45", "url": "https://www.middleeasteye.net/news/uk-palestine-israel-far-right-zionist-groups", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "But the numbers outside the Phoenix Cinema in East Finchley had ballooned to close to 1,000, anti-fascist investigation group Red Flare estimated.\nWestlake was also identified as participating in counter-protests targeting a University College London (UCL) student encampment on 27 May.\nKey activists from far-right groups Turning Point UK and Patriots of Britain also attended the counter-protest.\nRed Flare said that the British far-right groups involved in the counter-protests, Turning Point UK and Patriots of Britain, are civic nationalist groups rather than ethnonationalist.\n“They're more focused on the cultural aspects of racism than biological ones,” a Red Flare spokesperson told MEE."}, {"id": "c77e06e1-5482-4799-b56b-b4227e852f4b", "title": "Detroit pastor hosting Trump defends visit amid criticism of conservative events in city", "date": "2024-06-15 13:00", "url": "https://www.yahoo.com/news/detroit-pastor-hosting-trump-defends-100445285.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Lorenzo Sewell got a call last week from the campaign of Donald Trump asking whether he was interested in his Detroit church hosting an event Saturday with the former president, he couldn't believe it.\nLorenzo Sewell of 180 Church in Detroit, where former President Donald Trump plans to speak on June 15, 2024.\nNone of those are in Donald Trump.\nSo to say that we see as no problem voting for convicted felon Donald Trump because of Jesus being a convicted felon, there's no comparison.\nContact Niraj Warikoo: nwarikoo@freepress.com or X @nwarikooThis article originally appeared on Detroit Free Press: Detroit church hosting Donald Trump for roundtable faces criticism"}, {"id": "0dcf36da-f117-4b58-9303-56c387a9664e", "title": "LankaWeb – No Tamil genocide in Sri Lanka Canada Federal Court reviewed Trudeau statement and rejects Tamil genocide", "date": "2024-06-15 00:00", "url": "https://www.lankaweb.com/news/items/2024/06/14/no-tamil-genocide-in-sri-lankacanadas-federal-court-reviewed-trudeaus-statement-and-rejects-tamil-genocide/", "domain": "lankaweb.com", "domain_classification": "Unknown", "message": "Canada’s top court, the Federal Court, stated as follows and rejected Tamil genocide, saying no such declaration.\nThe Federal Court identified incidents in Sri Lanka as a conflict” between the Tamil Terrorist group Liberation Tigers of Tamil Eelam and the Armed forces in Sri Lanka.\nFor his political survival, Brown put forward the Tamil genocide to the Tamil communities and sought their support.\nThe Tamil Genocide Education Week Act and the proposed Tamil Genocide Monument by the City of Brampton are currently facing Constitutional challenges.\nPrime Minister Justin TrudeauMay 18, 2023Prime Minister Justin Trudeau issued a statement remembering the loss of lives due to past conflict, reiterating Canada’s official position."}]