[{"id": "9b1a39fb-e542-482d-a4d3-cf9df5000911", "title": "British coalition conducts airstrike on Yemen port city : Houthi TV | Central India Premier English Daily", "date": "2024-08-16 04:45", "url": "https://www.centralchronicle.com/british-coalition-conducts-airstrike-on-yemens-port-city-houthi-tv/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Sanaa, Aug 16 (UNI) The U.S.-British coalition conducted an airstrike on Yemen’s Red Sea port city of Hodeidah on Thursday evening, according to Houthi-run al-Masirah TV.\nThe strike reportedly targeted the northwestern al-Salif district, but details on casualties were not immediately available.\nResidents on social media reported a significant explosion near a Houthi-controlled site.\nThe Houthis control much of northern Yemen, including parts of the Red Sea coast.\nSince November, the Houthis have targeted Israeli-linked ships, citing “solidarity with Palestinians in Gaza.” In response, the U.S.-British naval coalition has carried out regular air raids and missile strikes against Houthi positions since January, with limited success."}, {"id": "f9c41b30-820c-4fbd-a734-441cff56ca4b", "title": "Britain  must let Ukraine use its Storm Shadow missiles to hit targets inside Russia  after Challenger - 2 tanks were used to great effect in surprise cross - border incursion", "date": "2024-08-16 09:30", "url": "https://www.dailymail.co.uk/news/article-13749653/Britain-let-Ukraine-use-Storm-Shadow-missiles-hit-targets-inside-Russia-Challenger-2-tanks-used-great-effect-surprise-cross-border-incursion.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukrainian officers fighting in the Kursk offensive have implored Britain to green-light the use of Storm Shadow missiles to strike targets deep into Russia.\nBritish-made weaponry has reportedly been used to great effect by Kyiv's troops in their foray into Russia already.\nSeveral Challenger-2 tanks are believed to have forged across the border as part of the invasion force - though Russian military bloggers gloated yesterday that drones had successfully destroyed one of the British-made vehicles used in the offensive.\nLantushenko's pleas for Storm Shadow missiles came a day after Ukrainian President Volodymyr Zelensky claimed drones are simply not enough to destroy key Russian military infrastructure and hammer home his advantage in Kursk.\nStorm Shadow missiles are seen attached to the hard points of a Eurofighter TyphoonStorm Shadow missiles, accurate to beyond 150 miles, have already been used by Ukraine to hit targets in Russian-occupied territory to great effect."}, {"id": "6f01e748-ae09-4caa-81b3-acddf9f4e245", "title": "Diplomacy takes center stage as Iran holds off retaliation against Israel", "date": "2024-08-16 03:30", "url": "https://www.cbsnews.com/news/diplomacy-takes-center-stage-as-iran-holds-off-retaliation-against-israel/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "U.S. assessments are that Iran will not seek to disrupt ongoing cease-fire negotiations in Doha aimed at ending the Hamas-Israel war.\nA U.S. official confirmed to CBS News that Israel was responsible for Haniyeh's killing, though Israel has not publicly acknowledged it.\nIf all of this fails, the U.S. also has a parallel plan similar to when Iran launched its April 13 attack on Israel, to defend Israel with the aid of allies.\nA U.K. official told CBS News, \"Our core focus is diplomatic efforts and de-escalation.\nA French official also told CBS News, \"We've been calling on all actors in the region to de-escalate."}, {"id": "20d12970-5001-4edb-943e-b12487def261", "title": "Iran debating whether to use force against Israel or run covert operation CBS", "date": "2024-08-16 08:00", "url": "https://tass.com/world/1829857", "domain": "tass.com", "domain_classification": "Unknown", "message": "Iran continues to weigh options of retaliating against Israel for the assassination of Hamas Politburo chief Ismail Haniyeh in Tehran, CBS reported, citing multiple sources.\nAccording to them, the Islamic Republic has been debating whether to launch a massive attack on Israel or whether to carry out \"a covert intelligence operation,\" the US television channel said.\nThe Israel Defense Forces then said that it had deflected the strike.\nBritish, US and French troops stationed in the Middle East helped Israel in downing Iranian projectiles.\nBritish and French officials also told CBS that their militaries will be ready \"to defend Israel, and we remain in constant touch with the US and allies on potential scenarios.\""}, {"id": "e57e3d9b-8078-47ef-b406-6cabf5384f32", "title": "Israel pounds Gaza ahead of ceasefire talks", "date": "2024-08-16 05:00", "url": "https://www.naharnet.com/stories/en/307277-israel-pounds-gaza-ahead-of-ceasefire-talks", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli air strikes targeted Gaza on Wednesday ahead of ceasefire talks that the United States hopes will stop Iran striking Israel in retaliation for the killing of a Hamas leader.\nAhead of Thursday's ceasefire talks, a Hamas official said the Islamist movement was \"continuing its consultations with the mediators\".\nBiden said on Tuesday that a Gaza ceasefire deal could deter Iran from attacking Israel.\nHis envoy for the conflict, Amos Hochstein, was in Beirut on Wednesday where he warned the clock was ticking for a Gaza ceasefire.\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 Israel says are dead."}, {"id": "8d1e5707-d8de-4426-866d-74dbe1840911", "title": "Dozens of Israeli settlers attack West Bank village", "date": "2024-08-16 07:45", "url": "https://www.dailymail.co.uk/news/article-13749455/Dozens-Israeli-settlers-attack-West-Bank-village-burn-cars-kill-Palestinian-violence-condemned-mediators-hold-new-round-talks-end-war-Gaza.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Dozens of Israeli settlers surged into a Palestinian village in the West Bank yesterday, burning cars and killing at least one person, Israeli authorities admitted yesterday.\nShocking footage circulated on social media showed houses and cars smouldering after being set alight by Molotov cocktails thrown by the Israeli settlers.\nThe fatal attacks came hours after an Israeli airstrike in the West Bank killed two other young Palestinians.\nMore than 600 Palestinians in the West Bank have been killed since October 7, most of whom died as a result of incursions by Israeli settlers.\nThe White House, whose diplomats are now engaged in a fresh round of ceasefire talks with international mediators, declared Israeli settlers' attacks in the West Bank 'unacceptable' and insisted they 'must stop.'"}, {"id": "c4f224cd-7370-4883-882e-26773cbaf3ee", "title": "Casualty Toll Of Russian Attack On Enterprise In Kharkiv Region Rises", "date": "2024-08-16 01:30", "url": "https://menafn.com/1108560797/Casualty-Toll-Of-Russian-Attack-On-Enterprise-In-Kharkiv-Region-Rises", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The number those as a result of a Russian on a civil enterprise in the village of Prylokotne of the Kupiansk district in Kharkiv region has increased to six.\nThat's according to the press service of the Kharkiv Regional Prosecutor's Office , Ukrinform reports.\n\"The number of injured has increased to six.\nA 47-year-old man - also an employee of the enterprise that was hit by the enemy airstrike - sought medical assistance,\" the update reads.\nRussian strike kills two in, Donetsk regionAs Ukrinform reported earlier, on August 15, at around 15:20, the Russian invasion forces launched airstrikes on the village of Prykolotne in the Kupiansk district, hitting a civil enterprise."}, {"id": "9f06d172-92de-4338-b518-7a2a32857ea7", "title": "Iran Update , August 15 , 2024 | Institute for the Study of War", "date": "2024-08-16 06:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-august-15-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, August 15, 2024Johanna Moore, Kelly Campa, Kathryn Tyson, Carolyn Moorman, Annika Ganzeveld, Robert Moore, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nIran is likely trying to build operational surprise ahead of its expected attack on Israel.\nIran has taken similar approaches in previous attacks, such as the large-scale Iranian drone and missile attack on Israel in April 2024 and the Iranian missile attack on US forces in Iraq in January 2020.\nThe US, Egyptian, Israeli, and Qatari officials met in Doha for the latest round of ceasefire-hostage negotiations on August 15.\n[28]Key Takeaways:Iran: Iran is likely trying to build operational surprise ahead of its expected attack on Israel."}, {"id": "3c30d02a-8ad5-47c4-9758-17ae5a36f922", "title": "", "date": "2024-08-16 03:45", "url": "https://www.israelnationalnews.com/news/394709", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "White House National Security Council spokesman John Kirby told CNN on Thursday that US intelligence indicates that Iran has not backed down from its threat to attack Israel.\nThere have been conflicting reports as to whether Tehran will attack Israel in retaliation for the elimination of Hamas political leader Ismail Haniyeh on July 31.\nOn Tuesday, three senior Iranian officials told Reuters that Iran could delay or cancel its planned attack against Israel if this week's ceasefire talks between Israel and Hamas are successful.\nLater in the day, US President Joe Biden said that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week.\n“That’s my expectation,” Biden told reporters when asked if he believes Iran will not strike if a deal is signed."}, {"id": "522688f3-97e4-4e58-8950-f68d85c57319", "title": "Ukraine surprise advance into Russia a dilemma for Biden", "date": "2024-08-16 00:30", "url": "https://www.bbc.co.uk/news/articles/cql365ld002o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The US is the single biggest arms supplier to Ukraine - making the relationship the most consequential for Ukraine’s prospects.\nJust last week the Pentagon authorised its 63rd tranche of equipment in three years, including Stinger missiles and artillery shells.\nFor many months President Zelensky pleaded for permission to strike at military targets in Russia that facilitated attacks into Ukraine.\n\"We're not authorising strikes 200 miles into Russia and we're not authorising strikes on Moscow, on the Kremlin.\"\nThe words he used in June suggested that Ukraine’s limits were \"in proximity to the border\"."}, {"id": "dfc3ac4f-c578-4525-8c6c-33be73762008", "title": "The attempted assassination of Donald Trump , what are the long - term implications ? ", "date": "2024-08-16 11:30", "url": "https://theboar.org/2024/08/the-attempted-assassination-of-donald-trump-what-are-the-long-term-implications/", "domain": "theboar.org", "domain_classification": "Unknown", "message": "The attempted assassination of Donald Trump has had immediate and significant impacts on the political landscape.\nKimberly Cheatle, head of the Secret Service at the time of the assassination attempt, has since resigned following the backlash.\nSince the shooting supporters have started sporting bandages on their ears as an act of solidarity.\nThis assassination attempt could, therefore, be seen as a pivotal moment in his favour.\nThis in turn shapes him up to be the political favourite of the American people and this assassination attempt is his golden moment."}, {"id": "ff1749ef-e070-4e2c-af3c-3fd167cf7b59", "title": "Day 315 : Israeli Missiles Kill And Injure Dozens In Gaza", "date": "2024-08-16 12:45", "url": "https://imemc.org/article/day-315-israeli-missiles-kill-and-injure-dozens-in-gaza/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "Also, Israeli military vehicles stationed near the Shuhada junction opened fire on homes in the Al-Zaytoun neighborhood, southeast of Gaza City.\nAn additional civilian fatality and several injuries occurred due to an Israeli airstrike near Al-Zawaida village’s entrance.\nAnother Israeli bombing targeting Gaza City’s Saraya district resulted in one death and multiple injuries.\nA Palestinian family recorded the moments when the Israeli army directly targeted them as they evacuated their home along the designated route after an evacuation order.\npic.twitter.com/wBwxtTNMCo — Gaza Notifications (@gazanotice) August 15, 2024In a post on X, Avichai Adraee, the Israeli army Arabic-language spokesperson, issued an evacuation order for residents in six neighborhood blocks of Gaza City."}, {"id": "4c27ce70-a3c2-408e-a7d9-e59f6d6de546", "title": "A closer look at Hezbollah tunnel threat", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/a-closer-look-at-hezbollahs-tunnel-threat", "domain": "10news.com", "domain_classification": "Unknown", "message": "Some Israeli analysts say Hezbollah's tunnel network is even more extensive than the one built by Hamas.\nThis could prove significant because it could help Hezbollah maintain resupply routes from Iraq and Syria in the event of an all-out war.\nThe tunnel network would make it very difficult to preemptively attack Hezbollah's stock of rockets and missiles, which is far larger than that of Hamas.\nIt has spent much of the last two decades preparing for a potential war, with assistance from Iran, Syria and Russia.\n\"We're not counting on anything when it comes to Iran and the possibility of some sort of an attack,\" Kirby said."}, {"id": "cbeee0bd-2283-4f6d-87e9-ebd0d90ea3fc", "title": "Fed - Up With Games , Hamas Reportedly Sits Out Talks", "date": "2024-08-16 03:15", "url": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out Talks'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out TalksSputnik InternationalDan Kovalik, a human rights activist and author joined Political Misfits on Thursday to discuss the ongoing tensions in the Middle East.\n2024-08-16T01:00+00002024-08-16T01:00+00002024-08-16T01:01+0000analysismiddle eastbenjamin netanyahujoe bidenisraelhamasirangenocidewar crimesethnic cleansinghttps://cdn1.img.sputnikglobe.com/img/07e8/08/10/1119786720_0:170:3072:1898_1920x0_80_0_0_27452c654fabdad4d9ba27d0aacfa8a0.jpgCeasefire talks in the Middle East have resumed with the US, Israel, Egypt and Qatar reportedly making an appearance without representation being made from Hamas.\nSo, obviously, the people of Gaza need a ceasefire,” Kovalik explained.\nAccording to one report, the practice became so common amongst Israeli soldiers that it could be considered a “protocol”.\nUS President Joe Biden acknowledged the influence that the ceasefire deal will have on Iran’s threats and admitted that the process to a ceasefire deal is “getting harder” but said he is “not giving up”.“Again, Iran acts in very constrained ways."}, {"id": "40b1c629-a8a3-4a88-a5d7-f2eedaa819af", "title": "Russian attack on Sumy Oblast kills 1 , injures 3", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/russian-attack-sumy-oblast-kills-235000089.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked 11 communities in Sumy Oblast on Aug. 15, killing one and injuring three people, the Sumy Oblast Military Administration reported.\nThe security situation in Sumy Oblast became more tense with the start of Ukraine's cross-border incursion into neighboring Kursk Oblast in Russia, which began on Aug. 6.\nSumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts.\nCivilians in Sumy Oblast within 20 kilometers (12 miles) of the border with Kursk Oblast are now subject to restrictions on movement due to increasing Russian attacks, according to the General Staff of Ukraine's Armed Forces.\nRead also: Russia partially deploying its forces to Kursk Oblast, exact number is unknown, White House saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "521e2f5c-27c3-4555-81e7-2198a0268403", "title": "Ex - Israeli min . mocks Netanyahu , urges him to  be brave  ", "date": "2024-08-16 00:30", "url": "https://www.dailysabah.com/world/mid-east/ex-israeli-min-mocks-netanyahu-urges-him-to-be-brave", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "A new round of Gaza cease-fire and prisoner swap talks began Thursday in the Qatari capital Doha to reach an agreement between Israel and Hamas.\nHamas said on Wednesday that it will participate in the upcoming Gaza cease-fire and hostage swap talks if Israel provides a clear commitment to implement U.S. President Joe Biden's proposal.\nBut mediation efforts have been stalled due to Netanyahu’s refusal to meet Hamas’ demands to stop the war.\nFlouting a U.N. Security Council resolution demanding an immediate cease-fire, Israel has faced international condemnation amid its continued brutal offensive on Gaza since an Oct. 7, 2023 attack by Hamas.\nOver 10 months into the Israeli onslaught, vast tracts of Gaza lie in ruins amid a crippling blockade of food, clean water and medicine."}, {"id": "0cae0c73-b26e-4fa0-8998-b9c5dff61204", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war", "date": "2024-08-16 10:15", "url": "https://www.clickondetroit.com/news/2024/08/16/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try-to-prevent-regional-war/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Nasser Nasser)Internationally mediated cease-fire talks in Qatar are expected to enter their second day Friday in an effort to prevent the war in Gaza from spreading into a wider regional conflict.\nRecommended VideosThe new push for an end to the Israel-Hamas war comes as the Palestinian death toll in Gaza climbed past 40,000, according to Gaza health authorities.\nBadr Abdelaty’s comments in Beirut came as officials from Egypt, Qatar, Israel and the U.S. are holding talks in the Qatari capital of Doha in an attempt to end the war in Gaza.\nHezbollah started attacking Israeli military posts on Oct. 8, a day after a Hamas-led attack on Israel triggered the war in Gaza.\nCease-fire talks set to enter Day 2 in DohaDOHA, Qatar — Qatar’s Foreign Ministry spokesperson Majed al Ansari said the cease-fire talks are still ongoing and will resume Friday."}, {"id": "144f5a77-ec1e-49dd-a3a6-04e623f5e618", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war", "date": "2024-08-16 10:45", "url": "https://www.local10.com/news/2024/08/16/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try-to-prevent-regional-war/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(AP Photo/Nasser Nasser)Internationally mediated cease-fire talks in Qatar are expected to enter their second day Friday in an effort to prevent the war in Gaza from spreading into a wider regional conflict.\nRecommended VideosThe new push for an end to the Israel-Hamas war comes as the Palestinian death toll in Gaza climbed past 40,000, according to Gaza health authorities.\nBadr Abdelaty’s comments in Beirut came as officials from Egypt, Qatar, Israel and the U.S. are holding talks in the Qatari capital of Doha in an attempt to end the war in Gaza.\nHezbollah started attacking Israeli military posts on Oct. 8, a day after a Hamas-led attack on Israel triggered the war in Gaza.\nCease-fire talks set to enter Day 2 in DohaDOHA, Qatar — Qatar’s Foreign Ministry spokesperson Majed al Ansari said the cease-fire talks are still ongoing and will resume Friday."}, {"id": "5facdd00-d9e1-4ecf-8a1d-8f65d415ea72", "title": "Russia blames US for Nord Stream attack , vows retaliation", "date": "2024-08-16 07:00", "url": "https://www.jpost.com/breaking-news/article-815003", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Russia's ambassador to Washington said on Friday that Ukraine would not have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\nThe Wall Street Journal reported on Thursday that Ukraine's top military commander approved the 2022 attack on the gas pipelines despite a warning from the US Central Intelligence Agency to Ukrainian President Volodymyr Zelenskiy not to carry out the bombing.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n\"We will seek to identify the real perpetrators of the bombing and punish them.\""}, {"id": "f5203672-d118-4081-bfa1-2a33df318c19", "title": "Mediators hold new Gaza cease - fire talks and hope to head off a wider war - Boston News , Weather , Sports", "date": "2024-08-16 04:30", "url": "https://whdh.com/news/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "b741b2a8-dea1-495c-8276-90fee87b854a", "title": "Russian defense plan kicks off separate AI development push", "date": "2024-08-16 11:45", "url": "https://www.yahoo.com/news/russian-defense-plan-kicks-off-111314342.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MOSCOW — Russian officials have unveiled a new 10-year defense plan that includes a dedicated section on artificial intelligence, signaling Moscow’s focus on fielding autonomous weapons.\nElements of artificial intelligence have long been used in the Russian military industry, which is tightly controlled by the government.\nA specialized department for the development of artificial intelligence is now in place in the Russian Defense Ministry, Chernyshenko announced.\n“The Russian defense industry will develop artificial intelligence and automated systems for products with high speed, where errors are not so critical,” said Sergei Smyslov, an independent defense industry expert based in Russia.\nWith that in mind, potential applications include missile defense systems, artillery shells and aerial drones, he added."}, {"id": "19e53bc8-2f89-4d7a-9ff2-8c8b9b2dd13c", "title": "Mediators hold new Gaza cease - fire talks", "date": "2024-08-16 03:30", "url": "https://www.sunstar.com.ph/network/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.\nIsraeli and Palestinian media said that masked settlers stormed the village of Jit in the northern West Bank, setting homes and cars on fire."}, {"id": "ea1a7700-ebfb-459c-b04e-402189a19968", "title": "Secret Service OKs plan for Trump to continue outdoor rallies", "date": "2024-08-16 01:00", "url": "https://thesun.my/world/secret-service-oks-plan-for-trump-to-continue-outdoor-rallies-CN12867713", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WASHINGTON: The U.S. Secret Service has approved a new plan for Republican presidential candidate Donald Trump to continue outdoor rallies in the wake of a July assassination attempt, the Washington Post reported on Thursday.\nThe Secret Service did not immediately respond to a request for comment on the Washington Post report.\nFBI officials have yet to identify a motive for the suspected shooter, 20-year-old Thomas Crooks, who was shot dead by a Secret Service agent after opening fire.\nFollowing the attack, the Secret Service recommended that Trump avoid large outdoor events.\nTrump subsequently said he would continue outdoor rallies and that the Secret Service had “agreed to substantially step up their operation” to protect him."}, {"id": "3094d731-5d1b-40bf-a3f1-5806024ad9cf", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 09:30", "url": "https://www.durangoherald.com/articles/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×JERUSALEM (AP) — Mediators to the Gaza War cease-fire talks said Friday the two-day talks wrapped up and they aim to reconvene in Cairo next week to seal a deal to stop the fighting.\nHe also warned Iran — which backs Hamas, Hezbollah and Houthi rebels in Yemen, all of whom have attacked Israel since the Gaza war started — to stop the attacks.\nOn Thursday, the United States, Qatar and Egypt began a new round of cease-fire talks in Qatar.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "081b9d31-27c2-44db-ab9f-7adbf614a257", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.smh.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "4e040cd6-f40b-4516-8431-1c83c912a032", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.theage.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "a609cd9d-0eca-4101-8e89-8ce21fae4508", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 07:00", "url": "https://www.bostonglobe.com/2024/08/16/world/diplomacy-intensifies-halt-israel-hamas-war-prevent-wider-regional-conflict/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "British Foreign Secretary David Lammy and French Foreign Minister Stéphane Séjourné appeared hopeful after meeting Friday with Israeli Foreign Minister Israel Katz.\nKatz said in a statement that he told his British and French counterparts that if Iran attacks Israel, Israel expects its allies not just to help it defend itself, but to join in attacking Iran back.\nOn Thursday, the United States, Qatar and Egypt began a new round of cease-fire talks in Qatar.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "a99c6252-4921-4563-8b26-4eb53838f930", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:45", "url": "https://www.watoday.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "0a2ccbc3-733b-4291-9abd-05a15f6b9e8f", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.brisbanetimes.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "2bc6e97f-54c5-44d8-91fd-7692900100d8", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war", "date": "2024-08-16 13:45", "url": "https://kdhnews.com/news/nation/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try/article_fd733552-40a5-5f5b-b151-7717bffc1897.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "Thank you for reading!\nPlease purchase a subscription to read our premium content.\nIf you have a subscription, please log in or sign up for an account on our website to continue."}, {"id": "f265c784-bf61-4be8-a79b-7d9ba3738b7d", "title": "He Was Looking For HIMARS Near Pokrovsk : SSU Detains Taxi Driver Who Spied For Russians", "date": "2024-08-16 00:45", "url": "https://menafn.com/1108560792/He-Was-Looking-For-HIMARS-Near-Pokrovsk-SSU-Detains-Taxi-Driver-Who-Spied-For-Russians", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Security Service of Ukraine (SSU) has detained a Russian informant who, under the guise of a taxi driver, was collecting intelligence for the invaders in Donetsk region, in particular, tracking the basing points of HIMARS missile systems in the Pokrovsk direction.\nAccording to Ukrinform, this was reported by the SSU .\nThe Russians needed the intelligence to prepare new offensive operations and missile strikes in this area of the frontline.\nTo collect the information needed by the invaders, the man travelled around the area under the guise of a taxi driver, asking his passengers for information in the dark.\nHe was an active user of a Russian telegram bot that collects information about the deployment of the Ukrainian Armed Forces on the eastern front."}, {"id": "894da521-df93-4d52-b796-d4a7690734d6", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war", "date": "2024-08-16 11:30", "url": "https://www.aspendailynews.com/associated_press/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try/article_14d372bc-c523-51fa-b5a9-8739be3cd031.html", "domain": "aspendailynews.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Day 2 of cease-fire talks in Qatar as mediators try to prevent regional warThe White House says talks aimed at halting the Israel-Hamas war have resumed in Doha and are expected to run into Friday"}, {"id": "8a4d743d-097d-41c7-91c7-9b701e26fd40", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war – Winnipeg Free Press", "date": "2024-08-16 09:15", "url": "https://www.winnipegfreepress.com/world/2024/08/16/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try-to-prevent-regional-war", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Internationally mediated cease-fire talks in Qatar are expected to enter their second day Friday in an effort to prevent the war in Gaza from spreading into a wider regional conflict.\nMeanwhile, Israel’s foreign minister is set to meet with his counterparts from the United Kingdom and France on Friday to discuss preventing regional escalation.\nEgyptian foreign minister says immediate cease-fire in Gaza is needed to prevent a wider regional warBEIRUT — Egypt’s foreign minister said Friday that an immediate cease-fire in the Gaza Strip is needed to stop an escalation that could push the region into a wider war.\nHezbollah started attacking Israeli military posts on Oct. 8, a day after a Hamas-led attack on Israel triggered the war in Gaza.\nCease-fire talks set to enter Day 2 in DohaDOHA, Qatar — Qatar’s Foreign Ministry spokesperson Majed al Ansari said the cease-fire talks are still ongoing and will resume Friday."}, {"id": "bf143162-90a0-46c2-a478-d2f6c279c443", "title": "Mediators hold new Gaza cease - fire talks and hope to head off a wider war", "date": "2024-08-16 11:30", "url": "https://www.wafb.com/2024/08/15/more-than-40000-palestinians-have-been-killed-gaza-territorys-health-ministry-says/", "domain": "wafb.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nGRAPHIC WARNING: More than 40,000 Palestinians have been killed in 10 months of war in Gaza, health ministry says.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "fcbbd960-497d-4008-aed5-7022a9ec4148", "title": "Diplomacy to prevent the Israel - Hamas war from spreading intensifies", "date": "2024-08-16 09:30", "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-08-16-2024-cf0bb95a8a36cfabf1c6db8edf97c862", "domain": "apnews.com", "domain_classification": "International", "message": "JERUSALEM (AP) — Mediators to the Gaza War cease-fire talks said Friday the two-day talks wrapped up and they aim to reconvene in Cairo next week to seal a deal to stop the fighting.\nBritish Foreign Secretary David Lammy and French Foreign Minister Stéphane Séjourné appeared hopeful after meeting Friday with Israeli Foreign Minister Israel Katz.\nHe also warned Iran — which backs Hamas, Hezbollah and Houthi rebels in Yemen, all of whom have attacked Israel since the Gaza war started — to stop the attacks.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "07c9ac1f-ec06-426e-81b6-ddc2cd13b814", "title": "Russia says repelled 12 missiles targeting Crimea bridge", "date": "2024-08-16 14:00", "url": "https://thefrontierpost.com/russia-says-repelled-12-missiles-targeting-crimea-bridge/", "domain": "thefrontierpost.com", "domain_classification": "Unknown", "message": "MOSCOW (AFP): Russia said Friday that it had repelled a night-time attack using 12 US-made missiles on the landmark Crimea bridge built on the orders of President Vladimir Putin after Moscow annexed the peninsula.\n“Air defenses were used last night to deflect a group strike by 12 ATACMS missiles made in the US on the Crimean bridge.\nAll the missiles were destroyed,” the defense ministry said in a statement.\nKyiv has launched multiple attacks and attempted attacks on the Kerch Bridge since Moscow began its military offensive in February 2022.\nRussia’s defense ministry said earlier Friday that helicopters had destroyed five naval drones in the Black Sea heading for Crimea."}, {"id": "efdbc279-413a-4fa4-9d83-ea3511dcd478", "title": "Diplomacy intensifies to halt the Israel - Hamas war – NBC4 Washington", "date": "2024-08-16 09:30", "url": "https://www.nbcwashington.com/news/national-international/diplomacy-intensifies-to-halt-israel-hamas-war-and-prevent-wider-conflict/3695647/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nThe Israeli military says an airstrike hit a school and mosque in Gaza, where approximately 4,200 displaced people were reportedly seeking shelter.\nThe IDF says the school was the site of a Hamas command center, a claim which Hamas leadership has denied.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "c5ffe40a-b6eb-43ab-88aa-cb21579043b2", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 07:30", "url": "https://www.clickorlando.com/news/world/2024/08/16/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(AP Photo/Nasser Nasser)JERUSALEM – Mediators to the Gaza War cease-fire talks said Friday the two-day talks wrapped up and they aim to reconvene in Cairo next week to seal a deal to stop the fighting.\nHe also warned Iran — which backs Hamas, Hezbollah and Houthi rebels in Yemen, all of whom have attacked Israel since the Gaza war started — to stop the attacks.\nOn Thursday, the United States, Qatar and Egypt began a new round of cease-fire talks in Qatar.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "7a4bd75b-b4f1-467a-92aa-170ace6fbfdb", "title": "NATO main battle tanks are operating inside Russia in Kursk offensive", "date": "2024-08-16 06:30", "url": "https://www.wsws.org/en/articles/2024/08/16/gyio-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Sky News reported Thursday that British Challenger 2 main battle tanks have been deployed inside Russia as part of the NATO-Ukrainian offensive against Russia’s Kursk region.\nChallenger 2 main battle tanks flying the Ukrainian flagThe United States, Britain and Germany have given Ukraine hundreds of Abrams, Challenger 2 and Leopard 2 main battle tanks.\nBut the report by Sky News is the first confirmation that these vehicles have been used inside the Russian border by Ukrainian troops.\nIn recent days, Ukrainian troops carried out attacks on the region of Belgorod, where evacuations have also taken place.\nNow, the claims by NATO to be waging a “defensive” war are falling by the wayside, and NATO weapons are being used directly to wage an offensive war inside of Russia."}, {"id": "a6655abe-4909-4d2a-8154-f9c9eae511fd", "title": "Why the Wars in Ukraine and Gaza Wont Widen", "date": "2024-08-16 14:00", "url": "https://www.worldpoliticsreview.com/ukraine-israel-gaza-war/", "domain": "worldpoliticsreview.com", "domain_classification": "Unknown", "message": "There is widespread concern right now that we are about to find out, with both the war in Ukraine and the war in Gaza seemly poised to escalate into regional conflagrations.\nBut now Ukrainian forces are carrying out a major counteroffensive into Russian territory itself.\nRussian President Vladimir Putin has drawn a nuclear-use “red line” around Russian territory and has not been shy about repeatedly rattling the nuclear saber.\nIf Russia did use a nuclear weapon in Ukraine, would that draw a strong response from Kyiv’s NATO backers?\nIn Gaza, meanwhile, many have worried about the war spreading ever since Israel launched its military response to the Oct. 7 attacks by Hamas."}, {"id": "79f3b7ed-ccad-429f-81c5-efcb4cecc116", "title": "Mediators hold cease - fire talks , hope to prevent wider war", "date": "2024-08-16 01:15", "url": "https://www.stltoday.com/news/nation-world/mideast-gaza-israel-cease-fire-talks/article_8586cbe3-c81f-5e6e-a0d4-c7ea3f6e5e60.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to extend into Friday.\nHe said a lot of work remains given the complexity of the agreement and that negotiators were focusing on its implementation.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "d1bb8609-4305-4869-8a59-895010ad29d7", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 09:30", "url": "https://www.whec.com/national-world/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "whec.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Mediators to the Gaza War cease-fire talks said Friday the two-day talks wrapped up and they aim to reconvene in Cairo next week to seal a deal to stop the fighting.\nHe also warned Iran — which backs Hamas, Hezbollah and Houthi rebels in Yemen, all of whom have attacked Israel since the Gaza war started — to stop the attacks.\nOn Thursday, the United States, Qatar and Egypt began a new round of cease-fire talks in Qatar.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "db866aca-ec4b-4b1b-9107-78d73a11bb94", "title": "Mediators hold cease - fire talks , hope to prevent wider war", "date": "2024-08-16 01:30", "url": "https://omaha.com/news/nation-world/mideast-gaza-israel-cease-fire-talks/article_447c4624-f0bb-5f2d-b0b5-1df9e7c626de.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they're expected to extend into Friday.\nHe said a lot of work remains given the complexity of the agreement and that negotiators were focusing on its implementation.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "067e7623-0ee3-4099-85c6-98f8f986e36a", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war", "date": "2024-08-16 13:15", "url": "https://www.mymotherlode.com/news/world/3409018/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try-to-prevent-regional-war.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Day 2 of cease-fire talks in Qatar as mediators try to prevent regional warIsrael-Hamas war latest: Day 2 of cease-fire talks in Qatar as mediators try to prevent regional war View PhotoInternationally mediated cease-fire talks in Qatar are expected to enter their second day Friday in an effort to prevent the war in Gaza from spreading into a wider regional conflict.\nThe new push for an end to the Israel-Hamas war comes as the Palestinian death toll in Gaza climbed past 40,000, according to Gaza health authorities.\n“We confirm the importance of stopping the escalation and that the region does not slide to a comprehensive regional war,” Abdelaty told reporters after meeting with Lebanese Parliament speaker Nabih Berri, a key ally of Hezbollah.\nHezbollah started attacking Israeli military posts on Oct. 8, a day after a Hamas-led attack on Israel triggered the war in Gaza.\nCease-fire talks set to enter Day 2 in DohaDOHA, Qatar — Qatar’s Foreign Ministry spokesperson Majed al Ansari said the cease-fire talks are still ongoing and will resume Friday."}, {"id": "9d197022-bae2-4670-adca-773637eeed70", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict - LocalNews8 . com", "date": "2024-08-16 09:45", "url": "https://localnews8.com/news/2024/08/16/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "British Foreign Secretary David Lammy and French Foreign Minister Stéphane Séjourné appeared hopeful after meeting Friday with Israeli Foreign Minister Israel Katz.\nKatz said in a statement that he told his British and French counterparts that if Iran attacks Israel, Israel expects its allies not just to help it defend itself, but to join in attacking Iran back.\nOn Thursday, the United States, Qatar and Egypt began a new round of cease-fire talks in Qatar.\nIn a clear message to Israel, Hezbollah released a video Friday, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will only stop when the Gaza war ends."}, {"id": "731e759e-1d7b-4a11-bece-da5d8cbc2ee7", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 08:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/article_cb6890b9-ae27-59a0-b1a1-b38fe2782ee7.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "d718180e-3e62-42c4-856f-866ed42bd2ee", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbclosangeles.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3489411/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "264e58fd-39d8-471b-91e5-e5d6e60bce1e", "title": "Palestinian death toll in Gaza exceeds 40 , 000 as peace talks renew", "date": "2024-08-16 06:45", "url": "http://www.china.org.cn/world/2024-08/16/content_117370652.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People mourn victims killed in an Israeli airstrike in Gaza City, on Aug. 12, 2024.\n[Photo/Xinhua]The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has surpassed 40,000 as of Thursday, at a time when the Gaza ceasefire talks were set to resume in Qatar.\nIt took only five and a half months for the Palestinian death toll in the Gaza Strip to rise from 30,000 to 40,000.\nAccording to Gaza health authorities, an Israeli bombing of a field hospital in Deir al-Balah, central Gaza Strip, on July 27 resulted in at least 30 Palestinians killed and over 100 injured.\nThe Israel Defense Forces (IDF) said in a statement on Thursday that it is continuing operational activity in the Gaza Strip, \"eliminating terrorists and dismantling terrorist infrastructure.\""}, {"id": "a115e772-f8ae-4e09-8e61-5f7654b1228d", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 02:00", "url": "https://www.nbcconnecticut.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3364405/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "6ce7add2-5dcb-4b2b-a67a-180cb24d4c7e", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbcphiladelphia.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3945228/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "b14ef152-0c27-4d4b-a767-ad2b2ac4fb7b", "title": "Report points at Kyiv role in Nord Stream blasts ; Ukraine denies", "date": "2024-08-16 01:15", "url": "https://timesofindia.indiatimes.com/world/europe/report-points-at-kyiv-role-in-nord-stream-blasts-ukraine-denies/articleshow/112554076.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Ukrainian presidential adviser Mykhailo Podolyak Thursday denied his country's involvement in explosions which damaged the Nord Stream 2 gas pipeline .\nThe pipelines, transporting gas under the Baltic Sea, were ruptured by explosions in Sept 2022.\nHowever, Ukraine blamed Russia.\n\"Such an act can only be carried out with extensive technical and financial resources ... and who possessed all this at the time of the bombing?\nOnly Russia,\" Podolyak said."}, {"id": "f25cf4ec-63e2-4a72-8a1a-d39e85af152b", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 03:00", "url": "https://www.nbcmiami.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3393631/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "74240cf2-f70d-438e-89aa-42d8eb237519", "title": "US military presence in Syria carries substantial risks , but so does complete withdrawal", "date": "2024-08-16 12:30", "url": "https://theconversation.com/us-military-presence-in-syria-carries-substantial-risks-but-so-does-complete-withdrawal-235569", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "The group and its local affiliates now control much of the territory that the terrorist Islamic State group once controlled.\nMilitary presence todayAs of 2024, around 900 U.S. soldiers, along with an undisclosed number of contractors, are operating in Syria, according to the Defense Department.\nWhat an American withdrawal could meanThe U.S. military presence currently serves three purposes.\nThird, the U.S. and its local partners have reportedly detained around 5,000 Islamic State group fighters and 50,000 indoctrinated family members.\nBut for the time being, U.S. military presence in Syria continues and is emblematic of the broader challenges facing American foreign policy in the Middle East."}, {"id": "0c430e85-b0f9-4e38-adbd-3038dcfd715a", "title": "Lebanon Is Two States for One People – and Both of Them Are Waiting for Hezbollah - Middle East News", "date": "2024-08-16 03:45", "url": "https://www.haaretz.com/middle-east-news/2024-08-16/ty-article/.premium/lebanon-is-two-states-for-one-people-and-both-of-them-are-waiting-for-hezbollah/00000191-57e5-db91-a7dd-77edf0330000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "\"Journey, we're embarking on a journey, let's do the whole world in a single day.\nTo the west, to the east, perhaps there's no difference.\nIt doesn't matter where we go.\nWhat matters is that we're on a journey and we'll do the whole world in a single day.\""}, {"id": "f92eb673-c056-4730-b44f-09bda4268237", "title": "Hezbollah delays attack on Israel due to negotiations in Qatar - report", "date": "2024-08-16 07:00", "url": "https://www.jpost.com/breaking-news/article-814996", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Hezbollah may plan to hold off on a retaliatory attack against Israel while negotiations for a hostage deal are underway in Qatar, a source close to Hezbollah told the Washington Post, Army Radio reported Friday morning.\nHowever, in the backdrop of hostage deal negotiations in Qatar that began on Thursday, the source said the group believes retaliation can wait as it \"is not urgent or time-bound.\"\nAccording to the source, Hezbollah does not want to be responsible for disrupting a possible deal.\n\"Hezbollah will not launch its retaliation during the Qatar talks because the party does not want to be held accountable for disrupting the talks or a potential deal,\" the source said.\nHostage deal talks show promiseThe talks for a hostage deal, which are continuing on Friday, involve CIA Director William J. Burns and White House Middle East Coordinator Brett McGurk."}, {"id": "7bb8f15a-c3f0-4f30-be4b-c746384d4134", "title": "Ukraine Pivot Changes the Narrative in Russia war ; Outcome Remains Unclear | United States Institute of Peace", "date": "2024-08-16 00:00", "url": "https://www.usip.org/publications/2024/08/ukraines-pivot-changes-narrative-russias-war-outcome-remains-unclear", "domain": "usip.org", "domain_classification": "Unknown", "message": "Three Questions to WatchCan Ukraine’s strike into Russia’s Kursk region force Russia to slow its attacks in Ukraine’s Donbas?\nIn recent weeks, Russia has made slow, steady advances in Ukraine’s eastern Donbas region, threatening the towns of Niu-York, Pokrovsk and Chasiv Yar.\nUkraine’s latest conscription efforts have proven unpopular and a weary population has questioned whether continuing the war makes sense.\nThe Russian illegal annexation of Donetsk and Luhansk (and Ukraine’s Kherson and Zaporizhia provinces) codified this reality in Russian minds.\nUkraine’s recent attack into Russia’s internationally recognized territory may seem less distinct or new to those Russians who have fully imbibed Putin’s worldview."}, {"id": "b4c350bc-7d4d-43b0-9b80-0d6d444ae2db", "title": "Situation in Kursk Region : elimination of Ukrainian mobile groups , HIMARS launchers", "date": "2024-08-16 14:00", "url": "https://tass.com/politics/1830073", "domain": "tass.com", "domain_classification": "Unknown", "message": "Ukraine’s losses in the Kursk area have amounted up to 220 troops and 19 armored vehicles, the Russian defense ministry said.\nSituation in the region- Russia’s Battlegroup North has repelled an attack toward Russky Porechny and Gordeyevka in the Kursk Region.\n- Ukrainian mobile groups trying to advance deeper inside Russia’s territory were eliminated one kilometer west of Anastasyevka and 1.5 kilometer southeast of Kauchuk.\n- Ukrainian troops and vehicles were hit near Alexandria, Snagosti, Mirny, Kazachya Loknya, Korenevo, Pleskhovo, and Pushkarny.\n- Medical teams of more than 400 people have arrived to the Kursk Region from other Russian regions."}, {"id": "8725fb62-dfa5-4d67-a5eb-e8442e6a1c34", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-diplomat-says-ukraine-wouldnt-055302125.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nUkrainian presidential adviser Mykhailo Podolyak on Thursday denied his country was involved, and pointed the finger at Russia.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "70ff8375-d474-4849-b93d-3b3a46b6a5d1", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:30", "url": "https://www.thestar.com.my/news/world/2024/08/16/russia-diplomat-says-ukraine-wouldn039t-have-attacked-nord-stream-without-us-approval", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) - Russia's ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "cfd7a1d9-7507-43ab-90dd-ba5c77573c82", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:30", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Russia-diplomat-says-Ukraine-wouldn-t-have-attacked-Nord-Stream-without-US-approval-47668279/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) - Russia's ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "f850b8c2-4961-4957-960f-5d7a69c6763f", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 07:00", "url": "https://www.swissinfo.ch/eng/russia-diplomat-says-ukraine-wouldn", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia diplomat says Ukraine wouldn’t have attacked Nord Stream without US approvalreuters_tickers2 minutesMOSCOW (Reuters) – Russia’s ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n“They seek to shift all responsibility to their Ukrainian puppets,” Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n“We will seek to identify the real perpetrators of the bombing and punish them.”Russia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine – which has repeatedly denied involvement – was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without “the wink” from Washington."}, {"id": "24c9bf8a-8f9e-47d8-b0ae-06a5880ac7c7", "title": "Risk of regional war hangs over Gaza ceasefire talks", "date": "2024-08-16 09:30", "url": "https://www.bbc.co.uk/news/articles/c20rxr3pr50o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "If the leaks to local papers are true, even Israel’s defence chiefs are urging Prime Minister Benjamin Netanyahu to make a deal and agree a ceasefire in Gaza.\nSince Israel’s negotiators last made the trip to the Qatari capital for talks, the stakes - and the pressures - have only grown.\nIn Israel, the relatives of hostages still held in Gaza are calling this the “last chance” to get some of them out alive.\nIn Gaza, the Hamas-run health ministry - whose figures have been used by the UN and Israel in the past - says the number of people killed in Israeli operations there since the war began has now passed 40,000.\nThe US believes a truce in Gaza could help calm the entire region."}, {"id": "21fb4cd5-2a99-4657-b197-f4e43a38ef40", "title": "Taylor Swift excitement eclipses security fears for Wembley fans", "date": "2024-08-16 08:00", "url": "https://www.asiaone.com/world/taylor-swift-excitement-eclipses-security-fears-wembley-fans", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "LONDON — Fans arriving at Taylor Swift's concert in London on Thursday (Aug 15) said solidarity among fellow Swifties was helping to dispel any security concerns they had after her Vienna concerts were cancelled last week.\n\"Fancy meeting you here at Wembley Stadium, London,\" she told 92,000 cheering fans at the stadium, according to video clips posted on social media.\nIggy Wilde, 28, said she had never considered selling her ticket after the security scare in Vienna.\nFans arriving in Wembley, dressed in sequins and cowboy hats, had their forearms covered in friendship bracelets ready to swap with other Swifties.\nShe bought the London tickets from a friend after failing to find affordable tickets anywhere else."}, {"id": "5ec6d996-53ca-48b6-ad3d-512320a29927", "title": "Lamine Yamal father was stabbed after being  tricked  into meeting", "date": "2024-08-16 01:00", "url": "https://www.dailymail.co.uk/news/article-13748711/lamine-yamal-dad-stabbing-tricked-meeting-men-claims.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Barcelona star Lamine Yamal's father was stabbed after being tricked into meeting up with four men who fooled him into thinking they wanted to 'make peace' following a confrontation hours earlier, it was claimed last night.\nThe four members of the same family surrounded the Spanish international's father and started to punch and kick him before one allegedly stabbed him, the paper reported.\nWednesday night's stabbing in a car park in Mataro north of Barcelona followed an incident around 3pm earlier the same day.\nMounir spent a night in intensive care at Germans Trias i Pujol Hospital in Barcelona before being transferred to a normal ward.\nBarcelona president Joan Laporta was among those who visited him on Wednesday night in hospital following the stabbing."}, {"id": "8f1bfb15-cb20-45da-b9db-1b1e6d5fde62", "title": "Gaza ceasefire talks resume as death toll exceeds 40 , 000", "date": "2024-08-16 06:45", "url": "https://www.rte.ie/news/middle-east/2024/0816/1465251-israel-gaza/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Earlier, the Israeli military said it had hit an area in Khan Younis from where rockets were fired towards the community of Kissufim yesterday, finding weapons including shoulder-fired missiles and explosives.\nThe White House said late last night attacks by settlers on Palestinian civilians in the West Bank were \"unacceptable and must stop\".\nThree-month-old baby Rim was orphaned in an Israeli strike in Khan Younis and is now being looked after by her auntThe Israeli military said police and army units intervened and arrested one Israeli.\nThe White House said late yesterday that attacks by Israeli settlers on Palestinian civilians in the West Bank were \"unacceptable and must stop\".\nGaps include the presence of Israeli troops in Gaza, the sequencing of a hostage release and restrictions on the free movement of civilians from southern to northern Gaza."}, {"id": "19fdbdb2-a950-4cde-832f-698c60cb8950", "title": "Butler SWAT operator shot delayed Trump rally gunman before Secret Service killed him : report", "date": "2024-08-16 05:00", "url": "https://www.cbsnews.com/pittsburgh/news/butler-swat-operator-trump-rally-gunman/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "A report from Louisiana Congressman Clay Higgins said a Butler SWAT operator shot the gun of the gunman, Thomas Matthew Crooks, from about 100 yards away.\nThe shot delayed the shooter long enough for a United States Secret Service sniper to take the fatal shot.\nTwo weeks earlier, acting Secret Service Director Ronald Rowe Jr. testified before Congress.\nLocal law enforcement working the rally said they told the Secret Service they did not have the manpower to do it.\n\"Why do you think they did not take former president Trump off the stage?\""}, {"id": "14376110-8245-49d3-b6e2-4991c90ac835", "title": "The Latest Biden - Harris Betrayal of Israel Will Make Your Blood Run Cold", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-latest-biden-harris-betrayal-of-israel-will-make-your-blood-run-cold/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "The Biden-Harris regime is supposed to be an ally of Israel and occasionally sends signals to that effect, but its real loyalties are not hard to figure out.\nThe Biden-Harris regime is all about holding and increasing its power, and Israel is in the way of that aspiration right now.\nTo a regime that has never shown good faith and has repeatedly vowed the destruction of America as well as Israel?\nThe State Department was quick to deny the accuracy of the Kuwaiti report, and as damning as it is, that’s no surprise.\nAre those two dozen people suffering unimaginable horrors in Iranian prisons today because of the Biden-Harris regime’s anxiousness to betray Israel?"}, {"id": "8c23e2eb-b7c0-46bf-91af-e73ce503e6ed", "title": "Palestinian death toll in Gaza exceeds 40 , 000 as peace talks renew", "date": "2024-08-16 01:45", "url": "http://en.people.cn/n3/2024/0816/c90000-20206452.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Palestinian death toll in Gaza exceeds 40,000 as peace talks renewXinhua) 08:09, August 16, 2024People mourn victims killed in an Israeli airstrike in the southern Gaza Strip city of Khan Younis, on Aug. 14, 2024.\n(Photo by Rizek Abdeljawad/Xinhua)GAZA, Aug. 15 (Xinhua) -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has surpassed 40,000 as of Thursday, at a time when the Gaza ceasefire talks were set to resume in Qatar.\nIt took only five and a half months for the Palestinian death toll in the Gaza Strip to rise from 30,000 to 40,000.\nA man stands among the rubble after an Israeli airstrike in the Nuseirat refugee camp, central Gaza Strip, on Aug. 12, 2024.\nThe Israel Defense Forces (IDF) said in a statement on Thursday that it is continuing operational activity in the Gaza Strip, \"eliminating terrorists and dismantling terrorist infrastructure.\""}, {"id": "c8850478-46e2-407f-ab87-b3dbe7935434", "title": "Galway army barracks attack : Gardaí investigating potential terrorism link", "date": "2024-08-16 13:00", "url": "https://www.newstalk.com/news/army-chaplain-stabbed-several-times-in-attack-at-galway-army-barracks-1755746", "domain": "newstalk.com", "domain_classification": "Unknown", "message": "Gardaí are investigating whether a stabbing attack on a chaplain at a Galway army barracks was motivated by terrorism.\nAdvertisementA teenage boy was restrained at the scene by members of the Defence Forces before being arrested by Gardaí.\nTerrorismIn a statement this afternoon, Gardaí said they were now investigating whether the attack was linked to terrorism.\nAll will be well.”Shots firedIn a statement, the Defence Forces confirmed that shots were fired by on-duty soldiers during the attack.\nThe Garda investigation is ongoing."}, {"id": "dd823e3f-a3b3-427b-b571-e2a122ede968", "title": "Al - Qassam releases Kamikaze drone attack on Israeli forces", "date": "2024-08-16 12:30", "url": "https://www.albawaba.com/news/al-qassam-releases-kamikaze-drone-attack-1581644", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - The armed branch of Hamas, the Izz ad-Din al-Qassam Brigades, today released a video showing an attack on an Israeli-occupied building east of Khan Yunis in the southern Gaza Strip.\nThe video, which was taken on Thursday, shows how a camera-equipped kamikaze drone was deployed to attack the structure.\nA ground force member from Al-Qassam made the following statement before to the attack: \"By God's will, this kamikaze drone will deliver a swift and deadly blow, with His guidance and support.\"\nSimilar footage of \"Al-Zawari\" kamikaze drones being launched on Israeli military positions near the Gaza border and in the surrounding areas has already been made public by Al-Qassam.\nVideos showing the militants' attempts to repel the Israeli military's massive ground assault of Gaza have been regularly released by Al-Qassam since the invasion began in late October."}, {"id": "c7397129-e2fa-4860-bb58-528cd6406e82", "title": "Housemaid negligently sets four - bedroom apartment on fire", "date": "2024-08-16 09:30", "url": "https://theeagleonline.com.ng/housemaid-negligently-sets-four-bedroom-apartment-on-fire/", "domain": "theeagleonline.com.ng", "domain_classification": "Unknown", "message": "A female housemaid has negligently set a four-bedroom flat of her employer on fire on Thursday in Ilorin, the Kwara State capital.\nThis was confirmed in a statement by Hassan Adekunle, Head, Department of Media and Publicity, Kwara State Fire Service.\nAdekunle said the maid was trying to light the gas cooker while liquefied gas had already saturated the kitchen.\nAccording to him, the incident happened at about 10:42am at 6, Phase 1, off Baba-Soja Street, Akerebiata, Ilorin East Local Government Area of Kwara State.\nHe added: “The fire crew responded immediately to prevent further destruction and upon arrival, the firefighters encountered a four-bedroom flat bungalow fully engulfed in flames."}, {"id": "1e343c43-c4d9-4eca-9a86-f4923b874232", "title": "Watch : Russian Strategic Bomber Crashes In Siberia", "date": "2024-08-16 00:30", "url": "https://www.zerohedge.com/military/watch-russian-strategic-bomber-crashes-siberia", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "A Russian long-range strategic bomber has crashed over the Siberian region of Irkutsk in what was described as a routine flight.\nRussian state media was the first to report and confirm the crash, citing military officials.\n\"The plane crashed in an uninhabited area.\nIdentified as a nuclear-capable Tu-22M3 bomber, military officials say that the crash was due to technical malfunction.\nMore footage shows a plummeting plane which is on fire in Russia's far east...Reports that a Russian Tu-22M3 bomber crashed in Irkutsk Oblast, Russia tonight."}, {"id": "1ae4964c-098d-43f1-93a1-02437674d7ea", "title": "Kursk incursion : how Ukraine turned the tables and struck back at Russia", "date": "2024-08-16 11:00", "url": "https://www.theguardian.com/world/article/2024/aug/16/kursk-incursion-how-ukraine-turned-the-tables-and-struck-back-at-russia", "domain": "theguardian.com", "domain_classification": "International", "message": "It would not be long before the first casualties arrived and days of intense work would begin: Ukraine’s audacious invasion of Russia began the following morning.\nA few dozen Russian border guards, including young conscripts, were swiftly ambushed.\nEven allowing for the preparation, the success of the Kursk incursion is almost certainly greater than expected by Kyiv.\nThe number of prisoners of war available for exchange with Russia had been “further replenished”, he said, for the estimated 4,000 Ukrainians held in Russia.\nA Ukrainian soldier involved in the Kursk operation, sharing his opinion on condition on anonymity, captured the uncertainty ahead."}, {"id": "191fc52d-193b-4509-967d-b395151967ab", "title": "BBC commissions feature doc to mark 40th anniversary of Brighton Bomb | News", "date": "2024-08-16 12:00", "url": "https://www.c21media.net/news/bbc-commissions-feature-doc-to-mark-40th-anniversary-of-brighton-bomb/", "domain": "c21media.net", "domain_classification": "Unknown", "message": "BBC commissions feature doc to mark 40th anniversary of Brighton BombUK pubcaster the BBC has commissioned a feature-length documentary for BBC Two and iPlayer to mark the 40th anniversary this October of the Brighton hotel bombing.\nUnder the working title The Brighton Bomb, the doc includes new and exclusive testimony from those who were there or involved in the attack, in which the IRA attempted to assassinate the then prime minister Margaret Thatcher at the Grand Hotel in Brighton.\nThe Brighton Bomb is produced by KEO Films and Walk on Air, the makers of Once Upon a Time in Northern Ireland.\nIn other news, the BBC has also renewed long-running school-set drama Waterloo Road for a further two seasons, with new episodes be appearing on BBC iPlayer and BBC One until at least 2026.\nWaterloo Road is produced by Wall to Wall in coproduction with Rope Ladder Fiction."}, {"id": "8c5ef602-be64-4640-b7ad-3b1cfd1fba06", "title": "  It scary : Israeli frontline city in dark over port blast risks , residents in fear", "date": "2024-08-16 11:15", "url": "https://www.moneycontrol.com/news/world/its-scary-israeli-frontline-city-in-dark-over-port-blast-risks-haifa-residents-in-fear-12798783.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:'It's scary': Israeli frontline city in dark over port blast risks, residents in fear"}, {"id": "871b0504-215b-4ca7-b314-f03199e51db2", "title": "Fundraiser in hot water amid war - hit Kyiv hospital tender scandal", "date": "2024-08-16 10:30", "url": "https://www.dailysabah.com/world/europe/fundraiser-in-hot-water-amid-war-hit-kyiv-hospital-tender-scandal", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Following a Russian missile strike on Ukraine's largest children's hospital last month, fundraiser Yevhen Vember quickly mobilized over $9 million for urgent repairs.\nHowever, a tender for construction work at Kyiv's Okhmatdyt hospital was canceled after an investigative report by a prominent journalist suggested the bidding process was manipulated, leading to widespread criticism.\nHealth Minister Viktor Lyashko said he had asked police to review the hospital tender for signs of illegal activity.\nThe Health Ministry has established an advisory council of activists, donors, and other public figures to oversee the hospital reconstruction process.\nZhovnir, who said the tender winner was selected based on the fund’s recommendations, also added that he could have implemented more safeguards from the outset to address potential public concerns."}, {"id": "71f2a27a-9a6e-479f-8415-18db72e8dbb5", "title": "Ceasefire talks resume in Qatar as violence surges in Gaza", "date": "2024-08-16 09:30", "url": "https://www.hurriyetdailynews.com/ceasefire-talks-resume-in-qatar-as-violence-surges-in-gaza-199593", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Ceasefire talks resume in Qatar as violence surges in GazaDOHANegotiators seeking a Gaza ceasefire were scheduled to meet for a second day in Qatar on Friday, while top European diplomats were expected in Israel to stress the urgency of averting a wider war amid rising violence in Gaza.\nIsrael's main military supplier, the United States, has been mediating the talks with Qatar and Egypt.\nThe United States and its allies see the proposed Gaza truce as key to de-escalating soaring regional tensions, particularly with Iran.\nThe Gaza war has also drawn in Tehran-aligned groups in Iraq, Syria, and Yemen.\nThe Qatari foreign ministry said Gaza truce negotiations would continue on Friday."}, {"id": "805bf1ef-9479-4503-b860-84c259f24b74", "title": "Court of Appeals reverses conviction for former Lexington High School student found guilty in 2014 deadly stabbing", "date": "2024-08-16 01:30", "url": "https://www.wistv.com/2024/08/15/court-appeals-reverses-conviction-former-lexington-high-school-student-found-guilty-2014-deadly-stabbing/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS) - The South Carolina Court of Appeals reversed the conviction of a man who was found guilty in the deadly stabbing of a Dutch Fork High School student.\n“A mistrial is the equivalent of no trial and leaves the cause pending in the circuit court,” the South Carolina Court of Appeals said in court documents.\nIn reversing his conviction, the South Carolina Court of Appeals ordered the trial court to give Dennis a new immunity hearing.\nUltimately, the South Carolina Court of Appeals found the proper course was to remand for a new immunity hearing.\n“The circuit court is in the best position to assess witness credibility and make the necessary findings of fact,” said the South Carolina Court of Appeals in the court documents."}, {"id": "684311c5-9f7b-4f74-a4a0-2be0714a9ab9", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "10news.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "c05e8cd4-c639-4e52-8384-ee71051a4957", "title": "  It scary : Israeli frontline city in dark over port blast risks", "date": "2024-08-16 11:30", "url": "https://www.digitaljournal.com/world/its-scary-israeli-frontline-city-in-dark-over-port-blast-risks/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "He, like everyone else in the port city, just 30 kilometres (less than 20 miles) from the Lebanese border, has been left in the dark about the risks from the industrial area — and so fears the worst.\nShe recalls Haifa’s past grassroots campaigns to relocate the industrial area away from residential areas, mostly without success.\nTashan, the state-owned company responsible for the oil storage site, did not respond to AFP requests for comment.\nRaja Zaatry, a Haifa city councillor, remembers the battle with private and government companies to get ammonia stocks relocated to the Negev desert.\n“I don’t know exactly what are the materials, but we know it’s dangerous materials and it’s making also pollution."}, {"id": "b1e05d69-df5e-45c0-b1f2-3e74f06efc78", "title": "  Dehumanising  conditions prevent aid reaching Gaza", "date": "2024-08-16 06:45", "url": "https://www.rte.ie/news/middle-east/2024/0816/1465243-gaza-icrc/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "\"I've worked in several conflict zones and the level of devastation is nothing I've ever seen before,\" Mr Schomburg told RTÉ News.\nHe said the biggest obstacle to the Red Cross providing humanitarian aid is the prevailing insecurity and unabated hostilities.\nHe described as \"mind boggling\" the logistical difficulties his teams encounter at border crossing, which prevents life-saving aid reaching those who need it.\nDescribing scenes at the hospital, Mr Schomburg became quite emotional saying: \"To see children with double amputations and severe burns, civilians that are so clearly not part of the fight, is difficult.\"\nHe said Gaza was not an easy place to live before the war but that people still had hope."}, {"id": "3c073d79-cc72-4b8e-b8a9-9a7b272c0d37", "title": "Ukraine F - 16s may be getting long - range cruise missiles to hit targets hundreds of miles away : report", "date": "2024-08-16 14:15", "url": "https://www.yahoo.com/news/ukraines-f-16s-may-getting-130911192.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's F-16s may be getting long-range cruise missiles to hit targets hundreds of miles away: reportUkraine's F-16s may be getting long-range cruise missiles to hit targets hundreds of miles away: reportThe US is in discussions to send long-range cruise missiles to Ukraine, a US official told Politico.\nThis would allow Ukraine's F-16 fighter jets to hit targets hundreds of miles away.\nThe Biden administration is considering sending long-range cruise missiles for Ukraine's new F-16 fighter jets so they can hit targets more than 200 miles away, Politico reported.\nThe delivery of the Joint Air-to-Surface Standoff Missile, or JASSM, could significantly extend the range of Ukraine's F-16s to 370 kilometers, or about 230 miles.\nBut a video of a Ukrainian F-16 shared by Ukrainian President Volodymyr Zelenskyy earlier this month hinted at how Ukraine could use them."}, {"id": "0214624c-b6b1-49f9-9ddb-98dcff87b2d4", "title": "High - stakes Gaza ceasefire talks are underway . Here what to know", "date": "2024-08-16 14:00", "url": "https://www.cnn.com/2024/08/16/middleeast/gaza-ceasefire-talks-underway-what-to-know-intl", "domain": "cnn.com", "domain_classification": "International", "message": "Here’s what we know about the status of the talks so far.\nWhile inconclusive so far, Thursday’s talks marked “a promising start,” National Security Council spokesman John Kirby said as they got underway in Doha.\nUS President Joe Biden presents a ceasefire proposal at the White House on May 31.\nIt instead asked mediators for a plan to implement a ceasefire proposal put forward by Biden.\nA Hamas source told CNN on Wednesday that the group has adopted a position of “intentional ambiguity” over whether it will attend ceasefire talks, adding that its position on a potential ceasefire is firm whether not it attends the talks."}, {"id": "da3789db-c279-4594-bf7e-ca4492dc9da2", "title": "Wall Street Journal : Ukrainian President Zelensky approved Nord Stream pipeline attack", "date": "2024-08-16 06:30", "url": "https://www.wsws.org/en/articles/2024/08/16/dibd-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "This was reported by the Wall Street Journal (WSJ) on August 14, citing several unnamed sources in the Ukrainian military apparatus.\nU.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky in Paris, Friday, June 7, 2024.\nPresident Joe Biden even openly threatened an attack two weeks before the start of the Ukraine war.\nLike Zelensky, Zaluzhny could not take a single step without the consent of the US.\nThe real role of the American and German governments in the Nord Stream attack remains in the dark."}, {"id": "7b44817e-d574-4767-b1c6-5a8e7aaff00e", "title": "As Gaza toll passes 40 , 000 , the dead are buried in yards , streets , stacked graves", "date": "2024-08-16 09:30", "url": "https://www.theage.com.au/world/middle-east/as-gaza-toll-passes-40-000-the-dead-are-buried-in-yards-streets-tiered-graves-20240816-p5k2vv.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Trucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\n“This does not exist in Gaza.”Twenty-five members of Fares’ family were killed by an airstrike on October 13 in northern Gaza.\nThere’s no sign of Mohammed’s body, Jomaa said.\nJomaa said that come the end of the war, he plans to visit Gaza to search for Mira’s remains.\nSmashed graves and cemeteries off-limits Israeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "75050054-8267-46a0-a1b6-a62ab761bf6d", "title": "Russia Ukraine war latest : Kyiv troops seize largest Russian town yet as Zelensky hints at further offensives", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-kursk-offensive-challenger-2-b2597203.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Ukrainian forces have advanced up to 15 miles into Russia’s Kursk region, the UK ministry of defence (MoD), as they continue to take advantage of Moscow’s “disarray and disorganisation”.\nIn an update on X, formerly Twitter, the British MoD said Russia’s defensive lines in Kursk were “not prepared to respond to a multi-battalion assault force.\n“Ukrainian forces have penetrated Russia’s Kursk region to a depth ranging between 10 and 25 km (six and 15 miles) over a frontage of approximately 40 km,” they wrote.\nThe MoD added in its update that Moscow has also started “constructing additional defensive positions” to further halt the Ukrainian attack."}, {"id": "910748a8-9298-42e3-9eeb-2be201ba4ca6", "title": "As Gaza toll passes 40 , 000 , the dead are buried in yards , streets , stacked graves", "date": "2024-08-16 09:30", "url": "https://www.brisbanetimes.com.au/world/middle-east/as-gaza-toll-passes-40-000-the-dead-are-buried-in-yards-streets-tiered-graves-20240816-p5k2vv.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Trucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\n“This does not exist in Gaza.”Twenty-five members of Fares’ family were killed by an airstrike on October 13 in northern Gaza.\nThere’s no sign of Mohammed’s body, Jomaa said.\nJomaa said that come the end of the war, he plans to visit Gaza to search for Mira’s remains.\nSmashed graves and cemeteries off-limits Israeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "0611ddff-a617-4ee2-8d7d-5ef360ca2604", "title": "Once a death - row inmate , this Oakland man will go free next year", "date": "2024-08-16 06:30", "url": "http://www.sfchronicle.com/bayarea/article/death-row-inmate-oakland-man-go-free-next-year-19659379.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "All because of what Alameda County District Attorney Pamela Price said amounted to prosecutorial misconduct in the jury selection process three decades ago.\nThe jurors imposed a death sentence.\nDykes appealed his convictions and death sentence — first in state court, then in federal court, after the state Supreme Court upheld the case.\nIn a motion that sought a new sentence for Dykes, Price’s office described the prosecutors’ actions as prosecutorial misconduct, citing it as grounds for a new sentence for Dykes.\nAs part of the ongoing review of the county’s death sentences, the office reached a resolution in two other cases."}, {"id": "0718a1db-1d70-4556-bfba-77dda1cc7695", "title": "Suspect arrested after convenience store employee stabbed", "date": "2024-08-16 03:15", "url": "https://www.yahoo.com/news/suspect-arrested-convenience-store-employee-003217359.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (FOX 5/KUSI) — A man was arrested Thursday after a stabbing at a convenience store in downtown San Diego, authorities said.\nThe stabbing occurred around 1 p.m. at an A-Mart located at 1255 Imperial Avenue, the San Diego Police Department said in a news release.\nWhile store employees were removing the suspect from the store due to him being intoxicated and causing a disturbance, the suspect pulled out a knife and lunged at one of the employees, according to police.\nTransit security initially detained the suspect, identified as 36-year-old Juan Flores-Puga, who was then arrested by SDPD.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "76563d99-b4ea-4ca3-aff4-2d7ece0a9bdc", "title": "Russia - Ukraine war LIVE : Explosions rock Crimea | World | News", "date": "2024-08-16 07:45", "url": "https://www.express.co.uk/news/world/1936762/russia-ukraine-war-live-explosions-crimea", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin's ally has claimed Ukraine's shock incursion into enemy territory is bringing the world to the \"brink of a third world war\", Russian state media reports.\nHe also claimed without evidence that NATO members had given their approval of the incursion, which the US rejected.\nIt comes after Ukraine's forces launched a surprise advance through the border into Kursk last Tuesday with subsequent significant advances forcing Russia to evacuate over 200,000 people.\nThe UK's Ministry of Ministry has said Ukrainian forces have now pushed as far as 15 miles into the Kursk region, with Russian border defences \"in disarray\".\nPutin has transferred \"several thousand troops\" across the border into Russia in response to the Ukrainian advance, which sparked anger and confusion in Moscow, The White House has said."}, {"id": "350e6a7f-2626-4643-bd32-f864ff40b62f", "title": "Hours - long standoff in Eugene ends in officer - involved shooting", "date": "2024-08-16 06:45", "url": "https://kval.com/news/local/hours-long-standoff-in-eugene-ends-in-officer-involved-shooting", "domain": "kval.com", "domain_classification": "Unknown", "message": "An hours-long standoff in Eugene led to an officer involved shooting with a wanted suspect for attempted murder.\nIt when officers identified the suspect as someone wanted out of Portland.\nResidents witnessed the frightening two-and-a-half-hour standoff that ended with officers shooting the suspect - an incident continuing to echo throughout the community.\n\"We heard a bullhorn outside of our apartment saying, 'Put your hands outside the window,'\" recalls neighborhood resident Jonathan Guske.\nWithem-Breeding says police were standing on her property during what Withem-Breeding calls a terrifying standoff."}, {"id": "b966d215-bb5c-4ce4-a7c4-f6cd2171bb7e", "title": "Two stabbed in Huntington Thursday , both hospitalized", "date": "2024-08-16 02:30", "url": "https://wvmetronews.com/2024/08/15/two-stabbed-in-huntington-thursday-both-hospitalized/", "domain": "wvmetronews.com", "domain_classification": "Unknown", "message": "HUNTINGTON, W.Va. — Two people are recovering at a hospital after a reported stabbing in Huntington Thursday.\nThe stabbing occurred along 6th Avenue in Huntington.\nThere has been no further information given on names of those involved or their condition."}, {"id": "64f8410c-aa0a-47e4-af60-3ffc22659702", "title": "  I dont know why it happened : Dog daycare owner confused about random shooting", "date": "2024-08-16 02:15", "url": "https://www.ksat.com/news/local/2024/08/15/i-dont-know-why-it-happened-dog-daycare-owner-confused-about-random-shooting/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "These were the emotions that Stephanie Garza, owner of Pup Pup & Away, felt after her business was randomly shot at around 2 a.m. Tuesday.\nGarza told her team to leave the premises before the cops got there.\nThe shooting confused Garza because she didn’t know if it was a personal or targeted attack on her business.\nLastly, Garza had a message for the person or people who were responsible for the random shooting, and that is: “Just don’t.”“Just don’t do what you’re doing.\nIf this was kind of some initiation of some sort, find a different way,” Garza said."}, {"id": "a194d169-9918-4f29-a70f-fa9544f7811a", "title": "EPA Busts Small Nebraska Dealer", "date": "2024-08-16 12:45", "url": "https://autos.yahoo.com/epa-busts-small-nebraska-dealer-180000595.html", "domain": "autos.yahoo.com", "domain_classification": "Unknown", "message": "Read the full story on The Auto WireEPA Busts Small Nebraska DealerThe EPA continues taking down American businesses for what it calls violations of the Clean Air Act, the latest one being a small Ford dealership in Nebraska.\nAt least this time federal regulators didn’t nuke the business into oblivion with fines and such, something they’ve done and celebrated repeatedly.\nIt was back on April 28 when EPA agents descended on this little dealership with a search warrant.\nEPA agents even had one truck owner bring his vehicle in for an inspection.\nStory continuesThis is the thing with federal regulators left only symbolically checked by Congress: they run amok."}, {"id": "26c3ed35-e954-4f52-8422-ae4e3ea2761c", "title": "Netanyahu knows he needs this war to shore up support . Iran should not give him what he wants | Seyed Hossein Mousavian", "date": "2024-08-16 11:30", "url": "https://www.theguardian.com/commentisfree/article/2024/aug/16/israel-iran-us-war-netanyahu-masoud-pezeshkian", "domain": "theguardian.com", "domain_classification": "International", "message": "Israel carried out this assassination with the apparent intention of drawing the US into a war with Iran.\nThe scale of Iran’s response will determine whether the US gets involved.\nNeither Israel nor the US truly wants a war with Iran but, as Biden said in a recent interview, there is “every reason” for people to think Netanyahu is deliberately prolonging the war in Gaza for political reasons.\nUnderstandably, Iran needs its response to be significant enough that it’s seen as a deterrent.\nRather than a direct retaliatory military strike on Israel, Iran should focus on how to hold Netanyahu accountable."}, {"id": "76a759de-3bd9-45d3-b011-f8bcddf4c0ea", "title": "  God is With Us , Man  - Resistance Roundup - Day 314", "date": "2024-08-16 02:30", "url": "https://www.palestinechronicle.com/god-is-with-us-man-resistance-roundup-day-314/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "Below are the latest statements by the two main Resistance forces in Gaza, and the Lebanese Resistance Movement Hezbollah.\nAl-Qassam Brigades (Hamas)“Al-Qassam Brigades target the main concentration of enemy forces at the “Mars” military site with short-range Rajoom rockets.\n“The Islamic Resistance has added the new settlement of Shamir to its fire plan and bombarded it for the first time with barrages of Katyusha rockets.\n“The fighters of the Islamic Resistance, at 6:00 PM on Thursday, 15-08-2024, targeted the Israeli enemy’s artillery positions in Zaoura with a barrage of Katyusha rockets.\n“The fighters of the Islamic Resistance, at 17:40 PM on Thursday, 15-08-2024, targeted the Marj site with appropriate weapons, hitting it directly.”(The Palestine Chronicle)"}, {"id": "fa9aaa27-5a62-413a-b26e-9f7851e50eff", "title": "Secret Service beefs up security for Trump , including with bulletproof glass", "date": "2024-08-16 07:30", "url": "https://www.cnn.com/2024/08/15/politics/secret-service-trump-bulletproof-glass/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —The Secret Service has begun bolstering Donald Trump’s security detail and plans to surround the former president with bulletproof glass at campaign rallies.\nA senior official told CNN that additional security measures also include increasing the number of agents and certain technological changes, though the official declined to provide more details for security reasons.\nFor Trump, the Secret Service will strategically place the glass around the country in areas where Trump is expected to visit because the agency doesn’t have its own aircraft, the official told CNN.\n“It is a significant undertaking when it comes to logistics,” the official told CNN.\nThe official told CNN that the glass could be used in both indoor and outdoor locations depending on the security at each location."}, {"id": "dccd2bad-0057-4db3-8572-9346be17b3ef", "title": "Strike at world largest copper mine exposes Boric government and union apparatus in Chile", "date": "2024-08-16 01:30", "url": "https://www.wsws.org/en/articles/2024/08/15/pshd-a15.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "In northern Chile, workers at Escondida, the largest copper mine in the world, went on strike Tuesday after contract negotiations broke down with majority owner BHP, an Australian-based conglomerate.\nMiners at the Escondida Mine, Chile [Photo by Duratray / CC BY-SA 4.0Escondida produces 5.4 percent of global copper output and represents 2.5 percent of the Chilean economy.\nBoric already showed his willingness to deploy police against striking copper miners in June 2022.\nThen, the Federation of Copper Workers (FTC) shut down the strike, which involved 52,000 workers who opposed the closing of a foundry.\nThe jobs and conditions for miners and workers in Chile cannot be secured through subordination to the Boric administration and its allies in the unions."}, {"id": "2914f226-36a0-4b3b-90c4-4d429f7927d4", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 06:15", "url": "https://abcnews.go.com/International/wireStory/ukraines-swift-push-kursk-region-shocked-russia-exposed-112884154", "domain": "abcnews.go.com", "domain_classification": "International", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nKyiv remains tight-lipped about whether it intends to seek a foothold in the Kursk region or pull back into Ukrainian territory."}, {"id": "5f64fd4f-81ce-4000-b265-0abbfc61452f", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 07:00", "url": "https://www.ksat.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "ef8068b0-fe74-48a6-a801-e2c85f7dd0d4", "title": "", "date": "2024-08-16 12:45", "url": "https://www.israelnationalnews.com/news/394727", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Israeli Minister of Foreign Affairs Israel Katz met on Friday with French Foreign Minister Stéphane Séjourné and British Foreign Secretary David Lammy who arrived in Israel to prevent a regional escalation and to promote a hostage deal.\nKatz made clear to his French and British counterparts that Israel expects France and the UK to publicly inform Iran that it may not attack Israel and that if Iran attacks, the US-led coalition will join Israel, not only in defense but in offense against significant targets in Iran as well.\nKatz made it clear that Israel would have to respond forcefully to a strike against it.\nHe added that Israel is interested in a deal to bring to the release of the hostages and will do everything in the negotiations to advance this deal.\nThe Minister warned his counterparts that Hamas is liable to toughen its stance and wait for an Iranian attack on Israel as an alternative to negotiations."}, {"id": "cad6eeaf-27fe-44d6-bf0d-54debedbce87", "title": "Ukraine gains in Russian territory are Putin worst nightmare", "date": "2024-08-16 10:30", "url": "https://www.biznews.com/global-citizen/2024/08/16/ukraine-gains-putins-nightmare-james-stavridis", "domain": "biznews.com", "domain_classification": "Unknown", "message": "Ukraine’s recent military gains in Russian territory mark a significant shift in the ongoing conflict.\nNow, for the first time in the 21st century, an invading military power, Ukraine, is in possession of hundreds of square miles of Russian territory, capturing Russian military prisoners and forcing a state of emergency and evacuations in the Belgorod and Kursk regions.\nBut their bold move has changed perceptions of Ukraine’s military competence.\nEven that will be difficult against a determined Russian military response, which is sure to come.\nBut the picture of Russian jets bombing Russian villages to drive out Ukrainian soldiers is surely a compelling one for Kyiv."}, {"id": "0f5bca6d-2b7b-4996-9fac-f9bb411f8ddf", "title": "Call of Duty next set up of updates will shrink the game file size", "date": "2024-08-16 00:45", "url": "https://www.windowscentral.com/gaming/the-roadmap-to-black-ops-6-includes-new-optimizations-to-the-call-of-duty-experience-including-smaller-downloads-and-streamlined-menus", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "A new series of updates is set to deploy ahead of the launch of Call of Duty: Black Ops 6 in October.\nThe road to Black Ops 6 starts with MW3 Season 5.5Activision and the Call of Duty Team have shared a roadmap of updates to the Call of Duty HQ experience.\nPreparing for the Black Ops 6 Open BetaThe Call of Duty: Black Ops 6 open beta begins on August 30.\nCall of Duty: Black Ops 6 is available for preorder now.\nOur helpful guide can help you choose between the Vault Edition and Standard Editions of Black Ops 6."}, {"id": "b56a8dde-3aa3-45c0-99b4-f818e6861362", "title": "China military AI detects secret radar links between South China Sea , Alaska and Guam", "date": "2024-08-16 06:30", "url": "https://www.thestar.com.my/tech/tech-news/2024/08/16/chinas-military-ai-detects-secret-radar-links-between-south-china-sea-alaska-and-guam", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "Chinese electronic warfare AI has detected mysterious signals that repeatedly show up in the South China Sea, Guam, the Marshall Islands and the Aleutian Islands near Alaska – and they appear to be coordinated.\nThey published their findings in a peer-reviewed paper in the Journal Of Terahertz Science And Electronic Information Technology in May.\nThis information helps the Chinese military better plan electronic warfare tasks such as electromagnetic suppression, deception, and jamming.\nThe electronic warfare AI works with other intelligence platforms, such as imaging satellites, to cross-check its findings.\nThe PLA’s electronic warfare equipment has made rapid progress in recent years, and its electronic warfare strategy has become proactive, while the United States sometimes finds itself on the defensive."}, {"id": "a728a52b-1250-4104-abcd-a20feebb1d6a", "title": "Consigliere Putin , Nato ha aiutato attacco di Kiev a Kursk  ", "date": "2024-08-16 08:00", "url": "https://www.giornaledibrescia.it/italia-e-estero/consigliere-putin-nato-ha-aiutato-attacco-di-kiev-a-kursk-tz7xlrw0", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "ROMA, 16 AGO - La Nato e \"i servizi speciali occidentali\" sono direttamente coinvolti nella pianificazione dell'attacco dell'Ucraina alla regione russa di Kursk, secondo quanto asserisce il principale consigliere di Vladimir Putin, Nikolai Patrushev, citato da Tass.\n'E' stato l'Occidente a portare al potere la giunta criminale in Ucraina.\nI Paesi Nato hanno inviato armi e istruttori militari in Ucraina, continuano a fornire informazioni d'intelligence e controllano le azioni dei gruppi neonazisti.\nE l'operazione nella regione di Kursk è stata pianificata con la partecipazione della Nato e dei servizi speciali occidentali\", ha detto Patrushev."}, {"id": "d1afdd57-ff06-4e31-9ad3-a6bfb900e51b", "title": "Is the Story of  The Few  More Myth Than Reality ? ", "date": "2024-08-16 12:45", "url": "https://www.historytoday.com/archive/head-head/story-few-more-myth-reality", "domain": "historytoday.com", "domain_classification": "Unknown", "message": "Second, the British aircraft industry outproduced German fighter output by a wide margin during the battle: 2,091 against 988.\n‘This risks setting up an unproductive false binary, which equates myth with lies’Frances Houghton, Simon Research Fellow, University of ManchesterHumans need heroes.\nHowever, in thinking about the story of ‘the Few’ it’s important not to fall into the trap of pitting ‘myth’ against ‘reality’.\nThis risks setting up an unproductive false binary, which equates ‘myth’ with lies.\nAn invitation to contrast myth and reality is an invitation to reflect on the stories we tell ourselves and the meanings we ascribe to them."}, {"id": "dd18daa7-6cb2-44d1-b750-19634a6e83cb", "title": "China military AI detects secret radar links between South China Sea , Alaska and Guam", "date": "2024-08-16 02:30", "url": "https://www.scmp.com/news/china/science/article/3274610/chinas-military-ai-detects-secret-radar-links-between-south-china-sea-alaska-and-guam", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Chinese electronic warfare AI has detected mysterious signals that repeatedly show up in the South China Sea, Guam , the Marshall Islands and the Aleutian Islands near Alaska – and they appear to be coordinated.\nThey published their findings in a peer-reviewed paper in the Journal of Terahertz Science and Electronic Information Technology in May.\nThis information helps the Chinese military better plan electronic warfare tasks such as electromagnetic suppression, deception, and jamming.\nThe electronic warfare AI works with other intelligence platforms, such as imaging satellites, to cross-check its findings.\nThe PLA’s electronic warfare equipment has made rapid progress in recent years, and its electronic warfare strategy has become proactive, while the United States sometimes finds itself on the defensive."}, {"id": "57036157-7bea-4507-94f0-f35e519f7ac9", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities – Winnipeg Free Press", "date": "2024-08-16 04:45", "url": "https://www.winnipegfreepress.com/world/2024/08/15/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "ecfcadc6-760b-477a-b12d-987ead138cd0", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 07:00", "url": "https://www.clickorlando.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "438cd7e6-587a-4fdd-b3af-cc04886796f9", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 06:30", "url": "https://www.wsls.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "7c70d5a6-9100-4289-900c-accb9793a6c0", "title": "Supercarrier USS George H . W . Bush Now Has First Of its Kind Drone Control Center", "date": "2024-08-16 02:15", "url": "https://www.yahoo.com/news/supercarrier-uss-george-h-w-011616791.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Bush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nBush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nNaval Air Systems Command (NAVAIR) announced the completion of George H.W.\nFurthermore, “CVN 77’s UAWC lays the foundation for how the U.S. Navy will operate and control unmanned aircraft, and perhaps other unmanned vehicles, with UMCS,” Capt.\nThe Navy has now taken a major step forward toward its larger uncrewed naval aviation vision with the completion of the new drone control center on the USS George H.W."}, {"id": "788a9b9b-3b47-4eb9-8335-b88eae361536", "title": "Secret Russian Counter - Drone EW System Recovered by Ukraine in Kursk Region", "date": "2024-08-16 10:15", "url": "https://www.kyivpost.com/post/37479", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "An editor from the Censor.net news site posted a video on his Facebook channel on Aug. 14 showing the secret Russian Volnorez (Breakwater) counter-drone electronic warfare (EW) system recovered by Ukrainian forces in the Kursk region along with its technical documentation being unpacked.\nThis system is considered one of the most advanced and secretive in Russia's defense arsenal.\nMoscow’s troops consider it be an essential tool in its war with Ukraine.\nUkraine’s recovery of a complete Volnorez system, complete with technical documentation, could have implications beyond Kyiv’s current operations in the Kursk region.\nUkraine could even modify its own technology to combat the Kremlin’s FPV and surveillance drones to aid defense."}, {"id": "513e2963-2309-4396-8d24-27c28f7e6fc2", "title": "Fighting Knights to appear at Goodrich Castle , Herefordshire", "date": "2024-08-16 06:30", "url": "https://www.herefordtimes.com/news/24511946.fighting-knights-appear-goodrich-castle-herefordshire/", "domain": "herefordtimes.com", "domain_classification": "Unknown", "message": "English Heritage will be welcoming some special guests to Goodrich Castle in Herefordshire this summer.\nOn the weekend of August 17 and 18, two chivalric warriors will be fighting for glory at Fighting Knights.\nThere will be interactive family activities for everyone to get involved in that will transport you back to the castle’s medieval heyday.\nEntry to Fighting Knights is included in the price of admission.\nFor more information on Goodrich Castle, visit www.english-heritage.org.uk."}, {"id": "78977e0e-58dd-4bf9-b2ca-a92f8d2b2a4f", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities | Nation", "date": "2024-08-16 09:30", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/ukraine-s-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/article_4c97a77b-d67b-5d9c-a4de-0bfe0b105425.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "A daring Ukrainian military push into Russia’s Kursk region has seen Kyiv’s forces seize scores of villages, attack air bases and force the evacuation of tens of thousands of civilians in what has become the largest attack on the country since World War II"}, {"id": "4fcbad8d-a629-4f67-9fe5-a64be519dfb7", "title": "Russian Army Loses 1 , 330 Soldiers In Ukraine Over Past Day", "date": "2024-08-16 07:45", "url": "https://menafn.com/1108561403/Russian-Army-Loses-1330-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia lost about 596,950 in Ukraine between February 24, 2022 and August 16, 2024, including 1,330 killed or wounded in action in the past 24 hours.\nThe General Staff of the of Ukraine said this in a post on , Ukrinform reports.\nSince the war began, Ukraine's defense forces have destroyed 8,496 Russian tanks (including 12 in the past day), 16,461 (+35) armored fighting vehicles, 16,927 (+59) artillery systems, 1,159 (+5) multiple rocket launchers, 922 anti-aircraft warfare systems, and 2,429 (+1) cruise missiles.\nThe Russian army also lost 367 warplanes, 328 helicopters, 13,659 (+61) tactical unmanned aerial systems, 28 warships/cutters, 1 submarine, 22,848 (+73) vehicles and fuel tankers, and 2,829 (+16) pieces of special equipment."}, {"id": "50aa03f4-eb28-42e0-a731-d2b4f66d16ee", "title": "Art and cultural property repatriation | Meaning , Laws , Museums , Examples , & Difficulties", "date": "2024-08-16 05:15", "url": "https://www.britannica.com/topic/art-and-cultural-property-repatriation", "domain": "britannica.com", "domain_classification": "Unknown", "message": "art and cultural property repatriationTable of ContentsAsk the Chatbot a QuestionAsk the Chatbot a Questionart and cultural property repatriation, the return of art or other cultural objects to their country or culture of origin.\nProponents of repatriation see cultural objects as belonging to the countries or cultures where they were produced or, in the case of historical or archaeological materials, found.\nOpponents of repatriation see these materials as part of a universal human culture and argue that, because cultures are neither isolated nor fixed, repatriation proponents are perpetuating a narrow nationalism.\nProponents of repatriation view many of the foreign objects in Western museums as having been taken through illicit or immoral means.\nOpponents of repatriation contend that many of the objects were gathered in a way that was considered legal and moral at the time."}, {"id": "a362aed0-3412-4701-8f80-fd9434cb5d3d", "title": "All Fortnite Chapter 5 Season 4 battle pass skins list", "date": "2024-08-16 11:45", "url": "https://www.polygon.com/fortnite-guide/440525/battle-pass-skins-chapter-5-season-4-marvel", "domain": "polygon.com", "domain_classification": "Unknown", "message": "Fortnite Chapter 5 Season 4 skins list: How many skins are in the battle pass?\nImage: Epic GamesUnlockable style: X-Force Peelverine (reach level 32):X-Force Peelverine skin in Fortnite.\nImage: Epic GamesUnlockable style: Classic Peelverine (available in ‘Bonus Rewards’ after completing battle pass):Classic Peelverine skin in Fortnite.\nImage: Epic GamesUnlockable style: Wakanda Royal Shuri (bonus reward after completing battle pass):Wakanda Royal Shuri in Fortnite.\nFortnite Chapter 5 Season 4 battle pass skin Lego stylesAlong with the above battle royale mode skins, all Chapter 5 Season 4 battle pass skins have a Lego Fortnite variant, which you can view in the gallery below:Previous Next1 / 7 Gwenpool’s Lego style in Fortnite."}, {"id": "d2016649-1e46-41e8-982c-0323092342bd", "title": "Ottawa : Ukraine can use military equipment in Russia", "date": "2024-08-16 01:45", "url": "https://www.ctvnews.ca/politics/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-1.7002779", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "OTTAWA -The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement comes after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4 billion in military assistance to Ukraine through 2029."}, {"id": "5537db23-e4d1-470c-8b81-5c19fe49e042", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:00", "url": "https://www.theglobeandmail.com/canada/article-ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.David Smith/The Canadian PressThe federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence said Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement was issued after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4-billion in military assistance to Ukraine through 2029."}, {"id": "acc5aeb7-ab7f-4bad-8d2d-4b566c2e69c1", "title": "Ukraine will use Kursk incursion to force Putin to retreat in shame , reveals Zelensky advisor", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/russia-kursk-ukraine-putin-response-zelensky-b2597210.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Ukrainian forces have steadily advanced across the border into the Kursk region, taking over towns and villages and forcing hundreds of thousands of ordinary Russians to flee their homes.\nUkrainian forces have also taken Russian soldiers as prisoners of war to use as bargaining chips for their own civilians previously taken by Putin’s troops.\n“There has to be a complex, a multitude of instruments to force Russia to stop this war,” he said.\n“One incursion is not going to be enough for Putin to realise that the war is not worth it.\nBut civilians in Ukraine’s Sumy region, which borders the Kursk area, have not been left unscathed as Russia continues to fire drones and missiles from afar."}, {"id": "5bc551d8-ff4d-475c-a7c9-d1629e956844", "title": "Russia – Ukraine War Takes New Shape as Surprise of Kursk Blitz Fades", "date": "2024-08-16 14:00", "url": "https://www.theepochtimes.com/world/russia-ukraine-war-takes-new-shape-as-surprise-of-kursk-blitz-fades-5706403", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "When Ukrainian forces launched their foray into Russia’s western Kursk region last week, they brought the fog of war with them.\nRussian military leaders have suggested they are now regaining their composure.\nA damaged house following what local authorities called a Ukrainian military strike in the town of Sudzha in the Kursk Region, Russia, in this image released on Aug. 6, 2024.\n(Acting Governor of Kursk Region Alexei Smirnov via Telegram/Reuters)The Epoch Times cannot independently verify battlefield claims made by either side.\nAs of Thursday, Aug. 15, the Ukrainian military reported they control about 444 miles of Kursk territory."}, {"id": "6f41f2da-d662-4756-b982-706c949e4659", "title": "The Ukrainian endgame", "date": "2024-08-16 08:30", "url": "https://www.newstatesman.com/international-content/2024/08/the-ukrainian-endgame", "domain": "newstatesman.com", "domain_classification": "Unknown", "message": "But I struggle to see how Ukraine can recapture Russian occupied territories, just as I struggle to see how Russia can occupy more Ukrainian territories beyond a few villages.\nBefore Kursk grabbed the headlines, Russian troops had been pushed further into Ukrainian territory over the last couple of months, albeit realising only modest gains.\nUkraine has occupied the Kursk town of Sudzha, which is located close to where Russian gas enters the Ukrainian pipeline network.\nWhen the Nord Stream Baltic Sea pipelines were blown up two years ago, the Ukrainian gas continued to flow through the Sudzha transit point.\nRussia wants the four Ukrainian oblasts it unilaterally annexed in September 2022: Donetsk, Kherson, Luhansk and Zaporizhzhia."}, {"id": "3cbe90f4-d172-4615-ab39-aaba6808a135", "title": "Fortnite update 31 . 00 patch notes - New content and fixes for Chapter 5 , Season 4 | Gaming | Entertainment", "date": "2024-08-16 01:00", "url": "https://www.express.co.uk/entertainment/gaming/1936741/fortnite-update-3100-patch-notes-chapter-5-season-4", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "UPDATE: Fortnite update 31.00 is available to download on all platforms.\nWhile the game remains offline for server maintenance, fans can download and install the latest update.\nOn the plus side, while the servers are down, you can at least download and install update 31.00.\nAnd judging by all the hype from Epic Games, the Season 4 update will be well worth checking out.\nREAD MORE: Fortnite Chapter 5, Season 4 release date, time, server maintenance, Battle Pass, new map locationsREAD MORE: Fortnite new season server downtime - Full maintenance schedule for Chapter 5, Season 4"}, {"id": "df57db2a-1830-4aa4-9afa-dfa49b657e10", "title": "Japanese veteran confronts gruesome germ - warfare crimes in China", "date": "2024-08-16 07:45", "url": "http://en.people.cn/n3/2024/0816/c90000-20206842.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Out of the 3,607 registered members who served in Unit 731, only a few have acknowledged the historical facts, according to Jin.\nHe described the actions of Unit 731 in China as war crimes that have always haunted him.\nBefore his trip to China, Shimizu had delivered over 20 public speeches exposing Unit 731's germ-warfare crimes using his personal experiences and historical records.\n(Xinhua/Zhang Tao)The crimes committed by Unit 731 were among the most gruesome atrocities of the Japanese invasion of China during World War II.\nThe Chinese people remain profoundly dismayed by the revelations of the germ warfare conducted by Unit 731."}, {"id": "0c1be547-a7a1-415d-86ad-b8f31a954305", "title": "All About The USS Harry S . Truman ( CVN 75 ) Aircraft Carrier And Homeport", "date": "2024-08-16 12:45", "url": "https://www.slashgear.com/1642947/about-cvn-75-aircraft-carrier-uss-harry-s-truman-where-homeport/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "Sometimes, aircraft carriers like the USS Carl Vinson (CVN 70) get their name from U.S. representatives, while other times, they're named after presidents.\nIt wasn't his proudest moment, but Harry S. Truman was the first — and hopefully only — president to authorize the use of nuclear weapons, putting an end to the Second World War.\nAdvertisementNow one of the aircraft carriers in one of the biggest carrier classes in the world proudly wears the name of the 33rd President of the United States of America.\nThe USS Harry S. Truman (CVN 75) is the eighth Nimitz-class nuclear aircraft carrier and the ninth nuclear-powered carrier since the USS Enterprise (CVN 65).\nThe carrier houses approximately 5,680 men and women, along with roughly 85 aircraft."}, {"id": "2fb8b66f-8427-4294-9c34-d906d34d1bd4", "title": "Carew Castle to host weekend of weaponry and warfare", "date": "2024-08-16 08:00", "url": "https://www.westerntelegraph.co.uk/news/24518461.carew-castle-host-weekend-weaponry-warfare/", "domain": "westerntelegraph.co.uk", "domain_classification": "Unknown", "message": "Carew Castle's 'Weekend of Weaponry and Warfare' is set to return this bank holiday, with the Historia Normannis living history group taking visitors back to the 12th century.\nThis event, which is included with normal castle entry, will feature a medieval encampment, combat displays, and demonstrations of traditional skills.\nDaisy Hughes, manager of Carew Castle and Tidal Mill, said: \"We’re delighted to welcome Historia Normannis back to Carew this coming bank holiday.\n\"The Weekend of Weaponry and Warfare promises an unforgettable history lesson on the living conditions of a 12th century army on the march.\nFor more details and the full weekend schedule, visit the Carew Castle website."}, {"id": "b9e82d3a-3928-4a9a-ba86-0b4cac4c5938", "title": "British tanks used to drive back Putin forces during Ukraine incursion into Russia", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/ukraine-challenger-2-tanks-uk-russia-b2597207.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}British tanks have been used to force back Vladimir Putin’s troops during Ukraine’s audacious incursion into Russia.\n“It is inevitable that these things were going to be integrated into [Ukraine’s] military units and that they were going to be used.\nIf Russia is using fuel depots or command posts just over the border [in Kursk], they are legitimate targets under international law,” he said.\nView moreThe Ministry of Defence did not deny that Challenger 2 tanks have been used in Kursk, but said it would not comment on operational matters.\nA UK source confirmed that the tanks have been used, but it is still unclear exactly how many and when."}, {"id": "50dd4735-f6a2-444e-844a-176d289e1198", "title": "The Lies of Tim Walz | Frontpage Mag", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-lies-of-tim-walz/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Vance and Democrat Tim Walz marks the biggest controversy of its kind in 20 years.\nThe Swift Boat controversy of 20 years ago hurt Kerry politically, but there’s a big difference between his situation and that of Tim Walz.\nBut apparently, Walz wasn’t sufficiently proud of his achievement, so he lied about it in his curriculum vitae.\nValor describes courage or conspicuous gallantry, and I have not seen anything suggesting that Walz lied about receiving medals he did not earn.\nTim Walz did lie often."}, {"id": "c3d26e5e-aa33-4913-ba8e-191773efccf0", "title": "Warplanes : Ukraine Needs 128 F - 16s", "date": "2024-08-16 09:30", "url": "http://www.strategypage.com/htmw/htairfo/articles/2024081602541.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 16, 2024: As of late July, Ukraine has received 85 F-16s contributed by the Netherlands, Norway and Denmark.\nAfter that NATO was the only source of replacement aircraft and the first of 128 F-16s began arriving earlier in 2024.\nThere are several hundred European and American F-16s available for shipment to Ukraine and Ukraine is eager to get as many F-16s as they can.\nA growing number of Ukrainian pilots have completed their training in F-16s and deliveries of dozens of F-16s have begun.\nUntil Block 70 came along the most advanced F-16 was the F-16 Block 60."}, {"id": "3b24cc14-2fe2-4fb1-9e89-04c5a7b8c8e3", "title": "Newtown WW II vet turning 101 , still smokes at least one stogie a day", "date": "2024-08-16 14:00", "url": "http://www.nhregister.com/connecticut/article/wwii-vet-turns-101-19656738.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Dignitaries, including Sen. Richard Blumenthal, turned out to help him celebrate at Maplewood at Newtown.\nWWII veteran William Petrone is turning 101 and dignitaries, including Sen. Richard Blumenthal, turned out to help him celebrate at Maplewood at Newtown.\nDignitaries, including Sen. Richard Blumenthal, turned out to help him celebrate at Maplewood at Newtown.\nThursday, August 15, 2024, Newtown, Conn. H John Voorhees III/Hearst Connecticut Media WWII veteran William Petrone salutes Major Philip J. Cruz U.S. Army (Ret.)\nDignitaries, including Sen. Richard Blumenthal, turned out to help him celebrate at Maplewood at Newtown."}, {"id": "7596d039-0d28-4247-9338-864803bef8b1", "title": "Call of Duty : Modern Warfare Remastered mod H2M shuts down after cease and desist demand", "date": "2024-08-16 12:45", "url": "https://www.eurogamer.net/call-of-duty-modern-warfare-remastered-mod-h2m-shuts-down-after-cease-and-desist-demand", "domain": "eurogamer.net", "domain_classification": "Unknown", "message": "Call of Duty: Modern Warfare Remastered mod, H2M, has been cancelled following a cease and desist demand from Activision.\nAlthough the mod - which upgraded Modern Warfare 2's multiplayer mode - was announced over a year ago, the cease and desist arrived yesterday, a day before the mod was scheduled to be released later today.\n\"Today, our team members received a Cease & Desist order on behalf of Activision Publishing in relation to the H2M-Mod project,\" the team explained on Twitter/X.\nToday, our team members received a Cease & Desist order on behalf of Activision Publishing in relation to the H2M-Mod project.\nAfter these \"larger initial updates\", Activision says future Call of Duty downloads will decrease in size and existing files will take up less space on players' devices."}, {"id": "903764da-1885-4a74-b7dd-e18bca0e31e8", "title": "Hyped Modern Warfare 2 Remastered Multiplayer Mod Killed One Day Before Launch", "date": "2024-08-16 01:15", "url": "https://www.kotaku.com.au/2024/08/hyped-modern-warfare-2-remastered-multiplayer-mod-killed-one-day-before-launch/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nFor many players, this was extremely disappointing ,as MW2’s online multiplayer is considered by many CoD fans to be the best in the franchise’s history.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam."}, {"id": "53de47e6-381a-408c-9967-eb5593f0a77b", "title": "Battle Lines : Diplomatic efforts to avoid full - scale war in the Middle East , Ukraine incursion into Russia", "date": "2024-08-16 07:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/16/diplomatic-efforts-to-avoid-full-scale-war/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "e58530b0-6de6-41d3-8479-56e1e21c4044", "title": "Ukraine Recap : Kursk Offensive Turns The Fortunes Of War On Their Head For Now At Least", "date": "2024-08-16 00:00", "url": "https://menafn.com/1108560780/Ukraine-Recap-Kursk-Offensive-Turns-The-Fortunes-Of-War-On-Their-Head-For-Now-At-Least", "domain": "menafn.com", "domain_classification": "Unknown", "message": "You can also subscribe to our fortnightly recap of expert analysis of the conflict in Ukraine.\nRead more: Ukraine war: Kursk offensive has taken the war into Russia and put Putin on the back foot – for nowPressure on PutinVladimir Putin, meanwhile, has been quick to label the operation as a“provocation requiring a counter-terrorist response”.\nUK prime minister, Keir Starmer, has made it clear that, apart from the long-range Storm Shadow cruise missiles, Ukraine is free to use the weapons supplied by Britain in any way it chooses.\nEPA-EFE/Gavril Grigorov/Sputnik/Kremlin poolThroughout the course of the war, Putin has reacted to any talk of the use of western weapons inside Russia with threats of escalation.\nThis will reportedly involve Tomahawk cruise missiles, SM-6 ballistic missiles and a new generation of hypersonic systems currently under development."}, {"id": "b76f2dd4-f865-4ea7-aeb9-f461c29b14e5", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 04:00", "url": "https://www.kjrh.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "08429cfa-9d27-49fa-991b-9bb021008fb4", "title": "Ukraine Push Into Russia Met Early Success . Where Does It Go From Here ? ", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/ukraine-push-russia-met-early-115853202.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine’s Push Into Russia Met Early Success.\nDisplaced people at a boxing club acting as a temporary shelter for people arriving from the border with Ukraine in Kursk, Russia, on Aug. 14, 2024.\n(Nanna Heitmann/The New York Times)KYIV, Ukraine — The success of Ukraine’s secret incursion into Russia is clear.\nAny fixed position would be exposed to potentially devastating Russian airstrikes and would be difficult to defend against Russian troops attacking from different sides.\nMoscow has been slow to mount a major defense and has not yet successfully countered Ukrainian troops in Kursk, analysts say."}, {"id": "029839af-e493-4435-a188-5019f9128e4c", "title": "Viewpoint : We need a new approach to biotech regulations to avoid hijacking by bioterrorists", "date": "2024-08-16 08:30", "url": "https://geneticliteracyproject.org/2024/08/16/viewpoint-we-need-a-new-approach-to-biotech-regulations-to-avoid-hijacking-by-bioterrorists/", "domain": "geneticliteracyproject.org", "domain_classification": "Unknown", "message": "For instance, they could be used to create genetically enhanced biological agents that are more virulent or resistant to existing treatments.\nThe concerns around the societal impact and aligned ethical concerns of genetic engineering also extend to biological weapons.\nThis can include a genetically motivated carrier or delivery system or a genetically enhanced biological agent.\nThis can include a genetically motivated carrier or delivery system or a genetically enhanced biological agent.\nIncreasing the virulence of biological weapons through genetic engineering: Genetic engineering has long been considered a potential tool for creating more lethal biological warfare agents."}, {"id": "1128fd28-ef12-4da2-8fe1-c0848865a7df", "title": "The Ukrainian August 2024 offensive : Some initial thoughts", "date": "2024-08-16 01:30", "url": "https://smallwarsjournal.com/jrnl/art/ukrainian-august-2024-offensive-some-initial-thoughts", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "It is the most significant development in the Ukraine war in over a year.\nSome observations of the Ukrainian August offensive:The Ukrainians practiced good OPSEC – The offensive came as surprise to many observers in the West (including myself) and that’s good.\nSustaining drives has been a major shortcoming of both armies in the Ukraine war.\nThe Ukrainians appear to be able to hold what they have taken, at least for now – The Ukrainians appear to be consolidating their gains inside Russia.\nSummaryThe August offensive has been a huge black eye for Putin and has changed the dynamics of the Ukraine war in a way not seen in over a year."}, {"id": "590f411c-c51d-40b6-a680-8dea2c912663", "title": "The Underwater Pipelines That Supplied Fuel For The Allied Invasion Of Normandy", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/underwater-pipelines-supplied-fuel-allied-232237301.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This pipeline network, known as the Government Pipeline Storage System (GPSS) pipeline, formed the backbone of the PLUTO pipelines.\nThe PLUTO pipelines were not, it should be said, the main means by which petroleum was to be supplied to the continent in this scenario.\nLibrary of Congress via Wikimedia Commons A map of the PLUTO pipelines.\nWork on the PLUTO pipeline relied on the Allies capturing Cherbourg harbor intact in only eight days.\nIn May 1945, Churchill himself suggested that Operation PLUTO was “a wholly British achievement and a piece of amphibious engineering skill of which we may well be proud.”Ultimately, Operation PLUTO was less successful than the British authorities envisioned in 1942 and 1943."}, {"id": "e01d854f-16cb-4193-9bb3-92ffc77ea2d8", "title": "Royal Family LIVE :  Real danger  of Harry and Meghan Colombia trip | Royal | News", "date": "2024-08-16 07:45", "url": "https://www.express.co.uk/news/royal/1936750/royal-family-live-prince-harry-meghan-markle-colombia-trip-latest", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Meghan Markle gave a heartfelt speech about online safety at a panel discussion on Day 1 of her and Prince Harry's trip to Colombia.\nDuring her speech, Meghan urged social media trolls to \"think\" what their \"parents or grandparents taught them\" when it comes to making \"cruel\" comments online.\nThe Duchess said: \"Maybe your grandmother used to say it to you, ‘if you don’t have anything nice to say, don’t say anything at all’.\nThe digital age has almost created a culture where if you don’t have anything cruel to say, don't say anything at all.\nShe added: \"We should model how we want our kids to be raised and for the world in which we raise them."}, {"id": "79270b5b-f4fe-4eb7-af12-192b88a79b1f", "title": "Did Call of Duty Steal YouTuber Brendon Herrera Custom Gun Design ? ", "date": "2024-08-16 13:15", "url": "https://n4g.com/news/2616323/did-call-of-duty-steal-youtubers-brendon-herrera-custom-gun-design", "domain": "n4g.com", "domain_classification": "Unknown", "message": "70°Did Call of Duty Steal YouTuber's Brendon Herrera Custom Gun Design?\nErina writes: \"Brandon Herrera, a well-known YouTuber and firearm expert, has claimed that the creators of Call of Duty: Modern Warfare III used his custom-designed firearm, the AK-50, in the season 5 of their latest game without his permission.\""}, {"id": "ba51b07f-b9ac-41d0-8e4f-aac5588cdda4", "title": "How united kingdom Challenger 2 tanks are helping Ukraine in Kursk incursion – Firstpost", "date": "2024-08-16 09:15", "url": "https://www.firstpost.com/explainers/how-uk-challenger-2-tanks-are-helping-ukraine-in-kursk-incursion-13805171.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "British Challenger 2 tanks are playing a key role in Ukraine’s audacious cross-border raid into Russia’s Kursk Oblast, marking a significant escalation in the conflict.\nThe Challenger 2 tanks have been sparingly used by Ukrainian forces, largely due to their specific design and operational limitations.\nFile Image/ReutersA Ukrainian Challenger 2 crew member, speaking to UK’s The Sun, described the tank as a “sniper rifle among tanks” due to its accuracy.\nAdvertisementAs of March 2024, Ukrainian media reported that only seven of the original 14 Challenger 2 tanks remain in combat-ready condition.\nFile Image/ReutersDespite their symbolic and tactical significance, the Challenger 2 tanks face operational challenges that limit their effectiveness."}, {"id": "4bcc14f0-23f5-406a-8a86-877ee99afcdd", "title": "The Challenge star Theo Campbell claims he and castmate  wanted to fight  during Season 40", "date": "2024-08-16 03:45", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-star-theo-campbell-claims-he-and-castmate-wanted-to-fight-during-season-40/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Each squad would lose one man and one woman, based on the worst-performing competitors and whoever the daily challenge winners opted to send in against them.\nNurys and Theo finished last in the daily challenge, so they would automatically compete in their team’s eliminations.\nSince Horacio Gutierrez and Michele Fitzgerald were the Era 4 daily challenge winners, they decided who went against Nurys and Theo.\nLater, Paulie and Theo got in one another’s faces at The Challenge house, including that infamous kiss Paulie planted on Theo.\nViewers last saw Paulie on The Challenge: USA 2 on CBS, and Theo finally returned for The Challenge: World Championship on Paramount+."}, {"id": "13392fec-bdc1-4785-acb4-64fc0f440f46", "title": "Hyped Modern Warfare Remastered Mod Killed 1 Day Before Launch", "date": "2024-08-16 02:15", "url": "https://kotaku.com/mw2-h2m-mod-activision-cease-and-desist-killed-steam-pc-1851623649", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish view video This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam.\nCurrently, MW Remastered has a “mostly negative” review status on Steam."}, {"id": "bf08a5a5-568d-4313-978d-a0a7ebf6a7c0", "title": "Why the F - 111 Aardvark Was Nicknamed the  Whispering Death  ", "date": "2024-08-16 01:30", "url": "https://nationalinterest.org/blog/buzz/why-f-111-aardvark-was-nicknamed-whispering-death-207485", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Summary and Most Important Points: The F-111 Aardvark, a pioneering supersonic, multirole jet, served the U.S. Air Force for nearly three decades and the Royal Australian Air Force for four decades.\n-Introduced in 1964, the F-111 featured innovative technologies such as sweep-wing design, afterburners on turbofan engines, and terrain-following guidance systems.\nThe F-111 Aardvark: Pioneering Jet That Changed Military AviationThe F-111 was a pioneering aircraft.\nFirst flying in 1964, the F-111 featured a suite of novel technologies.\nThe F-111 Aardvark: The HistoryThe F-111 Aardvark was originally designed with an A-variant for the US Air Force, and a B-variant for the US Navy."}, {"id": "eb02f336-31bd-498c-a4b0-a25e943a1b8c", "title": "Asia Pacific Wire and Cable Market to Reach USD 56 . 62 Billion", "date": "2024-08-16 08:15", "url": "https://www.openpr.com/news/3624826/asia-pacific-wire-and-cable-market-to-reach-usd-56-62-billion", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Asia Pacific Wire and Cable Market to Reach USD 56.62 Billion by 2030, Driven by a 7.2% CAGR as per Stellar Market ResearchAsia Pacific Wire and Cable Markethttps://www.stellarmr.com/report/req_sample/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/req_sample/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/APAC-Dry-Mix-Mortar-Market/1245https://www.stellarmr.com/report/APAC-Floor-Grinding-Machine-Market/1246https://www.stellarmr.com/report/APAC-In-Flight-Catering-Services-Market/1247https://www.stellarmr.com/report/Asia-Pacific-Insulin-Pump-Market/1248https://www.stellarmr.com/report/APAC-Architectural-Acoustic-Panels-Market/1249𝐄𝐬𝐭𝐢𝐦𝐚𝐭𝐞𝐝 𝐑𝐞𝐯𝐞𝐧𝐮𝐞 𝐆𝐫𝐨𝐰𝐭𝐡:𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 size was valued at USD 34.8 Bn.\nby 2030, at a CAGR of 7.2%.𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐎𝐯𝐞𝐫𝐯𝐢𝐞𝐰:The Asia Pacific wire and cable market is experiencing robust growth, driven by several dynamic factors within the region's economic landscape.\nAdditionally, investments in smart networks are promoting more efficient use of energy resources.Infrastructure development is a major growth driver for the Asia Pacific wire and cable market.\n@𝐖𝐡𝐚𝐭 𝐢𝐬 𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐒𝐞𝐠𝐦𝐞𝐧𝐭𝐚𝐭𝐢𝐨𝐧?by VoltageLowHighExtra highby InstallationOverheadUndergroundby End UserAerospace & DefenceAutomotiveBuilding & ConstructionOil & GasEnergy & PowerIT & Telecommunication𝐒𝐨𝐦𝐞 𝐨𝐟 𝐭𝐡𝐞 𝐜𝐮𝐫𝐫𝐞𝐧𝐭 𝐩𝐥𝐚𝐲𝐞𝐫𝐬 𝐢𝐧 𝐭𝐡𝐞 𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐚𝐫𝐞:ASK Automotive Pvt.\n3, Kothrud, Pune,Pune, Maharashtra, 411029sales@stellarmr.com𝐀𝐛𝐨𝐮𝐭 𝐒𝐭𝐞𝐥𝐥𝐚𝐫 𝐌𝐚𝐫𝐤𝐞𝐭 𝐑𝐞𝐬𝐞𝐚𝐫𝐜𝐡:Stellar Market Research is a multifaceted market research and consulting company with professionals from several industries."}, {"id": "40c4f01f-0924-42c6-933c-95504517d5c5", "title": "Asia - Pacific Physical Security Market Set to Reach $90 , 954", "date": "2024-08-16 06:15", "url": "https://www.openpr.com/news/3624485/asia-pacific-physical-security-market-set-to-reach-90-954", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Asia-Pacific dominated the video surveillance market, with China holding a significantly higher share.\nIn addition, China is home to some of the world's largest makers of video surveillance products, such as Division, Huawei, and Dahua.\nBy component, in 2019, the services segment dominated the Asia-Pacific physical security market size.\nCountry wise, the Asia-Pacific physical security market was dominated by China.\nAllied Market Research provides global enterprises as well as medium and small businesses with unmatched quality of \"Market Research Reports\" and \"Business Intelligence Solutions.\""}, {"id": "af68c4df-d664-4b88-b89f-cc609c7f09b5", "title": "Massive new Navy ship leaves San Diego Bay for its first sea trials", "date": "2024-08-16 00:00", "url": "https://www.sandiegouniontribune.com/2024/08/15/massive-new-navy-ship-leaves-san-diego-bay-for-its-first-sea-trials/", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "The USNS Robert E. Simanek, a 784-foot expeditionary sea base, left the General Dynamics-NASSCO shipyard in San Diego Bay on Wednesday for its first sea trial, considered an important step in preparing a vessel for full service.\nThe Simanek is the fifth ESB that NASSCO has built for the Navy, which intends to use the vessels to help deploy troops and equipment in areas of the world where the U.S. doesn’t have easy access to land bases and seaports.\nThe ship carries the designation USNS because it is a non-commissioned vessel that will be operated for the Navy by a civilian crew under the Military Sealift Command.\nNASSCO said the ship was named in honor of the late Robert Ernest Simanek, a private first class Marine who was awarded the Medal of Honor for shielding fellow Marines during a grenade attack in the Battle of Bunker Hill during the Korean War."}, {"id": "7930c1c6-a253-4afb-9c79-7405706fc1f5", "title": "Trump says presidential civilian award is  better  than top military honor whose recipients are  dead  or  hit  by bullets", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/trump-says-presidential-civilian-award-060540477.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump says presidential civilian award is 'better' than top military honor whose recipients are 'dead' or 'hit' by bulletsTrump says presidential civilian award is 'better' than top military honor whose recipients are 'dead' or 'hit' by bulletsBEDMINSTER, N.J. — Former President Donald Trump lauded a wealthy donor on whom he bestowed the Presidential Medal of Freedom as having gotten the \"better\" award compared to the top military honor, the Medal of Honor, because those recipients are often deceased or injured.\n“I watched Sheldon sitting so proud in the White House when we gave Miriam the Presidential Medal of Freedom,\" Trump said at his New Jersey resort.\nIt’s the equivalent of the Congressional Medal of Honor,\" Trump continued, referring to the highest military honor bestowed for valor in combat.\n\"But civilian version, it’s actually much better because everyone [who] gets the Congressional Medal of Honor, they're soldiers.\nThey’re either in very bad shape because they’ve been hit so many times by bullets or they’re dead,\" Trump concluded."}, {"id": "92c7f0c3-4339-4d5d-93c3-5cdcf0d12bb4", "title": "War Stocks Still a Buy $LMT $NOC $RTX $BA", "date": "2024-08-16 02:15", "url": "https://www.livetradingnews.com/225647-225647.html", "domain": "livetradingnews.com", "domain_classification": "Unknown", "message": "Stable Revenue Streams: Unlike many sectors, defense companies enjoy a relatively predictable revenue stream due to government contracts.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nMarket Sentiment:Recent posts on X (formerly Twitter) highlight a mixed sentiment but a clear trend towards defense stocks.\nAs long as geopolitical tensions persist, defense stocks are likely to remain a strategic choice for investors looking for resilience amidst global uncertainty."}, {"id": "c87f269c-8bb9-417c-a447-8afaf272dc75", "title": "Putin promised poorly - trained conscripts wouldnt be sent to war . Now the front line has come to them", "date": "2024-08-16 06:45", "url": "https://www.cnn.com/2024/08/16/europe/russia-putin-war-ukraine-intl-latam/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Russian President Vladimir Putin made a big promise when he launched his war on Ukraine: conscripts would not be involved in combat.\nRussian conscripts called up for military service depart for garrisons from a recruitment centre in Bataysk, Russia on May 16, 2024.\nUkrainian military chief Oleksandr Syrskyi has said that Ukrainian troops have advanced 35 kilometers (21.7 miles) through Russian defenses since the incursion started.\nBut while there seems to be outrage over their deployment, this is not the first time Russian conscripts were found to be fighting in Putin’s war on Ukraine.\nThe Russian military then claimed the conscripts had been withdrawn and returned to Russia."}, {"id": "b76ebb5a-6e48-426a-aeb5-edec61a053d1", "title": "Putin promised poorly - trained conscripts wouldnt be sent to war . Now the front line has come to them", "date": "2024-08-16 06:45", "url": "https://edition.cnn.com/2024/08/16/europe/russia-putin-war-ukraine-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Russian President Vladimir Putin made a big promise when he launched his war on Ukraine: conscripts would not be involved in combat.\nRussian conscripts called up for military service depart for garrisons from a recruitment centre in Bataysk, Russia on May 16, 2024.\nUkrainian military chief Oleksandr Syrskyi has said that Ukrainian troops have advanced 35 kilometers (21.7 miles) through Russian defenses since the incursion started.\nBut while there seems to be outrage over their deployment, this is not the first time Russian conscripts were found to be fighting in Putin’s war on Ukraine.\nThe Russian military then claimed the conscripts had been withdrawn and returned to Russia."}, {"id": "a78d2dac-ec7b-4f9c-b76b-7c730326abf8", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 05:15", "url": "https://www.wdio.com/front-page/world-national/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "7390f47d-77d0-4633-ad75-933228e110af", "title": "JD Vance Joins Fellow Veterans to Torch Tim Walz for Stolen Valor at Pennsylvania VFW Post", "date": "2024-08-16 01:15", "url": "https://www.breitbart.com/politics/2024/08/15/jd-vance-joins-fellow-veterans-to-torch-tim-walz-for-stolen-valor-at-pennsylvania-vfw-post/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Tim Walz for lying about his military service at a Veterans of Foreign Wars (VFW) post in Pennsylvania on Thursday.\nJD Vance summarizes Freakish Timothy Walz's history of Stolen Valor🔥 Tim Walz said that he carried a weapon in war — he never went to war.\nWhile he was promoted provisionally to command sergeant major, he did not finish the requirements to retain or retire at that rank.\nAs then-command sergeant major of his unit, he was responsible for the enlisted troops in his battalion, about 100 soldiers.\nThis is not about disparaging anybody’s services, including Tim Walz."}, {"id": "6ac72abb-c70f-41e7-b523-62ed424ad520", "title": "Wagner Group and the IRGC : The Rise of Self - Sustaining Military Proxies", "date": "2024-08-16 09:15", "url": "https://www.heritage.org/defense/commentary/wagner-group-and-the-irgc-the-rise-self-sustaining-military-proxies", "domain": "heritage.org", "domain_classification": "Unknown", "message": "And the Wagner Group appears to be following a similar path.\nThe Wagner Group is a private military company, owned by one man—Yevgeny Prigozhin.\nJust as the IRGC’s operations have spread from Iran to Syria and beyond, so have Wagner Group operations extended from Ukraine through much of Africa.\nA private military company is not the same as a state-run military, but there is nothing inherently unique about the Wagner Group that separates its activities from those of Iran’s IRGC.\nThe Wagner Group is believed to have been heavily involved with the 2014 Russian invasion and annexation of the Crimean Peninsula."}, {"id": "1b6b9772-c025-4106-b2dc-d358830a02bf", "title": "Zelenskyy says Ukrainian troops are consolidating control of Russian territory", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/europe/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha", "domain": "10news.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy said Thursday that his country's troops had taken full control of Sudzha, the largest Russian town to fall to Ukraine's forces since the start of their cross-border incursion more than a week ago.\n“The more Russian military presence is destroyed in the border regions, the closer peace and real security will be for our state.\nMeanwhile, Russian forces are keeping up the pressure on the southern and eastern front lines, according to Ukrainian military officials.\nAs of Thursday, the Ukrainian military claims to be holding more than 80 towns and settlements in the Kursk region.\nRussian military bloggers reported that small Ukrainian mechanized groups have continued to probe Russian defenses."}, {"id": "c195f8cc-6005-41e6-8005-7efaf25f9494", "title": "Artem Koliubaiev gave the military a high - speed car", "date": "2024-08-16 10:15", "url": "https://www.kyivpost.com/post/37435", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Servicemen of the 36th Separate Rifle Battalion from Khmelnytsky region received another reinforcement thanks to the efforts of volunteers and the cultural front.\nThe organization of this assistance was undertaken by representatives of the public organization \"Union of Television and Film Industry Entrepreneurs,\" headed by the famous film producer Artem Kolyubaev.\nPhoto taken from the official Facebook page of Sergey Tyurin (Head of the Khmelnitsky Regional Military Administration).\nArtem Kolyubaev and his colleagues from the Union of Television and Film Industry Entrepreneurs regularly support the army during the war, organizing fundraising and the delivery of specialized equipment for the military.\nThanks to their efforts, Ukrainian defenders receive reliable equipment that helps them in the fight against the Russian aggressor."}, {"id": "a84f9163-6849-4ee9-84e1-e3f881136852", "title": "Cyber - attack could trigger ANZUS treaty , Australia , NZ leaders say", "date": "2024-08-16 03:15", "url": "https://www.9news.com.au/national/anthony-albanese-chris-luxor-affirm-australia-new-zealand-defend-each-other-cyber-attacks/b703d900-9ef3-480e-9d37-ede8feb6dee1", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ \"sufficiently severe\" cyber attack on either country could trigger a combined Australia-New Zealand defence response, the prime ministers of both countries said today.\nNew Zealand Prime Minister Christopher Luxon.\n(9News)Luxon confirmed ﻿that the alliance could \"come into play\" in the face of a \"sufficiently severe cyber attack\".\nA \"severe\" cyber attack could provoke a joint Australia-NZ defence response.\n\"Prime Minister Albanese and I agreed to engage closely on this,\" he said."}, {"id": "682f8abd-dcfb-411d-b6c8-c789beda1928", "title": "What does Chicago represent for the Democratic National Convention ? ", "date": "2024-08-16 00:30", "url": "https://www.aljazeera.com/news/longform/2024/8/15/what-does-chicago-represent-for-the-democratic-national-convention", "domain": "aljazeera.com", "domain_classification": "International", "message": "But for all the ways Chicago represents Democratic ideals, critics say it has also exemplified the party’s failings and divisions.\nLooming large over the upcoming Democratic National Convention is the spectre of an earlier convention in Chicago that ended in unrest and violence.\nStill, the party assembled in Chicago for its 1968 Democratic National Convention.\nHundreds of demonstrators are expected to gather outside the 2024 convention site to protest Democratic support for Israel’s war in Gaza.\nStill, Cowan said the current optimism surrounding the Harris-Walz campaign may overshadow any protests outside this year’s convention in Chicago."}, {"id": "0fa6053c-4c5e-49c8-bbc7-22287f0acc5a", "title": "Vicky McClure fans  blown away  as family story aired on Who Do You Think You Are  saddest episode  ", "date": "2024-08-16 01:15", "url": "https://www.nottinghampost.com/news/celebs-tv/vicky-mcclure-fans-blown-away-9487052", "domain": "nottinghampost.com", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nOverwhelmed by emotion, the actress broke down, saying: \"It's horrible, horrible, horrible.\"\nAnother shared their admiration: \"Wow, what a man Harry Millership was Rest easy, Harry.\nRIP Harry Millership."}, {"id": "b4adadc9-bfa9-4c6b-a041-131220f415ae", "title": "LETTER | Tackle greed in Malaysia - the root of corruption", "date": "2024-08-16 04:45", "url": "https://www.malaysiakini.com/letters/715797", "domain": "malaysiakini.com", "domain_classification": "Unknown", "message": "Perhaps it is time to drop the label “corruption” and plainly call it “greed” instead.\nGreed for power, greed for money, greed for unaccounted wealth - greed indeed is the root cause fueling corruption in the country.\nWe need to carve a culture that not only frowns on greed but names and shames greed in its myriad forms that we see all too often in our country.\nUnless and until we have what it takes to expose greed, our war on corruption will remain merely a superficial dressing of a wound that has already taken root so deep in the Malaysian psyche.\nWe need to tackle greed to win this war on corruption."}, {"id": "c18f5afd-d985-4514-9f07-baac9bd13f76", "title": "Donnacha Ó Beacháin : Ukraine attack on Russia is risky , but it shows that Putin is not invincible", "date": "2024-08-16 07:00", "url": "https://www.thejournal.ie/readme/ukraine-going-into-russia-6464557-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "ddc0a78b-2cf6-4413-ac3b-62e87ed7bd13", "title": "Ukraine claims full control of Russian city Sudzha | The Arkansas Democrat - Gazette", "date": "2024-08-16 11:30", "url": "https://www.arkansasonline.com/news/2024/aug/16/ukraine-claims-full-control-of-russian-city-sudzha/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Zelenskyy said Ukraine was setting up a military command office in Sudzha, which suggests that Ukraine might plan to remain in the Kursk region long-term -- or just signal Moscow that it may intend to do so.\nAs many as 10,000 Ukrainian troops are involved, according to Western military analysts.\n(AP Photo/Evgeniy Maloletka)In this photo taken from a video released by the Russian Defense Ministry on Thursday, Aug. 15, 2024, Russian soldiers load Giatsint-B self-propelled gun at an undisclosed location.\n(Russian Defense Ministry Press Service photo via AP)A damaged Ukrainian tank returns from Russia near the Russian-Ukrainian border in Sumy region, Ukraine, Thursday, Aug. 15, 2024.\n(AP Photo/Evgeniy Maloletka)An elderly woman walks along the road near the Russian-Ukrainian border, Sumy region, Ukraine, Wednesday, Aug. 14, 2024."}, {"id": "cb82197c-a2c6-45fe-952d-772d0bd7f0f7", "title": "Air Transportation : Surrounded Soldiers Resupplied by Drones", "date": "2024-08-16 09:30", "url": "http://www.strategypage.com/htmw/htairmo/articles/2024081602443.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 16, 2024: From late April through June this year, a unit of Ukrainian troops surrounded by Russian forces was supplied solely by drones.\nEventually a relief force of Ukrainian troops broke through and enabled the surrounded soldiers to leave the fighting and get some rest.\nThe K-MAX drone can also carry up to four separate sling loads totaling 1,568 kg.\nThe A160T is a two ton helicopter, able to fly under remote control or under its own pre-programmed control.\nIt is unknown if TRV-150C was used for the recent incident where surrounded Ukrainian troops were resupplied by drones during a ten week battle."}, {"id": "a4f9123e-8226-4403-8e8d-6afdd5c4c0cb", "title": "Sea Screamer : a family legacy of thrills and tradition in Panama City Beach", "date": "2024-08-16 04:45", "url": "https://www.wjhg.com/2024/08/16/sea-screamer-family-legacy-thrills-tradition-panama-city-beach/", "domain": "wjhg.com", "domain_classification": "Unknown", "message": "PANAMA CITY, Fla. (WJHG/WECP) - The Sea Screamer isn’t just any speedboat—it’s the world’s largest, and it’s making waves in Panama City Beach.\nBrought to the area by the Redmond family, this unique attraction offers a blend of thrills, education, and fun for all ages.\n“We play good music, we narrate, we talk about the history of Panama City Beach.\nGarrett Hine, another captain for the Sea Screamer, has a long history with the family.\nFrom dolphin sightings to unforgettable water gun battles, the Sea Screamer offers more than just a ride—it’s a tradition that continues to grow with each season."}, {"id": "73f91a39-ab76-40d9-bf05-25dbd9c90f27", "title": "HII lands $30 million Air Force contract to help sustain Air Force One and other presidential and executive aircraft", "date": "2024-08-16 11:30", "url": "https://www.daytondailynews.com/local/hii-lands-30m-wright-patt-contract-to-support-air-force-one-other-vip-craft/INN6BCFPUFHQDCPLKHZG3XDH74/", "domain": "daytondailynews.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "0a0941ba-b16c-403e-b520-9c0c67a9dc2f", "title": "Zelenskyy says Ukrainian troops have taken full control of the Russian town of Sudzha", "date": "2024-08-16 02:30", "url": "https://www.smdailyjournal.com/news/world/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha/article_8af1c98a-5b47-11ef-b620-93f23494d8d2.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "d3cd0b35-20c9-448b-843c-80033e479251", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 03:00", "url": "https://wset.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wset.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "e51c6428-2987-4b52-b698-34e3fc32f4f1", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wlos.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "889d3980-08f1-4a18-8a14-71019e4a4107", "title": "The further we get from the Civil War , the clearer the need to honor Harriet Tubman", "date": "2024-08-16 10:30", "url": "https://www.yahoo.com/news/further-civil-war-clearer-honor-100100940.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The further we get from the Civil War, the clearer the need to honor Harriet Tubman | OpinionHarriet Tubman escaped from slavery when she was about 27 years old.\nReading “Night Flyer” got me to thinking about the so-called Civil War “heroes” celebrated in the Landmark Books series from publisher Random House that I read during the centennial commemoration of the war.\nIt’s clear that it’s Tubman who represents “the virtues we so greatly cherish and so greatly need.”Tubman exhibited considerable bravery during the Civil War.\nThe last 60 years have taught us that Jackson, Lee, the Confederates and their miserable cause should be relegated to the dustbin of history.\nAnd we should celebrate Harriet Tubman for the great American hero she was."}, {"id": "652d04f2-4755-481b-86ff-5b1e2e07af33", "title": "Two Free Movies Set to Show At Moundsville Public Library | News , Sports , Jobs", "date": "2024-08-16 10:15", "url": "https://www.theintelligencer.net/life/out-about/2024/08/two-free-movies-set-to-show-at-moundsville-public-library/", "domain": "theintelligencer.net", "domain_classification": "Unknown", "message": "MOUNDSVILLE — There will be two free film showings on Monday, Aug. 19, at the Moundsville-Marshall County Public Library.\nThe first film will be “Ghostbusters: Frozen Empire” and will start at 3 p.m.\nThe Moundsville Library is located at the corner of Fifth Street and Tomlinson Avenue.\nOn Tuesday, Aug. 27, the Moundsville Library will show the R-rated 2024 feature film “The Ministry of Ungentlemanly Warfare.” It will start at 6 p.m. and run for 120 minutes.\nThis film showing is free and open to the public."}, {"id": "c558b00e-7104-4575-802b-b9062ba374a1", "title": "Danish Battalion integrates NATO Multinational Brigade in Latvia", "date": "2024-08-16 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240815-latvia-mfa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Danish Battalion integrates NATO Multinational Brigade in LatviaRepublic of Latvia - Ministry of Foreign Affairs08/15/2024 - 16:51In LatviaInternational cooperationInformation prepared by Media Relations SectionOn Monday, 19 August, a ceremony will take place at the military base \"Ādaži\" to highlight the integration of the Royal Danish Armed Forces Battalion within the NATO Multinational Brigade in Latvia.\n\"The integration of the Danish battalion will significantly strengthen the NATO Multinational Brigade Latvia, enhancing its ability to respond immediately to any threat.\nThe ceremony will be attended by Major General Jette Albinus, Commander of the NATO's Multinational Division \"North\" Headquarters, Colonel Cédric Aspirault, Commander of the NATO Multinational Brigade in Latvia and Lieutenant-Colonel Thomas Nyholm Jørgensen, Commander of the Danish Battalion.\nNATO Multinational Brigade Latvia has Canada as a Framework nation, along with forces of contributing nations: Albania, Czechia, Denmark, Iceland, Italy, Latvia, Montenegro, North Macedonia, Poland, Slovakia, Slovenia adn Spain.\nSweden is also expected to join the new NATO Multinational Brigade in Latvia."}, {"id": "811b8913-9fa8-4b22-b6e1-4bd45bc13eb5", "title": "Russia prioritises its offensive in Donetsk Oblast over defence near Kursk – ISW", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-prioritises-offensive-donetsk-oblast-034646913.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Experts from the Institute for the Study of War have noted that the Russians continue to maintain a relatively high pace of offensive in Ukraine’s Donetsk Oblast, despite the operation of Ukraine's defence forces in Russia’s Kursk Oblast, and prioritise their offensive operations in Ukraine’s east overall.\nSource: ISWQuote: \"Russian forces are maintaining their relatively high offensive tempo in Donetsk Oblast, demonstrating that the Russian military command continues to prioritise advances in Ukraine’s east even as Ukraine is pressuring Russian forces within Kursk Oblast.\"\nQuote: \"Geolocated footage published on 14 and 15 August indicates that Russian forces recently advanced east of Pokrovsk within Hrodivka and southeast of Pokrovsk within Mykolaivka, Zhelanne and Orlivka, and ISW assesses that Russian forces likely seized Orlivka and Zhelanne.\"\nMore details: It was also reported that Russian troops had continued mechanised assaults near Donetsk over the past few weeks.\nQuote: \"ISW continues to assess that the Russian military command is pulling select elements of Russian irregular units from Donetsk Oblast to address the Ukrainian incursion in Kursk Oblast but will likely be extremely averse to pulling Russian military units engaged in combat from priority sectors in Donetsk Oblast out of concerns about slowing the tempo of Russian operations in these areas.\""}, {"id": "361780bc-4e29-49b2-8868-0250fd52c273", "title": "Israel has hit a wall in Gaza , some US officials say , as civilian deaths mount", "date": "2024-08-16 03:45", "url": "https://www.yahoo.com/news/israel-hit-wall-gaza-us-231345752.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel has hit a wall in Gaza, some US officials say, as civilian deaths mountWASHINGTON − Israel has achieved most of its battlefield aims against Hamas in Gaza, but is unlikely to eliminate the militant movement by continuing combat operations that have cost an estimated 40,000 lives, current and former U.S. officials say.\nIranian officials have said a Gaza cease-fire would temper their promised response to the assassination, which they blame on Israel.\nWhile U.S. arms sales continue, some officials are questioning whether Israel’s military has hit a wall in Gaza.\n“There is no such thing as total victory in the context of the Gaza war.\"\nThis article originally appeared on USA TODAY: Israel has hit a wall in Gaza, US officials say; deaths hit 40,000"}, {"id": "b0ed66b9-e2bf-4623-ba60-41265a05d408", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 03:00", "url": "https://ktul.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "ffd038e7-c44c-41f5-a1af-77a7e667f486", "title": "Echoes of  68 as Chicago convention looms for Democrats", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/echoes-68-chicago-convention-looms-013600799.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"It's not a twin, but an echo,\" David Farber, a University of Kansas history professor and author of the book \"Chicago '68,\" said of circumstances connecting the two conventions.\nHe pointed to the choice of Chicago as a way for Democrats to exorcise the demons of the past.\n\"I thought, 'Oh, the ghost of '68 is really over' -- and then all the protests broke out on university campuses over the Gaza-Israel situation\" and word came that massive demonstrations await the upcoming convention, Farber told AFP.\nAs AFP reported from Chicago just before the 1968 convention opened on August 26, the Democratic Party \"appears more divided than ever.\"\n\"It's more a story of contrasts,\" said historian Frank Kusch who wrote \"Battleground Chicago,\" a book about the 1968 convention."}, {"id": "ad28077c-59e7-496d-a8e1-7b2edea2d6a9", "title": "Mastering Threats Beneath Waves", "date": "2024-08-16 02:00", "url": "https://www.miragenews.com/mastering-threats-beneath-waves-1297291/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "To help counteract this threat, two Royal Australian Navy sailors recently participated in the Royal Navy's advanced mine warfare course at HMS Collingwood in England.\nWarrant Officer Lockard and Chief Petty Officer Cochrane learned planning considerations, including how to identify areas likely to be mined, best patterns of search to identify targets and best available disposal methods.\n\"The course is designed for us to conduct practical planning for the execution of mine warfare operations,\" Warrant Officer Lockard said.\nBoth sailors are now qualified to work as mine warfare planners within maritime task groups.\n\"I am looking forward to using my new knowledge and skills to overcome challenges with mine countermeasures operations,\" Chief Petty Officer Cochrane said."}, {"id": "9d55ca7b-6277-4736-900c-d0895fc90898", "title": "BBC Who Do You Think You Are ?: Vicky McClure emotional as she says ,  I feel like Im letting them down  ", "date": "2024-08-16 07:00", "url": "https://www.walesonline.co.uk/lifestyle/tv/bbc-who-you-think-you-29749917", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "I know that my great-grandad - I think his name was Harry, fought in the Second World War.\nHe was a prisoner of war in the Japanese war camps, and I believe he died out there, and he’s buried out there, as far as I know.\"\n(Image: BBC)Harry had been a coal miner in Yorkshire before he was called up to enlist as a soldier in the Second World War in 1940.\nDue to secrecy during the war, Harry and his regiment were provided a tropical kit, which would indicate they would be going east, but they weren’t told exactly where.\nIt would be one of the greatest defeats that Britain would suffer in the Second World War."}, {"id": "a0961714-c96b-402b-88c2-4cacd7253c41", "title": "Ukraine cross - border incursion challenges Moscow war narrative – but will it shift Russian opinion ? ", "date": "2024-08-16 00:30", "url": "http://www.econotimes.com/Ukraines-cross-border-incursion-challenges-Moscows-war-narrative--but-will-it-shift-Russian-opinion-1684128", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nUkraine’s invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude “rally around the flag” effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "e4332f32-deb0-468f-b9b3-93e74f249fb9", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:30", "url": "https://fox11online.com/news/nation-world/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "71e5a6c3-2467-473e-92fd-6698cce332f3", "title": "Kyodo News Digest : Aug . 16 , 2024", "date": "2024-08-16 03:00", "url": "https://english.kyodonews.net:443/news/2024/08/090e6cfcd394-kyodo-news-digest-aug-16-2024.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 1 hour ago - 23:00 | All, World, JapanThe following is the latest list of selected news summaries by Kyodo News.\nThe Japan Meteorological Agency warned of violent winds, mudslides, high waves and flooding, forecasting heavy rain in the eastern region around Tokyo and the northeast.\nThe city's Ocean Park said one female and one male offspring were born just one day before Ying Ying's 19th birthday.\nThis also marked the first-ever twin panda birth in the semiautonomous region of China.\nLee, 69, will succeed Frank Hsieh, who left the top representative post in Japan last week after eight years of service."}, {"id": "243a8835-c4bb-42b1-a7bd-d30052ea0de4", "title": "Biden still believes he would beat Trump if hed stayed in the race : report", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/biden-still-believes-beat-trump-220005136.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At the time he dropped out of the 2024 presidential race, President Biden believed he could beat former President Trump.\nThe Biden administration would support the elimination of taxes on tipped wages, an idea first proposed by former President Trump, the White House said.\nPresident Biden during the White House Creator Economy Conference in the Indian Treaty Room of the White House in Washington, DC, US, on Wednesday, Aug. 14, 2024.\nFox News Digital reached out to the White House for comment, but did not immediately receive a response.\nOriginal article source: Biden still believes he would beat Trump if he'd stayed in the race: report"}, {"id": "3015c588-a5d7-4184-b4b8-9194e0c71ad1", "title": "Will Kursk attack change Russian public opinion on Ukraine war ? ", "date": "2024-08-16 07:45", "url": "https://www.rte.ie/brainstorm/2024/0816/1465255-kursk-attack-russia-public-opinion/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nAn overconfident KremlinUkraine's invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude \"rally around the flag\" effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "cf6f62d2-20fd-41f1-9fa3-df2324c7190f", "title": "This Day in History", "date": "2024-08-16 07:45", "url": "https://www.smdailyjournal.com/lifestyle/this-day-in-history/article_edf67788-58ef-11ef-b901-c349f44161cb.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.\nA new puzzle every day, seven days a week!"}, {"id": "54804bdd-d127-4702-b05d-5c52e243e50a", "title": "Russia loses another 1 , 330 soldiers in one day", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-loses-another-1-330-045440763.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 1,330 soldiers in one dayStock photo: General Staff of the Armed Forces of UkraineUkraine’s Defence Forces are continuing to inflict losses on Russia as it has lost 1,330 soldiers, 59 artillery systems, 25 armoured combat vehicles and 12 tanks over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 596,950 (+1,330) military personnel;8,496 (+12) tanks;16,461 (+35) armoured combat vehicles;16,927 (+59) artillery systems;1,159 (+5) multiple-launch rocket systems;922 (+0) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;13,659 (+61) strategic and tactical UAVs;2,429 (+1) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,848 (+73) vehicles and tankers;2,829 (+16) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!"}, {"id": "e6ae14e5-3145-43d9-8291-e1fc25c401f4", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:00", "url": "https://kval.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "kval.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "e0d6316a-f495-4f5b-87a9-5311861dce2f", "title": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in Kursk", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/ukraine-says-over-100-russian-053441659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine said it seized 102 Russian soldiers on Wednesday in a single sweep in Kursk.\nUkrainian intelligence told local media that its special forces had seized a fortified Russian base in Kursk that day.\nUkraine said that its forces in Kursk captured 102 Russian soldiers in one sitting on Wednesday, marking the largest group it's taken prisoner since the war began.\nThey had \"made the right decision and surrendered,\" wrote the agency, which aims to persuade Russian troops to defect or desert.\nA caption for the video said the Russian soldiers had been abandoned by the commanders, alleging that the latter fled to avoid capture themselves."}, {"id": "ef08b1dd-60ca-4572-ac23-e210ee3fc04d", "title": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in Kursk", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/ukraine-says-over-100-russian-053441740.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine said it seized 102 Russian soldiers on Wednesday in a single sweep in Kursk.\nUkrainian intelligence told local media that its special forces had seized a fortified Russian base in Kursk that day.\nUkraine said that its forces in Kursk captured 102 Russian soldiers in one sitting on Wednesday, marking the largest group it's taken prisoner since the war began.\nThey had \"made the right decision and surrendered,\" wrote the agency, which aims to persuade Russian troops to defect or desert.\nA caption for the video said the Russian soldiers had been abandoned by the commanders, alleging that the latter fled to avoid capture themselves."}, {"id": "e87d716b-a0aa-4337-b665-d6084e08c201", "title": "The Swiss who have left their mark on the history of humanitarian law", "date": "2024-08-16 14:00", "url": "https://www.swissinfo.ch/eng/international-geneva/the-swiss-who-have-left-their-mark-on-the-history-of-humanitarian-law/86669293", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "To mark the occasion, SWI swissinfo.ch invites you to (re)discover six Swiss personalities who championed international humanitarian law from 1864 to 2024.\n6 minutesThe four Geneva Conventions, signed in Geneva on August 12, 1949, form the basis of international humanitarian law, also known as the law of war, which aims to preserve humanity, even in the worst moments of war.\nOver the years, many prominent Swiss figures have worked to develop and defend the Geneva Conventions.\nThe first gave rise to the Geneva Conventions and the second to the Red Cross movement.\nHis efforts and his contribution to the fundamental principles of the Red Cross, including those of humanity, impartiality, neutrality and independence, earned him the nickname “father of contemporary international humanitarian law”."}, {"id": "971ed613-4a94-4037-bd90-fcda17f7ccc1", "title": "Six Jews Youths Arrested Trying to Mark 19 Years Since Expulsion from Gaza | The Jewish Press - JewishPress . com | Jewish News Syndicate ( JNS ) | 12 Av 5784 – Friday , August 16 , 2024", "date": "2024-08-16 01:30", "url": "https://www.jewishpress.com/news/israel/settlements-israel/six-jews-youths-arrested-trying-to-mark-19-years-since-expulsion-from-gaza/2024/08/16/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Israeli security forces arrested six youths after dozens tried to breach the border with the Gaza Strip to conduct a Jewish prayer service there on Thursday morning.\nAdvertisementThe six who were detained were part of a group of some 40 people who tried to enter the Strip from the Erez Crossing with northern Gaza.\nThe attempt to enter the enclave came as resettlement activists marked 19 years since the military carried out Israel’s disengagement from the Gaza Strip, in which more than 8,000 Jews were forcibly removed from their homes.\n“Only a Jewish Gaza will remove the threats of missiles and hostage-taking from Gaza and bring security to the residents of the south and the entire country,” the anonymous Israeli worshipper continued.\n“If you mean resettling Gaza, … it was never in the cards, and I said so openly."}, {"id": "501d115c-ecd6-4ff2-a7d4-7c6cda4299e6", "title": "Global corporations versus nation - states", "date": "2024-08-16 01:00", "url": "https://www.dailysabah.com/opinion/columns/global-corporations-versus-nation-states", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "In today’s interconnected world, the influence of monopolistic corporations has grown to staggering levels, especially through global communication channels.\nEven after it was confirmed that the attacker was a Christian, the unrest continued to escalate, fueled by the unchecked spread of inflammatory content on social media.\nCurrently, China dominates the global market in lithium processing and battery production, but this supply chain is vulnerable.\nMusk, often lauded for his efforts to champion “free speech” on X, is clearly intoxicated by the vast opportunities presented by the global lithium race.\nIf he, with all his wealth and power, is so consumed by this pursuit, one can only imagine the lengths to which other global media magnates might go to secure their share."}, {"id": "ac08d4b5-c290-4869-8739-00c15c8a965a", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 03:15", "url": "https://www.nbcmontana.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "a322f67a-da0a-40bd-afdf-af91b57f5d32", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 02:30", "url": "https://www.princegeorgecitizen.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358100", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nOTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil."}, {"id": "113c7347-28e8-4b15-8a16-54cd04b1a012", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 02:30", "url": "https://www.airdriecityview.com/national-news/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-9358096", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "OTTAWA — The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\n- With files from the Associated PressThis report by The Canadian Press was first published Aug. 15, 2024.\nThe Canadian Press"}]