[{"id": "ff29da54-80ab-4d5a-8285-050713c69715", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809715-Israel-attacks-Rafah-after-Hamas-claims-responsibility-for-deadly-rocket", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackWorld World Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it also struck a \"military structure\"Follow on Published On: Mon, 06 May 2024 08:44:32 PKTCAIRO (Reuters) – Three Israeli soldiers were killed in a rocket attack claimed by Hamas, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas's armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said."}, {"id": "e407a89e-217e-405d-81ff-a89f0b860fef", "title": "19 killed in Rafah as Israel retaliates to deadly Hamas rocket attack", "date": "2024-05-06 04:00", "url": "https://www.firstpost.com/world/19-killed-in-rafah-as-israel-retaliates-to-deadly-hamas-rocket-attack-13767464.html", "message": "ReutersThree Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nThe war began after Hamas stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies."}, {"id": "b53f3c59-dbe8-413f-a17f-12444284e8cd", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 04:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374065.html", "message": "The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\"."}, {"id": "97448254-f85e-4d9a-9d6f-84de78cbd62a", "title": "Middle East updates : Truce talks resume in Cairo – DW – 05 / 05 / 2024", "date": "2024-05-05 15:30", "url": "https://www.dw.com/en/middle-east-updates-truce-talks-resume-in-cairo/live-68999937", "message": "05/05/2024 May 5, 2024 Truce talks end without breakthrough, Hamas delegation returns to QatarThe latest negotiations on a proposed hostage deal and a cease-fire in Gaza have ended without an immediate breakthrough, according to reports.\nThe Palestinian militant group Hamas said Sunday the latest round of talks in Cairo had finished after \"in-depth and serious discussions.\"\nThe report said Hamas representatives would travel late Sunday to Doha, where Hamas has a political office, to consult with their chiefs.\nIsraeli Prime Minister Benjamin Netanyahu has said he would be willing to agree to a pause in fighting to allow hostages to be released.\nBurns has acted as a key interlocutor for the US in talks between Israel, Hamas, Egypt and Qatar over securing a deal."}, {"id": "9774ab6e-d485-4f28-8324-1476318fc28f", "title": "IDF orders Palestinians to evacuate eastern Rafah ahead of planned offensive", "date": "2024-05-06 09:00", "url": "https://www.firstpost.com/world/idf-rafah-israel-hamas-war13767512-13767512.html", "message": "ReutersThe Israeli Defense Forces (IDF) on Monday began calling on Palestinians in eastern Rafah to evacuate as Israel moves a step closer to expanding its attack in southern Gaza city.\nAccording to a report by the Times of Israel, Palestinian civilians are being ordered to move to an expanded humanitarian zone in the al-Mawasi and Khan Younis areas.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing but did not confirm where it fired them from.\n“We are observing worrying signs that Hamas does not intend to reach an agreement with us,” Gallant said.\n“This means strong military action in Rafah will begin in the very near future, and in the rest of the Strip.”AdvertisementWith inputs from Reuters"}, {"id": "1f557136-cbcd-4a6d-8a93-ac97b6bb6c1e", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/hamas-armed-wing-claims-responsibility-for-deadly-attack-on-israel-gaza-crossing/", "message": "CAIRO (Reuters) – The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”."}, {"id": "433b5174-71c4-4247-8d2a-7e0ae098c0f5", "title": "Responsible for Israel - Gaza border crossing attack , says Hamas", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/responsible-for-israel-gaza-border-crossing-attack-says-hamas", "message": "Hamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nIn response to Hamas' attack, more than 34,600 Palestinians have been killed, 29 of them in the past 24 hours, and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry.\nThe war began after a Hamas attack on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies."}, {"id": "18284173-5714-4411-a5de-5c82a5aaaae0", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809697-Hezbollah-attacks-Israel-after-deadly-south-Lebanon-strike", "message": "Hezbollah attacks Israel after deadly south Lebanon strikeWorld World Hezbollah attacks Israel after deadly south Lebanon strikeIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas."}, {"id": "ba2fc51a-6924-47ab-a35f-2334262f1ea1", "title": "Hamas armed wing says responsible for Israel - Gaza border crossing attack", "date": "2024-05-05 19:45", "url": "https://www.swissinfo.ch/eng/hamas-armed-wing-says-responsible-for-israel-gaza-border-crossing-attack/76969385", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack3 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Three Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said."}, {"id": "ee3301ea-83cc-468e-a06a-229641cc3750", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 07:45", "url": "https://kathmandupost.com/world/2024/05/06/israel-attacks-rafah-after-hamas-claims-responsibility-for-deadly-rocket-attack", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”.\nMourners react near to the bodies of Palestinians killed in an Israeli strike, at Abu Yousef al-Najjar hospital in Rafah, May 5, 2024."}, {"id": "2a817cd0-aa4a-4eff-915c-fae41e86dc71", "title": "IDF names two fatalities in Monday drone strike on Metula", "date": "2024-05-07 07:30", "url": "https://www.ynetnews.com/article/skx787vmc", "message": "The IDF said on Tuesday that 31-year old Master sergeant (res.)\nNahman Natan Hertz from the West Bank settlement of Elazar and 31-year old Master sergeant (res.)\nDan Kamkagi from the settlement of Kfar Oranim were killed in the Monday Hezbollahdrone strike on Metula"}, {"id": "590c1c42-8bb5-4196-a4cc-dd639f8a6bab", "title": "Hezbollah rocket barrage wounds two in Kiryat Shmona", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/breaking-news/article-799905", "message": "At least two people were lightly wounded after Hezbollah fired a barrage of several dozen rockets toward Kiryat Shmona on Sunday.\nThe Ziv Medical Center received two patients who were wounded by shock waves from the rocket fire.\nHezbollah took responsibility for the rocket fire, saying it launched dozens of Katyusha and Falaq rockets toward Kiryat Shmona in response to an earlier Israeli airstrike on Meiss El Jabal in southern Lebanon.\nA MDA ambulance hit by rocket shrapnel in Kiryat Shmona.\nNorthern residents issue demands to governmentOrganizations representing residents of northern Israel issued a joint statement on Sunday, expressing concerns about a ceasefire agreement reportedly being discussed between Hezbollah and Israel."}, {"id": "b81b1cc2-8123-4fa3-8d53-cf635f713cb2", "title": "Dogs start eating bodies of the dead in the streets of Rafah", "date": "2024-05-06 07:45", "url": "https://www.dailymail.co.uk/news/article-13386339/Dogs-start-eating-bodies-dead-streets-Rafah-Israel-begins-evacuation-city-offensive-imminent-latest-breakdown-peace-talks-Hamas.html", "message": "Animals have reportedly started eating the bodies of the dead in the street of Rafah, as Israel begins its evacuation of the city to prepare for an offensive against the last-remaining city in the Gaza Strip.\nDogs have been seen dragging corpses from the graves of people buried in Gaza, according to Palestinian civilians who spoke to the BBC.\nThe Israeli military this morning told Palestinians to evacuate eastern Rafah, amid an expected military offensive that aims to wipe out any remaining Hamas fighters in the region.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing on Saturday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields."}, {"id": "2562fd19-5edd-494a-b17c-656743741c39", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/", "message": "AMMAN (Reuters) – An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired “tens” of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies."}, {"id": "9673caca-5bf7-40f8-8a6b-094b0df43ba9", "title": "4 Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 04:45", "url": "https://www.asiaone.com/world/4-lebanese-civilians-killed-israeli-strike-border-village", "message": "AMMAN — An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday (May 5), civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies."}, {"id": "adda41a8-6b76-49ca-8855-845f90e2a851", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 15:30", "url": "https://www.hurriyetdailynews.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike-193163", "message": "Hezbollah launches rockets at Israel after deadly south Lebanon strikeBEIRUTA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nHezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\"."}, {"id": "36a5901f-57b3-4513-8a21-07f46f85e150", "title": "Middle East updates : Gaza truce talks in Cairo end – DW – 05 / 05 / 2024", "date": "2024-05-05 19:00", "url": "https://www.dw.com/en/middle-east-updates-gaza-truce-talks-in-cairo-end/live-68999937", "message": "05/05/2024 May 5, 2024 Truce talks end without breakthrough, Hamas delegation returns to QatarThe latest negotiations on a proposed hostage deal and a cease-fire in Gaza have ended without an immediate breakthrough, according to reports.\nThe Palestinian militant group Hamas said Sunday the latest round of talks in Cairo had finished after \"in-depth and serious discussions.\"\nThe report said Hamas representatives would travel late Sunday to Doha, where Hamas has a political office, to consult with their chiefs.\nIsraeli Prime Minister Benjamin Netanyahu has said he would be willing to agree to a pause in fighting to allow hostages to be released.\nBurns has acted as a key interlocutor for the US in talks between Israel, Hamas, Egypt and Qatar over securing a deal."}, {"id": "54bd8a0e-1faa-4498-8888-7082d73bca0e", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 12:45", "url": "https://economictimes.indiatimes.com/news/defence/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/articleshow/109859718.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas 's unprecedented October attack on southern Israel sparked the war in Gaza.Fighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.Lebanon's state-run National News Agency said the strike in Mais al-Jabal killed \"four people from a single family\", updating an earlier reported toll of three dead in the raid it said was carried out by Israeli aircraft.It identified them as a man, a woman and their children aged 12 and 21, and said two other people were wounded.A Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".Mais al-Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.Hezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".The Lebanese movement has repeatedly declared that only a ceasefire in Gaza will put an end to its attacks on Israel, which it says are in support of Gazans and its ally Hamas.Both the United States and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.In Lebanon, at least 390 people have been killed in nearly seven months of cross-border violence, mostly militants but also more than 70 civilians, according to an AFP tally.Israel says 11 soldiers and nine civilians have been killed on its side of the border.Tens of thousands of people have been displaced on both sides."}, {"id": "37a1ef88-727d-473a-9d47-3676869d9761", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-05 18:30", "url": "https://gazette.com/news/us-world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/article_7ef7063d-e5d5-5751-aad5-8ce8d8841378.html", "message": "AMMAN (Reuters) -An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies."}, {"id": "edc600b4-e86b-4362-9ec5-f04186fc1c54", "title": "Border Crossing Where Humanitarian Aid Enters Gaza Has Been Blown Up . Guess Who Taking Credit . ", "date": "2024-05-06 18:30", "url": "https://townhall.com/tipsheet/spencerbrown/2024/05/06/hamas-blew-up-the-entry-point-for-humanitarian-aid-headed-to-gaza-n2638654", "message": "Hamas terrorists claimed credit for a rocket attack on Sunday targeting the Kerem Shalom border crossing between Israel and Gaza near the Egyptian border, the main entry point for humanitarian aid headed into the enclave.\nThey fell during a Hamas rocket attack on Kerem Shalom earlier today.\n\"Yes, they’re bombing their own lifeline of food and aid,\" he said of the rocket attack.\nYet again, however, it is Hamas terrorists who are preventing aid from making it to those who need it.\nThe IDF released footage of Hamas rocket launches at the Kerem Shalom Crossing, which is used for trucks to carry aid into Gaza."}, {"id": "a068d39b-4225-401d-bd02-1a821ea148a6", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/mena/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike", "message": "A soldier looks at a burning car at the site of a rocket that was fired towards Israel from Lebanon in Kiryat Shmona.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nMais Al Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.\nIt later said it fired dozens more Katyusha rockets at Israeli troops and vehicles across the border \"as part of the response\" to the Mais Al Jabal strike."}, {"id": "3f3369a6-88df-4bf9-a734-b10af6e03c50", "title": "Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault", "date": "2024-05-06 10:15", "url": "https://www.armenpress.am/eng/news/1136385.html", "message": "The Israeli army has told Palestinians to begin evacuating eastern Rafah, according to an Israeli Defense Force statement on Monday, signaling that a ground invasion is imminent.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\", Reuters adds.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nMore than 34,600 Palestinians have been killed and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry."}, {"id": "243d994d-cdd7-4df7-8f18-36b377d2063e", "title": "Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault", "date": "2024-05-06 07:15", "url": "https://armenpress.am/eng/news/1136385/", "message": "The Israeli army has told Palestinians to begin evacuating eastern Rafah, according to an Israeli Defense Force statement on Monday, signaling that a ground invasion is imminent.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\", Reuters adds.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nMore than 34,600 Palestinians have been killed and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry."}, {"id": "c1afa142-d521-48f1-8322-f64d3719fcc1", "title": "Four Lebanese killed in Israeli airstrike", "date": "2024-05-05 19:45", "url": "https://www.thedailystar.net/news/world/news/four-lebanese-killed-israeli-airstrike-3603006", "message": "Hezbollah launches retaliatory strikesAn Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon yesterday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nBoth the US and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border."}, {"id": "4765c12b-2443-4934-a958-5078392955ab", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 01:15", "url": "https://www.thehindu.com/news/international/hezbollah-attacks-israel-after-deadly-south-lebanon-strike/article68143616.ece", "message": "Fighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas."}, {"id": "c1d8dc46-e619-4771-802b-3cbd2b0c0aac", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 19:00", "url": "https://www.al-monitor.com/originals/2024/05/hezbollah-attacks-israel-after-deadly-south-lebanon-strike", "message": "May 5, 2024 — Beirut (AFP)Official media in Lebanon said an Israeli strike Sunday on a southern village killed four family members, with Hezbollah announcing retaliatory attacks, in the latest cross-border violence since the Gaza war erupted.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas."}, {"id": "b0a144ca-4069-4a8a-873a-b3429673faf8", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 13:15", "url": "https://www.al-monitor.com/originals/2024/05/hezbollah-launches-rockets-israel-after-deadly-south-lebanon-strike", "message": "May 5, 2024 — Beirut (AFP)Official media in Lebanon said an Israeli strike Sunday on a southern village killed four family members, with Hezbollah announcing retaliatory attacks, in the latest cross-border violence since the Gaza war erupted.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas."}, {"id": "b367a89a-619e-4328-a065-444ff4fb797a", "title": "Knife - wielding teen shot dead by Australian police", "date": "2024-05-05 20:45", "url": "https://www.yahoo.com/news/knife-wielding-teen-shot-dead-193031432.html", "message": "Photo by Lukas Coch/EPA-EFEMay 5 (UPI) -- Australian police shot and killed a 16-year-old following a stabbing attack that had \"hallmarks\" of terror, officials confirmed Sunday.\n\"It's a very tragic event in Western Australia,\" Police Commissioner Col Blanch said at a news conference Sunday morning.\nResponding officers drew tasers, which failed to stop the teen as he rushed at them.\nThe emergency caller was reported to have been the teen, who told dispatchers he was prepared to commit a violent act at about 10 p.m.\n\"There are indications that he had been radicalized online,\" Roger Cook, the premier of the state of Western Australia, said in the news conference."}, {"id": "9a30af15-2007-415b-8a59-a85acfb97351", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 22:00", "url": "https://www.bssnews.net/international/187330", "message": "Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon."}, {"id": "8b5dbf2b-552b-4f75-b868-850f6da6a5c8", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 19:45", "url": "https://www.yahoo.com/news/israeli-strike-kills-4-civilians-185339652.html", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers."}, {"id": "14be9b50-5211-480a-bbc7-25fca5061f35", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:45", "url": "https://abcnews.go.com/International/wireStory/israeli-strike-kills-4-civilians-southern-lebanon-state-109941999", "message": "Lebanese state media and the town’s municipality report that an Israeli airstrike in the town of Mays al Jabal in south Lebanon has killed four civilians and wounded several othersBEIRUT -- An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nHezbollah on Sunday said it conducted at least 10 attacks targeting Israeli military positions and surveillance gear near the tense Lebanon-Israel border, while the Israeli military said it identified some 40 missiles that crossed into Israeli territory but did not cause any casualties.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers."}, {"id": "d11c5c75-c233-48ae-9ce4-365b6e83d899", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:00", "url": "https://www.startribune.com/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says/600363862/", "message": "BEIRUT — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers."}, {"id": "28a27348-fd31-4162-8f3e-de7a38eaadaa", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says – Winnipeg Free Press", "date": "2024-05-05 19:15", "url": "https://www.winnipegfreepress.com/world/2024/05/05/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town’s municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers."}, {"id": "14fac760-a1b0-4405-9373-1a52b7d1f51a", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says | iNFOnews", "date": "2024-05-05 19:30", "url": "https://infotel.ca/newsitem/ml-lebanon-israel/cp2009476227", "message": "Israeli strike kills 4 civilians in southern Lebanon, state media saysBEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers."}, {"id": "c729a76a-1214-4c82-adf8-53acd9f058e3", "title": "Israeli airstrike that killed seven health workers in Lebanon used US munition , analysis reveals", "date": "2024-05-06 05:00", "url": "https://www.theguardian.com/world/article/2024/may/06/israel-airstrike-lebanon-us-weapons-international-law", "message": "Five days after the attack on healthcare workers in Lebanon, Israel killed another seven aid workers employed by the World Central Kitchen in Gaza.\nAn Israeli military spokesperson said that the airstrike in al-Habariyeh killed a “prominent terrorist belonging to Jamaa Islamiya”.\nView image in fullscreen Workers inspect the site of the Israeli airstrike in al-Habariyeh.\nView image in fullscreen Shrapnel from the Israeli airstrike is displayed along with medical equipment at the rescue workers’ funeral in Beirut, Lebanon.\nSince 7 October, Israel has killed 16 medical workers in Lebanon, including 10 in a single day at the end of March."}, {"id": "30f1bc78-1b40-4760-83c6-10cb75d2c67c", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 04:00", "url": "https://www.siasat.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah-3021023/", "message": "Tel Aviv: The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nDefence Minister Yoav Gallant and Minister without portfolio, Benny Gantz will be participating in the war cabinet to be held later in the day.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo."}, {"id": "041539d8-69f0-4820-abfc-144a91c1be9d", "title": "Teen shot dead by police blows up toilet with homemade bomb", "date": "2024-05-07 03:30", "url": "https://www.perthnow.com.au/news/teen-shot-dead-by-police-blows-up-toilet-with-homemade-bomb-c-14574103", "message": "Footage has resurfaced of the Perth teenager shot dead by police using a homemade explosive to blow up a school toilet two years earlier.\nIn the video, students are left screaming and laughing following the explosion inside Rossmoyne Senior High School in Perth.\nREAD NOWCamera Icon The 16-year-old was shot by police after a carpark stabbing.\nSupplied Credit: NCA NewsWireCamera Icon The Rossmoyne Senior High School student had been enrolled in a deradicalisation program.\nCamera Icon The 16-year-old boy blew up a school toilet with a homemade explosive device."}, {"id": "1893dd1c-1ed0-4223-bbf5-1bb567a453cd", "title": "4 killed in Israeli strikes in S . Lebanon - Xinhua", "date": "2024-05-05 15:30", "url": "https://english.news.cn/20240505/2e6299d9a3b8480090eea4fb5e8773f9/c.html", "message": "(Ayal Margolin/JINI via Xinhua)This photo taken on May 6, 2024 shows a building destroyed during an Israeli strike in Mays al-Jabal, Lebanon.\nFour people were killed and three others were injured on Sunday in an Israeli airstrike on the southeast village of Mays al-Jabal, Lebanese military sources told Xinhua.\n(Photo by Ali Hashisho/Xinhua)This photo taken on May 6, 2024 shows a building destroyed during an Israeli strike in Mays al-Jabal, Lebanon.\n(Photo by Ali Hashisho/Xinhua)A soldier checks buildings destroyed during an Israeli strike in Mays al-Jabal, Lebanon, on May 6, 2024.\nFour people were killed and three others were injured on Sunday in an Israeli airstrike on the southeast village of Mays al-Jabal, Lebanese military sources told Xinhua."}, {"id": "bc1eb9e6-eb82-4605-9d37-e280156db90e", "title": "Car Bomb Kills Russian Who Tortured Ukrainian Prisoners", "date": "2024-05-06 08:30", "url": "https://www.kyivpost.com/post/32166", "message": "77 and may have been involved in the interrogation of Ukrainian military and civilian prisoners.\nIt said it was carrying out forensic investigations and had initiated a criminal procedure and instituted operational measures to identify those involved in the car bombing.\nRussia has also been attempting to develop rail links between Berdyansk and other occupied cities.\nSeveral Russian-installed officials have been killed in car explosions in occupied territories since the start of the full-scale invasion.\nOn March 6 Svitlana Samoilenko, another Kremlin-installed official who was helping to arrange activities linked to the Russian presidential elections in occupied Berdyansk was killed in a similar way."}, {"id": "bf169360-8cc8-4a59-a9c6-5e828086e33e", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 06:30", "url": "https://www.dailyexcelsior.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah/", "message": "Tel Aviv, May 6 : The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe airstrike was in retaliation to the barrage of rockets fired by Hamas at a ground near Kerem Shalom in Southern Israel killing three Israel Defense Forces (IDF) soldiers and injuring 11 soldiers.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo."}, {"id": "7c7899ed-cc6a-41e8-99b4-a47ed5428bfa", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.yahoo.com/news/latest-israeli-military-orders-evacuation-081150261.html", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nISRAEL SAYS IT WILL KEEP UP MILITARY OPERATIONS IN GAZA AS OFFICIALS CONSIDER HAMAS CEASE-FIRE PROPOSALJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nISRAELI OFFICIAL WARNS THAT HAMAS CEASE-FIRE PROPOSAL DOES NOT MEET ISRAELI FRAMEWORKJERUSALEM -- An official familiar with Israeli thinking says Israeli officials are examining the cease-fire proposal approved by Hamas."}, {"id": "2f4d1376-9169-4355-99b9-8ca422558262", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:15", "url": "https://www.ksat.com/news/2024/05/06/the-latest-israeli-military-orders-evacuation-of-parts-of-rafah-ahead-of-possible-ground-invasion/", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nISRAEL SAYS IT WILL KEEP UP MILITARY OPERATIONS IN GAZA AS OFFICIALS CONSIDER HAMAS CEASE-FIRE PROPOSALJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nISRAELI OFFICIAL WARNS THAT HAMAS CEASE-FIRE PROPOSAL DOES NOT MEET ISRAELI FRAMEWORKJERUSALEM -- An official familiar with Israeli thinking says Israeli officials are examining the cease-fire proposal approved by Hamas."}, {"id": "0e982e4e-a8b5-4e50-b84b-720feab33308", "title": "Elevator Damaged In Poltava Region Due To Missile Attack", "date": "2024-05-05 19:45", "url": "https://menafn.com/1108175771/Elevator-Damaged-In-Poltava-Region-Due-To-Missile-Attack", "message": "(MENAFN- UkrinForm) An elevator in the Poltava region was damaged by a Russian missile attack.\nThe head of the Poltava Regional Military Administration, Philip Pronin, reported this on Telegram , according to Ukrinform.\nA missile strike damaged an elevator in the Poltava community,” he said.\nInjury toll in Russian missile strike onregion rises to 16According to Pronin, there were no casualties.\nThe RMA confirmed the sounds of an explosion in the Poltava region."}, {"id": "6fcd83b2-c8fd-4255-992c-5ffe0fe7f624", "title": "IDF strikes Hezbollah - Radwan base after drone strike on Metula", "date": "2024-05-06 13:00", "url": "https://www.ynetnews.com/article/s1joamlmc", "message": "The Iran-backed terror group fired a barrage of at least 30 rockets at the Golan Heights, in response to the overnight strike on a Hezbollah base deep inside Lebanon, where at least three people were injured, claiming to aim for a military position there."}, {"id": "f9a621e9-9a46-424b-83f2-c2572fc2d344", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.clickorlando.com/news/2024/05/06/the-latest-israeli-military-orders-evacuation-of-parts-of-rafah-ahead-of-possible-ground-invasion/", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nISRAEL SAYS IT WILL KEEP UP MILITARY OPERATIONS IN GAZA AS OFFICIALS CONSIDER HAMAS CEASE-FIRE PROPOSALJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nISRAELI OFFICIAL WARNS THAT HAMAS CEASE-FIRE PROPOSAL DOES NOT MEET ISRAELI FRAMEWORKJERUSALEM -- An official familiar with Israeli thinking says Israeli officials are examining the cease-fire proposal approved by Hamas."}, {"id": "bbfd0ac8-bf99-4e02-af29-d2ffcbd369c0", "title": "Hamas attack on aid crossing that killed Israeli troops", "date": "2024-05-06 01:30", "url": "https://www.dailymail.co.uk/news/article-13385905/Hamas-attack-aid-crossing-killed-Israeli-troops-leaves-peace-hopes-tatters.html", "message": "A Hamas attack on an aid crossing that killed Israeli troops was last night branded proof that the terror group is using Palestinians as 'human shields', dashing hopes for an end to the violence in Gaza.\nThe escalation came as the latest round of ceasefire talks were 'near to collapse', with Israeli Prime Minister Benjamin Netanyahu flatly ruling out any end to the war.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing yesterday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields.\nIt came as talks between Hamas negotiators and Egyptian and Qatari mediators in Cairo threatened to break down."}, {"id": "efdedcc7-5079-4bb7-b5cf-7ae2d76b6fe7", "title": "Israel : Two reservists killed by Hezbollah fire on Lebanese border", "date": "2024-05-07 10:45", "url": "https://www.prokerala.com/news/articles/a1529040.html", "message": "DO NOT RELEASE----Israel: Two reservists killed by Hezbollah fire on Lebanese border.\nImage Source: IANS NewsTel Aviv/Beirut, May 7 : Two Israeli reservists have been killed in a drone attack by the Lebanese Shiite militia Hezbollah, the Israeli army said on Tuesday.\nThe two 31-year-old soldiers were killed on Monday in an incident on Israel's northern border, the army said.\nAccording to Lebanese reports, four civilians - a couple and their two sons - were killed in an Israeli airstrike in Lebanon on Sunday.\nSince the beginning of the Gaza war seven months ago, there have been repeated military confrontations between Israel's army and the Hezbollah militia in Lebanon on the border, with multiple casualties on both sides."}, {"id": "8c1834b5-82ce-4701-94ae-854850564645", "title": "Hezbollah responds to deadly Israeli strike on south Lebanon", "date": "2024-05-06 12:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240505-irna04.htm", "message": "Hezbollah responds to deadly Israeli strike on south LebanonIRNA - Islamic Republic News AgencyMay 5, 2024Tehran, IRNA -- Lebanon's Hezbollah resistance movement has launched rockets towards northern Israeli-occupied territories after at least two civilians were killed when the Israeli regime hit a border village in southern Lebanon.\nThe Israeli military said on Sunday that sirens were sounding in Kiryat Shmona and other parts of northern occupied territories following the rocket attack by Hezbollah.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nSince October 8, a day after the Israeli regime launched its genocidal war on Gaza, Hezbollah and the Israeli military have traded fire across the border on an almost daily basis."}, {"id": "d817bf08-f86a-4009-b1ea-4d257227973d", "title": "Combat Terrorism in Poonch - Rajouri", "date": "2024-05-06 04:00", "url": "https://www.dailyexcelsior.com/combat-terrorism-in-poonch-rajouri/", "message": "The martyrdom of Vicky Pahade underscores the urgent need for a concerted and unified effort to combat terrorism in the troubled region.\nDespite concerted efforts by security forces, terrorists continue to find ways to perpetrate violence and sow fear among civilians by attacking security personnel.\nHowever, these cowardly acts won’t dampen the resolve of security forces, who vow to respond effectively.\nGiven the varied terror activities across different districts, security forces must reassess their strategies to counter evolving threats.\nAttacks on security forces cannot be tolerated, and the public’s cooperation in providing vital information is essential."}, {"id": "cfb5137b-0cd9-4e84-b1ce-60c4121b9a6c", "title": "Lebanon Hezbollah says fired dozens of rockets at Israeli base", "date": "2024-05-06 11:45", "url": "https://www.philstar.com/world/2024/05/06/2353097/lebanons-hezbollah-says-fired-dozens-rockets-israeli-base", "message": "BEIRUT, Lebanon — The Iran-backed Hezbollah group said it fired \"dozens of Katyusha rockets\" at an Israeli base in the occupied Golan Heights on Monday in retaliation for a strike in Lebanon's east.\nEarlier, Lebanese official media said three people had been wounded in an Israeli strike early Monday in the country's east, with the Israeli army saying it had struck a Hezbollah \"military compound\".\nIsrael and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\".\nLast month, a building in Sifri was targeted in an Israeli raid, according to a source close to Hezbollah, while the Israeli army said it had targeted Hezbollah sites in Lebanon's east."}, {"id": "115b16a6-3edd-4055-b8b3-1a1066718f0e", "title": "Hezbollah Says Launches Dozens Of Rockets At Israeli Base In Retaliation", "date": "2024-05-06 13:45", "url": "https://www.ndtv.com/world-news/hezbollah-says-launches-dozens-of-rockets-at-israeli-base-in-retaliation-5601556", "message": "(File)Lebanese official media said an Israeli strike Monday wounded three people in the country's east, with Hezbollah saying it launched \"dozens of Katyusha rockets\" at an Israeli base in retaliation.\nIsrael and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian combatant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nIn recent weeks Hamas-ally Hezbollah has stepped up its attacks on northern Israel, and the Israeli military has struck deeper into Lebanese territory.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\".\nLast month, a building in Sifri was targeted in an Israeli raid, while the Israeli army said it had targeted Hezbollah sites in Lebanon's east."}, {"id": "afae4b46-2384-495b-b7d2-499988f02f60", "title": "Iran IRGC Terrorists Sail Warship into Southern Hemisphere", "date": "2024-05-07 03:30", "url": "https://www.breitbart.com/middle-east/2024/05/06/irans-irgc-terrorists-sail-warship-into-southern-hemisphere/", "message": "Iran announced that Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\nThe Shahid Mahdavi is on a “long-distance mission” in international waters, the Iranian state-owned PressTV propaganda outlet reported.\nIranian state media claimed that the warship was “conducting its biggest mission in terms of distance and operation,” without specifying further.\nIran's IRGC Navy floating base Shahid Mahdavi used as mobile platform at sea to launch ballistic missiles.\nDezful medium-range ballistic missile launched from 40-foot containers on the deck of the Shahid Mahdavi."}, {"id": "2a908f4c-2b21-4ba7-ab6e-29c9f86ff4f0", "title": "Hezbollah retaliates after Israeli raid in Lebanon ; Bibi against ending war early", "date": "2024-05-05 19:45", "url": "https://economictimes.indiatimes.com/news/defence/hezbollah-retaliates-after-israeli-raid-in-lebanon-bibi-against-ending-war-early/articleshow/109864580.cms", "message": "It identified them as a man, a woman and their children aged 12 and 21, and said two other people were wounded.\n\"But while Israel has shown willingness, Hamas remains entrenched in its extreme positions, first among them the demand to remove all our forces from the Gaza Strip, end the war, and leave Hamas in power.\nIsrael cannot accept that.\n\"There is famine - full-blown famine in the north, and it's moving its way south,\" Cindy McCain , the program's director.McCain is the second high-profile American leading a US government or UN aid effort who has said there is famine in northern Gaza, although her remarks do not constitute an official declaration, which is a complex bureaucratic process.\nShe said her assessment was \"based on what we have seen and what we have experienced on the ground.\""}, {"id": "010373c5-6958-4382-a5cf-55947d3f3a88", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://abcnews.go.com/International/wireStory/latest-israeli-military-orders-evacuation-parts-rafah-ahead-109948804", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nRAFAH, Gaza Strip -- The United Nations agency serving Palestinian refugees says it will not comply with an Israeli military order to evacuate parts of the southern Gaza city of Rafah."}, {"id": "1b0ca0c9-7919-4cbb-b792-b97ad3007842", "title": "Hezbollah fires dozens of rockets at Golan after Israeli strike on Baalbek town", "date": "2024-05-06 08:30", "url": "https://www.naharnet.com/stories/en/305017-hezbollah-fires-dozens-of-rockets-at-golan-after-israeli-strike-on-baalbek-town", "message": "Hezbollah said it fired \"dozens of Katyusha rockets\" at an Israeli base in the occupied Golan Heights on Monday in retaliation for a strike in Lebanon's east.\nEarlier, Lebanese official media said three people had been wounded in an Israeli strike early Monday on a factory in the country's east, with the Israeli army saying it had struck a Hezbollah \"military compound.\"\nIsrael and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian militant group Hamas' unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nIn recent weeks Hamas-ally Hezbollah has stepped up its attacks on northern Israel, and the Israeli military has struck deeper into Lebanese territory.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\"."}, {"id": "e4945a31-4aae-4b9b-b68c-77c43b8b86ac", "title": "Hezbollah says fires at Israel after east Lebanon strike", "date": "2024-05-06 11:45", "url": "https://www.yahoo.com/news/hezbollah-says-fires-israel-east-110924010.html", "message": "Israel and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nIn recent weeks Hamas-ally Hezbollah has stepped up its attacks on northern Israel, and the Israeli military has struck deeper into Lebanese territory.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\".\nThe army also said \"fighter jets struck approximately 15 (Hezbollah) military structures and terror infrastructure\" in south Lebanon.\nOn Sunday official media in Lebanon said an Israeli strike on a southern village killed four family members, with Hezbollah announcing retaliatory attacks."}, {"id": "9b2185b5-ada9-4d65-80b1-c58cad561304", "title": "Do you know these men ? NSW Police reveal new faces of Wakeley riot after Mar Mari Emmanuel was stavved", "date": "2024-05-07 04:00", "url": "https://www.dailymail.co.uk/news/article-13389131/Search-people-church-riots-Sydney.html", "message": "The first person depicted (Person P) is described as being a man of Mediterranean/Middle Eastern appearance, slim build, with short dark hair.\nHe is shown wearing light coloured clothing, dark coloured shoes and carrying a black bag across his body.\nHe is shown wearing a grey hooded jumper, black cap, black shorts and white shoes.\nHe is shown wearing a black singlet, shorts, cap and shoes.\nShe is shown wearing a singlet top and shorts, with a shirt tied around her waist and a dark coloured cap."}, {"id": "52af8cab-b465-4399-af5a-e1316197413f", "title": "Israel strikes Hamas facility located inside UNRWA complex", "date": "2024-05-06 11:45", "url": "https://news.webindia123.com/news/Articles/World/20240506/4194671.html", "message": "Meanwhile, the army said three soldiers were killed and 11 injured in a rocket attack on the Kerem Shalom crossing earlier in the day.\nFrom the command and control centre, Hamas oversaw the supply of weapons to dozens of terrorists, including those operating in nearby terror tunnels.\nFighter jets launched a precise strike on the facility inside a compound belonging to the UN Relief and Works Agency (UNRWA).\nEarlier in the day, Hamas fired a barrage of 10 rockets at the Kerem Shalom crossing, killing three soldiers and injuring 11 more.\nOf all the Gaza border crossings, Kerem Shalom is equipped to handle the most humanitarian aid trucks on a daily basis."}, {"id": "61e0dca2-9b7b-490b-aedd-c881801de057", "title": "Israel Tells Civilians to Leave Rafah as It Weighs Attack", "date": "2024-05-06 11:45", "url": "https://www.yahoo.com/news/israel-tells-civilians-leave-rafah-101159787.html", "message": "(Bloomberg) -- Israel’s military has told civilians to move out of parts of Rafah, a possible prelude to a long-expected attack on the Gazan city.\nIsraeli Prime Minister Benjamin Netanyahu has for months said civilians in Rafah would be moved out before any attack.\nWhy Israel’s Plans to Invade Rafah Are So Worrying: QuickTakeIt’s unclear how long it would take for the bulk of the civilians to leave.\nMost Arab and many European states have said Israel should not attack Rafah, fearing it would cause a mass of casualties.\nMany civilians may choose to remain in Rafah if they’re unsure of the conditions where they’re being told to go."}, {"id": "4c369777-75c6-43cd-b600-39e6245d9a96", "title": "Israel Tells Civilians to Leave Rafah as It Weighs Attack", "date": "2024-05-06 11:00", "url": "https://finance.yahoo.com/news/israel-tells-civilians-leave-rafah-101159457.html", "message": "(Bloomberg) -- Israel’s military has told civilians to move out of parts of Rafah, a possible prelude to a long-expected attack on the Gazan city.\nIsraeli Prime Minister Benjamin Netanyahu has for months said civilians in Rafah would be moved out before any attack.\nWhy Israel’s Plans to Invade Rafah Are So Worrying: QuickTakeIt’s unclear how long it would take for the bulk of the civilians to leave.\nMost Arab and many European states have said Israel should not attack Rafah, fearing it would cause a mass of casualties.\nMany civilians may choose to remain in Rafah if they’re unsure of the conditions where they’re being told to go."}, {"id": "1c7d992a-e293-4d32-b765-9d8ac910ba33", "title": "Opinion | Red Flag for India as China Disbands SSF with AI Warfare on Mind", "date": "2024-05-05 15:45", "url": "https://www.news18.com/opinion/opinion-red-flag-for-india-as-china-disbands-ssf-with-ai-warfare-on-mind-8878871.html", "message": "The PLA now comprises four arms — the three new forces plus the pre-existing Joint Logistics Support Force — and four services, the PLA Ground Force (PLAGF), PLA Navy (PLAN), PLA Air Force (PLAAF) and PLA Rocket Force (PLARF).\nIt relied on network information systems, informationised weapons and equipment and was supposed to be conducted in the land, sea, air, space, cyber electromagnetic and cognitive domains.\nThe IFS intends to enhance the PLA’s combat capability by utilising the network information system, including cyberattacks, to cripple the enemy’s chain of command system.\nChina is also looking into using AI to help in the guidance, detection and identification of targets by missiles.\nInstead, it will wage an asymmetrical war using a combination of information warfare and AI."}, {"id": "97bfc356-cceb-4d6b-bfa3-0dd03efdf221", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 06:30", "url": "https://www.yahoo.com/news/hrw-israel-attack-lebanon-rescuers-055011584.html", "message": "The March 27 strike levelled the emergency services centre in the Lebanese village of Habariyeh (Rabih DAHER)Human Rights Watch said Tuesday an Israeli strike in Lebanon that killed seven first responders was \"an unlawful attack on civilians\", and urged Washington to suspend weapons sales to Israel.\n\"An Israeli strike on an emergency and relief centre\" in the southern village of Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and constituted an \"unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\nThe Israeli military did not immediately comment when contacted by AFP.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" HRW's Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\"."}, {"id": "b9f3cd17-4579-4aa2-8a93-8044ad9541ae", "title": "Israel Strikes Hamas Facility Located Inside UNRWA Complex | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 28 Nisan 5784 – Monday , May 6 , 2024", "date": "2024-05-06 05:00", "url": "https://www.jewishpress.com/news/global/un/israel-strikes-hamas-facility-located-inside-unrwa-complex/2024/05/06/", "message": "Meanwhile, the army said three soldiers were killed and 11 injured in a rocket attack on the Kerem Shalom crossing earlier in the day.\nFighter jets launched a precise strike on the facility inside a compound belonging to the UN Relief and Works Agency (UNRWA).\nKerem Shalom ClosedEarlier in the day, Hamas fired a barrage of 10 rockets at the Kerem Shalom crossing, killing three soldiers and injuring 11 more.\nOf all the Gaza border crossings, Kerem Shalom is equipped to handle the most humanitarian aid trucks on a daily basis.\nRuben Marc Mordechai Assouline, 19, from Ra’anana, Staff Sgt."}, {"id": "92f20cfb-1b86-4d49-85d1-8a58de48f8a6", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 16:30", "url": "https://thefrontierpost.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/", "message": "BEIRUT (AFP): A local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon’s Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas’s unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed “four civilians”.\nHezbollah in a statement said it fired “dozens of Katyusha and Falaq rockets” at Kiryat Shmona in northern Israel “in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal”."}]