[{"id": "5b105b5f-fc90-4bf8-829a-49c98d96e8b1", "title": "Ismail Haniyeh death explained by Hamas and Iranian media", "date": "2024-08-04 04:30", "url": "https://www.jpost.com/middle-east/article-813151", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Following the assassination of former Hamas political leader Ismail Haniyeh, there have been differing reports by Hamas and Iran regarding how he was killed, according to a Saturday report by the Arabic news outlet Al-Araby.\nKhaled Qaddoumi, Hamas's representative in Tehran, said that the assassination occurred through the targeting of Haniyeh's room with an \"aerial projectile,\" citing the explosion's impact on the room.\n\"The appearance of the place after the attack and the condition of the martyred leader Ismail Haniyeh's body clearly indicate that the targeting was by an aerial projectile, whether a missile or a shell.\"\nQaddoumi's remarks were consistent with what Khalil al-Hayya, senior head of Hamas in Gaza, stated in a press conference on Wednesday, hours after Haniyeh's assassination.\nThe Al-Araby report concluded that \"In the absence of a comprehensive official narrative, the execution of Ismail Haniyeh's assassination remains mysterious, despite the known identity of the perpetrators.\""}, {"id": "6cfad0e1-90fe-4f72-bae8-845357935db4", "title": "Israel claims it murdered additional Hamas commander in Gaza", "date": "2024-08-04 11:45", "url": "https://menafn.com/1108514890/Israel-claims-it-murdered-additional-Hamas-commander-in-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) The Israel Defense Forces (IDF) have reported the death of a high-ranking Hamas commander following a recent in Gaza.\nThe IDF initially announced the killing of Rafa Salameh, the head of Hamas forces in Khan Yunis, in the same strike.\nThe strike was part of a broader series of attacks on Khan Yunis on that date, which resulted in significant casualties.\nHamas has yet to confirm or deny the reported death of Deif.\nThe attack on Khan Yunis, along with other recent developments, underscores the intense and ongoing conflict between Israel and Hamas."}, {"id": "ad509641-8c0d-4ff0-8af1-82ec2c5a0a19", "title": "President Biden hopes Iran backs down from conflict with Israel - after Hezbollah fires rocket barrage from Lebanon", "date": "2024-08-04 05:30", "url": "https://news.sky.com/story/president-biden-hopes-iran-backs-down-from-conflict-with-israel-after-hezbollah-fires-rocket-barrage-from-lebanon-13190440", "domain": "news.sky.com", "domain_classification": "International", "message": "US President Joe Biden has said he hopes Iran will back down from threats of retaliation against Israel to avert a serious war in the Middle East.\nThe assassination came a day after the Israeli military claimed to have killed a senior commander of Lebanese militant group Hezbollah in Beirut.\nAnalysis:It seems inevitable assassinations will expand war zoneImage: L: Israel's Iron Dome targeting Hezbollah rockets.\nImage: President Joe Biden on 2 August outside the White House before travelling to Delaware, where he spoke to reporters.\nThe group said the barrage was a response to Israeli strikes which killed civilians in two villages in the south of Lebanon."}, {"id": "57ab93cc-ab87-49c7-a879-d84919307c22", "title": "Hezbollah fires dozens of rockets at Israel as full - blown war fears explode", "date": "2024-08-04 08:45", "url": "https://www.express.co.uk/news/world/1931818/hezbollah-fires-rockets-israel", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The IDF said 'most' of the missiles were intercepted by Israel's Iron Dome defence system.\nHezbollah says it's fired “dozens” of rockets from Lebanon amid fears a full-blown war could break out between the two countries.\nIsrael had been bracing for a response from Iran and its proxies after the killing of Hamas’s political leader in Tehran.\nIsraeli media now reports that 50 rockets have been launched from southern Lebanon in the direction of upper Galilee alone.\nDramatic video showed Israel's Iron Dome air defence system being triggered to take out the incoming rockets, with the Israel Defence Forces (IDF) confiming that \"most\" of the 30 \"projectiles\" sent towards Israel on Satuday night were intercepted."}, {"id": "b280d6cc-7102-4ee3-bae2-b2b2a3d6ea4a", "title": "US Destroys Houthi Missile In Yemen Amid Attacks On Ships Near Coastal Area", "date": "2024-08-04 07:45", "url": "https://menafn.com/1108514292/US-Destroys-Houthi-Missile-In-Yemen-Amid-Attacks-On-Ships-Near-Coastal-Area", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Live Mint) The United States military has successfully destroyed one Iranian-backed Houthi land attack missile (LACM) in Houthi-controlled territory in Yemen, the USCENTCOM said in an official statement.\n| Israeli jets strike Houthi targets in Yemen after Tel Aviv attackOn Saturday, Britain's maritime agency reported attacks on two ships near the Yemen coast.\nThe British maritime agency had earlier reported an incident 170 nautical miles southeast of Aden, Yemen.\n| Suspected Houthi attack targets a ship in the Gulf of Aden, while Iraqi-claimed attack targets EilatThe Houthis control significant portions of Yemen after nearly a decade of conflict against a Western-backed and Saudi-led coalition.\nThey have vocally supported Palestinians amid Israel 's ongoing conflict in Gaza, launching repeated drone and missile attacks on ships in the Red Sea, Bab al-Mandeb Strait, and the Gulf of Aden since November 2023."}, {"id": "b81e668b-2c89-40c1-853d-230da097c3be", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 12:15", "url": "https://www.aol.com/israeli-strikes-kill-five-hospital-095920432.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Nidal al-MughrabiCAIRO (Reuters) -An Israeli airstrike hit two schools in Gaza City on Sunday, killing at least 25 people, the Palestinian official news agency said, while the Israeli military said it struck a Hamas military compound embedded in the schools.\nAn Israeli air strike hit a tent camp inside a hospital in central Gaza earlier in the day.\nThe Israeli military said it struck militants inside a Hamas command embedded within the schools, accusing Hamas of operating from within civilian property.\nEarlier in the day, an Israeli strike inside the Al-Aqsa Hospital compound started a fire, and wounded at least 18 people as well as killing five, medical authorities said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, Gaza health officials say."}, {"id": "db83464c-b40f-49da-8c9b-3eea4c8e2aa8", "title": "Known Details about Haniyeh Assassination : A Bomb was smuggled and planted a few Months ago in the Apartment", "date": "2024-08-04 02:30", "url": "https://sarajevotimes.com/known-details-about-haniyehs-assassination-a-bomb-was-smuggled-and-planted-a-few-months-ago-in-the-apartment/", "domain": "sarajevotimes.com", "domain_classification": "Unknown", "message": "The bomb was hidden in the apartment about two months ago, some sources claimed.\nIranian officials and Hamas stated on Wednesday that Israel was responsible for the assassination, a view shared by several U.S. officials who wished to remain anonymous.\nTwo Iranian officials who described the nature of the assassination said they did not know how or when the explosive was placed in the room.\nIsrael decided to carry out the assassination outside Qatar, where Haniyeh and other senior members of Hamas’s political leadership reside.\nThe deadly explosion early Wednesday shattered windows and brought down part of the wall of the complex, according to photos and statements by Iranian officials."}, {"id": "f2f16b1b-72e5-4950-aaa1-3061fa3ae783", "title": "As Israel braces for imminent Iranian attack , US seeks to revive multinational coalition in Middle East", "date": "2024-08-04 11:15", "url": "https://www.firstpost.com/world/iran-israel-attack-hamas-chief-ismail-haniyeh-assassination-us-military-middle-east-crisis-13800699.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Iran could attack Israel as early as Monday: ReportThe United States and Israel expect that Iran could attack Israel as early as Monday, according to Axios.\nThe report said that the US assessment is that Iran could use the April playbook to attack Israel.\nIsrael believes that a strong Iranian attack would mean that Israel’s response and international support would also be strong, said the report.\nAmid the threat of an imminent Iranian attack, the United States is seeking to revive the coalition that emerged in April.\nWhen Iran attacked Israel in April, the US, British, French, Jordanian, and Saudi militaries joined hands to help Israel defend itself against the Iranian attack."}, {"id": "c102b078-4ead-46ca-95e4-324c250f575d", "title": "Hezbollah launches 50 rockets at Israel", "date": "2024-08-04 13:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/hezbollah-launches-rockets-into-israel/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Hezbollah launched dozens of rockets from Lebanon, as fears of full-scale war with Israel continue to mount.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfarkela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nSome 50 rockets were reportedly fired from southern Lebanon towards upper Galilee, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, the political leader of Hamas, a day after an Israeli strike in Beirut killed Fuad Shukr, a senior Hezbollah commander.\nRecent video footage revealed Israel’s Iron Dome defence system being activated."}, {"id": "3be7a0e7-f3fd-4b46-8a59-ce28a7f0ec8e", "title": "US President Biden appeals for Iran to stand down on Gaza conflict threat", "date": "2024-08-04 04:30", "url": "https://www.firstpost.com/world/us-president-biden-appeals-for-iran-to-stand-down-on-gaza-conflict-threat-13800617.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AdvertisementIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, ”I hope so.\nViolence in Gaza and West BankViolence continued on Saturday in the Palestinian territories.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "cf4c63bd-8cbf-4f44-a9e3-f6d67413c4cf", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 11:30", "url": "https://www.marketscreener.com/quote/index/FTSE-EGYPT-INDEX-121232409/news/Israeli-strikes-kill-five-at-hospital-Gaza-officials-say-after-abortive-talks-47551556/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who \"conducted terror activities\" and that secondary explosions were identified, indicating the presence of weaponry in the area.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh's death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "f6d39b5e-6393-4a31-82eb-5406d62014e2", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 11:45", "url": "https://www.swissinfo.ch/eng/israeli-strikes-kill-five-at-hospital,-gaza-officials-say,-after-abortive-talks/85985002", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli strikes kill five at hospital, Gaza officials say, after abortive talksreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) – An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "9107d315-d1ac-46e2-9acf-8998fadf431b", "title": "15 Killed In Israeli Airstrike On Gaza School Being Used As Shelter", "date": "2024-08-04 08:45", "url": "https://www.ndtv.com/world-news/15-killed-in-israeli-airstrike-on-gaza-school-being-used-as-shelter-6259495", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In the Gaza Strip, at least 15 people were killed in the Israeli strike on a school.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said."}, {"id": "b0ceb130-97d2-4d66-9944-057e6daaab82", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 05:45", "url": "https://www.channelnewsasia.com/world/israel-hamas-war-fear-conflict-spread-middle-east-retaliation-4525466", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon: Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel."}, {"id": "98f60ea6-19c1-4578-a60b-f9bcef5cdff6", "title": "Fears of Middle East War Grow After Hamas Leader Killed in Iran", "date": "2024-08-04 13:00", "url": "https://dailystar.com.lb/fears-middle-east-war-grow-hamas-leader-killed/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "### Tensions in the Middle East Escalate Following AssassinationsTensions in the Middle East have reached a boiling point as Iran and its allies prepare to respond to the assassination of Hamas’ political leader, an act attributed to Israel, sparking fears of a regional war.\nIsrael, accused by Hamas, Iran, and others of the assassination, has not commented on the matter.\nIran stated on Saturday that it expects Hezbollah to strike deeper into Israel, not limiting its targets to military ones.\nFollowing Israel’s strike that killed Hezbollah military chief Fouad Shukur, both Britain and the United States have urged their citizens to leave Lebanon immediately.\nIsrael has vowed to destroy Hamas in response to the group’s October 7 attack, which initiated the current Gaza conflict."}, {"id": "28f7da43-ba2f-4a4a-a7aa-4fa1f545b779", "title": "Hezbollah Strikes Israel , Countries Ask Citizens To Leave As Iran Vows  Revenge  - 10 Points", "date": "2024-08-04 10:15", "url": "https://www.timesnownews.com/world/middle-east/hezbollah-strikes-israel-countries-ask-citizens-to-leave-as-iran-vows-revenge-10-points-article-112261168", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "The US, a key ally of Israel, has deployed warships and fighter jets to the region amid the tensions.\nMiddle East Tensions: Top 10 Developments1.\nOn Saturday, Israel exchanged fire with Hezbollah, conducted a raid in the occupied West Bank, and targeted a school compound in Gaza City.\nSeveral countries have urged their citizens in Lebanon to leave immediately.\nMeanwhile, US President Joe Biden urged Israeli Prime Minister Benjamin Netanyahu to negotiate a ceasefire with Hamas."}, {"id": "0d55828d-31db-497c-aea3-ff5338b24d0e", "title": "Israel And Allies Mobilise Under  Abraham Alliance  As Fears Of Iranian Retaliation Grow", "date": "2024-08-04 06:00", "url": "https://www.news18.com/world/israel-prepares-for-potential-iranian-strike-coordinates-with-allies-us-and-uk-8989524.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "However, he stressed that the unprecedented scale of US support for Israel since October 7 should leave Iran, Hezbollah, and other groups with no doubt about US resolve.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel."}, {"id": "58965ff6-86aa-490d-9b4e-26ecbd70b074", "title": "Haniyeh assassination gambit", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485294/haniyeh-assassination-gambit", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Hamas and Iranian officials blamed Israel, but the government of Prime Minister Benjamin Netanyahu did not comment on the assassination.\nThe US has claimed that it was “not involved in, or aware of” the assassination of Ismail Haniyeh, who it had designated as a global terrorist.\nBy killing Haniyeh, Israel has all but killed the hopes for a negotiated end to its brutal military campaign in the Gaza Strip.\nBy targeting Haniyeh in Tehran, Israel sought to humiliate the Islamic Republic and convey a message to the “Axis” leaders that they are not safe even in their safest sanctuary.\nHaniyeh’s assassination in a high security zone in the heart of capital Tehran has already exposed chinks in Iran’s armoury."}, {"id": "651845aa-e143-4d41-99e9-71e5804e6ec9", "title": "Fears of wider war spike after strikes on Gaza kill 18 and stabbing in Israel kills 2", "date": "2024-08-04 13:45", "url": "https://www.thehindu.com/news/international/fears-of-wider-war-spike-after-strikes-on-gaza-kill-18-and-stabbing-in-israel-kills-2/article68484859.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state."}, {"id": "525b52d0-9405-4afa-8d41-b9f7b33b7793", "title": "US urges citizens to leave Lebanon on  any available ticket  - International", "date": "2024-08-04 07:00", "url": "https://www.dailymirror.lk/international/US-urges-citizens-to-leave-Lebanon-on-any-available-ticket/107-288716", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "BBC - The US embassy in Beirut has urged its citizens to leave Lebanon on “any ticket available”, amid soaring tensions in the Middle East.\nJordan's Foreign Ministry has also issued advice to its citizens, telling those in Lebanon to leave immediately and warning others not to travel there.\nIt said that several airlines have suspended and cancelled flights, and many have sold out, but “commercial transportation options to leave Lebanon remain available\".\nThe UK said it was sending extra military personnel, consular staff and border force officials to help with any evacuations - but urged UK citizens to leave Lebanon “while commercial flights are running\".\nMany fear Iran’s retaliation on this occasion could take a similar form."}, {"id": "f47c1bf0-b7c2-4467-ad1a-59fe1ff96e46", "title": "What Does An All - out War Between Israel And Hezbollah Mean For Middle East ? What Are The Risks ? ", "date": "2024-08-04 07:00", "url": "https://www.news18.com/explainers/what-does-an-all-out-war-between-israel-and-hezbollah-mean-for-middle-east-what-are-the-risks-8989605.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "On Saturday, Hezbollah said it launched dozens of rockets on Moshav Beit Hillel in Israel injuring civilians there, The Times of Israel reported.\nMore than 400 people have been killed in Lebanon and 30 have been killed in Israel, as per a report by The Conversation.\nResident of Haifa in the north of Israel fear Hezbollah attacks, while people living in south Lebanon fear IDF attacks.\nAlso, Israel is the only country in the Middle East with nuclear power, which it does not acknowledge.\nIran could launch missile or armed drone strikes against Israeli military sites or infrastructure."}, {"id": "5aac7130-5f13-49ec-8b74-37bc3b7fe7c8", "title": "Israeli strike on Gaza school sheltering refugees kills 15", "date": "2024-08-04 02:00", "url": "https://www.odt.co.nz/news/world/israeli-strike-gaza-school-sheltering-refugees-kills-15", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "A Palestinian woman inspects the site of a former school, which was destroyed in an Israeli air strike.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "7a4f7f0c-f1da-4281-ac3d-f2ff902d25c4", "title": "Two dead in Israel stabbing , assailant killed : medics", "date": "2024-08-04 13:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/two-dead-in-israel-stabbing-assailant-killed-medics/articleshow/112264364.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "HOLAN: Two people were killed Sunday and two others wounded in a stabbing attack near Tel Aviv , Israeli medics said, with police reporting a Palestinian suspect was \"neutralised\" and later died in hospital.The Magen David Adom emergency service said in a statement that the \"terrorist attack\" took place in several locations in Holon, a southern suburb of Israel's commercial hub of Tel Aviv.It comes at a moment of heightened tension in Israel and the wider Middle East, nearly 10 months into the Israel-Hamas war in the Gaza Strip.The stabbing suspect, from the Israeli-occupied West Bank, was \"neutralised\" by a police officer who arrived at the scene, the force said in a statement without elaborating.The Shamir Medical Centre said the assailant was pronounced dead shortly after being taken to the hospital near Holon in a critical condition.A 66-year-old woman and a man aged around 80 were badly wounded and died from their injuries shortly after the attack, the Wolfson hospital in the city said.Israeli news website Ynet said the pair, whose ages Magen David Adom earlier gave as 70, were married.Two other men were wounded, the emergency service said.A 68-year-old was in serious condition and a 26-year-old was moderately wounded.\n\"This was a complex and difficult terrorist attack, with the victims located in three different places, around 500 metres (yards) from each other,\" Magen David Adom said.Regional tensions have soared as Iran and Middle East armed groups it backs threatened retaliation for the assassination of Hamas political chief Ismail Haniyeh in Tehran on Wednesday, which they blame on Israel, and an Israeli strike in Beirut hours earlier that killed top Hezbollah commander Fuad Shukr.Israel's National Security Minister Itamar Ben-Gvir visited the scene of Sunday's attack, where he told journalists: \"Our war is not only against Iran, but also here in the streets\".\n\"This is why we have armed the Israeli population with more than 150,000 gun permits,\" said the far-right politician who has loosened gun laws and repeatedly called on ordinary Israelis to carry arms."}, {"id": "18f06247-38f3-43ac-a7fd-87230eb125bb", "title": "Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced , Hamas says", "date": "2024-08-04 01:45", "url": "https://www.moneycontrol.com/news/world/israeli-strike-kills-at-least-10-palestinians-in-gaza-school-sheltering-displaced-hamas-says-12786293.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced, Hamas says"}, {"id": "43946ae9-919c-464d-99f7-23d1ccf7378b", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine fighters in West Bank", "date": "2024-08-04 06:45", "url": "https://dunyanews.tv/en/World/828535-israeli-strikes-kill-15-palestinians-in-gaza-school-nine-fighters-in-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankWorld World Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankThe school is sheltering displaced people in Gaza City's Sheikh Radwan neighbourhood, the Hamas saidFollow on Published On: Sun, 04 Aug 2024 09:36:31 PKTCAIRO/RAMALLAH (Reuters) – An Israeli airstrike on a school sheltering displaced people in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine fighters, including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide fighters and manufacture weapons.\nEarlier on Saturday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nThe Israeli military said its forces had struck and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "2b4fd59d-b796-4a7e-bc0a-d05c1fdbe4b5", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wbal.com/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "8b71b4b0-52be-44e5-9661-36415aa79df7", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 06:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219045/Israeli-strikes-kill-15-Palestinians-in-Gaza-school,-nine-West-Bank-militants", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Palestinians inspect the site of Israeli strikes on a school sheltering displaced people, amid Israel-Hamas conflict, in Gaza City, August 3, 2024.\n(Reuters)An Israeli airstrike on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine militants including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "93a02343-124f-4430-88da-1ac16f961f87", "title": "10 Palestinians killed in Israeli airstrike on school in Gaza", "date": "2024-08-04 05:45", "url": "https://www.thestatesman.com/world/10-palestinians-killed-in-israeli-airstrike-on-school-in-gaza-1503327944.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "At least 10 Palestinians were killed and dozens of others wounded in an Israeli airstrike on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school housing displaced people in Sheikh Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and injured dozens of others, and the number of victims is expected to increase, Palestinian medical sources said.\nAdvertisementThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a “hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,” the statement added."}, {"id": "4c24d1a2-9ca9-411a-8b13-f28f5f0c1225", "title": "10 Palestinians Killed In Israeli Airstrike On School In Gaza", "date": "2024-08-04 00:00", "url": "https://menafn.com/1108513929/10-Palestinians-Killed-In-Israeli-Airstrike-On-School-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Gaza, Aug 4 (IANS) At least 10 Palestinians were killed and dozens of others wounded in an Israeli on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school displaced people in Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and dozens of others, and the number of is expected to increase, Palestinian medical sources said.\nThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a \"hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,\" the statement added."}, {"id": "c8b8792a-218f-4dde-8bb7-12226a2106ad", "title": "Middle East on edge : Countries advise citizens to leave Lebanon as tensions escalate", "date": "2024-08-04 13:15", "url": "https://www.theweek.in/news/world/2024/08/04/middle-east-on-edge-countries-advise-citizens-to-leave-lebanon-as-tensions-escalate.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "As the fear of a wider conflict looms in the Middle East, several countries have urged their nationals to leave Lebanon.\nThe United States has issued a warning urging its citizens to leave the country on \"any ticket available.\"\n\"In view of the recent escalations in the region, Indian nationals are advised to avoid all non-essential travel to Lebanon.\nThe French foreign ministry recommended citizens residing in Iran temporarily leave the country given the risk of its airspace being closed.\nIn a phone call with Habib, Abdelatty affirmed Egypt’s support to Lebanon in confronting the threats surrounding it, the Egyptian foreign ministry said in a statement."}, {"id": "4107ffcc-5db1-42d3-90c5-a8fd4768f8d7", "title": "Israeli strikes kill five in tent at hospital , Gaza officials say , as ceasefire talks end without progress", "date": "2024-08-04 14:00", "url": "https://www.theglobeandmail.com/world/article-israeli-strikes-kill-five-in-tent-at-hospital-gaza-officials-say-as/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh’s death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "924102d2-a382-41e7-ba75-f199845607bf", "title": "Hezbollah rockets pour into Israel North - The Jerusalem Post", "date": "2024-08-04 03:00", "url": "https://www.jpost.com/breaking-news/article-813144", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Some cities and towns where the sirens were heard included Kiryat Shmona, Metualla, Beit Hillel, HaGoshrim, and Kfar Yuval.\nSocial media footage showed a barrage of rockets crossing into the Upper Galilee from Lebanon in the early hours of Sunday as dozens of rockets were launched at the area.\nIron dome anti-missile system fires interception missiles as rockets fired from Lebanon, as it seen over Kiryat Shmona, March 5, 2024.\nHeightened tensions in the Middle EastThe barrage comes as tension remains high between Israel and Lebanon's Hezbollah after Israel killed Hezbollah's military commander, Fuad Shukr, last week.\nIsrael's strike on Shukr came following a Hezbollah rocket launch last Saturday, which resulted in the deaths of 12 children from the Druze town of Majdal Shams."}, {"id": "82766fb7-8802-47a3-a2bc-ae4271a0ef21", "title": "15 Displaced Civilians Killed In Israeli Strike On Gaza School", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514432/15-Displaced-Civilians-Killed-In-Israeli-Strike-On-Gaza-School", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) An Israeli on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians yesterday, hours after two strikes in the occupied West killed nine, Palestinian resistance movement Hamas said.\nThe Israeli military said the first of two West Bank hit a vehicle in a town near the city of Tulkarm.\nIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nEarlier yesterday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "b1505133-a307-402b-ae58-2081c09e1fa5", "title": "32 Killed As al - Shabab Attacks Somali Beach", "date": "2024-08-04 06:00", "url": "https://leadership.ng/32-killed-as-al-shabab-attacks-somali-beach/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "At least 32 people have been killed and many more wounded in a suicide bombing and gun attack on a popular beach in Somalia’s capital, Mogadishu, according to officials.\nAl-Shabab, an al-Qaeda-linked armed group, claimed responsibility for the attack on Lido Beach late on Friday via an affiliated radio station.\nThe assault began when a suicide bomber blew himself up at the entrance of Beach View Hotel.\nA witness told The Associated Press news agency in a phone call that he saw an attacker wearing an explosive vest moments before the man “blew himself up next to the Beach View Hotel”.\nMohamud Moalim also said some of his friends who were with him at the hotel were killed, and others were wounded."}, {"id": "c60e43ce-afe2-463b-a68c-9a84d141dd91", "title": "Gaza terror groups launch rockets on southern , central Israel", "date": "2024-08-04 13:00", "url": "https://www.jpost.com/breaking-news/article-813191", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF confirmed on Sunday afternoon that, following sirens that sounded in central Israel, approximately five launches were identified crossing from the southern Gaza Strip.\nEarlier, rocket sirens had sounded in the central Israel localities of Bitzaron, Gan Yavne, Hatzor, Azrikam, Sde Uziyahu, and Shtulim.\nRockets have been fired off from Gaza less frequency as the IDF has destroyed much of Hamas's terrorist infrastructure and weaponry.\nIt has become especially rare for rockets from the Gaza Strip to be launched at central Israel.\nAn aerial view shows damage caused by a rocket after if was fired from the Gaza Strip towards Israel, in Ashdod, southern Israel October 9, 2023."}, {"id": "f0cb41d7-756d-4103-aea6-85f89de122c1", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:30", "url": "https://www.voanews.com/a/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-/7729252.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Lebanon's Iran-backed Hezbollah movement, which has traded near-daily fire with Israeli forces since the Gaza war broke out in October, announced its fighters had fired a barrage of rockets at Israel's north overnight.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours."}, {"id": "fcbe0ded-615c-4c5c-9b8d-07160d9bbc00", "title": "Middle East conflict : Iran - backed Hezbollah fires  dozen of rockets at Israel", "date": "2024-08-04 02:30", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/israel-iran-hamas-hezbollah-war-latest/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Israel’s military has uncovered an unusually large Hamas tunnel close to the Gaza-Egypt border that is big enough for a truck to drive through.\nThe IDF said the three-metre-high tunnel along the so-called Philadelphia Corridor was being investigated and would later be destroyed along with other “large-scale routes” that were found.\nFootage showed the huge concrete-fortified underpass less than 100 metres from the border fence, with a combat vehicle easily passing through its high walls.\nSince the beginning of Israel’s ground offensive, its forces have been working to locate and blow up Hamas’s vast tunnel network that spreads for miles beneath the Gaza Strip, where scores of terrorists are still believed to be hiding.\nFollow below for the latest updates"}, {"id": "86d0dd59-6e7f-4751-b5ed-dc807b608540", "title": "Palestinian kills two , wounds two in stabbing attack in Israel", "date": "2024-08-04 11:30", "url": "https://dunyanews.tv/en/World/828558-palestinian-kills-two-wounds-two-in-stabbing-attack-in-israel", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Palestinian kills two, wounds two in stabbing attack in IsraelWorld World Palestinian kills two, wounds two in stabbing attack in IsraelThe stabbings took place during morning rush hour in the city of Holon, just outside Tel AvivFollow on Updated On: Sun, 04 Aug 2024 15:11:47 PKTHOLON, Israel (Reuters) – A Palestinian attacker killed two people and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe stabbings took place during morning rush hour in the city of Holon, near Tel Aviv.\nTwo senior citizens, a man and woman, were killed and two other people were wounded and rushed to hospital, medical officials said.\nThe Islamist group Hamas, which is at war with Israel in Gaza, said in a statement that the stabbing attack was a \"natural response\" to Israeli attacks on Palestinians and to the assassination of the group's leader, Ismail Haniyeh, last week in Tehran.\nHowever, it stopped short of claiming responsibility for Sunday's attack."}, {"id": "91898c84-ed0d-401c-9d1a-494053b19e9e", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.al-monitor.com/originals/2024/08/foreign-nationals-told-leave-lebanon-war-fears-surge", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours."}, {"id": "bd36a273-1942-42f5-9d2d-bce19c7689af", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 02:30", "url": "https://www.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345114.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "ad2f0988-4582-4c24-8d40-d27ec1f488d0", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 07:15", "url": "https://finance.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345143.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "f96d7ea9-9eb3-403b-b5d9-79283dcb8c02", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship", "date": "2024-08-04 04:30", "url": "https://abcnews.go.com/International/wireStory/suspected-missile-attack-yemens-houthi-rebels-hits-container-112548896", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, the first assault by the group since Israeli airstrikes targeted themDUBAI, United Arab Emirates -- A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "10aef7ab-b0d4-4e0f-9f81-04bbe81c191f", "title": "Suspected missile attack by Yemen Houthi strikes container ship ; first assault in 2 weeks – Firstpost", "date": "2024-08-04 02:30", "url": "https://www.firstpost.com/world/suspected-missile-attack-by-yemens-houthi-strikes-container-ship-first-assault-in-two-weeks-13800620.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileA suspected missile attack by Yemen’s Houthi rebels struck a container ship travelling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometres (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nMeanwhile Saturday, the US military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "46a64a5e-3f48-4057-bad5-f3ca48efcb21", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in two weeks", "date": "2024-08-04 05:45", "url": "https://www.newindianexpress.com/world/2024/Aug/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-two-weeks", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "However, it can take the rebels hours or even days before they acknowledge an assault.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nThe Houthis also have launched drones and missiles toward Israel, including an attack July 19 that killed one person and wounded 10 others in Tel Aviv.\nIn the time since, there has not been a reported attack on shipping through the Red Sea corridor, which links Asia and the Middle East onto Europe through the Suez Canal."}, {"id": "bc1c750f-f0e7-4851-bfbf-5717ef72c0ec", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.clickondetroit.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "DUBAI – A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "236b64b5-8da8-43ce-a8a0-ab4da1a8f2a1", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:30", "url": "https://www.local10.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "local10.com", "domain_classification": "Unknown", "message": "DUBAI – A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "78de84ca-c115-49ad-a42c-44db3fd57f9e", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6417", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "51c0d052-7e42-4db0-8efc-e2be2f1c9db7", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "960acd5a-b76d-4d64-9cb5-165e92e5c30a", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.newcastleherald.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "161dcf3c-ab8b-4d8a-8be6-d4cc06131bb4", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 02:00", "url": "https://www.batemansbaypost.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "cce03659-9178-432a-a9ea-134f5b1cf6b1", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "http://lasvegassun.com/news/2024/aug/03/suspected-missile-attack-by-yemens-houthi-rebels-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Suspected missile attack by Yemen’s Houthi rebels hits container ship in first attack in 2 weeksDUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "031bcc50-1bbc-4f81-91cc-a59347cf9c68", "title": "Foreign citizens urged to leave Lebanon  as soon as possible  as regional tensions spike", "date": "2024-08-04 12:15", "url": "https://www.aol.com/foreign-citizens-urged-leave-lebanon-105338605.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The US, UK and France are among several countries urging their citizens to leave Lebanon as heightened tensions in the region spark fears of a widening Middle East conflict.\nHaniyeh’s death came just hours after an Israeli strike on the Lebanese capital Beirut killed Hezbollah’s most senior military commander, Fu’ad Shukr.\nMany countries already had travel warnings in place but have issued fresh advice in the wake of the latest developments.\n- AFP/Getty ImagesFrance told its citizens to make arrangements to leave Lebanon “as soon as possible” in a statement from the Ministry for Europe and Foreign affairs on Sunday.\nWhite House deputy national security adviser Jon Finer said Sunday that the US and Israel are preparing for “every possibility” after the Pentagon sent the additional military assets."}, {"id": "5bc03ef3-6461-42ea-9380-cb556ad5e794", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.wsls.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "DUBAI – A missile attack by Yemen's Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "92d97b04-4e5a-4066-94e8-49985cbb304d", "title": "Fears of Middle East war grow", "date": "2024-08-04 07:00", "url": "https://www.omanobserver.om/article/1157160/world/region/fears-of-middle-east-war-grow", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "Beirut - Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel."}, {"id": "dad5d828-b3bb-42fb-abf4-9deb9c87e8cb", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:15", "url": "https://gulfnews.com/world/mena/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-1.103729203", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Lebanon’s Iran-backed Hezbollah movement, which has traded near-daily fire with Israeli forces since the Gaza war broke out in October, announced its fighters had fired a barrage of rockets at Israel’s north overnight.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours."}, {"id": "863c7b88-63b1-4fee-9b40-0b7f7837455a", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 04:30", "url": "https://thesun.my/world/biden-voices-hope-iran-will-stand-down-but-is-uncertain-GK12813720", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WILMINGTON: U.S. President Joe Biden expressed hope Iran would stand down despite its threat to avenge the assassination of Hamas’ leader in Tehran, as fears mounted that Israel’s war against Palestinian militants in Gaza could escalate into a wider Middle East conflict.\nIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, “I hope so.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "89a8aca3-db00-484b-a5ed-2dee4da98603", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 04:30", "url": "https://www.moneycontrol.com/news/world/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks-12786316.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Suspected missile attack by Yemen's Houthi rebels hits container ship in first attack in 2 weeks"}, {"id": "b0e858cf-8549-449e-93f4-03e6a96e1a5d", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 09:45", "url": "https://www.npr.org/2024/08/04/g-s1-15285/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2", "domain": "npr.org", "domain_classification": "International", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "e6bc3259-33e8-4d85-9e69-d703fed267ea", "title": "15 killed in Israeli strikes on Gaza school , 9 dead in West Bank", "date": "2024-08-04 11:45", "url": "https://www.dailysabah.com/world/mid-east/15-killed-in-israeli-strikes-on-gaza-school-9-dead-in-west-bank", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "At least 15 Palestinians were killed in an Israeli strike on a school sheltering displaced people in Gaza City late Saturday.\nThe attack came just hours after two strikes in the occupied West Bank killed nine people, including a local Hamas leader, Hamas said.\n(AFP Photo)Gaza strikesIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighborhood, the local media office said.\nThe Israeli military wrongly alleged the school was being used as a command center for Hamas, to hide members and manufacture weapons.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said."}, {"id": "be06419e-26e1-4c9d-a9ec-84ff94570eab", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:30", "url": "https://www.yahoo.com/news/foreign-nationals-told-leave-lebanon-115004076.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo."}, {"id": "b282bffb-b7fb-4893-98a7-9429faaa5c79", "title": "  Highly Volatile  Situation : Foreign Nationals Urged To Leave Lebanon", "date": "2024-08-04 13:00", "url": "https://www.ndtv.com/world-news/highly-volatile-situation-foreign-nationals-urged-to-leave-lebanon-6261722", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "(Representational)Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo."}, {"id": "a334bca2-5972-42ad-9bb8-196f9ee69fcf", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks – Winnipeg Free Press", "date": "2024-08-04 03:00", "url": "https://www.winnipegfreepress.com/business/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "63cb5ef8-6552-4bf1-8e0f-998a96b966b3", "title": "Fears Of Middle East War Grow After Haniyeh Killing", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514431/Fears-Of-Middle-East-War-Grow-After-Haniyehs-Killing", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Middle East tensions soared yesterday as Iran and its allies readied their response to the assassination of Hamas's leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian group Hamas.\nIran said it expects Hezbollah to hit deeper inside Israel and to no longer be confined to military targets.\nWith such talk growing, the Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nThe New York Times, citing unnamed sources, reported that the explosion which killed Haniyeh was a bomb that was covertly smuggled into the guesthouse where he was staying in Tehran two months ago."}, {"id": "34441191-30cf-4900-a982-81b2373ddd37", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.al-monitor.com/originals/2024/08/foreign-nationals-told-leave-lebanon-war-fears-surge-0", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo."}, {"id": "16ff38e0-ac58-437a-80c9-44fa43253633", "title": "Blinken Says U . S . not responsible for Haniyeh killing ; That Too Bad", "date": "2024-08-04 09:00", "url": "https://www.israelnationalnews.com/news/394057", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken denied any American responsibility for the assassination of Hamas political chief Ismail Haniyeh.\nDon't Fear Assassinating TerroristsNor should assassinating terror leaders be something from which the United States shies away.\nIf any explanation is due, it should be whether or not the United States had the intelligence that Israelis did.\nBlinken's statement that the United States was not responsible for Haniyeh's death was truly cringe-worthy, an expression of weakness that further diminishes the United States in the eyes of its enemies.\nThe only unfortunate aspect of Haniyeh's demise was that Israel beat the United States to it."}, {"id": "db4f4c0e-8cb4-4c8e-8218-aa3953fe681c", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 06:00", "url": "https://www.whec.com/business/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nThe rebels separately claimed to have shot down another U.S. military spy drone, without offering evidence.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "2781d16d-b600-487d-8a8a-ac3c37c79878", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 10:15", "url": "https://www.lbc.co.uk/world-news/a24337bd08cc432281f1c74dbb3883b4/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "99bbbd56-58fe-4473-a347-01956583458e", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.gjsentinel.com/news/national/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge/article_42bd42ef-df64-5561-8c3f-af4974c09561.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "The aftermath of an overnight strike that hit tents used as temporary shelters by displaced Palestinians in central Gaza"}, {"id": "a46b2f31-84d5-4dbf-97dd-7b9a20020e7c", "title": "Iran may attack Israel  as early as tomorrow ; top US general in Middle East as fear of war intensifies", "date": "2024-08-04 09:45", "url": "https://www.moneycontrol.com/news/world/iran-may-attack-israel-as-early-as-tomorrow-top-us-general-in-middle-east-as-fear-of-war-intensifies-12786463.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Iran may attack Israel 'as early as tomorrow'; top US general in Middle East as fear of war intensifies"}, {"id": "2d84f8aa-4c46-4c79-bf45-321ed186b6e7", "title": "Hezbollah Launches Barrage Of Rockets At Israel , Sparks Fears Of War In The Region", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108513957/Hezbollah-Launches-Barrage-Of-Rockets-At-Israel-Sparks-Fears-Of-War-In-The-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian group Hamas in Gaza.\nIran said on Saturday that it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "4e63286f-61f1-4a98-8642-b3cc5b5400ed", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 13:30", "url": "https://www.edp24.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "bd636bc5-b04a-4fde-86a2-c8274883d96b", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 14:00", "url": "https://www.theargus.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "2804be7e-b1c8-4854-8876-13c95b37c1d1", "title": "France calls on citizens in Lebanon to leave  as soon as possible  ", "date": "2024-08-04 08:30", "url": "https://timesofindia.indiatimes.com/world/europe/france-calls-on-citizens-in-lebanon-to-leave-as-soon-as-possible/articleshow/112261774.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "France on Sunday called on its citizens in Lebanon to leave the country \"as soon as possible\" amid fears of all-out war between Israel and Hezbollah and a broader regional conflict.\n\"In a highly volatile security context, we once again call the attention of French nationals, particularly those passing through, to the fact that direct commercial flights and ones with stopovers to France are still available, and we invite them to make their arrangements now to leave Lebanon as soon as possible,\" the foreign ministry said in its travel advice notice for Lebanon.With its call, Paris is following the example of Washington and London, which had recommended their own nationals to leave from Saturday.France estimates that some 23,000 of its citizens live in Lebanon, and last month around 10,000 French citizens were visiting to the country.Sweden also announced the closure of its embassy in Beirut and called on its nationals to leave.On Thursday, the French foreign ministry had updated an information sheet by highlighting the continued availability of commercial flights to France while stopping short of calling on nationals to leave Lebanon.On Sunday, the ministry stressed French nationals were being \"urgently asked\" not to travel to Lebanon as fears of a regional conflagration after Iran and its allies threatened to respond to the assassination ofHamas 's political leader, blamed on Israel.Tehran, along with Hamas and Lebanese-based, Iranian-backed ally Hezbollah, accused Israel of Wednesday killing Ismail Haniyeh .Haniyeh was killed a day after a strike claimed by Israel killed Hezbollah military chief Fouad Chokr near Beirut.Hezbollah said Saturday it had launched dozens of Katyusha rockets at Israel, saying the attack was in response to Israeli attacks on Lebanon.Israeli Prime Minister Benjamin Netanyahu says his country is at \"a very high level\" of preparedness for any scenario -- \"defensive and offensive.\""}, {"id": "420db385-be6f-4cc9-bb37-dcc420e9e5a6", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 11:30", "url": "https://www.salisburyjournal.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "43c8d58b-e233-41ae-bfba-4d4b5e9d3ddc", "title": "Israeli air strikes kill 12 in Gaza after stabbing attack in Tel Aviv", "date": "2024-08-04 10:30", "url": "https://www.irishtimes.com/world/middle-east/2024/08/04/israel-hamas-war-gaza-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "Israeli airstrikes struck a tent camp in Gaza and left 18 Palestinians killed and dozens wounded, according to the Palestinian Ministry of Health.\nIsraeli air strikes have killed 18 people in Gaza, including four who were sheltering at a camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nA woman (70s) and a man (80s) were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7th attack in Israel.\nIsraeli police inspect the scene of the knife attack in Tel Aviv."}, {"id": "a91c0da8-992b-4f9c-852c-0c7965beaddc", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 12:15", "url": "https://knpr.org/npr/2024-08-04/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIsrael's military, which regularly accuses Palestinian militants of sheltering in civilian areas, said it struck a Hamas command center.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October."}, {"id": "bcc5b783-a77f-4c77-8458-4a17631518d0", "title": "Fresh Attack Hit Merchant Vessel Off Yemen", "date": "2024-08-04 01:45", "url": "https://menafn.com/1108513950/Fresh-Attack-Hit-Merchant-Vessel-Off-Yemen", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SANAA, Aug 4 (NNN-SABA) – A merchant vessel in the Gulf of Aden, off Yemen, was struck by a second attack yesterday, just hours after an earlier attack on the same ship, according to Britain's Maritime Trade Operations (UKMTO).\nThe vessel was sailing 125 nautical miles east of Aden, when the incident occurred, the UKMTO said on social media.\nThe company's security officer reported that, the vessel was hit by a missile.\nHe stated, there was no fire, water ingress, or oil leak, adding that, the vessel is proceeding to its next of call, and authorities are investigating.\nEarlier, the UKMTO reported another attack on the same vessel, quoting the ship's master as saying, an explosion occurred in proximity, causing no damage.– NNN-SABA"}, {"id": "8308e6ea-88f9-45a6-a1b1-8618e6874427", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 11:45", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn19-israel-hamas-ld-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state."}, {"id": "f87dc125-d25c-4aa7-b524-8cd99787938f", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 13:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "f10fa004-45a4-4798-a376-58b43325eb9f", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wjol.com/syndicated-article/?id=1577376", "domain": "wjol.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "b5b77715-3cef-40e6-b6a7-ff4510055429", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.wlip.com/syndicated-article/?id=1577376", "domain": "wlip.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "b478fc29-65ac-49f4-a19a-94afc91aeffb", "title": "Israel - Lebanon conflict : Frequently asked questions and answers", "date": "2024-08-04 14:00", "url": "https://www.jpost.com/middle-east/faq/article-813196", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Like Israel, Lebanon has a rich history going back thousands of years.\nOccupying southern Lebanon allowed Israel to establish a security buffer, keeping mainland Israel safe from cross-border attacks by Palestinian terrorist groups.\nHezbollah, led currently by Hassan Nasrallah, swiftly became the dominant armed group in Lebanon and was able to help push Israel out of southern Lebanon.\nStill, Israel instead carried out a military assault, sending ground troops into southern Lebanon while striking targets from the air and sea.\nThe current conflict between Israel and Hezbollah was started just a day after Hamas attacked Israel, carrying out the October 7 Massacre."}, {"id": "0d325e1d-9e7d-43eb-a4eb-1bc3a9a87476", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 10:45", "url": "https://www.wsls.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIran and its allies have blamed Israel and threatened retaliation, raising fears of an even more destructive regional war.\nRecommended Videos“The state of Israel is in a multi-front war,” Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry."}, {"id": "b37ddc9d-474a-4991-b0d7-2935b1b224c8", "title": "Tensions Soar - Rocket Barrage from Lebanon , Israeli Airstrikes Kill Two", "date": "2024-08-04 13:15", "url": "https://www.palestinechronicle.com/tensions-soar-rocket-barrage-from-lebanon-israeli-airstrikes-kill-two/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "By Palestine Chronicle StaffTwo people were killed in an Israeli airstrike targeting the town of Deir Siryan in southern Lebanon on Saturday evening.\nEarly Sunday, a barrage of rockets was launched from southern Lebanon toward Israel, according to media reports.\nMeanwhile, overnight, Israeli airstrikes and heavy machine-gun fire targeted several locations in southern Lebanon, as reported by official Lebanese media on Sunday.\nAccording to Al-Jazeera, two people were killed in an Israeli airstrike targeting the town of Deir Siryan in southern Lebanon on Saturday evening.\nThe Anadolu news agency confirmed the significant rocket barrage from southern Lebanon toward Israel early Sunday."}, {"id": "1824bf28-4eb0-47bf-82ab-0a900ff96185", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 13:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/fears-of-middle-east-war-grow-after-hamas-leaders-killing/articleshow/112259638.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "- Take 'any ticket available' -- Disease spreading in Gaza -Several airlines have suspended flights to Beirut and Tel Aviv.\nHamas denied using civilian infrastructure for military activities.Haniyeh was buried on Friday in Qatar, where he had been based.\n\"I hope so,\" he said.\n\"I don't know.\n\"Soon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.Israel's army said early Sunday about 30 projectiles had been launched from southern Lebanon into Israel, with most of them shot down and no injuries reported.In Beirut, 20-year-old student Diana Abu Aasel told AFP she feared \"something bad will happen to my family and friends."}, {"id": "8690ede3-ba62-4856-b795-eecda911fef2", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://punchng.com/fears-of-middle-east-war-grow-after-hamas-leaders-killing/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas’s political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "2a79bb0f-20dc-46b0-a5f7-acb19941e521", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 01:30", "url": "https://www.timesofearth.com/2024/08/04/israeli-strikes-kill-15-palestinians-in-gaza-school-nine-west-bank-militants/", "domain": "timesofearth.com", "domain_classification": "Unknown", "message": "GAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt’s foreign minister, Badr Abdelatty, stressed in a phone call with Iran’s acting foreign minister, Ali Bagheri Kani, that recent developments in the region were “unprecedented, very dangerous” and threatening to stability, Egypt’s government said."}, {"id": "c6ee7673-395e-4b8a-a18c-3229b32a3950", "title": "Strikes on Gaza kill 12 , stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:45", "url": "https://www.voanews.com/a/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike/7729191.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state."}, {"id": "ec227b86-fc50-471a-b847-93eb7a3aedd8", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC New York", "date": "2024-08-04 09:45", "url": "https://www.nbcnewyork.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/5667500/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "2eacc3c2-348a-4b5b-a639-cc0b742c1132", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC4 Washington", "date": "2024-08-04 09:45", "url": "https://www.nbcwashington.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3684247/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "6ab277ed-f1d2-46ea-9769-728334d9076c", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 13:15", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn23-israel-hamas-2ndld-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state."}, {"id": "85da03d8-405f-419e-a0b0-5b3c8276a36d", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:00", "url": "https://www.edp24.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "5afcebdd-5a3c-41f4-adf3-8263d376d3bd", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC Los Angeles", "date": "2024-08-04 09:45", "url": "https://www.nbclosangeles.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3478090/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "0538f0de-e75a-4eb5-976f-b81b9fbd0f00", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 12:30", "url": "https://www.capeandislands.org/2024-08-04/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIsrael's military, which regularly accuses Palestinian militants of sheltering in civilian areas, said it struck a Hamas command center.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October."}, {"id": "220df638-95ab-464e-ad82-a80952805082", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn13-israel-hamas-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "f42de1e3-2bcb-4e23-926a-9092a9cec754", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 13:30", "url": "https://www.scmp.com/news/world/middle-east/article/3273161/foreign-nationals-told-leave-lebanon-war-fears-surge", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to “temporarily leave”, warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours.\nThe Israeli military was “determined to continue fighting until we fundamentally change the security situation in the north”, said Home Front Command chief Rafi Gilo."}, {"id": "9fc7c370-3d1e-4778-b322-d08bd2a10678", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.breakingnews.ie/world/twelve-dead-in-israeli-air-strikes-on-gaza-after-tel-aviv-stabbing-1657873.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nAdvertisementA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAdvertisementMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "1716b08b-8fdf-4d0c-95ed-ea693e35d40e", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC Bay Area", "date": "2024-08-04 13:00", "url": "https://www.nbcbayarea.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3613846/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "12a20015-75ee-4f3a-8ad4-f2014408fc33", "title": "Israeli strikes on Gaza kill 18 and a stabbing in Tel Aviv kills 2 amid efforts to prevent wider war", "date": "2024-08-04 14:00", "url": "https://www.news-gazette.com/news/nation-world/israeli-strikes-on-gaza-kill-18-and-a-stabbing-in-tel-aviv-kills-2-amid/article_86f7c489-d559-5a4c-80ba-f32f11f082ae.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "fcb2d609-686d-4e9b-9bad-375d37c56de4", "title": "Woman in 70s killed , 3 injured in a stabbing attack in Israel", "date": "2024-08-04 07:30", "url": "https://www.firstpost.com/world/woman-in-70s-killed-3-injured-in-a-stabbing-attack-in-israel-13800666.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Israel’s Magen David Adom rescue service later confirmed that the woman had died read moreIsraeli police and medics say a woman in her 70s was killed and three other people were wounded in a stabbing attack in a suburb of Tel Aviv.\nThe police said the attacker was a resident of the West Bank, suggesting that Sunday’s attack was carried out by a Palestinian militant.\nAdvertisementTensions have soared across the region since Hamas’ Oct. 7 attack ignited the war in Gaza last year.\nIsrael’s Magen David Adom rescue service later confirmed that the woman had died.\nIt said a 70-year-old man was in critical condition, a 68-year-old man was in severe condition and a 26-year-old man was in moderate condition."}, {"id": "1a02d8e8-15de-40a1-90be-82e2e71510ed", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.thetelegraphandargus.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "60e8d903-3787-4641-ac8a-26876c0ed13c", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.echo-news.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "daa5cd59-9c8f-4b7a-a6ec-cd948f8ea0c5", "title": "Ashdod to Open Bomb Shelters After Gaza Barrage | The Jewish Press - JewishPress . com | Hana Levi Julian | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/ashdod-to-open-bomb-shelters-after-gaza-barrage/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Flash 90At least five long-range rockets were fired at the area around the southern port city of Ashdod at midday Sunday, prompting a decision by the city to open its public bomb shelters.\nRed Alert sirens were triggered in nearby Gan Yavneh and the town of Bitzaron.\nAdvertisementThe rockets were launched from the southern Gaza city of Rafah, where Israeli forces have been methodically eliminating dozens of terror tunnels, endless terrorist infrastructure and terrorist operatives.\nThe rockets fired from Gaza were launched simultaneously with a rocket attack aimed at northern Israel by Lebanon’s Iranian proxy, Hezbollah.\nHowever, the civilians sheltering in Rafah moved as instructed to the humanitarian safe zone set up for them by the Israel Defense Forces."}, {"id": "b720e0b9-3ff1-4375-986a-dfc152ff851b", "title": "Seized Hamas File Confirms Al Jazeera Reporter was a Hamas Terrorist | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/seized-hamas-file-confirms-al-jazeera-reporter-was-a-hamas-terrorist/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF SpokespersonFiles seized by Israel and released by the Israel Defense Forces during the weekend confirmed that Al Jazeera reporter Ismail al-Ghoul was a member of Hamas.\nAl-Ghoul, 27, was killed in an Israeli airstrike along with Al Jazeera cameraman Ramy El-Rify on Wednesday.\n“Despite the deceitful attempts by Hamas and Al Jazeera to portray Al-Ghoul as a decent journalist, Al-Ghoul was an active Hamas terrorist,” said the IDF.\nEfforts to ban Al Jazeera gained momentum in February after reporter Mohamed Washah was exposed as a Hamas commander.\nIn October, Al Jazeera was accused of endangering Israeli soldiers by exposing details of where forces were assembling, prompting the Cabinet to approve emergency regulations to temporarily shut down Al Jazeera operations in Israel."}, {"id": "443c8f2c-4660-4833-8e8a-27422ae710b2", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 11:45", "url": "https://www.oxfordmail.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "e281dfd5-f826-4fb3-951e-3daa5e319843", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 07:00", "url": "https://abcnews.go.com/International/wireStory/woman-killed-3-wounded-stabbing-attack-israel-112550718", "domain": "abcnews.go.com", "domain_classification": "International", "message": "TEL AVIV, Israel -- Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIran and its allies have blamed Israel and threatened retaliation, raising fears of an even more destructive regional war.\n“The state of Israel is in a multi-front war,” Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nThe war in Gaza was triggered by Hamas’ Oct. 7 attack into Israel that killed some 1,200 people, mostly civilians, and took around 250 people hostage.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three for their future state."}, {"id": "83f6a614-61f0-4cf5-903f-dcbaa1c7f81f", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 06:30", "url": "https://www.ksat.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIran and its allies have blamed Israel and threatened retaliation, raising fears of an even more destructive regional war.\nRecommended Videos“The state of Israel is in a multi-front war,” Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry."}, {"id": "24c45d78-39a3-475d-94d6-c4e359c596a9", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 08:45", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "d1f3d032-1cd7-49f2-88ce-969981357008", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://timesofmalta.com/article/fears-middle-east-war-grow-hamas-leader-killing.1096297", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "0aae85eb-e3e1-45d8-9e0d-40c6b4644b0f", "title": "France calls on citizens in Lebanon to leave  as soon as possible  ", "date": "2024-08-04 11:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219063/France-calls-on-citizens-in-Lebanon-to-leave-", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Xinhua)France on Sunday called on its citizens in Lebanon to leave the country \"as soon as possible\" amid fears of all-out war between Israel and Hezbollah and a broader regional conflict.\nWith its call, Paris is following the example of Washington and London, which had recommended their own nationals to leave from Saturday.\nFrance estimates that some 23,000 of its citizens live in Lebanon, and last month around 10,000 French citizens were visiting to the country.\nSweden also announced the closure of its embassy in Beirut and called on its nationals to leave.\nOn Thursday, the French foreign ministry had updated an information sheet by highlighting the continued availability of commercial flights to France while stopping short of calling on nationals to leave Lebanon."}, {"id": "b5dcaeca-f2d9-4c2b-8bf1-cf41b3fb3877", "title": "Woman Killed , Three Injured In Terror Stabbing Attack In Holon", "date": "2024-08-04 10:30", "url": "https://www.newsx.com/world/woman-killed-three-injured-in-terror-stabbing-attack-in-holon/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "An Israeli woman was killed and three others were injured in a terror stabbing attack in Israel’s Holon on Sunday morning, The Times of Israel reported, citing police and medics.\nMagen David Adom ambulance service medics said, “This was a complex and difficult terror attack, the casualties were at three separate locations, approximately 500 meters from each other,” The Times of Israel reported.\nOn July 31, the Islamic Revolutionary Guard Corps (IRGC) said that Hamas political bureau chief Ismail Haniyeh was killed in an attack in Tehran.\nSince then, 24 Israelis, including security personnel, have been killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday’s attack, the report said.\nFurthermore, five Israeli security forces members were killed in clashes with terror operatives in the West Bank."}, {"id": "cb5a5b9f-e043-4c4e-b353-fd9fe0b14918", "title": "Iran Revolutionary Guards say Hamas leader Ismail Haniyeh was killed by US - backed Israel ; Vow revenge", "date": "2024-08-04 06:00", "url": "https://www.businessinsider.in/international/news/irans-revolutionary-guards-say-hamas-leader-ismail-haniyeh-was-killed-by-us-backed-israel-vow-revenge/articleshow/112258499.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Tehran [Iran], August 4 (ANI): Iran's Revolutionary Guards (IRGC) have said that Hamas leader Ismail Haniyeh was killed by Israel using a short-range projectile with a warhead and plans to take revenge \"at the appropriate time.\nThe Hamas leader and his bodyguard were killed in an Iranian government guest house in Tehran in the early hours of July 31.\nIsrael, which is at war with Hamas in the Gaza Strip, has neither acknowledged nor denied killing Haniyeh.\nEarlier on Wednesday, he also ordered Iran to strike Israel directly, in retaliation for the killing of Hamas leader.\nThey also discussed Iran's call for an extraordinary meeting of the Organization of Islamic Cooperation (OIC) member states over the assassination of the Hamas leader, IRNA reported."}, {"id": "16222a65-370a-4648-ab35-4fc463197c6d", "title": "Jordan foreign minister to hold talks in Iran as tensions rise", "date": "2024-08-04 13:15", "url": "https://www.moneycontrol.com/news/world/jordans-foreign-minister-to-hold-talks-in-iran-as-tensions-rise-12786572.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSassociated byco-presented byFollow us on:My AccountororHello, LoginAllJordan's foreign minister to hold talks in Iran as tensions rise"}, {"id": "03c08486-ccab-4331-a572-8d0f53a92ba3", "title": "Jordan top diplomat to make rare visit to Iran as regional tensions soar", "date": "2024-08-04 10:45", "url": "https://www.yahoo.com/news/jordans-top-diplomat-rare-visit-100728063.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - Jordan's Minister of Foreign Affairs Ayman Safadi speaks with the media as he arrives for a meeting at the European Council building in Brussels, Monday, May 27, 2024.\nAyman Safadi is the first senior Jordanian official to pay an official visit to Iran in over 20 years.\nJordan is a close Western ally and helped intercept scores of missiles and drones fired by Iran toward Israel in April.\nSafadi met acting Foreign Minister Ali Bagheri Kani on Sunday, and later will meet Iran’s new president, Pezeshkian, reported SNN.ir, a news network close to the Guard.\nThe last time a senior Jordanian official traveled to Iran on an official visit was in 2004 when then-Prime Minister Faisal al-Fayez went to Tehran."}, {"id": "214e419c-5701-4b61-b8eb-3a417d8ccc80", "title": "Jordan top diplomat to make rare visit to Iran as regional tensions soar", "date": "2024-08-04 11:30", "url": "https://economictimes.indiatimes.com/news/international/world-news/jordans-top-diplomat-to-make-rare-visit-to-iran-as-regional-tensions-soar/articleshow/112264502.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "cfdabe54-9178-478f-827a-f6f96b54bfb7", "title": "Israeli strikes on Gaza kill 18 and a stabbing in Tel Aviv kills 2 amid efforts to prevent wider war", "date": "2024-08-04 14:00", "url": "https://www.yakimaherald.com/news/nation_and_world/world/israeli-strikes-on-gaza-kill-18-and-a-stabbing-in-tel-aviv-kills-2-amid/article_ecfd3c33-aa4d-5ffe-85e1-2653b82a72ac.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "e5b196e7-3b40-4e51-9613-9582eec67fdf", "title": "Zelensky Hails Strikes on Russian Airfields , Refineries", "date": "2024-08-04 10:30", "url": "https://www.kyivpost.com/post/36861", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelensky on Saturday praised his forces for hitting military targets inside Russia, after his army reported several strikes including on an airfield and an oil depot.\n\"I would like to thank each of our soldiers and all those who work in our defence industry for striking Russian airfields, oil refineries and logistics,\" he said in his daily statement.\nOther Topics of Interest Ukraine Accuses Russian Forces of Killing, Dismembering Prisoner-of-War Ukraine’s human rights commissioner urged the ICRC and the UN to investigate an image shared online that he said likely showed a Ukrainian prisoner-of-war killed and dismembered by Russian forces.\nAnd Zelensky has been asking allies to lift restrictions to allow Ukraine to use Western weapons to strike Russian-controlled land.\nOnce again, Zelensky advocated for his army to be allowed to target places \"where the occupier is, from which Russia strikes at Ukraine, launches missiles, Shahed drones, bombs\"."}, {"id": "886781e9-545d-4cfc-8a68-283549f4a091", "title": "Jordan top diplomat to make rare visit to Iran as regional tensions soar – Winnipeg Free Press", "date": "2024-08-04 11:30", "url": "https://www.winnipegfreepress.com/world/2024/08/04/jordans-top-diplomat-to-make-rare-visit-to-iran-as-regional-tensions-soar", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Ayman Safadi is the first senior Jordanian official to pay an official visit to Iran in over 20 years.\nJordan is a close Western ally and helped intercept scores of missiles and drones fired by Iran toward Israel in April.\nSafadi met acting Foreign Minister Ali Bagheri Kani on Sunday, and later will meet Iran’s new president, Pezeshkian, reported SNN.ir, a news network close to the Guard.\nThe last time a senior Jordanian official traveled to Iran on an official visit was in 2004 when then-Prime Minister Faisal al-Fayez went to Tehran.\nIran's acting Foreign Minister Ali Bagheri Kani, right, welcomes Jordan's Foreign Minister Ayman Safadi for their meeting, in Tehran, Iran, Sunday, Aug. 4, 2024."}, {"id": "2a7eefec-d79e-4e93-a4c8-0870a6e13578", "title": "War on Gaza : Five killed in Israeli air strike on tent camp in central Gaza", "date": "2024-08-04 11:45", "url": "https://www.middleeasteye.net/news/four-killed-strike-tents-housing-displaced-palestinians", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "Thousands of displaced Palestinians have sought refuge in the hospital in Deir al-Balah, one of the few operational hospitals in central Gaza.\nIt was extremely difficult.”The attack brought the total number of Palestinians killed across Gaza on Sunday to 19, health officials said.\nIn northern Gaza, an Israeli strike destroyed a house, killing at least eight people, including three children, their parents and their grandmother, the Palestinian health ministry said.\nSunday’s strikes came hours after an Israeli air strike killed at least 17 people and wounded 21 others sheltering in a school in Gaza City.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza since the war began in October 2023, according to the Palestinian health ministry."}, {"id": "21da96c3-c875-4a8d-a752-143b7a6078d3", "title": "Possible Iranian Strike on Israel Expected on August 5", "date": "2024-08-04 10:30", "url": "https://www.kyivpost.com/post/36854", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "US officials have warned of a potential Iranian strike on Israel in response to the assassination of Hamas leader Ismail Haniyeh, expected on Monday, August 5.\nThree American and Israeli officials disclosed this information to Axios.\nUS officials anticipate that the attack could mirror the April 13 strike but may be more extensive.\nAlthough his trip was pre-planned, he will now work to mobilise allies to counter a potential Iranian attack.\nAdvertisementOfficials from both the U.S. and Israel stated they are uncertain whether Iran and Hezbollah will coordinate their attacks or act independently."}, {"id": "de112f46-a384-451a-bdf7-2f4939ef86be", "title": "The US$ . 1m hit", "date": "2024-08-04 10:30", "url": "https://trinidadexpress.com/news/local/the-us-1m-hit/article_6f733522-520a-11ef-ba5e-4382cd2b905a.html", "domain": "trinidadexpress.com", "domain_classification": "Unknown", "message": "Though very much a man in the news, businessman Allan Warner has kept a low profile, and would not usually comment on any issue in which he is named.\nThat changed on Friday when he granted the Sunday Express an exclusive interview at his Carenage home."}, {"id": "05813695-d755-4435-be96-2f64c7146541", "title": "US Introducing F - 22 Raptors to Challenge Iran Terror Axis in the Middle East | The Jewish Press - JewishPress . com | David Israel | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 07:00", "url": "https://www.jewishpress.com/news/us-news/us-introducing-f-22-raptors-to-challenge-iran-terror-axis-in-the-middle-east/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Air Force Tech.\nAnthony NelsonOn Friday, Defense Secretary Lloyd J. Austin III ordered an increase in military presence in the Middle East.\nThe Pentagon announced that additional combat aircraft and missile-equipped warships will be deployed to the region.\nEven with the arrival of the more recent F-35 Lightning II, the F-22 Raptor continues to be a dominant force in air-superiority missions.\nIts cutting-edge sensors and robust combat capabilities have maintained its status as a top-tier fighter jet."}, {"id": "eb84c9b9-a27f-495d-8850-d924cb57f3f6", "title": "Air Force commander : Ukraine destroys over 8 , 000 Russian air targets since Feb . 24 , 2022", "date": "2024-08-04 08:30", "url": "https://www.yahoo.com/news/air-force-commander-ukraine-destroys-080447699.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has destroyed over 8,000 Russian air targets since the start of the full-scale invasion in February 2022, Air Force Commander Mykola Oleshchuk reported on Aug. 4.\n\"In two and a half years, the Air Force has destroyed over 8,000 enemy air targets: hundreds of airplanes and helicopters, thousands of cruise missiles and drones.\nIn his statement, Oleshchuk also congratulated Ukrainian soldiers on the national Air Force Day, marked on the first Sunday of August in Ukraine.\n\"During the full-scale invasion, for their personal courage and dedication demonstrated in defending the state sovereignty and territorial integrity of Ukraine, 4,475 Air Force servicemen have been awarded state honors.\nRead also: Russia’s Su-57 – hype vs. reality\"The Air Force, shoulder to shoulder with the air defense of all the Defense Forces of Ukraine, repels the attacks."}, {"id": "cf3838a2-470e-4df4-ac35-d8d97a94cce4", "title": "Protesters Rally Against AUKUS Nuclear - Powered Submarines In Sydney", "date": "2024-08-04 06:00", "url": "https://menafn.com/1108514264/Protesters-Rally-Against-AUKUS-Nuclear-Powered-Submarines-In-Sydney", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SYDNEY, Aug 4 (NNN-AAP) – Dozens of protesters, including members from the local activist group, Sydney Anti-AUKUS Coalition, gathered at the Sydney Town Hall Square yesterday, to demand that the Australian reject the AUKUS nuclear-powered submarines.\nThey also reject the Australian opposition's proposal for nuclear power reactors on sites.\nPeter Murphy, convenor of Sydney Anti-AUKUS Coalition, said in his speech at the rally that, the AUKUS Pact between the United States, Britain and Australia was a super-secret project, to have Australia acquire nuclear-powered attack submarines, as well as, to jointly develop hyper-sonic missiles, cyber warfare, quantum computing and Artificial Intelligence weapons.\nThe protesters marched to the Defence Plaza Sydney, after the gathering, with banners that read,“Australia says No to AUKUS, No to NATO, No to War,”“Down with the AUKUS Nuclear Submarine Deal,”“Scrap AUKUS Now” and“No to Nuclear Subs.”Dennis Doherty, co-ordinator of Sydney Anti-AUKUS Coalition, said that, the nuclear industry, the nuclear weapons and the nuclear submarines, will have a negative impact on Australia.\nAnd that's why it's a bad move to have nuclear-powered submarines, because it's a threatening move, which will increase tension in our region, when we need to decrease tension,” he said.– NNN-AAP"}, {"id": "b38a7eee-ab60-4dd1-a748-dc1fee3d23e2", "title": "Taiwan is readying citizens for a Chinese invasion . It not going well . ", "date": "2024-08-04 13:15", "url": "https://www.stripes.com/theaters/asia_pacific/2024-08-04/taiwan-readying-china-invasion-14732791.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The threat from Beijing has intensified as Chinese leader Xi Jinping has declared China’s “reunification” with Taiwan inevitable.\nSuch admissions may concern Donald Trump, who has signaled a more transactional approach to American support for Taiwanese defense if he is reelected president in November.\nMost deferred military service to first attend university, meaning the 2005-born intake cohort won’t be fully trained until 2027.\nThose doing military service this year are not undergoing the anticipated training.\nThe island is patently not ready for that, according to people who have completed military training recently."}, {"id": "268a1db7-2d39-428d-b006-0ad4959de647", "title": "Big Chef Tertiary season 2 audition bus takes off on August 5", "date": "2024-08-04 08:45", "url": "https://www.myjoyonline.com/big-chef-tertiary-season-2-audition-bus-takes-off-on-august-5/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "The second edition of Joy Prime’s culinary contest between technical universities in Ghana is ready to kick start this August.\nThe first season featured six schools including Accra Technical University, Koforidua Technical University, Takoradi Technical University, Ho Technical University, Cape Coast Technical University and Kumasi Technical University.\nHo Technical University defeated the others and emerged as winners of the season.\nThe second season has been expanded to involve universities within the Northern part of Ghana.\nWa Technical University is privileged to be the first school to be auditioned prior to the main competition."}, {"id": "93b24589-a436-4d22-a1fe-4542d3f2ca05", "title": "Then Again : the Battle of Bennington and its aftermath", "date": "2024-08-04 13:30", "url": "https://vtdigger.org/2024/08/04/then-again-the-battle-of-bennington-and-its-aftermath/", "domain": "vtdigger.org", "domain_classification": "Unknown", "message": "“The Battle of Bennington, August 16, 1777” by Alonzo Chappel depicts the aftermath of the fight, with British and German soldiers being marched off as prisoners.\nWith that, Wasmus’ involvement in the Battle of Bennington, as it would become known, and the Revolutionary War were over.\nWe know of his experience, because, of the nearly 4,000 men who took part in the battle, Wasmus gained a sort of immortality by the simple act of writing things down.\nWhen the cart reached North Bennington, Wasmus and others helped the officer into a house.\n“We understood no English but they treated us like friends, spontaneously offering us milk and beer,” Wasmus wrote."}, {"id": "1add3bdf-912a-4ef8-8fae-442858bec402", "title": "Event honoring men killed in Somalia held in Westmoreland County", "date": "2024-08-04 02:30", "url": "https://www.wpxi.com/news/local/event-honoring-men-killed-somalia-held-westmoreland-county/3KD2VQVHLJAITBCJ5UXRPOP4ZY/", "domain": "wpxi.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "4c267b41-0db0-483a-9cef-4fc185743a33", "title": "Russia loses 1 , 150 soldiers , five tanks and 59 artillery systems", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-loses-1-150-soldiers-045050099.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Stock photo: General Staff of the Armed Forces of UkraineRussia has lost 1,150 soldiers, five tanks and 59 artillery systems in the war against Ukraine over the past day.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 4 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 582,910 (+1,150) military personnel;8,411 (+5) tanks;16,255 (+17) armoured combat vehicles;16,276 (+59) artillery systems;1,138 (+3) multiple-launch rocket systems;911 (+3) air defence systems;363 (+0) fixed-wing aircraft;326 (+0) helicopters;13,103 (+41) strategic and tactical UAVs;2,412 (+2) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,006 (+80) vehicles and tankers;2,734 (+11) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "0dbf011c-ca3e-4e6e-bc1b-162c3674690a", "title": "Israel war : How Hamas fights", "date": "2024-08-04 13:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/how-hamas-fights-israel-war-gaza-propaganda/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The approach from Hamas allowed Israel to come deep into the Strip, forcing them to fight Hamas where it suited the terror group best: its own backyard.\nA Hamas drone hovers above tanks in an Israeli forward operating base SOURCE: Hamas propagandaBefore Oct 7, Hamas used drones to get live feeds to map the Gaza envelope in detail, while the group even bought high-resolution satellite images from private firms.\nIsrael soldiers searching residential properties being filmed by Hamas SOURCE: Hamas propagandaHamas’s refusal to surrender and its decision to draw Israel into a deep and bloody conflict has taken a huge toll on the civilian population.\nIDF footage showing a suspected Hamas fighter with a rocket-propelled grenade on the steps of the Al Shifa hospital in central Gaza SOURCE: Hamas propagandaMousa Abu Marzouk, a senior Hamas official based in Qatar, defended Hamas tactics in a recent interview.\nA Hamas video showing a drone being prepared SOURCE: Hamas propagandaAs many of the Hamas videos show, the snipers also fire from a relative close range."}, {"id": "30c4e055-59ed-4ce9-9c60-7140a355a3d6", "title": "WWII soldier to be buried in Lynchburg 80 years after death", "date": "2024-08-04 12:30", "url": "https://newsadvance.com/news/remains-of-world-war-ii-soldier-returning-to-lynchburg/article_1a27a468-50e3-11ef-8dc5-9bdf2a23114f.html", "domain": "newsadvance.com", "domain_classification": "Unknown", "message": "The remains of a Lynchburg native who was killed in action in France during World War II are finally making their way back home to the Hill City.\nHudson’s remains were scheduled to arrive at Richmond International Airport Saturday morning before making their way to Lynchburg for his burial on Wednesday.\nOn Wednesday, the 80-year anniversary of Hudson’s death, his family will hold a graveside service at Fort Hill Memorial Park in Lynchburg, where his remains will then be buried.\nTen days after Hudson’s death, German forces in Saint-Malo surrendered to the Allies.\nIn June 2019, nearly 75 years after his death, Hudson’s remains were exhumed from the cemetery for laboratory analysis and identification."}, {"id": "edb9786c-719a-471a-89a7-3e4a7e87103f", "title": "Captain Newman MD - ITV4", "date": "2024-08-04 07:15", "url": "https://www.tvguide.co.uk/schedule/e7b3e343-3f02-57c0-b007-16ecff34b2c0/captain-newman-md", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Captain Newman MD (1964)ITV4 1:55 PM to 3:30 PM Sunday 4 August Share Add toCalendar +Captain Newman MD S SubtitlesAn American Army psychiatrist stationed on an airbase during the final months of the Second World War faces a constant battle with bureaucracy as the army fails to recognise the seriousness of his patients' conditions.\nFortunately, he has a resourceful corporal on hand to beg, borrow or steal much-needed resources.\nComedy drama, starring Gregory Peck, Tony Curtis, Bobby Darin and Angie DickinsonCaptain Newman MD airs on ITV4 at 1:55 PM, Sunday 4 August .\n(Subtitles, continued.)\nCertificate 15Topics Movie ➝ Drama Comedy General"}, {"id": "50792806-3f10-4487-b091-dede82ac1c38", "title": "Ukraine confirms F - 16s have arrived in country as Zelensky heralds  new chapter  in fight against Russia", "date": "2024-08-04 14:30", "url": "https://edition.cnn.com/2024/08/04/europe/ukraine-f16s-zelensky-arrival-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Russia maintains air superiority over Ukraine and the F-16s offer a significant improvement in Kyiv’s weaponry.\n“Now is a new chapter in the Ukrainian Air Force.\nWe have done a lot to ensure that the Ukrainian Air Force switches to a new standard of aviation - Western combat aircraft,” he said.\nMore F-16 jets are expected to arrive in Ukraine and “many of our men are currently studying and training,” Zelensky said.\nThe US committed to approving the transfer of F-16 fighter jets to Ukraine in August last year, after months of lobbying by Kyiv."}, {"id": "3721ea0e-f0de-478a-a852-2dff95b84192", "title": "Indian Navy Eyes Boeing Multi - Mission Pod for P - 8I Fleet – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-navy-eyes-boeings-multi-mission-pod-for-p-8i-fleet/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Navy Eyes Boeing’s Multi-Mission Pod for P-8I Fleet| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Navy is keenly interested in Boeing’s newly developed Multi-Mission Pod (MMP) for its P-8 Poseidon anti-submarine aircraft.\nAs per information provided to idrw.org, Boeing and the Indian Navy are working now to identify sensors that they would like to include in the Multi-Mission Pod (MMP) for India’s P-8 fleet that might consist of Indian-made sensors.\nCurrently operating 12 P-8I variants of the Poseidon, the Indian Navy is constantly seeking to enhance the capabilities of its maritime patrol aircraft.\nBy integrating potential in-country developed sensors into the MMP, the Indian Navy could tailor the P-8I to specific operational requirements.\nIf the Indian Navy decides to adopt this system, it would not only bolster its anti-submarine warfare capabilities but also position itself at the forefront of maritime surveillance and reconnaissance."}, {"id": "a382a00f-767c-4485-9f9f-8fbdfec4ed17", "title": "Friendship as former foes honour Cowra Breakout fallen", "date": "2024-08-04 07:30", "url": "https://www.canberratimes.com.au/story/8717991/friendship-as-former-foes-honour-cowra-breakout-fallen/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"At a time when there is so much turmoil and conflict in the world, it is important to remember that out of those very dark days of World War II, has grown a friendship between our two nations,\" he said."}, {"id": "62d080f2-7fb2-4537-a2e0-fcdf05121117", "title": "Zimbabwean Man Caught With USD 828 Million Worth of  Mutoriro  Meth in Australia – ZimEye", "date": "2024-08-04 02:30", "url": "https://www.zimeye.net/2024/08/04/zimbabwean-man-caught-with-usd-828-million-worth-of-mutoriro-meth-in-australia/", "domain": "zimeye.net", "domain_classification": "Unknown", "message": "Zimbabwean Man Caught With USD 828 Million Worth of ‘Mutoriro’ Meth in AustraliaSpread the loveSydney, Australia – In a significant drug bust, a Zimbabwean man has been apprehended in Sydney for allegedly smuggling 900 kilograms of methamphetamine, commonly known as “Mutoriro” in Zimbabwe, into Australia.\nThe illicit haul, valued at an astonishing USD 828 million, marks a dramatic escalation in the international narcotics trade involving the drug that has wreaked havoc in Zimbabwe.\nThis seizure will have a significant impact on the drug trade in New South Wales.”The Zimbabwean origin of the methamphetamine highlights a worrying trend.\nThe Australian Federal Police allege that the drugs were intended for distribution across the eastern seaboard, indicating a well-organized international drug syndicate.\n“This case underscores the global nature of the drug trade and the ongoing battle against narcotics that continue to devastate communities worldwide."}, {"id": "5d72eceb-df2c-4ee2-9bc7-f10261d0455f", "title": "Report states America possibly to lose probable war against Russia , China", "date": "2024-08-04 11:45", "url": "https://menafn.com/1108514888/Report-states-America-possibly-to-lose-probable-war-against-Russia-China", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The report, issued by a Congressional panel reviewing United States defense strategy, highlights critical shortcomings in the Department of Defense’s ability to both deter and win a major conflict.\nThe 114-page document, released on Monday, identifies Russia and China as the principal threats to United States national security.\nAccording to the report, the United States military is poorly structured to address these threats, and the nation's industrial base is insufficient to support sustained combat operations against major adversaries.\nExperts cited in the report argue that the United States was last adequately prepared for a significant conflict during the Cold War, which ended 35 years ago.\nThe report underscores the urgent need for a reassessment and overhaul of United States defense strategies to better prepare for the evolving global threats."}, {"id": "d50c52e1-e811-401e-81c8-6b4d436444f6", "title": "Zelensky Thanks Air Defenders For Their Efficiency And Precision", "date": "2024-08-04 07:45", "url": "https://menafn.com/1108514380/Zelensky-Thanks-Air-Defenders-For-Their-Efficiency-And-Precision", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Ukrainian President Volodymyr Zelensky on Ukraine's Air Force Day thanked the defenders of the sky for every downed Russian target and for their efficiency and precision.\nToday, we express our special gratitude to all the defenders of our skies-to the Ukrainian warriors of the Air Force of the of Ukraine for every downed Russian target, for their efficiency and precision,\" Zelensky said.\n\"Our warriors have already destroyed thousands of Russian missiles and drones, and hundreds of Russian combat planes and helicopters.\nAnd we are doing everything to ensure that the Ukrainian Air Force can achieve even more.\nGlory to our Air Force!"}, {"id": "aa163b93-e00a-4ebd-8f2e-3afbc4a1208a", "title": "Russia attacks Ukraine with 4 missiles and 5 UAVs overnight : Ukrainian defenders destroy all drones", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-attacks-ukraine-4-missiles-041440518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces targeted Ukraine with four missiles and five attack UAVs on the night of 3-4 August.\nUkrainian air defence units shot down all Russian drones.\nQuote: \"On the night of 3-4 August 2024, the enemy launched two S-300 anti-aircraft missiles on Kharkiv Oblast, two Kh-59 [air-to-surface] missiles on Poltava Oblast from the airspace of Kursk Oblast [Russia] and five Shahed attack drones from the area of [the city of] Primorsko-Akhtarsk, Russia.\"\nDetails: Oleshchuk noted that five Shahed-131/136 UAVs had been shot down by military assets and personnel from mobile firing groups of Ukraine's defence forces and electronic warfare units of the Air Force in Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia oblasts.\nSupport UP or become our patron!"}, {"id": "69e747c3-a85d-4239-b7b1-9beabc6aa3ee", "title": "Canada buys 39 General Dynamics vehicles , eyes anti - tank weapons", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/land/2022/11/09/canada-buys-39-general-dynamics-vehicles-eyes-anti-tank-weapons/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The country also has plans to buy new-generation Carl Gustaf anti-tank systems to replace older weapons shipped to Ukraine.\nIn July, Canada announced it was redirecting 39 light-armored vehicles, originally ordered for the Canadian Army, to Ukraine.\nThe Armoured Combat Support Vehicles had just been built and were rolling off the assembly line at General Dynamics Land Systems’ location in London, Ontario.\nDan Le Bouthillier, the spokesman with the National Defence Department, said a new contract between Canada and General Dynamics for $165 million was signed for 39 ACSVs.\nThe Canadian Army is in the process of acquiring 360 new light-armored vehicles as part of a 2019 deal with General Dynamics Land Systems’ Canadian branch."}, {"id": "686e7886-4ad0-4454-af63-d8a8b2a8f148", "title": "US lawmakers highlight threats posed by TikTok due to its Chinese ownership", "date": "2024-08-04 13:30", "url": "https://news.webindia123.com/news/Articles/World/20240804/4221834.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "\"Over 50 lawmakers file a bipartisan amicus brief in defence of the Protecting Americans from Foreign Adversary Controlled Applications Act in TikTok v Garland.\nThe brief mentioned that it seeks to protect all Americans from foreign adversary-controlled applications that present a clear national security threat to the US.\nIn these briefings, several national security and technology experts testified about the PRC's technology ambitions.\nThe brief added that it also has testimony from the Director of the FBI on the national security threat posed by TikTok during its annual Worldwide Threats hearing.\nThe Union government banned TikTok and several other Chinese apps in June 2020 over 'national security concerns'."}, {"id": "54e0511c-0db9-419f-8acb-e354daf6ced7", "title": "Njord : The Tumultuous Marriage of a Norse God of the Sea and a Goddess Giantess", "date": "2024-08-04 00:30", "url": "https://www.ancient-origins.net/myths-legends-europe/njord-tumultuous-marriage-norse-god-sea-and-goddess-giantess-009620", "domain": "ancient-origins.net", "domain_classification": "Unknown", "message": "Njord was the god Norse sailors and fisherman turned to in times of need.\nHe was a sea god with powers over the wind and the fertility of land along the coast.\nNjord – Norse god of the seas.\nAs Njord is a god of the sea, his abode was the sea, or more specifically, Nóatún (which means ‘Ship Enclosure’).\nAn illustration of the Norse god Njörðr, from an Icelandic 17th century manuscript."}, {"id": "32de5d96-4292-4d92-b536-77db7a6a28ca", "title": "NCIS - 5USA | TV Guide", "date": "2024-08-04 12:30", "url": "https://www.tvguide.co.uk/schedule/d60232b1-2509-50b1-ba29-dbab2326b65e/ncis", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "NCIS5USA 6:05 PM to 7:05 PM Sunday 4 August Share Add toCalendar +Psych Out Season 9 Episode 16 of 24 Repeat S Subtitles Audio DescriptionA Navy reservist is found dead in his home with marks around his neck, and Gibbs and the team discover he was working on a highly classified case for the department of defence.\nThe circumstances surrounding the man's demise lead the investigators to suspect someone was secretly trying to drive him insane, bringing them into contact with Samantha Ryan, the director of a division specialising in psychological warfare.\nGuest starring Jamie Lee CurtisNCIS airs on 5USA at 6:05 PM, Sunday 4 August .\n(Subtitles, repeat, audio description.)\nLearn more about NCIS and other movie/drama on our drama pageTopics Movie ➝ Drama Detective ➝ Thriller"}, {"id": "b501931d-5472-4335-8957-7dee8a565e2e", "title": "Iain Glen brings WWI history to light in  The Last Front  ", "date": "2024-08-04 07:15", "url": "https://www.bostonherald.com/2024/08/04/iain-glen-brings-wwi-history-to-light-in-the-last-front/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Iain Glen had good reason to jump into “The Last Front,” a WWI family drama set in a quiet Belgian village suddenly overrun by death-dealing German forces.\n“I wanted to do this because it was just a really lovely script,” Glen, 63, began in a Zoom interview.\nThis I thought was a different take into trying to encompass what war does to communities.\n“Yes, it’s a particular period set in the First World War, a simple, tender tale that looked at what war can do to communities.\nMy father was the eldest son of a farmer, and both my uncles are farmers,” said this son of Scotland."}, {"id": "23216d32-f3c6-4cee-bcdd-c1191d2048fe", "title": "Houston firefighters receive first paychecks from $650 million back pay settlement", "date": "2024-08-04 05:30", "url": "https://www.fox26houston.com/news/houston-firefighters-first-paychecks-650-million-back-pay-settlement", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "Houston firefighters are seeing a light at the end of the tunnel after a years-long battle with the City of Houston.\nThe Houston Profession Firefighters' Association is receiving $650 million in settlement money from the City of Houston.\n\"I’m hoping for all firefighters that today is just a day of healing for the Houston Fire Department,\" said Jason Wells of the Houston Fire Department.\nThe Houston Professional Firefighter’s Association’s legal battle with the City of Houston is coming to a close.\nSUGGESTED: Houston settles 8-year firefighters’ pay dispute with agreement approval\"This is the closure of the long-waged war against Houston firefighters and their families, and today marks a day of a new era,\" said Marty Lancton, the union president of the Houston Professional Firefighters Association."}, {"id": "eef6384e-2d54-4fad-884d-9f00e4656b05", "title": "One damn thing after the other", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485317/one-damn-thing-after-the-other", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Once asked what he thinks about history and politics, he very inelegantly said: “History is one damn thing after the other and politics is one damn thinker or one damn idea after another.” Why I am reminded of his reply is the frustration I feel in the inability of politics, both domestic and global, in becoming an answer to improve the overall human conditions.\nWhich wars can President Donald Trump shut down if he returns to power after American elections in November?\nIn August 2019, President Trump declared himself “history’s most pro-Israel U.S. president”.\nAbout 60,000 Israeli citizens have been displaced to central Israel due to the constant shelling of northern Israel by Hezbollah.\nHow right was Heny Ford — one damn thing after another, one damn thinker and idea after another."}, {"id": "59f75f1a-0737-4f79-b203-1957e836380e", "title": "Redon Systems Partners with Munitions India Limited for Advanced Munitions – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/redon-systems-partners-with-munitions-india-limited-for-advanced-munitions/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Redon Systems Partners with Munitions India Limited for Advanced Munitions| BySOURCE: AFIRedon Systems, a leading player in the Indian drone technology sector, has announced a strategic partnership with Munitions India Limited (MIL) to develop advanced munitions for its barrel-launched loitering munition, “Achuk”.\nThis collaboration marks a significant step towards enhancing the capabilities of the Indian Armed Forces.\nBy joining forces with MIL, Redon Systems reaffirms its commitment to making India self-reliant in military drone technology.\nThis partnership is expected to boost the operational efficiency and effectiveness of the Indian defense forces.\nBoth companies are optimistic about the potential of this collaboration and are committed to delivering cutting-edge solutions to meet the evolving challenges of modern warfare."}, {"id": "7bafda6f-570c-4eb4-903c-9ab1b821bc0b", "title": "Ukrainian Air Force Destroys Over 8 , 000 Enemy Targets Since Invasion", "date": "2024-08-04 10:45", "url": "https://menafn.com/1108514710/Ukrainian-Air-Force-Destroys-Over-8000-Enemy-Targets-Since-Invasion-Oleshchuk", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Since the beginning of the full-scale invasion, the Ukrainian Air Force has destroyed more than 8,000 enemy aerial targets, including hundreds of aircraft and helicopters and thousands of missiles and drones.\nUkrainian Air Force Commander Lieutenant General Mykola Oleshchuk said this in a post on Telegram on the occasion of the Ukrainian Air Force Day, Ukrinform reports.\nThe Air Force, side by side with the air defense units of the Ukrainian Defense Forces, repels the attacks.\nAccording to him, Ukrainian Air Force soldiers showed considerable courage, heroism, professionalism and ingenuity by using modern Western weapons in a quality and skillful manner.\n\"Today, I congratulate all service members and veterans of the Air Force on the 20th anniversary."}, {"id": "02a75e16-dfab-4c26-85c4-61a22d55f5fb", "title": "Israel - Iran war looms over Mideast : Will  Abraham Alliance  face off against  Axis of Resistance ? ", "date": "2024-08-04 07:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-looms-over-mideast-will-abraham-alliance-face-off-against-axis-of-resistance/articleshow/112260529.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "What is Abraham Alliance?\nThis proposal seeks to build on the Abraham Accords, normalisation agreements brokered during the Trump administration between Israel and several Arab states.Netanyahu introduced the Abraham Alliance as a response to recent coordinated actions against Iranian aggression.\n\"This alliance would be a natural extension of the Abraham Accords,\" Netanyahu stated.\n\"Iran and several allied groups, known collectively as the \"axis of resistance,\" have supported Hamas since the group launched its October 7 attack on Israel.\nHezbollah, or \"Party of God\" in Arabic, was established during Lebanon's civil war from 1975-1990 after Israel invaded Beirut in 1982."}, {"id": "7c43d8e8-1cb9-4bb9-9459-e3d6464be59a", "title": "Friendship as former foes honour Cowra Breakout fallen", "date": "2024-08-04 07:15", "url": "https://www.bendigoadvertiser.com.au/story/8717991/friendship-as-former-foes-honour-cowra-breakout-fallen/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"At a time when there is so much turmoil and conflict in the world, it is important to remember that out of those very dark days of World War II, has grown a friendship between our two nations,\" he said."}, {"id": "0f1fbb47-9c6b-4ff0-93d4-a777aae09159", "title": "Harris has managed to unite wine moms and lefty bros for now", "date": "2024-08-04 14:00", "url": "https://www.yahoo.com/news/harris-managed-unite-wine-moms-125532212.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "| Getty ImagesIn the two weeks since Kamala Harris has been running for president, the vice president managed to usher in a new Era of Good Feelings for Democrats, at least.\nHarris’ polling numbers are up — both nationally and in key states like Michigan — and she raised $310 million in July (crushing Trump’s $137 million).\nBut one of the more remarkable developments has been the détente reached between the online left and mainstream Dems, which hasn’t been seen in years.\nOne of the more remarkable developments has been the détente reached between the online left and mainstream Dems, which hasn't been seen in years.\nSanders voters wondered why they had found Harris’ laugh so annoying during the 2020 primary and started reposting her cooking videos."}, {"id": "cbbf4dbf-7cef-4839-adcd-d0bbbb80bcbd", "title": "Israel - Iran , Mossad , Hezbollah : Abraham Alliance vs Axis Of Resistance : Players In Israel - Iran Shadow War", "date": "2024-08-04 05:30", "url": "https://www.ndtv.com/world-news/israel-iran-mossad-hezbollah-abraham-alliance-vs-axis-of-resistance-players-in-israel-iran-shadow-war-6259187", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In a speech to the United States Congress last month, Israel's Prime Minister Benjamin Netanyahu envisioned a new regional coalition in the Middle East, termed the \"Abraham Alliance\".\nThe Abraham AllianceThe Abraham Accords, initiated in September 2020, normalised relations between Israel and several Arab nations, including the United Arab Emirates (UAE), Bahrain, Morocco, and Sudan.\nNetanyahu's vision for the Abraham Alliance builds on these accords, seeking a coalition that could include current and future diplomatic partners of Israel.\nThese groups have engaged in longstanding conflicts with Israel, receiving financial and military support from Iran.\nTehran has provided substantial military support, including approximately 80,000 fighting personnel, to bolster Assad's forces."}, {"id": "162723ef-b431-49d0-a4eb-160740837043", "title": "  Baltic Tiger  drill tests Berlin - to - Tallinn flow of reinforcements", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/global/europe/2022/11/10/baltic-tiger-drill-tests-berlin-to-tallinn-flow-of-reinforcements/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "It was the first time the German Air Force and Navy had trained together on such missions, and outside of their own nation, officials noted.\nMembers of the Air Force’s “Friesland” airfield protection unit were deployed, providing snipers, fire support, air mobility protection and close target reconnaissance.\nA handful of U.K. Royal Air Force, Belgian Air Force, and Danish Army personnel also participated.\nAir Defender 2023, a joint aerial drill between the U.S. Air National Guard and the German Air Force, is scheduled to take place next June.\nThe German Air Force wants to use all available air bases for this exercise, Gerhartz told reporters during Baltic Tiger."}, {"id": "9e728557-5d62-4165-a3c0-1cc1fb63843a", "title": "Ukraine now has F - 16s ; here what to know about the possible impact", "date": "2024-08-04 09:45", "url": "https://www.voanews.com/a/ukraine-now-has-f-16s-here-s-what-to-know-about-the-possible-impact/7727046.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.\nThough Russia's recent battlefield gains have been incremental, its steady forward movement is adding up as Ukraine gradually yields ground.\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes.\nHow will Ukraine protect the F-16s?"}, {"id": "03e83fea-7985-432e-a1c8-c58334a59b65", "title": "Putin willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISW", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/putins-willingness-hand-over-weapons-005630922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISWResearchers at the Institute for the Study of War (ISW) have indicated that Russia’s willingness to supply weapons to the Yemeni Houthis reveals President Vladimir Putin’s strategy to compel the West to retract its support for Ukraine.\nThis move also underscores Russia’s reliance on Iran for precision weapons and components.\nCNN sources disclosed that at least three Russian military officers visited Yemen in late July 2024, possibly to advise the Houthis and assist them in live-fire exercises, which were later cancelled by the Houthis.\nPutin's willingness to consider supporting the Houthis as they attack Israel and international shipping is part of deepening Russian-Iranian military cooperation and Russia's increasing reliance on Iran for high-precision weapons and components.\nRussian authorities continue efforts to financially incentivize Russian military service in Ukraine."}, {"id": "4338fcad-b16c-4b40-8157-4856e3eabca4", "title": "Chinese warships off Alaska and Cambodia highlight role of near and far waters in sea power dominance", "date": "2024-08-04 02:00", "url": "https://japantoday.com/category/features/opinions/chinese-warships-off-alaska-and-cambodia-highlight-the-role-of-near-and-far-waters-in-sea-power-dominance", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "To understand the geopolitics of sea power, you need to understand two terms: “near waters” and “far waters.” Near waters are areas close to a country’s shoreline that are seen as important for its defense.\nFar waters are areas across the ocean that a country wants to be present in for economic and strategic interests.\nBut here’s the thing: The far waters of one country are the near waters of another, and that leads to tension.\nMore than shipbuildingChina is a global economic power, and that requires controlling its near waters and building a presence in far waters.\nIt raises the prospect of China’s ability to project power into its far waters – and near waters of the U.S.Albatrosses or hawks?"}, {"id": "b5519d44-de14-48d7-a734-f20d83b0fd10", "title": "Prince George could make big change to his name - but it wont happen quite yet", "date": "2024-08-04 01:30", "url": "https://www.ok.co.uk/royal/prince-george-could-make-big-33339865", "domain": "ok.co.uk", "domain_classification": "Unknown", "message": "Whether it's William, George, Charles or Elizabeth, it's crucial that there are no overriding historical associations that could impact their future or draw negative comparisons.\nAnd while it may seem unlikely, this is an option that would be available to Prince George when his time as King arrives.\nFor such a common name, it's surprising that there had only been two kings named Charles before King Charles - but to say both had eventful reigns would be putting it mildly.\nPrince Albert, after his elder brother King Edward VIII abdicated, took on the name George and ascended to the throne as King George VI.\nThis was perceived as a symbol of stability and continuity from his father, King George V.While the concept of changing their names might seem perplexing in this digital era, it's highly probable that Prince William will adopt the title King William V upon succeeding his father, and Prince George is expected to eventually become King George VII."}, {"id": "22e4f412-16a1-48f2-b829-ce05195e0eea", "title": "CNN Claims Military Vet Who Saved 20 Women Lives Broke Taliban Law , Demands Lawsuit be Tossed", "date": "2024-08-04 11:30", "url": "https://radaronline.com/p/cnn-sides-with-taliban-jake-tapper-defamation-battle/", "domain": "radaronline.com", "domain_classification": "Unknown", "message": "Article continues below advertisementSource: MEGA; CNN Correspondent Alex Marquardt, who presented the story with Jake Tapper, allegedly referred to military veteran as 'f***ing Young' and said 'it’s your funeral bucko.'\nArticle continues below advertisementWhile the U.S. government does not recognize the Taliban or its interpretation of Sharia law, CNN claimed the terrorist’s regime should be considered in its defense of the lawsuit.\nArticle continues below advertisementSource: MEGA President Joe Biden withdrew nearly all U.S. personnel from Afghanistan in August 2021.\n“The activities Young directed and funded almost certainly were illegal under Taliban law, as the Taliban prohibited Afghans (especially woman) from exiting the country without permission and vastly restricted their movement inside the country.\nArticle continues below advertisementSource: MEGA CNN asked a Florida judge to sensationally block Jake Tapper from being interrogated about his involvement in a controversial story the embattled network aired."}, {"id": "4318ed0e-7b6d-4062-a7e8-fd9430090d0f", "title": "Protest against AUKUS nuclear - powered submarines", "date": "2024-08-04 08:45", "url": "https://www.sentinelassam.com/more-news/international/protest-against-aukus-nuclear-powered-submarines", "domain": "sentinelassam.com", "domain_classification": "Unknown", "message": "Sydney: Dozens of protesters, including members from the local activist group Sydney Anti-AUKUS Coalition, gathered at the Sydney Town Hall Square on Saturday to demand that the Australian government reject the AUKUS nuclear-powered submarines.\nThey also reject the Australian opposition’s proposal for nuclear power reactors on sites, Xinhua news agency reported.\nPeter Murphy, convener of Sydney Anti-AUKUS Coalition, said in his speech at the rally that the AUKUS Pact between the United States, Britain and Australia was a super-secret project to have Australia acquire nuclear-powered attack submarines, as well as to jointly develop hypersonic missiles, cyber warfare, quantum computing and Artificial Intelligence weapons.\nThe protesters marched to the Defence Plaza Sydney after the gathering, with banners that read, “Australia says No to AUKUS, No to NATO, No to War”, “Down with the AUKUS Nuclear Submarine Deal,” “Scrap AUKUS Now” and “No to Nuclear Subs.”Dennis Doherty, co-ordinator of Sydney Anti-AUKUS Coalition, told Xinhua that the nuclear industry, the nuclear weapons and the nuclear submarines will harm Australia.\n(IANS)Also read: South Korea warns to end North Korean regime if Pyongyang uses nuclear weapons (sentinelassam.com)"}, {"id": "11cd7933-f9cb-47d2-b127-fac369b8b9d6", "title": "Watch this US Air Force cargo plane launch a cruise missile in Norway", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/air/2022/11/10/watch-this-us-air-force-cargo-plane-launch-a-cruise-missile-in-norway/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "A U.S. Air Force MC-130J Commando II executes the first-ever European-theater live-fire demonstration of a Joint Air-to-Surface Standoff Missile during exercise Atreus in Norway on Nov. 9, 2022.\nAir Force)WASHINGTON — The U.S. Air Force has for the first time in an overseas test used its Rapid Dragon system, in which cruise missiles on pallets are launched from the back of a mobility aircraft.\nThe 352nd Special Operations Wing is based at RAF Mildenhall in England, and the MC-130 was from the wing’s 67th Special Operations Squadron.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "57117533-9e3a-4bcc-b317-c03ee8332a5d", "title": "Media blending against developing countries", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485315/media-blending-against-developing-countries", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Over 120 media organisations from 50 countries shared their experiences at this Forum of how the news is treated and spread by top Western media outlets.\nSeveral scholarly investigations into Western media’s coverage of the political developments taking place in developing countries exhibit a bias, positing that the Western media scrutinises democratic situation in developing countries with self-serving rhetoric but unpacking Western media’s propaganda needs credible data collection for policy initiatives to build more resilient society against media war.\nSometimes NGO financing is also used to create ‘color revolutions’ to destabilise developing countries, and deliberate media attacks are launched to discredit governance and democracy in targeted countries.\nA majority of the participants opined that Western media is a weapon against developing countries and against those who do not follow instructions from the West, and that the Western media works on a communication model of creating false narrative building based on syndicated, coordinated, deliberated moves to attack certain developing countries.\nShould media managers in Pakistan not sensitise the public about mechanisms that the Western media uses against countries like Pakistan?"}, {"id": "ff45344b-f7c9-471b-b3bd-50239d1ba3fa", "title": "The Army is obsessed with safety", "date": "2024-08-04 07:00", "url": "https://www.spectator.co.uk/article/the-army-is-obsessed-with-safety/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "Last week, the new head of the Army, General Sir Roly Walker, warned that war may be much closer than we think.\nTwo years ago, a syndicate of young officers published an article on the extreme shortage of division and brigade-level training in the British Army.\nIt’s worth first understanding how safety works in the British Army.\nThe military’s approach to safety is grounded in Lord Justice Haddon-Cave’s report on the 2006 Nimrod accident, which cost 14 lives.\nThe old saying that an hour-long safety brief does not encourage a better safety culture seems apt."}, {"id": "619a46d1-90e0-4cec-9c76-b950c9bd4673", "title": "Daggerheart Testing Big Change in Post - Beta Development", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/daggerheart-testing-action-tracker-removal-in-post-beta-development/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "Daggerheart is considering the removal one of one of its combat mechanics – the Action Tracker subsystem.\nComicBook had the opportunity to play through a session of Daggerheart hosted by Darrington Press, Critical Role's game publishing arm.\nThe session, run by lead designer Spenser Starke, featured both character creation and a brief combat session with a notable exclusion – there was no Action Tracker.\nIn versions of Daggerheart made available to players, players placed tokens into the Action Tracker, and the GM used those tokens to activate various enemies on their turn.\nPlease note that this was a playtest session and there's no guarantee that the Action tracker subsystem will be removed from the final version of Daggerheart."}, {"id": "0568306c-dda5-44a8-8960-3f3cc5d46b69", "title": "Absurd connections : Israel , North Korea and nuclear war", "date": "2024-08-04 09:00", "url": "https://www.israelnationalnews.com/news/394060", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Even if Israel were able to keep Iran pre-nuclear, an already nuclear North Korea could still multiply and magnify Iranian aggressions.\nBy definition, an accidental nuclear war between Israel and North Korea would be unintentional, but an unintentional nuclear war would not necessarily be the result of an accident.\nAlways, regarding potential Iranian nuclear surrogate North Korea, Israel’s strategic policies should emphasize the maintenance of stable intra-war nuclear thresholds.\nNorth Korea would likely “win” an actual nuclear war with Israel, but any such “victory” would come at very high costs.\nSumming up, though the above-identified connections between Israel, Iran and North Korea may first seem implausible, they do represent credible connections."}, {"id": "99bcebab-af41-4f7b-846e-f03709645294", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 07:00", "url": "https://abcnews.go.com/International/wireStory/spanish-journalist-russian-spy-mystery-pablo-gonzlezs-double-112549887", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "5a67922a-d79d-4716-b9ea-e003611281b5", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 06:45", "url": "https://www.moneycontrol.com/news/world/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life-12786332.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSassociated byco-presented byFollow us on:My AccountororHello, LoginAllSpanish journalist or Russian spy?\nThe mystery around Pablo González's double life"}, {"id": "52d17895-b388-4b9e-9625-1ffd85afe3b2", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 06:30", "url": "https://www.ksat.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "0abeee1e-f6df-4fef-8f95-a82c73099bc4", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:45", "url": "https://www.clickondetroit.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "40d8d6fd-dfba-411c-aa6a-3211a8da2b4e", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:30", "url": "https://www.local10.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "889326b8-ae6d-45e6-9ee3-fe5254894efb", "title": "Former Catholic Memorial star Ryan Higgins repeats as A Shot For Life champion", "date": "2024-08-04 02:30", "url": "https://www.bostonherald.com/2024/08/03/former-catholic-memorial-star-ryan-higgins-repeats-as-a-shot-for-life-champion/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Many of the participants had their own family cancer stories, including recent Catholic Memorial grad Ryan Higgins.\nThe Catholic Memorial assistant coach and college-bound athlete took the court together, with Bruce rebounding for Ryan.\nMacDonough was put in touch with ‘A Shot For Life’ after moving to the Commonwealth from Vermont, following a stint with the Lone Wolf Athletics AAU squad.\nNow, ‘A Shot For Life’ encompasses seven sports, hosting tournaments to fundraise across New England.\nNo matter how big we get, the Massachusetts ‘A Shot For Life’ Challenge will always be really special, because I did it as a kid."}, {"id": "f8b27d9a-d7fe-4f69-82c7-4f718496cd17", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:15", "url": "https://knpr.org/npr/2024-08-03/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "4f42c2af-ff38-410f-98ec-6b8b26841c46", "title": "German engineering helps Ukrainian amputees walk again", "date": "2024-08-04 01:45", "url": "https://www.yahoo.com/news/german-engineering-helps-ukrainian-amputees-012137307.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The 42-year-old is among the first patients to be fitted for new prostheses in Germany with the help of an initiative to bring better care to Ukrainian amputees.\nHowever, the plan is to slowly hand over to the new prosthetics centre which the programme is helping to establish in Kyiv.\n\"We are looking to see what still needs to be ordered so that the prosthetics centre is fully equipped,\" said von Wolfersdorff.\nCurrently, the supply of prosthetics in Ukraine is \"catastrophic\", said Saiko, who spent nine months of his rehabilitation in Ukraine.\nWith his German prostheses, Saiko is managing to climb a staircase with ease, balance on a board or ride a bike -- even if the effort brings him out in a sweat."}, {"id": "497f70a5-ecad-4359-b5f7-551a8968bb92", "title": "Ukrainian Air Defenses Shoot Down Five Enemy Shahed Uavs Overnight", "date": "2024-08-04 06:00", "url": "https://menafn.com/1108514260/Ukrainian-Air-Defenses-Shoot-Down-Five-Enemy-Shahed-Uavs-Overnight", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The forces and means of the mobile firing groups of the Defense Forces and EW units of the Air Force of Ukraine shot down five enemy Shahed-131/136 UAVs in the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions.\nUkrainian Air Force Commander, Lieutenant General Mykola Oleshchuk said this in a post on Telegram , Ukrinform reports.\n\"On the night of August 4, 2024, the enemy attacked the Kharkiv region with two S-300 anti-aircraft guided missiles, the Poltava region with two Kh-59 guided missiles from the airspace of the Kursk region, and launched five Shahed combat UAVs from Russia's Primorsko-Akhtarsk,\" the post says.\nshares video showing Russian fortifications, military infrastructure being destroyed near Sumy regioAs reported, Russia attacked Ukraine with combat drones."}, {"id": "e9dfb211-4458-4d07-b0e3-266294ec64c7", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:45", "url": "https://www.wsls.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "cca590c5-4ce7-4a94-935b-11b0da5b8ee9", "title": "  Big nerd culture : Hundreds of Utah wargamers gather to battle with dice , figurines", "date": "2024-08-04 01:45", "url": "https://www.ksl.com:443/article/51089259/big-nerd-culture-hundreds-of-utah-wargamers-gather-to-battle-with-dice-figurines", "domain": "ksl.com", "domain_classification": "Unknown", "message": "That's according to Shawn Bagley, an organizer for the Salt Lake Open, a series of gaming tournaments happening this weekend at the Utah State Fairpark.\nMarcus Kubryn, Calgary, plays Star Wars Armada during the Sci-Fi, Fantasy and Historical Tabletop Gaming Convention at the Utah State Fairpark in Salt Lake City on Saturday.\n\"Utah just has a big nerd culture in general,\" said tournament organizer Abigail Hansen.\nThe game system Hansen is overseeing at the Salt Lake Open has the same amount of participants.\nPlayers compete during the 2024 Salt Lake Open tabletop gaming convention Saturday at the Utah State Fairpark."}, {"id": "aa0aa036-7a1c-45a9-874d-79a521175886", "title": "Russian Army Loses 1 , 150 More Soldiers In Ukraine Over Past Day", "date": "2024-08-04 06:45", "url": "https://menafn.com/1108514309/Russian-Army-Loses-1150-More-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Russian army's combat losses in Ukraine from February 24, 2022 to August 4, 2024 amount to nearly 582,910 invaders, including another 1,150 killed or wounded in action in the past day.\nThe General Staff of the of Ukraine said this in a post on , according to Ukrinform.\nThe Ukrainian defenders have also destroyed 8,411 enemy tanks (+5 in the past day), 16,255 armored combat vehicles (+17), 16,276 artillery systems (+59), 1,138 multiple launch rocket systems (+3), 911 air defense systems (+3), 363 aircraft, 326 helicopters, 13,103 unmanned aerial vehicles (+41), 2,412 cruise missiles (+2), 28 warships/cutters, 1 submarine, 22,006 motor vehicles (+80), and 2,734 special equipment units (+11).\nAs reported by Ukrinform, the Ukrainian air defenses shot down five enemy Shahed-131/136 UAVs over the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions."}, {"id": "f6507bc1-a007-4538-ba62-f80b15ea16b1", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 05:30", "url": "https://www.npr.org/2024/08/04/g-s1-15275/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "npr.org", "domain_classification": "International", "message": "Spanish journalist or Russian spy?\nAmong them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "4685f36c-dbd4-4805-ae00-665e34fd8206", "title": "Opinion : Putin Dead - End", "date": "2024-08-04 10:30", "url": "https://www.kyivpost.com/opinion/36750", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "AdvertisementOver two years after the full-scale Russian invasion, few people are left in the RF (Russian Federation) who are willing to die voluntarily in Ukraine for pay.\nAnd a new mobilization could seriously undermine it, as a shortage of the working force is what now concerns Putin’s economists.\nAdvertisementAlthough the RF economy is still growing, this is occurring at the expense of increasing budgetary expenditures and enormous government contracts, that is, servicing Putin’s war.\nAs German Gref, one of Putin’s financial experts, acknowledged, the level of plant capacity utilization reached 84 percent, which is a historical maximum.\nAdvertisementThe views expressed in this opinion article are the author’s and not necessarily those of Kyiv Post."}, {"id": "e2c36846-9888-4e4f-8e60-7ec324ce5d14", "title": "A dispatch from the banana wars", "date": "2024-08-04 12:15", "url": "https://fortune.com/2024/08/04/banana-wars-united-fruit-honduras-bonilla-zemurray/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "If journalism is “the first draft of history,” then the account in Fortune’s March 1933 edition of how an American banana company planned and executed a revolution to install a friendly dictator in Honduras is a particularly colorful first draft.\nSometime after 2 a.m., the men finished their revelries: “‘Well, compadre,’ said Lee Christmas to Manuel Bonilla, ‘this here’s the first time I’ve ever heard tell of anybody going from a whorehouse to a White House.\nLet’s be on our way.’”And with that, the three men set off, taking a cruiser across Lake Pontchartrain to the waiting yacht the Hornet, which had been retrofitted for war and armed to the hilt.\nUnder the treaty, American bankers would offer the country financing, with the debt to be paid out of customs duties—but Zemurray didn’t want to pay duties on the building materials and equipment he was importing.\nEverything went as planned: The ragtag group on the Hornet shot their way through Honduran port defenses to the capital city of Tegucigalpa, which fell without a battle, and reinstalled Bonilla as president."}, {"id": "c55b3690-ab52-41df-b607-e925745adfe4", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.kalw.org/npr-news/2024-08-03/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "kalw.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "a126a880-1c25-4e2f-a5e3-1acc57810e28", "title": "Fresh start for clans in Jimi", "date": "2024-08-04 05:45", "url": "https://www.postcourier.com.pg/fresh-start-for-clans-in-jimi/", "domain": "postcourier.com.pg", "domain_classification": "Unknown", "message": "MORE than 100 newly built semi-permanent houses, with furniture, beddings and kitchen utensils, will be given to more than 1000 election-related violence victims in Jimi district of Jiwaka Province by end of this month.\nWhile living in caves and makeshift shelters for almost two years, more than 30 have died due to no access in health services or proper sanitation.\nMr Kopa used his knowledge and wisdom writing letters seeking help from all levels of the government and international donors.\nTo his relief, the International Organisation for Migration (IOM) and the Care International promptly responded with help and support for resettlement back at their Dapaka village.\nThese two international partners have come in heavily with the support of building 123 semi-permanent houses and households’ basics for a complete restoration."}, {"id": "47f8997e-fd0a-4caf-96bd-26c5a69c1c4c", "title": "Indian Army Mulls Massive Expansion of K - 9 Vajra Fleet Amidst Evolving Threat Scenario – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-army-mulls-massive-expansion-of-k-9-vajra-fleet-amidst-evolving-threat-scenario/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army Mulls Massive Expansion of K-9 Vajra Fleet Amidst Evolving Threat Scenario| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Army is on the cusp of significantly bolstering its artillery firepower with the acquisition of an additional 100 K-9 Vajra self-propelled howitzers (SPH).\nHowever, the evolving geopolitical landscape, particularly the ongoing conflict in Ukraine, has prompted the Army to reassess its artillery requirements.\nThe increasing emphasis on mobility and survivability on the modern battlefield has led to a potential surge in demand for self-propelled artillery systems.\nConsequently, the Army is now contemplating an even more ambitious target of procuring up to 400 K-9 Vajra SPHs, necessitating an additional order of 200 units.\nThe initial batch of K-9 Vajra SPHs was optimized for desert warfare, primarily targeting the western border with Pakistan."}, {"id": "495e287d-efac-48b9-95d3-e5b85fdb0616", "title": "BAE Systems Receives $493 Million U . S . Army Contract To Produce Additional M109A7 Self - Propelled Howitzers And M992A3 Ammunition Carriers", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108510668/BAE-Systems-Receives-493-Million-US-Army-Contract-To-Produce-Additional-M109A7-Self-Propelled-Howitzers-And-M992A3-Ammunition-Carriers", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- PR Newswire) STERLING HEIGHTS,Mich., Aug. 2, 2024 /PRNewswire/ -- BAE Systems (LON: BA) received a $493 million contract to continue producing M109A7 Self-Propelled Howitzers (SPH) and M992A3 Ammunition Carriers for the U.S. Army.\nThe M109A7 ensures have the most modern artillery capabilities that are highly survivable, maintainable, proven, and responsive on the battlefield.\n(Credit: BAE Systems)Post this\"We are focused on producing and fielding modern artillery capabilities that provide the Army with overmatch in range, accuracy, and lethality,\" said Dan Furber, director of ground vehicle production for BAE Systems' Combat Mission Systems business.\n\"This contract ensures the ABCT will sustain operations of one of the most survivable indirect fire support systems for years to come.\"\nFor more information, please contact:Darby Dame, BAE SystemsMobile: +1 269 675 0273[email protected]@BAESystemsIncSOURCE BAE Systems, Inc."}, {"id": "9d3f2337-e57c-4d35-bc26-e37b88b5f8c0", "title": "IDF soldier seriously wounded in combat in southern Gaza", "date": "2024-08-04 07:00", "url": "https://www.jpost.com/breaking-news/article-813152", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An IDF soldier was wounded seriously in combat in the southern Gaza Strip on Saturday, the military said on Sunday morning.\nThe soldier belonged to the 9th Battalion in the Armored Corps.\nHe was transferred to the hospital for further medical treatment, the IDF added."}, {"id": "d9217397-9d32-4cd4-ae0c-69a5e738bea2", "title": "German Engineering Helps Ukrainian Amputees Walk Again", "date": "2024-08-04 10:30", "url": "https://www.kyivpost.com/post/36849", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The 42-year-old is among the first patients to be fitted for new prostheses in Germany with the help of an initiative to bring better care to Ukrainian amputees.\nHowever, the plan is to slowly hand over to the new prosthetics centre which the programme is helping to establish in Kyiv.\nAdvertisement\"We are looking to see what still needs to be ordered so that the prosthetics centre is fully equipped,\" said von Wolfersdorff.\nCurrently, the supply of prosthetics in Ukraine is \"catastrophic\", said Saiko, who spent nine months of his rehabilitation in Ukraine.\nWith his German prostheses, Saiko is managing to climb a staircase with ease, balance on a board or ride a bike -- even if the effort brings him out in a sweat."}, {"id": "8daaf43c-1ce9-42d5-9c94-47ff45f8fa88", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 11:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219055/Spanish-journalist-or-Russian-spy", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”“And I thought: ‘Man, freelance life is never too good."}, {"id": "a0bc5c95-bf06-4163-9c67-d0fc0bc938fd", "title": "BERNAMA - Govt Must Address Uncontrolled Vaping Among School Students", "date": "2024-08-04 08:30", "url": "https://www.bernama.com/en/general/news.php?id=2325294", "domain": "bernama.com", "domain_classification": "Unknown", "message": "KUALA LUMPUR, Aug 4 (Bernama) -- Alliance for a Safe Community chairman Tan Sri Lee Lam Thye has called on the government to address the issue of uncontrolled vaping among school students with urgency.\nLee emphasised the need for nationwide school initiatives to combat vaping through awareness campaigns and concrete actions.\nHe expressed concern over recent reports of students vaping in school toilets and unused classroomsbootstrap slideshow “In a recent incident, six students at a secondary school in Selangor were found vomiting after sharing a vape.\nbootstrap slideshow He urged school authorities and students to support the Education Ministry's efforts to combat vaping, emphasising the effectiveness of peer-to-peer education programmes, where students who have quit vaping share their experiences.\nLee stressed the importance of involving parents and guardians in informational sessions to shape children’s attitudes and behaviors towards vaping."}, {"id": "cb70554d-d817-4564-a74a-b1df99f99fb1", "title": "  Our fight is not personal , it a fight of ideology : Supriya Sule responds to Fadnavi statements", "date": "2024-08-04 14:00", "url": "https://news.webindia123.com/news/Articles/India/20240804/4221839.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "In the wake of heated political exchanges in Maharashtra, NCP-SCP MP Supriya Sule has expressed her disappointment over recent statements made by Deputy Chief Minister Devendra Fadnavis.\nWhen he (Devendra Fadnavis) was the Chief Minister of Maharashtra for 5 years, we also had some expectations because there is always something good in every government...When Devendra Fadnavis said, 'Get on the road, fight', I was very surprised...\nIn the photo, a Kalingad (Uddhav Thackeray calls Devendra Fadnavis watermelon) is placed at my feet.\nSome thought I challenged him (Devendra Fadnavis).\nHe further said, \"Some thought I challenged him...Also, we should understand who I am and who he (Devendra Fadnavis) is."}, {"id": "cc7f29d2-cd44-4a32-9940-016676a1ef77", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.houstonpublicmedia.org/npr/2024/08/04/g-s1-15275/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Pablo González, a journalist from Spain who had been based in Poland, was freed in the largest prisoner swap since the Soviet era, confirming suspicions that he may have been a Russian operative.\nAmong them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "9e953771-cc27-4103-9f59-8c1814088daa", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.capeandislands.org/2024-08-04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "64ff876e-cf5c-4724-a7d4-a51b87ccdaee", "title": "Germany , Philippines working on defence cooperation deal", "date": "2024-08-04 12:30", "url": "https://www.yahoo.com/news/germany-philippines-working-defence-cooperation-115300802.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Germany and the Philippines on Sunday said they are working on a defence cooperation agreement, to be signed later this year, that would expand training between their armed forces and armaments cooperation.\nThe Philippines has been pushing to boost its external defences amid escalating tensions with China in the disputed South China Sea, and has been signing defence cooperation deals with other countries.\nCooperation could occur in air defence, coastal defence \"and possibly the procurement of transport aircraft,\" Pistorius said after meeting Philippine Defence Secretary Gilberto Teodoro.\nIn contrast, defence cooperation with the new partners in the Indo-Pacific region is progressing more slowly.\nChina, which claims almost the entire South China Sea, has taken increasingly aggressive actions in the area in recent years."}, {"id": "9963837e-24ec-4820-be80-789fe603ee86", "title": "Democrat Ruben Gallego promotes Republican support in his Arizona Senate campaign against Kari Lake", "date": "2024-08-04 13:30", "url": "https://www.yahoo.com/news/democrat-ruben-gallego-promotes-republican-130127359.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(AP) — Arizona Democrat Ruben Gallego is promoting Republican backing for his Senate campaign as the congressman works to assemble a winning coalition in the swing state.\nA list being released Sunday of Republican supporters of his campaign includes moderate Republicans and some former Republicans who held elected office or other roles in business or politics.\nSeveral are former aides to the late Sen. John McCain, the famed Arizona Republican and onetime prisoner of war who was known for occasionally bucking his party.\nGallego's Republican opponent, Kari Lake, has criticized McCain in the past and once suggested he was a “loser.”Democrats have made inroads in Arizona after decades of GOP dominance.\nShe says Gallego is a liberal Democrat who is out of step with Arizona’s moderate voters."}, {"id": "34e2dd52-6256-4ad7-a6be-dd5f96f42a0d", "title": "War of Words : Part VI : The Jewish Contribution to the Allied Cause in World War I & WW II | The Jewish Press - JewishPress . com | Alex Grobman PhD . | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/indepth/opinions/war-of-words-part-vi-the-jewish-contribution-to-the-allied-cause-in-world-war-i-ww-ii/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Saul Jay SingerEditor’s Note: Part 6 in the new series from Jewish Press Online contributor, Dr. Alex Grobman.\nIn sharp contrast to the Arabs, the Jewish community of Palestine actively supported the Allied cause in both World War I and World War II.\nJewish Military AssistanceIn September 1940, the British established a Palestinian battalion attached to the East Kent Regiment, but the Jews wanted to fight under their own Jewish flag.\nThe contacts did lead the British military to training members of the Haganah in fighting behind enemy lines.\nWhen the British entered Syria and Lebanon in July 1941, a platoon of Haganah scouts guided them and acted as saboteurs."}, {"id": "60259054-4229-4b7a-85df-92d2a50ce3d7", "title": "Hamas to shoulder blame for no progress on Gaza deal Netanyahu office adviser - World", "date": "2024-08-04 02:30", "url": "https://tass.com/world/1824993", "domain": "tass.com", "domain_classification": "Unknown", "message": "The radical movement Hamas should be blamed that the Cairo talks on a Gaza deal are not making progress, as Israel has not put forward any new demands, Dmitry Gendelman, an adviser to Israeli Prime Minister Benjamin Netanyahu’s office, told TASS.\nThe lack of progress is solely because of Hamas,\" he said.\n\"Those who suggest giving in to Hamas’ demands in order to get applause in the studios are reducing the chances of the hostages’ release,\" the office said.\nThe plan envisages a complete ceasefire and the release of Israeli hostages held by Hamas in exchange for the release of hundreds of Palestinian inmates from Israeli prisons.\nIn response, Israel launched a military operation in Gaza to eradicate Hamas’ military and political structure and to release all the hostages."}, {"id": "b11f861e-b755-43f2-9d10-9694feda6754", "title": "Horror at deaths of 12 children unites Druze across borders . But Mideast wars tear at their bonds", "date": "2024-08-04 02:30", "url": "https://www.dailyexcelsior.com/horror-at-deaths-of-12-children-unites-druze-across-borders-but-mideasts-wars-tear-at-their-bonds/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The Druze religious sect began as a 10th-century offshoot of Ismailism, a branch of Shiite Islam.\nIn Israel, Druze are highly regarded for their loyalty to the state and their military service, with many entering elite combat units, including fighting in Gaza.\nHe urged Israeli Druze not to join the war in Gaza or the increasingly volatile confrontation across the Lebanese-Israeli border.\nBut rather than criticizing Druze in the Israeli army, Khair said he would rather speak positively of voices among Israeli Druze that have backed the Palestinian cause.\nAcross Majdal Shams, there was raw pain as the community buried 12 small white coffins in the span of 24 hours."}, {"id": "03c7ac02-9a6a-4083-bc37-b17e965982b4", "title": "Bangladesh Students Step up Protests to Press PM Sheikh Hasina Resignation", "date": "2024-08-04 01:45", "url": "https://www.deccanchronicle.com/world/bangladesh-students-step-up-protests-to-press-pm-sheikh-hasinas-resignation-1814232", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Students Against Discrimination have asked their compatriots to cease paying taxes and utility bills from Sunday to pile pressure on the government.\n\"She must go because we don't need this authoritarian government,\" Nijhum Yasmin, 20, told AFP from one of many protests staged around Dhaka on Saturday.\nThe looming non-cooperation campaign deliberately evokes a historical civil disobedience campaign during Bangladesh's 1971 liberation war against Pakistan.\n- 32 children killed -Hasina, 76, has ruled Bangladesh since 2009 and won her fourth consecutive election in January after a vote without genuine opposition.\nThe protests had remained largely peaceful until attacks on demonstrators by police and pro-government student groups."}, {"id": "24740a8e-c3f3-4e7a-9681-c8d1e34285ae", "title": "Ubisoft August Switch sale : Prince of Persia : The Lost Crown , more", "date": "2024-08-04 06:45", "url": "https://nintendoeverything.com/ubisoft-august-2024-switch-eshop-sale-lowest-prices-ever-for-prince-of-persia-the-lost-crown-valiant-hearts-coming-home-more/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Ubisoft is currently hosting a new sale on the Switch eShop for August 2024, which features the lowest prices ever for Prince of Persia: The Lost Crown and Valiant Hearts: Coming Home.\nA bunch of other games are also included.\nThe full lineup is as follows:Ubisoft August 2024 Switch eShop sale prices– Assassin’s Creed: The Ezio Collection – $15.99 (was $39.99)– Assassin’s Creed: The Rebel Collection – $14.79 (was $39.99)– Child of Light – $4.99 (was $19.99)– Family Feud – $7.49 (was $29.99)– Immortals Fenyx Rising – $7.99 (was $39.99)– Jeopardy – $5.99 (was $19.99)– Just Dance 2024 Edition – $23.99 (was $59.99)– Mario + Rabbids Kingdom Battle – $13.99 (was $39.99)– Mario + Rabbids Sparks of Hope – $19.79 (was $59.99)– Monopoly (2017) – $7.99 (was $39.99)– Monopoly Madness – $7.49 (was $29.99)– OddBallers – $4.99 (was $19.99)– Prince of Persia: The Lost Crown – $23.99 (was $39.99)– Rabbids: Party of Legends – $9.99 (was $39.99)– Rayman Legends – $7.99 (was $39.99)– Scott Pilgrim vs.\nThe World: The Game – $4.89 (was $14.99)– South Park: The Fractured but Whole – $17.99 (was $59.99)– South Park: The Stick of Truth – $7.49 (was $29.99)– Starlink: Battle for Atlas – $8.99 (was $29.99)– Trials Rising – $5.99 (was $19.99)– Trivial Pursuit Live – $9.99 (was $19.99)– Uno – $3.99 (was $9.990– Valiant Hearts: Coming Home – $9.99 (was $14.99)– Wheel of Fortune – $6.99 (was $19.99)The Ubisoft August 2024 Switch eShop sale with Prince of Persia: The Lost Crown, Valiant Hearts: Coming Home, and more will be live until August 12, 2024.\nShare this:Related"}, {"id": "f67fbf7d-b638-4f29-bfb1-5081ef990bdb", "title": "Henry Danger - Nickelodeon HD", "date": "2024-08-04 05:45", "url": "https://www.tvguide.co.uk/schedule/9c7c34e5-e1e8-5949-848b-740b651d47a1/henry-danger", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Henry DangerNickelodeon HD 11:29 AM to 12:00 PM Sunday 4 August Share Add toCalendar +Part 3-A New Hero Season 5 Episode 8 of 41 S SubtitlesSchwoz works to create an anti-virus while Kid Danger and Captain Man battle a villain.\nKid Danger's heroism is put to the test as they fight to save the world.\nHenry Danger airs on Nickelodeon HD at 11:29 AM, Sunday 4 August .\n(Subtitles.)"}, {"id": "d087ceef-2d10-4e69-8095-62b56537fb99", "title": "One of Ireland most experienced aid workers :  The secrecy of HIV and Aids is worse now , it went underground during Covid  – The Irish Times", "date": "2024-08-04 05:30", "url": "https://www.irishtimes.com/life-style/people/2024/08/04/one-of-irelands-most-experienced-aid-workers-the-secrecy-of-hiv-and-aids-is-worse-now-it-went-underground-during-covid/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "“Actually, the secrecy is worse now, it went underground during Covid.\nThe young Irish healthcare workers tended to prefer sleeping during the day so they could work through the night-time bombardments, she says.\nJust this week, the UN’s World Health Organisation warned that increasing attacks on hospitals in the besieged nation had left the Sudanese healthcare system “hanging by a thread”.\nIt’s the trusted health workers that people believe.\nThis year, the Wexford woman will formally retire from her role as Concern’s overseas health programme adviser and HIV technical assistance team lead."}, {"id": "7c6a2585-4f16-4e3f-9d76-80df1a6e47fe", "title": "Horror at deaths of 12 children unites Druze across borders", "date": "2024-08-04 08:30", "url": "https://www.santafenewmexican.com/news/national_and_world_news/horror-at-deaths-of-12-children-unites-druze-across-borders/article_afbaebcd-f2bf-53ef-be10-f4b309eecc04.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "ce9c24e6-8d1c-4a2c-8542-e22fcc471527", "title": "Weight Loss Diet : 5 Post - Workout Meals That Will Help in Recovery And Keep You Full All Day", "date": "2024-08-04 08:45", "url": "https://www.india.com/lifestyle/weight-loss-diet-5-post-workout-meals-that-will-help-in-recovery-and-keep-you-full-all-day-7138261/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeLifestyleWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayA satisfying post-workout snack or meal is essential for maintaining your progress.\nSo, here are 5 options that you must incorporate in your training schedule for effective weight loss.\nWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayMaintaining a healthy diet is essential for weight loss, and timing your meals correctly is just as crucial.\nSo, here are 5 post-workout meals that you must include in your training schedule for weight loss.\n5 Post-Workout Meals For Weight Loss And Muscle RecoveryBanana and peanut butter smoothie: Nothing is more comforting that a homemade banana and peanut butter smoothie."}, {"id": "99d2087b-3a54-404c-b2cd-a4e5d48096d1", "title": "Elections : Maharashtra : Congress holds meeting to discuss strategy for assembly polls | India News", "date": "2024-08-04 10:30", "url": "https://timesofindia.indiatimes.com/india/maharashtra-congress-holds-meeting-to-discuss-strategy-for-assembly-polls/articleshow/112263739.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "In the photo, a Kalingad (Uddhav Thackeray calls Devendra Fadnavis watermelon) is placed at my feet.\nSome thought I challenged him (Devendra Fadnavis).\n\"Some thought I challenged him...Also, we should understand who I am and who he (Devendra Fadnavis) is.\nThe Congress, on the other hand, marginally improved its seat share by securing 13 seats in the state.The Shiv Sena and the Nationalist Congress Party (NCP) won seven and one seats respectively, taking the total tally of the NDA to 17.\nThe Shiv Sena (Uddhav Balasaheb Thackeray) got nine seats while the Nationalist Congress Party - Sharadchandra Pawar won eight seats."}, {"id": "0b2dd5c8-eb54-4d59-8073-544084a0fc01", "title": "An Upcoming Magic : The Gathering Release Features Two Baldur Gate 3 Favorites", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/magic-the-gathering-bg3-astarion-karlach/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "• Friends – You gain life equal to the amount of life you gained this turn.\n• Feed – Target opponent loses life equal to the amount of life they lost this turn.\n• Friends – You gain life equal to the amount of life you gained this turn.\nKarlach, Fury of AvernusWhenever you attack, if it's the first combat phase of the turn, untap all attacking creatures.\nJust as the Magic: The Gathering Monty Python Secret Lair sets sold out completely within an hour of their timed release, the Baldur's Gate 3 items will likely sell out incredibly fast – especially since this won't be a print-on-demand release as many fans would like for it to be."}, {"id": "03a40dab-3a13-4fc3-a26c-3149dd99b921", "title": "Olympic boxing controversy : Twisted into knots , the IOC answer to all questions legitimate or otherwise is ... just trust us", "date": "2024-08-04 14:00", "url": "https://www.kiro7.com/news/national/olympic-boxing/3ZSBCTWQ43H334VVIROYPCZNZY/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "71e80925-833f-492e-a3ac-1317943dbb33", "title": "Maharashtra : Congress holds meeting to discuss strategy for assembly polls", "date": "2024-08-04 10:30", "url": "https://news.webindia123.com/news/Articles/India/20240804/4221802.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Maharashtra Congress on Sunday held a meeting to discuss the upcoming state assembly elections.\nMaharashtra Congress in-charge Ramesh Chennithala, the state Congress President Nana Patole, Prithviraj Chavan, Balasaheb Thorat, Naseem Khan, Nitin Raut and other leaders were present in the meeting.\nIn the photo, a Kalingad (Uddhav Thackeray calls Devendra Fadnavis watermelon) is placed at my feet.\n\"Some thought I challenged him...Also, we should understand who I am and who he (Devendra Fadnavis) is.\nThe Shiv Sena (Uddhav Balasaheb Thackeray) got nine seats while the Nationalist Congress Party - Sharadchandra Pawar won eight seats."}, {"id": "99d35e38-ecb2-48f2-8b60-9fcfa2dbe7ce", "title": "Kung Fu Sock - Pop | TV Guide", "date": "2024-08-04 05:45", "url": "https://www.tvguide.co.uk/schedule/fb0b81ec-ca9d-50be-ae30-d8dcb4ecd5af/kung-fu-sock", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Kung Fu SockPop 11:00 AM to 11:15 AM Sunday 4 August Share Add toCalendar +Cyber Battle Season 1Gossip Boy is addicted to a Kung Fu Girl video game.\nTee Zeng borrows the game and gets addicted too.\nKung Fu Sock doesn't think much of the game at first, but soon he's attracted by the gorgeous Kung Fu moves in the game.\nKung Fu Sock airs on Pop at 11:00 AM, Sunday 4 August ."}, {"id": "115f9930-6861-4a5a-a6fa-bbf9f3b2759b", "title": "The Civil War Didnt  Settle  The Question Of State Secession", "date": "2024-08-04 03:00", "url": "https://www.zerohedge.com/political/civil-war-didnt-settle-question-state-secession", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "By Brian McGlinchey at Stark RealitiesSecessionist inclinations are on the rise in the United States, and are sure to intensify after Nov. 5 regardless of which party prevails.\nWhen that happens, you can expect the accompanying discourse will be peppered with assertions that states have no right to secede, with many declaring the question was “settled” by the Civil War.\nThough the Civil War has conditioned many Americans to associate secession with war — and to reflexively recoil from it on that basis — secession is not an inherently violent proposition.\nLooking back to the run-up to the Civil War, slavery-abolitionists themselves championed secession, pushing for northern states to abandon the union.\nOthers who attempt to deny states’ right of secession point to the Constitution’s lack of a provision for a parting of ways."}, {"id": "d73895f1-57fd-4f70-ab1f-1b2493b76666", "title": "What Was The Turning Point in WWII : A Timeline", "date": "2024-08-04 14:00", "url": "https://biztoc.com/x/2b0bf6ec215927d3", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "What if the D-Day landings had failed or the United States had lost the Battle of Midway?\nThese pivotal moments, defining the course of World War II, ultimately determined the outcome of this monumental global conflict.\nEven decades later, WWII remains one of history’s most devastating…This story appeared on 247wallst.com , 2024-08-04."}, {"id": "5c7b569d-5076-4ed9-a98c-8153d1281db0", "title": "Teenage Mutant Ninja Turtles for Series - Summary , Story , Characters , Maps", "date": "2024-08-04 14:30", "url": "https://www.vgchartz.com/game/226342/teenage-mutant-ninja-turtles/summary", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "1 million for Cowabunga Collection in just over 7 months.\nMachina posted 07/11/2022, 11:14Incomplete total.\nConsists of:- 18 million for the series up to Oct 2002 (- 1.1 million for TMNT (2007) (Message | Report Incomplete total.Consists of:- 18 million for the series up to Oct 2002 ( https://web.archive.org/web/20170215124944/http://www.prnewswire.com/news-releases/theyre-back-playmates-toys-launches-all-new-teenage-mutant-ninja-turtles-toys-76318872.html ).- 1.1 million for TMNT (2007) ( https://web.archive.org/web/20110815200143/http://www.next-gen.biz/news/ubisoft-annual-sales-rise-24 )."}, {"id": "6558d7fe-f726-4356-ae13-2718b549b448", "title": "Battle of Evesham Festival 2024 : sun brings out record crowd", "date": "2024-08-04 14:00", "url": "https://www.eveshamjournal.co.uk/news/24496266.battle-evesham-festival-2024-sun-brings-record-crowd/", "domain": "eveshamjournal.co.uk", "domain_classification": "Unknown", "message": "The Battle of Evesham Festival, the highlight event from the Battle of Evesham group could have seen as many as 40,000 people visit the town over the weekend.\nHand made swords were a plenty at the Battle of Evesham (Image: Newsquest)Saturday kicked off with The Grand Parade which saw over 700 reenactors pass through town before re-enacting the Battle of Evesham at the main arena.\nBecca and Jemima Coleman (Image: Newsquest)The Battle of Evesham was fought on August 4, 1265, marking one of the two main battles of 13th century England's Second Barons' War.\nOne reenactor, Becca Coleman, said: \"I'm part of a group and some of us are in the battle.\n\"I have been doing this for 30 years and this is my third time in Evesham and it's great."}, {"id": "7744dc15-cbfb-49a1-a803-e58c618f0880", "title": "Battle of Evesham Festival 2024 : sun brings out record crowd", "date": "2024-08-04 14:30", "url": "https://www.ledburyreporter.co.uk/news/24496266.battle-evesham-festival-2024-sun-brings-record-crowd/", "domain": "ledburyreporter.co.uk", "domain_classification": "Unknown", "message": "The Battle of Evesham Festival, the highlight event from the Battle of Evesham group could have seen as many as 40,000 people visit the town over the weekend.\nHand made swords were a plenty at the Battle of Evesham (Image: Newsquest)Saturday kicked off with The Grand Parade which saw over 700 reenactors pass through town before re-enacting the Battle of Evesham at the main arena.\nBecca and Jemima Coleman (Image: Newsquest)The Battle of Evesham was fought on August 4, 1265, marking one of the two main battles of 13th century England's Second Barons' War.\nOne reenactor, Becca Coleman, said: \"I'm part of a group and some of us are in the battle.\n\"I have been doing this for 30 years and this is my third time in Evesham and it's great."}, {"id": "7bcee9d0-88f6-416e-b18f-dff0fe19c634", "title": "Here how Mark Kelly upbringing and military and NASA careers prepared him for politics", "date": "2024-08-04 12:15", "url": "https://www.aol.com/heres-mark-kellys-upbringing-military-181326447.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Fast forward four decades and it could be Mark Kelly’s turn to serve as vice president of the United States.\nThe nation watched after a 2011 shooting left Giffords gravely wounded, and six others dead, and as Mark Kelly helped her recover.\nBut Mark Kelly’s path from a New Jersey township to Navy captain — from rambunctious kid to a decorated aviator — is less well known.\nMark Kelly wrote that his parents also taught him and demonstrated for him the importance of a strong work ethic.\nThis article originally appeared on Arizona Republic: Mark Kelly's life, military and NASA careers prepared him for politics"}, {"id": "4aeffd0a-2deb-480b-8229-f7f19eca219d", "title": "Government is ramping efforts to combat misinformation , disinformation – Fatimatu Abubakar", "date": "2024-08-04 07:00", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Government-is-ramping-efforts-to-combat-misinformation-disinformation-Fatimatu-Abubakar-1943847", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "Ms Fatimatu Abubakar, the Minister of Information, made this known in an interview with the media in Accra on Saturday.\nUpon approval, the Minister said, it would sanitize the media ecosystem and make it unprofitable for people to spread false information.\nThe Action Plan has six-point strategy to combat misinformation and disinformation in Ghana, she said.\nThe Government is also working to pass the Broadcasting Bill into law to assist in addressing misinformation and disinformation.\n“The right to information is the right to truth and the right to fact and not to misinformation,” she said."}, {"id": "3dac3764-9773-4e63-abc7-7f1f9084ca82", "title": "Democrat Ruben Gallego promotes Republican support in his Arizona Senate campaign against Kari Lake – Winnipeg Free Press", "date": "2024-08-04 13:45", "url": "https://www.winnipegfreepress.com/world/2024/08/04/democrat-ruben-gallego-promotes-republican-support-in-his-arizona-senate-campaign-against-kari-lake", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "(AP) — Arizona Democrat Ruben Gallego is promoting Republican backing for his Senate campaign as the congressman works to assemble a winning coalition in the swing state.\nA list being released Sunday of Republican supporters of his campaign includes moderate Republicans and some former Republicans who held elected office or other roles in business or politics.\nSeveral are former aides to the late Sen. John McCain, the famed Arizona Republican and onetime prisoner of war who was known for occasionally bucking his party.\nGallego’s Republican opponent, Kari Lake, has criticized McCain in the past and once suggested he was a “loser.”Republican Arizona Senate candidate Kari Lake waves to supporters after being declared the primary winner Tuesday, July 30, 2024, in Phoenix.\nShe says Gallego is a liberal Democrat who is out of step with Arizona’s moderate voters."}, {"id": "2806d4ca-0da0-442d-bf9a-ae5afee2679a", "title": "Agent Zo : The woman who parachuted into Nazi - occupied Poland", "date": "2024-08-04 00:00", "url": "https://www.bbc.com/news/articles/cneej0r2n7go", "domain": "bbc.com", "domain_classification": "International", "message": "So who was the woman who went by the name of Zo, and what inspired her to acts of such defiance and bravery?\n\"It's really ironic,\" says Clare Mulley, historian and author of a new book, Agent Zo.\nAt one point, Mulley says, Zo leapt from the door of a moving train to evade an officer who had joined her in the carriage.\nFor Polish war hero Kazimierz Bilski, there was one thing for it.\nThe government-in-exile \"just can't believe that women should be given military legal status\", Mulley explains, and Zo was branded \"an insane feminist\"."}]