[{"id": "5f65140e-751a-45a1-b813-b84c203806dc", "title": "Analysis : High - wire diplomacy on possible Iran retaliation in the Israel - Hamas war draws in world - New Delhi Times - India Only International Newspaper", "date": "2024-08-15 01:30", "url": "https://www.newdelhitimes.com/analysis-high-wire-diplomacy-on-possible-iran-retaliation-in-the-israel-hamas-war-draws-in-world/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Iran’s threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers into a high-wire act of diplomacy Tuesday.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu’s hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea.\nIran for years has asked for Sukhoi Su-35 fighter jets.\nTehran has also sought Russia’s S-400 surface-to-air missile defense system, a possible deterrent for the American-made F-35 fighter jets flown by the U.S. and Israel."}, {"id": "347b792c-91f0-4946-8cb6-de8a4c56e09a", "title": "Russians Hit Odesa Port Infrastructure With Ballistic Missiles , One Wounded", "date": "2024-08-15 00:45", "url": "https://menafn.com/1108556520/Russians-Hit-Odesa-Port-Infrastructure-With-Ballistic-Missiles-One-Wounded", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In Odesa on Wednesday evening, Russians launched a missile attack on civilian infrastructure near the port, injuring one person.\nAccording to Ukrinform, the head of the Odesa regional military administration, Oleh Kiper, reported this in a Telegram message.\nAccording to him, the enemy attacked Odesa with a ballistic missile in the evening.\n'The aggressor targeted civilian infrastructure near the port.\nAs Ukrinform previously reported, an explosion and fire broke out in Odesa on Wednesday evening during an air raid alert."}, {"id": "aa20b308-8dc8-4dcd-8816-93ce02d982b8", "title": "Tensions remain high in the Middle East as Israel braces for looming attack", "date": "2024-08-15 00:30", "url": "https://www.kbzk.com/world/israel-at-war/tensions-remain-high-in-the-middle-east-as-israel-braces-for-looming-attack", "domain": "kbzk.com", "domain_classification": "Unknown", "message": "Tensions continue to climb in the Middle East following the recent killing of top leaders in Hezbollah and Hamas.\nIran and the allied Lebanese Hezbollah group say they are committed to launching retaliatory strikes on Israel in response to the alleged assassinations.\nThe U.S. is aiming to ease tensions in the region as negotiators prepare to resume cease-fire talks on Thursday.\nThe White House is now concerned that if Iran and Hezbollah decide to attack simultaneously, it could be a very different story.\nIn terms of conventional warfare, Israel still has a vast advantage over Hezbollah."}, {"id": "bbfb785c-2384-4d54-a8c8-440f4fb77e6c", "title": "Fire in Nuclear Plant in Ukraine sends Danger Signal for Escalation of War", "date": "2024-08-15 01:30", "url": "https://www.dailyexcelsior.com/fire-in-nuclear-plant-in-ukraine-sends-danger-signal-for-escalation-of-war/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The atomic bombing on Japan unleashed a nuclear arms race with several countries joining the nuclear club.\nFrom two nuclear weapons in 1945 their number rose to over 61000 in 1985 (USA 21392 and USSR 39197).\nMaximum nuclear weapons tests were carried out between 1960 to 1969 total 706 of which 418 by the US and 232 by USSR.\nPerceiving the threat and public pressure the major nuclear weapons countries the USA and USSR cut down the number of nuclear weapons.\nTime is now to promote peace and nuclear weapons abolition by joining the Treaty on the Prohibition of Nuclear Weapons (TPNW)."}, {"id": "112de07a-45c0-4cd6-80f0-330ecfd267b7", "title": "11 - year - old girl randomly stabbed eight times by stranger in London was tourist visiting from Australia", "date": "2024-08-15 01:30", "url": "https://nypost.com/2024/08/14/world-news/11-year-old-girl-stabbed-eight-times-by-stranger-london-was-tourist-visiting-from-australia/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A young girl brutally attacked by a knife-wielding maniac in the middle of bustling London Monday was a tourist visiting with her family from Australia, according to reports.\n3 Ioan Pintaru, 32, was charged with attempted murder for the stabbing of the 11-year-old tourist.\n3 The 11-year-old was randomly grabbed while strolling through bustling London.\n3 The stabbing happened in the heart of Leicester Square, a tourist hub which sees 2.5 million visitors weekly.\nLeicester Square sees about 2.5 million people pass through weekly, many of whom are tourists."}, {"id": "f286d567-ce54-4304-a660-dffa6467707d", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 01:00", "url": "https://www.al-monitor.com/originals/2024/08/lebanon-says-two-killed-israeli-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nThe violence since October has killed some 570 people in Lebanon, most of them Hezbollah fighters but also including at least 118 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures."}, {"id": "6af9ba37-6c0e-4a74-941b-1967ca023205", "title": "Senor Biden adviser shuttles between Israel , Lebanon | Nation and World", "date": "2024-08-15 01:45", "url": "https://www.reviewjournal.com/news/nation-and-world/u-s-envoy-warns-lebanon-israel-tensions-could-easily-slip-out-of-control-3128691/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Senior Advisor to U.S. President Joe Biden Amos Hochstein, gestures as he meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(Hassan Ibrahim, Lebanese Parliament media office via AP)Senior Advisor to U.S. President Joe Biden Amos Hochstein, left, meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(AP Photo/Hussein Malla)Senior Advisor to U.S. President Joe Biden Amos Hochstein, gestures as he meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\n(AP Photo/Hussein Malla)Senior Advisor to U.S. President Joe Biden Amos Hochstein, left, meets with Lebanese caretaker Prime Minister Najib Mikati, in Beirut, Lebanon, Wednesday, Aug. 14, 2024.\nHochstein also met with Lebanon’s caretaker Prime Minister Najib Mikati and Army chief Gen. Joseph Aoun Hochstein."}, {"id": "95f3cd62-d0ea-44a2-a531-1fc0868736fc", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 03:00", "url": "https://www.digitaljournal.com/world/taylor-swift-returns-to-stage-in-london-after-vienna-concert-plot/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Taylor Swift is on the European leg of a tour that began more than one year ago.\n- Copyright GETTY IMAGES NORTH AMERICA/AFP/File Brandon BellAkshata KAPOORTaylor Swift will return to the stage in London on Thursday to end the European leg of her “Eras” tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nFollowing the knife attack, Swift said she was “completely in shock” and at a “complete loss for how to ever convey my sympathies to these families”.\nFans without tickets will also not be allowed to “tay-gate” the event — the practice of Swift fans standing outside the venue during the live show to hear the music.\nLondon shows are off to a splendid start”."}, {"id": "9f11aec2-1fdc-448e-86dc-8d56150234e6", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 04:15", "url": "https://www.stripes.com/theaters/europe/2024-08-14/britain-child-stabbing-14868369.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A police officer stands at the scene in Leicester Square, as a man was arrested with the accusation of stabbing an 11-year-old girl and 34-year-old woman, in London, Monday Aug. 12, 2024.\n(James Manning, PA/AP)LONDON — A man accused of stabbing an 11-year-old girl in London’s bustling theater district was charged Tuesday with attempted murder.\nIoan Pintaru put the girl in a headlock and stabbed her eight times, seriously wounding her, prosecutors said.\nThe girl was hospitalized and required surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said.\nThe attack happened around 11:30 a.m. Monday in Leicester Square, a tourism hot spot, outside a shop selling tea."}, {"id": "ed0129ba-02dd-4161-b213-6380cf1a9be4", "title": "  Complete Hypocrisy : US Continues to Serve Israel as Fear of Middle East Conflict Grows", "date": "2024-08-15 02:45", "url": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict Grows'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict GrowsSputnik InternationalHamas has reportedly expressed that they no longer see the US as being able to bring about a deal that would solidify a ceasefire in the Gaza Strip.\nAnd following the assassination of one of their leaders, the US has continued to support Israel indefinitely.\n2024-08-15T01:32+00002024-08-15T01:32+00002024-08-15T01:32+0000analysisisraeliranhamasismail haniyehpalestiniansmiddle eastjoe bidenus hegemonyarms tradehttps://cdn1.img.sputnikglobe.com/img/07e8/08/0f/1119774903_0:319:3074:2048_1920x0_80_0_0_059d12146e3a96dfb114e385f1d91624.jpgTensions in the Middle East are growing as Israel anticipates a retaliatory attack from Iran in response to the assassination of Hamas political chief Ismail Haniyeh.\nThey want their basic human rights that are guaranteed to them under international law.\nThat once the agreement is basically in place, Israel decides on some other conditions that it wants."}, {"id": "2e165529-cdee-4ffd-9a06-e80f5e79b5fd", "title": "Washington intensifies preparations for Middle East war with $20 billion arms sale to Israel", "date": "2024-08-15 04:30", "url": "https://www.wsws.org/en/articles/2024/08/15/nvin-a15.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The decision by the United States to supply arms worth $20 billion to Israel one day after announcing the deployment of a second aircraft carrier strike group to the region marks a further step towards a Middle East war.\n[AP Photo/Tsafrir Abayov]This is the inescapable conclusion that must be drawn from a review of the contents of the arms sale.\nThe Biden-Harris administration wants to ensure that Israel can continue pulverizing the people of the Middle East without missing a beat.\nThe latest arms sale was preceded by unmistakable signs that Washington wants a region-wide war.\nAmerican imperialism has already killed millions of people across the Middle East and Central Asia during three decades of uninterrupted war, and laid waste to entire societies."}, {"id": "17330c74-1f3a-42fd-9175-65cd0011956e", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 00:45", "url": "https://www.ajc.com/news/nation-world/man-charged-with-attempted-murder-in-stabbing-of-11-year-old-girl-in-a-london-tourism-hot-spot/A3CUTN6QEVGKNLJBMNIXPSOXW4/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "edfc880d-d2d8-46c7-a6a3-5ec9c8dc0db6", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\"."}, {"id": "d91c1dce-a085-4b9b-8c32-120366beb28e", "title": "Lebanon says three killed in Israeli strikes", "date": "2024-08-15 00:30", "url": "https://www.gjsentinel.com/news/national/lebanon-says-three-killed-in-israeli-strikes/article_e4566bbc-9b9a-5ab2-a755-2ec174567558.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Wednesday NightSome clouds this evening will give way to mainly clear skies overnight.\nA stray shower or thunderstorm is possible.\nSW winds shifting to ESE at 10 to 15 mph."}, {"id": "65cc7c9d-5299-4b97-88aa-e7e124902617", "title": "U . S . House investigating Google and Facebook for  censorship  of Trump assassination attempt * WorldNetDaily * by Cami Mondeaux , Washington Examiner", "date": "2024-08-15 02:15", "url": "https://www.wnd.com/2024/08/u-s-house-investigating-google-and-facebook-for-censorship-of-trump-assassination-attempt/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "(WASHINGTON EXAMINER) — House Republicans are demanding information from Google and Facebook executives after receiving “concerning reports” that the two companies may be engaging in censorship or misinformation about the assassination attempt against former President Donald Trump last month.\nIn a letter sent to Google CEO Sundar Pichai and Meta CEO Mark Zuckerberg, House Oversight Committee Chairman James Comer (R-KY) announced he would open an investigation to determine whether the two companies have generated “inaccurate or nongermane information” about the shooting at Trump’s Pennsylvania rally on July 13.\nThe investigation is one of several inquiries into the assassination attempt that resulted in the death of one rallygoer and injuries to two others.\nIn his request to Pichai, Comer cited reports from Google users who attempted to research the assassination attempt on Trump but instead were referred to results for failed attempts on other former presidents, such as Harry Truman, Gerald Ford, and Ronald Reagan.\nIn response, Comer requested information about how the Google search function is designed and “updated to take into account and incorporate recent newsworthy events.”"}, {"id": "3ba615f8-0a57-41ea-a82e-9cf6bb028d1a", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 01:00", "url": "https://www.mtdemocrat.com/news/national/lebanon-says-two-killed-in-israeli-strikes/article_4e82dd75-7752-5c30-b5a0-fae0177923b0.html", "domain": "mtdemocrat.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "5d9dbee9-a39c-43e5-873f-5d48d8099665", "title": "  Ukraine missile , UAV attacks on Russian regions clearly of terrorist nature , says Russia", "date": "2024-08-15 02:00", "url": "https://news.webindia123.com/news/Articles/World/20240815/4225282.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Moscow has accused Kyiv of carrying out barbarous attacks devoid of military purpose to 'terrorise' Russian civilians, after the Ukrainian forces made advancements in southern Russia recently.\n\"The Kyiv regime continues to carry out its terrorist attacks with the single goal to terrorise the Russian civilians.\nIt is apparent that Ukraine's missile and UAV attacks on Russian regions are clearly of terrorist nature,\" Zakharova said, according to the readout of the briefing released by the Russian Foreign Ministry.\nTerming the strikes by Ukraine as 'terrorist attacks', Zakharova called on international organisations to condemn these acts.\nThe advisory stated that due to security concerns in the Bryansk, Belgorod and Kursk regions, all Indian nationals must temporarily relocate outside these regions."}, {"id": "9a922186-097b-486f-8691-a4ca12710227", "title": "US envoy in Beirut to cool regional tensions - World", "date": "2024-08-15 04:30", "url": "https://www.dawn.com/news/1852372/us-envoy-in-beirut-to-cool-regional-tensions", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT / CAIRO: Washington on Wednesday sent an envoy to Lebanon to try and cool down tensions stemming from Iran and Hezbollah’s stated intentions to strike Israel in retaliation for the assassination of two key figures in the Middle East.\nSenior Iranian officials have said that only a ceasefire deal in Gaza would hold Iran back from direct retaliation.\nThat time is now,” added the envoy, who in 2022 brokered a maritime border deal between Israel and Lebanon.\nHezbollah and Iran have vowed to retaliate, sending tensions soaring.\nHezbollah has repeatedly said it would only end hostilities once a Gaza ceasefire deal has been reached."}, {"id": "f0fd14c9-f714-4dac-85dc-03e2468ae257", "title": "Wheat jumps almost 2 % as Russian attack on Ukrainian port supports prices", "date": "2024-08-15 03:30", "url": "https://www.marketscreener.com/news/latest/Wheat-jumps-almost-2-as-Russian-attack-on-Ukrainian-port-supports-prices-47655385/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"Russian missile strike on the Ukrainian port of Odessa last night is the main factor supporting prices today,\" said one grains trader in Singapore.\nRussian forces attacked port infrastructure in Ukraine's southern city of Odesa on Wednesday evening, injuring at least two people, Ukrainian officials said.\nThis year's rain-affected French soft wheat crop that is set to bring the smallest volume since the 1980s is also showing mixed milling quality, mainly for test weights, farm office FranceAgriMer said on Wednesday.\nTraders are monitoring drought in Ukraine, where producers warned that the corn crop could shrink by a third from last year if there is no rain relief.\nCommodity funds were net buyers of CBOT soybean, soymeal, corn and wheat futures contracts on Wednesday, according to traders."}, {"id": "46a58f26-b98d-431c-9684-16c810096183", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 01:15", "url": "https://www.bendigoadvertiser.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\"."}, {"id": "f1c633a3-175a-4eff-a3ec-a6f2a515a66c", "title": "Vigil held for mother stabbed to death by son in Brandon , family hopes for death penalty", "date": "2024-08-15 03:15", "url": "https://www.fox13news.com/news/vigil-held-mother-stabbed-death-son-brandon-family-hopes-death-penalty", "domain": "fox13news.com", "domain_classification": "Unknown", "message": "Family, friends and neighbors gathered with roses and candles Wednesday to remember a mother stabbed to death by her own son.\nRELATED: Man accused of stabbing mother to death faces judge amid family violence 'crisis'\"My mom was a good mom.\n\"I want the death penalty.\nI want the death penalty.\nI will not stop until he gets the death penalty,\" Blair said."}, {"id": "c048a2b7-1215-4f1f-83c4-1b5047743d99", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Canberra Times", "date": "2024-08-15 02:15", "url": "https://www.canberratimes.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "ee05c5bc-eb03-42ff-9c75-d467c9a0d2e3", "title": "Sikh activists believe they are in danger - The Jerusalem Post", "date": "2024-08-15 02:45", "url": "https://www.jpost.com/opinion/article-814766", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "INDIA’S PRIME Minister Narendra Modi gestures during the swearing-in ceremony at the presidential palace in New Delhi in June.\nThe Indian embassy in Washington and Modi’s office did not respond to repeated requests for comment.\nIn 2019, India declared Sikhs for Justice an unlawful association, citing its involvement in extremist activities.\nBains told Reuters she isn’t sure whether she experienced transnational repression by the Indian government.\nIn May, the California Assembly passed a bill she introduced that would train state law enforcement to identify and respond to transnational repression."}, {"id": "dc55a55c-608f-43be-8cf7-30253669b22c", "title": "Direct spending on TV , film plummets 37 % in Georgia , hurt by strikes", "date": "2024-08-15 00:45", "url": "https://www.ajc.com/news/business/direct-spending-on-tv-film-plummets-37-in-georgia-hurt-by-strikes/XFP5TWWDT5EFXBYKVXC7OXZAWA/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "338da367-e59f-4e01-8a53-0f1f0e3c723b", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Standard", "date": "2024-08-15 03:15", "url": "https://www.standard.net.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "07a77508-5177-4841-9a1a-8e52407db880", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds."}, {"id": "f63c71a7-3313-44a0-86ec-89043742a26e", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=2596", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds."}, {"id": "b581bfdc-e946-4449-9465-965fc0f612d4", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | Illawarra Mercury", "date": "2024-08-15 02:00", "url": "https://www.illawarramercury.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "illawarramercury.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "cc785db5-0897-4794-8e22-b4bfbef292ad", "title": "Russian family who fled Ukraine cross - border attack recalls panic , chaos", "date": "2024-08-15 02:45", "url": "https://www.voanews.com/a/russian-family-who-fled-ukraine-s-cross-border-attack-recalls-panic-chaos-/7743419.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Marina and her family were used to hearing the distant boom of explosions from their village in Russia's Kursk region, just a few kilometers from the Ukrainian border.\nUkrainian soldiers and armored vehicles began pouring into the region in the early hours of that morning, mounting the biggest cross-border attack on Russian soil since World War II.\nBut for many living in the border region, the attack came as a surprise.\nThe family reached Kursk in the early morning, where they found accommodation in a center for evacuees.\nRussia says more than 120,000 people have fled fighting in the region, but Yevgeny said many of his neighbors were stuck."}, {"id": "de28a3f1-bf4f-4d87-a72e-b6e7b4beebcf", "title": "Taylor Swift returns to stage in London after Vienna concert plot", "date": "2024-08-15 04:30", "url": "https://www.channelnewsasia.com/world/taylor-swift-london-vienna-concert-plot-4547486", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "LONDON: Taylor Swift will return to the stage in London on Thursday (Aug 15) to end the European leg of her \"Eras\" tour, a week after her Vienna concerts were cancelled due to a suicide attack plot.\nAround 90,000 fans will again pack London's Wembley Stadium for the first date in the five-day run, with additional ticket checks and restrictions in place.\nThree alleged Islamic State sympathisers have been arrested on charges of plotting the atrocity, which was thwarted with the help of United States intelligence.\nFollowing the knife attack, Swift said she was \"completely in shock\" and at a \"complete loss for how to ever convey my sympathies to these families\".\nShe has not yet commented on the decision to cancel the Vienna shows."}, {"id": "670eea45-fc37-4c7b-800d-2f4c6e430901", "title": "Queensland police dog Kaos , who survived 2020 stabbing attack , dies aged 12", "date": "2024-08-15 03:15", "url": "https://www.9news.com.au/national/brisbane-police-dog-kaos-who-survived-stabbing-attack-dies-aged-12/6bbe4010-55f6-47d0-b41b-28c5cf43847a", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Beloved Queensland police dog Kaos has died aged 12, just weeks after being decorated for outstanding service to the police force .\nKaos captured Australians' hearts when he survived a near-fatal stabbing attack while taking down two suspects in Brisbane on February 2, 2020.\nKaos with his handler Senior Constable Jim Griffiths, who Queensland Police have described as a \"formidable team\".\nQueensland Police have paid tribute to Kaos as \"fierce while tracking offenders\" but \"a sweet and soft soul\" when off-duty.\n\"PD Kaos and Senior Constable Griffiths were best mates and a formidable team,\" the statement reads."}, {"id": "d233047e-b68c-4b81-b429-1e0f192b4b15", "title": "Germany Locks Down Military Base , Claims Russia Tampered with Water", "date": "2024-08-15 00:45", "url": "https://www.breitbart.com/politics/2024/08/14/germany-locks-down-military-base-claims-russia-tampered-with-water/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "German politicians have pointed the finger at Russia after two military bases in the country had suspected incursion incidents overnight, with base drinking water apparently targeted.\nA German army air base was placed on lockdown for several hours after water testing detected “abnormal values” in the on-base drinking water, and a man-sized hole was discovered in the fence surrounding the facility’s water plant.\nA second base, a NATO airbase hosted in Germany was pulled into the incident when there was a foiled attempt to gain entry overnight.\nA spokesman said: “As the drinking water system was showing unusual values, the drinking water supply in the barracks was cut off”, a memo was circulated ordering staff at the base not to drink the tap water in any circumstance.\nThe base was searched and no intruder was found, but a man-sized hole was discovered in the fence surrounding the base’s drinking water plant on Wednesday morning."}, {"id": "0152e8e8-94a0-4705-a4c0-4e27b2d8c433", "title": "The Biden - Harris Regime Latest Betrayal of Israel Will Make Your Blood Run Cold – PJ Media", "date": "2024-08-15 01:30", "url": "https://pjmedia.com/robert-spencer/2024/08/14/the-biden-harris-regimes-latest-betrayal-of-israel-will-make-your-blood-run-cold-n4931652", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "The Biden-Harris regime is supposed to be an ally of Israel and occasionally sends signals to that effect, but its real loyalties are not hard to figure out.\nThe Biden-Harris regime is all about holding and increasing its power, and Israel is in the way of that aspiration right now.\nTo a regime that has never shown good faith and has repeatedly vowed the destruction of America as well as Israel?\nIt Turns Out Kamala Has Ties to a Far-Left, Hamas-Linked Islamic GroupThe State Department was quick to deny the accuracy of the Kuwaiti report, and as damning as it is, that’s no surprise.\nAdvertisementAre those two dozen people suffering unimaginable horrors in Iranian prisons today because of the Biden-Harris regime’s anxiousness to betray Israel?"}, {"id": "431fe846-f522-4d3d-bad1-110e5154daa4", "title": "Russo - Ukraine War - 14 August 2024", "date": "2024-08-15 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian terrorists four times, supported by aviation, stormed the positions of Ukrainian units in the areas of Vovchansk and Sotnitsky Cossack.\nUkrainian defenders also caused significant damage to two artillery systems, two combat armored vehicles and three Russian vehicles.\nThe operation to neutralise the AFU units is in progress."}, {"id": "fc1c575c-8e43-47ae-8bb6-83a609762e6e", "title": "Ukraine raid into Russia has shifted the tactical narrative – POLITICO", "date": "2024-08-15 03:30", "url": "https://www.politico.eu/article/ukraines-raid-kursk-russia-shift-tactical-narrative/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "And on Monday, Ukraine’s Commander-in-Chief Oleksandr Syrskyi claimed Ukraine had seized almost 1,000 square kilometers of territory inside Russia.\n“We continue to conduct an offensive operation in the Kursk region,” Syrsky declared in a video posted on Ukrainian President Volodymyr Zelenskyy’s social media accounts.\nAnd his prediction coincided with redoubled pleas for Western allies to allow Ukraine to shoot Western-supplied long-range missiles much deeper inside Russia.\nAnd the operation that’s underway in Kursk isn’t on the scale of Barbarossa or anything like it.\nThe Ukrainian president underscored that point himself this week, stating that “Russia must be forced into peace if Putin wants to continue waging war so badly.”"}, {"id": "5798ce82-781f-46c5-967d-8b1005c04e0a", "title": "Russia Tank Troubles : Why the T - 80 is Failing in Ukraine", "date": "2024-08-15 02:45", "url": "https://nationalinterest.org/blog/buzz/russias-tank-troubles-why-t-80-failing-ukraine-211108", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Russia's reliance on the T-80 tank, a descendant of the 1960s T-64, has proven costly in the Ukraine War.\nSummary and Important Points: Russia's reliance on the T-80 tank, a descendant of the 1960s T-64, has proven costly in the Ukraine War.\nMany of these are outdated Cold War-era tanks inherited from the Soviet Union, like the T-80 main battle tank, which Russia has deployed heavily.\nThousands of T-80 tanks were produced before the Soviet Union collapsed – 4,839 to be exact.\nThe Russians have already lost hundreds of T-80 tanks since the war began."}, {"id": "4cdb5092-4b1c-4831-9eb0-c11d3b7d1c70", "title": "A History Of  First In Warfare", "date": "2024-08-15 01:00", "url": "https://www.science20.com/scientist/history_firsts_warfare-67906", "domain": "science20.com", "domain_classification": "Unknown", "message": "at Megiddo, named in the Bible Derekh Hayam (Hebrew: דרך הים), was fought the first battle remembered by military history.\nMoreover, according to the History of the Peloponesian War, it is used also during the siege of Syracuse (about 413 BC).\nIn 68 BC Rome is committed against pirates in the Mediterranean and one can speak for the first time of the war on terrorism.\nThese factors led the Khan to implement the last and desperate act of war, which appears as a genuine act of biological warfare.\nIn the American War of Independence of 1776, the submarine is armed against surface ships."}, {"id": "f87a2631-9c87-4e73-a9de-52c02dfb631f", "title": "USAF can no longer count on overseas bases for power projection", "date": "2024-08-15 00:15", "url": "https://www.flightglobal.com/defence/usaf-can-no-longer-count-on-overseas-bases-for-power-projection/159575.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "Overseas air bases can no longer be counted on as safe harbours for American aircraft forward deployed to conflict zones.\nAdversary air fighters, including Lockheed Martin F-16s and F-35As from USAF aggressor squadrons, acted as a modern enemy air force.\nUnlike the USAF’s famous Red Flag air combat exercises, Bamboo Eagle sought to test the entire chain of personnel involved in sortie generation with combat conditions.\n“The USAF no longer has the luxury of projecting power from sanctuary bases,” he adds.\n“This is central to success in a changing threat environment that no longer allows the air force to treat overseas bases as sanctuaries,” the USAF says."}, {"id": "f6ca1fa9-80bf-4946-af06-e3a0b9d1057a", "title": "Let get to the real veteran issues", "date": "2024-08-15 01:00", "url": "https://www.newsday.com/opinion/editorials/jd-vance-tim-walz-military-service-ijy7ye2r", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Charges had emerged that Caputo falsely claimed he’d been a lieutenant in the U.S. Army during the Vietnam War.\nHis Democratic challenger, Sen. John Kerry, was politically targeted by other veterans who questioned the merits of his multiple combat medals.\nIn 2010, Connecticut Attorney General Richard Blumenthal told an audience of veterans he served in Vietnam.\nWhat do the candidates have to say about the defense budget and technological shifts in the armed forces, long-brewing sexual abuse and gender issues?\nLet’s thank both candidates for their service and move on to the relevant issues that affect those in uniform and the rest of us."}, {"id": "8c9c6426-14ee-4cae-ac5d-2c87f5771773", "title": "The U . S . Marines Will Be Key to a Two - Front War", "date": "2024-08-15 02:45", "url": "https://nationalinterest.org/blog/buzz/us-marines-will-be-key-two-front-war-212331", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Historically, the U.S. was equipped to handle two major regional conflicts (MRCs) simultaneously, relying heavily on the Marine Corps' combined arms capabilities.\nHistorically, the U.S. was equipped to handle two major regional conflicts (MRCs) simultaneously, relying heavily on the Marine Corps' combined arms capabilities.\n-However, since 2019, the Marine Corps has shifted focus away from its traditional roles, divesting key combat capabilities to adopt a China-centric strategy.\nThe Marine Corps’ Strategic Shift: Are We Ready for a Two-Front War?\nEven if the Marine Corps had retained the combat capabilities lost through divestment, it would have been crippled by the failure of the Navy’s amphibious shipbuilding deals made for the Marine Corps."}, {"id": "497a20c9-3100-4a8c-be81-93bae66cd2df", "title": "Russian phishing campaign targets Kremlin enemies at home and abroad", "date": "2024-08-15 03:45", "url": "https://www.yahoo.com/news/russian-phishing-campaign-targets-kremlins-021726758.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A sophisticated Russian spear phishing campaign has been targeting the Kremlin's critics in Russia and the West, according to a report from digital rights groups Citizen Labs and Access Now published Aug. 14.\nPhishing is a type of social engineering in which attackers seek access to victims' online accounts by leveraging personalized deceptive tactics.\nThe campaign targeted Russian opposition figures, NGOs, and Western diplomats, including former U.S.\nIn the case of Pifer, the phishing email impersonated another former U.S. ambassador.\nThe campaign also targeted Polina Machold, publisher of the Russian independent investigative outlet Proekt Media, and multiple officials and academics at U.S. think tanks."}, {"id": "44d277a2-b082-4385-9a2e-96c497587114", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-08-15 03:30", "url": "https://gamingbolt.com/page/5494?action_type_map=fp781524", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "There would be only a few people who don't know anything about video games and those who know even a bit about games the few of the very first name they'll be able to recall would be street fighter .\n... Read More"}, {"id": "bb3aeef1-f699-454b-b104-8656646191f8", "title": "My notes on Ukraine part of VIDEO | Ukr Pokrovsk Crisis , Rus : No Talks Kiev ; Alaudinov : Kursk NPP Ukr Target , Failed ; Iran Rejects US", "date": "2024-08-15 02:00", "url": "https://freerepublic.com/focus/f-chat/4258489/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Ukrainian offensive in Kursk:The Russian authorities are saying that the objective of the Ukrainians was the capture of the Kursk nuclear power plant.\nThis 'blitzkreig' of Zelensky's as planned to seize the power plant and use it as an ultimatum that we should leave somewhere and do something has failed.\nNext we will systematically destroy every Ukrainian (Mercouris notes Aladeenov uses a stronger word here) who got into our territory.\nThere have been many failed Ukrainian attempts to reach the nuclear power plant.\nIn this way the enemy tried to break through (city name) and the nuclear power plant but has been repulsed and loses equipment and soldiers."}, {"id": "4b90118b-0149-4ad5-9f95-334054b5ff71", "title": "Former CIA director coming to Peoria area", "date": "2024-08-15 04:30", "url": "https://www.yahoo.com/news/former-cia-director-coming-peoria-021254102.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — The Peoria Area World Affair Council is hosting former CIA Director General David H. Petraeus for a luncheon.\nPetraeus retired from the Army and is a former Commander of US Central Command and former Commander of Coalition Forces in Afghanistan.\nHe will also discuss is book Conflict: The Evolution of Warfare from 1945 to Ukraine.\nFour-Star Tour of the World with General David Petraeus is August 19 at the Par-A-Dice Hotel and Conference Center located at 21 Blackjack Boulevard in East Peoria.\nFor the latest news, weather, sports, and streaming video, head to CIProud.com."}, {"id": "97138c6f-7cd2-47ae-b89c-a39c82464858", "title": "This month in Illinois State University history : August", "date": "2024-08-15 00:15", "url": "https://news.illinoisstate.edu/2024/08/this-month-in-illinois-state-university-history-august/", "domain": "news.illinoisstate.edu", "domain_classification": "Unknown", "message": "From an alum’s historic dive to a former faculty member’s early exploration of the Grand Canyon, historian Tom Emery explores this month in Illinois State University history.\nBarbara Scholley, a 1980 Illinois State University graduate and a distinguished officer in the U.S. Navy, was on the dive team.\nIn 1994, Scholley was honored as the Illinois State University Distinguished Young Alumni Award, and four years later, she received an honorary doctorate from ISU.\nAugust 24John CookOn this date in 1882, the 25th anniversary gala for Illinois State University began.\nAt the time, Powell was on the staff of Illinois State University, which helped pay for the expedition."}, {"id": "05673039-01f3-43e7-b61d-a52e26a0305a", "title": "Ukrainian Mercenary NATO Forces Invade Russia Targeting Civilian Populations – Russia Labels Invasion as  Terrorist Attack  ", "date": "2024-08-15 00:30", "url": "https://healthimpactnews.com/2024/ukrainian-mercenary-nato-forces-invade-russia-targeting-civilian-populations-russia-labels-invasion-as-terrorist-attack/", "domain": "healthimpactnews.com", "domain_classification": "Unknown", "message": "It’s clear from the context that the video captures the early moments of a serious Ukrainian assault on Russian positions.\nThe 80th Air Assault Brigade, like its sister unit the 82nd Air Assault Brigade, apparently operates Marders alongside its Strykers.\nThey suit the Ukrainian air assault forces’ preference for swift but powerful attacks.\nThe agency claimed that the man shown in the footage was captured with the help of local residents in Kursk Region.\nOn August 6, Ukrainian forces launched their largest attack on Russian territory since the outbreak of the conflict in February 2022."}, {"id": "aded9e53-f90c-4687-9fbd-362ed3b68ab2", "title": "Shiloh National Military Park to celebrate National Park Service 108th birthday", "date": "2024-08-15 00:00", "url": "https://www.wbbjtv.com/2024/08/14/shiloh-national-military-park-to-celebrate-national-park-services-108th-birthday/", "domain": "wbbjtv.com", "domain_classification": "Unknown", "message": "SHILOH, Tenn. — Shiloh is pleased to announce a full day of activities in celebration of the National Park Service’s birthday, on August 24, 2024.\nIn celebration of the National Park Service’s Birthday, Shiloh National Military Park is offering a Junior Ranger Artillery Kids Camp on Saturday, August 24.\nJoin the Shiloh Cannon Crew as they present Civil War cannon firing demonstrations in honor of the NPS birthday.\nDemonstrations will take place on Saturday at 11:00 a.m., 1:00 p.m., 2:00 p.m., 3:00 p.m. and 4:00 p.m.As part of the NPS birthday, Shiloh rangers will provide guided tours of the Shiloh National Cemetery.\nPlaying period instruments and clad in Civil War clothing, the Ball’s are modern troubadours of Civil War era music."}, {"id": "b87585e1-024f-4bb3-9a1f-ee2236f875ef", "title": "AEW Dynamite results , live blog ( Aug . 14 , 2024 ): Two title defenses", "date": "2024-08-15 00:15", "url": "https://www.cagesideseats.com/aew/2024/8/14/24220298/aew-dynamite-results-live-blog-aug-14-2024-young-bucks-mercedes-mone-title-defenses-all-in-build", "domain": "cagesideseats.com", "domain_classification": "Unknown", "message": "AEW DYNAMITE RESULTS AND LIVE BLOG FOR AUG. 14But how can we let them go on this way?\nMone gets Shida up...Mercedes Mone wins by pinfall with Mone Maker, retaining the AEW TBS Championship.\nHe asks what Jungle Boy has ever added to AEW and says he’s going to end him at All In.\nAt Wembley he’s going to beat Allin at his own game— he wants a Coffin Match!\nHe talks about this being a vehicle to the world title and he’s going to hold all the titles at once."}, {"id": "94da102b-0cd5-4198-a07d-f60d095d232a", "title": "Canelo Vs . Berlanga : One Month To Go , And The Heat Is On", "date": "2024-08-15 01:45", "url": "https://www.boxingnews24.com/2024/08/canelo-vs-berlanga-one-month-to-go-and-the-heat-is-on/", "domain": "boxingnews24.com", "domain_classification": "Unknown", "message": "Berlanga would still be toiling away in the salt mines with the other contenders if not for Canelo giving him this golden opportunity.\nHe looked so happy because this is the only way he’s going to get Canelo’s respect.\nBerlanga looked great against the guys Top Rank matched him against, but he’s looked terrible lately, and he’s not been fighting quality guys.\nDuring the press conferences with Canelo, Berlanga was in pure theatrical mode, out-acting him and admirably selling the fight by playing the villain role.\nI would suggest that Berlanga jump on Canelo from the first round, throwing with pure power and not letting up on him."}, {"id": "5d17b8c2-19ae-4bb7-a6e1-1628f954c7fd", "title": "Task force in Osceola County shares how they plan to tackle opioid epidemic", "date": "2024-08-15 00:30", "url": "https://www.clickorlando.com/news/local/2024/08/14/task-force-in-osceola-county-shares-how-they-plan-to-tackle-opioid-epidemic/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "OSCEOLA COUNTY, Fla. – The Osceola Opioid Task Force has recently unveiled their final recommendations on how the county should allocate over $12 million they will receive over the next 18 years to combat the opioid epidemic.\n“In 2008, the state of Florida filed a lawsuit against five opioid manufacturers and four opioid distributors.\nThe settlement from this lawsuit resulted in a fund that will be available at the local, state, and federal levels to address the opioid epidemic,” said Vianca McCluskey, the chairperson of the task force.\nThe funds will also support organizations like Children Athletes & Artists Involved in Recreational Events (CAAIRE) which works with nearly 3,500 kids annually to help them avoid drug use.\nThey plan to open applications for organizations to apply for funding later this year."}, {"id": "87c5861c-4569-41af-b218-b25c236accd8", "title": "  We Entered Easily , With Little Resistance  – Ukraine at War Update for Aug . 15", "date": "2024-08-15 02:00", "url": "https://www.kyivpost.com/post/37408", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "As Ukrainian forces’ incursion into Russia’s Kursk region enters its second week, President Volodymyr Zelensky said on Wednesday that Ukrainian troops had “advanced well” that day, despite Moscow’s reinforcements.\nIn his nightly address to the nation, Zelensky reported that the Armed Forces of Ukraine (AFU) had gained about a mile on Wednesday.\n“Today we have advanced well in the Kursk region.\n“The creation of a buffer zone in the Kursk region is a step to protect our border communities from daily hostile shelling,” he said.\n“We don’t touch them, but they either treat us sharply, negatively, or not at all…They also deceive us about the positions of Russian troops,” he added."}, {"id": "8d6bbd2b-41fc-445d-9994-5bf683527caa", "title": "Former SEAL Leader Likely to Face Board of Inquiry in Coming Days over Death of Candidate Kyle Mullen", "date": "2024-08-15 00:30", "url": "https://www.yahoo.com/news/former-seal-leader-likely-face-214430577.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "However, Geary's lawyer, Jason Wareham, told Military.com that they refused the proceeding, arguing that he wouldn't receive a fair hearing.\nAccording to Wareham, Geary is instead headed for something in between -- a board of inquiry.\nMullen, 24, died of acute pneumonia shortly after completing the first, brutal portion of SEAL training known as \"Hell Week\" on Feb. 4, 2022.\nAsked Wednesday whether he still stands by his critiques of the investigation, Geary said that he feels \"even stronger toward those positions.\"\nRelated: Navy Looks to Punish 3 Top Officers Overseeing Navy SEAL Training After Recruit Death"}, {"id": "42452434-066d-4c24-b883-08e47bd2702f", "title": "Former SEAL Leader Likely to Face Board of Inquiry in Coming Days over Death of Candidate Kyle Mullen", "date": "2024-08-15 01:45", "url": "https://www.military.com/daily-news/2024/08/14/former-seal-leader-likely-face-board-of-inquiry-coming-days-over-death-of-candidate-kyle-mullen.html", "domain": "military.com", "domain_classification": "Unknown", "message": "However, Geary's lawyer, Jason Wareham, told Military.com that they refused the proceeding, arguing that he wouldn't receive a fair hearing.\nAccording to Wareham, Geary is instead headed for something in between -- a board of inquiry.\nMullen, 24, died of acute pneumonia shortly after completing the first, brutal portion of SEAL training known as \"Hell Week\" on Feb. 4, 2022.\nAsked Wednesday whether he still stands by his critiques of the investigation, Geary said that he feels \"even stronger toward those positions.\"\nRelated: Navy Looks to Punish 3 Top Officers Overseeing Navy SEAL Training After Recruit Death"}, {"id": "95cd3521-88df-4c5c-b7f3-2709be718e81", "title": "Liberty County Four recognized at Hinesville VA", "date": "2024-08-15 01:00", "url": "https://www.wtoc.com/2024/08/14/liberty-county-four-recognized-hinesville-va/", "domain": "wtoc.com", "domain_classification": "Unknown", "message": "HINESVILLE, Ga. (WTOC) - Group called the “Liberty County Four” recognized Wednesday.\nFour men, all killed in combat during the Vietnam War, all with ties to Liberty County.\nYou may remember—President Biden signed a bill into law earlier this year, naming the Hinesville VA clinic after them.\n“It’s not an award anybody wants to get, especially the family members of the men,” said Brenda Acebes who is on the committee to rename the Hinesville VA clinic.\nAccording to the VA, an official renaming ceremony of the Hinesville clinic is in the works but a date has not yet been set."}, {"id": "b1d83038-c715-4927-a63b-a79772a0a271", "title": "Best Look Yet At Ukrainian MiG - 29 Releasing Hammer Rocket - Assisted Bombs", "date": "2024-08-15 02:00", "url": "https://www.yahoo.com/news/best-look-yet-ukrainian-mig-003444914.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has released a video offering the best look to date of one of the country's MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nThe Ukrainian Air Force has released a video offering the best look to date of one of the country’s MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nA video of the moment of release of two French-supplied AASM-250 Hammer guided bombs from a Ukrainian MiG-29 fighter jet.\nLow pass by a Ukrainian Air Force MiG-29, armed with a French-supplied AASM 250 HAMMER extended-range guided bomb.\nHowever, it will take years for the Ukrainian Air Force and its pilots to unlock the full potential of those fighters."}, {"id": "64b530f8-7ba6-49fc-a08f-3c7bcdc664a3", "title": "What the real aim of Ukraine Russian offensive ? ", "date": "2024-08-15 03:15", "url": "https://www.spectator.co.uk/article/whats-the-real-aim-of-ukraines-russian-offensive/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "On Monday morning, Vladimir Putin was briefed about Ukraine’s audacious invasion of Russian territory.\nUkraine captured more than 100 Russian troops in less than a day, the military chief said – they will be a part of the PoW exchange fund.\nSome 92 countries attended Ukraine’s peace summit in Switzerland in June, but Russia wasn’t invited so there was little progress.\nUK military intelligence estimates that half a million Russian troops have been killed or injured.\nThe crucial factor now is Ukraine’s capacity to sustain its offensive while also continuing the defence in the east."}, {"id": "5187cccb-0479-4db1-8682-b6a0cae14fd2", "title": "South Korea Yoon Offers Rare Olive Branch to Kim Jong Un", "date": "2024-08-15 04:30", "url": "https://www.yahoo.com/news/south-korea-yoon-offers-rare-024638695.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "“Only by firmly defending our freedom can we become the leading force driving free and democratic unification,” Yoon said.\nHe also pledged to raise awareness about human rights abuses in North Korea, which has bristled for years at criticism of its rights record.\nKim has strengthened his hand by providing munitions to Russia in exchange for aid propping up his economy, the US and South Korea have said.\n“Even though the North Korean regime rejected our offer yet again, we will never stop making offers of humanitarian aid,” Yoon said.\nSouth Korea expressed disappointment over the officials’ visit, its Foreign Ministry said in a statement."}, {"id": "c6b26efc-5100-4c23-a952-b2d64c458620", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 02:15", "url": "https://www.stltoday.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_622e9fd6-ab35-5ae4-8bac-56b360a5d65b.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}, {"id": "a6b5c326-8e35-427f-94fb-a51ca671d748", "title": "Brad Pitt , Angelina Jolie Legal Battle : How Did it Come to This ? ", "date": "2024-08-15 02:45", "url": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-angelina-jolies-bitter-legal-battle-where-do-they-stand/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Nestled among the rolling hills of the French countryside in the small village of Correns sits Château Miraval, the centuries-old 1,200-acre property Brad Pitt and Angelina Jolie purchased for $28.4 million in 2008.\nA little more than a decade later, the winery is at the center of Pitt and Jolie’s seemingly never-ending feud.\n(Pitt’s legal team is looking to prove his request to have Jolie sign one is a common business practice.)\n“The issue of NDAs has become a key battleground in the dispute,” a member of Pitt’s legal team tells Us.\nA Pitt source says Jolie’s side has turned the war over Miraval into a rehashing of their divorce case."}, {"id": "20e0699a-3733-4fb8-abb4-303bea93f15e", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 03:15", "url": "https://omaha.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_d1bef3fa-2825-5bac-9282-c04b9f893146.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region."}]