[{"id": "52acd924-1cf0-4df8-bdc4-8e4739aac0eb", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "34848c77-508a-40c2-9b3b-61dfca78e66d", "title": "Letters : In praise of the kindness of strangers at a frightening time", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/letters/letters-in-praise-of-the-kindness-of-strangers-at-a-frightening-time/a1951174018.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "I am extremely grateful to each and every one for the kindness shown to me at the time I needed it most.\nAnd people who fancy a flutter or a visit to a racetrack might reflect on what they are supporting.\nI would like to think the Government will respond to the RTÉ report, an example of public broadcasting at its best.\nOur relay teams typify the ­Ireland that I love, which is built on that great Irish custom of inclusiveness.\nGiven the world we live in today and as a fellow Dubliner, I think it’s important to say this again."}]