[{"id": "ae2d3fc7-81f6-43e3-9445-a1fb94d5f7bd", "title": "Hezbollah attacks Meron anew as Israeli strike kills 1 in Aitaroun", "date": "2024-06-15 10:45", "url": "https://www.naharnet.com:443/stories/en/305950-hezbollah-attacks-meron-anew-as-israeli-strike-kills-1-in-aitaroun", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah on Saturday said it attacks Israel’s Meron air control base with guided missiles as part of its response to Israel’s assassination of senior military commander Taleb Abdallah.\nIn a statement, Hezbollah said the attack destroyed parts of the base’s equipment and radars.\nThe Meron had been also attacked by Hezbollah on Wednesday as part of a massive missile and drone attack on Israel that followed Abdallah’s killing.\nTV networks said the strike killed one person and wounded another, as the Israeli army said the strike targeted a militant.\nHezbollah, which is allied with Hamas, has been clashing near-daily with Israeli forces against the backdrop of Israel’s war against Hamas in Gaza."}, {"id": "2e4f9994-526b-445a-a177-62af7dcccfc2", "title": "Hezbollah Says Its Intensified Attacks Show Israel That All - out War Would Be Costly", "date": "2024-06-15 05:15", "url": "https://www.news18.com/world/hezbollah-says-its-intensified-attacks-show-israel-that-all-out-war-would-be-costly-8932938.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Lebanese militant group Hezbollah says its intensified attacks along Israel’s northern border this week demonstrate to Israeli leaders that an all-out war would be costly, senior official Sheikh Ali Daamoush said in a sermon during Friday prayers.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.\nThe cease-fire proposal announced by Biden includes those provisions, but Hamas has expressed wariness whether Israel will implement the terms."}, {"id": "17cc7e02-d2f9-4e78-bd22-c76903b67349", "title": "Hamas says top official killed in explosion south of Beirut", "date": "2024-06-15 03:30", "url": "http://www.myanmarmuslim.net/news/20240615846f599097.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An explosion in Beirut on Tuesday killed Saleh Arouri, a top official with the Palestinian militant group Hamas and three others, officials with Hamas and the Lebanese group Hezbollah have confirmed.\nHamas official Bassem Naim confirmed to The Associated Press that Arouri was killed in the blast.\nA Hezbollah official speaking on condition of anonymity in line with regulations also said Arouri was killed.\nThe explosion shook Musharafieh, one of the Lebanese capital’s southern suburbs, which are a stronghold of the militant Hezbollah group, an ally of Hamas.\nArriving in Beirut, Arouri made few public appearances but helped to pull Hamas closer to Hezbollah’s orbit."}, {"id": "49baa6dc-ce71-4979-8ee6-fb75d789b7bd", "title": "Hamas : Two more Israeli captives killed by regime bombing", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-presstv01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hamas: Two more Israeli captives killed by regime bombingIran Press TVFriday, 14 June 2024 7:26 PMAl-Qassam Brigades, the armed wing of the Hamas resistance movement, says two Israeli captives held in Gaza have lost their lives to non-stop bombardment of the narrow territory, adding to scores of detainees who had earlier been killed at the hands of the regime.\nThe group did not identify the captives killed in the attack.\nHamas says scores of captives have been killed in the intense bombing campaign of the strip and the regime's invasion of the strip.\nThe regime retrieved four captives held by Hamas in a genocidal raid in central Gaza's al-Nuseirat on June 8.\nHamas said the Israeli raid killed three other captives, including an American citizen."}, {"id": "51fa40f1-055b-4bbd-9fb4-149e5a2852c4", "title": "US launches wave of strikes on Houthi rebel targets in Yemen", "date": "2024-06-15 09:15", "url": "https://www.euronews.com/2024/06/15/us-launches-wave-of-strikes-on-houthi-rebel-targets-in-yemen", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels in retaliation to a series of missile strikes in the Arabian and Red Seas.\nThe US military's Central Command said they destroyed seven radar sites.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThis week, two cruise missiles launched by Houthi rebels set a bulk cargo carrier ablaze in the Gulf of Aden.\nThe strike hit the Ukrainian-owned and Polish-operated bulk cargo carrier the M/V Verbena and severely wounded a civilian mariner."}, {"id": "9b687ff5-d128-4724-883d-ff23798a105d", "title": "Israeli Media : 8 soldiers killed in armored vehicle explosion in Rafah", "date": "2024-06-15 13:15", "url": "https://www.albawaba.com/news/israeli-media-8-soldiers-killed-armored-1572663", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Eight soldiers were killed after an anti-tank missile destroyed a Namer armored personnel carrier early Saturday morning in Rafah, southern Gaza Strip, according to \"Hadashot BeZman\".\nAl-Aqsa TV said that Israeli troops upped their artillery and air strikes on Rafah to cover victims' exit.\nThe Qassam Brigades reported heavy fighting with Israeli soldiers in Tel Sultan since Friday morning.\nOne of the 8 was Waseem Mahmoud who was burned to death in the explosion that targeted a Namer military vehicle in Rafah, this morning.\nThe \"Jerusalem Post\" reported that hundreds of Israeli troops returning from Gaza had PTSD."}, {"id": "cca2a31b-6cd3-4b6c-a9eb-1acaefbd0ee3", "title": "Global leader of ISIS targeted and possibly killed in U . S . airstrike", "date": "2024-06-15 12:30", "url": "https://www.nbcnews.com/politics/national-security/global-leader-isis-mumin-targeted-possibly-killed-us-airstrike-rcna157300", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "The U.S. military targeted the global leader of ISIS in an airstrike in Somalia late last month but cannot confirm whether he was killed, three U.S. officials say.\nU.S. Africa Command released a statement on May 31 saying it had conducted an airstrike against ISIS militants in a remote area 81 km (50 miles) southeast of Bosaso, Somalia, and killed three militants.\nNational Counterterrorism CenterThree U.S. officials now say Mumin was the target of that operation, even though they do not have confirmation of his death.\nA senior defense official says ISIS in Somalia is relatively small, with only 100 to 200 total fighters, all located in northern Somalia.\nThe previous two global chiefs of ISIS, including its best-known leader, Abu Bakr al-Baghdadi, had killed themselves when they were cornered during U.S. military raids."}, {"id": "e367d38e-f8ab-42f3-b5c2-b47c121ea958", "title": "Slovak journalists fear govt . repression after Fico shooting – DW – 06 / 12 / 2024", "date": "2024-06-15 06:30", "url": "https://www.dw.com/en/slovak-journalists-fear-govt-repression-after-fico-shooting/a-69345945", "domain": "dw.com", "domain_classification": "International", "message": "The nationalist populist Fico has never hidden his contempt for journalists, famously branding them \"dirty, anti-Slovak prostitutes\" in 2016.\nHowever, since his return to power in October, his bid to \"reform\" the country's public media has raised concerns both at home and abroad.\nSlovak media increasing self-censorshipJournalists at Markiza are attempting to fight back, threatening to strike as they support Kovacic's claim that management is interfering in the station's editorial coverage.\nHungarian journalists warn of 'Orbanization'Amid the pressure, newsrooms are becoming despondent, the anonymous broadsheet journalist told DW.\nNot everyone is so worried that the government will be able to use the attack on Fico to launch Slovakia on a fast-track to Orbanization."}, {"id": "4f38c20d-ea15-47cd-8cc8-79cc5dafb122", "title": "Iran fires at apparent Israeli attack drones near air base and nuclear site", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/20240615258d599733.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iranian air defences have been activated after an apparent Israeli drone attack on a major air base near the central city of Isfahan.\nNo Iranian official directly acknowledged the possibility that Israel had attacked, and the Israeli military did not respond to a request for comment.\nIsfahan also is home to sites associated with Iran’s nuclear programme, including its underground Natanz enrichment site, which has been repeatedly targeted by suspected Israeli sabotage attacks.\nThe United Nations’ nuclear watchdog, the International Atomic Energy Agency (IAEA), also said “there is no damage to Iran’s nuclear sites” after the incident.\nIAEA can confirm that there is no damage to #Iran’s nuclear sites."}, {"id": "1a34c941-d71a-4a52-9b68-153e03234129", "title": "Israel shoots down hundreds of drones and missiles launched by Iran", "date": "2024-06-15 04:45", "url": "http://www.myanmarmuslim.net/news/20240615134d599857.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israel's military spokesperson, Rear Admiral Daniel Hagari, said Iran launched dozens of ground-to-ground missiles at Israel, most of them intercepted outside Israeli borders.\nThe Iranian salvo of more than 300 drones and missiles caused light damage to one Israeli military facility, Hagari said.\nDemonstrators gathered in front of the British Embassy in Tehran after Iran launched a drone and missile attack on Israel.\nUnited Nations Secretary-General Antonio Guterres condemned Iran's attack, saying he was \"deeply alarmed about the very real danger of a devastating region-wide escalation.\"\nThe US military knocked down dozens of drones and missiles bound for Israel, three U.S. officials said."}, {"id": "b5a57a02-76c6-4699-838b-8bbc171b5587", "title": "Houthis strike Greek - owned vessel in Red Sea , 22 Filipino crew members evacuated , one missing", "date": "2024-06-15 07:15", "url": "https://www.firstpost.com/world/houthis-strike-greek-owned-vessel-in-red-sea-22-filipino-members-evacuated-one-missing-13782704.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileThe crew of a Greek-owned vessel had to be evacuated after it was damaged in an attack by Yemen’s militant group Houthi in the Red Sea.\nOne of the crew members from Tutor, the Liberia-flagged coal carrier, remains missing.\nAdvertisementThe Iran-backed group Houthis have claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden, over the past days.\nThe Tutor had 22 crew members onboard and most of them were Filipinos.\nIn March, the Rubymar bulk carrier, carrying thousands of tonnes of fertiliser, sank in the Red Sea after its hull was damaged in a Houthi missile strike."}, {"id": "354a8bc6-8009-4ce2-96ff-beff7084ab1a", "title": "Ukraine war briefing : Kyiv and Moscow exchange attack waves as peace summit set to begin", "date": "2024-06-15 03:00", "url": "https://www.theguardian.com/world/article/2024/jun/15/ukraine-war-briefing-kyiv-and-moscow-exchange-attack-waves-as-peace-summit-set-to-begin", "domain": "theguardian.com", "domain_classification": "International", "message": "Volodymyr Zelenskiy arrived in Switzerland on Friday ahead of a two-day Ukraine peace summit, with dozens of world leaders set to attend, but without Russia.\nGroup of Seven leaders have targeted China’s role in providing assistance to Russia in its war against Ukraine, and its “harmful overcapacity”, despite misgivings from Germany.\nThe strike came as Kyiv and Moscow staged dozens of drone and missile attacks overnight on Thursday and during Friday.\nUkrainian attacks on southern Russia’s Belgorod region killed six people on Friday, officials said.\n“The situation is difficult, but controlled by the defence forces,” the Ukrainian military said in its evening briefing on Friday."}, {"id": "2224e2dc-44a2-4b76-8da4-f4837b5951c7", "title": "US and united kingdom forces bomb Houthi targets in Yemen - Winning Sports Bet", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615179d599764.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US and UK forces have bombed more than a dozen sites used by the Iranian-backed Houthis in Yemen in a massive retaliatory strike using warship-launched Tomahawk missiles and fighter jets, US officials said.\nThe military targets included logistical hubs, air defence systems and weapons storage locations.\nThe warning appeared to have had at least some short-lived impact, as attacks stopped for several days.\nThe group’s supreme leader Abdel Malek al-Houthi warned on Thursday that any attack on its sites would spark a fierce military response.\nHe said: “The response to any American attack will not only be at the level of the operation that was recently carried out with more than 24 drones and several missiles."}, {"id": "c6e4826f-f7b9-4f93-bec7-f51404471f16", "title": "Hezbollah keeps up pressure on Israel days after commander death", "date": "2024-06-15 13:45", "url": "https://www.yahoo.com/news/hezbollah-keeps-pressure-israel-days-130208923.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Senior Hezbollah commander Taleb Abdallah was killed in an Israeli strike in the village of Jouaiyya on Tuesday, alongside three comrades, a source close to the group had told AFP.\nIsrael and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group's October 7 attack on Israel which triggered war in the Gaza Strip.\nThe Israeli army had confirmed it carried out the strike targeting Abdallah, describing him as \"one of Hezbollah's most senior commanders in southern Lebanon\".\nA source close to Hezbollah and rescuers affiliated with the group said a non-Lebanese man was killed in Aitarun, without providing further details.\nA Lebanese military source said Abdallah was the \"most important\" Hezbollah commander to have been killed since the start of the war."}, {"id": "71ff6531-3329-43ab-82b4-2d7164ecce40", "title": "Paramedics among the 16 killed by Israeli airstrikes in Lebanon", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615811a599180.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli airstrikes killed nine people in southern Lebanon late on Wednesday, including paramedics who were preparing to respond to the first strike, the state-run National News Agency said.\nIt said the rockets were in response to the deadly strike on the paramedics centre.\nHezbollah’s Islamic health society said two of its paramedics were killed in Teir Harfa while the Islamic Risala scout association, also a paramedic group, said one of its members was killed in the strike on Naqoura.\nIsrael said the earlier strike in Hebbariye killed a member of the Sunni al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nThe Israeli military said the attacker fled the scene following Thursday’s shooting and that forces were conducting searches."}, {"id": "3d0427fe-2ec2-4351-a104-304ee426a1e8", "title": "  Revolutionary Guards killed  in airstrike on Iran consulate in Damascus", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615995c598996.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An Israeli airstrike that demolished Iran’s consulate in Syria killed two Iranian generals and five officers, Syrian and Iranian officials said on Monday.\nThe attack in Syria killed General Ali Reza Zahdi, who led the elite Quds Force in Lebanon and Syria until 2016, according to Iran’s Revolutionary Guard.\nAn Israeli airstrike in a Damascus neighbourhood in December killed a longtime adviser of the Iranian paramilitary Revolutionary Guard in Syria, Seyed Razi Mousavi.\nA similar strike on a building in Damascus in January killed at least five Iranian advisers.\nLast week, airstrikes over the strategic eastern Syrian province of Deir el-Zour near the Iraqi border killed an Iranian adviser."}, {"id": "ba0d2690-832b-4865-9d04-89177043bc84", "title": "US  strikes Yemen - Pro Bet Hub", "date": "2024-06-15 05:15", "url": "http://www.myanmarmuslim.net/news/20240615277c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The strike came as the Iranian-backed Houthis claimed responsibility for a missile attack against the Malta-flagged bulk carrier Zografia, also on Tuesday, in the Red Sea.\nThe attacks, US-led retaliatory strikes and the raid have all raised tensions across the Middle East, which also saw Iran conduct ballistic missile strikes in Iraq and Syria.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nHMS Diamond firing Sea Viper missiles in the Red Sea (Ship’s crew/MoD/Crown Copyright/PA)The US navy ultimately sank the ship carrying the weapons after deeming it unsafe, Central Command said.\nSince November, the Houthis have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas."}, {"id": "6c1e9380-8243-43eb-884e-0f35e601ede0", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-pdo01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "2 hostages killed in Israeli bombing in Rafah: HamasPeople's Daily Online(Xinhua) 09:50, June 15, 2024GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage."}, {"id": "b84c2c79-3d8c-4d47-8d80-958cd9eddd60", "title": "Two More Hostages Killed In Israeli Bombing In Rafah : Palestinian Death Toll Has Risen To 37 , 266", "date": "2024-06-15 02:00", "url": "https://menafn.com/1108334209/Two-More-Hostages-Killed-In-Israeli-Bombing-In-Rafah-Palestinian-Death-Toll-Has-Risen-To-37266", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) GAZA, Jun 15 (NNN-WAFA) – The Al-Qassam Brigades, announced yesterday that, two more Israeli hostages were killed, in Israeli bombing in Rafah city, in the southern Gaza Strip.\nIn a released on Telegram, Al-Qassam Brigades said, the two hostages were killed in an airstrike“a few days ago.”There has been no immediate response from the Zionist army, regarding these developments.\nOn Jun 8, Al-Qassam Brigades said, the Zionist killed several hostages, during its operation to release only four hostages, in the central Gaza Strip.\nAs of yesterday, the Palestinian death toll from the ongoing Palestinian-Israeli conflict has risen to 37,266, with 85,102 others wounded, Hamas-run health authorities said, in a press statement.\nThe Zionist Defence Forces said in a statement yesterday that, it was continuing its operations across the Gaza Strip.– NNN-WAFA"}, {"id": "9a2ec747-57e5-4fd9-a72c-5b4c96d772c7", "title": "Russia Fires Volley Of Missiles At Ukraine , Including Feared Kinzhal", "date": "2024-06-15 04:45", "url": "https://menafn.com/1108334204/Russia-Fires-Volley-Of-Missiles-At-Ukraine-Including-Feared-Kinzhal", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Moscow/Kiev, June 15 (IANS/DPA) The Ukrainian Air Force has reported that Russia launched several on Ukraine using various missiles, including Kinzhal hypersonic missiles.\nThe modern Kinzhal missiles are feared because they are difficult to intercept with current defence systems due to their high speed and explosive power.\nPublic broadcaster Suspilne reported, citing residents, that multiple explosions were heard early Friday in the western Ukrainian region of Khmelnytskyi.\nEarlier in the night, Russia launched a combined airstrike on Ukraine using cruise missiles, rockets, and combat drones.\nThe Ukrainian Air Force said that at least two Kinzhal missiles were used in the assault."}, {"id": "86fee934-d3c1-43e4-b2b5-22d495e8e245", "title": "US destroyer shoots down missile and drones launched by Yemen Houthi rebels", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615480b599517.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A US destroyer shot down drones and a missile in the Red Sea launched towards it by Yemen’s Houthi rebels, officials said.\nThe Houthi attack involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war.\nSmoke poured out of one container aboard the vessel, which also showed scorch marks from the impact of a Houthi missile.\nThe Houthis have been hailing ships over the radio in the Red Sea and the Gulf of Aden as well since launching their attacks."}, {"id": "7c550efd-f3ca-4cd3-b517-1c9ac82f0ced", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nSeparately, the US and Britain announced that they were imposing a new round of sanctions on Iran.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries."}, {"id": "e5d49e9b-e849-44a8-ab64-265c07b22607", "title": "US hints that major response to Iran - Sports Bet Guru", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/2024061590e599853.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "While Iran has denied involvement, Mr Austin said on Thursday that “how much Iran knew or didn’t know, we don’t know.\nBut it really doesn’t matter because Iran sponsors these groups”, adding that “without that facilitation, these kinds of things don’t happen”.\nIn the latest attack, they fired a ballistic missile at a Liberian-flagged container ship on Thursday, US defence officials said.\nThe Houthis claimed that attack also targeted the Koi, though American officials had no immediate information on any attack on Wednesday night.\nThe Houthis hit a commercial vessel with a missile on January 26, sparking a fire that burned for hours."}, {"id": "18bed71a-93e3-4779-b299-444b006d4fc9", "title": "Houthi attack forces crew to abandon coal carrier in Red Sea", "date": "2024-06-15 02:30", "url": "https://www.theguardian.com/world/article/2024/jun/15/houthi-attack-forces-crew-to-abandon-coal-carrier-in-red-sea", "domain": "theguardian.com", "domain_classification": "International", "message": "The crew of a Greek-owned vessel damaged in an attack by Yemen’s Houthi militants has been evacuated and the abandoned ship is drifting in the Red Sea, according to the UK Maritime Trade Operations (UKMTO).\nTutor’s 22 crew members are mostly Filipino, the Philippine Department of Migrant Workers secretary, Hans Cacdac, told a press conference in Manila.\n“We are praying we could find him.”The ship’s Athens-based manager, Evalend Shipping, has not responded to Reuters’ requests for comment.\nThe Houthis’ air and sea campaign has disrupted global shipping, causing delays and costs to cascade through supply chains.\nIn March, the Rubymar bulk carrier, carrying thousands of tonnes of fertiliser, sank in the Red Sea after its hull was damaged in a Houthi missile strike."}, {"id": "3a25334d-51a2-4d85-a795-e7f4d877947b", "title": "Trump promises  great  Iron Dome in US that would be  made in America  ", "date": "2024-06-15 05:00", "url": "https://www.foxnews.com/politics/trump-vows-build-israel-style-great-iron-dome-over-us-re-elected-made-america", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Former President Trump promised to build a \"great\" Iron Dome for the U.S. during his birthday rally in Florida, saying that it would be \"made in America.\"\n\"By next term we will build a great Iron Dome over our country,\" Trump said at his 78th birthday soirée at Club 47 in West Palm Beach on Friday evening.\nTrump said his proposed Iron Dome will be made in America and that it will create \"beautiful\" opportunities for young people.\n\"We're going to have a big, beautiful Iron Dome.\"\nIsrael's missile defense system, or Iron Dome, is largely funded by the United States."}, {"id": "289964f9-e810-4f7a-a955-2112894031d1", "title": "Ukraine use of a Patriot missile system to down Russia prized A - 50 spy plane was  historic , said a US air defense officer", "date": "2024-06-15 13:00", "url": "https://www.yahoo.com/news/ukraines-patriot-missile-system-down-115141582.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's use of a Patriot missile system to down Russia's prized A-50 spy plane was 'historic,' said a US air defense officerUkraine's use of a Patriot missile system to down Russia's prized A-50 spy plane was 'historic,' said a US air defense officerUkraine used a Patriot missile to down a prized Russian A-50 spy plane earlier this year.\nA senior US Army officer has confirmed that Ukraine used a Patriot missile system to down a Russian A-50 spy plane back in January.\nUkraine used a Patriot to down the A-50 spy plane in January 2024.\nAnthony Sweeney/US ArmyThe A-50, produced by manufacturer Beriev, is a crucial spy plane that allows Russia to detect incoming Ukrainian missiles and identify ground targets.\nThe aircraft can also act as a mobile command-and-control center to direct Russia's air strikes and other attacks."}, {"id": "c740b655-8a50-4c94-960e-b0e1edf6151d", "title": "Ukraine use of a Patriot missile system to down Russia prized A - 50 spy plane was  historic , said a US air defense officer", "date": "2024-06-15 13:00", "url": "https://www.yahoo.com/news/ukraines-patriot-missile-system-down-115141148.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's use of a Patriot missile system to down Russia's prized A-50 spy plane was 'historic,' said a US air defense officerUkraine's use of a Patriot missile system to down Russia's prized A-50 spy plane was 'historic,' said a US air defense officerUkraine used a Patriot missile to down a prized Russian A-50 spy plane earlier this year.\nA senior US Army officer has confirmed that Ukraine used a Patriot missile system to down a Russian A-50 spy plane back in January.\nUkraine used a Patriot to down the A-50 spy plane in January 2024.\nAnthony Sweeney/US ArmyThe A-50, produced by manufacturer Beriev, is a crucial spy plane that allows Russia to detect incoming Ukrainian missiles and identify ground targets.\nThe aircraft can also act as a mobile command-and-control center to direct Russia's air strikes and other attacks."}, {"id": "f1422d27-01ea-4c68-8552-05244550a3c7", "title": "Yemen Houthi rebels fire missile at US warship in Red Sea", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615133b599810.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A US fighter jet has shot down a cruise missile fired towards an American destroyer in the Red Sea by Yemen’s Houthi rebels, officials said.\nThe missile came from near Hodeida, a Red Sea port city long held by the Houthis, the US said.\nShipping through the Red Sea has slowed over the attacks.\nThe Americans and the United Kingdom did not acknowledge conducting any strike – suggesting the blast may have been from a misfiring Houthi missile.\nSince November, the rebels have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas."}, {"id": "18aae131-7342-46d4-af2a-8be6d3df3778", "title": "Trump vows to build Israel - style  Great Iron Dome  over US if re - elected :  Made in America  ", "date": "2024-06-15 06:45", "url": "https://www.yahoo.com/news/trump-vows-build-israel-style-040138387.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump vows to build Israel-style 'Great Iron Dome' over US if re-elected: 'Made in America'Former President Trump promised to build a \"great\" Iron Dome for the U.S. during his birthday rally in Florida, saying that it would be \"made in America.\"\nTrump said his proposed Iron Dome will be made in America and that it will create \"beautiful\" opportunities for young people.\nIsrael's missile defense system, or Iron Dome, is largely funded by the United States.\nSince its creation in 2011, the Iron Dome has rebuffed and destroyed rockets from Hamas militants, Palestinian forces and Iranian drones and missiles.\nOriginal article source: Trump vows to build Israel-style 'Great Iron Dome' over US if re-elected: 'Made in America'"}, {"id": "0f074649-bc5b-43a2-ab69-fe14770dc62d", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas", "date": "2024-06-15 03:15", "url": "https://www.siasat.com/2-hostages-killed-in-israeli-bombing-in-rafah-hamas-3045146/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Gaza: Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in an Israeli bombing in Rafah city in the southern Gaza Strip.\nAl-Qassam Brigades said the two hostages were killed in an airstrike “a few days ago”, Xinhua news agency reported, citing a video released on Telegram.\nAlso Read Palestine’s first Olympian Majed Abu Maraheel dies in GazaThere has been no immediate response from the Israeli army regarding these developments.\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on October 7, 2023, during which about 1,200 people were killed and around 250 taken hostage."}, {"id": "39070471-81ad-403e-a7cb-aef6a5560510", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:15", "url": "https://finance.yahoo.com/news/us-military-targets-houthi-radar-044138487.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "1db4e230-6328-4aa8-8450-620b2c63516a", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:00", "url": "https://www.yahoo.com/news/us-military-targets-houthi-radar-044138426.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "bea777c3-f8c5-4142-9d31-b3b469f58e49", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://apnews.com/article/yemen-houthi-israel-hamas-red-sea-shipping-ab6fee82e73170b7e2edbab90ed6c14c", "domain": "apnews.com", "domain_classification": "International", "message": "DUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "c1191e16-1509-45ae-8778-deb5702c561c", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:15", "url": "https://www.startribune.com/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/600373737/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n''These radars allow the Houthis to target maritime vessels and endanger commercial shipping,'' Central Command said in a statement.\n''The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,'' Central Command said.\nThe missing sailor is Filipino, according to the state-run Philippine News Agency, which cited Migrant Workers Secretary Hans Leo Cacdac."}, {"id": "7e755652-11ce-4d7f-89de-457d5e6634d9", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:15", "url": "https://www.clickondetroit.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement."}, {"id": "af806b1b-2a13-4e30-88f4-bd0839dc9842", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:00", "url": "https://www.news4jax.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement."}, {"id": "882e0228-fe02-4350-a6eb-6ec2c88f4658", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing – Metro US", "date": "2024-06-15 07:30", "url": "https://www.metro.us/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "metro.us", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as “IKE,” in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "7affa42b-684d-459f-b3b3-bc35966ff8cc", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-15 03:30", "url": "http://www.myanmarmuslim.net/news/20240615866a599077.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning."}, {"id": "fcc5bdd8-e440-4a71-b228-41d52e4e55fe", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 08:00", "url": "https://www.wfmz.com/news/ap/ap-business/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_b4e26050-09ef-5db0-bf51-7e54322b9cd9.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat's what its leaders and experts tell The Associated Press, whose journalists visited U.S. ships off Yemen in recent days."}, {"id": "9d2a2b54-a91d-4c1b-b2b2-077cd1ec5e4c", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://www.news-gazette.com/news/nation-world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_65c89ae3-3681-566c-8435-e89a2f6a9ef5.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor"}, {"id": "288829e8-4d9c-444a-9d0f-efb9b9f34f02", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 10:15", "url": "https://www.ajc.com/news/nation-world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/4RYIQHV72FFETC2YBVO663BTPU/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "2f81e3a5-cafe-475e-b564-aef6c63b9209", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:00", "url": "https://www.wsls.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement."}, {"id": "ac2d8146-a4d0-4ba8-883b-ab78a37d9cb8", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:45", "url": "https://www.smdailyjournal.com/business/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_3f2b5f8a-b0b0-5954-9b0e-7fb260861dd8.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "f53de07d-2212-463e-b814-cc7d63b08492", "title": "The US Navy is facing its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-15 02:00", "url": "https://apnews.com/article/us-navy-yemen-houthis-israel-war-7a9997f9d84ac669fae69ecf819913fb", "domain": "apnews.com", "domain_classification": "International", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said."}, {"id": "c0800859-ad0a-436c-805b-d4315706a16d", "title": "Seven Lebanese and an Israeli killed in exchange of fire along border", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615884a599107.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An Israeli air strike on a paramedics centre linked to a Lebanese Sunni Muslim group in south Lebanon has killed seven of its members, officials said.\nThe air strike after midnight on Tuesday hit an office of the Islamic Emergency and Relief Corps, according to the Lebanese Ambulance Association.\nThe Israeli air strike was linked to a Lebanese Sunni Muslim group (AP)The paramedics association listed the names of seven volunteers who were killed in the strike.\nThe Israeli military said it struck a military building in Hebbariye and killed a member of Lebanon’s Sunni Muslim al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nAround 30 rockets were launched from Lebanon toward northern Israel, according to the Israeli military."}, {"id": "0d256512-c281-49ac-810b-6498d6723f6f", "title": "Israel closes airspace as it braces for Iranian drone attack", "date": "2024-06-15 03:15", "url": "http://www.myanmarmuslim.net/news/20240615131c599860.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran had been threatening to attack Israel since an airstrike last week killed two Iranian generals in Syria.\nIsrael has not commented on that attack, but Iran accused it of being behind it.\nThe White House said it would provide unspecified support for Israel’s defence against the ongoing attack.\nPresident Joe Biden was set to convene a principals meeting of the National Security Council to discuss the unfolding attack, the White House said.\nMr Biden had cut short a weekend trip to his beach house in Delaware to return to the White House and monitor the situation."}, {"id": "806713aa-5f64-4e1a-8fac-39e1006e5cff", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 12:30", "url": "https://www.cbsnews.com/news/us-military-houthi-radar-sites-yemen-merchant-sailor-missing/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n\"These radars allow the Houthis to target maritime vessels and endanger commercial shipping,\" Central Command said in a statement.\n\"The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,\" Central Command said.\nThe missing sailor is Filipino, according to the state-run Philippine News Agency, which cited Migrant Workers Secretary Hans Leo Cacdac."}, {"id": "0eb2c4ce-9f05-4353-a38b-d3206e9c1446", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 14:15", "url": "https://www.cbsnews.com/sanfrancisco/news/us-military-houthi-radar-sites-yemen-merchant-sailor-missing/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Houthi attacks disrupting global supply chain Houthi Red Sea attacks disrupting global supply chain 04:14The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n\"These radars allow the Houthis to target maritime vessels and endanger commercial shipping,\" Central Command said in a statement.\n\"The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,\" Central Command said.\nThe \"Tutor remains in the Red Sea and is slowly taking on water.\""}, {"id": "b3930df7-7e60-41f7-affc-d3637174e25f", "title": "U . S . military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 08:00", "url": "https://www.thehindu.com/news/international/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article68292544.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "90b4b455-4416-44eb-8007-50c9dfefe0e2", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:45", "url": "https://isp.netscape.com/news/world/story/0001/20240615/ab6fee82e73170b7e2edbab90ed6c14c", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingDUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "64eb3ce5-18cd-4774-afb1-2824600648f4", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:00", "url": "https://www.whec.com/national-world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "7b247b98-d327-449f-b561-ef19856f853d", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 10:15", "url": "https://www.pressdemocrat.com/article/trending/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goe/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "0a655a3b-60b4-4731-81b4-352488fd214c", "title": "Undercover Oakland cops say they witnessed a pimp beating a woman with a gun on International Boulevard , then get away after police chase", "date": "2024-06-15 00:00", "url": "https://www.mercurynews.com/2024/06/14/undercover-oakland-cops-say-they-witnessed-a-pimp-beating-a-woman-with-a-gun-on-international-boulevard-then-get-away-after-police-chase/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "Clarence “C-Money” Brown III, 29, was charged with assault with a deadly weapon, pandering and being a felon in possession of a firearm.\nHe is being held at Santa Rita Jail in Dublin without bail, with a preliminary hearing set to start on Tuesday.\nOn the night of May 30, undercover Oakland police officers were doing surveillance when they reportedly witnessed Brown striking a woman with a pistol and holding the gun to her head.\nThe officers said in court records that they gave chase but the woman — later identified by police as 34-year-old Brittany Rivera — sped away and escaped.\nWhen Rivera showed up to an Oakland courthouse to watch Brown’s arraignment on June 5, she was also arrested, and later charged with accessory after the fact."}, {"id": "1513b49b-4169-415a-a4f4-2c07f027e0b3", "title": "Ship targeted by missile fire in the Red Sea - Precision Bet Tips", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615091c599906.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Missile fire apparently targeted a ship off Yemen in the Red Sea on Friday.\nThe vessel’s captain reported an explosion near the ship in the Red Sea off the Yemeni city of Mocha, the British military’s United Kingdom Maritime Trade Organisation (UKMTO) centre said.\nIt did not immediately identify the vessel targeted.\nSince November, the rebels have repeatedly targeted ships in the Red Sea over Israel’s offensive in Gaza.\nIt described hitting three mobile anti-ship cruise missiles in Houthi-controlled territory that “were prepared to launch against ships in the Red Sea”."}, {"id": "62b99203-ca4e-41cc-9c26-200a8badc955", "title": "Ship targeted by missile fire in the Red Sea", "date": "2024-06-15 02:30", "url": "http://www.myanmarmuslim.net/news/20240615936f599056.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Missile fire apparently targeted a ship off Yemen in the Red Sea on Friday.\nThe vessel’s captain reported an explosion near the ship in the Red Sea off the Yemeni city of Mocha, the British military’s United Kingdom Maritime Trade Organisation (UKMTO) centre said.\nIt did not immediately identify the vessel targeted.\nSince November, the rebels have repeatedly targeted ships in the Red Sea over Israel’s offensive in Gaza.\nIt described hitting three mobile anti-ship cruise missiles in Houthi-controlled territory that “were prepared to launch against ships in the Red Sea”."}, {"id": "db119d0c-af11-42d2-ac91-69033039bf1d", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 08:00", "url": "https://www.yakimaherald.com/news/nation_and_world/business/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_9c25c32e-9d09-5356-ac1b-bc0e315b9b5e.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat's what its leaders and experts tell The Associated Press, whose journalists visited U.S. ships off Yemen in recent days."}, {"id": "dd82a4d5-d924-4a0e-9626-5867e96d1e0e", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-15 13:30", "url": "https://m.lasvegassun.com/news/2024/jun/14/us-navy-faces-its-most-intense-combat-since-world/", "domain": "m.lasvegassun.com", "domain_classification": "Unknown", "message": "US Navy faces its most intense combat since World War II against Yemen’s Iran-backed Houthi rebelsBernat Armangue / APABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nSea combat in the Mideast remains risky, something the Navy knows well.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said.\nMeanwhile, the Houthi attacks continue to depress shipping through the region."}, {"id": "9aad2f58-1c67-4a95-bc98-1579fb0d45ce", "title": "Undercover Oakland cops say they witnessed a pimp beating a woman with a gun on International Boulevard , then get away after police chase", "date": "2024-06-15 00:00", "url": "https://www.eastbaytimes.com/2024/06/14/undercover-oakland-cops-say-they-witnessed-a-pimp-beating-a-woman-with-a-gun-on-international-boulevard-then-get-away-after-police-chase/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Clarence “C-Money” Brown III, 29, was charged with assault with a deadly weapon, pandering and being a felon in possession of a firearm.\nHe is being held at Santa Rita Jail in Dublin without bail, with a preliminary hearing set to start on Tuesday.\nOn the night of May 30, undercover Oakland police officers were doing surveillance when they reportedly witnessed Brown striking a woman with a pistol and holding the gun to her head.\nThe officers said in court records that they gave chase but the woman — later identified by police as 34-year-old Brittany Rivera — sped away and escaped.\nWhen Rivera showed up to an Oakland courthouse to watch Brown’s arraignment on June 5, she was also arrested, and later charged with accessory after the fact."}, {"id": "19d98cbe-ca45-4b58-ba96-9df0acce4da2", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-15 03:00", "url": "https://www.santafenewmexican.com/ap/international/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed/article_9c95933a-416d-5ccb-8103-2205c3eb5890.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "a64e3a33-ad73-49e4-8096-50d2b695465a", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:45", "url": "https://www.durangoherald.com/articles/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×DUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "f36c45ba-9dd3-4b4b-bc8a-775396b16e1d", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-15 01:00", "url": "https://lasvegassun.com/news/2024/jun/14/us-navy-faces-its-most-intense-combat-since-world/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "US Navy faces its most intense combat since World War II against Yemen’s Iran-backed Houthi rebelsBernat Armangue / APABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nSea combat in the Mideast remains risky, something the Navy knows well.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said.\nMeanwhile, the Houthi attacks continue to depress shipping through the region."}, {"id": "c26eafad-fd4e-4317-8fed-03e340c00053", "title": "Ukraine pummels Russia air force in  precision  strike | World | News", "date": "2024-06-15 07:15", "url": "https://www.express.co.uk/news/world/1911515/ukraine-russia-ukraine-vladimir-putin-volodymyr-zelensky", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin has reportedly lost two more SU-34 fighter-bombersUkraine has hit a Russian military airfield with precision weapons, an insider has said, as part of “a sustained campaign to degrade the Russian Air Force”.\nThey added: \"The targets were struck to degrade Russia's ability to conduct airstrikes on [the northeastern region of] Kharkiv.\n\"This strike will impede Russia's ability to conduct such strikes in the future and allow UAF [Ukrainian armed forces] troops to push back RGF with a reduced threat of air attack.\"\nHe explained: “For too long, Ukraine has had to fight the invading Russians with one hand tied behind its back.\n“One of only six which can fire Russia’s own ‘wonder weapon’ – a hypersonic missile – the strike was a powerful sign of Kyiv’s increasing power.\""}, {"id": "02a0cff4-6a90-41d1-a763-1eadca981102", "title": "Navy facing its most intense combat since World War II | Nation and World", "date": "2024-06-15 03:30", "url": "https://www.reviewjournal.com/news/nation-and-world/us-navy-faces-its-most-intense-combat-since-world-war-ii-3069321/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "The U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II."}, {"id": "01d56462-6b6d-4ba6-b668-a6308d3f60d5", "title": "Yemen Houthi rebels claim downing of US Reaper drone", "date": "2024-06-15 11:15", "url": "http://www.myanmarmuslim.net/news/20240615431c599560.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have claimed to have shot down another of the US military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening on Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on October 7th, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a US-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week."}, {"id": "97bf1fec-aeeb-4e6d-b5f0-ac760d7da0c8", "title": "What can be learned from Hamas and Hezbollah use of drones in this war", "date": "2024-06-15 10:15", "url": "https://www.jpost.com/israel-hamas-war/article-806302", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The State Comptroller's reports in 2017 and 2021 pointed to the gaps and readiness in Israel for the drone threat that also characterized the southern front when Hamas tested the nerves of the commanders of the Gaza Division and the Southern Command.\nThey were joined by a very significant threat, racing drones (FPV) controlled by remote control with special glasses.\nTherefore, it is a challenge for all the parties involved to identify and intercept them: the control system, the air defense, combat helicopters, and fighter planes that shoot them down.\nAir Force officials confirmed that everything happening on the northern front was part of the IDF's threat attribution.\nIt can happen at any given moment,\" said an Air Force official."}, {"id": "79f19b60-04ad-4474-91f4-622c5b642f27", "title": "US and united kingdom strike Houthi sites in Yemen amid surge in Red Sea attacks on ships", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615146e599851.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The US F/A-18 fighter jets launched from the USS Dwight D Eisenhower aircraft carrier, which is currently in the Red Sea, officials said.\nMr Shapps said it came after “severe Houthi attacks against commercial ships in the Red Sea and Gulf of Aden, including against the British-owned MV Islander and the MV Rubymar, which forced the crew to abandon ship”.\nPresident Joe Biden and other senior leaders have repeatedly warned that the US will not tolerate the Houthi attacks against commercial shipping.\nCentral Command launched attacks on Houthi-held areas in Yemen on Friday, destroying seven mobile anti-ship cruise missiles that the military said were prepared to launch towards the Red Sea.\nThe Rubymar, a British-registered, Lebanese-operated cargo vessel, was attacked while sailing through the Bab el-Mandeb Strait that connects the Red Sea and the Gulf of Aden."}, {"id": "4150318c-643c-4c0a-993d-828eede74172", "title": "US and united kingdom strike Houthi sites in Yemen amid surge in Red Sea attacks on ships", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615181a599811.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The US F/A-18 fighter jets launched from the USS Dwight D Eisenhower aircraft carrier, which is currently in the Red Sea, officials said.\nMr Shapps said it came after “severe Houthi attacks against commercial ships in the Red Sea and Gulf of Aden, including against the British-owned MV Islander and the MV Rubymar, which forced the crew to abandon ship”.\nPresident Joe Biden and other senior leaders have repeatedly warned that the US will not tolerate the Houthi attacks against commercial shipping.\nCentral Command launched attacks on Houthi-held areas in Yemen on Friday, destroying seven mobile anti-ship cruise missiles that the military said were prepared to launch towards the Red Sea.\nThe Rubymar, a British-registered, Lebanese-operated cargo vessel, was attacked while sailing through the Bab el-Mandeb Strait that connects the Red Sea and the Gulf of Aden."}, {"id": "ef8602ab-7d85-4cc1-982b-e27774b73465", "title": "Israeli strikes kill multiple civilians at shelters in Gaza combat zone", "date": "2024-06-15 02:30", "url": "http://www.myanmarmuslim.net/news/2024061522c599923.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli military strikes have killed multiple civilians at a UN shelter and hospital in the Gaza Strip’s main combat zone.\nLarge columns of smoke rose from Gaza as Israel’s military said it had encircled Gaza City, the target of its offensive to crush Hamas.\nPalestinians comfort a crying man after he lost relatives under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians strike the concrete while looking for survivors under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians inspect the damage of a house destroyed by an Israeli airstrike in Gaza City on Saturday."}, {"id": "c00ddd1f-6a41-448d-830d-c8365fe215bf", "title": "Ukraine Patriot Missile Shoot Down of Russian a - 50 Spy Plane Was  Historic  ", "date": "2024-06-15 13:00", "url": "https://www.businessinsider.com/ukraine-uses-patriot-missiles-down-russian-a50-spy-plane-us-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Ukraine used a Patriot missile to down a prized Russian A-50 spy plane earlier this year.\nThe hi-tech A-50 is crucial for Russia's early warning, command, and control during air operations.\nA senior US officer called the destruction of the A-50 a 'SAMbush.'\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementA senior US Army officer has confirmed that Ukraine used a Patriot missile system to down a Russian A-50 spy plane back in January."}, {"id": "9fe6d870-aabb-4977-8800-fd033a94dd80", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing – Winnipeg Free Press", "date": "2024-06-15 05:15", "url": "https://www.winnipegfreepress.com/business/2024/06/14/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\nA fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "5d97327e-559f-479b-bb3b-93b3c78b9098", "title": "US Navy says faces  most intense  combat since World War II against Yemenis", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-presstv02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Navy says faces 'most intense' combat since World War II against YemenisIran Press TVFriday, 14 June 2024 7:26 PMThe US-led campaign to protect Israeli interests in the Red Sea has escalated into the \"most intense\" running sea battle the Navy has faced since World War II, according to an AP report quoting American military commanders and experts.\nEric Blomberg told the AP aboard the USS Laboon warship in the Red Sea.\nBryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute, told the AP, \"this is the most sustained combat that the US Navy has seen since World War II.\"\nYemen initiated its naval operations in the Red Sea in October to help bring the US-Israeli genocide in Gaza to a halt.\nThe Yemeni leader vowed that they will continue to target American warships in the Red Sea and beyond, including the aircraft carrier USS Dwight D. Eisenhower."}, {"id": "315d63c9-c244-4f7f-8115-fea925d95f58", "title": "Iranian commander renews vow to avenge Syria strike that killed two generals", "date": "2024-06-15 09:15", "url": "http://www.myanmarmuslim.net/news/20240615186e599812.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A top military commander on Saturday renewed Iran’s promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two Iranian generals.\nGeneral Mohammad Bagheri, Iran’s joint chief of staff, told mourners gathered for the funeral of general Mohammad Reza Zahdi that Iran will decide when and how to stage an “operation” to take revenge.\nGen Zahdi was the highest ranking commander killed in Monday’s attack.\nIn all, 12 people were killed in the strike – seven Iranian Revolutionary Guard members, four Syrians and a Hezbollah militia member.\nTensions have flared against the backdrop of the six-month-old Israel-Hamas war in Gaza, and raised renewed fears of a broader regional conflict."}, {"id": "8af5fffd-d174-49f3-9b4f-4ec8a79c3a33", "title": "Man who randomly stabbed Mexican tourist at Tim Hortons back living in Vancouver - BC", "date": "2024-06-15 00:15", "url": "https://globalnews.ca/news/10567969/vancouver-police-warning-david-morin/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailThe man who randomly stabbed a Mexican tourist in a Vancouver Tim Hortons two years ago has been released from prison and is back living in the city.\nVancouver police“He was convicted of an extremely violent, unprovoked assault,” Vancouver police Sgt.\n2:04 Suspect in downtown Vancouver coffee shop stabbing known to policeThe 25-year-old victim was waiting in line when a man approached him from behind and “repeatedly stabbed him” in the back, Vancouver police said at the time.\nMorin has faced numerous charges dating back to 2012, including assault, assault with a weapon, assault causing bodily harm, sexual assault, uttering threats and unlawful confinement.\nStory continues below advertisement0:40 Man critically injured in downtown Vancouver coffee shop stabbingMorin has been ordered to live in a Vancouver halfway house, and Addison said he has been released under numerous conditions."}, {"id": "e7b503bc-cb65-43ed-a131-21cb85fad154", "title": "Man with  far - right tie arrested for knife attacks on two children in Finland", "date": "2024-06-15 03:15", "url": "https://www.yahoo.com/news/man-far-ties-arrested-knife-180059605.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Man with 'far-right ties' arrested for knife attacks on two children in FinlandMan with 'far-right ties' arrested for knife attacks on two children in FinlandA man suspected of stabbing and seriously wounding a 12-year-old in Finland has been arrested on Thursday.\nFinnish public broadcaster Yle reported that intelligence officials have identified the 33-year-old suspect as having ties to far-right extremism.\n\"A man born in 1990 is suspected of having stabbed the 12-year-old victim from behind several times.\nAfter that he tried to go after a minor who was in the company of the other victim of stabbing,\" the police statement said.\n\"Far-right violence is a real threat in Finland."}, {"id": "8316a9c0-65f4-4818-b982-a07e6b1296bf", "title": "Russia fires volley of missiles at Ukraine , including feared Kinzhal", "date": "2024-06-15 09:15", "url": "https://www.mangalorean.com/russia-fires-volley-of-missiles-at-ukraine-including-feared-kinzhal/", "domain": "mangalorean.com", "domain_classification": "Unknown", "message": "Russia fires volley of missiles at Ukraine, including feared KinzhalMoscow/Kiev: The Ukrainian Air Force has reported that Russia launched several attacks on Ukraine using various missiles, including Kinzhal hypersonic missiles.\nThe modern Kinzhal missiles are feared because they are difficult to intercept with current defence systems due to their high speed and explosive power.\nPublic broadcaster Suspilne reported, citing residents, that multiple explosions were heard early Friday in the western Ukrainian region of Khmelnytskyi.\nEarlier in the night, Russia launched a combined airstrike on Ukraine using cruise missiles, rockets, and combat drones.\nThe Ukrainian Air Force said that at least two Kinzhal missiles were used in the assault."}, {"id": "3c5cf5c5-8759-41ae-8584-0cb201560ce8", "title": "Greek - owned coal carrier attacked by Yemeni Houthi militants in Red Sea , search for missing sailor continues", "date": "2024-06-15 06:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/greek-owned-coal-carrier-attacked-by-yemeni-houthi-militants-in-red-sea-search-for-missing-sailor-continues/articleshow/111014182.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: The crew of the Greek-owned coal carrier , Tutor, was evacuated after an attack by Yemeni Houthi militants caused significant damage to the vessel, leaving it adrift in the Red Sea , according to reports from the United Kingdom Maritime Trade Operations (UKMTO) and the Philippine migrant workers minister.Hans Leo Cacdac, the Philippines ' migrant workers minister, said on Saturday that efforts are underway to locate one missing sailor and initiate salvage operations for the Liberia-flagged ship.\nThe incident is part of a troubling pattern, marking the third Houthi attack on a ship crewed by Filipino sailors in the past year.\nPrevious attacks resulted in the deaths of two Filipino seafarers and the capture of 17 others, government data shows.The Houthi militants, aligned with Iran, have claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden.\nThese assaults are part of a broader campaign by the Houthis, who have targeted ships in the Red Sea, Bab al-Mandab Strait, and the Gulf of Aden since November, citing solidarity with Palestinians in the Gaza conflict.\nThe missing sailor is believed to be trapped in the engine room, according to maritime sources and the Philippine migrant workers ministry.Cacdac mentioned that Tutor, carrying 80,000 tonnes of coal, is stable and can be safely towed."}, {"id": "64a4abc1-2173-4e10-a051-03e8123f384f", "title": "Woman arrested for fatal stabbing across from Port Authority Bus Terminal", "date": "2024-06-15 00:00", "url": "https://www.yahoo.com/news/woman-arrested-fatal-stabbing-across-231200446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Cops charged a 22-year-old woman with first-degree murder Friday in the stabbing death of another woman during a wild brawl across from Manhattan’s Port Authority Bus Terminal earlier this week.\nThe bystanders steered clear of the brawl until Lopez started stabbing Walston, at which point a man in a white shirt could be seen grabbing her arm.\nLopez has nine prior arrests on charges including assault, robbery, and drug possession.\nHer most arrest was from a May 7 assault in the Bronx where cops say she and her brother beat an ex-girlfriend of his.\nWalston’s last known address was an uptown Manhattan homeless shelter, police said."}, {"id": "1cb3ca94-61fe-4d0c-b682-4df4f414d2c8", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas - People Daily Online", "date": "2024-06-15 02:30", "url": "http://en.people.cn/n3/2024/0615/c90000-20181651.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "2 hostages killed in Israeli bombing in Rafah: HamasXinhua) 09:50, June 15, 2024Smoke rises in Rafah city in the southern Gaza Strip, May 28, 2024.\n(Photo by Khaled Omar/Xinhua)GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nSmoke rises following Israeli strikes in the southern Gaza Strip city of Rafah, on May 14, 2024."}, {"id": "9419d00b-c2ec-421a-aa18-a81132b46e8e", "title": "Iran accuses US of giving Israel  green light  for consulate attack", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615024e599967.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran’s foreign minister on Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nNasrallah said Gen Zahedi’s first involvement was until 2002, overseeing Israel’s withdrawal from southern Lebanon, and helping Hezbollah scale up.\nGen Zahedi’s final stint began in 2020 and ended when he was killed.\nHezbollah militants and Israeli troops have clashed along the tense Lebanon-Israel border since October 8, the day after the Hamas attack on southern Israel."}, {"id": "f18c8a7e-a40a-44a4-ab19-31c5d57578c6", "title": "South Korean and US troops will begin major exercises next week", "date": "2024-06-15 01:15", "url": "http://www.myanmarmuslim.net/news/20240615146d599846.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korean and US troops will begin their expanded annual military drills next week in response to North Korea’s evolving nuclear threats, the two countries said.\nWhile it is unlikely for North Korea to launch full-blown attacks against South Korea and the US, observers say the North could still stage limited provocations along the tense border with South Korea.\nMr Lee, the South Korean military spokesperson, said that the upcoming South Korea-US drills would involve training to detect and shoot down North Korean cruise missiles.\nThey expect North Korea to ramp up its testing activities and other provocations this year as both the US and South Korea head into major elections.\nThe Pentagon said Mr Austin reaffirmed the ironclad US extended deterrence commitment to the defence of South Korea."}, {"id": "228253bf-160f-41f8-bd66-36ea0bcaa7a6", "title": "US and South Korea fly warplanes in interception drill after North missile tests", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615128c599869.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korea and the United States have flown advanced stealth fighters in a joint missile-interception drill over the Korean Peninsula, South Korea’s Air Force said.\nThe drill was an apparent response to a spate of weapons tests this year by rival North Korea.\nNorth Korea has conducted six rounds of missile tests so far this year, most of them reportedly involving cruise missiles that typically fly at a low altitude to overcome opponents’ missile defences.\nSouth Korea and the US have responded by expanding their military exercises and trilateral training involving Japan.\nSouth Korean Air Force F-35A fighter jets prepare to take off from a South Korean Air Force base in Cheongju, South Korea (South Korea Defence Ministry via AP)This year, North Korea is expected to step up its testing activities and belligerent rhetoric as both the US and South Korea head into elections."}, {"id": "7e789bfe-a9bb-4eed-be85-2abe049e3f86", "title": "Crisis on the Red Sea : Yemeni Militant Attacks Disrupt Global Shipping", "date": "2024-06-15 00:30", "url": "https://www.devdiscourse.com/article/headlines/2983560-crisis-on-the-red-sea-yemeni-militants-attacks-disrupt-global-shipping", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Iran-aligned Houthis claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden, over the past days.\nTheir attacks also damaged two other ships in the last week, \"marking a significant increase in effectiveness,\" British security firm Ambrey said.\nThey have sunk one ship, seized another vessel and killed three seafarers in separate attacks.\nThe Houthis' air and sea campaign has disrupted global shipping, causing delays and costs to cascade through supply chains.\n\"We demand that all involved parties cease their deliberate and targeted attacks on innocent seafarers with immediate effect,\" it said."}, {"id": "36531ac9-63fa-44df-a1de-d0621e7a247c", "title": "Gangs try to seize control of Haiti main airport in latest attack on key sites", "date": "2024-06-15 04:00", "url": "http://www.myanmarmuslim.net/news/20240615266c599726.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Heavily armed gangs have tried to seize control of Haiti’s main international airport, exchanging gunfire with police and soldiers in the latest attack on key government sites in an explosion of violence that includes a mass escape from the country’s prisons.\nIt is the biggest attack on the airport in Haiti’s history.\nLast week, the airport was struck briefly by bullets amid ongoing gang attacks, but gangs did not enter the airport nor seize control of it.\nHaiti’s National Police has roughly 9,000 officers to provide security for more than 11 million people, according to the UN.\nThe prime minister, a neurosurgeon, has shrugged off calls for him to resign and did not comment when asked if he felt it was safe to come home."}, {"id": "efb25025-b040-4005-be2d-92e9654de6f3", "title": "Islamic Resistance in Iraq  behind strike that killed three US troops in Jordan  ", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615568d599375.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The United States has attributed the drone attack that killed three US service members in Jordan to the Islamic Resistance in Iraq, an umbrella group of Iran-backed militias, as US president Joe Biden weighs his response options to the strike.\nNational Security Council spokesperson John Kirby said the US believes the attack was planned, resourced and facilitated by the Islamic Resistance in Iraq, an umbrella group that includes the militant group Kataib Hizbullah.\nAny additional American strikes could further inflame a region already stirred by Israel’s ongoing war on Hamas in the Gaza Strip.\nSome observers fear a new round of strikes targeting Iran could tip the region into a wider war.\nBut Iran’s government has taken note of the US threats of retaliation for the attack on the base in Jordan."}, {"id": "2234f907-4654-4159-bdc6-d126e44d4418", "title": "Dozens of Palestinians killed in Israeli strikes on southern Gaza", "date": "2024-06-15 12:45", "url": "http://www.myanmarmuslim.net/news/20240615563e599381.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In central Gaza, at least 15 people were killed in strikes overnight, according to hospital records.\nThe war began after Hamas and other militants killed 1,200 people, mostly civilians, in Israel and abducted 240 others.\nIsrael’s military says 131 of its soldiers have been killed in the Gaza ground offensive.\nThere was no immediate comment from the Israeli military.\nThe Palestinian territory has been completely sealed off since Israel declared war on Hamas more than two months ago."}, {"id": "e2b0b285-8669-4232-af5d-535d47107dad", "title": "Man Charged in Fatal Stabbing in Costa Mesa", "date": "2024-06-15 00:15", "url": "https://mynewsla.com/crime/2024/06/14/man-charged-in-fatal-stabbing-in-costa-mesa/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A 25-year-old man was charged Friday with a fatal stabbing in Costa Mesa.\nIsrael Antonio Valencia, 25, was charged with murder with a sentencing enhancement for the personal use of a deadly weapon.\nAnother suspect arrested in the case — 18-year-old Christopher Mathew Pena — was not charged along with Valencia.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive, according to Roxi Fyad of the Costa Mesa Police Department."}, {"id": "e68bc046-9230-446f-8d1d-5d793751b91e", "title": "25 - Year - Old Man Charged with Murder", "date": "2024-06-15 00:15", "url": "https://mynewsla.com/crime/2024/06/14/man-charged-in-fatal-stabbing-in-costa-mesa-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A 25-year-old man was charged Friday with a fatal stabbing in Costa Mesa.\nIsrael Antonio Valencia, 25, was charged with murder with a sentencing enhancement for the personal use of a deadly weapon.\nAnother suspect arrested in the case — 18-year-old Christopher Mathew Pena — was not charged along with Valencia.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive, according to Roxi Fyad of the Costa Mesa Police Department."}, {"id": "030a95d5-a9da-4a11-97cf-8f84f0fbf695", "title": "Russia launches drone strikes on Ukraine in retaliation for Belgorod attack", "date": "2024-06-15 14:00", "url": "http://www.myanmarmuslim.net/news/20240615894a599049.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia launched a fresh drone assault on Ukraine on Saturday night, after promising that strikes on the Russian border city of Belgorod earlier in the day “would not go unpunished”.\nTwenty-eight people were injured in an attack on the eastern city of Kharkiv, regional governor Oleh Syniehubov said on Sunday.\nIn the Kyiv region that surrounds the capital, a Russian drone attack caused a fire to break out at a critical infrastructure facility, local officials said.\nFirefighters extinguish burning cars after shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said it identified the ammunition used in the strike as Czech-made Vampire rockets and Olkha missiles fitted with cluster-munition warheads.\nIn comments carried by Russian state media, Mr Nebenzya claimed Ukraine had launched “a deliberate act of terrorism directed against civilians”."}, {"id": "69d92dcd-ba77-4e1f-8713-ae8a5d629b13", "title": "Ukraine  sinks Russian warship  in the Black Sea using high", "date": "2024-06-15 10:45", "url": "http://www.myanmarmuslim.net/news/20240615364a599633.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukraine claims it has sunk another Russian warship in the Black Sea using high-tech sea drones as Kyiv’s forces continue to take aim at targets deep behind the war’s front line.\nThe Ukrainian military intelligence agency said a special operations unit destroyed the large patrol ship Sergey Kotov overnight.\nIn the Black Sea, Ukrainian successes against enemy warships have pushed the Russian fleet away from the coast, allowing Ukraine to set up a grain export corridor.\nKyiv officials say some 20% of Russian missile attacks on Ukraine are launched from the Black Sea, and hitting Russian ships there is embarrassing for Moscow.\nIn November, the Russian military threatened to shoot down a French surveillance aircraft patrolling in international airspace."}, {"id": "ce6580cb-5a65-4499-8784-0448531dd6d6", "title": "Israel accused of strike on Iranian consulate in Syria", "date": "2024-06-15 03:15", "url": "http://www.myanmarmuslim.net/news/20240615910e599081.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran and one of its key proxies vowed to respond to a strike, widely attributed to Israel, that demolished Iran’s consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.\nMonday’s strike in Damascus signalled an escalation because it struck an Iranian diplomatic mission.\nThe US National Security Council said the United States played no role in the strike in Damascus and did not know of it ahead of time.\nIt comes as IRNA said Iran holds the United States, Israel’s closest ally, responsible for the strike (AP Photo/Vahid Salemi)Houthi rebels have also been launching long-range missiles toward Israel.\nIRNA said Iran holds the United States, Israel’s closest ally, responsible for the strike."}, {"id": "af13c2f0-0a51-4ba1-94a8-df7711e12024", "title": "Battenfeld : Michelle Wu boasts of a safe Boston hours before Seaport shooting of high school graduate", "date": "2024-06-15 11:30", "url": "https://www.bostonherald.com/2024/06/15/battenfeld-michelle-wu-boasts-of-a-safe-boston-hours-before-seaport-shooting-of-high-school-graduate/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Mayor Michelle Wu boasted about how safe the city is just hours before a shooting of a newly-graduated Boston high school student in broad daylight in the Seaport and a violent beating and stabbing on Boston Common.\nIn a Boston Globe interview, Wu talked about how impressed leaders from other cities are with Boston’s safety.\nOn Thursday night, a group of people reportedly trying to intervene in a road rage incident were stabbed and beaten on Boston Common.\nViolent crime incidents lead to a perception that Boston is a crime zone.\nDoes anyone feel safe walking across Boston Common or deserted Downtown Crossing?"}, {"id": "f29b8e09-18e9-4f82-8f29-b8fe74d1f5cd", "title": "US launches airstrikes in Iraq and Syria in retaliation for drone attack", "date": "2024-06-15 09:15", "url": "http://www.myanmarmuslim.net/news/2024061529f599914.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“This afternoon, at my direction, US military forces struck targets at facilities in Iraq and Syria that the IRGC and affiliated militia use to attack US forces,” Mr Biden said in a statement.\nStrikes in Iraq and SyriaAt 4:00 p.m. (EST) Feb. 02, U.S. Central Command (CENTCOM) forces conducted airstrikes in Iraq and Syria against Iran’s Islamic Revolutionary Guards Corps (IRGC) Quds Force and affiliated militia groups.\nIran has denied it was behind the Jordan attack.\nThe last attack was on January 29 at at al-Asad airbase in Iraq, and there were no injuries or damage.\nTower 22 houses about 350 US troops and sits near the demilitarised zone on the border between Jordan and Syria."}, {"id": "363584c1-0ef0-450e-b69c-11c27af32138", "title": "17 killed as Russian missiles slam into Ukrainian city", "date": "2024-06-15 03:15", "url": "http://www.myanmarmuslim.net/news/20240615202e599789.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Three Russian missiles slammed into a central area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-storey apartment building and killing at least 17 people, local officials said.\nUkrainian President Volodymyr Zelensky has pleaded with Western countries to provide his country with more air defence systems.\nAlso, unconfirmed reports said a Ukrainian missile struck an airfield in occupied Crimea.\nNeither Russian nor Ukrainian officials confirmed the strike, but local authorities temporarily closed a road where the airfield is located.\nUkrainian drone developers have been extending the weapons’ range and earlier this month struck a target some 745 miles (1,200km) east of Ukraine."}, {"id": "2828f2d7-6c97-4893-abeb-7416c95e1c8b", "title": "US and South Korea fly warplanes in interception drill after North missile tests", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615054e599938.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korea and the United States have flown advanced stealth fighters in a joint missile-interception drill over the Korean Peninsula, South Korea’s Air Force said.\nThe drill was an apparent response to a spate of weapons tests this year by rival North Korea.\nNorth Korea has conducted six rounds of missile tests so far this year, most of them reportedly involving cruise missiles that typically fly at a low altitude to overcome opponents’ missile defences.\nSouth Korea and the US have responded by expanding their military exercises and trilateral training involving Japan.\nSouth Korean Air Force F-35A fighter jets prepare to take off from a South Korean Air Force base in Cheongju, South Korea (South Korea Defence Ministry via AP)This year, North Korea is expected to step up its testing activities and belligerent rhetoric as both the US and South Korea head into elections."}, {"id": "f967f2be-f100-42dc-856a-42b92e829034", "title": "Russian attack on Sumy Oblast kills 1 , injures 7", "date": "2024-06-15 03:15", "url": "https://www.yahoo.com/news/russian-attack-sumy-oblast-kills-013650807.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked eight communities in Sumy Oblast on June 14, killing one civilian and injuring seven, the Sumy Oblast Military Administration reported.\nIn Shostka, a missile attack killed one person and injured four others.\nStrikes against Sumy Oblast have become increasingly destructive in recent months.\nA Russian rocket attack on May 29 on Krasnopillia killed two civilians and injured three others.\nSumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts."}, {"id": "9a5ef108-1882-47a2-afce-af037cd62851", "title": "Russia claims drone attack in Rostov Oblast", "date": "2024-06-15 06:00", "url": "https://www.yahoo.com/news/russia-claims-drone-attack-rostov-030500416.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians have reported a drone attack in Rostov Oblast and that air defence systems have been responding near the town of Kamensk-Shakhtinsky.\nSource: Rostov Oblast Governor Vasily Golubev; ASTRA Telegram channelQuote from Golubev: \"Air defence forces downed several UAVs near Kamensk-Shakhtinsky at around 04:00.\nDetails: Russians are posting the moment a drone was flying over the town of Kamensk-Shakhtinsky in Rostov Oblast on social media.\nOne of the largest chemical plants in southern Russia, the federal business Kombinat Kamensky, is located in Kamensk-Shakhtinsky.\nThe documents indicate that the Kamensk-Shakhtinsky plant is the place where composite fuel for the missile engines of this type and testing facilities are located."}, {"id": "57cc27ef-e5f1-4edb-9de2-33d868a4c294", "title": "Xi visits Serbia on 25th anniversary of Nato bombing of Chinese embassy", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/2024061536f599955.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Chinese leader Xi Jinping’s visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during Nato’s air war over Kosovo.\nUS jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7 1999, setting it ablaze and killing three Chinese nationals.\nThe US at the time apologised and said the embassy bombing was a mistake that happened due to faulty intelligence.\nMr Xi will arrive from France and proceed from Serbia to Hungary as part of his first European tour in five years.\nHe is expected to visit the site of the former embassy on the anniversary date and pay his respects to the bombing victims."}, {"id": "de08534d-f040-4c36-90c2-8a96f845673d", "title": "Houthi Attack Leaves Philippine Crew Stranded in Red Sea", "date": "2024-06-15 03:30", "url": "https://www.devdiscourse.com/article/business/2982812-houthi-attack-leaves-philippine-crew-stranded-in-red-sea", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "The crew of a Greek-owned vessel Tutor that was damaged in an attack by Yemeni Houthi militants in the Red Sea should be rescued within the day although one sailor is still missing, the Philippines said on Friday.\nThe Iran-aligned Houthi militants have taken responsibility for the boat and missile attack on the Tutor.\nThe 22 crew members on board are mostly Filipino, Hans Cacdac, the Philippines Department of Migrant Workers Secretary, told a press conference in Manila.\nThe missing crew member was suspected to be trapped in the engine room, maritime sources said.\nThe rest of the crew were \"safe and sound\" and had adequate food supplies, Cacdac said, citing the captain."}, {"id": "9e46a580-f943-419e-971a-e6c004617b68", "title": "Commercial Ship on Fire After Houthi Missile Attack , Crewmember Injured", "date": "2024-06-15 00:30", "url": "https://www.breitbart.com/middle-east/2024/06/14/commercial-ship-on-fire-after-houthi-missile-attack-crewmember-injured/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "A fire broke out on the ship after the missile strikes and one of its crewmembers was severely injured.\nU.K. Maritime Trade Operations (UKMTO) said on Friday that the ship was adrift and taking on water.\nCacdac said the missing crew member could be trapped in the Tutor’s engine room, which was damaged by the Houthi attack.\nThe Biden administration announced a coalition operation called “Prosperity Guardian” in February to protect Red Sea commerce and reassure nervous shipping companies.\nCENTCOM said on Wednesday that U.S. forces destroyed three anti-ship cruise missile launchers and one uncrewed aerial system in Houthi-controlled areas of Yemen."}, {"id": "a5175e73-17d3-4e41-8a1f-7da29c73dac7", "title": "Three commercial ships and US warship involved in Houthi attack in Red Sea", "date": "2024-06-15 12:15", "url": "http://www.myanmarmuslim.net/news/20240615207b599737.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ballistic missiles fired by Yemen’s Houthi rebels struck three commercial ships in the Red Sea, the US military said on Sunday.\n“These attacks represent a direct threat to international commerce and maritime security,” the US military’s Central Command said in a statement.\nShortly afterward, the Carney shot down a drone headed its way, although it is not clear if the destroyer was the target, Central Command said.\nWhile responding to its distress call, the Carney shot down another incoming drone.\nThe attack began around 9.15am local time (0615 GMT) in Houthi-controlled Sanaa, Yemen’s capital, Central Command said."}, {"id": "004b1c1d-374f-4f38-8d84-bbbca808b1a2", "title": "Russo - Ukraine War - 14 June 2024", "date": "2024-06-15 02:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nDuring the day, Russian forces launched six missile strikes on the territory of Ukraine with the use of 17 missiles.\nRussian forces tried to improve the tactical position in the areas of the settlements of Petropavlivka, Sinkivka and Pishnny.\nRussian air defence facilities have shot down one MiG-29 fighter jet and two Mi-8 helicopters of the Ukrainian Air Force.\nIn addition, Su-27 and Su-25 aircraft of the Ukrainian Air Force have been destroyed at airfields of departure."}, {"id": "14832767-bfd6-484e-a330-38450219d5a8", "title": "Defense Forces Repel Eight Attacks In South Overnight", "date": "2024-06-15 10:15", "url": "https://menafn.com/1108337142/Defense-Forces-Repel-Eight-Attacks-In-South-Overnight", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Over the past day, Ukrainian defenders repelled seven enemy in the Orikhiv direction and one on the left of the Dnipro River in the Kherson region.\nThe Southern Defense Forces of Ukraine reported this on Telegram , Ukrinform reports.\nOn the left bank of the Kherson region, Russian retreated to their original positions with losses.\nThe defense forces continue to take comprehensive measures to hold their positions.\nOver the past day, 213 reconnaissance drones were recorded flying in the operational area of the Southern Defense Forces."}, {"id": "d48684fe-1b6c-4ee2-9543-74ff31a87405", "title": "Houthi rebels unveil solid - Sure Win Bet", "date": "2024-06-15 07:45", "url": "http://www.myanmarmuslim.net/news/20240615599d599400.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have unveiled a new solid-fuel missile that resembles aspects of one earlier displayed by Iran that Tehran said could fly at hypersonic speeds.\nThe rebels fired the new Palestine missile, complete with a warhead painted like a Palestinian checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nIran unveiled the missile last year and claimed it could reach Mach 15th — 15 times the speed of sound.\nHypersonic weapons, which fly at speeds higher than Mach 5, could pose crucial challenges to missile defence systems because of their speed and manoeuvrability.\nBallistic weapons fly on a trajectory in which anti-missile systems like the US-made Patriot can anticipate their path and intercept them."}, {"id": "4d8464d3-82a4-4335-bdbd-3d7045e700bc", "title": "Blue Origin joins SpaceX and ULA in new round of military launch contracts", "date": "2024-06-15 02:00", "url": "https://arstechnica.com/space/2024/06/blue-origin-joins-spacex-and-ula-in-new-round-of-military-launch-contracts/", "domain": "arstechnica.com", "domain_classification": "Unknown", "message": "The US Space Force announced Thursday that Blue Origin will compete with United Launch Alliance and SpaceX for at least 30 military launch contracts over the next five years.\nIn 2020, despite protests from Blue Origin seeking eligibility, the Pentagon selected ULA and SpaceX to continue sharing launch duties.\nThe National Security Space Launch (NSSL) program is in charge of selecting contractors to deliver military surveillance, navigation, and communications satellites into orbit.\nSpaceX and Blue Origin rockets are partially reusable, while ULA eventually plans to recover and reuse Vulcan main engines.\nULA, SpaceX, and Blue Origin are also the top contenders to win Lane 2 contracts later this year."}, {"id": "43f16e56-3e3b-4919-8bc4-f13926851fa5", "title": "Stabbing of Americans in Jilin Draws Comparisons to the Boxer Rebels", "date": "2024-06-15 03:15", "url": "https://chinadigitaltimes.net/2024/06/stabbing-of-americans-in-jilin-draws-comparisons-to-the-boxer-rebels/", "domain": "chinadigitaltimes.net", "domain_classification": "Unknown", "message": "The stabbing of four instructors from Iowa’s Cornell College in a Jilin park has become the latest flashpoint in U.S.-China relations.\nState media outlets that posted about the news to Weibo also shut down their comment sections.\nChinese state media outlets often highlight his connection to the state.\nA similar meme also went viral after the 2021 G7 summit, similarly drawing comparisons between modern diplomats and those involved with crushing the Boxer Rebellion.\nOrders were issued that no family was to own foreign goods or light foreign lamps."}, {"id": "438791d9-2197-4120-9b2c-a3256ca2a6e7", "title": "Vladimir Putin marks anniversary of annexation of Ukrainian regions", "date": "2024-06-15 05:00", "url": "http://www.myanmarmuslim.net/news/20240615841f599104.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin has insisted that the residents of four Ukrainian regions illegally annexed by Moscow a year ago “made their choice — to be with their fatherland”.\nIn an address released in the early hours to mark the first anniversary of the annexation, Mr Putin insisted it was carried out “in full accordance with international norms”.\nMeanwhile, in Ukraine, air defences shot down 30 out of 40 Iranian-made kamikaze drones aimed at the Odesa, Mykolaiv and Vinnytsia provinces overnight, the Ukrainian air force said.\nRomania’s Ministry of National Defence said on Saturday that “a possible unauthorised entry” into its national air space occurred overnight amid the bombardment.\nRussia’s Defence Ministry said on Saturday that it had shot down nine Ukrainian rockets fired at its southern Belgorod region, which borders Ukraine."}, {"id": "2df9d6f6-cc74-47cd-8d5a-eb2f42c32d7c", "title": "Iran supreme leader hints that Tehran hit little in massive attack on Israel", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/20240615398c599593.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran’s supreme leader has dismissed any discussion of whether Tehran’s unprecedented drone-and-missile attack on Israel hit anything there, a tacit acknowledgment that, despite launching a massive assault, few projectiles actually made it to their targets.\n“The main issue is the emergence of the Iranian nation and Iranian military’s will in an important international arena.\nThis is what matters.”Iran launched hundreds of drones, ballistic missiles and cruise missiles which sought to overwhelm Israel’s air defences in the April 13 attack – the first on Israel by a foreign power since Iraqi dictator Saddam Hussein launched Scud missiles at Israel in the 1991 Gulf War.\nHowever, Israeli air defences and fighter jets, backed by the US, the UK and neighbouring Jordan, shot down the vast majority of the incoming fire.\nIran’s attack came in response to a suspected Israeli strike on April 1 targeting a consular building next to the Iranian Embassy in Damascus, Syria, which killed two Guard generals and others."}, {"id": "cdc88226-b810-4948-a4d2-13541567da3d", "title": "Ukraine uses long - Winning Odds", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615365a599626.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US officials say Ukraine for the first time has begun using long-range ballistic missiles, striking a Russian military airfield in Crimea (Mstyslav Chernov/AP)“The key now is speed,” Ukraine President Volodymyr Zelensky tweeted.\nFor months, the US resisted sending Ukraine the long-range missiles out of concern that Kyiv could use them to hit deep into Russian territory, enraging Moscow and escalating the conflict.\nPresident Biden signed into law today the support package approved by Congress, which includes Ukraine aid.\nThe US had refused to confirm that the long-range missiles were given to Ukraine until they were actually used on the battlefield and Kyiv leaders approved the public release.\nVideos on social media last week showed the explosions at the military airfield, but officials at the time would not confirm it was the ATACMS."}, {"id": "50961ed4-14de-45f1-b075-aeb413b48cb0", "title": "DMW : 21 of 22 Pinoy seafarers in Houthi - hit ship rescued", "date": "2024-06-15 05:00", "url": "https://www.gmanetwork.com/news/pinoyabroad/dispatch/910151/dmw-21-of-22-pinoy-seafarers-in-houthi-hit-ship-rescued/story/", "domain": "gmanetwork.com", "domain_classification": "Unknown", "message": "Twenty one of the 22 Filipino seafarers of a ship that was attacked by Houthi rebels in the Red Sea were brought to safety, the Department of Migrant Workers (DMW) said Saturday.\nCacdac refused to disclose details on the current whereabouts of the rescued Filipino seafarers from the MV Tutor for security reasons.\n\"But rest assured, the 21 Filipino seafarers are safe,\" the Migrant Workers chief said.\nRemaining Pinoy seafarerAs for the remaining crew of the MV Tutor, Cacdac said the seafarer remains inside the abandoned Liberia-flagged coal carrier.\nHe added that Filipino seafarers have the right to refuse boarding in ships passing through Red Sea and Gulf of Aden."}, {"id": "b7d01a2b-c481-43b9-bfe1-7faef2d74418", "title": "Supreme Court gun ruling stuns Las Vegas shooting survivors", "date": "2024-06-15 00:15", "url": "https://www.yahoo.com/news/supreme-court-gun-ruling-stuns-223938061.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "For survivors like Ms Gooze, who identifies as liberal and thought Trump’s ban was “phenomenal”, the ruling felt like a step backward for the country.\nThe Route 91 survivors were not universally disheartened by the Supreme Court decision.\nSeveral were discussing the news in a private Facebook group, Ms Gooze said, and some members of the community had responded that the ruling did not bother them.\nIt’s the government that’s the enemy,” one survivor wrote in a message that Ms Gooze read to the BBC.\nBoth Ms Gooze and Ms Quintero lamented that the gun debate had grown so politicised."}, {"id": "502d1497-6bd1-4f36-bdb1-70e982e7aa4d", "title": "Las Vegas shooting survivors stunned by Supreme Court gun ruling", "date": "2024-06-15 00:15", "url": "https://www.bbc.com/news/articles/c033d532354o", "domain": "bbc.com", "domain_classification": "International", "message": "Supreme Court gun ruling stuns Las Vegas shooting survivorsHeather Gooze survived the 2017 mass shooting at a Las Vegas music festival that led to the initial bump stock banOn 1 October 2017, Heather Gooze was serving drinks at the Route 91 music festival in Las Vegas when concert-goers began running into her bar, screaming and covered in blood.\nFor survivors like Ms Gooze, who identifies as liberal and thought Trump’s ban was “phenomenal”, the ruling felt like a step backward for the country.\nThe Route 91 survivors were not universally disheartened by the Supreme Court decision.\nIt’s the government that’s the enemy,” one survivor wrote in a message that Ms Gooze read to the BBC.\nBoth Ms Gooze and Ms Quintero lamented that the gun debate had grown so politicised."}, {"id": "867f2904-f957-473b-8f4b-a62dc437b90c", "title": "US and Britain launch strikes on Yemen Houthis", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615788d599209.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The latest strikes against the Houthis were launched by warships and fighter jets.\nSaturday’s strikes marked the third time the US and Britain had conducted a large joint operation to strike Houthi weapon launchers, radar sites and drones.\nThe Houthis’ attacks have led shipping companies to reroute their vessels from the Red Sea, sending them around Africa through the Cape of Good Hope – a much longer, costlier and less efficient passage.\nDuring normal operations about 400 commercial vessels transit the southern Red Sea at any given time.\nIran has tried to distance itself from the drone strike, saying the militias act independently of its direction."}, {"id": "defe6e9a-709c-44c9-ab7b-a15f8b74c8c2", "title": "Crew abandon ship  attacked by Yemen Houthi rebels  ", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615400e599597.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The crew of a commercial ship struck in a suspected attack by Yemen’s Houthi rebels have abandoned the vessel in the Gulf of Aden.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war in Gaza.\nHouthi supporters attend a rally against the US-led strikes on Yemen and Israel’s war in Gaza (Osamah Abdulrahman/AP)Despite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said."}, {"id": "3c8159a4-fc1a-4843-a520-a6a8d8d97664", "title": "Crew abandon ship  attacked by Yemen Houthi rebels  ", "date": "2024-06-15 12:30", "url": "http://www.myanmarmuslim.net/news/20240615324a599668.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The crew of a commercial ship struck in a suspected attack by Yemen’s Houthi rebels have abandoned the vessel in the Gulf of Aden.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war in Gaza.\nHouthi supporters attend a rally against the US-led strikes on Yemen and Israel’s war in Gaza (Osamah Abdulrahman/AP)Despite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said."}, {"id": "c045683e-df99-4eb8-ba60-dabed3234f76", "title": "Motorcycle gang indicted in racketeering scheme : What are they accused of ? ", "date": "2024-06-15 05:00", "url": "https://www.daytondailynews.com/local/motorcycle-gang-indicted-in-racketeering-scheme-what-are-they-accused-of/GRIP367IR5GYTNNBEVM6STLKTY/", "domain": "daytondailynews.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "1a836651-8961-48f3-a2f7-510ed5ebac81", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:45", "url": "https://santamariatimes.com/news/world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_4b109eed-a1f6-5e3d-93f3-79bdc6d2ca2b.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor"}, {"id": "2788869a-e6b4-42b2-a446-36d9f6b2b2c5", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://toronto.citynews.ca/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said."}, {"id": "47e6dbfa-2093-4d92-8432-faa386d54f6a", "title": "Two dead after Israeli missiles  hit residential area  in Syria", "date": "2024-06-15 01:15", "url": "http://www.myanmarmuslim.net/news/20240615016a599976.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli air strikes hit a neighbourhood in the Syrian capital on Wednesday morning, killing two people and causing material damage, Syria’s state TV said.\nSyrian state TV reported that several missiles hit the western neighbourhood of Kfar Sousseh but did not elaborate or say who were the people killed.\nThe pro-government Sham FM radio station said the strike hit a building near an Iranian school.\nSana, the state news agency, quoted an unnamed military official as saying that the missiles were fired from the direction of Syria’s Israeli-occupied Golan Heights and hit a building, killing two civilians and wounding another.\nLast month, an Israeli strike on the Syrian capital’s western neighbourhood of Mazzeh destroyed a building used by the Iranian paramilitary Revolutionary Guard, killing at least five Iranians."}, {"id": "50f16613-f533-488f-849b-4566c944639c", "title": "Three Americans killed and many wounded in drone attack in Jordan , says Biden", "date": "2024-06-15 05:15", "url": "http://www.myanmarmuslim.net/news/20240615432c599511.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Three American service members were killed and “many” were wounded in a drone strike in Jordan, US president Joe Biden said on Sunday.\nSome 3,000 American troops typically are stationed in Jordan.\nThe attack on Jordan marks the first targeting of American troops in Jordan during the war.\nMr Biden was briefed on the attack on Sunday, White House press secretary Karine Jean-Pierre said.\nJordanian state television quoted Muhannad Mubaidin, a government spokesman, saying the attack happened outside the kingdom across the border in Syria."}, {"id": "d38970f6-82b3-4791-92ac-56b29980f150", "title": "Man arrested over stabbing of four US college instructors in Chinese park", "date": "2024-06-15 04:45", "url": "http://www.myanmarmuslim.net/news/2024061510e599989.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A suspect has been arrested over the stabbing of four instructors from Iowa’s Cornell College who were teaching at a Chinese university in the north-east city of Jilin.\nPolice said a 55-year old man with the surname Cui was walking in a public park when he bumped into a foreigner.\nThe US State Department said in a statement it was aware of reports of a stabbing and was monitoring the situation.\nAn Iowa state legislator posted a statement on Instagram saying his brother, David Zabner, had been wounded during a stabbing attack in Jilin.\nCornell spokesperson Jen Visser said in an email that the college was still gathering information about what happened."}, {"id": "3b5b2996-8f50-48b7-882c-fe7a8fe106bc", "title": "North Korea claims progress on hypersonic missile designed to strike US targets", "date": "2024-06-15 09:00", "url": "http://www.myanmarmuslim.net/news/2024061534b599958.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "North Korea has successfully tested a solid-fuel engine for its new-type intermediate-range hypersonic missile, state media reported.\nThe North said this marks progress in its efforts to develop a more powerful, agile missile designed to strike faraway US targets in the region.\nIn January, North Korea said it had flight-tested a new solid-fuel intermediate-range ballistic missile tipped with a hypersonic, manoeuvrable warhead, in a likely reference to the missile mentioned in Wednesday’s KCNA dispatch.\nIn November, North Korea said it had tested engine tests for an intermedia-range missile but did not say whether it is designed to carry a hypersonic warhead.\nMr Chang said the latest engine test suggests North Korea could soon test-launch the new hypersonic missile."}, {"id": "7f43c807-87eb-40eb-84e2-dedcace80d1e", "title": "Israeli airbase comes under drone attack by Iraq Islamic Resistance forces", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-presstv08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli airbase comes under drone attack by Iraq's Islamic Resistance forcesIran Press TVFriday, 14 June 2024 6:12 AMAn airbase in the northern part of the Israeli-occupied territories has come under a drone strike by Iraqi anti-terror resistance groups.\nThe Islamic Resistance in Iraq, an umbrella group of anti-terror fighters, claimed responsibility for the aerial attack on Ramat David Airbase, located 20 kilometers (12.4 miles) southeast of Haifa, in a statement published on its Telegram channel on Friday morning.\nThe coalition noted that it will continue to target and destroy important installations across the occupied lands.\nThe development came two days after fighters from Iraqi anti-terror resistance groups carried out an operation against a \"vital\" target in the Port of Eilat.\nThe Islamic Resistance in Iraq has been launching several attacks on Israeli targets ever since the occupying regime started its genocidal war on Gaza in early October."}, {"id": "f29af478-f971-4862-ac11-de7be6952b94", "title": "US warns ships to stay out of parts of Red Sea as Houthi rebels vow retaliation", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615197b599746.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Since November, the rebels have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas.\nThe Red Sea route is a crucial waterway, and attacks there have caused severe disruptions to global trade.\nTesla, meanwhile, said it would temporarily halt most production at its German factory because of attacks in the Red Sea.\n“While the kingdom stresses the importance of preserving the security and stability of the Red Sea region … it calls for restraint and avoiding escalation,” its Foreign Ministry said in a statement.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning called on nations not to escalate tensions in the Red Sea."}, {"id": "1540b826-db30-416d-a962-31306e081485", "title": "The Latest | US is removing aid pier from Gaza coast again due to weather , officials say", "date": "2024-06-15 03:15", "url": "https://www.ktsa.com/the-latest-us-is-removing-aid-pier-from-gaza-coast-again-due-to-weather-officials-say/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "Israel launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nAfter the Oct. 7 Hamas that triggered the war in Gaza, Smotrich froze the tax revenue transfers.\nUS-built aid pier will be removed from Gaza coast again due to weather, officials sayWASHINGTON — The U.S.-built aid pier will be detached from Gaza’s coast for a second time due to rough seas, two U.S. officials said Friday, raising further questions about the viability of the sea route.\nU.S. officials say the group has also looted and set fire to trucks carrying aid through the West Bank toward Jordan.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250."}, {"id": "04ac8cb9-fcf3-4f9a-9081-cf30da4b736b", "title": "US officials worry of Israel - Hezbollah spillover in Middle East", "date": "2024-06-15 12:30", "url": "https://www.jpost.com/arab-israeli-conflict/article-806306", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Biden administration has become increasingly concerned that the increasing conflict and rocket exchanges between Israel and Hezbollah could expand through the region, anonymous US officials told CBS News on Friday.\nIAF strikes deeper into LebanonSome of the US officials told CBS that they interpreted the deepening IDF strikes in Lebanese territory as a preparatory measure for a sweeping assault.\nOther officials told CBS they were concerned that, in response to the deepening strikes, Hezbollah would escalate attacks, resulting in an unintended war.\nInflaming tensionsAfter senior Hezbollah official Sami Taleb Abdullah was eliminated in a strike, Hezbollah increased its rocket attacks against Israel.\nApproximately 250 rockets were launched on Wednesday towards northern Israel, disrupting civilians trying to partake in the holiday of Shavuot."}, {"id": "a0fb7b8a-b5e3-43c3-917a-e4b7c74abcb3", "title": "Russia wears down Ukrainian defences with missile and drone attacks", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615814d599177.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence systems intercepted 26 out of 28 Shahed drones, Ukraine’s air force said.\nRussian forces also launched five missiles overnight, it said.\nRescue workers clear the rubble of destroyed houses after a Russian drone attack in Zaporizhzhia (AP Photo/Andriy Andriyenko)The attacks also aim to weaken Ukrainian morale and act as retribution for Ukrainian long-range strikes on Russian soil.\nHe said it was “sheer nonsense” to think that Russia could attack a Nato member country after the Ukraine war.\nThe Black Sea city of Odesa repelled three missile and drone attacks, officials said."}, {"id": "6164a8fc-8dac-48ef-aac6-ed2142817442", "title": "Shooting at Uddika vehicle : Police seek court order to arrest ASP - Breaking News", "date": "2024-06-15 06:45", "url": "https://www.dailymirror.lk/breaking-news/Shooting-at-Uddikas-vehicle-Police-seek-court-order-to-arrest-ASP/108-284897", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "By Sujith HewajuligeThe Ministry of Public Security said that the police will seek a court order for the arrest of Assistant Superintendent of Police Sanjeeva Mahanama, who has been accused of shooting at the vehicle of actor turned MP Uddika Premaratne.\nMinister of Public Security Tiran Alles he said that the investigation had been launched in a fresh approach.\nPolice Media Spokesman DIG Advocate Nihal Talduwa said earlier that the incident had been stage-planned.\nInitial investigations revealed that the ASP gave his firearm to another person at the airport and went abroad.\nThe shooting attack on MP Uddika Premaratne's vehicle took place on September 17, last year."}, {"id": "f9449c57-0790-48a2-b2c0-787e9e54f3ef", "title": "US , Canada scrambles naval warships as Russian navy docs at Havana", "date": "2024-06-15 09:00", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/us-canada-scrambles-naval-warships-as-russian-navy-docs-at-havana/articleshow/111014401.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: Canadian navy patrol ship, Margaret Brooke, reached Havana harbor early on Friday after US's fast-attack submarine Helena docked at its Guantanamo naval base in Cuba .Both vessels arrived shortly after Russian warships , including the Admiral Gorshkov frigate and the nuclear-powered submarine Kazan, had docked in Havana earlier this week.The presence of Russian, Canadian, and US vessels in Cuba reminds of the tensions that existed during the Cold War.However, both the US and Cuba have stated that the Russian warships do not pose a threat to the region, and Russia has described the arrival of its warships in allied Cuba as a routine visit.Meanwhile, the Russian defence ministry reported that the Admiral Gorshkov frigate and the Kazan submarine had conducted \"high-precision missile weapons\" training in the Atlantic Ocean before sailing into Havana harbor on Wednesday.Additionally, the Canadian Joint Operations Command described the Margaret Brooke's visit as \"a port visit in recognition of the long-standing bilateral relationship between Canada and Cuba.\n\"Cuba's foreign ministry acknowledged being informed about the US submarine's arrival but expressed displeasure on the move.\n\"Naval visits to a country are usually the result of an invitation, and this was not the case.\nObviously we do not like the presence in our territory (of a submarine) belonging to a power that maintains an official and practical policy that is hostile against Cuba,\" said Vice Foreign Minister Carlos Fernández de Cossío.Russia and Cuba shared close ties during the former Soviet Union era, with tensions between Washington and Moscow over communism in the US \"backyard\" reaching a peak during the Cuban Missile Crisis of 1962.The Russian warships are expected to remain in Havana harbor until Monday."}, {"id": "b2ad637c-a42f-470b-ae1f-47200aad0f36", "title": "Conviction in 2009 N . J . murder after suspect nabbed overseas", "date": "2024-06-15 01:00", "url": "https://www.nj.com/essex/2024/06/conviction-in-2009-nj-murder-after-suspect-nabbed-overseas.html", "domain": "nj.com", "domain_classification": "Unknown", "message": "An Essex County jury convicted a man charged in a 2009 fatal stabbing in Newark, 15 years after he fled to the Dominican Republic, prosecutors said Friday.\nA jury in state Superior Court in Newark on Wednesday found Cesar Campos guilty of conspiracy to commit murder and aggravated manslaughter, both first-degree crimes, plus related weapons charges, Essex County Prosecutor Theodore Stephens’ office announced.\nCampos, 49, who lived in Newark at the time of the incident, was charged with fatally stabbing Ricky Lauracuent outside the Pink Cat Lounge at the corner of Park Avenue and North 13th Street, along a railroad embankment in the city’s West Ward, Stephens’ office said.\nThe office said the mother of Lauracuent’s children witnessed the stabbing."}, {"id": "dc106bae-186f-4388-932a-7acfb2f2daac", "title": "Gaza bombed as fallout brings surging tensions to Lebanon , Yemen", "date": "2024-06-15 12:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/gaza-bombed-as-fallout-brings-surging-tensions-to-lebanon-yemen/articleshow/111019980.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Ceasefire plan'Close to impossible'US sanctionsIsrael bombed and shelled Gaza on Saturday, witnesses and first responders said, with fallout from the war bringing a resurgence of tensions to the Lebanon border and Yemen.In the ninth month of war between Palestinian Hamas militants and Israeli forces, the Civil Defence agency in Gaza City, in the territory's north, reported 10 bodies recovered from Israeli strikes on three separate homes.In Rafah, in Gaza's far south near Egypt, witnesses reported clashes between militants and Israeli troops in the city's west, and artillery fire towards a refugee camp in the city centre.\nAFPTV images showed streets largely deserted.The United Nations says about one million people have been displaced from Rafah since early May, when Israel began ground operations in pursuit of Hamas militants.Israel's military has also been operating in central Gaza, where on Friday at a hospital in Deir al-Balah city a middle-aged man wept over the body of a younger man.\nBlood soaked through a white cloth around his neck.The war began after Hamas's unprecedented October 7 attack on southern Israel, which resulted in the deaths of 1,194 people, mostly civilians, according to an tally based on Israeli official figures.The militants also seized 251 hostages.\n\"Individuals from Tzav 9 have repeatedly sought to thwart the delivery of humanitarian aid to Gaza, including by blockading roads, sometimes violently,\" the US State Department said.\n\"They also have damaged aid trucks and dumped life-saving humanitarian aid onto the road."}, {"id": "a3a30360-2153-490a-b1c3-a351af3a21da", "title": "Cuba Does Not Approve of US Submarine Presence - Deputy Foreign Minister", "date": "2024-06-15 06:00", "url": "https://sputnikglobe.com/20240615/cuba-does-not-approve-of-us-submarines-presence---deputy-foreign-minister-1118968881.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240615/cuba-does-not-approve-of-us-submarines-presence---deputy-foreign-minister-1118968881.htmlCuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterCuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterSputnik InternationalThe Cuban government was notified of the USS fast attack submarine Helena visiting the US naval base in Cuba's Guantanamo, but Havana does not approve of such visits, Cuban Deputy Foreign Minister Carlos Fernandez de Cossio said.\n2024-06-15T05:44+00002024-06-15T05:44+00002024-06-15T05:45+0000americasuscubaguantanamo bayhavanaguantanamosubmarinehttps://cdn1.img.sputnikglobe.com/img/07e6/08/0b/1099495217_0:0:2000:1125_1920x0_80_0_0_04a7eba3693142b900066507d93f305b.jpg\"We were aware of their presence because, in accordance with the procedures that we have followed for years, the United States informed us in advance.\nThe deployment followed the Russian naval force's arrival in Cuba for naval exercises.\nUS officials previously noted that the Russian naval deployment to Cuba does not pose a threat to the United States.\nhttps://sputnikglobe.com/20240614/russian-ships-arrive-in-cuba-in-latest-blow-to-us-hegemony-1118939506.htmlamericascubahavanaguantanamoSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Sputnik Internationalus submarine, cuban government, us naval base, cuban deputy foreign minister carlos fernandez de cossio"}, {"id": "d34418d5-2d55-4ea9-b85a-d014c59c9681", "title": "Gaza awaits aid as Israel tells troops to  be ready  for ground invasion", "date": "2024-06-15 06:15", "url": "http://www.myanmarmuslim.net/news/20240615248b599746.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "President Joe Biden and other US officials have already said that US intelligence officials believed the explosion was not caused by an Israeli air strike.\nThe Israeli military has relentlessly attacked Gaza in retaliation for a devastating Hamas rampage in southern Israel almost two weeks ago.\nEven after Israel told Palestinians to evacuate the north of Gaza and flee south, strikes extended across the territory, heightening fears among the territory’s two million people that nowhere was safe.\nPalestinian militants fired rockets into Israel on Thursday from Gaza and Lebanon, and tensions flared in the Israeli-occupied West Bank.\nRockets are fired from the Gaza Strip towards Israel over destroyed buildings following Israeli air strikes on Gaza City, central Gaza Strip (Mohammed Dahman/AP)A UN flag will be raised on both sides of the crossing as a sign of protection against air strikes, they said."}, {"id": "a30e79cd-ff2d-4158-88a3-6a649e649ea2", "title": "At least 95 killed in twin blasts at ceremony honouring Iranian general", "date": "2024-06-15 05:00", "url": "http://www.myanmarmuslim.net/news/20240615977a598966.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Two explosions minutes apart at a commemoration in Iran for a prominent general who died in a US drone strike in 2020 killed at least 95 people and injured more than 211 others on Wednesday.\nThe blasts came as the Middle East remains on edge over Israel’s war on Hamas in the Gaza Strip.\nWhile Israel has carried out attacks in Iran over its nuclear programme, it has conducted targeted assassinations, not mass-casualty bombings.\nThe blasts struck an event marking the the fourth anniversary of the killing of General Qassem Soleimani, the head of the Revolutionary Guard’s elite Quds Force, in a US drone strike in Iraq in January 2020.\nUltimately, a drone strike launched by the Trump administration killed the general, part of escalating incidents that followed America’s 2018 unilateral withdrawal from Tehran’s nuclear deal with world powers."}, {"id": "df684539-6a5f-46e0-8181-f44f12fd85cc", "title": "Israel signals change in tactics as it withdraws some troops from Gaza", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615833d599110.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "But Israel has come under growing international pressure to scale back an offensive that has led to the deaths of nearly 22,000 Palestinians.\nIn its announcement, the army said that five brigades, or several thousand troops, would be taken out of Gaza in the coming weeks.\nThe Israeli military says 173 soldiers have died since it launched its ground operation.\nCombat was also reported in urban refugee camps in central Gaza, where Israel expanded its offensive last week.\nThe Israeli military said an airstrike killed Adel Mismah, a regional commander of Hamas’ elite Nukhba forces, in Deir al-Balah."}, {"id": "9922ed8f-bee1-4038-9d41-3831575f3dac", "title": "Russian strike on Kharkiv TV tower part of intimidation campaign , says Zelensky", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615321a599670.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukrainian president Volodymyr Zelensky said a Russian missile strike that smashed a television tower in Kharkiv was part of the Kremlin’s ongoing effort to intimidate Ukraine’s second-largest city, which has come under increasingly frequent attack in recent weeks .\nOn Monday, a Russian Kh-59 missile struck Kharkiv’s 250-metre-high (820ft) TV tower, breaking it roughly in half and halting transmissions.\nInstead, the Russian military command “may attempt to destroy Kharkiv city with air, missile, and drone strikes and prompt a large-scale internal displacement of Ukrainian civilians,” it said.\nMr Zelensky said US president Joe Biden assured him the aid would include long-range and artillery capabilities.\nBritish Prime Minister Rishi Sunak spoke with Mr Zelensky on Tuesday morning to confirm the new assistance."}, {"id": "b955772f-18e5-4d5d-b205-b37680f761fb", "title": "Canadian Navy ship join US , Russian subs in Cuba", "date": "2024-06-15 04:45", "url": "https://www.bssnews.net/news/195231", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "HAVANA, June 15, 2024 (BSS/AFP) - A Canadian Navy patrol ship docked Friday in Cuba, which is also hosting two nuclear-powered submarines -- one American and one Russian.\nThe HMCS Margaret Brooke docked in Havana on its way back from \"a successful deployment in the Caribbean basin,\" the Royal Canadian Navy said on Facebook.\nA US nuclear-powered submarine arrived in Cuba, the Pentagon said Thursday, a day after a Russian nuclear sub also docked there.\nThe Russian nuclear-powered sub Kazan -- which Cuba said was not carrying nuclear weapons -- arrived in the Cuban capital Wednesday.\nDuring the Cold War, Cuba was an important client state for the Soviet Union."}, {"id": "ddb30cb3-5730-40df-b2f3-c7835413219b", "title": "Russian Defence Minister Andrei Belousov inspects command post of Aerospace Forces", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240614-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russian Defence Minister Andrei Belousov inspects command post of Aerospace Forces14.06.2024Russian Minister of Defence Andrei Belousov inspected the command post of the Russian Aerospace Forces, where he received reports from the leadership of the Russian Aerospace Forces on the tasks of military branches of the Russian Aerospace Forces.\nThe Russian Defence Minister was informed that the duty shift of the command post is controlled by Aviation, Air and Missile Defence Forces, as well as Space Forces.\nThe technical equipment allows continuous monitoring of the air and space situation over the entire territory of the Russian Federation and strategic air and space directions.\nAndrei Belousov was presented with the work of the unmanned aerial vehicle control group of the Russian Aerospace Forces, which is equipped with an automated equipment system and a tablet terminal for visualising the operational situation and sharing data.\nDepartment for Media Affairs and InformationNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "1e03b2f3-5aec-49a1-8c4b-05a247d0c91c", "title": "White Supremacist Charged with Planning Mass Shooting at Bad Bunny Concert to Spark Race War", "date": "2024-06-15 01:15", "url": "https://ohnotheydidnt.livejournal.com/128615972.html", "domain": "ohnotheydidnt.livejournal.com", "domain_classification": "Unknown", "message": "The federal government reveals that a mass shooter targeted a Bad Bunny concert in Atlanta.\nThe FBI arrested Prieto last month after months of surveillance, following a tip-off from an informant who claimed Prieto endorsed the idea of a mass shooting targeting Black people, Jews, and Muslims.\nAccording to authorities, Prieto aimed to stage a mass shooting at a Bad Bunny concert in Atlanta to incite a race war ahead of this year’s presidential election.\nPrieto allegedly recruited the informant and an undercover FBI agent to assist in the attack, planning to leave Confederate flags at the scene.\nThe FBI arrested Prieto on May 14, the date of the first Bad Bunny concert, during which he admitted to discussing attack plans but denied intending to carry them out."}, {"id": "f7468034-845b-4d0a-beaa-a7a8b6ec0446", "title": "Discover the decision that shaped the fate of the AMX - 13 tank . ", "date": "2024-06-15 11:30", "url": "https://www.slashgear.com/1597272/amx-13-french-tank-israel-military-retired-battle-use-unconventional-way/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The Six-Day War took place from June 5-10, 1967, and it was intense.\nIsrael was prepared for the conflict, and when it kicked off, the small nation fielded hundreds of tanks, including 400 French-made AMX-13 light tanks, though it's fair to say Israel used them unconventionally.\nThe Israeli Defense Force's (IDF) inexperience with main battle tanks in combat meant they didn't employ the AMX-13 appropriately.\nInstead of using the light tanks for reconnaissance missions or other support activities, the IDF placed the AMX-13s it possessed into frontline duties.\nThis resulted in an increase in casualties, making the AMX-13 a less desirable option for Israel, and soon after the conflict, the IDF retired the AMX-13 from its inventory."}, {"id": "01e6e297-5b0a-4e66-bda9-209a906f1812", "title": "IDF unit specializing in removing drone threats in Gaza revealed", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/israel-hamas-war/article-806280", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Spectrum Warfare teams operate covertly to disrupt a range of threats encountered by the IDF on the ground.\nStaff-Sergeant Y., Sergeant A., and Corporal Y. recently completed a two-week mission in Gaza, returning with three captured drones.\nInfluential role in IDF ground forcesSpectrum Warfare teams fully integrate into ground forces, such as taking on advisory roles.\nSoldiers consult us before launching,\" notes Sergeant Major A. IDF soldiers from the 'Spectrum Warfare' unit.\n(credit: IDF SPOKESPERSON UNIT)Numerous teams are actively engaged in Gaza, shielding active troops from diverse drone threats and mitigating friendly fire risks during drone interceptions."}, {"id": "401b00d5-ee1c-4f10-ac53-58af55262149", "title": "U . S . Navy faces most intense combat since World War II against Yemen Houthi rebels | News , Sports , Jobs", "date": "2024-06-15 06:00", "url": "https://www.newsandsentinel.com/news/local-news/2024/06/u-s-navy-faces-most-intense-combat-since-world-war-ii-against-yemens-houthi-rebels/", "domain": "newsandsentinel.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said."}, {"id": "f89644ff-6e53-44e5-af4d-25e9c6d1b966", "title": "RSF Darfur commander killed in El Fasher", "date": "2024-06-15 10:45", "url": "https://www.radiotamazuj.org/en/news/article/rsf-darfur-commander-killed-in-el-fasher", "domain": "radiotamazuj.org", "domain_classification": "Unknown", "message": "A senior commander for the paramilitary Rapid Support Forces (RSF) has been killed during a battle around El Fasher, the capital of North Darfur State, the Sudanese Armed Forces (SAF) said Friday.\nAli Yagoub Gibril, who was under U.S. sanctions, was killed during fierce fighting between his forces and the joint forces south of the city.\nMini Minawi, governor of the Darfur region, wrote a post on X (formerly Twitter): “Farewell, commander of the El Fasher inferno.”There was no immediate comment from the RSF.\nWar erupted in Sudan in April last year between the Sudanese army and the paramilitary Rapid Support Forces (RSF).\nOn Thursday, the United Nations Security Council adopted a resolution demanding that the Rapid Support Forces (RSF) halt its siege of El-Fasher."}, {"id": "6fa4aed8-3046-4fd1-b019-5903d8a4cde0", "title": "No 30 - year - old drone wingmen : US Air Force eyes regular CCA overhauls", "date": "2024-06-15 04:15", "url": "https://www.yahoo.com/news/no-30-old-drone-wingmen-034902973.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Air Force’s aircraft fleet is replete with fighters, bombers, tankers and other aircraft that are still flying after decades or even generations.\n“I don’t want a set of collaborative combat aircraft that’s going to last for 25 to 30 years,” Allvin said.\nIn April, the Air Force announced it had selected Anduril and General Atomics to further develop designs for their CCA concepts, and then build production-representative test aircraft.\nAt Thursday’s event, Allvin noted the financial stresses the Air Force is facing, including inflation and limited budgets.\n“That’s going to probably play out in the next couple of years.”"}, {"id": "882315c2-806a-4979-8269-108100aa40a8", "title": "North Korea building roads , walls inside demilitarised zone : report", "date": "2024-06-15 13:30", "url": "https://www.scmp.com/news/asia/east-asia/article/3266760/north-korea-building-roads-walls-inside-demilitarised-zone-report", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nNorth Korea’s military has been building roads and walls inside the demilitarised zone (DMZ) that separates it from the South, the Yonhap news agency reported Saturday.\nWhen asked about the report, the South Korean military said in a statement that it was “closely tracking and monitoring the activities of the North Korean military”, and that “further analysis is required”.\nA balloon carrying rubbish, presumably sent by North Korea, is seen in a paddy field in Incheon, South Korea, on June 10.\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture."}, {"id": "38e015db-c1e9-438b-b854-3b412cb10970", "title": "Imperialist powers escalate global war at G7 and NATO Defense Minister summits", "date": "2024-06-15 04:30", "url": "https://www.wsws.org/en/articles/2024/06/15/syxf-j15.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The US-led axis of imperialist powers concluded a whirlwind week of summits Friday, including the G7 Summit, a meeting of the NATO defense ministers, and the Ukraine contact group, all of which had the effect of significantly escalating their global war against Russia and China.\nNATO Secretary-General Jens Stoltenberg declared that NATO had made “significant progress” in expanding its involvement in the Ukraine war and military rearmament targeting Russia.\nEven as NATO is increasing its direct involvement in the war in Ukraine, it is making active plans for a much broader war with Russia spanning the entire European continent.\nStoltenberg declared at last year’s NATO summit that “Allies agreed on the most comprehensive defense plans since the Cold War.”These plans are now being put into place.\nThis week’s summits followed the conclusion of the monthly meeting of the Ukraine Defense Contact Group, chaired by Secretary of Defense Lloyd J. Austin."}, {"id": "f482989e-2d33-4973-84b5-c01419b8cc42", "title": "  Far too many  Palestinians have died during Israel operations in Gaza – Blinken", "date": "2024-06-15 12:45", "url": "http://www.myanmarmuslim.net/news/20240615709b599286.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US secretary of state Antony Blinken says “far too many” Palestinians have died and more needs to be done to save lives and get aid where it is most needed.\nMr Blinken said in New Delhi on Friday that the US “appreciates” Israel’s steps to minimise civilian casualties but that is not enough.\nSmoke rises following an Israeli airstrike in the Gaza Strip (AP Photo/Leo Correa)The number of Palestinians killed in the war has risen to more than 11,000, including more than 4,400 children, the Hamas-run Health Ministry in Gaza said on Friday.\nIn the occupied West Bank, more than 160 Palestinians have been killed in the violence and Israeli raids.\nMore than 1,400 people in Israel have been killed, most of them in the Hamas attack, and about 240 hostages were taken from Israel into Gaza by the militant group."}, {"id": "2a066f77-9eca-4f72-acff-056a2a2f14d6", "title": "Navy EOD flexes expeditionary capabilities alongside NATO Allies at BALTOPS 2024", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-usn01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Exercise scenarios for Explosive Ordnance Disposal (EOD) units include clearing mines, eliminating explosive threats, operating unmanned vehicles and conducting diving and salvage.\nU.S. Navy EOD forces are working together with Belgium, France, the Netherlands, and Norway.\nAs an exercise, BALTOPS continually adapts to the dynamic security environment.\n\"This is the first time we've brought the full detect-to-engage package for a BALTOPS exercise.\nAs Navy EOD develops new capabilities, force structure, and tactics, our force remains dedicated to sharing capabilities and information on combating explosive threats with our allies and partners to ensure regional stability."}, {"id": "782d59f1-365b-4781-b346-b709993ad4f0", "title": "War in Ukraine - The arms and military equipment Germany is sending to Ukraine", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240614-de-fedgov01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "War in Ukraine - The arms and military equipment Germany is sending to UkraineGermany - Federal GovernmentGermany provides support for Ukraine by supplying equipment and weapons, these come from supplies of the Federal Arms Forces and from deliveries from industry financed from the Federal Government's funds for security capacity building.\nFriday, 14 June 2024This list provides an overview of military assistance provided by the Federal Republic of Germany to Ukraine.\nFunds for the security capacity building initiative in 2024 alone for military assistance to Ukraine amount to approximately 7.1 billion euro.\nFrom the EPF expenditures for military assistance to Ukraine can be re-imbursed to EU member states1.\nSo far already approximately 5 billion euro (2023) and approximately 1.6 billion euro (2022) were spent on military assistance to Ukraine."}, {"id": "722c3665-745a-4909-b49f-17e1e22c1d9f", "title": "Profiles Of Valor : Forgotten Hero ? - Chattanoogan . com", "date": "2024-06-15 00:45", "url": "https://www.chattanoogan.com/2024/6/14/488527/Profiles-Of-Valor-Forgotten-Hero.aspx", "domain": "chattanoogan.com", "domain_classification": "Unknown", "message": "Unfortunately, some Leftmedia scribes did what they do best, and attempted to sensationalize those heroic acts by wrapping some lost accounts in “racism.”One such account is that of CPL Waverly “Woody” Woodson Jr.\nWoody Woodson was a Philadelphia native.\nThe hunt’s still ongoing.”There are 94 black Medal of Honor ecipients, proportionally far less than the percentage of black Americans serving, but until the 1960s black soldiers were mostly excluded from combat roles.\nThe first Medal of Honor to a black recipient was awarded for his valorous actions during the War Between the States.\nCPL Waverly “Woody” Woodson Jr.: Your example of valor — a humble American Patriot defending Liberty for all above and beyond the call of duty, and in disregard for the peril to your own life — is eternal."}, {"id": "3a722a5f-fdb7-41dc-aad0-0588849ea77e", "title": "Andrei Belousov and Aleksei Dyumin hold joint meeting on supplying drones to military units of Russian Defence Ministry", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240614-russia-mod03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Andrei Belousov and Aleksei Dyumin hold joint meeting on supplying drones to military units of Russian Defence Ministry14.06.2024The National Centre for State Defence Control of the Russian Federation hosted a joint teleconference between adviser to the President of the Russian Federation Alexei Dyumin and Minister of Defence of the Russian Federation Andrei Belousov on the issues of cooperation with the country's constituent entities with regard to the supply of unmanned aerial vehicles and training in their use.\nRussian Defence Minister Andrei Belousov noted that the constituent entities of the Russian Federation have been providing great assistance to the troops since the very beginning of the special military operation in the areas of supply of military equipment.\nThese include the procurement and supply of drones, 'trench' electronic warfare means, wheeled vehicles, elements of armoured protection, and other equipment directly to the units.\nThe Russian Defence Minister stressed the need to pay attention to the proposed cooperation arrangements and to use them when organising assistance to the troops.\nAccording to Andrei Belousov, it will help to avoid excessive variability of products on the front line and increase the efficiency of the use of equipment supplied by regions."}, {"id": "11aadf6e-4015-4aa1-ab2e-c8377bda92d7", "title": "North Korea building roads , walls inside Demilitarized Zone : Yonhap", "date": "2024-06-15 09:00", "url": "https://www.yahoo.com/news/north-korea-building-roads-walls-080532517.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A North Korean flag is seen at the propaganda village of Gijungdong, North Korea (Jung Yeon-je)North Korea's military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nWhen asked about the report, the South Korean military said in a statement that it was \"closely tracking and monitoring the activities of the North Korean military\", and that \"further analysis is required\".\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture.\nIt has previously threatened artillery strikes against the South Korean loudspeakers -- a psychological warfare tactic that dates back to the 1950-53 Korean War."}, {"id": "c850a0ad-0819-45ea-a9e4-f236e023a694", "title": "SPECIAL REPORT | Pentagon ran secret anti - vax campaign to undermine China during pandemic", "date": "2024-06-15 11:30", "url": "https://www.timeslive.co.za/news/world/2024-06-15-special-report-pentagon-ran-secret-anti-vax-campaign-to-undermine-china-during-pandemic/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "20c603d4-6ce9-4d92-bb7f-6c1a5b56911a", "title": "No 30 - year - old drone wingmen : US Air Force eyes regular CCA overhauls", "date": "2024-06-15 07:15", "url": "https://www.c4isrnet.com/air/2024/06/15/no-30-year-old-drone-wingmen-us-air-force-eyes-regular-cca-overhauls/", "domain": "c4isrnet.com", "domain_classification": "Unknown", "message": "“I don’t want a set of collaborative combat aircraft that’s going to last for 25 to 30 years,” Allvin said.\nAt Thursday’s event, Allvin noted the financial stresses the Air Force is facing, including inflation and limited budgets.\n“That’s going to probably play out in the next couple of years.”Stephen Losey is the air warfare reporter for Defense News.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "06d23ab7-c850-478e-bd2e-309cbf54859b", "title": "Israel - Hamas War Day 253 : What is happening in Gaza ? ", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-15/live-updates-806289", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "FIREFIGHTERS TRY to extinguish a forest fire that started from a Hezbollah missile fired from Lebanon at the Biriya Forest, on June 4.\n(photo credit: David Cohen/Flash90)The Biden administration has become increasingly concerned that the increasing conflict and rocket exchanges between Israel and Hezbollah could expand through the region, anonymous US officials told CBS News on Friday.\nAn official said that the administration had been working toward lowering the risk that US troops face in Syria, Iraq, and Jordan.\nAdditionally, diplomatic advisor Amos Hochstein is heading to Israel on Monday with the reported purpose of trying to de-escalate tensions before they spread throughout the region."}, {"id": "426b8431-854c-4fbb-b0b4-2a16d4626cb4", "title": "Russia hybrid warfare spills into NATO , raising new fears", "date": "2024-06-15 13:00", "url": "https://www.yahoo.com/news/russia-hybrid-warfare-spills-nato-100000558.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken acknowledged late last month that the Kremlin was “intensifying its hybrid attacks” against NATO members and raised the possibility of potential retaliation.\n“We know what they’re up to, and we will respond both individually and collectively as necessary,” he said following a meeting with foreign ministers of NATO countries.\nBut NATO countries are likely going to have to accept some risk because Russia’s hybrid activities are too cost-effective for them to stop.\n“The thinking hasn’t really advanced much since the last NATO summit,” she said.\n“I would call it unrestricted Russian warfare."}, {"id": "2b5043d2-f876-4384-9ed3-516006dc63f5", "title": "24 reasons to watch the classic  Saving Private Ryan  ", "date": "2024-06-15 13:30", "url": "https://www.theeastafrican.co.ke/tea/magazine/24-reasons-to-watch-the-classic-saving-private-ryan--4659092", "domain": "theeastafrican.co.ke", "domain_classification": "Unknown", "message": "Starring Tom Hanks as Captain James Miller, leader of a small band of men on a mission to evacuate one Private Ryan (Matt Damon), the only survivor of a quartet of brothers in World War II, Spielberg’s genius as a director is obvious from the first shot, pardon the pun.\nThroughout this reality of war movie, it leaves nothing unexplored — the ferocity of being under fire, Mexican standoffs in ruined rainy French countryside castles, deadly snipers (on both sides); the bravery, gallantry and great cowardice of being in a theatre of war.\nAdvertisementIn our case, though, it is a tiny platoon looking for this one Private James Ryan, on the orders of General George Marshall, across bogs, beaches and poppy fields, to take him home.\nIn my favourite line in a super well-scripted movie, Captain Miller (Tom Hanks) at one moment swears: “By God, this Private Ryan better be worth it!\nSaving Private Ryan took home five Oscar awards, and almost 500 million dollars after it came out quarter a century ago; and it is worth all its two hours and 49 minutes in screen time."}, {"id": "e1d8d33f-a4aa-4a92-b13c-14da81fda35e", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-15 04:45", "url": "https://www.yahoo.com/news/ukraine-employs-flexible-defense-while-040040672.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the frontA Ukrainian soldier from the 57th Brigade waits for an order for his artillery vehicle to open fire on Russian positions at the front line in Ukraine’s Kharkiv region, Sunday, May 19, 2024.\nBy ceding some territory, Ukraine has been able to fight from better defended positions, according to interviews with senior Ukrainian military leaders, soldiers and officers in the field, and analysts.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nThe strategy stands in contrast to the nine-month-long battle for the salt-mining city of Bakhmut, where Ukrainian troops suffered heavy casualties in an ultimately futile attempt to not cede ground.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago."}, {"id": "6059a7f2-1470-4768-8f43-e10c3d2c08bc", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-15 05:15", "url": "https://abcnews.go.com/International/wireStory/ukraine-employs-flexible-defense-waiting-new-western-ammo-111145690", "domain": "abcnews.go.com", "domain_classification": "International", "message": "By ceding some territory, Ukraine has been able to fight from better defended positions, according to interviews with senior Ukrainian military leaders, soldiers and officers in the field, and analysts.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago.\nOne unit in the Chasiv Yar area said a quarter of its casualties happen while transporting troops to and from front-line positions.\nTor, the commander of the Kotyky unit in Chasiv Yar, said Russia's ever-present drones have made it impossible to mask especially large troop movements."}, {"id": "1a544a9a-f5c1-4ab4-acdc-9fac9f91a408", "title": "Protecting trainers Canada priority as France pushes new mission in Ukraine , top soldier says", "date": "2024-06-15 08:00", "url": "https://www.cbc.ca/news/politics/ukraine-russia-unifer-canadian-trainers-1.7235620", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Chief of the Defence Staff Gen. Wayne Eyre received a briefing on the training mission from his French counterpart following D-Day commemoration ceremonies last week.\nChief of the Defence Staff Gen. Wayne Eyre arrives to appear before the House of Commons standing committee on national defence in Ottawa on Tuesday, Oct. 18, 2022.\n(Sean Kilpatrick/The Canadian Press)Canada and other allies started operating military training missions inside Ukraine in 2015, well before Russia launched its full-scale invasion in February 2022.\nThe battle schools for Ukrainian troops have continued in the United Kingdom, Poland and Latvia.\nSome defence analysts have suggested that Canada may wait for the cessation of hostilities before sending military trainers back into Ukraine."}, {"id": "e5b20b13-1773-445e-a648-c7c76eb91deb", "title": "MoD of Russia Reports for June 8th thru June 14th , 2024 … – Windows to Russia", "date": "2024-06-15 06:00", "url": "https://windowstorussia.com/mod-of-russia-reports-for-june-8th-thru-june-14th-2024.html", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The units of the Sever Group of Forces continued to move deep into the enemy defence during combat actions.\nThe AFU losses were up to 3,405 Ukrainian troops, four armoured fighting vehicles, 32 motor vehicles, 30 field artillery guns, including seven U.S.-made M777 howitzers.\nThe AFU losses were up to 3,785 Ukrainian troops, 11 armoured fighting vehicles, 48 motor vehicles, and 39 field artillery guns, 14 of which were Western-made.\nThe AFU losses were up to 965 Ukrainian troops, two tanks, six armoured fighting vehicles, 29 motor vehicles, two Czech-made Vampire MLRS combat vehicles, and 12 field artillery guns.\nThe AFU losses were up to 555 Ukrainian troops, 37 motor vehicles, and 26 field artillery guns, seven of which were foreign-made."}, {"id": "0eff5592-8293-4606-85fb-936d4f933fc3", "title": "PlayStation Most Popular PS5 Game Last Month Was an Xbox Exclusive", "date": "2024-06-15 01:00", "url": "https://comicbook.com/gaming/news/playstation-ps5-games-sea-of-thieves/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "For all the PlayStation users still entrenched in console warfare who were adamant about PlayStation 5 owners not wanting anything to do with Xbox's former exclusives going multi-platform, the charts showing which PlayStation games were most popular last month would like a word.\nSea of Thieves, the seafaring pirate game from Rare and Xbox which released over six years ago now, topped the PlayStation 5 charts for May.\nThe PS5 version of Sea of Thieves released on April 30th, so it had plenty of time to climb these charts.\nYou'll notice that Grounded, another Xbox Game Studios game which was one of the first four to go multiplatform, also made the list.\nOver in Europe, Sea of Thieves was the most downloaded PS5 game as well with Grounded appearing on the same list albeit at a few spots lower than where it placed in the U.S. charts."}, {"id": "d5da5d15-2ecf-491a-ab4a-6aca25ce572b", "title": "Minister Blair concludes productive visit to Brussels for Ukraine Defense Contact Group meeting and NATO Defence Minister meeting", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/wmd/library/news/canada/2024/canada-240614-canada01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Minister Blair concludes productive visit to Brussels for Ukraine Defense Contact Group meeting and NATO Defence Ministers' meetingNational DefenceNews releaseJune 14, 2024 - Brussels, Belgium - National Defence / Canadian Armed ForcesToday, the Honourable Bill Blair, Minister of National Defence, concluded a productive visit to Brussels, Belgium, where he participated in the 23rd Ukraine Defense Contact Group (UDCG) meeting and a meeting of North Atlantic Treaty Organization (NATO) Defence Ministers, including a meeting of the NATO-Ukraine Council in Defence Ministers format.\nFollowing the UDCG meeting, Minister Blair signed a Letter of Intent for the Armour Capability Coalition, formalizing Canada's membership in the Coalition.\nOn June 13 and 14, Minister Blair participated in a meeting of NATO Defence Ministers ahead of next month's NATO Leaders' Summit in Washington.\nOn the margins of the Defence Ministers' Meeting, Minister Blair and his Romanian counterpart, Defence Minister Angel TÃ®lvÄƒr, signed a new Canada-Romania Defence Cooperation Memorandum of Understanding (MOU).\nAt NATO HQ in Brussels, Minister Blair also held productive meetings with:Norway's Minister of Defence, BjÃ¸rn Arild Gram, and Germany's Minister of Defence, Boris Pistorius."}, {"id": "4795264d-185d-4534-93b4-01b6d08649e1", "title": "Tom Glynn - Carney On His  House Of Dragon  Character :  Immensely Troubled , Very Complex  ", "date": "2024-06-15 11:45", "url": "https://www.outlookindia.com/art-entertainment/hollywood/tom-glynn-carney-on-his-house-of-dragon-character-immensely-troubled-very-complex", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "The series is set 200 years before the events of ‘Game of Thrones’, and serves as its prequel.\nIt is based on George R. R. Martin’s ‘Fire & Blood’, and highlights the great Targaryen War and the Dance of the Dragons.\nTom opened up on his character and how he came to understand his role.\nTalking about his character, Tom said: “You should never, as an actor, judge a character because I feel like if you judge them you might dislike them and that’s not good.\nI think he’s immensely troubled and very complex, for good reasons.”"}, {"id": "d2e5c549-97c5-45b6-a3ce-70c5b3f12dfc", "title": "Military Book Review Longstreet : The Confederate General Who Defied the South", "date": "2024-06-15 13:45", "url": "http://www.strategypage.com/bookreviews/2592", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "Varon begins by reviewing Longstreet’s Civil War record, from Second Bull Run Manassas, through Fredericksburg, Knoxville, Gettysburg, Chickamauga, and on to Appomattox.\nBeauregard, George Pickett, D.H. Hill, and Porter Alexander, the champions of the “Lost Cause” built upon the general’s support for Reconstruction.\nVaron brings James Longstreet out of the realm of myth – the Lost Cause doctrine – and into the much more interesting domain of history.\nFinally, Varon depicts Longstreet as a relevant voice during the 19th century postbellum, and President Theodore Roosevelt believed the general to be patriotic and loyal.\nLongstreet: The Confederate General Who Defied the South is a groundbreaking, compelling, balanced and altogether remarkable book about Lee’s “Old War Horse.”---///---Note: Longstreet: The Confederate General Who Defied the South is also available in paperback, audio, and e-editions."}, {"id": "8ec954e9-c506-4107-b0e2-426f672f5c47", "title": "China wants a fleet of aircraft carriers for pride and power , and it building it at a breakneck pace", "date": "2024-06-15 13:15", "url": "https://www.yahoo.com/news/china-wants-fleet-aircraft-carriers-121501761.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "China wants a fleet of aircraft carriers for pride and power, and it's building it at a breakneck paceChina's newest aircraft carrier is a substantial capability jump as it builds a modern blue-water navy.\nChina is building a fleet of aircraft carriers, making technological and capability jumps at a breakneck pace.\nAn aerial drone photo taken on May 1, 2024 shows China's third aircraft carrier, the Fujian, during its maiden sea trials.\nFor China, having aircraft carriers allows it to enjoy many of those perks.\nA composite image shows the American flag flying near the bridge of the US Navy's first-in-class aircraft carrier USS Gerald R. Ford and the Chinese flag flying near China's aircraft carrier Shandong."}, {"id": "1c6802b7-31a3-43d1-b319-ed4b0830d557", "title": "China wants a fleet of aircraft carriers for pride and power , and it building it at a breakneck pace", "date": "2024-06-15 13:15", "url": "https://www.yahoo.com/news/china-wants-fleet-aircraft-carriers-121501865.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "China wants a fleet of aircraft carriers for pride and power, and it's building it at a breakneck paceChina's newest aircraft carrier is a substantial capability jump as it builds a modern blue-water navy.\nChina is building a fleet of aircraft carriers, making technological and capability jumps at a breakneck pace.\nAn aerial drone photo taken on May 1, 2024 shows China's third aircraft carrier, the Fujian, during its maiden sea trials.\nFor China, having aircraft carriers allows it to enjoy many of those perks.\nA composite image shows the American flag flying near the bridge of the US Navy's first-in-class aircraft carrier USS Gerald R. Ford and the Chinese flag flying near China's aircraft carrier Shandong."}, {"id": "5cd5a9c6-7b62-49c0-9595-7bfd655a7a83", "title": "Why China Wants to Build Aircraft Carriers - Business Insider", "date": "2024-06-15 13:00", "url": "https://www.businessinsider.com/why-china-wants-to-build-aircraft-carriers-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewChina is building a fleet of aircraft carriers, making technological and capability jumps at a breakneck pace.\nAn aerial drone photo taken on May 1, 2024 shows China's third aircraft carrier, the Fujian, during its maiden sea trials.\nThe aircraft carrier USS Gerald R. Ford transits the Strait of Gibraltar, Jan. 5, 2024.\nFor China, having aircraft carriers allows it to enjoy many of those perks.\nA composite image shows the American flag flying near the bridge of the US Navy's first-in-class aircraft carrier USS Gerald R. Ford and the Chinese flag flying near China's aircraft carrier Shandong."}, {"id": "82d173f9-867d-4923-845d-f9ca870d9143", "title": "Germany sets aside unease over its military to celebrate first Veteran Day", "date": "2024-06-15 04:30", "url": "https://www.cnn.com/2024/06/15/europe/germany-first-veterans-day-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Germany is marking its first Veterans’ Day since World War Two on Saturday, a once unthinkable move that sets aside long-standing unease over the honoring of its soldiers.\n“We on the left reject this Veterans’ Day,” he told CNN in a statement.\nThe commemorations, modeled on Armed Forces Day in the UK and Veterans Day in the US, will honor all Germans who have worn military uniform – not only those wounded or killed in combat.\nBut the biggest spur to creating a Veterans’ Day has been Ukraine.\nHe played a prominent role in forming the new Veterans’ Day bill."}, {"id": "fe8463c1-4094-4c0e-9a92-8af384f307ba", "title": "Shin Megami Tensei V : Vengeance gameplay", "date": "2024-06-15 10:45", "url": "https://nintendoeverything.com/shin-megami-tensei-v-vengeance-gameplay/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Tons of gameplay is here for Shin Megami Tensei V: Vengeance.\nOr explore the original story told in Shin Megami Tensei V, the “Canon of Creation” – an eternal conflict between angels and demons, in which the protagonist fights for the world’s fate.\nMassively expanded with new areas, demons, and music, Shin Megami Tensei V: Vengeance features more accessible gameplay, an improved battle system, new demon experiences, and greater field exploration.\nFind the Shin Megami Tensei V: Vengeance gameplay below.\nGameplayShin Megami Tensei V: Vengeance, which is out physically and digitally, supports English, Portuguese, Spanish, French, German, Italian, and Russian."}, {"id": "34146470-3246-45e2-bdbe-e85410898690", "title": "Sudan : A Senior RSF Commander Killed in North Darfur", "date": "2024-06-15 01:15", "url": "https://allafrica.com/stories/202406140782.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "The commander of Rapid Support Operations in the Darfur region of western Sudan, General Ali Yaqoub Jibril, was killed in battles that took place between his forces and the army and joint forces today, Friday, near the city of El Fasher.\nYacoub had led the Rapid Support Forces (RSF) operations in Darfur, including the siege of El Fasher City in North Darfur State, for over a month.\nEyewitnesses said that the army and joint forces chased the RSF outside El Fasher after they were able to repel a massive attack on the city.\nThe joint forces of the armed groups allied to the army since April claimed they were \"able to eliminate more than 1,000 RSF soldiers\" in today's battle.\nClashes have been taking place for days in large areas in North Darfur, including the Amber Valley area in North Darfur State."}, {"id": "e7acb190-1456-4cd8-9589-519e8977c94f", "title": "How the Wild West Was Won with Ray Mears - BBC Four HD", "date": "2024-06-15 13:15", "url": "https://www.tvguide.co.uk/schedule/a71e93e6-a5b0-5ea4-bc3c-f22469d49faa/how-the-wild-west-was-won-with-ray-mears", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "How the Wild West Was Won with Ray MearsBBC Four HD 7:00 PM to 8:00 PM Saturday 15 June Share Add toCalendar +Deserts Season 1 Episode 3 of 3 S Subtitles Audio DescriptionHow the landscapes of America's five great deserts challenged the pioneers' westward push.\nBeginning in Monument Valley on the Arizona-Utah state line, Ray discovers how the US cavalry struggled in the hot arid landscape, explores how the Apache adapted their warfare methods to the hostile conditions and reveals why the forbidding landscape proved the perfect refuge for banditsHow the Wild West Was Won with Ray Mears airs on BBC Four HD at 7:00 PM, Saturday 15 June .\n(Subtitles, audio description, finale, series.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "8f2f0519-83b5-477a-8196-96f3efebe262", "title": "Hyderabad : Air Force Chief urges young cadets to adopt , innovate , and leverage technology effectively", "date": "2024-06-15 14:15", "url": "http://www.uniindia.com/~/hyderabad-air-force-chief-urges-young-cadets-to-adopt-innovate-and-leverage-technology-effectively/States/news/3221366.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Hyderabad: Air Force Chief urges young cadets to adopt, innovate, and leverage technology effectivelyHyderabad, June 15 (UNI ) Air Chief Marshal VR Chaudhari, Chief of the Air Staff (CAS) on Saturday urged the young graduating officers from the Air Force Academy (AFA) to adapt, innovate, and leverage technology effectively.\nChaudhari, who reviewed the combined graduation parade (CGP) at Air Force Academy (AFA) at Dundigal , outskirts of the city, also urged them to strive for excellence through consistency, discipline, positive attitude, and passion for every task at hand.\nHe also congratulated the officers from the Indian Navy, the Indian Coast Guard, and friendly foreign countries who earned their ‘Flying Wings’ on Saturday.\nThe CAS wished the newly commissioned officers continued success in their future endeavours, before concluding his speech.\nTo mark the successful culmination of training of 235 flight cadets of flying and ground duty branches of the Indian Air Force."}, {"id": "92e00af5-eae7-49c0-9be3-bdf8471629b9", "title": "US Navy facing  most sustained combat since WWII  in Red Sea", "date": "2024-06-15 00:00", "url": "https://www.fox35orlando.com/news/navy-red-sea-combat", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "The U.S. Navy is engaged in intense combat with Iran-backed Houthi rebels from Yemen the Associated Press reported on Friday.\nThis conflict, which has been overshadowed by the Israel-Hamas war, is the most significant sea battle the Navy has faced since World War II.\nThe Navy has faced similar periods of combat during the 1980s Tanker Wars, but the current conflict is more sustained.\nWho are the Houthi rebels and why are they attacking the US?\nThe Houthi rebels, also known as Ansar Allah, are a Zaydi Shiite group from Yemen."}, {"id": "a7aa889e-de36-4d29-9dfc-d75c645866fb", "title": "Watch : Man And Tiger Battle It Out In Epic Tug Of War Game", "date": "2024-06-15 07:15", "url": "https://www.news18.com/viral/watch-man-and-tiger-battle-it-out-in-epic-tug-of-war-game-8933278.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The 1-minute 26-second clip starts with a strong-looking, muscular man pulling a rope through a partition, on the other side of it is a young tiger with the same rope in its mouth.\nThe tiger is pulling the rope harder, making the man sweat on his life.\nImpressively, several times the tiger pulls hard enough to drag the man on his feet, closer to the partition.\nZoo gives visitors the chance to test their strength.”Tiger tug-o-war!\nZoo gives visitors the chance to test their strength pic.twitter.com/chSmqaTE8f— Nature is Amazing ☘️ (@AMAZlNGNATURE) June 13, 2024Netizens reacted to the video in the comments section below."}, {"id": "6ef78696-3246-48f6-ac88-846fd0b6b080", "title": "Modern warfare no longer solely physical domain , says IAF chief V R Chaudhari", "date": "2024-06-15 06:15", "url": "https://indianexpress.com/article/india/modern-warfare-physical-domain-iaf-chief-v-r-chaudhari-9393949/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "Modern warfare is no longer a solely physical domain, but a dynamic and ever-evolving landscape increasingly influenced by complex data networks and advanced cyber technologies, Air Chief Marshal VR Chaudhari said on Saturday.\nAddressing the Combined Graduation Parade of the 213 Officers’ Course at the Air Force Academy (AFA) in Dundigal near here, Chaudhari also said tomorrow’s conflicts cannot be fought with yesterday’s mindset."}, {"id": "210e6f11-9c32-4751-bdf2-0b33dd1f9a8c", "title": "Heated auction in Maiden Gully ends with nanna house selling | Bendigo Advertiser", "date": "2024-06-15 07:45", "url": "https://www.bendigoadvertiser.com.au/story/8663670/heated-auction-in-maiden-gully-ends-with-nannas-house-selling/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"She was just happy for me to do whatever I needed to do [with the property],\" Chloe said moments after a drawn out auction battle between at least three bidders had finished."}, {"id": "3301e268-a1c4-41e6-9409-2e25218ad4b4", "title": "Heated auction in Maiden Gully ends with nanna house selling | Bendigo Advertiser", "date": "2024-06-15 07:45", "url": "https://www.bendigoadvertiser.com.au/story/8663670/heated-auction-in-maiden-gully-ends-with-nannas-house-selling/?cs=3355", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"She was just happy for me to do whatever I needed to do [with the property],\" Chloe said moments after a drawn out auction battle between at least three bidders had finished."}, {"id": "a2ffd06d-f3d5-4a3b-a07b-b875b9586c18", "title": "IAF Chief urges graduating officers to adapt , innovate and leverage technology effectively", "date": "2024-06-15 14:30", "url": "http://www.uniindia.com/~/iaf-chief-urges-graduating-officers-to-adapt-innovate-and-leverage-technology-effectively/States/news/3221371.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "IAF Chief urges graduating officers to adapt, innovate and leverage technology effectivelyHyderabad, June 15 (UNI) Air Chief Marshal VR Chaudhari on Saturday urged the young graduating officers from the Air Force Academy (AFA) to adapt, innovate, and leverage technology effectively.\nSpeaking on modern warfare, the IAF Chief reminded the passing out cadets that modern warfare is dynamic and ever evolving, and increasingly influenced by complex data networks and advanced cyber technologies.\nComplimenting the newly commissioned officers for their immaculate turnout, precise drill movements and high standards of parade, he congratulated the passing-out officers on the successful completion of their training and on receiving the President’s Commission in the IAF.\nThe Air Chief Marshal also congratulated the officers from the Indian Navy, the Indian Coast Guard and friendly foreign countries who earned their ‘Flying Wings’ today.\nThe IAF Chief wished the newly commissioned officers of continued success for their future endeavours, before concluding his speech."}, {"id": "ea002178-4a36-4c5f-a39c-bbcf2fe25a64", "title": "Israel bides its time , as Hezbollah hedges its bets", "date": "2024-06-15 14:15", "url": "https://www.niagarafallsreview.ca/politics/political-opinion/israel-bides-its-time-as-hezbollah-hedges-its-bets/article_84fe7f15-f14f-55c5-8112-2c7943eb867c.html", "domain": "niagarafallsreview.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "a442246d-acc0-49a8-a616-c3d2e99c5e3c", "title": "Every Little Thing review – hummingbird documentary shimmers with the best of humanity", "date": "2024-06-15 00:00", "url": "https://www.theguardian.com/film/article/2024/jun/15/every-little-thing-review-hummingbird-documentary-shimmers-with-the-best-of-humanity", "domain": "theguardian.com", "domain_classification": "International", "message": "Miracles abound in Australian director Sally Aitken’s film Every Little Thing, which is inspired by Terry Masear’s 2016 book Fastest Things on Wings.\nView image in fullscreen For 18 years Terry Masear has been caring for injured hummingbirds in her Beverly Hills home.\nBut life, as Masear tells us at one point, is a series of metaphors stacked up on top of each other, and so it is with Every Little Thing.\nBut kindness is at the core of Every Little Thing.\nThe measure of Masear’s humanity is how she treats, yes, every little thing."}, {"id": "3c3c6b88-7b3c-4c15-b8c4-3da2a8ba9a4b", "title": "Australia and New Zealand honour their war dead with dawn services on Anzac Day", "date": "2024-06-15 14:00", "url": "http://www.myanmarmuslim.net/news/20240615470f599521.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Hundreds of thousands of people gathered under a full moon across Australia and New Zealand for dawn services on Thursday to commemorate their war dead on Anzac Day.\nMr Albanese trekked to the memorial in the town of Isurava over two days with Papua New Guinea Prime Minister James Marape.\nWords that adorn the Memorial at Isurava on the Kokoda Track where I was honoured to commemorate Anzac Day at a moving ceremony, together with PNG Prime Minister James Marape.\nChina’s foreign minister Wang Yi visited Papua New Guinea at the weekend to discuss with Mr Marape building closer relations.\nIn New Zealand, Mr Luxon told the crowd that the country had to thank its military personnel for their freedom and democracy."}, {"id": "58e1b6dc-e3aa-4012-8a00-37da655b23fa", "title": "House of the Dragon Review : Season Two Soars to New Heights", "date": "2024-06-15 02:30", "url": "https://www.vulture.com/article/house-of-the-dragon-season-2-review.html", "domain": "vulture.com", "domain_classification": "Unknown", "message": "Photo: Theo Whiteman/Theo WhitemanWant to watch House of the Dragon with us?\nHBO may be burning Game of Thrones spinoffs (pardon me, “successor shows”) left and right, but House of the Dragon still stands tall.\nDespite the pomp and circumstance, House of the Dragon’s first season felt like one long throat-clearing sound.\nCall it another direct result of House of the Dragon slowing down and engaging in the intimacy of the world it’s depicting.\nThe new episodes lean into this style — so much so, in fact, that House of the Dragon makes Game of Thrones feel naturalistic in comparison."}, {"id": "5e205736-d523-467e-8226-0f9016c0dae7", "title": "Xbox Game Pass : Play These Award - Winning RPGs and a Cult - Hit Horror Game Now", "date": "2024-06-15 11:30", "url": "https://www.cnet.com/tech/gaming/xbox-game-pass-play-these-award-winning-rpgs-and-a-cult-hit-horror-game-now/", "domain": "cnet.com", "domain_classification": "Unknown", "message": "Xbox Game Pass Ultimate, a CNET Editors' Choice award pick, offers hundreds of games you can play on your Xbox Series X, Series S, Xbox One and PC for $17 a month.\nMicrosoft brought Hellblade: Senua's Saga 2 and other titles to Game Pass Ultimate in May, and the company added these games to the service in June.\nMicrosoft brought this Japanese roleplaying game back to Game Pass Ultimate, so if you weren't able to play it before, now's your chance.\nThe spiritual successor to the Dead Space franchise is crash-landing on Game Pass Ultimate.\nTitles that left Game PassThough Microsoft is adding those six titles to Game Pass Ultimate, it also removed five games from the service."}, {"id": "99ae8265-7b5f-44b5-8bbd-2c3e2678f03e", "title": "Tom Glynn - Carney on his  House of Dragon  character :  Immensely troubled , very complex  ", "date": "2024-06-15 12:00", "url": "https://www.prokerala.com/news/articles/a1539671.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Mumbai, June 15 : Actor Tom Glynn-Carney, who essays the role of King Aegon II in the streaming series 'House of the Dragon', feels that his character in the show has abandonment issues and a guilt complex.\nThe series is set 200 years before the events of 'Game of Thrones', and serves as its prequel.\nIt is based on George R. R. Martin's 'Fire & Blood', and highlights the great Targaryen War and the Dance of the Dragons.\nTalking about his character, Tom said: \"You should never, as an actor, judge a character because I feel like if you judge them you might dislike them and that's not good.\n'House of the Dragon' season 2, in India, is streaming on JioCinema with new episodes dropping every Monday."}, {"id": "7e4cfe87-a939-4000-9922-1bcb55b3ac27", "title": "Flag Day celebrated by honoring 100 - year - old World War II veteran", "date": "2024-06-15 04:00", "url": "https://www.nny360.com/communitynews/communitynotes/flag-day-celebrated-by-honoring-100-year-old-world-war-ii-veteran/article_c27fb425-1eed-5da6-b866-0ac1443a3c35.html", "domain": "nny360.com", "domain_classification": "Unknown", "message": "Six-day (Tuesday through Sunday) print subscribers of the Watertown Daily Times are eligible for full access to NNY360, the NNY360 mobile app, and the Watertown Daily Times e-edition, all at no additional cost.\nIf you have an existing six-day print subscription to the Watertown Daily Times, please make sure your email address on file matches your NNY360 account email.\nYou can sign up or manage your print subscription using the options below."}, {"id": "492e6b1a-c5fd-4c1d-bda5-450b775a29c6", "title": "Secretary of Defense Lloyd J . Austin III Press Conference Following NATO Ministers of Defense Meeting in Brussels , Belgium", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-dod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "June 14, 2024TranscriptSecretary of Defense Lloyd J. Austin III Press Conference Following NATO Ministers of Defense Meeting in Brussels, BelgiumSecretary of Defense Lloyd J. Austin IIISTAFF: Well, good afternoon, ladies and gentlemen.\nIt is my pleasure to introduce Secretary of Defense Lloyd Austin, III.\nAnd finally, we reaffirmed yesterday in the NATO Ukraine Council our enduring commitment to a free and sovereign Ukraine.\nQ: Mr. Secretary, as you mentioned, since Russia's full scale invasion of Ukraine, NATO has expanded to include two new member states.\nAnd I see -- I think NATO brings tremendous value to those efforts."}, {"id": "881fb41f-48e1-4a3e-be1d-c8fdfb080acf", "title": "Bangkok Post - Stop making the  Munich in 1938  analogies", "date": "2024-06-15 04:00", "url": "https://www.bangkokpost.com/opinion/opinion/2811329/stop-making-the-munich-in-1938-analogies", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Stop making the 'Munich in 1938' analogiesScarcely a week passes without some media pundit or attention-seeking historian warning that a Great War is nigh.\nTo argue that a \"Great War\" is coming' the doom-mongers have to pretend that such a war will be necessary to stop the Russians.\nThe \"Munich\" syndrome has been used to justify a great deal of subsequent folly from Vietnam to Iraq.\nInstead, the cowards tried to \"appease\" Hitler at the Munich summit in 1938 by giving him Czechoslovakia, and after that, it was too late to stop him.\nThat's how World War II really got underway, and it doesn't bear the slightest resemblance to what is happening today."}, {"id": "0cc6d5a7-ecf2-4e63-9b82-46704dbb804c", "title": "Tom Glynn - Carney On His  House Of Dragon  Character :  Immensely Troubled , Very Complex  ", "date": "2024-06-15 10:45", "url": "https://menafn.com/1108337182/Tom-Glynn-Carney-On-His-House-Of-Dragon-Character-Immensely-Troubled-Very-Complex", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Mumbai, June 15 (IANS) Tom Glynn-Carney, who essays the role of King Aegon II in the streaming series 'House of the Dragon', feels that his character in the show has abandonment issues and a guilt complex.\nThe series is set 200 years before the events of 'Game of Thrones', and serves as its prequel.\nIt is based on George R. R. Martin's 'Fire & Blood', and highlights the great Targaryen War and the Dance of the Dragons.\nTalking about his character, Tom said:“You should never, as an actor, judge a character because I feel like if you judge them you might dislike them and that's not good.\nI think he's immensely troubled and very complex, for good reasons.”He further mentioned:“I think he has abandonment issues and I think he has a guilt complex."}, {"id": "68f67418-a9d4-4689-9e7d-f3ffeb5e2677", "title": "Stop the  Munich  analogies | Columnist | trinidadexpress . com", "date": "2024-06-15 04:15", "url": "https://trinidadexpress.com/opinion/columnists/stop-the-munich-analogies/article_4bf75ed0-2ab8-11ef-9865-4fbd591d7963.html", "domain": "trinidadexpress.com", "domain_classification": "Unknown", "message": "The rains have come.\nBurnt browns have given way to verdant green.\nWhat is the colour of the rainy season?\nThis time round it is maroon.\nThe mercurial maroon that has been bringing us to the edge—as it has so often done—and now rewarding us with a season of more highs than lows."}, {"id": "3cb7f54d-fd4a-49c1-ad7d-227fbfbb38f7", "title": "Modern warfare no longer a physical domain : IAF chief in Hyderabad", "date": "2024-06-15 13:00", "url": "https://www.siasat.com/modern-warfare-no-longer-solely-physical-domain-says-iaf-chief-3045468/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Hyderabad: Modern warfare is no longer a solely physical domain, but a dynamic and ever-evolving landscape increasingly influenced by complex data networks and advanced cyber technologies, IAF Chief Air Chief Marshal VR Chaudhari said on Saturday.\nAs leaders, you all need to adapt, innovate and leverage technology effectively for proving decisive in winning wars,” the Air Chief Marshal said.\nSpeaking on the IAF’s vision statement of ‘People First, Mission Always’, Chaudhari urged newly commissioned officers to earn the respect of their subordinates and peers through professional competence, physical and moral courage, character and empathy.\nThe CGP marks the successful culmination of the training of 235 flight cadets of flying and ground duty branches of the Indian Air Force.\nThe graduating officers included 22 women officers who got commissioned in various branches of the IAF, a Defence release said."}, {"id": "266f7266-11b5-4a1b-93c4-d5e407792682", "title": "Germany sets aside unease over its military to celebrate first Veteran Day - LocalNews8 . com", "date": "2024-06-15 09:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/14/germany-sets-aside-unease-over-its-military-to-celebrate-first-veterans-day/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Nadine Schmidt and Sophie Tanno, CNN(CNN) — Germany is marking its first Veterans’ Day since World War Two on Saturday, a once unthinkable move that sets aside long-standing unease over the honoring of its soldiers.\n“We on the left reject this Veterans’ Day,” he told CNN in a statement.\nThe commemorations, modeled on Armed Forces Day in the UK and Veterans Day in the US, will honor all Germans who have worn military uniform – not only those wounded or killed in combat.\nBut the biggest spur to creating a Veterans’ Day has been Ukraine.\nHe played a prominent role in forming the new Veterans’ Day bill."}, {"id": "c6880ed3-686b-4278-a88f-265e528402ed", "title": "Greek PM reshuffles cabinet after worse than expected EU vote result", "date": "2024-06-15 06:15", "url": "https://www.euractiv.com/section/elections/news/greek-pm-reshuffles-cabinet-after-worse-than-expected-eu-vote-result/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "The changes were announced after Mitsotakis’ centre-right party performed worse than expected in Sunday’s election to the European Parliament.\nMitsotakis’ New Democracy party, which has led Greece since 2019, came first in Sunday’s election with 28.3% of the vote.\nBut it missed a 33% target set by Mitsotakis and was below the 40% the party received in a national election in June 2023.\nA record 59% of registered voters abstained in the EU vote.\nSo replacing the development minister was a corrective move he (Mitsotakis) had to take,” political analyst Apostolos Pistolas said."}, {"id": "af67145c-001b-406a-aa21-5aabc8e17816", "title": "Opinion : Changing Trajectory in Russia - Iran Relations ? ", "date": "2024-06-15 12:30", "url": "https://www.kyivpost.com/opinion/34333", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "According to the Iranian political system, the President is second only to the most powerful appointment (the supreme leader).\nAlthough experts have not credited his Moscow visit with any substantial agreements, it did elevate Tehran’s economic engagement between the two countries.\nBut the highlight of Tehran’s relations with Moscow is not economic engagement but strengthened military cooperation between the two countries.\nI expected a similar upward trajectory, or at best a steady continuation (when political leaders from both countries, during an interview, mentioned a unified payment system to me).\nWhich means the payment settlement systems appear functional only on paper, in reality the markets remain devoid of any payment system, forcing traders to opt for commission processes."}, {"id": "3dde9bc5-ace0-4f95-8323-381ba200a8c9", "title": "GOP Votes To Restore Confederate Monument", "date": "2024-06-15 13:15", "url": "https://blackamericaweb.com/2024/06/14/192-house-republicans-voted-to-restore-a-confederate-monument-depicting-white-soldiers-and-black-mammies/", "domain": "blackamericaweb.com", "domain_classification": "Unknown", "message": "But in the real time of 2024, and just days before Juneteenth, here’s what’s happening:Yesterday, 192 House Republicans voted in favor of restoring a Confederate monument to Virginia’s Arlington National Cemetery.\nIt includes depictions of Black slaves, one looking after a white soldier’s baby, another appearing to follow his master into battle.\nOn Thursday, the House voted on an amendment to the 2024 National Defense Authorization Act calling for the Arlington Confederate Memorial to be reinstalled in its original position.\nSEE MORE:Lawsuit Filed To Remove North Carolina Courthouse’s Confederate Monument For ‘Faithful Slaves’“Supporting White Culture’: Florida Bill To Protect Confederate Monuments AdvancesThe post 192 House Republicans Voted To Restore A Confederate Monument Depicting White Soldiers And Black ‘Mammies’ appeared first on NewsOne.\n192 House Republicans Voted To Restore A Confederate Monument Depicting White Soldiers And Black ‘Mammies’ was originally published on newsone.com"}, {"id": "1cecb801-cfd4-471e-be5d-a60588654d1b", "title": "  Star Spangled Banner : Flag Day and the U . S . Army Birthday – PJ Media", "date": "2024-06-15 01:15", "url": "https://pjmedia.com/catherinesalgado/2024/06/14/flag-day-and-us-armys-birthday-n4929902", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "The patriots of our past fought and died for that flag, and today on Flag Day we too honor the Star Spangled Banner.\nToday I want to share the story of the song that is now our national anthem, the “Star Spangled Banner,” honoring our flag.\nIt was during the War of 1812 that the story of the “Star Spangled Banner” began.\nOn March 3, 1931, Herbert Hoover signed a congressional act making the “Star Spangled Banner” our national anthem.\nToday, take the time to thank a U.S. soldier and sing the “Star Spangled Banner” while saluting our flag."}, {"id": "83bb249a-9893-4cc7-a007-eb21b221bc90", "title": "IDF upgrades old helicopters , utilizes them for war amid lack of newer models", "date": "2024-06-15 00:30", "url": "https://www.ynetnews.com/article/s19qwqqsc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "During the war, Israeli helicopters flew for several hours towards a distant target in what was the longest operation since October 7.\nThe intense fighting in the early days of the war led to significant changes in the use of the Yasur helicopters.\nThe Yasur helicopters were originally scheduled for decommissioning at the beginning of the decade, with plans to replace them with the new CH-53K model from Lockheed Martin-Sikorsky.\n\"We must maintain operational readiness for the personnel, which cannot be fully achieved with simulators, so training on the Yasur helicopters continues.\n4 View gallery ( Photo: IDF Spokesperson's Unit )These helicopters, which arrived in Israel in the late 1960s directly from the Vietnam War, have seen extensive use."}, {"id": "25da8db7-892c-43f9-a638-6ff92fd6a88b", "title": "GOP Votes To Restore Confederate Monument", "date": "2024-06-15 01:15", "url": "https://newsone.com/5305738/confederate-monument-white-soldiers-black-mammies-gop-votes-in-favor/", "domain": "newsone.com", "domain_classification": "Unknown", "message": "But in the real time of 2024, and just days before Juneteenth, here’s what’s happening:Yesterday, 192 House Republicans voted in favor of restoring a Confederate monument to Virginia’s Arlington National Cemetery.\nBut likely even more offensive is that the monument includes a Black woman, in their words, “Mammy” who was caring for a white child.\nFrom Newsweek:The Confederate Memorial was unveiled in June 1914 by President Woodrow Wilson to commemorate soldiers and sailors who died fighting for the proslavery Confederate States of America during the Civil War.\nOn Thursday, the House voted on an amendment to the 2024 National Defense Authorization Act calling for the Arlington Confederate Memorial to be reinstalled in its original position.\nSEE MORE:Lawsuit Filed To Remove North Carolina Courthouse’s Confederate Monument For ‘Faithful Slaves’“Supporting White Culture’: Florida Bill To Protect Confederate Monuments Advances"}, {"id": "0e0d8132-ebed-47ab-97a1-cbcc25efafef", "title": "Sympathy must come before ideology during war - The Jerusalem Post", "date": "2024-06-15 10:15", "url": "https://www.jpost.com/opinion/article-806078", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "By adding extra prohibitions, the nazir tilts the system toward excessive abstinence, threatening to upset our divinely ordained religious equilibrium.\nIf we don’t finish this just and moral war, these maniacs will regroup, re-entrench themselves, and recover their capacity to attack us.\nThe clock is ticking, and each day that passes subjects the hostages to extra suffering and decreasing their chance of survival.\nMany are pondering the larger questions surrounding the war: How is this war a struggle over the image of God in our world?\nFamilies of hostages, families of fallen soldiers, displaced families, people traumatized by being caught in the Oct. 7 attack – these groups are the primary victims of our national trauma."}, {"id": "9ba24ada-fd16-4c47-a584-ff15f26d37a5", "title": "WestJet new  UltraBasic fare  plus other letters , June 15 :  Without carry - on baggage , flights would be ready to leave sooner  ", "date": "2024-06-15 09:45", "url": "https://www.theglobeandmail.com/opinion/letters/article-westjet-ultrabasic-fare-no-carry-on/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "As a Jewish person, I believe policing won’t make my community safer, nor will it address antisemitism’s root causes.\nTo combat antisemitism, our public discourse should distinguish between Jewish people and the state of Israel.\nWhen Independent Jewish Voices and other progressive Jewish groups try to distinguish between criticism of Israel and antisemitism, we are accused of being antisemitic ourselves.\nConsideration of environmental, social and governance investing is supposed to be about making the world a better, more sustainable place.\nWithout carry-on baggage, flights would be ready to leave sooner and, upon arrival, allow passengers to reach the terminal swiftly."}, {"id": "8bcaa49e-280f-48f5-a7f8-2c68983ad3ef", "title": "On board the Russian warship visiting Cuba", "date": "2024-06-15 02:45", "url": "https://www.yahoo.com/news/board-russian-warship-visiting-cuba-004013486.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "But now I was in a line for something unexpected: to board a Russian warship docked in Havana’s harbor.\nWhen a Russian diplomat told me that starting on Thursday, the Admiral Gorshkov frigate would offer tours to the public for three days, I was somewhat skeptical.\nPeople line up to visit Russian frigate Admiral Gorshkov (not pictured) docked in Havana's bay, Cuba, June 13, 2024.\nI noticed one of the Russian sailors taking in the blue skies and calm waters around us.\nFor a Russian sailor, Cuba could be as good as it gets these days."}, {"id": "01b7e547-9249-464d-ad93-84a3855437bc", "title": "  An Important Package : House Republicans Pass Nearly - $900 Billion NDAA , With Some Amendments", "date": "2024-06-15 00:15", "url": "http://www.newson6.com/story/666ccb98849b7de9c0ebd118/an-important-package:-house-republicans-pass-nearly-900-billion-ndaa-with-some-amendments", "domain": "newson6.com", "domain_classification": "Unknown", "message": "In a mostly party line vote, House Republicans Friday passed their version of the annual National Defense Authorization Act, or NDAA.\nThe nearly $900 billion measure includes standard support for the military, but also some nods to conservative cultural positions that most Democrats wouldn’t support.\n-In a mostly party-line vote, House Republicans Friday passed their version of the annual National Defense Authorization Act, or NDAA.\nThe nearly $900 billion measure includes standard support for the military, but also some nods to conservative cultural positions that most Democrats wouldn’t support.\nThe NDAA sets Pentagon policy and funding levels for the coming year -- $895 billion, a one percent increase over FY 2024 funding."}, {"id": "a2e3e526-b65c-4bc4-b35c-66d02669c5b1", "title": "  War is tough  - Ukrainian soldiers reveal mental toll of fighting on the frontline", "date": "2024-06-15 02:00", "url": "https://news.sky.com/story/war-is-tough-ukrainian-soldiers-reveal-mental-toll-of-fighting-on-the-frontline-13153333", "domain": "news.sky.com", "domain_classification": "International", "message": "His voice quiet and at times wobbly, a Ukrainian soldier called Maksym candidly shares his mental trauma from fighting on the frontline.\nLike the majority of Ukrainians fighting Russia's full-scale war, Maksym had previously been a civilian.\nThere are no publicly available figures on the number of Ukrainian military personnel and veterans who have PTSD, according to a report by the Kyiv Independent new outlet.\nStill, the facility is a relatively new idea to be able to treat Ukrainian soldiers' hidden mental wounds close to the frontline.\nBut with Ukraine suffering troop shortages, only those at the centre who display the most serious signs of mental trauma are sent on for further treatment."}, {"id": "63689bf4-0f28-4e69-9691-8c1a0c84dbf3", "title": "Russia has carried out 38 airstrikes and deployed 490 kamikaze UAVs in the past 24 hours – Ukraine General Staff", "date": "2024-06-15 00:15", "url": "https://www.yahoo.com/news/russia-carried-38-airstrikes-deployed-202802023.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia has carried out 38 airstrikes and deployed 490 kamikaze UAVs in the past 24 hours – Ukraine's General StaffThroughout the day on 14 June, the Russian forces launched six missile attacks on Ukrainian territory, totalling seventeen missiles.\nThere were 81 combat clashes recorded at the front.\nThe Russian invaders continue to be most active in the area of Novooleksandrivka, Sokol and Novopokrovsk.\nThe situation is difficult, but the Defence Forces have everything under control.\nThere were 20 combat clashes that occurred on the right of the Kurakhiv front."}, {"id": "ea911a34-3c44-4ffb-8f23-1423a5bed347", "title": "Adapt , innovate , use technology : Air Force chief tells graduating officers", "date": "2024-06-15 05:45", "url": "https://www.thehindu.com/news/national/adapt-innovate-use-technology-air-force-chief-tells-graduating-officers/article68292398.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "In an era marked with increasing influence of complex radar networks and advanced cyber technology, Air Chief Marshal V.R.\nChaudhari, during his address at the Combined Graduation Parade (CGP), urged the graduating officers from the Air Force Academy Dundigal near Hyderabad to adapt, innovate, and leverage technology for proving decisive in winning wars.\nAs the reviewing officer of the parade, Air Chief Marshal V.R.\nFlying Officer Taufeeq Raza was honoured with the President’s Plaque for standing first in the overall order of merit among the ground duty branches.\nAir Marshal Seethepalli Shrinivas, the commandant of the academy, administered the oath to the newly commissioned officers."}, {"id": "ac04f8cf-9e00-421b-ac06-30c1e99611e2", "title": "3rd annual racial healing event to take place next weekend", "date": "2024-06-15 14:15", "url": "https://www.dailypress.com/2024/06/15/3rd-annual-racial-healing-event-to-take-place-next-weekend/", "domain": "dailypress.com", "domain_classification": "Unknown", "message": "WILLIAMSBURG — Two people who claim family connections to Confederate Gen. Robert E. Lee will speak at the third annual Journey to Racial Healing ceremony next weekend.\nRobert W. Lee IV, a North Carolina pastor who describes himself as a collateral descendant of Robert E. Lee, according to a news release.\nThe ceremony’s other speaker is Tonia Cansler Merideth, who is a descendant of Gen. Lee’s great-great-grandmother, Judith Armistead.\n“The Journey to Racial Healing Ceremony is an opportunity for the community to meet people who are healing from family ties to slavery,” said Laura Hill, executive director of the Virginia Racial Healing Institute.\nThe event will include refreshments and an opportunity to view the Juneteenth Commemorative Art exhibit on display at the Stryker Center."}, {"id": "42975c35-fc73-408f-b640-259c87ef9178", "title": "House Of The Dragon Season 2 Review : Breathes fire , despite the flickering narrative", "date": "2024-06-15 07:30", "url": "https://timesofindia.indiatimes.com/web-series/reviews/english/house-of-the-dragon/season-2/seasonreview/111015052.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Review: In the Season 1 finale, Queen Rhaenyra’s half-brother Aegon II is newly crowned, and her son, Prince Lucerys (Elliot Grihault), is killed in a dragon fight with Aemond (Ewan Mitchell).\nTreachery and grief have set her on a path of revenge as Seven Kingdoms is thrown into a war zone.\nThings are about to get fiery as Rhaenyra is backed by House Velaryon and its biggest fleet of ships in Westeros.\nSeason 2 continues this tradition, delivering dragons, castles, the imposing Wall up north, and the intricate geography of the universe with uncompromising finesse.\nOverall, the high-stakes tension, strong performances, and impressive visuals ensure a season that will keep viewers on the edge of their seats."}, {"id": "f72fbb99-7f62-4460-b3a7-23b5134334bd", "title": "Life after war not easy for Russian soldiers with PTSD – DW – 06 / 15 / 2024", "date": "2024-06-15 06:15", "url": "https://www.dw.com/en/life-after-war-not-easy-for-russian-soldiers-with-ptsd/a-69367465", "domain": "dw.com", "domain_classification": "International", "message": "Many Russian military personnel return from the front line in Ukraine with post-traumatic stress disorder.\nRussian authorities have launched a program to treat military returning from the front who are suffering from PTSD.\nIn addition, many military personnel also refuse any offer of help.\nBut as Russian Health Minister Mikhail Murashko admitted, only 15% of those affected were able to receive treatment in 2023.\nThe psychotherapist said he expected to see an increase in crimes attributed to PTSD among Russian soldiers."}, {"id": "1f92b6b2-9f5a-42b0-94ba-16037232f22a", "title": "Two Battle Ground public schools offer free meals this summer", "date": "2024-06-15 00:45", "url": "https://www.kptv.com/2024/06/14/two-battle-ground-public-schools-offer-free-meals-this-summer/", "domain": "kptv.com", "domain_classification": "Unknown", "message": "BATTLE GROUND Ore. (KPTV) - Free meals will be available to anyone between the ages of 1 and 18 at two Battle Ground Public School locations this summer.\nIndividuals do not need to attend a Battle Ground school to participate as the program is available to all children and teens.\nSEE ALSO:Newberg-Dundee Public Schools announced its superintendent will be out on medical leave for several months.\nAny meals served must be eaten on the school grounds and there will be no curbside pickup service.\nBattle Ground Public Schools free summer meal plan poster (Battle Ground Public Schools)Copyright 2024 KPTV-KPDX."}, {"id": "46fdee70-aefc-4827-91f0-5270316ab2a2", "title": "Some animals from a Gaza zoo are now displaced along with their owner", "date": "2024-06-15 12:30", "url": "https://health.wusf.usf.edu/npr-health/2024-06-15/some-animals-from-a-gaza-zoo-are-now-displaced-along-with-their-owner", "domain": "health.wusf.usf.edu", "domain_classification": "Unknown", "message": "Fathi Jumaa, 60, owner of the Rafah Zoo, drove dozens of caged animals with him on his escape to Khan Younis, another city in Gaza already pummeled in the war.\nAt the time, Four Paws had dubbed his facility “the zoo of sorrows.”“He was not able to run the zoo,” Khalil says.\nIt paid the zoo owner for costs he had incurred while caring for the animals, and the owner signed an agreement not to reopen the Rafah Zoo, Khalil says.\nIn a statement to NPR, the military denied zoo animals had been treated by military veterinarians or had harmed soldiers in Gaza.\n“We share what we have to keep them alive.”Anas Baba reported from Khan Younis, Gaza Strip."}, {"id": "917bbbd3-34b3-4717-8c58-cda2832a2832", "title": "Innovate and adopt technology effectively for winning wars : Chief of Air Staff VR Chaudhari", "date": "2024-06-15 11:45", "url": "https://www.deccanchronicle.com/nation/innovate-and-adopt-technology-effectively-for-winning-wars-chief-of-air-staff-vr-chaudhari-899093", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Air Chief Marshal VR Chaudhari, Chief of the Air Staff (CAS), the Reviewing Officer, conferred the Presidents' Commission to the graduating flight cadets on successful completion of their training.\nThe ceremony was witnessed by a number of dignitaries from IAF and sister services as well as the family members of the graduating officers.\nThe CAS was received by Air Marshal Nagesh Kapoor, Air Officer Commanding-in-Chief, Training Command and Air Marshal S Shrinivas, Commandant AFA.\nThe graduating parade was interspersed by well-coordinated and synchronized fly-pasts by four trainer aircraft that comprised Pilatus PC-7 Mk-lI,Hawk, Kiran and Chetak helicopters.\nThe CAS wished the newly commissioned officers continued success for their future endeavours, before concluding his speech."}, {"id": "d42c2e9d-5bd0-471f-b4a3-207baf504a80", "title": "Situation on Pokrovsk front remains most tense with combat clashes ongoing – Ukraine General Staff", "date": "2024-06-15 13:00", "url": "https://www.yahoo.com/news/situation-pokrovsk-front-remains-most-083212044.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: General Staff of the Armed Forces of Ukraine on Facebook, information as of 10:00 on 15 JuneDetails: Ukrainian and Russian forces clashed 112 times on 14 June.\nA total of 31 combat clashes have taken place since the beginning of Saturday, 15 June.\nFive combat clashes are currently taking place on the Kupiansk front.\nThree combat clashes are currently taking place in the areas of Novooleksandrivka, Yevhenivka and Novoselivka Persha.\nFour combat clashes have already ended near Urozhaine and Vodiane."}, {"id": "d09a63c7-7424-4213-8200-1b9c9d3ff7aa", "title": "Dragon Age : The Veilguard : 19 Things We Learned From A Dev Q & A", "date": "2024-06-15 00:15", "url": "https://kotaku.com/dragon-age-veilguard-discord-q-a-banter-party-members-1851541486", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "Dragon Age: The Veilguard’s promotional campaign is in full swing after BioWare reintroduced the re-titled RPG at Summer Game Fest earlier this month.\nAdvertisementHaving two party members will change thingsEvery previous Dragon Age game has used a party of four characters including your player character, whereas The Veilguard has shaved this down to three.\nPrevious Dragon Age games let you access most of your spells and abilities from a similar wheel without limitation.\nBusche confirmed BioWare will show it off publicly before launch in the fall.\nAdvertisementRook’s last name will be defined by their factionBecause you can play as so many different races in Dragon Age, player characters’ last names were often determined by race or backstory."}, {"id": "edacfec9-4279-43f2-8018-10a55c1acef9", "title": "DOMINIONS 6 Wild West 2 . 09 file", "date": "2024-06-15 04:45", "url": "https://www.moddb.com/mods/wild-west-dominions-5-nation-pack/downloads/wild-west-209", "domain": "moddb.com", "domain_classification": "Unknown", "message": "The final version of Wild West to only feature Tuhuya and Tayberon.\nSpirit From the Northern West has a cheaper basecost but smaller discounts (no change for Tuhuya or Tayberon).\nAdjusted Tayberon Research Goals.\nWest Witch is a better beastmaster.\nWild West introduces rediscovered lost tribes of Centaurs, Harpies and other monsters, who were carried into the far West when primordial Pangaea split in twain."}, {"id": "967a7f19-37d1-4da8-88fe-ee11aca898e6", "title": "Prime Minister remarks at the G7 press conference", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/wmd/library/news/uk/2024/uk-240614-ukgov02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Prime Minister's remarks at the G7 press conferencePrime Minister Rishi Sunak's remarks at the G7 press conference in Itlay today [14 June 2024].\n14 June 2024Let me start by thanking Prime Minister Giorgia Meloni and the Italian people for welcoming us to Puglia.\nAnd I'm pleased that the G7 has today committed to closer coordination on AI safety......following the UK's lead at Bletchley Park.\nAnd that's what I've been arguing for at this G7 Summit.\nAnd we, the G7, will stand united with Ukraine until that day comes."}, {"id": "e941a159-0872-47fb-af0e-1b7b35613820", "title": "Princess Kate makes first public appearance since cancer diagnosis", "date": "2024-06-15 11:15", "url": "https://www.yahoo.com/news/princess-kate-makes-first-public-104738098.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The family also made an appearance on the balcony of Buckingham Palace to watch a fly-by from the Royal Air Force.\nSpectators on The Mall leading to Buckingham Palace to witness the yearly ceremonial event welcomed Kate's tentative return to public appearances.\nPrince George, Prince William, Prince Louis, Princess Charlotte, Princess Catherine, King Charles III and Queen Camilla at Buckingham Palace on June 15, 2024 in London, England.\nKate's announcement that she had cancer came just weeks after it was disclosed that her father-in-law, King Charles III, had also been diagnosed with the condition.\nBritain's Prince George, Prince Louis, Prince William, Princess Charlotte, Princess Catherine, King Charles III and Queen Camilla wave from the balcony of Buckingham Palace."}, {"id": "72b97257-f5ee-4aa3-b664-d63384549583", "title": "Russia , Egypt to conduct joint naval exercises in the Mediterranean", "date": "2024-06-15 04:30", "url": "https://www.prokerala.com/news/articles/a1539607.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Moscow, June 15 : Two warships of the Russian Pacific Fleet will participate in joint naval exercises with the Egyptian Navy in the Mediterranean Sea, the Russian Ministry of Defense announced on Saturday.\nA group of combat ships from the Pacific Fleet, including the missile cruiser Varyag and the frigate Marshal Shaposhnikov, has left for the Egyptian port of Alexandria to engage in the joint exercise with the Egyptian Navy, Xinhua news agency reported, citing the ministry.\nThe ministry further specified that the Egyptian Navy will be represented by the frigate ENS Al-Qadeer during the drills.\nThe exercises will be conducted in the PASSEX format, which focuses on mastering combat coordination techniques between the fleets of different nations.\nThe drills will include elements of joint manoeuvring, communication training, and inspection actions."}, {"id": "b16c3acf-1f6b-45e2-b926-924e34d846b1", "title": "Macron says France will provide Ukraine with Mirage combat aircraft", "date": "2024-06-15 04:45", "url": "http://www.myanmarmuslim.net/news/20240615511a599488.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "French President Emmanuel Macron has said France will provide Ukraine with its Mirage combat aircraft to be able to defend their country against Russian aggression.\nMr Macron spoke after Ukrainian President Volodymyr Zelensky joined world leaders in France to commemorate the D-Day invasion.\nUkrainian President Volodymyr Zelensky is greeted by French President Emmanuel Macron (Ludovic Marin/AP)Mr Macron told a French public broadcaster he will announce on Friday a new co-operation with Ukraine and the sale of Mirage 2005, the French-made combat aircraft, which will “allow Ukraine to protect its soil, its airspace” against Russian attacks.\nMr Macron did not specify when the French combat aircraft would arrive.\nUkraine has framed the conflict as a clash between Western democratic freedom and Russian tyranny."}, {"id": "e2a00686-d8e7-4d3a-b7de-b817666d2966", "title": "The Sticking Points That Kept Russia and Ukraine Apart", "date": "2024-06-15 11:45", "url": "https://www.nytimes.com/interactive/2024/06/15/world/europe/ukraine-russia-peace-negotiations.html", "domain": "nytimes.com", "domain_classification": "International", "message": "The Sticking Points That Kept Russia and Ukraine ApartRussia and Ukraine failed to agree on a range of critical issues when they held peace talks in the spring of 2022.\nRussia’s Position Russia demanded that Ukraine never join NATO or other alliances; host foreign military bases or weapons; or conduct military exercises with other countries without its consent.\nRussia’s Position Russia agreed to much of Ukraine’s security guarantees proposal but with key exceptions.\nRussia’s Position Russia’s stance has also fluctuated.\nRussia’s Position But Russia’s definition of “denazification” shifted quickly after its initial invasion failed."}, {"id": "72579aac-e64a-473d-a4c9-88e79bc421c5", "title": "The Ghost Of Richelieu Laments The Humbling Of France", "date": "2024-06-15 04:45", "url": "https://menafn.com/1108334430/The-Ghost-Of-Richelieu-Laments-The-Humbling-Of-France", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The eroded stone steps of the staircase seemed to wobble under my feet, and I stumbled with tortuous languor until I felt the viscous muck of the ossuary floor.\nOnce again, I kept tryst with the Ghost of Cardinal Richelieu, victor of the Thirty Years War and architect of France's 200-year dominance on the European continent.\n“I warn you,” said the Ghost in his Maurice Chevalier accent.“I am in a rotten mood.”“Eminence,” I ventured,“what will become of France?\nPresident Macron's party had less than 15% of the votes for the European Parliament last Sunday, half the votes of the Rassemblement National.\nThe polls put his party at only 19% in next month's snap elections for parliament."}, {"id": "f37e1f47-52b6-4c9a-9645-2c26b2158eba", "title": "  Absolute priority : UN agencies must work unhindered in Gaza , G7 says", "date": "2024-06-15 05:45", "url": "https://www.kaieteurnewsonline.com/2024/06/15/absolute-priority-un-agencies-must-work-unhindered-in-gaza-g7-says/", "domain": "kaieteurnewsonline.com", "domain_classification": "Unknown", "message": "‘Absolute priority’: UN agencies must work unhindered in Gaza, G7 saysAl Jazeera – The Palestinian refugee agency of the United Nations (UNRWA) must be allowed to work unhindered in Gaza, Group of Seven (G7) leaders say as the wealthy nations wrapped up day two of their annual summit in Italy.\n“We agree it is critical that UNRWA and other UN organisations and agencies’ distribution networks be fully able to deliver aid to those who need it most, fulfilling their mandate effectively,” G7 nations said in their final communique.\nThey called for all parties to facilitate “rapid and unimpeded passage of humanitarian relief for civilians in need” in Gaza, particularly women and children.\nIn their statement, the G7 leaders repeated concern at the “unacceptable number of civilian casualties” in the war.\nHopes must become reality, the time for talking is done.” Interactive_G7_Summimt_2024_2‘Crucial moment in history’On Friday, the G7 nations turned their attention to migration, artificial intelligence, economic security and the Asia-Pacific region."}, {"id": "40c86da9-574f-49ba-a09c-077e8fa5153a", "title": "Vasili Rempas", "date": "2024-06-15 08:00", "url": "https://www.chicagotribune.com/obituaries/vasili-rempas-chicago-va/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "CHICAGO – Vasili “Lee” Rempas – conversationalist, entrepreneur and sometimes crusty, but always kindly, gentleman – passed away on Friday, August 12, 2016, at the age of 79 following an extended battle with chronic lung disease.\nVasili, whom most came to know as Lee and whom many called “Papou”, was born on March 14, 1937, in Tripoli, Greece to Pariskivas Rempas and Panagiota Rempas (née Davros).\nThere is no limit of gratitude and appreciation that Lee’s family can extend to his hospital caregivers.\nLee was a proud father of three – son Perry Rempas; daughter Corrine Rempas; daughter Jessica Maglaris.\nHe is also survived by grandsons Lee Rempas and Alexi Maglaris; granddaughters Kristin Rempas, Atheena Gouviotis and Mia Maglaris; and great-granddaughter Giselle Lee Rempas."}, {"id": "ba00f91c-f4cb-409b-b275-141b76060a34", "title": "Addressing poverty in Trinidad and Tobago - Trinidad and Tobago Newsday", "date": "2024-06-15 06:00", "url": "https://newsday.co.tt/2024/06/15/addressing-poverty-in-trinidad-and-tobago/", "domain": "newsday.co.tt", "domain_classification": "Unknown", "message": "Addressing poverty in Trinidad and TobagoKamla Persad-Bissessar - Lincoln holderTHE EDITOR: I write to call upon the Government to implement effective measures to combat poverty and recognise it as a grave injustice against the people of our nation.\nThe Government has a responsibility to bring poverty to an end for all citizens, especially the common man who suffers the most.\nI believe that a government led by Kamla Persad-Bissessar and the UNC can provide the necessary leadership and policies to eradicate poverty in our country.\nUnder her leadership as prime minister, the UNC would wage a comprehensive war against poverty, injustice, inequality and crime.\nReducing crime is essential to creating a safe and stable environment for economic and social development."}, {"id": "8011b82d-dbd5-4514-8456-d046643bb83f", "title": "Russia , Egypt to conduct joint naval exercises in Mediterranean", "date": "2024-06-15 04:00", "url": "http://www.uniindia.com/~/russia-egypt-to-conduct-joint-naval-exercises-in-mediterranean/World/news/3221041.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Moscow, June 15 (UNI) Two warships of the Russian Pacific Fleet will participate in joint naval exercises with the Egyptian Navy in the Mediterranean Sea, the Russian Ministry of Defense announced on Saturday.\nAccording to the ministry, a group of combat ships from the Pacific Fleet, including the missile cruiser Varyag and the frigate Marshal Shaposhnikov, have left for the Egyptian port of Alexandria to engage in the joint exercise with the Egyptian Navy.\nThe ministry further specified that the Egyptian Navy will be represented by the frigate ENS Al-Qadeer during the drills.\nThe exercises will be conducted in the PASSEX format, which focuses on mastering combat coordination techniques between the fleets of different nations.\nThe drills will include elements of joint maneuvering, communication training, and inspection actions."}, {"id": "3d317eec-9fd3-4c30-af3d-c31122613e6c", "title": "Nick Taylor of Reform united kingdom on his Norwich North campaign", "date": "2024-06-15 12:30", "url": "https://www.edp24.co.uk/news/24388219.nick-taylor-reform-uk-norwich-north-campaign/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Nick Taylor, who is the party's candidate in Norwich North, said the divide has impacted huge infrastructure projects like the Western Link and the rebuilding of Anglia Square, which he believes would have been \"dealt with by now\" if it wasn't for its northern location.\nMr Taylor, who lives in the neighbouring Norwich South constituency, grew up in Nigeria before fleeing due to civil war in 1969 and moving to Norfolk.\nThe father-of-two said: \"It is the residents of Norwich North that have to look at Anglia Square and frankly, they have been very poorly served by the authorities.\n\"Anglia Square has been an eyesore for far too many decades and the length of time and cost it has taken to decide what to do with the site is a disgrace.\"\nAll the candidates standing in Norwich North are Nick Taylor, the Conservative's Charlotte Salomon, the Green's Ben Price, Labour candidate Alice Macdonald, Chika Akinwale for the Lib Dems and Independent candidate Fiona Grace."}, {"id": "dcd75547-ebdd-4528-9ba6-a29985586056", "title": "Combat - Wounded Iraq War Vet Receives Free Fortuna Home After Appearing on Mike Huckabee TV Show | Lost Coast Outpost", "date": "2024-06-15 00:00", "url": "https://lostcoastoutpost.com/2024/jun/14/fortuna-home-gifted-combat-wounded-iraq-war-vet/", "domain": "lostcoastoutpost.com", "domain_classification": "Unknown", "message": "Jacob Williams (left, in blue shirt), his wife and family accept the ceremonial home key in Fortuna on Friday.\nOn Friday morning, retired U.S. Army Private First-Class Jacob Williams and his wife Meredith unlocked their new – free – home in Fortuna for the first time.\nThe Williamses learned that they were selected for a home on former Arkansas Governor and two-time presidential candidate Mike Huckabee’s TV show (Huckabee) in February.\n“We really want the veteran and their family to be successful in that community,” she said.\nThe Military Warriors Support Foundation Homes4WoundedHeroes program is open to veterans wounded in either combat or training and unmarried Gold Star spouses whose partner was killed in action."}, {"id": "485086b0-528a-40bd-9601-3165ebd6f1cc", "title": "  House of the Dragon  review : Season 2 dazzles the eyes , boggles the mind", "date": "2024-06-15 02:30", "url": "https://chicago.suntimes.com/movies-and-tv/2024/06/14/house-of-dragon-review-season-2-max-hbo-game-thrones", "domain": "chicago.suntimes.com", "domain_classification": "Unknown", "message": "At one point amid the swirling pools of violence, beauty, darkness, deviant sexuality, familial feuding and treachery of Season 2 of HBO’s “House of the Dragon,” a major character references the Iron Throne and then deadpans: “It’s a big chair.\n'House of the Dragon' Season 28 to 9 p.m. Sundays on HBO and streaming afterward on Max.\nRhaenyra Targaryen (Emma D’Arcy) is in deep mourning after the revenge-minded and icy-veined Aemond (Ewan Mitchell) killed her son Lucerys, an act that all but seals the deal for a prolonged and bloody war between two factions.\nThe aforementioned Prince Aemond, who is spoiling for war and struts about like a 1980s hair band rock star.\nThe icy-veined Prince Aemond (Ewan Mitchell) is spoiling for war."}, {"id": "f167e4f1-7969-4d38-b0fb-861d4522adf2", "title": "  House of the Dragon  Review : HBO  Game of Throne Prequel Returns", "date": "2024-06-15 00:00", "url": "https://www.hollywoodreporter.com/tv/tv-reviews/house-of-the-dragon-review-season-2-hbo-1235922031/", "domain": "hollywoodreporter.com", "domain_classification": "Unknown", "message": "At the heart of House of the Dragon‘s second season is an unresolvable tension, and I don’t mean the one between the Greens and the Blacks.\nIt’s an eminently reasonable and humane stance, held by two of the show’s more reasonable and humane main characters.\nHouse of the Dragon The Bottom Line A show divided against itself.\nWhere the first season sprinted through entire decades’ worth of set-up, sometimes skipping entire years between episodes, season two slows the clock considerably.\nNot that House of the Dragon itself is immune to the pull of violence."}, {"id": "8016b33c-c49d-4f2c-9adb-5e57e3b61cb8", "title": "UN experts say Sudan paramilitaries recruiting in C . Africa", "date": "2024-06-15 04:45", "url": "https://www.bssnews.net/news/195232", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "They insist the paramilitaries are also using the Am Dafok area in the Central African Republic on the border \"as a key logistical hub.\"\n\"Opposition armed groups from the Central African Republic have been reported to have actively recruited for, and sent members of their own groups to fight in, the Sudan under RSF,\" the experts said.\nThey noted in particular fighters in Sudan since as early as August 2023 from the Central African rebel group Popular Front for the Rebirth of Central Africa (FPRC).\nThe experts thus called on Central African authorities to \"counteract the surge in arms trafficking from neighboring countries, particularly given the current conflict situation in the Sudan.\"\nThey also asked the leaders to combat \"the infiltration of foreign fighters into the Central African Republic, which poses a significant long-term threat to the region.\""}]