[{"id": "8a60f8c3-f3da-4b3e-8bbd-73428845b232", "title": "Biden envoy in Israel as northern border tensions flare", "date": "2024-06-17 17:15", "url": "https://www.yahoo.com/news/biden-envoy-israel-northern-border-164144818.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group's October 7 attack on Israel which triggered war in the Gaza Strip.\nBut exchanges have escalated and last week saw Hezbollah's largest simultaneous attack, after an Israeli strike killed a senior commander from the group.\n\"I can confirm that (US President Joe) Biden's envoy... met with our prime minister,\" Israeli government spokesman David Mencer told a press briefing.\nHezbollah last week said it has carried out more than 2,100 military operations against Israel since October 8, the day after Hamas's attack.\nHezbollah escalated attacks last week after a commander, Taleb Abdallah, was killed in an Israeli strike in the village of Jouaiyya."}, {"id": "92da1f20-31dd-4db6-9d35-1199a5636941", "title": "Biden envoy in Israel as northern border tensions flare", "date": "2024-06-17 17:15", "url": "https://www.digitaljournal.com/world/biden-envoy-in-israel-as-northern-border-tensions-flare/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group’s October 7 attack on Israel which triggered war in the Gaza Strip.\nBut exchanges have escalated and last week saw Hezbollah’s largest simultaneous attack, after an Israeli strike killed a senior commander from the group.\n“I can confirm that (US President Joe) Biden’s envoy… met with our prime minister,” Israeli government spokesman David Mencer told a press briefing.\nHezbollah last week said it has carried out more than 2,100 military operations against Israel since October 8, the day after Hamas’s attack.\nHezbollah escalated attacks last week after a commander, Taleb Abdallah, was killed in an Israeli strike in the village of Jouaiyya."}, {"id": "c305345a-ff62-40d4-af04-816a803d11b7", "title": "Gaza : 71 Palestinians killed , 197 injured by Israelis bombings last48hours - The Muslim News", "date": "2024-06-17 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-71-palestinians-killed-197-injured-by-israelis-bombings-last48hours/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): 71 Palestinians were killed, 197 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 48 hours, reports the Health Ministry.\nThis has increased the number of Palestinians killed by Israeli forces to 37,337 and 85,299 injured since last October, according to the Ministry of Health in the besieged enclave.\nAdditionally, the warplanes targeted a house near the Emirates field hospital in central Rafah, according to eyewitnesses.\nThey said that Israeli warplanes targeted a house of al-Khatib family in the refugee camp, killing four people, including an infant, and injuring others.\nAnother airstrike targeted a house of an-Najjar family in the refugee camp, resulting in the killing of two people and injuring others."}, {"id": "cd3b5b69-b29d-4477-9a65-4f3bba618f3f", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-17 00:00", "url": "http://www.k101fm.net/syndicated-article/?id=1569647", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "(SOMALIA) — A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual’s name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "6d9789ef-2860-4401-af96-c83a0d6e3029", "title": "Israeli psychic Uri Geller claims he stopped Iranian drone attack", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/omg/article-806604", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Israeli mystifier and psychic Uri Geller claimed he played a part in helping thwart the April Iranian drone and missile attack on Israel.\n“I can’t go into detail because the operation was classified, but I played a part in bringing down the Iranian drones that attacked Israel in April,” Geller told The Jerusalem Post.\nIron Shield was seen as a major success, with Israel claiming 99% of missiles and drones were successfully intercepted.\nObjects are seen in the sky above Jerusalem after Iran launched drones and missiles towards Israel, in Jerusalem April 14, 2024.\nThis article is a preview of a fuller wide-ranging discussion with Geller on the Israel-Hamas War and Israeli public diplomacy."}, {"id": "7405f920-019f-4cbb-8d24-f2c4ff56647b", "title": "Hezbollah and Hamas in Lebanon exchange fire with Israel", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/202406177e599938.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The military wing of the Palestinian group Hamas said it had fired rockets from Lebanon into northern Israel on Monday, triggering Israeli airstrikes on the Lebanese side of the border.\nThe exchange lasted about half an hour and Israel’s Iron Dome could be clearly seen intercepting rockets from Lebanon.\nAbout three hours later, Israel’s air force carried out airstrikes on “Hezbollah targets” inside Lebanon, Israeli military spokesman Avichay Adraee posted on X, formerly known as Twitter, adding that details would follow later.\nBy Israeli military estimates, Hamas has already fired 7,000 rockets into Israel during the current war.\n(AP Photo/Ariel Schalit, File)The exchange of fire came as Lebanon’s militant group Hezbollah said its fighters attacked at least three Israeli military posts along the border around sunset on Monday."}, {"id": "e100c3cc-9b33-4394-b87d-7b0008fe795b", "title": "الوكالة الوطنية للإعلام - Enemy carries out airstrike on village of Shaqra", "date": "2024-06-17 16:15", "url": "https://www.nna-leb.gov.lb/en/justice-law/702230/enemy-carries-out-airstrike-on-village-of-shaqra", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - National News Agency correspondent reported that the enemy carried out an airstrike on the village of Shaqra, on the same house that was targeted by a drone yesterday.\nYesterday's bombing resulted in the injury of a mother and her four children, and today a child was seriously injured.\n=========== R.K.================ R.K."}, {"id": "378fcc49-dd8b-4a84-b3dc-b1f4f7475481", "title": "Hezbollah terrorist Muhammad Mustafa Ayoub killed in IAF strike", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/israel-hamas-war/article-806608", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An Israel Air Force (IAF) aircraft eliminated Hezbollah terrorist Muhammad Mustafa Ayoub in the Selaa area in southern Lebanon, the military said on Monday evening.\nThe IDF noted that Ayub was an important operative in the Rocket and Missile Department of Hezbollah's Nasser Unit.\nIDF jets strike in southern Lebanon.\nIt later added that fighter jets had attacked a Hezbollah military structure and terror infrastructure in the Aitaroun area of southern Lebanon.\nIAF fighter jets strike terror targets in southern Lebanon, June 17, 2024."}, {"id": "c6a92d9d-1bc8-4098-ba62-9c643dc9bed0", "title": "U . S . Navy Rescues Crew of Stricken Cargo Ship Attacked by Houthis", "date": "2024-06-17 09:15", "url": "https://theaviationist.com/2024/06/17/u-s-navy-rescues-crew-of-cargo-ship-attacked-by-houthis/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Twenty four civilian crew members from a cargo vessel struck by a Houthi uncrewed surface vessel in the Red Sea have been rescued by the United States Navy.\nM/V Tutor, a 229-meter Liberian flagged bulk cargo vessel, came under attack by a Houthi uncrewed surface vessel (USV) while sailing in the southern Red Sea on June 12, 2024.\nFootage showing the Moments right before as well as right after the Liberian-Flagged, Greek-Owned Bulk Cargo Ship, M/V Tutor was Struck on June 10th by a Houthi One-Way Surface Attack Drone while Transiting the Southern Red Sea.\nUKMTO WARNING INCIDENT 083 ATTACK UPDATE 004 The crew of the vessel has been evacuated by military authorities.\nLightweight guided missiles tailored for use against small surface and air targets have been trialled and deployed by various nations."}, {"id": "00bb9dc7-e075-4dca-b1eb-05a605fe9861", "title": "Report : Attack that killed 8 IDF soldiers caused by anti - tank missile", "date": "2024-06-17 09:15", "url": "https://www.yahoo.com/news/report-attack-killed-8-idf-084229168.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli soldiers stand around the flag-draped casket of Israeli soldier Wassem Mahmoud, who was killed when an armoured personnel carrier exploded near the southern Gaza city of Rafah, during his funeral in Beit Jann.\nEight Israeli soldiers have been killed in fighting in Rafah in the southern Gaza Strip, the armed forces said on Saturday.\nIlia Yefimovich/dpaThe Israeli army assumes that an anti-tank missile was used in Saturday's attack on an Israeli armoured vehicle in Rafah in the southern Gaza Strip, which killed eight soldiers, according to Israeli media.\nIt was initially reported that it was unclear whether the explosion was caused by an anti-tank missile or a booby trap.\nDue to the many deaths and the catastrophic humanitarian situation, Israel's actions in the Gaza war are internationally controversial."}, {"id": "dba2da99-ac18-42ad-af0c-b4047a1624f4", "title": "Paramedics among the 16 killed by Israeli airstrikes in Lebanon", "date": "2024-06-17 16:45", "url": "http://www.myanmarmuslim.net/news/20240618811a599180.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli airstrikes killed nine people in southern Lebanon late on Wednesday, including paramedics who were preparing to respond to the first strike, the state-run National News Agency said.\nIt said the rockets were in response to the deadly strike on the paramedics centre.\nHezbollah’s Islamic health society said two of its paramedics were killed in Teir Harfa while the Islamic Risala scout association, also a paramedic group, said one of its members was killed in the strike on Naqoura.\nIsrael said the earlier strike in Hebbariye killed a member of the Sunni al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nThe Israeli military said the attacker fled the scene following Thursday’s shooting and that forces were conducting searches."}, {"id": "d57aca96-b350-4d49-9213-25c81d8b815c", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 03:45", "url": "https://www.bangkokpost.com/life/arts-and-entertainment/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "7c7a36e6-0b52-4ee1-a0ba-9b551df26632", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 01:15", "url": "https://www.bangkokpost.com/life/social-and-lifestyle/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "7812caf3-2382-4d69-8518-d6dd0f27b1d8", "title": "Will Hezbollah new arsenal be enough to deter war with Israel ? ", "date": "2024-06-17 17:00", "url": "https://www.newarab.com/analysis/will-hezbollahs-new-arsenal-be-enough-deter-war-israel", "domain": "newarab.com", "domain_classification": "Unknown", "message": "Meanwhile, Israel has conducted strikes increasingly deeper inside Lebanon and shown less restraint over assassinating senior Hezbollah members.\nHezbollah has exchanged daily fire with Israel since October 8, shortly after Israel launched its ongoing campaign in the Gaza Strip.\nIt fired missiles deeper into Israel and even launched missiles from a drone within Israeli airspace, a notable first.\n“As usual, this is designed to show the potential costs of full-scale war as Hezbollah wants Israel to believe that none of its assets are safe.”RELATED Is Israel gearing up for war with Hezbollah?\nBut with Hezbollah forces increasingly ready for total war with Israel, perhaps that moment has already been and gone."}, {"id": "aacb94c8-3fee-40b4-9916-6e622c34eac0", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nSeparately, the US and Britain announced that they were imposing a new round of sanctions on Iran.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries."}, {"id": "78204196-980b-4283-bc4f-d223c70c21dd", "title": "IDF General Tells Troops to Continue Rafah Operation Until Hamas Is Defeated", "date": "2024-06-17 16:15", "url": "https://www.theepochtimes.com/world/idf-general-tells-troops-to-continue-rafah-operation-until-hamas-is-defeated-5669932", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Directive issued after eight Israeli soldiers were killed in a vehicle explosion during an operation in Rafah.\nThe Israel Defense Forces (IDF) vowed to continue military operations in Rafah until the Hamas terrorist group is defeated.\nThis followed an explosion in southern Gaza that killed eight Israeli soldiers.\nIDF Southern Command chief Maj. Gen. Yaron Finkelman said at a June 15 meeting with commanders in Rafah that they must continue their fight against Hamas as the explosion is being investigated.\nThe crossing has had a bottleneck since Israeli ground troops moved into Rafah in early May."}, {"id": "7218b095-bc04-4020-a55e-05e78b77d991", "title": "US Navy rescues crew from ship struck by Houthis", "date": "2024-06-17 01:00", "url": "https://www.brecorder.com/news/40308779/us-navy-rescues-crew-from-ship-struck-by-houthis", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO: The US Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen’s Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nCrew evacuated from vessel hit by Houthis, search for sailor continuesOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship’s crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "f4213f6b-aea4-414e-8cce-8e3a465c50ab", "title": "Biden vows  ironclad  support for Israel amid Iran attack fears", "date": "2024-06-17 15:15", "url": "http://www.myanmarmuslim.net/news/20240617185e599806.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US president Joe Biden has promised Israel his country’s “ironclad” support, as Iran vows retaliation for the deadly strike on the Iranian consulate in Syria earlier this month.\nThe US military believes Israel carried out the airstrike on Iran’s diplomatic station, which killed two top generals and others.\nIsrael has not commented on the attack, but Tehran says it holds Israel responsible.\n“We also want to address the Iranian threat to launch a significant attack on Israel,” Mr Biden said during a joint news conference.\nAnd Israel’s foreign minister threatened on Wednesday that his country’s forces would strike Iran directly if the Islamic Republic launched an attack from its territory against Israel."}, {"id": "30f4b5b7-b1fa-4b6f-b748-743dabb745aa", "title": "Shelling kills 14 people in Russian border city of Belgorod", "date": "2024-06-17 16:45", "url": "http://www.myanmarmuslim.net/news/20240618889c599054.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Shelling in the centre of the Russian border city of Belgorod has killed 14 people, including two children, and injured 108 more, emergency services said.\nRussian officials accused Kyiv of carrying out the attack the day after an 18-hour aerial Russian barrage across Ukraine killed at least 39 civilians.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry/AP)One strike hit close to a public ice rink in the heart of the city.\nEarlier on Saturday, Moscow officials had reported shooting down 32 Ukrainian drones over the country’s Moscow, Bryansk, Oryol and Kursk regions.\nCities across western Russia have come under regular attack from drones since May, with Russian officials blaming Kyiv."}, {"id": "6a744f23-b053-413a-ad8b-3a8f5c55c95b", "title": "Seven Lebanese and an Israeli killed in exchange of fire along border", "date": "2024-06-17 19:00", "url": "http://www.myanmarmuslim.net/news/20240618884a599107.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An Israeli air strike on a paramedics centre linked to a Lebanese Sunni Muslim group in south Lebanon has killed seven of its members, officials said.\nThe air strike after midnight on Tuesday hit an office of the Islamic Emergency and Relief Corps, according to the Lebanese Ambulance Association.\nThe Israeli air strike was linked to a Lebanese Sunni Muslim group (AP)The paramedics association listed the names of seven volunteers who were killed in the strike.\nThe Israeli military said it struck a military building in Hebbariye and killed a member of Lebanon’s Sunni Muslim al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nAround 30 rockets were launched from Lebanon toward northern Israel, according to the Israeli military."}, {"id": "bd51c2c1-231f-41a4-a124-e72b9b8cd904", "title": "Woman , 24 , arrested in fatal gang shooting in Anaheim , police say", "date": "2024-06-17 00:00", "url": "https://www.ocregister.com/2024/06/16/woman-24-arrested-in-fatal-gang-shooting-in-anaheim-police-say/", "domain": "ocregister.com", "domain_classification": "Unknown", "message": "A 24-year-old woman suspected of fatally shooting a man and injuring another in gang-related crimes in a residential Anaheim neighborhood was arrested on Saturday, June 15, authorities said.\nAt around 2:30 a.m. on Saturday, Jose Andres Abrego was shot and another victim was stabbed at a home along the 800 block of West Cottonwood Circle, according to the Anaheim Police Department.\nThe victims were taken to a hospital by a witness before authorities arrived.\nJannett Cureno, 24, fled the scene and was later arrested in Santa Ana on suspicion of the shooting and the stabbing, police said.\nAnaheim Police have asked anyone with information about the shooting to contact the Anaheim Police Department Homicide Detail at 714-321-3669 or Orange County Crime Stoppers at 855-TIP-OCCS."}, {"id": "bbf8c1c5-5bf9-41f9-be78-8ca7589233c0", "title": "Hezbollah chief says group must retaliate for suspected Israeli strike in Beirut", "date": "2024-06-17 17:15", "url": "http://www.myanmarmuslim.net/news/20240618929f599014.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The leader of the Lebanese militia Hezbollah said on Friday that his group must retaliate after a presumed Israeli strike hit a Beirut neighbourhood this week, killing a senior Hamas official, or else all of Lebanon would be vulnerable to Israeli attack.\nNasrallah said it was the first strike by Israel in the Lebanese capital since 2006.\nBut Hezbollah has held back from a dramatic escalation, wary of a repeat of the two sides’ 2006 war in which Israeli bombardment wreaked extensive destruction in Lebanon.\nIsraeli officials have threatened greater military action against Hezbollah unless it withdraws it fighters from Lebanese territory near their shared border.\nMeanwhile, Israeli bombardment has continued around the territory."}, {"id": "12043a93-38e8-4c84-8f0f-71323d60dabe", "title": "New  Nostradamu predicts when World War III will begin and it just days away", "date": "2024-06-17 00:00", "url": "https://www.kenyan-post.com/2024/06/new-nostradamus-predicts-when-world-war.html", "domain": "kenyan-post.com", "domain_classification": "Unknown", "message": "Sunday, June 16, 2024 - An astrologer dubbed “New Nostradamus” is predicting the start of World War III is mere days away.\nKushal Kumar said back in May that World War III would begin on June 18.\n“Watch the developing war scenario in hotspots across the globe as days pass by,” Kumar wrote.\nEven if WWIII doesn’t come to pass in a matter of days, state officials warn it is a serious concern.\nThe Doomsday Clock, a representation of how close the planet is to nuclear war, was also set its closest to midnight — 90 seconds away — for a second year in a row"}, {"id": "24969c7f-0bf2-4ac8-98f7-8ed3f9ffd5d2", "title": "Israel Announces  Tactical Pause  In Gaza , Is It Due To Hezbollah ? ", "date": "2024-06-17 12:45", "url": "https://victorygirlsblog.com/israel-announces-tactical-pause-in-gaza-is-it-due-to-hezbollah/", "domain": "victorygirlsblog.com", "domain_classification": "Unknown", "message": "They have announced a “tactical pause” on all fighting during daylight hours in order to move humanitarian aid into Gaza.\nEarlier this month, rockets launched by Hezbollah set off wildfires in northern Israel, which did burn hundreds of acres and some evacuated homes.\nAfter rocket attacks caused massive fires in the north, Israel last week killed commander Taleb Abdullah, the most senior official killed in the fighting.\nThe problem is, Hochstein isn’t going to get very far with begging Israel to ignore Hezbollah, and Hezbollah won’t be talking to Hochstein.\nIf Israel is engaging in a “tactical pause” in Gaza in order to shift gears – and manpower – to deal with Hezbollah in the north, it’s understandable."}, {"id": "a01bface-eefa-4a9e-8b96-3c18bec69848", "title": "The war in Gaza has wiped out entire Palestinian families . AP documents 60 who lost dozens or more . ", "date": "2024-06-17 16:15", "url": "https://www.pilotonline.com/2024/06/17/the-war-in-gaza-has-wiped-out-entire-palestinian-families-ap-documents-60-who-lost-dozens-or-more/", "domain": "pilotonline.com", "domain_classification": "Unknown", "message": "Nearly a quarter of those families lost more than 50 family members in those weeks.\nThe large Doghmush clan lost at least 44 members in a strike on a mosque; AP documented over 100 family members killed in following weeks.\nWithin five days, Israel Air Force dropped 6,000 bombs on Gaza, including many unguided missiles.\nAmong the 80 Salem family dead: his mother, three brothers, his only sister and her four children.\nNine-year-old Abdullah is the only survivor of his bloodline — Israeli strikes killed his father, mother and seven sisters."}, {"id": "7ff4c9df-9919-4a37-a687-2261ebe46765", "title": "The war in Gaza has wiped out entire Palestinian families . AP documents 60 who lost dozens or more", "date": "2024-06-17 17:15", "url": "https://www.stripes.com/theaters/middle_east/2024-06-17/israel-hamas-war-civilian-death-investigation-14210081.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "This combination of photos provided by Youssef Salem shows relatives he has lost from Israeli strikes during the Gaza war which started Oct. 7, 2023.\nNearly a quarter of those families lost more than 50 family members in those weeks.\nThe large Doghmush clan lost at least 44 members in a strike on a mosque; AP documented over 100 family members killed in following weeks.\nWithin five days, Israel Air Force dropped 6,000 bombs on Gaza, including many unguided missiles.\nNine-year-old Abdullah is the only survivor of his bloodline — Israeli strikes killed his father, mother and seven sisters."}, {"id": "912057e7-5e7c-48da-91a4-1a17745fb2ec", "title": "3 killed , UN peacekeepers wounded in eastern DR Congo - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-06-17 10:00", "url": "https://www.newdelhitimes.com/3-killed-un-peacekeepers-wounded-in-eastern-dr-congo/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "A Romanian “mercenary” and two Congolese soldiers were killed, and a U.N. peacekeeper was wounded in three separate incidents in eastern Democratic Republic of Congo, several sources said Sunday.\nThe capital of North Kivu has been surrounded to the north and west by the Rwandan army and M23 rebels for several months.\nFighting regularly takes place against the Congolese army on the outskirts of the city, while the rebels, backed by Kigali, continue to extend their hold in the east of the country.\nSeveral Romanian television channels — including the state-owned TVR Info — described the dead fighter as a “Romanian mercenary” under contract to the Congolese army.\nAround 200 kilometers north of Goma, in Butembo, at least two soldiers were killed in an ambush, local administrator Colonel Alain Kiwewa told AFP."}, {"id": "98c61575-4e94-4025-abe0-e87d84354e71", "title": "The Latest | Netanyahu dissolves War Cabinet that was steering war in Gaza , Israeli officials say", "date": "2024-06-17 16:45", "url": "https://www.news-gazette.com/news/nation-world/the-latest-netanyahu-dissolves-war-cabinet-that-was-steering-war-in-gaza-israeli-officials-say/article_699ecd02-93a9-5004-a3c7-96e63fc8b496.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Champaign, IL (61820)TodaySun and clouds mixed.\nA stray shower or thunderstorm is possible.\nWinds SSW at 15 to 25 mph..TonightScattered thunderstorms developing late.\nWinds S at 10 to 20 mph.\nChance of rain 40%."}, {"id": "5372f6f2-8a60-4ce8-b061-a3ce99b91319", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617352c599647.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian ballistic missiles have slammed into an apartment block in Kharkiv, killing at least four people, Ukrainian officials said.\nThe night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "558cd7c5-fce9-420d-881b-0d3b8015fd81", "title": "The war in Gaza has wiped out entire Palestinian families . AP documents 60 who lost dozens or more", "date": "2024-06-17 17:00", "url": "https://www.chicoer.com/2024/06/17/the-war-in-gaza-has-wiped-out-entire-palestinian-families-ap-documents-60-who-lost-dozens-or-more/", "domain": "chicoer.com", "domain_classification": "Unknown", "message": "Nearly a quarter of those families lost more than 50 family members in those weeks.\nThe large Doghmush clan lost at least 44 members in a strike on a mosque; AP documented over 100 family members killed in following weeks.\nWithin five days, Israel Air Force dropped 6,000 bombs on Gaza, including many unguided missiles.\nAmong the 80 Salem family dead: his mother, three brothers, his only sister and her four children.\nNine-year-old Abdullah is the only survivor of his bloodline — Israeli strikes killed his father, mother and seven sisters."}, {"id": "2e05d61c-2601-4c12-90ea-fcd483d4e429", "title": "Charges filed against suspect in Plainfield Township attack | Newsradio WOOD 1300 and 106 . 9 FM", "date": "2024-06-17 17:30", "url": "https://woodradio.iheart.com/featured/wood-radio-local-news/content/2024-06-17-charges-filed-against-suspect-in-plainfield-township-attack/", "domain": "woodradio.iheart.com", "domain_classification": "Unknown", "message": "PLAINFIELD TOWNSHIP, Mich. -- Kent County Prosecutor Chris Becker says his office has filed charges against the 24-year-old suspect in a break-in and stabbing in Plainfield Township.\nKent County Sheriff's investigators say the Plainfield Township man broke into the home early Saturday morning and stabbed an 11-year-old girl repeatedly.\nBecker says 24-year-old Ricardo Perez Castillo as been charged with one count of assault with intent to murder, one count of home invasion 1st degree, one count of assault with intent to commit criminal sexual conduct involving penetration.\nKent County Undersheriff Bryan Muir says the 11-year-old was staying at a friend's house when the attack occurred.\nPolice believe it was a random attack."}, {"id": "b6207d3f-8770-41da-8a71-2305b8773234", "title": "IDF eliminates key Hezbollah operative during lull in rocket fire", "date": "2024-06-17 19:00", "url": "https://www.ynetnews.com/article/hkj900rarc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The IDF, for its part, has not stopped its rocket fire, and on Monday Hezbollah announced another operative has been eliminated: Muhammad Mustafa Ayoub, from the town of Selaa in southern Lebanon.\nHours after the assassination, the IDF published documentation of the attack on Ayoub, who it described as \"a key operative in the Rocket and Missile Department of Hezbollah's Nasser Unit.\"\n3 View gallery The IDF eliminated key Hezbollah operative Muhammad Mustafa AyoubOver the past few months, Ayoub was involved in promoting terror attacks against Israeli civilians and communities; he promoted and planned terror attacks from southern Lebanon against the State of Israel, according to the IDF.\nHezbollah has pledged to continue fighting in the north as long as the IDF continues its operation in the Gaza Strip, so the lull in attacks in recent days is unusual.\nA possible reason for the current quiet is the Eid al-Adha holiday, or the Feast of Sacrifice, which includes mass prayers by the residents of southern Lebanon."}, {"id": "cf6a2a37-4729-4fb9-88d3-c6265767c9e7", "title": "Israel challenge with Hezbollah in Lebanon , BBC article sheds light", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/middle-east/article-806612", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "It sketches out a story of a town whose residents had to flee due to the conflict between Hezbollah and Israel.\nThe international community has long tolerated Hezbollah’s illegal role in hijacking Lebanon, the same way it tolerated Hamas taking over Gaza.\nOne conclusion could be that the international community recognizes some sort of benefit to having these groups growing in power on Israel’s borders.\nInstead, what we end up with is claims that Israel is targeting civilian homes, with no deeper investigation as to why, or into Hezbollah’s presence.\nIn the end, all the civilian homes that are damaged will go into one large list, without any reference to whether the homes were used by Hezbollah."}, {"id": "d456dfb0-b2f0-49cb-860c-ee8216a3106b", "title": "Putin Invasion of Ukraine : Are Airbus Satellite Images Helping Russia Wage War ? ", "date": "2024-06-17 09:15", "url": "https://www.spiegel.de/international/world/putins-invasion-of-ukraine-are-airbus-satellite-images-helping-russia-wage-war-a-3ab1e690-91a7-4b46-8915-d7e0c0b5054d", "domain": "spiegel.de", "domain_classification": "Local - Europe", "message": "The high-definition images that Airbus delivers from an altitude of 630 kilometers and more are particularly valuable for nations at war.\nThat is why satellite photos can be so valuable when planning precise airstrikes.\nAs such, Ukraine – which has access to such images through its allies – has an advantage over the Russian invaders.\nBut the Ukrainian military suspects that Russian President Vladimir Putin’s military is helping itself to images from Western satellite operators immediately before launching airstrikes – with some of those photos potentially coming from Airbus-controlled satellites.\nMight the Russian military be tasking Western satellites to spy on Ukraine?"}, {"id": "e6396d9f-4442-43f9-9ecf-47f89f48d4de", "title": "Russian attack on Ukraine Poltava region injures nine , causes power cuts", "date": "2024-06-17 14:00", "url": "https://www.theglobeandmail.com/world/article-russian-attack-on-ukraines-poltava-region-injures-nine-causes-power/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "A Russian missile attack on Ukraine’s east-central Poltava region on Monday injured 22 people, including three children, and damaged dwellings and power lines, knocking out electricity for more than 55,000 consumers, the regional governor said.\nUkraine’s general prosecutor’s office, in a post on Telegram, said the attack was carried out with an X-59 cruise missile.\nPoltava Governor Filip Pronin posted footage of himself at the scene of the attack, with smoke rising from damaged garages, while emergency services battled fires.\nPronin said that owing to damage to power lines, some 53,000 private and 2,400 industrial consumers faced electricity cuts."}, {"id": "6446814b-3720-435a-be0c-a6bd7a595dce", "title": "Dorcha Lee : An international peacekeeping force should replace the IDF in Gaza", "date": "2024-06-17 15:15", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41417869.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "By late February it was reporting that this was down to 50%, and that 10,000 Hamas fighters had been killed.\nThe Hamas controlled GMH (Gaza Ministry of Health) has said that 274 Palestinians died and 698 were wounded in the IDF operation.\nOne way to estimate how many Hamas fighters have survived is to try to figure out how many have died.\nI believe that the surviving Hamas combatants should be allowed to go into permanent exile under a flag of truce.\nThe IDF should be withdrawn from Gaza and replaced by an international peacekeeping force."}, {"id": "6be2243f-8ad9-4270-a299-cfd3ab7e2b9c", "title": "Elyria man under arrest for stabbing victim in the face", "date": "2024-06-17 19:00", "url": "https://www.cleveland19.com/2024/06/17/elyria-man-under-arrest-stabbing-victim-face/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "LORAIN COUNTY, Ohio (WOIO) - Elyria police arrested a 41-year-old man for allegedly stabbing another man multiple times in the face and head.\nThe attack happened on June 16 in a vacant lot near West Avenue and 16th Street.\nPolice responded to University Hospital Elyria Medical Center around 10:15 a.m. after the victim was brought to the emergency room.\nWhile officers were at the assault scene, they said they located Andrew Davison who admitted to the crime and was still armed with the knife.\nAndrew Davison ((Source: Elyria police))Davison is charged with felonious assault and aggravated robbery."}, {"id": "f6b3a3a1-62a7-417f-bd71-d1424ff41d3c", "title": "Israel bombs south , kills one as Hezbollah pauses operations for Eid", "date": "2024-06-17 16:00", "url": "https://dailystar.com.lb/israel-bombs-south-kills-one-hezbollah-pauses-operations-eid/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Relative calm prevailed in southern Lebanon on Sunday and Monday as Hezbollah appeared to pause its cross-border attacks on Israel for the Eid al-Adha holiday.\nEarlier that day, Israeli forces fired machine guns at residents of Dhayra, a border town, as they inspected their properties and visited a cemetery.\nAdditionally, an Israeli aircraft launched two missiles at Mays al-Jabal, a border town, while artillery shelling targeted the border towns of Khiam, Kfar Hamam, Rashaya al-Fukhar, and Kfarkela, along with the Marjeyoun plain.\nOn Sunday, several border towns were subjected to a few airstrikes and intermittent artillery shelling.\nIsrael and Hezbollah, an ally of Hamas, have engaged in near-daily cross-border fire since the October 7 attack by the Palestinian militant group on Israel, which ignited the war in the Gaza Strip."}, {"id": "20abf7ac-0b4d-4e90-959e-96e2fad44e29", "title": "Shipping firms halt Red Sea journeys after rebel missile attacks", "date": "2024-06-17 16:30", "url": "http://www.myanmarmuslim.net/news/20240618597d599347.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "German-based shipper Hapag-Lloyd also said it was pausing all its container ship traffic through the Red Sea until Monday.\nThe attacks further escalate a campaign by Yemen’s Iranian-backed Houthi rebels, who have claimed responsibility for a series of missile assaults in recent days that just missed shipping in the Red Sea and its strategic Bab el-Mandeb Strait.\nThe day before that, two missiles fired from Houthi-held territory missed a commercial tanker loaded with Indian-manufactured jet fuel near the key Bab el-Mandeb Strait.\nAlso near the strait, a missile fired by Houthis on Monday night slammed into a Norwegian-flagged tanker in the Red Sea.\nIn November, Houthis seized a vehicle transport ship linked to Israel in the Red Sea off Yemen."}, {"id": "0c34d93f-07b2-46b9-b4ff-d3c749f598f9", "title": "Shipping firms halt Red Sea journeys after rebel missile attacks", "date": "2024-06-17 17:30", "url": "http://www.myanmarmuslim.net/news/20240618575a599420.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "German-based shipper Hapag-Lloyd also said it was pausing all its container ship traffic through the Red Sea until Monday.\nThe attacks further escalate a campaign by Yemen’s Iranian-backed Houthi rebels, who have claimed responsibility for a series of missile assaults in recent days that just missed shipping in the Red Sea and its strategic Bab el-Mandeb Strait.\nThe day before that, two missiles fired from Houthi-held territory missed a commercial tanker loaded with Indian-manufactured jet fuel near the key Bab el-Mandeb Strait.\nAlso near the strait, a missile fired by Houthis on Monday night slammed into a Norwegian-flagged tanker in the Red Sea.\nIn November, Houthis seized a vehicle transport ship linked to Israel in the Red Sea off Yemen."}, {"id": "1759362e-4064-4093-8cb1-e2af41b48501", "title": "Three killed in Houthi attack on ship in Gulf of Aden", "date": "2024-06-17 11:45", "url": "http://www.myanmarmuslim.net/news/20240617335a599657.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A missile attack by Yemen’s Houthi rebels on a commercial ship in the Gulf of Aden killed three crew members and forced survivors to abandon the vessel, US officials said.\nDespite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.\n(PA Graphics)Smoke poured out of one container aboard the vessel, which also showed scorch marks from the impact of a Houthi missile."}, {"id": "94ee9f7b-3247-4d6c-b142-d24f7bf9d808", "title": "17 killed as Russian missiles slam into Ukrainian city", "date": "2024-06-17 13:00", "url": "http://www.myanmarmuslim.net/news/20240617332c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Three Russian missiles slammed into a central area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-storey apartment building and killing at least 17 people, local officials said.\nUkrainian President Volodymyr Zelensky has pleaded with Western countries to provide his country with more air defence systems.\nAlso, unconfirmed reports said a Ukrainian missile struck an airfield in occupied Crimea.\nNeither Russian nor Ukrainian officials confirmed the strike, but local authorities temporarily closed a road where the airfield is located.\nUkrainian drone developers have been extending the weapons’ range and earlier this month struck a target some 745 miles (1,200km) east of Ukraine."}, {"id": "2064a72e-747c-4686-a5f3-d863c2c88174", "title": "Israel Netanyahu says Gaza offensive has  only started  ", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617064c599881.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said Israel has “only started” a fierce offensive in the Gaza Strip in response to Hamas’ unprecedented attack on his country.\nMr Netanyahu delivered the pronouncement in a nationally televised address as Israel pressed ahead with a third day of heavy airstrikes in Gaza.\nIn the war’s third day, Israel was still finding bodies from Hamas’ weekend attack into southern Israeli towns.\nThe UN said more than 123,000 people have fled their homes in Gaza – many after Israeli warnings of imminent bombardment.\nEgypt’s state-run Al-Ahram newspaper said on Monday that Egyptian officials are trying to mediate a release of Palestinian women in Israel’s prisons in exchange for Israeli women captured by militants."}, {"id": "96518f61-6c1b-490c-b706-a5982e48401d", "title": "Israeli officials say Benjamin Netanyahu has dissolved the War Cabinet after key partner bolted government", "date": "2024-06-17 19:30", "url": "https://6abc.com/post/israeli-officials-say-benjamin-netanyahu-has-dissolved-war/14964009/", "domain": "6abc.com", "domain_classification": "Unknown", "message": "Israeli officials say Netanyahu has dissolved the War Cabinet after key partner bolted governmentIsraeli officials Prime Minister Benjamin Netanyahu has dissolved the influential War Cabinet that was tasked with steering the war in Gaza.\nIsraeli officials Prime Minister Benjamin Netanyahu has dissolved the influential War Cabinet that was tasked with steering the war in Gaza.\nIsraeli officials Prime Minister Benjamin Netanyahu has dissolved the influential War Cabinet that was tasked with steering the war in Gaza.\nIsraeli officials Prime Minister Benjamin Netanyahu has dissolved the influential War Cabinet that was tasked with steering the war in Gaza.\nFormer army chief and fellow party member Gadi Eisenkot left the War Cabinet, where he had observer status."}, {"id": "513daf62-1afb-4fd1-b4ef-da6e98c07e09", "title": "How to keep cool during a heat wave - Charleston City Paper", "date": "2024-06-17 14:00", "url": "https://charlestoncitypaper.com/2024/06/17/how-to-stay-cool-during-heat-wave/", "domain": "charlestoncitypaper.com", "domain_classification": "Unknown", "message": "MORNING NEWSBREAK | Forecasters predict deadly heat along the East Coast this week and urge residents to be prepared.\nHeat indices of 100 degrees are expected to stretch from the Gulf states to Canada.\nConsider these tips:If you’re inside: Keep comfortable without air-conditioning by spritzing your skin periodically with a mist of cool water.\nIf you experience symptoms, lie down, sip water, loosen clothes and even take a cool bath.\nIn other recent headlines:CP OPINION, Brack: Turnout, scattered strategies created odd S.C. primary."}, {"id": "7b5bc6b8-c44b-4348-b1d8-f1f79d6000af", "title": "Netanyahu dissolves influential War Cabinet after key partner bolted from government", "date": "2024-06-17 19:00", "url": "https://www.twincities.com/2024/06/17/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolted-from-government/", "domain": "twincities.com", "domain_classification": "Unknown", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone."}, {"id": "ac3caad8-d834-4d28-b7fd-1942d3fb2ece", "title": "Kremlin to attack US ships with nuclear submarines", "date": "2024-06-17 15:30", "url": "https://www.albawaba.com/news/kremlin-attack-us-ships-nuclear-1572806", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - After a Russian submarine landed in Cuba for military drills, a Russian military expert said the Kremlin intended to launch nuclear attacks on American ships.\nIgor Korotchenko said on Russian state media that the nuclear-powered submarine Kazan is the sole Northern Fleet vessel in Cuba.\nHowever, he noted that multiple multi-purpose Russian nuclear submarines execute varied missions in the Atlantic Ocean.\nRussian warships and a nuclear submarine are just off the coast of Florida in Havana.\nIn response to American long-range assaults on Russian territory, Korotchenko suggested destroying all Ukrainian power plants quickly and efficiently."}, {"id": "f9b6a4d5-def2-4f6b-b2bc-638058cae191", "title": "IDF In Control Of 60 - 70 Percent Of Rafah ; 2 Hamas Battalions On Verge Of Being Overrun", "date": "2024-06-17 15:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-in-control-of-60-70-percent-of-rafahl-2-hamas-battalions-on-verge-of-being-overrun", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "The Israel Defense Forces is in control of 60 to 70 percent of Rafah, according to the military on Monday.\nCutting off RafahIn the first phase of Rafah operations, IDF forces launched an attack up to the Tancher route (Salah a-Din Street), captured the Rafah crossing, then moved to attack the Brazil neighborhood and established operational control.\nIDF spokesperson's unitThe division secured full operational control between the Kerem Shalom crossing and the sea.\nIDF spokesperson's unitThanks to the quick action by Israel, Hamas and other terrorist organizations were surprised.\nIDF spokesperson's unitThe fighting was planned in stages that were continuously updated in situational assessments."}, {"id": "2a4abe50-88a6-4606-9523-6353caa7415f", "title": "Taoiseach condemns Iran drone and missile attack on Israel", "date": "2024-06-17 16:15", "url": "http://www.myanmarmuslim.net/news/20240618251f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Taoiseach Simon Harris has condemned Iran’s drone and missile attack on Israel.\nIran launched the unprecedented assault on Saturday night in response to an Israeli attack on the Iranian consulate in Syria earlier this month.\n“I strongly condemn Iran’s reckless and large-scale attack on Israel,” the new Taoiseach said in a statement.\n“I strongly condemn Iran’s attack on Israel,” Mr Martin said.\nI strongly condemn Iran’s attack on Israel."}, {"id": "4e09f191-cc4e-4a90-9772-62227556ee71", "title": "Nothing could have prepared police officers for what happened after they stopped a moped", "date": "2024-06-17 19:00", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/nothing-could-prepared-police-officers-29371775", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "PS Foster and Ansell were in attendance speaking to those involved in the crash when Brown approached PS Foster from behind and violently attacked him with a knife.\n(Image: Sean Hansford | Manchester Evening News)As PS Foster struggled to defend himself, PS Ansell then came to his defence.\nHowever, once PS Foster had been pushed aside, Brown next came for PS Ansell, stabbing repeatedly at his neck.\nThis gave PS Foster the time to give lifesaving aid to PS Ansell who had received a stab wound to the neck.\nAll three officers involved have now been nominated in the National Police Bravery Awards 2024."}, {"id": "6916728e-b0bb-415b-b2e1-3b64b4e0a9cb", "title": "JAS 39 Gripen Fighters  Battled  China Air Force and Won", "date": "2024-06-17 15:45", "url": "https://nationalinterest.org/blog/buzz/jas-39-gripen-fighters-battled-chinas-air-force-and-won-208835", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Summary and Key Points: In a recent war game simulation, the Royal Thai Air Force's (RTAF) JAS 39 Gripen fighters outperformed China’s People’s Liberation Army Air Force's (PLAAF) Su-27s in beyond-visual range (BVR) combat.\nIn the war game, RTAF JAS 39 Gripen fighters outperformed PLAAF Su-27s in beyond-visual range (BVR) combat.\nThe results were encouraging; the Swedish-made JAS 39 Gripens earned 88 percent of their victories at a range of 19 miles or more.\nJAS 39 Gripen vs. ChinaThailand and the US are technically allies.\nThe resulting aircraft, the JAS 39 Gripen, is light and maneuverable with one seat and one engine."}, {"id": "f6760a6d-c68c-46a2-a55d-be3c9d634423", "title": "Vineyard Man Returns To Court After Alleged Theater Stabbing", "date": "2024-06-17 14:00", "url": "https://cool102.iheart.com/content/2024-06-15-vineyard-man-returns-to-court-after-alleged-theater-stabbing/", "domain": "cool102.iheart.com", "domain_classification": "Unknown", "message": "The next court hearing for a Vineyard man accused of going on a stabbing spree last month is slated for later today.\nJared Ravizza is accused of stabbing four young girls at a movie theater in Braintree before driving down to Plymouth and stabbing two McDonald's employees at a at a Route 3 rest stop.\nThe 26-year-old later crashed his Porsche in Sandwich during a high-speed chase with police.\nRavizza was ordered to undergo a mental health evaluation at Bridgewater State Hospital following his arraignment in late May."}, {"id": "1ee35684-342a-4a3e-a533-edcca56b58a3", "title": "Vineyard Man Returns To Court After Alleged Theater Stabbing", "date": "2024-06-17 14:00", "url": "https://106wcod.iheart.com/content/2024-06-15-vineyard-man-returns-to-court-after-alleged-theater-stabbing/", "domain": "106wcod.iheart.com", "domain_classification": "Unknown", "message": "The next court hearing for a Vineyard man accused of going on a stabbing spree last month is slated for later today.\nJared Ravizza is accused of stabbing four young girls at a movie theater in Braintree before driving down to Plymouth and stabbing two McDonald's employees at a at a Route 3 rest stop.\nThe 26-year-old later crashed his Porsche in Sandwich during a high-speed chase with police.\nRavizza was ordered to undergo a mental health evaluation at Bridgewater State Hospital following his arraignment in late May."}, {"id": "8834a522-580e-4b08-9aac-3da9c83e994e", "title": "Massive expansion of Pine Gap spy base integrates Australia into US nuclear war planning", "date": "2024-06-17 08:15", "url": "https://www.wsws.org/en/articles/2024/06/17/kziv-j17.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Over the past four years, the joint US-Australian Pine Gap spy base in the Northern Territory has undergone the largest expansion in its history.\nSatellite photo of Pine Gap in 2020 [Photo: Google Earth]It has previously been documented that Pine Gap receives and processes information from two Orion geosynchronous signals intelligence satellites over the Indian Ocean.\nThat makes Pine Gap more a central military planning headquarters than simply a spy base.\nAs with the stationing of the B-52s in the north, there has been no discussion or announcement, let alone a popular mandate sought for the Pine Gap expansion.\nThe Pine Gap expansion began under the former Liberal-National Coalition government and has proceeded seamlessly since Labor was installed in the May 2022 federal election."}, {"id": "3d6cc56f-2460-474b-8967-3f2f99dae0ac", "title": "Gotcha ! Authorities Nab Accused Assailant After Police Rescue Stabbing Victim At CNBC HQ Lot", "date": "2024-06-17 00:00", "url": "https://dailyvoice.com/new-jersey/bergenfield/gotcha-authorities-nab-accused-assailant-after-police-rescue-stabbing-victim-near-cnbc-hq/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "The accused assailant, who 'd previously been seen hanging around the area, tapped on the woman's car window in the CNBC parking lot, sources said.\nThe victim, who didn't know Patel, opened the window, and he reached in with a knife, one of them told Daily Voice.\nEnglewood Cliffs police who were first on the scene applied a tourniquet to the woman's arm, saving her life, according to sources.\nShe rushed by ambulance to the trauma unit at Hackensack University Medical Center and was later released after being treated, the prosecutor said.\n\"[Patel] was a stranger to the victim, and the attack was unprovoked,\" Musella noted."}, {"id": "e23fee6e-1824-465f-a372-471d2800adf8", "title": "U . S . Moves to Head Off War Between Israel and Hezbollah", "date": "2024-06-17 10:45", "url": "https://biztoc.com/x/aad37e9aa4b387cb", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "U.S. special envoy Amos Hochstein’s visit comes after a tense week when an Israeli strike killed one of the most senior members of Hezbollah and the militant group responded by firing hundreds of rockets and drones.\nThis story appeared on wsj.com , 2024-06-17."}, {"id": "843a4c88-4dd8-4cf6-b847-ece3a6bfa7c1", "title": "Nine killed in Russian aerial attacks on Zelensky hometown ahead of G7 summit", "date": "2024-06-17 13:15", "url": "http://www.myanmarmuslim.net/news/20240617456c599534.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukrainian authorities said that along with the nine killed, 29 others, including five children, were wounded when Russian missiles hit an apartment block in Kryvyi Rih, which is President Volodymyr Zelensky’s hometown.\nKyiv’s outgunned and outnumbered forces are battling to hold back the bigger Russian army, which is trying to exploit Ukrainian vulnerabilities.\nSeparately, Mr Sullivan noted that Russian authorities have deported hundreds of thousands of Ukrainian civilians to Russia, including children who have been forcibly separated from their families.\n“These Ukrainian children belong with their families inside Ukraine,” Mr Sullivan said.\nLast month, Russian forces also launched an offensive in Ukraine’s north-eastern region of Kharkiv, which borders Russia."}, {"id": "9141b41f-5ed0-4f49-b43d-10e69f016b50", "title": "Virgin Australia flight makes emergency landing after  possible  bird strike", "date": "2024-06-17 13:45", "url": "https://abc7ny.com/virgin-australia-flight-makes-emergency-landing-after-possible-bi/14963829/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Virgin Australia flight makes emergency landing after 'possible' bird strikeA Virgin Australia flight made an emergency landing in New Zealand after a \"possible bird strike,\" the airline said in a statement.\nFlight VA 148 from Queenstown to Melbourne was diverted shortly after takeoff, the airline said on Monday.\nThe Boeing 737 landed at Invercargill Airport, where it was met by emergency services, the airline said.\nDarren Robinson, of Shotover Country in Queenstown, shot a short video of the plane from the ground.\n\"Heard a loud band and went outside to see a plane engine on fire,\" he said on social media."}, {"id": "bfaf87e9-251a-407d-b0d9-5d953f2f78e1", "title": "Who are the Houthi rebels behind attacks on ships in Red Sea ? ", "date": "2024-06-17 18:30", "url": "http://www.myanmarmuslim.net/news/20240618194d599802.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Tensions in the Middle East have risen after Iranian-backed Houthi rebels began striking at ships passing through the Red Sea.\nHMS Diamond patrols in the Red Sea (LPhot Chris Sellars/MoD/PA)Its slogan includes the words “death to America”, “death to Israel” and “a curse upon the Jews”.\nThe death of the group’s founder, Hussein al Houthi, at the hands of the Yemeni military led to the Houthi insurgency from 2004.\nThe group’s takeover of the capital prompted Saudi Arabia to intervene in a bid to restore the internationally recognised government, which has a Sunni majority.\nThe rebels have attacked Saudi Arabia, the UAE and most recently Israel with missiles before the clashes in the Red Sea erupted."}, {"id": "65959dfd-6bdb-4dd5-8bc8-b0e62fe6d045", "title": "U . S . Envoy Amos Hochstein Arrives in Mideast to Discourage War in Lebanon", "date": "2024-06-17 16:15", "url": "https://www.breitbart.com/middle-east/2024/06/17/u-s-envoy-amos-hochstein-arrives-in-mideast-to-discourage-war-in-lebanon/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "U.S. Special Envoy Amos Hochstein met with Israeli Prime Minister Benjamin Netanyahu on Monday as he tried to push Israel and Lebanon to avoid a war that Hezbollah has expanded in recent weeks by firing at northern Israel.\nMencer said that Hezbollah had fired over 5,000 projectiles at northern Israel since October.\n“There is no territorial dispute between Lebanon and Israel,” he said, alluding to the fact that the United Nations had confirmed the border between Lebanon and Israel after Israel withdrew from Lebanon in 2000.\n… One way or another – we will ensure the safe and secure return of Israelis to their homes in Northern Israel.\nFor the two decades before, Israel had maintained a “security zone” near the border in southern Lebanon to prevent terrorists from firing rockets at its northern border communities."}, {"id": "127ebc9a-ece5-4b82-a0c0-cb299e4b4b5b", "title": "Russian warships near Florida aim to intimidate . US Navy views them like targets", "date": "2024-06-17 09:30", "url": "https://www.foxnews.com/opinion/russian-warships-near-florida-aim-intimidate-navy-views-them-more-like-target-practice", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "This being the Russian navy, they wisely brought along an oiler for refueling and a salvage tug, just in case.\nNo way will Russia risk her in the Black Sea, where Ukraine’s shore defense batteries and drones have already sunk Russian navy ships like the Moskva.\nA posse of U.S. Coast Guard and Navy ships and planes, with an assist from Canada, is picking up every move of Putin’s tiny task force.\nThe U.S. Coast Guard National Security Cutter Stone is sleek, fast and new, having been delivered in 2020.\nCLICK HERE TO GET THE FOX NEWS APPSo, just consider the Russian warships drilling off the Atlantic coast as \"target practice.\""}, {"id": "ca9f27c0-c027-4ad4-b8f1-83945230ba2d", "title": "FBI , Interpol and Spanish police thwart ISIS attack on Real Madrid", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/breaking-news/article-806570", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An Islamic State terrorist organization splinter cell planned a shooting attack on Real Madrid fans and players, the newspaper 'El Confidencial' revealed on Monday.\nLast week, in a joint operation with Interpol and the US FBI, the Spanish Civil Guard Information Service dismantled the so called I'lam Foundation, one of the largest propaganda centers linked to the Islamic State, said the 'El Confidencial' report.\nThe cell had ordered its followers to attack the bus of the Real Madrid players and their fans.\nAim at them along with their supporters,\" alongside a picture of a hooded man opening fire with a rifle, the target set on the Real Madrid bus.\nAn ISIS fighter poses in front of an Islamic State flag (credit: Wikimedia Commons)The attack, planned on Santiago Bernabéu Stadium, was thwarted and nine people, including residents from Girona, Cadiz, and Almeria, were arrested."}, {"id": "b429e442-81c2-4cd9-a2d0-1a7003b5ad8f", "title": "All passengers on board a flight which made an emergency landing in Invercargill have disembarked - 17 - Jun - 2024", "date": "2024-06-17 11:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400610", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "A suspected bird strike has left Melbourne-bound passengers in Invercargill overnight after an emergency landingA suspected bird strike has left Melbourne-bound passengers in Invercargill overnight after an emergency landing18 June 2024The Virgin Australia flight experienced the problem on departure from Queenstown just on 6pm yesterday.\nWitnesses report flames coming from an engine and loud bangsFire and Emergency New Zealand were prepared, but any fire appeared to have gone out by its arrival.\nThe airline's Chief Operations Officer Stuart Aggs says he's not aware of any injuries to anyone on board the Boeing 737-800.\nAll 73 were given accommodation and transport for the night - while arrangements were made to get them to Australia.\n© 2024Newstalk ZB, NZCity"}, {"id": "dd7f3a59-242f-4f4c-8c7b-152550110b85", "title": "Israel announces daily Gaza  pause  for aid deliveries", "date": "2024-06-17 11:45", "url": "https://www.naharnet.com/stories/en/305953-israel-announces-daily-gaza-pause-for-aid-deliveries", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory.\nThe military said the pause was already in effect and part of efforts to \"increase the volumes of humanitarian aid\" following discussions with the U.N. and other organizations.\nIsrael's retaliatory offensive has killed at least 37,296 people in Gaza, mostly civilians, according to the health ministry in Gaza.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected.\nIsrael's hardline National Security Minister Itamar Ben Gvir said Sunday the humanitarian pause announced by the military was part of a \"crazy and delusional approach\"."}, {"id": "49212a84-f136-421d-a790-ff2756f6ceef", "title": "Germany to resume Afghan deportations via Uzbekistan - Newspaper", "date": "2024-06-17 03:45", "url": "https://www.dawn.com/news/1840410/germany-to-resume-afghan-deportations-via-uzbekistan", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "FRANKFURT: Ger­many’s government is holding talks with Uzbekistan to enable deportations from Germany to Afghanistan without direct consultations with the Taliban, according to a report in German magazine Der Spiegel on Sunday.\nIt stopped deportations to Afghanistan after the Tali­ban took power in 2021.\nThe Uzbek government wants to sign a formal migration agreement with Germany before a deal on deportations, the Spiegel report said.\nOfficials had been carrying out an “intensive review for several mon­ths… to allow the deportation of serious criminals and dangerous individuals to Afghanistan”, Interior Minister Nancy Faeser told journalists.\nDeportations to Afgha­nis­tan from Germany have been completely stopped since the Taliban retook power in 2021."}, {"id": "dfda77b9-c31f-4847-b0e9-3e1f5ba84303", "title": "Ukraine hits Russian oil facilities as Zelensky joins D", "date": "2024-06-17 01:15", "url": "http://www.myanmarmuslim.net/news/20240617303e599687.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In Belgorod, a drone hit an oil depot overnight, governor Vyacheslav Gladkov said, causing an explosion and a fire in one of the oil reservoirs.\nThat threat came after Nato allies said they would allow Ukraine to use weapons they deliver to Kyiv to attack Russian territory.\n“Let the US and its allies feel the impact of direct use of Russian weapons by others,” he said.\nMr Putin deliberately did not name potential recipient countries of Russian weapons, Mr Medvedev said.\nKremlin spokesman Dmitry Peskov said the use of western weapons against Russia “can’t be left without consequences, and those consequences will certainly follow”."}, {"id": "1b69ae39-85d8-42e4-b1e2-33ca13c3764f", "title": "Haiti declares curfew as it tries to restore order after weekend jailbreak", "date": "2024-06-17 01:00", "url": "http://www.myanmarmuslim.net/news/20240617331c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“The police were ordered to use all legal means at their disposal to enforce the curfew and apprehend all offenders,” said a statement from finance minister Patrick Boivert, the acting prime minister.\nHaiti’s National Police has roughly 9,000 officers to provide security for more than 11 million people, according to the UN.\nA second Port-au-Prince prison containing around 1,400 inmates was also overrun.\nMr Henry took over as prime minister following Mr Moise’s assassination and has postponed plans to hold parliamentary and presidential elections, which have not happened in almost a decade.\nThe prime minister, a neurosurgeon, has shrugged off calls for him to resign and did not comment when asked if he felt it was safe to come home."}, {"id": "6ed7f7c4-af64-4722-a7c0-9062408e1bde", "title": "Police investigate two overnight stabbings in Rochester", "date": "2024-06-17 10:45", "url": "https://13wham.com/news/local/2-overnight-stabbings-in-rochester", "domain": "13wham.com", "domain_classification": "Unknown", "message": "— Two people are being treated for injuries after separate stabbings in the city Sunday night.\nAround 10:15 p.m., police spoke to the already hospitalized victim of a stabbing.\nThe victim said that an individual stabbed him during an argument at North Clinton Avenue near Hoeltzer Street.\nThen around 10:45 p.m., officers responded to reports of a stabbing on Orchard Street near Lime Street.\nAnyone with information is asked to call 911 or Crime Stoppers at 423-9300."}, {"id": "33891fa4-fc28-4538-a2a8-017784571d04", "title": "  Strike : An Uncivil War  Wins Audience Award At Sheffield DocFest", "date": "2024-06-17 19:00", "url": "https://deadline.com/2024/06/strike-an-uncivil-war-sheffield-docfest-2024-audience-award-1235975960/", "domain": "deadline.com", "domain_classification": "Unknown", "message": "Those shocking events are investigated in the documentary Strike: An Uncivil War, which on Monday – the eve of the anniversary – won the Audience Award at the 31st Sheffield DocFest.\n‘Strike: An Uncivil War’ Tull Stories/VeryMuchSo/Embankment Films“We have been overawed by how much audiences have been deeply engaged with films at Sheffield DocFest this year, and this is especially true of Daniel Gordon’s Strike: An Uncivil War,” Sheffield Creative Director Raul Niño Zambrano and Managing Director Annabel Grundy said in a statement.\nThe film will be released in cinemas on Friday, June 21 by Tull Stories, in partnership with VeryMuchSo and Embankment Films.\n‘Strike: An Uncivil War’ John Sherbourne/ANL/Shutterstock”Strike: An Uncivil War took about ten years in the making,” Gordon said.\n“It pays particular focus to the Battle of Orgreave, which took place on 18th June 1984, the bloodiest day of the Strike."}, {"id": "185aeca2-dd26-4057-a47b-ffbbc1fe6c87", "title": "Philippine Captain Vows To Return To Sea After Houthi", "date": "2024-06-17 17:15", "url": "https://www.marinelink.com/news/philippine-captain-vows-return-sea-houthi-514527", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "The Philippine crew of a vessel attacked by Yemen's Houthi militants was repatriated to the Philippines from Bahrain on Monday, with the ship's captain vowing to return to the seas after the crew had recovered from the experience.\nThe ship was carrying 22 crew from the Philippines and one is still missing in the flooded engine room.\n\"We first need to rest because of the trauma,\" the Tutor's Captain Christian Domarique told a press conference at Manila airport.\nHouthi attacks have struck three vessels crewed by Filipino seafarers since last year, killing two sailors, with 17 still being held captive by militants, government data showed.\n(Reuters - Reporting by Neil Jerome Morales, Jay Ereno and Adrian Portugal; Editing by Ed Davies and Sharon Singleton)"}, {"id": "df2da6c3-b304-4e26-ad9b-27e5dcc6b2f3", "title": "US military shoots down missiles and drones as it faces threats in Middle East", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617319a599626.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US forces in the Middle East are facing increasing threats after a Navy warship shot down missiles appearing to head toward Israel on Thursday.\nThe official said one projectile was shot down and another struck, but according to early reports no one was injured.\nA US official said they do not believe the missiles — which were shot down over the water — were aimed at the warship.\nAn array of other drone attacks over the past three days did target US bases, including one in southern Syria on Thursday that caused minor injuries.\nThe most recent drone attack was Thursday at al-Asad Air Base in western Iraq."}, {"id": "bb7d5cd6-94e9-4802-bf53-f1393bee4082", "title": "Netanyahu dissolves Israeli war cabinet after resignations", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/netanyahu-dissolves-israeli-war-cabinet-102356823.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the prime minister confirmed.\nIsraeli media had earlier leaked the news about the break-up of the cabinet, which was formed after the Hamas terrorist attacks of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz - a former general and defence minister - announced his withdrawal due to differences of opinion with regard to the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "00240623-c77b-4476-9698-42f31e0eef89", "title": "Ukraine claims drones sank Russian ship in Black Sea", "date": "2024-06-17 15:30", "url": "http://www.myanmarmuslim.net/news/2024061783c599860.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukraine has claimed it used sea drones to sink a Russian ship in the Black Sea, as Kremlin investigators alleged that a Russian military transport plane that crashed last month was brought down by two US-made Patriot missiles fired by Kyiv’s forces.\nUkraine’s GUR military intelligence agency published a video it said showed naval drones assaulting the Russian missile-armed cutter Ivanovets on Wednesday night.\nA bridge over Lake Donuzlav (Alamy/PA)The lake has been more of a bay since 1961 when a channel connecting it to the Black Sea was dug out.\nPrivate security firm Ambrey said Ukraine used up to six sea drones, each of which usually carry 660lb of explosives.\nAmbrey noted that any unexploded drones could be a threat for Black Sea shipping."}, {"id": "a05a7209-fed2-4cee-ab98-d2223f07f166", "title": "Houston shooting : 13 - year - old killed , 16 - year - old brother injured during parking lot shooting", "date": "2024-06-17 16:15", "url": "https://www.yahoo.com/news/houston-shooting-13-old-killed-112544147.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Houston - A shooting in Southwest Houston has resulted in the death of a 13-year-old boy and left his 16-year-old brother wounded.\nFOX 26 Houston is now on the FOX LOCAL app available through Apple TV, Amazon FireTV, Roku and Google Android TV!\nSUGGESTED: Officer-involved shooting under investigation in Southeast HoustonAccording to HPD, the incident occurred as the brothers were walking across a parking lot at 9111 Lakes At 610 Drive.\nDOWNLOAD THE FOX 26 HOUSTON APP BY CLICKING HEREHomicide detectives are on the scene investigating what they believe to be a targeted attack.\nThe suspect's vehicle left the location in an unknown direction, and the investigation is ongoing."}, {"id": "250e478d-8cea-4fc0-8c97-3ec1f59fa6f6", "title": "At least 95 killed in twin blasts at ceremony honouring Iranian general", "date": "2024-06-17 10:00", "url": "http://www.myanmarmuslim.net/news/20240617977a598966.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Two explosions minutes apart at a commemoration in Iran for a prominent general who died in a US drone strike in 2020 killed at least 95 people and injured more than 211 others on Wednesday.\nThe blasts came as the Middle East remains on edge over Israel’s war on Hamas in the Gaza Strip.\nWhile Israel has carried out attacks in Iran over its nuclear programme, it has conducted targeted assassinations, not mass-casualty bombings.\nThe blasts struck an event marking the the fourth anniversary of the killing of General Qassem Soleimani, the head of the Revolutionary Guard’s elite Quds Force, in a US drone strike in Iraq in January 2020.\nUltimately, a drone strike launched by the Trump administration killed the general, part of escalating incidents that followed America’s 2018 unilateral withdrawal from Tehran’s nuclear deal with world powers."}, {"id": "ce770f4a-632d-42ec-9421-41323ced4279", "title": "Israel army to pause daytime fighting along route in Gaza to help with aid", "date": "2024-06-17 02:30", "url": "https://www.newschannel5.com/world/israel-at-war/israels-army-says-it-will-pause-daytime-fighting-along-a-route-in-southern-gaza-to-help-flow-of-aid", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nIt could help address the overwhelming needs of Palestinians that have surged in recent weeks with Israel's incursion into Rafah.\nThe army said that the daily pause would begin at 8 a.m. and last until 7 p.m. and continue until further notice.\nHard-hit northern Gaza, an early target in the war, is served by goods entering from the north.\nWhile the army insisted “there is no cessation of fighting” in southern Gaza, it also said the new route would be open during daytime hours “exclusively for the transportation of humanitarian aid.”The fighting continued."}, {"id": "7ac12ead-8be0-45da-a181-5f9b471de973", "title": "Man Plotted Mass Shooting in Atlanta to Incite  Race War , Officials Say", "date": "2024-06-17 16:00", "url": "https://indianexpress.com/article/world/man-plotted-mass-shooting-in-atlanta-to-incite-race-war-officials-say-9397758/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "An Arizona man who planned to commit a mass shooting at an Atlanta rap concert as a way of inciting a “race war” has been indicted by a federal grand jury on hate crime and firearm charges.\nPrieto intended for the shooting to incite a “race war” before the presidential election, prosecutors said in a news release.\nOfficials stopped and arrested Prieto, of Prescott, Arizona, near Interstate 40 in New Mexico on May 14, according to prosecutors.\nOfficials were tipped off about Prieto in October by a man who had known and frequently chatted with him at gun shows, according to an affidavit filed in court.\nThe indictment said that beginning in January, at several gun shows around Arizona, Prieto discussed mass shooting plans with an undercover agent and the man who had reported him (now working as an informant)."}, {"id": "ca3c5713-e7c7-4301-88ba-0a68e377eba4", "title": "Pakistan : At least five policemen killed , 3 injured as vehicle overturns in Hub", "date": "2024-06-17 13:00", "url": "https://news.webindia123.com/news/Articles/World/20240617/4206539.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Following the tragic incident, the injured people were taken to District Headquarters Hospital, and were given immediate medical attention, the police officials said.\nWhereas, in a separate incident, at least three police personnel were injured in a grenade attack.\nThe hand grenades were thrown on a police vehicle in the Sachal area of Karachi, ARY News.\nPrior to this incident, unidentified men hurled a hand grenade at the Senior Superintendent of Police (SSP's) squad in Dera Murad Jamali, Naseerabad.\nSSP Naseerabad Hussain Lehri and his team were returning from a regular patrol when the hand grenade burst, according to police officials, although no one was hurt, according to ARY News."}, {"id": "271406e7-aae6-48b9-9c94-3ace1def6358", "title": "US forces shoot down ballistic missiles in Red Sea", "date": "2024-06-17 15:00", "url": "http://www.myanmarmuslim.net/news/20240617809c599134.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The US military said on Sunday that it shot down two anti-ship ballistic missiles fired towards a container ship by Yemen’s Houthi rebels in the Red Sea.\nThe Singapore-flagged Maersk Hangzhou reported that it had already been hit by a missile on Saturday night while transiting the Southern Red Sea and requested assistance, Centcom said in a statement.\nThe attackers fired small arms weapons at the Maersk Hangzhou, getting to within about 65ft (20m) of the vessel, Centcom said.\nThe Denmark-based shipping giant Maersk, owner of Maersk Hangzhou, said on Sunday it would suspend shipping through the Red Sea again after the two attacks on its freighter.\nThe Iran-backed Houthis have claimed attacks on ships in the Red Sea that they say are either linked to Israel or heading to Israeli ports."}, {"id": "85bc71a2-dee1-4f93-8d3d-1439eac721bd", "title": "The war in Gaza has wiped out entire Palestinian families . AP documents 60 who lost dozens or more", "date": "2024-06-17 15:30", "url": "https://www.pressenterpriseonline.com/apnews/the-war-in-gaza-has-wiped-out-entire-palestinian-families-ap-documents-60-who-lost-dozens-or", "domain": "pressenterpriseonline.com", "domain_classification": "Unknown", "message": "Nearly a quarter of those families lost more than 50 family members in those weeks.\nThe large Doghmush clan lost at least 44 members in a strike on a mosque; AP documented over 100 family members killed in following weeks.\nWithin five days, Israel Air Force dropped 6,000 bombs on Gaza, including many unguided missiles.\nAmong the 80 Salem family dead: his mother, three brothers, his only sister and her four children.\nNine-year-old Abdullah is the only survivor of his bloodline — Israeli strikes killed his father, mother and seven sisters."}, {"id": "dfdb5ebd-5cfc-466e-8b4c-080fe110455b", "title": "Ukraine hits Russian oil facilities as Zelensky joins D", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617500d599499.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In Belgorod, a drone hit an oil depot overnight, governor Vyacheslav Gladkov said, causing an explosion and a fire in one of the oil reservoirs.\nThat threat came after Nato allies said they would allow Ukraine to use weapons they deliver to Kyiv to attack Russian territory.\n“Let the US and its allies feel the impact of direct use of Russian weapons by others,” he said.\nMr Putin deliberately did not name potential recipient countries of Russian weapons, Mr Medvedev said.\nKremlin spokesman Dmitry Peskov said the use of western weapons against Russia “can’t be left without consequences, and those consequences will certainly follow”."}, {"id": "1f622cf7-7419-4a77-b0d7-4d7b93981e0f", "title": "Emhoff to speak at new Tree of Life synagogue groundbreaking", "date": "2024-06-17 14:45", "url": "https://www.yahoo.com/news/emhoff-speak-tree-life-synagogue-125127535.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Emhoff to speak at new Tree of Life synagogue’s groundbreakingSecond gentleman Doug Emhoff will attend the groundbreaking ceremony later this week for the new campus of the Tree of Life synagogue in Pittsburgh, the White House announced Monday.\nEmhoff, who is Jewish, will deliver remarks at the event Sunday, nearly six years after a gunman opened fire at the synagogue, killing 11 people in the deadliest antisemitic attack in American history.\nThe new space is expected to include spaces for worship, a museum, a movie theater and an education center, according to The Associated Press.\nA memorial to the victims of the October 2018 shooting is planned for a site just outside the synagogue.\nEmhoff has made tackling antisemitism a core part of his work as second gentleman."}, {"id": "c4d8b551-1d45-43f9-9afc-a778b7ac6a69", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-06-17 12:00", "url": "http://www.myanmarmuslim.net/news/2024061709e599989.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Four teenagers plotted to buy guns and attack Jewish people days after a bishop was stabbed in a Sydney church, according to police documents cited on Monday.\nAustralian police say the knife attack in Sydney that wounded a bishop and a priest during a church service was an act of terrorism.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nBishop Emmanuel on Sunday gave his first sermon since the stabbing at the Christ the Good Shepherd Church."}, {"id": "4d678402-8248-4183-8da8-3fe60e6ced1f", "title": "Netanyahu dissolves Israeli war cabinet after resignations", "date": "2024-06-17 12:00", "url": "https://www.prokerala.com/news/articles/a1540113.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Tel Aviv, June 17 : Israeli Prime Minister Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the Prime Minister confirmed.\nIsraeli media had earlier leaked the news about the disbanding of the cabinet, which was formed after the Hamas terrorist attacks of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz -- a former general and Defence Minister -- announced his withdrawal due to differences of opinion concerning the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "1a0f5493-d812-4ad6-81ac-547115d04f46", "title": "6 people wounded when two gunmen open fire in Englewood -- second mass shooting in an hour early Monday", "date": "2024-06-17 12:45", "url": "https://chicago.suntimes.com/crime/2024/06/17/6-people-wounded-englewood", "domain": "chicago.suntimes.com", "domain_classification": "Unknown", "message": "Seven people were wounded when two gunmen opened fire in Englewood early Monday morning.\nA 20-year-old man was taken to University of Chicago Medical Center in critical condition with a gunshot wound to his neck.\nA man, 31, was taken to University of Chicago Medical Center with a gunshot wound to his ankle, and another man, 32, was taken to St. Bernard Hospital.\nThe attack was the second mass shooting in about an hour early Monday.\nIn all, more than 20 people were shot in Chicago in a little more than four hours early Monday."}, {"id": "ac22f959-30cd-478b-8abb-0227021178e8", "title": "Cult favorite action movie sequel to start filming soon", "date": "2024-06-17 15:00", "url": "https://www.shortlist.com/news/cult-favorite-action-movies-sequel-to-start-filming-soon-404601", "domain": "shortlist.com", "domain_classification": "Unknown", "message": "A sequel to the brilliant action movie Nobody is due to begin shooting in just a few months.\nNobody 2 may start filming as early as August, reports Collider, with shooting date estimates ranging from August to October.\nWe heard about plans for a sequel in that same year, and filming was at one point reportedly pencilled in for 2023.\nHe did appear to be attached to the sequel at one point, but Collider reports he is no longer involved.\nWe like to think a sequel could do even better, arriving — fingers crossed — nowhere near a global pandemic."}, {"id": "4e462fec-b8ba-4a5f-85ce-8a1431ee6094", "title": "Political scientist Abraham : President speech about bringing society together", "date": "2024-06-17 16:00", "url": "https://enrsi.rtvs.sk/articles/news/366969/political-scientist-abraham-presidents-speech-about-bringing-society-together", "domain": "enrsi.rtvs.sk", "domain_classification": "Unknown", "message": "According to political scientist Samuel Abraham the first speech of President Peter Pellegrini sounded rather conservative and lacked a more pronounced address to women and members of minorities.\nAbraham pointed out that the new head of state talked a lot about family.\n\"However, we know that there are hundreds of thousands of people in Slovakia who are divorced, who are not in a family union or who are of a different orientation,\" he added.\nThe political scientist pointed out that besides the assassination attempt on the premier, Pellegrini didn't mention some events with a political background, for example, the murder of journalist Jan Kuciak or the shooting on Zamocka Street in Bratislava.\nSource: TASRRomana Grajcarová, Photo: TASR"}, {"id": "3d2954a2-13b2-4c0c-8ee7-c6f10b598bde", "title": "Political scientist Abraham : President speech about bringing society together", "date": "2024-06-17 16:15", "url": "https://enrsi.rtvs.sk/articles/topical-issue/366963/political-scientist-abraham-presidents-speech-about-bringing-society-together", "domain": "enrsi.rtvs.sk", "domain_classification": "Unknown", "message": "According to political scientist Samuel Abraham the first speech of President Peter Pellegrini sounded rather conservative and lacked a more pronounced address to women and members of minorities.\nAbraham pointed out that the new head of state talked a lot about family.\n\"However, we know that there are hundreds of thousands of people in Slovakia who are divorced, who are not in a family union or who are of a different orientation,\" he added.\nThe political scientist pointed out that besides the assassination attempt on the premier, Pellegrini didn't mention some events with a political background, for example, the murder of journalist Jan Kuciak or the shooting on Zamocka Street in Bratislava.\nSource: TASRRomana Grajcarová, Photo: TASR"}, {"id": "485997d2-29b9-490a-a375-51f9468f91cb", "title": "Netanyahu Dissolves Israeli War Cabinet After Resignations", "date": "2024-06-17 12:00", "url": "https://menafn.com/1108340889/Netanyahu-Dissolves-Israeli-War-Cabinet-After-Resignations", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Tel Aviv, June 17 (IANS/DPA) Israeli Prime Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the Prime Minister confirmed.\nIsraeli had earlier leaked the news about the disbanding of the cabinet, which was formed after the Hamas of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz -- a former general and Defence Minister -- announced his withdrawal due to differences of opinion concerning the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "9efb10ee-0bf3-4143-ab90-04cdc6e50e71", "title": "Enugu On Edge : Four Injured In Overnight Clash , Fears Of Escalating Communal Violence Grow", "date": "2024-06-17 12:00", "url": "https://saharareporters.com/2024/06/17/enugu-edge-four-injured-overnight-clash-fears-escalating-communal-violence-grow", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "\"Then at night, at about 11 pm they came in and started shooting everybody.\nThey shot me and I held them and they started shooting everybody, using cutlasses on some people.\nOne of them, Samuel, is an Abakaliki man who lived in Umualor.\nThey started shooting at us.\n\"The man who shot me is an Abakaliki man; I know all of them."}, {"id": "b50d5417-102d-45ca-a9a5-f65bf9f21da2", "title": "Double stabbing as Stoke - on - Trent house party descends into violence", "date": "2024-06-17 16:15", "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/double-stabbing-stoke-trent-house-9348621", "domain": "stokesentinel.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up to our newsletterSomething went wrong, please try again later.\nAnd police believe the incident on Fenton's Victoria Road may have followed on from a house party in the area.\nOfficers believe the incident may have followed on from a house party that was taking place in the area when it happened."}, {"id": "817cec7e-d1b2-4dc0-984a-2da0da49f029", "title": "  Will pursue his defence vigorously , ensure he receives full due process : US Attorney of Pannun  murder plot  accused Nikhil Gupta", "date": "2024-06-17 17:30", "url": "https://news.webindia123.com/news/Articles/World/20240617/4206619.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "\"We will pursue his (Gupta's) defence vigorously and ensure he receives full due process, regardless of outside pressures,\" Chabrowe firmly asserted.\nNikhil Gupta has been accused by US federal prosecutors of plotting with an Indian government official to kill Gurpatwant Singh Pannun.\nNew Delhi has firmly dissociated itself from the plot against Pannun, saying it is against Indian government's policy.\nIn November last year, US Justice Department officials announced charges against Gupta after he was arrested in June 2023 in the Czech Republic.\nThe purported hitman was offered USD 100,000 to murder the separatist leader, the Justice Department claimed."}, {"id": "e5098694-772c-4bc1-bf02-b7fe20422bdb", "title": "Rare day of relative calm as Gaza sees  tactical pause  for aid", "date": "2024-06-17 11:45", "url": "https://www.naharnet.com/stories/en/305960-rare-day-of-relative-calm-as-gaza-sees-tactical-pause-for-aid", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "\"Compared with the previous days, today, the first day of Eid al-Adha, is considered near calm and the calm has prevailed across all of Gaza,\" Mahmud Basal, spokesman for the civil defense agency in Hamas-ruled Gaza, told AFP.\nHe said the exceptions included \"some targeting\" in Gaza City's Shujaiya and Zeitun areas, as well as Israeli artillery fire in Rafah, southern Gaza.\nOverall calm continued in most of Gaza at the end of Sunday's pause, an AFP correspondent said.\nThe eight soldiers killed Saturday were hit by an explosion as they travelled in an armored vehicle near Rafah, the military said.\nIsrael's hardline National Security Minister Itamar Ben Gvir said the humanitarian pause announced by the military was part of a \"crazy and delusional approach\"."}, {"id": "4f7b1e7d-701b-4712-8ca9-6e3853dec28a", "title": "Man fatally stabbed at homeless encampment in Long Beach", "date": "2024-06-17 00:00", "url": "https://www.presstelegram.com/2024/06/16/man-fatally-stabbed-at-homeless-encampment-in-long-beach/", "domain": "presstelegram.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at an encampment near the Los Angeles River in Long Beach on Saturday, June 15, authorities said.\nJust before 9 a.m., the victim was involved in an argument at the encampment along Long Beach Boulevard when someone stabbed him, according to the Long Beach Police Department.\nIt was not clear whether the suspect and victim knew each other, and a motive for the stabbing was under investigation.\nLong Beach Police are asking anyone with information regarding the stabbing to contact Homicide Detectives Ethan Shear or Chasen Contreras at 562-570-7244.\nAnonymous tips may be submitted through “LA Crime Stoppers” by calling 800-222-TIPS (8477)."}, {"id": "b0e824c0-4371-4491-a34f-e25676b16c59", "title": "Israel resists US pressure to pause the war to allow more aid into Gaza Strip", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/2024061714b599931.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In the Gaza Strip, Israeli troops tightened their encirclement of the largest city amid continued battles with Hamas militants.\nAl Jazeera TV reported that a strike late on Friday hit a school in Gaza City where many were taking refuge, causing casualties.\nTwenty-four Israeli soldiers have been killed in the Gaza Strip since the start of the ground operation.\nIsraeli military officials said their forces have encircled densely built-up Gaza City and began on Friday to launch targeted attacks on militant cells.\nIsrael says Hamas has extensive military infrastructure in the city, including a network of underground tunnels, bunkers and command centres."}, {"id": "4876209a-21db-4e3b-a4ec-a0c5121f88ba", "title": "Israel resists US pressure to pause the war to allow more aid into Gaza Strip", "date": "2024-06-17 16:00", "url": "http://www.myanmarmuslim.net/news/20240617568b599426.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In the Gaza Strip, Israeli troops tightened their encirclement of the largest city amid continued battles with Hamas militants.\nAl Jazeera TV reported that a strike late on Friday hit a school in Gaza City where many were taking refuge, causing casualties.\nTwenty-four Israeli soldiers have been killed in the Gaza Strip since the start of the ground operation.\nIsraeli military officials said their forces have encircled densely built-up Gaza City and began on Friday to launch targeted attacks on militant cells.\nIsrael says Hamas has extensive military infrastructure in the city, including a network of underground tunnels, bunkers and command centres."}, {"id": "3120a5fb-3e46-4d3a-8887-21cc972341da", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims – Winnipeg Free Press", "date": "2024-06-17 11:00", "url": "https://www.winnipegfreepress.com/world/2024/06/17/emhoff-will-speak-at-groundbreaking-of-the-memorial-for-the-pittsburgh-synagogue-shooting-victims", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "WASHINGTON (AP) — Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nFILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting."}, {"id": "8af1d79a-9a4a-4e63-8cbd-e049f2677784", "title": "The beautiful musical legacy of teen who died at Manchester Arena", "date": "2024-06-17 10:15", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/the-beautiful-musical-legacy-of-29366752", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Eilidh’s Trust was established to support music education for young people across Scotland.\n(Image: UGC)A spokesperson said: \"Eilidh's Trust funding will be used in a variety of ways, including instrument purchases and travel and accommodation to attend competitions and festivals.\nAt the public inquiry, Eilidh's family described her as 'the warmest girl that you could ever meet'.\nThe video showed beautiful, scenic images from the Isle of Barra, all set to Scottish pipe music.\nSuicide bomber Salman Abedi detonated a rucksack bomb in the City Room area of Manchester Arena after the concert."}, {"id": "da4f1113-8482-4554-bc08-2bd41131a832", "title": "Accused in Pannun murder for hire plot extradited to united states ", "date": "2024-06-17 03:45", "url": "https://www.geo.tv/latest/549801-accused-in-pannun-murder-for-hire-plot-extradited-to-usa", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Pro-Khalistan Sikh leader and Sikhs For Justice (SFJ) General Counsel Gurpatwant Singh Pannun (centre).\n— Photo by authorLONDON: Indian citizen and Indian spy agency RAW’s agent accused of attempting to kill Sikh leader Gurpatwant Singh Pannun in New York has been extradited to the US ahead of an expected federal court appearance.\nNikhil Gupta has been charged with murder for hire linked to a foiled plot to assassinate Gurpatwant Singh Pannun, a dual US and Canadian citizen who advocates for an independent Sikh state called Khalistan.\nThe Justice Department alleges that Gupta, 52, is an associate of an Indian government “senior field officer” and that together they and others helped plot the assassination of Pannun.\nAround that time in Canada, on June 18, gunmen shot and killed another Sikh separatist leader, Hardeep Singh Nijjar, outside a Sikh temple in British Columbia."}, {"id": "4a4726ac-3fae-4bd9-aaa7-f899a2fcd37f", "title": "Russo - Ukraine War - 16 June 2024", "date": "2024-06-17 03:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-16.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nAccording to preliminary information, since the beginning of the day Russian forces loss totaled 122 occupants dead and wounded, 31 Russian personnel shelters and ammunition depots were affected.\nNine assault actions in the area of Verkhnyokamiansky and Rozdolivka were repelled by the Defense Forces units.\nRussian troops have repelled seven counterattacks by assault detachments from the 36th Marine Brigade and the 13th National Guard Brigade."}, {"id": "41ce67df-806d-467f-b1e9-b9385498dec5", "title": "Man goes on trial for murder of ex - girlfriend in Fukuoka", "date": "2024-06-17 09:15", "url": "https://japantoday.com/category/crime/man-goes-on-trial-for-murder-of-ex-girlfriend-in-fukuoka", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "A 32-year-old man went on trial Monday for killing his 38-year-old ex-girlfriend in Fukuoka City last year.\nDuring the opening session of his lay judge trial at the Fukuoka District Court, Susumu Terauchi said: \"I stabbed her, but I didn't lie in wait to ambush her,” Kyodo News reported.\nHe said Terauchi was on his way to a shop near Hakata Station to pay his mobile phone bill and unexpectedly met the victim.\nWhen he asked if he could talk to her, she ignored him and he \"exploded with emotion,” the defense said.\nStreet surveillance camera footage near where Kawano’s body was found showed Terauchi quarreling with Kawano as they walked along a street."}, {"id": "3c8dae4e-a2b9-48ec-8d58-42431cdecd6a", "title": "Sheriff plans to give update in Michigan mass shooting as investigators search for motive – Winnipeg Free Press", "date": "2024-06-17 17:15", "url": "https://www.winnipegfreepress.com/world/2024/06/17/sheriff-plans-to-give-update-in-michigan-mass-shooting-as-investigators-search-for-motive", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "PONTIAC, Mich. (AP) — Two of the nine people wounded in a weekend shooting at a suburban Detroit splash pad remain hospitalized in critical condition, including an eight-year-old boy who has “made amazing progress” after he was shot in the head, authorities said Monday.\nPolice respond to the scene of a shooting at the Brooklands Plaza Splash Pad, Saturday, June 15, 2024, in Rochester Hills, Mich.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays.\nBouchard said Nash had no connections to the splash pad or any victims.\nRochester Hills is about 15 miles (24 kilometers) south of Oxford, where in 2021 a 15-year-old fatally shot four high school students."}, {"id": "9a845108-b599-40ac-a8be-8cf77d26e627", "title": "Nikhil Gupta , suspect in plot to kill Gurpatwant Singh Pannun , extradited to US | India News", "date": "2024-06-17 01:00", "url": "https://timesofindia.indiatimes.com/india/nikhil-gupta-suspect-in-plot-to-kill-gurpatwant-singh-pannun-extradited-to-us/articleshow/111046905.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Typically, extradited defendants must appear in court within a day of their arrival in the country.\n\"US federal prosecutors have alleged that Gupta was working for an Indian official to facilitate the murder-for-hire plot against Pannun, and that he hired a hitman and paid $15,000 in advance.\nGupta, through his attorney Rohini Musa, has also denied the charges, claiming that he has been \"unfairly charged.\n\"In a petition to the Indian Supreme Court, Musa stated that there is \"nothing on record to link the Petitioner to the massive alleged plot to assassinate the alleged victim.\nIt is expected that Sullivan will raise the issue with his Indian counterpart, Ajit Doval, during their meeting."}, {"id": "16b46015-2bb7-4da5-86fa-5f6cfdfbbb88", "title": "Netanyahu tells Israel  we are at war  as Hamas launches unprecedented attack", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/20240617005d599940.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Prime minister Benjamin Netanyahu has told Israel that it is “at war” with Hamas militants that rule the Gaza Strip, after they launched a major, multi-front attack on the country.\nAt least 40 people in Israel have been killed and hundreds wounded, making the unprecedented surprise early morning attack by Hamas the deadliest in Israel in years.\nPolitical commentators lambasted the government over its failure to anticipate what appeared to be a Hamas attack unseen in its level of planning and co-ordination.\nIt said its forces were engaged in gunfights with Hamas militants who had infiltrated Israel in at least seven locations.\nThe shadowy leader of Hamas’ military wing, Mohammed Deif, announced the start of what he called “Operation Al-Aqsa Storm”."}, {"id": "7bc49f6d-9a85-4b61-80c3-5f1f4ecb391d", "title": "Hezbollah aggression pushing region toward broader conflict , IDF spokesperson says", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/article/hkty2thh0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Hezbollah's escalating aggression is pushing the region toward a broader conflict, IDF Spokesperson Rear Admiral Daniel Hagari warned on Sunday.\nIDF Spokesperson Rear Admiral Daniel Hagari in message to Hezbollah ( Video: IDF Spokesperson's Unit )\"Hezbollah is jeopardizing the future of Lebanon - so that it can be a shield for Hamas.\nHe emphasized Israel's commitment to protecting its citizens, saying, \"Israel has a duty to defend the people of Israel.\nA rare and quiet day unfolded along Israel's northern border, a region that has been the epicenter of conflict for months.\nIDF airstrikes in southern Lebanon ( Video: IDF Spokesperson's Unit )Despite the lull, Israel continued its strikes throughout the day, and Hezbollah's inactivity does not indicate a shift in its strategy."}, {"id": "ae86d5a3-5ec4-4ca6-9141-83d908ce4583", "title": "Rocket Lab Inks Its Biggest Satellite Launch Contract Ever", "date": "2024-06-17 15:15", "url": "https://www.fool.com/investing/2024/06/17/rocket-lab-inks-biggest-satellite-launch-contract/?source=iedfolrf0000001", "domain": "fool.com", "domain_classification": "Unknown", "message": "Abracadabra, Rocket Lab just made back $50 million of the $80 million it spent to buy SolAero, courtesy of U.S. taxpayers -- and even that wasn't the biggest news for Rocket Lab this month.\nIts largest satellite launch contract everOn June 7, Rocket Lab announced it had won a contract to launch five rockets for French Internet of Things (IoT) company Kineis.\nSo by the time this contract is complete, Rocket Lab will have put a constellation of 25 Kineis satellites into orbit -- the biggest such constellation of satellites Rocket Lab has ever been hired to launch.\nFor Rocket Lab, it will also mark the company's 50th Electron rocket launch since the company began operations in 2017.\nTime for a stroll down memory lane 🧵 pic.twitter.com/KXPiplqlTt -- Rocket Lab (@RocketLab) June 12, 2024More satellites, more rocketsThe Kineis contract earns Rocket Lab some nice bragging rights."}, {"id": "bd907436-ab1d-4143-8bb1-5b14934357d3", "title": "Sheriff plans to give update in Michigan mass shooting as investigators search for motive", "date": "2024-06-17 17:15", "url": "https://www.yahoo.com/news/sheriff-plans-michigan-mass-shooting-165014531.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The child's 4-year-old brother was shot in the leg, and the boys’ mother was hit in the abdomen and leg during the random attack in Rochester Hills.\nThe shooting was one of at least four mass shootings in the U.S. on Saturday and early Sunday.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays.\nBouchard said Nash had no connections to the splash pad or any victims.\nRochester Hills is about 15 miles (24 kilometers) south of Oxford, where in 2021 a 15-year-old fatally shot four high school students."}, {"id": "e65b36d1-7b98-4f32-b762-1f4d36dd1daf", "title": "Moment pair of motorcycle muggers try to rob woman on street in Argentina before getting instant karma", "date": "2024-06-17 17:15", "url": "https://www.dailymail.co.uk/news/article-13539059/moterbike-muggers-try-rob-woman-street-Argentina.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Video footage captured the shocking moment two motorcycle muggers attempt to rob a woman on the streets of Argentina, only to face quick karma.\nThe brave policewoman, dressed in plainclothes, thwarted the attack by opening fire on the assailants in Buenos Aires.\nFrom the ground, the policewoman swiftly turned her aim towards the other criminal still on the motorcycle.\nThe thieves were arrested when they sought treatment at the hospital for gunshot wounds.\nMoments after the incident, a young man matching the description of one of the attackers arrived at Iriarte Hospital."}, {"id": "81d251d2-ab7b-4ccc-8339-960f050f3739", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims", "date": "2024-06-17 11:00", "url": "https://www.yahoo.com/news/emhoff-speak-groundbreaking-memorial-pittsburgh-103132255.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victimsFILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\n(AP Photo/Jacquelyn Martin, File)WASHINGTON (AP) — Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nJosh Shapiro and CNN's Wolf Blitzer, who will serve as the ceremony's host."}, {"id": "8c358e93-693b-42de-b3ca-e4e95d8f3745", "title": "Indian man extradited to US in connection with alleged plot to assassinate Sikh separatist", "date": "2024-06-17 16:30", "url": "https://www.yahoo.com/news/indian-man-extradited-us-connection-151200516.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Indian man extradited to US in connection with alleged plot to assassinate Sikh separatistAn Indian national has been extradited to the United States to face charges he directed a plot to kill a critic of the Indian government in New York City.\nNikhil Gupta is accused of paying a hit man to assassinate Gurpatwant Singh Pannun, a leader of Sikhs for Justice, who has been advocating for the creation of a sovereign Sikh state.\nA task force led by the Drug Enforcement Administration discovered the alleged plot to kill Pannun after a different Sikh separatist was killed in Canada, sources familiar with the case told ABC News.\nMORE: International assassination plot against Sikh separatist in New York foiled: IndictmentNijjar was killed on June 18 near a Sikh cultural center in Surrey, British Columbia, according to The Associated Press.\nIndian man extradited to US in connection with alleged plot to assassinate Sikh separatist originally appeared on abcnews.go.com"}, {"id": "3b22b42d-0001-4350-99ee-1da6bf9ca76f", "title": "North Korea launches suspected ballistic missile that can reach distant US bases", "date": "2024-06-17 15:30", "url": "http://www.myanmarmuslim.net/news/20240617105e599838.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "North Korea fired a suspected intermediate-range ballistic missile towards the sea on Sunday, South Korea’s military said – its first launch this year.\nNorth Korea has a growing arsenal of solid-fuel short-range missiles targeting South Korea, but its existing intermediate-range missiles, including the Hwasong-12, are powered by liquid-fuel engines.\nThe last time North Korea carried out a public missile launch was on December 18, when it test-fired its Hwasong-18 solid-fuelled intercontinental ballistic missile, the North’s most advanced weapon.\nOn January 5, North Korea fired a barrage of artillery shells near the disputed western sea boundary with South Korea, prompting South Korea to carry out similar firing exercises in the same area.\nSouth Korea accused North Korea of continuing similar artillery barrages in the area for the next two days."}, {"id": "1120a51c-8a36-4e32-9d08-6f748d240b86", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.smh.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "40572d29-98a5-430e-8dd2-acb4697998d0", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.theage.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "f64228f0-1b88-44cb-8aac-8dfe4cc07ef4", "title": "2 of 9 people wounded in Michigan mass shooting at splash pad remain hospitalized , sheriff says", "date": "2024-06-17 19:15", "url": "https://www.news-gazette.com/news/nation-world/2-of-9-people-wounded-in-michigan-mass-shooting-at-splash-pad-remain-hospitalized-sheriff/article_54996a04-f6f3-5c6c-b18f-25cf1787ccba.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Champaign, IL (61820)TodayPartly cloudy.\nA stray shower or thunderstorm is possible.\nWinds SSW at 15 to 25 mph..TonightA few isolated thunderstorms developing overnight.\nWinds S at 10 to 20 mph.\nChance of rain 40%."}, {"id": "e9bab9fa-198f-4b26-8e74-cbb47dde6b28", "title": "US envoy travels to Israel in bid to calm situation with Hezbollah", "date": "2024-06-17 17:15", "url": "https://www.stripes.com/theaters/middle_east/2024-06-17/us-envoy-israel-hezbollah-14210204.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "U.S. special envoy Amos Hochstein meets with Lebanon’s caretaker prime minister in Beirut on Jan. 11, 2024.\nHochstein has again traveled to the Middle East in a bid to ease tensions between Israel and Hezbollah, which are threatening to spiral into a full-blown war across the Lebanese border.\nThe U.S. and France are leading efforts to broker a deal to ensure Hezbollah and Israel don’t go to war.\nThe prime minister will continue to consult with a small number of participants, Ynet reported, without saying where it got the information or who they would be.\nHochstein led negotiations between Israel and Lebanon in 2022 and resolved a maritime dispute, in what was a rare diplomatic success."}, {"id": "03ff75aa-5a90-4bbf-97f4-9e79dc24d11d", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:00", "url": "https://www.watoday.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "89e79682-a6b9-4167-a1fd-128e9f7e643c", "title": "How Many Fighter Jets Does Israel Have , And What Kinds Are They ? ", "date": "2024-06-17 17:00", "url": "https://www.slashgear.com/1596329/how-many-fighter-jets-israel-what-kind/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "How Many Fighter Jets Does Israel Have, And What Kinds Are They?\nWhile it had several aircraft at the time, the modern IAF boasts a massive fleet of diverse combat aviation vehicles, including numerous fighters.\nSome of the more modern aircraft operated by the IAF include the F-14 Eagle, F-16 Fighting Falcon, and the U.S.-made F-35 Lightning II.\nThose three are only a drop in the bucket of the IAF's fighter jets, which make up 43.2% of its total active aircraft.\nThese are the main fighter jets the IAF has in service, though more are on the way."}, {"id": "ef5f177e-7104-444f-8205-3f10a6fd9086", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.brisbanetimes.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "f9f5c896-82d4-4ce1-9e0f-803ec8febd2b", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 13:45", "url": "https://www.clickorlando.com/news/world/2024/06/17/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited-to-the-us/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "U.S. officials became aware in the spring of a plot to kill Gurpatwant Singh Pannun, an American citizen who advocates for the creation of a sovereign Sikh state.\nUnder the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\n(U.S. Attorney's Office via AP, file)PRAGUE – An Indian national extradited to the United States pleaded not guilty on Monday to charges arising from an alleged failed plot to assassinate a Sikh separatist leader in New York.\nIn November, U.S. prosecutors announced that a plot to kill Gurpatwant Singh Pannun, a prominent Sikh separatist leader living in New York City, had been thwarted in June of last year after a sting operation led by the Drug Enforcement Administration.\nPannun advocates for the creation of a sovereign Sikh state and is considered a terrorist by the Indian government."}, {"id": "d13f40cb-5037-4034-a358-80a47f13ac02", "title": "US Army New Hypersonic Weapon Is Still Months Away , GAO Says", "date": "2024-06-17 16:45", "url": "https://www.bnnbloomberg.ca/us-army-s-new-hypersonic-weapon-is-still-months-away-gao-says-1.2086099", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "US Army’s New Hypersonic Weapon Is Still Months Away, GAO Says(Bloomberg) -- The US military is unlikely to deliver its first hypersonic weapons in enough quantities to be combat-ready until the fiscal year that begins Oct. 1, a congressional audit found, adding to the delay in deploying the next-generation missiles already fielded by China and Russia.\n“The Army missed its goal of fielding its first Long-Range Hypersonic Weapon battery — including missiles — by fiscal year 2023 due to integration challenges,” the GAO said.\nIt has a reported range of 1,725 miles (2,780 kilometers) and consists of a ground-launched missile equipped with a hypersonic glide body and related equipment.\nMore broadly, the report found the Defense Department isn’t able to deploy new weapons systems quickly enough.\n“While the Department of Defense plans to invest more than $2 trillion to develop and acquire its costliest weapon programs, it continues to struggle with delivering innovative technologies quickly,” the GAO said."}, {"id": "ed9fe0d3-2ad8-402a-bb0f-2a6fb9ef2532", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 11:45", "url": "https://www.wfmz.com/news/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited/article_20d8ecd7-7483-5a1c-b03b-1f5b1399f2ec.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "In this June 2023 photo taken by an undercover agent and provided by the U.S. Attorney's office, an undercover agent posing as a hitman, left, holds money received as a partial advance payment for murder during a transaction in New York.\nU.S. officials became aware in the spring of a plot to kill Gurpatwant Singh Pannun, an American citizen who advocates for the creation of a sovereign Sikh state.\nUnder the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\nGupta, was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blažek said on Monday, June 17, 2024."}, {"id": "15873e2b-924a-4253-b8e9-0cc61b373074", "title": "Detroit - Area Shooting Leaves Nine Injured , One Critically", "date": "2024-06-17 15:15", "url": "https://bearingarms.com/tomknighton/2024/06/17/detroit-area-shooting-leaves-9-injured-one-critically-n1225290", "domain": "bearingarms.com", "domain_classification": "Unknown", "message": "After the shooting at Michigan State University last year, the state went on something of a tear, passing a number of gun control laws.\nGretchen Whitmer wanted them all along, of course, but the shooting was the perfect pretext for a number of regulations.\nYet on Saturday, there wasn't a lot of evidence of it working when a gunman opened fire at a splash pad in the Detroit suburb of Rochester Hills.\nNine people were injured, including two young children and their mother, after a shooter opened fire at a splash pad in a Detroit suburb where families gathered to escape the summer heat Saturday.\nAdvertisementThankfully, no one was killed and I hope and pray all of the injured make a full recovery, particularly the eight-year-old boy."}, {"id": "45e20019-ea20-4fa9-83b0-3ffc4a775e37", "title": "Ammunition blast at Czech army training area kills one , army says", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/breaking-news/article-806605", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An ammunition explosion at a Czech army training area killed one soldier and injured eight others as well as one civilian on Monday, the army said.\nThe explosion occurred at the Libava training area in the east of the Czech Republic, it said in a statement.\nThe explosion of unspecified ammunition occurred during an exercise being conducted by explosive disposal experts, the army said."}, {"id": "c35ce525-5eb3-4a30-9b84-d3544b6800ee", "title": "IG Koome reassures judiciary staff of safety after magistrate shooting incident", "date": "2024-06-17 14:00", "url": "https://www.the-star.co.ke/news/realtime/2024-06-17-ig-koome-reassures-judiciary-staff-of-safety-after-magistrate-shooting-incident/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "Inspector General Japhet Koome has reassured judiciary staff of their safety and security, following the shooting and subsequent death of Makadara Principal Magistrate Monicah Kivuti.\nIn a statement on Monday, Koome said providing their security remains a matter of priority for the National Police Service.\n“Following the tragic loss of the Makadara Law Courts’ Principal Magistrate, Hon.\nHe condoled with the family of the late Principal Magistrate and Judiciary, as he wished speedy recovery to two National Police Service officers who were injured during the incident.\nMonica Kivuti, Principal Magistrate, Makadara Law Courts has lost the fight against the extensive injuries sustained during an open gun attack in Court,\" CJ Koome said."}, {"id": "be68fb11-2338-4427-ad56-c1ed13d4b813", "title": "Man Stabbed To Death at Homeless Encampment in Long Beach", "date": "2024-06-17 03:45", "url": "https://mynewsla.com/crime/2024/06/16/man-stabbed-to-death-at-homeless-encampment-in-long-beach/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at a homeless encampment along the Los Angeles River in Long Beach, authorities said Sunday.\nThe suspect fled the scene before officers arrived, the Long Beach Police Department reported.\nOfficers dispatched to the area of the Los Angeles River and Long Beach Boulevard at about 8:50 a.m. Saturday found the victim suffering from a stab wound to the upper body.\n“Through their preliminary investigation, detectives determined the victim and a male adult suspect engaged in a verbal altercation, which escalated when the suspect stabbed the victim,” police said.\nLong Beach police urged anyone with information regarding the stabbing to call them at 562-570-7244."}, {"id": "31209cd2-e6b7-4fe7-b3ac-eba6ac30df7a", "title": "Man charged with causing grievous bodily harm after Leicester stabbing", "date": "2024-06-17 16:15", "url": "https://www.leicestermercury.co.uk/news/leicester-news/man-charged-causing-grievous-bodily-9348321", "domain": "leicestermercury.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nThe latest crime and court news from Leicester and LeicestershireSomething went wrong, please try again later.\nThe latest crime and court news from Leicester and LeicestershireA man has been charged with causing grievous bodily harm following a stabbing in Leicester.\nWebster appeared at Leicester Magistrates Court on Saturday June 15, the force said."}, {"id": "7e060007-fd15-4037-a356-4dee773de30d", "title": "Alaska Man Monday - Snow Machines , Russians , Booze , and Guns", "date": "2024-06-17 17:00", "url": "https://redstate.com/wardclark/2024/06/17/alaska-man-monday-snow-machines-russians-booze-and-guns-n2175566", "domain": "redstate.com", "domain_classification": "Unknown", "message": "Alaska State Troopers outshoot Mounties!\nAlaska State Troopers defended the prized trophy, winning the 60th annual Troopers vs. Royal Canadian Mounted Police shooting competition and retaining the trophy in Alaska.\nThe event is known as “The Shoot” and was held this year in Fairbanks with Alaska State Troopers competing in target competition with RCMP from across the Yukon Territory in Canada.\nIt remains the longest standing international shooting competition in the world.\nAdvertisementThere’s a lesson here for bad guys, too: Our Alaska state cops can shoot!"}, {"id": "02b592b1-ef57-4a59-889d-e803467ea9d0", "title": "Shooting in Detroit suburb injures 9 , leaving an 8 - year - old in critical condition", "date": "2024-06-17 10:30", "url": "https://www.wafb.com/2024/06/15/multiple-people-injured-shooting-splash-pad-michigan/", "domain": "wafb.com", "domain_classification": "Unknown", "message": "An 8-year-old boy was shot in the head and in critical condition Saturday night, Oakland County Sheriff Mike Bouchard said during a news conference.\nPolice in Michigan said nine people were injured in a shooting in a Detroit suburb.\nAuthorities found a handgun, three empty magazines and at least 28 spent shell casings at the splash pad.\n“In terms of the ‘why,’ I don’t know,” Bouchard said of the gunman’s motive.\n“When I got on scene I started to cry because I know what a splash pad is supposed to be."}, {"id": "9cbebbd9-302c-44ed-be22-564daa0f845b", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 14:00", "url": "https://www.wsls.com/news/world/2024/06/17/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited-to-the-us/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "U.S. officials became aware in the spring of a plot to kill Gurpatwant Singh Pannun, an American citizen who advocates for the creation of a sovereign Sikh state.\nUnder the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\n(U.S. Attorney's Office via AP, file)PRAGUE – An Indian national extradited to the United States pleaded not guilty on Monday to charges arising from an alleged failed plot to assassinate a Sikh separatist leader in New York.\nIn November, U.S. prosecutors announced that a plot to kill Gurpatwant Singh Pannun, a prominent Sikh separatist leader living in New York City, had been thwarted in June of last year after a sting operation led by the Drug Enforcement Administration.\nPannun advocates for the creation of a sovereign Sikh state and is considered a terrorist by the Indian government."}, {"id": "db670924-bd38-4346-97ee-e5655ffb5e3f", "title": "Members of public help cops track down teens after stabbing near Perth shopping centre", "date": "2024-06-17 04:00", "url": "https://www.smh.com.au/national/western-australia/members-of-public-help-cops-track-down-teens-after-alleged-stabbing-near-perth-shopping-centre-20240617-p5jmdm.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Two teenagers will face court on Monday charged over a stabbing in Karrinyup on Sunday that left two men with critical injuries.\nThe 16-year-olds, who cannot be named for legal reasons, were arrested after members of the public helped guide police to their locations.\nCredit: Nine News PerthPolice allege the boys were armed with knives when they arrived at a pre-arranged meeting with two 18-year-old men on Northgate Street.\nThey claim the boys then threatened the two men and that during an altercation, one of the 18-year-old was stabbed in the stomach.\nThe other, they allege, sustained slash wounds to his wrists and thigh."}, {"id": "f227ab25-9619-4905-ae76-6a52c9dc1d48", "title": "Teenager on terror charges after stabbings at Sydney church denied bail", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617792e599207.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A judge has denied bail to a 15-year-old boy accused of being part of a network planning terrorist acts and who claimed to be a friend of another teenager charged with stabbing a Sydney bishop.\n“The messages clearly set up the young person wanting to do something catastrophic,” Mr Viney added.\nLater, the boy’s lawyer, Mr Dib, told reporters he would apply for bail to the New South Wales state Supreme Court.\nMr Viney said he had “no doubt” the parents were both loving and supportive of their son, and had confiscated his phone after becoming concerned by his behaviour.\n“They are genuinely shocked as to the charges he’s facing,” Mr Viney said."}, {"id": "d81ed626-6ed9-4892-8185-cbc794e4e56e", "title": "Houthis Say Attacked US Destroyer , 2 Ships in Red , Arabian Seas", "date": "2024-06-17 03:45", "url": "https://sputnikglobe.com/20240617/houthis-say-attacked-us-destroyer-2-ships-in-red-arabian-seas-1118991137.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240617/houthis-say-attacked-us-destroyer-2-ships-in-red-arabian-seas-1118991137.htmlHouthis Say Attacked US Destroyer, 2 Ships in Red, Arabian SeasHouthis Say Attacked US Destroyer, 2 Ships in Red, Arabian SeasSputnik InternationalYemen's Ansar Allah rebel movement, also known as the Houthis, said that it had attacked a US destroyer and two commercial vessels in the Red and Arabian Seas.\n2024-06-17T01:18+00002024-06-17T01:18+00002024-06-17T01:18+0000worldushouthisyemenred seaarabian seared sea crisishttps://cdn1.img.sputnikglobe.com/img/07e8/02/05/1116591744_0:0:2856:1608_1920x0_80_0_0_3eddb25ae6f1b155c41dedbac28b17c6.jpg\"The missile unit and naval forces of our Yemeni armed forces carried out two military operations in the Red Sea,\" Houthi military spokesman Yahya Saree said on Sunday.\nThe spokesman said that the Houthis fired missiles at a US destroyer and the Captain Paris vessel in the Red Sea.\nThe attacks prompted the United States to form a multinational coalition to protect shipping in the area, as well as to strike Houthi targets on the ground.\nhttps://sputnikglobe.com/20240607/houthis-vow-to-continue-targeting-us-carrier-group-after-unveiling-new-hypersonic-missile-1118852457.htmlyemenred seaarabian seaSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Sputnik Internationalyemeni ansar allah, houthis, new houthis attack pn the us destroyer, us destroyer attack by houthi, houthi attacks"}, {"id": "64e47db9-eace-490a-88a1-bd4f2536c6d9", "title": "Five dead as US and Britain strike back against Iranian", "date": "2024-06-17 16:15", "url": "http://www.myanmarmuslim.net/news/20240618180f599763.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US President Joe Biden said the strikes were meant to demonstrate that America and its allies “will not tolerate” the militant group’s ceaseless attacks on the Red Sea.\nOn Thursday evening, @RoyalAirForce Typhoons successfully conducted precision strikes against Houthi military targets in Yemen.\nThis action was taken jointly with the US in response to repeated Houthi attacks on ships in the Red Sea.\nMore than 20 nations are already participating in a US-led maritime mission to increase ship protection in the Red Sea.\nTransit through the Red Sea, from the Suez Canal to the Bab el-Mandeb Strait, is a crucial shipping lane for global commerce."}, {"id": "6847a7fc-c88c-46fd-9589-6a2e4b0dbff5", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims", "date": "2024-06-17 14:00", "url": "https://www.wsls.com/news/politics/2024/06/17/emhoff-will-speak-at-groundbreaking-of-the-memorial-for-the-pittsburgh-synagogue-shooting-victims/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "FILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\n(AP Photo/Jacquelyn Martin, File)WASHINGTON – Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nJosh Shapiro and CNN's Wolf Blitzer, who will serve as the ceremony's host."}, {"id": "caa40e45-6596-41fb-ae66-32b3b364a77e", "title": "Murder suspect remains in hospital after boy , 14 , killed in sword rampage", "date": "2024-06-17 16:15", "url": "http://www.myanmarmuslim.net/news/2024061850a599948.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A murder suspect remains in hospital after a 14-year-old boy was killed and four others were injured in a stabbing in east London.\nA 36-year-old man was tasered and arrested in Hainault on Tuesday morning, then taken to hospital, after sustaining injuries when his van hit a house.\nThe sword-wielding suspect was tasered and arrested at the scene but has not yet been interviewed because of his injuries, the Met said.\nDramatic footage obtained by the PA news agency captured the suspect being cornered and tasered by officers on a residential driveway.\nThe video shows how officers shout at the suspect, saying “Don’t move, don’t f"}, {"id": "18b9c461-70de-4062-8798-31ccc00e1ce3", "title": "Karrinyup stabbing : Ex - Western Force flanker Brynard Stander chased accused teens", "date": "2024-06-17 16:15", "url": "https://www.perthnow.com.au/news/crime/karrinyup-stabbing-ex-western-force-flanker-brynard-stander-chased-accused-teens-c-15052944", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "Former Western Force rugby player Brynard Stander fearlessly chased after two teens who allegedly stabbed and robbed two men.\nThe two teenagers have since been charged over the stabbing attack in Karrinyup, which left the two men with critical injuries.\nCamera Icon Former Western Force rugby player Brynard Stander (left) fearlessly chased after two teens who allegedly stabbed and robbed two men.\nCamera Icon The Scene on Francis St in Karrinyup this afternoon where two people are believed to have suffered stab wounds.\nThe two 16-year-old boys, one from Doubleview and the other from Karrinyup are due to appear before the Perth Children’s Court on Monday."}, {"id": "53f56eda-f34f-467e-b90b-aaf88d792fca", "title": "Global defence groups hiring at fastest rate in decades amid record orders", "date": "2024-06-17 01:15", "url": "https://www.nzherald.co.nz/business/global-defence-groups-hiring-at-fastest-rate-in-decades-amid-record-orders/KJTQ2A446NGJPHYUNKDVDLK3JE/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Photo / Sebastian Christoph Gollnow, dpa via APGlobal defence companies are recruiting workers at the fastest rate since the end of the Cold War as the industry seeks to deliver on order books that are near record highs.\n“Since the end of the cold war, this is the most intense period for the defence sector with the highest increase in order volume in a rather short period of time,” said Jan Pie, secretary-general of ASD, the European aerospace and defence trade association.\nGovernments around the world have ramped up military spending since Russia’s full-scale invasion of Ukraine and amid widespread geopolitical tensions.\nA man cleans his car in the city centre after a Russian missile attack in Kharkiv, Ukraine, on May, 25.\nThe hiring and training effort is “unprecedented in recent times”, said Beccy Pleasant at the Nuclear Skills Delivery Group, which forecasts that more than 30,000 additional roles will be needed in the nuclear defence sector between now and 2030."}, {"id": "5d0970f8-07fa-426a-b64d-51aa7d71e235", "title": "IDF announces pause to daytime fighting along southern Gaza humanitarian corridor", "date": "2024-06-17 06:45", "url": "https://www.yahoo.com/news/idf-announces-pause-daytime-fighting-050623159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military on Sunday announced that there will be a daily daytime pause of fighting along a humanitarian corridor in southern Gaza.\nFile Photo by Hatem Al-Rawag/UPIJune 17 (UPI) -- The Israeli military will pause fighting during the day along an important humanitarian corridor in southern Gaza to facilitate aid efforts, the Israel Defense Forces said Sunday as it also warned Hezbollah against further attacking the Middle Eastern Country.\n\"We hope this leads to further concrete measures by Israel to address longstanding issues preventing a meaningful humanitarian response in Gaza,\" Laerke said.\nThe IDF was quick to add in a Hebrew-language statement published to its X account that the pause was not a cessation in southern Gaza fighting.\nIsrael has been waging war against Iran-backed Hamas in Gaza since the militia attack Israel on Oct. 7."}, {"id": "35166f0b-c0e1-4619-9256-78c88a929226", "title": "Police identify Michigan splash pad shooter but there still no word on a motive", "date": "2024-06-17 16:15", "url": "https://www.boston.com/news/crime/2024/06/17/police-identify-michigan-splash-pad-shooter-no-word-on-motive/", "domain": "boston.com", "domain_classification": "Unknown", "message": "Crime Police identify Michigan splash pad shooter but there’s still no word on a motive The Michigan splash pad shooting was one of at least four mass shootings that took place around the country Saturday night and early Sunday morning.\nAdvertisement:The splash pad shooting was one of at least four mass shootings that took place around the country Saturday night and early Sunday morning.\nAuthorities said Nash drove to suburban Rochester Hills on Saturday and opened fire at a splash pad in a city park around 5 p.m. A splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays.\n“He was very quiet and didn’t want to be a part of our community.”Bouchard said that Nash had no connections to the splash pad or any of the victims.\n“When I got on scene I started to cry because I know what a splash pad is supposed to be."}, {"id": "6d1a4fa0-b2ce-423c-907e-a7c06b0c7772", "title": "Explosion Rocks Firing Ground In Czech Republic Where Ukrainian Armed Forces Trained", "date": "2024-06-17 17:00", "url": "https://charter97.org/en/news/2024/6/17/599290/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Explosion Rocks Firing Ground In Czech Republic Where Ukrainian Armed Forces Trained 4 17.06.2024, 14:225,978An unidentified munition exploded.\nAn explosion occurred at the Libava military training ground in the east of the country in the Czech Republic.\nThe Czech army reported on social media that an unidentified munition exploded.\nThe Libava military training ground is located near the city of Olomouc, about 250 kilometers east of Prague.\nAs reported by Czech Radio, Ukrainian military personnel were undergoing marksmanship, medical, and tactical training at the training ground."}, {"id": "89d89a58-0358-465c-8272-208af91197ed", "title": "Indian man extradited to US over alleged plot to assassinate Sikh separatist", "date": "2024-06-17 18:30", "url": "https://abc11.com/indian-man-extradited-to-us-over-alleged-plot-to-assassinate-sikh-s/14965126/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Indian man extradited to US over alleged plot to assassinate Sikh separatistAn Indian national has been extradited to the United States to face charges he directed a plot to kill a critic of the Indian government in New York City.\nNikhil Gupta is accused of paying a hit man to assassinate Gurpatwant Singh Pannun, a leader of Sikhs for Justice, who has been advocating for the creation of a sovereign Sikh state.\nA task force led by the Drug Enforcement Administration discovered the alleged plot to kill Pannun after a different Sikh separatist was killed in Canada, sources familiar with the case told ABC News.\nThe killing of Hardeep Singh Nijjar prompted Canadian Prime Minister Justin Trudeau to accuse New Delhi in what became an international incident.\nNijjar was killed on June 18 near a Sikh cultural center in Surrey, British Columbia, according to The Associated Press."}, {"id": "4b54e293-8692-4f2c-beab-35838ca34978", "title": "Syrsky : Russians Are In A Hurry", "date": "2024-06-17 12:15", "url": "https://charter97.org/en/news/2024/6/17/599270/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Syrsky: Russians Are In A Hurry 6 17.06.2024, 12:278,572OLEKSANDR SYRSKYThe Commander-in-Chief of the Armed Forces of Ukraine believes that time will soon be on Ukraine's side.\nRussian occupiers continue to attack the positions of the Defense Forces in the Kupyansk, Pokrovsk, Kurakhove, and Vremevsky Ledge directions,said the Commander-in-Chief of the Armed Forces of Ukraine, Oleksandr Syrsky.\n“The enemy is concentrating its main efforts in the Pokrovsk direction, where the overwhelming majority of its strike brigades and regiments are concentrated.\nFierce fighting continues in the areas of Hlyboka, Chasiv Yar, Staromayorske, Robotyne, Krynky and the islands in the coastal part of the left bank of the Dnipro,” Syrsky said.\n“Therefore, the command of the Russian troops is now making every effort to increase the intensity and expand the geography of military operations in order to exhaust our troops as much as possible, disrupt the preparation of reserves, and prevent a transition to active offensive actions,” Syrsky added."}, {"id": "bc5b8753-6a86-48d0-8296-3db3d9d9a40f", "title": "Indian man extradited to US over alleged plot to assassinate Sikh separatist", "date": "2024-06-17 17:15", "url": "https://abc7chicago.com/indian-man-extradited-to-us-over-alleged-plot-to-assassinate-sikh-s/14965126/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "Indian man extradited to US over alleged plot to assassinate Sikh separatistAn Indian national has been extradited to the United States to face charges he directed a plot to kill a critic of the Indian government in New York City.\nNikhil Gupta is accused of paying a hit man to assassinate Gurpatwant Singh Pannun, a leader of Sikhs for Justice, who has been advocating for the creation of a sovereign Sikh state.\nA task force led by the Drug Enforcement Administration discovered the alleged plot to kill Pannun after a different Sikh separatist was killed in Canada, sources familiar with the case told ABC News.\nThe killing of Hardeep Singh Nijjar prompted Canadian Prime Minister Justin Trudeau to accuse New Delhi in what became an international incident.\nNijjar was killed on June 18 near a Sikh cultural center in Surrey, British Columbia, according to The Associated Press."}, {"id": "0f4c3623-9498-48bb-8fa8-0d7209dbcbf0", "title": "Hamas surprise attack out of Gaza stuns Israel and leaves hundreds dead", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617027f599918.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "At least 198 people in the Gaza Strip have been killed and at least 1,610 wounded in Israeli strikes, the Palestinian health ministry said.\nHamas fighters took an unknown number of civilians and soldiers captive into Gaza, a deeply sensitive issue for Israel.\npic.twitter.com/USndH8HXNA — Prime Minister of Israel (@IsraeliPM) October 7, 2023Throughout the day, Hamas fired more than 3,500 rockets, the Israeli military said.\nPolitical commentators lambasted the government over its failure to anticipate what appeared to be a Hamas attack unseen in its level of planning and coordination.\nHamas’ military wing claimed it was holding dozens of Israeli soldiers captive in “safe places” and tunnels in the Gaza Strip."}, {"id": "9c92bd92-62e7-4f72-b3ff-3f70164b6d35", "title": "  My house turned into an emergency room  ", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/mdaheroes/article-799383", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Omer Caspi, an MDA employee in the Lachish region, lives in Kibbutz Kfar Aza, which came under heavy attack that Saturday.\nThe family hid in the safe room; the father held firmly onto the door handle.\nI treated him, and from that moment, my house turned into an emergency room.”Omer Caspi, MDA employee in the Lachish region (Credit: MDA)The MDA motorcycle which Omer had used as an emergency response medic was damaged by terrorists.\nOmer recalls how a squad from a military special forces unit brought their commander, who had been shot and was critically injured, to his house.\nOf course, I treated them.”The family friend whom he had treated in his living room survived and is currently rehabilitating."}, {"id": "349b2afc-88f4-4479-8575-d9563bd41cd7", "title": "Indian man extradited to US over alleged plot to assassinate Sikh separatist", "date": "2024-06-17 18:30", "url": "https://abc7ny.com/indian-man-extradited-to-us-over-alleged-plot-to-assassinate-sikh-s/14965126/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Indian man extradited to US over alleged plot to assassinate Sikh separatistAn Indian national has been extradited to the United States to face charges he directed a plot to kill a critic of the Indian government in New York City.\nNikhil Gupta is accused of paying a hit man to assassinate Gurpatwant Singh Pannun, a leader of Sikhs for Justice, who has been advocating for the creation of a sovereign Sikh state.\nA task force led by the Drug Enforcement Administration discovered the alleged plot to kill Pannun after a different Sikh separatist was killed in Canada, sources familiar with the case told ABC News.\nThe killing of Hardeep Singh Nijjar prompted Canadian Prime Minister Justin Trudeau to accuse New Delhi in what became an international incident.\nNijjar was killed on June 18 near a Sikh cultural center in Surrey, British Columbia, according to The Associated Press."}, {"id": "1365431f-1dc4-4345-89d8-118b01009514", "title": "From The Past Pages Of Dawn : 1974 : Fifty Years Ago : N - blast fallout - Newspaper", "date": "2024-06-17 03:30", "url": "https://www.dawn.com/news/1840430/from-the-past-pages-of-dawn-1974-fifty-years-ago-n-blast-fallout", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "Samples of airborne dust, soil, water and vegetation were collected and tested for radioactivity.\nFurther analysis of the fall-out is in progress.\nIndia had earlier claimed that the nuclear explosion was “clean” and that there was “no radioactive fall-out” ...[Meanwhile, as reported by news agencies from Damascus,] Syria and the United States ... resumed full diplomatic relations after a seven-year break.\nBefore leaving Damascus, Mr Nixon said he had invited President Assad to visit the United States ... and the Syrian leader had accepted the invitation.\nPublished in Dawn, June 17th, 2024"}, {"id": "7e9d1cf3-44db-4ba1-99c6-82ada84e225d", "title": "Somalia : Explosion Claims Lives of Somali Army Commander and Soldiers in Southwest State", "date": "2024-06-17 12:45", "url": "https://allafrica.com/stories/202406170181.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Baidoa, Somalia — A tragic incident unfolded in the border regions of Bay and Bakool in southern Somalia, as a devastating explosion claimed the lives of the commander of the 8th battalion of the 60th CXDS division and several other soldiers.\nThe explosion took place while the officers and soldiers were responding to a call for support from government forces engaged in operations in the area.\nThe incident occurred near the border between the two regions, highlighting the ongoing security challenges faced by Somali forces in this volatile area.\nThis incident comes amidst ongoing efforts by the Somali government to strengthen security in the country and combat the presence of insurgent groups.\nThe loss of a high-ranking military officer and other soldiers is a significant blow to the Somali National Army and underscores the challenges faced in maintaining stability and security in the region."}, {"id": "c869ab40-6ebb-4496-9ebf-2c8d797518a7", "title": "Rare Ukrainian Smart Bomb Strikes Pound , Cut Off Russian Troops", "date": "2024-06-17 17:00", "url": "https://www.kyivpost.com/post/34425", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Image published by the analytical team Tom Cooper and Donald Hill on June 17, showing probable fighting line locations, recent battlefield events and encircled Russian troops in the north Ukrainian town of Vovchansk.\nBoth official Ukrainian and Russian sources have confirmed heavy fighting and Ukrainian air strikes, but neither have acknowledged Russian troops are cut off.\nAccording to multiple Ukrainian open-source information platforms between 30 and 400 Russian troops may be encircled in the Vovchansk Aggregate Factory.\nA few sources said the weapon was a JDAMS, an older technology “bomb kit” developed by the US to convert an unguided bomb into a guided bomb.\nAccording to open-source reports, some Russian soldiers holding positions on the premises of the Vovchansk Aggregate Factory are effectively cut off and possibly surrounded."}, {"id": "a8621575-5ba1-48df-bbe6-02dd8f425fe3", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims", "date": "2024-06-17 12:00", "url": "https://www.wsbradio.com/news/politics/emhoff-will-speak/PA3ZKORD4YOLRV3JNJSLHL74AQ/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "204eb791-55b1-42c9-9bba-fe8a0c14808d", "title": "Indian man extradited to US over alleged plot to assassinate Sikh separatist", "date": "2024-06-17 17:15", "url": "https://abc30.com/indian-man-extradited-to-us-over-alleged-plot-to-assassinate-sikh-s/14965126/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Indian man extradited to US over alleged plot to assassinate Sikh separatistAn Indian national has been extradited to the United States to face charges he directed a plot to kill a critic of the Indian government in New York City.\nNikhil Gupta is accused of paying a hit man to assassinate Gurpatwant Singh Pannun, a leader of Sikhs for Justice, who has been advocating for the creation of a sovereign Sikh state.\nA task force led by the Drug Enforcement Administration discovered the alleged plot to kill Pannun after a different Sikh separatist was killed in Canada, sources familiar with the case told ABC News.\nThe killing of Hardeep Singh Nijjar prompted Canadian Prime Minister Justin Trudeau to accuse New Delhi in what became an international incident.\nNijjar was killed on June 18 near a Sikh cultural center in Surrey, British Columbia, according to The Associated Press."}, {"id": "6bd5e0b6-a9db-4891-860b-aa5e34329278", "title": "ALBA - TCP expresses solidarity with Colombian vice - president", "date": "2024-06-17 19:00", "url": "https://www.plenglish.com/news/2024/06/17/alba-tcp-expresses-solidarity-with-colombian-vice-president/", "domain": "plenglish.com", "domain_classification": "Unknown", "message": "The head of the Latin American and Caribbean regional integration bloc, Jorge Arreaza, referred on X to the assassination attempt on the father of the Colombian vice-president and one of her nephews in the Cauca region.\nFortunately, there were no casualties,’ he said.\nHe reaffirmed that ALBA-TCP peoples and governments ‘have always advocated for comprehensive peace and the cessation of political violence in Colombia’.\nIn a message sent on Sunday, the vice-president said that ‘it hurts my heart that on this very day, an attack has been made against my father’.\nMarquez expressed her concern for security in Cauca, Valle del Cauca, in the municipality of Suárez and the village of La Toma, as well as for the ‘safety of my community and my family’."}, {"id": "5631b9f2-44ff-4085-a501-f3993313ecb5", "title": "HDP worker Deniz Poyraz remembered 3 years after killing by ultranationalist assailant", "date": "2024-06-17 19:00", "url": "https://bianet.org/haber/hdp-worker-deniz-poyraz-remembered-3-years-after-killing-by-ultranationalist-assailant-296586", "domain": "bianet.org", "domain_classification": "Unknown", "message": "On June 17, 2021, Deniz Poyraz, a staff member of the pro-Kurdish Peoples' Democratic Party (HDP), was killed in an armed attack on the party's İzmir office.\nDeniz Poyraz murder case: Assailant sentenced to aggravated life imprisonmentThroughout the proceedings, tensions ran high, with significant security measures at the İzmir 6th Heavy Penal Court and restricted access for lawyers and spectators.\nLawyer: 'They will close Deniz Poyraz case without solving the murder'Deniz's mother, Fehime Poyraz, shared her grief: \"They brutally murdered you.\nAs long as we live, Deniz will live in our hearts.\"\nThe memorial concluded with a gesture as carnations were thrown into the sea at Konak Pier in memory of Deniz Poyraz."}, {"id": "d4512823-3740-4b69-8df3-8a3ac9c0b5e2", "title": "Girl , 9 , among thousands of critical patients stuck in Gaza", "date": "2024-06-17 17:15", "url": "https://muslimnews.co.uk/news/palestine/girl-9-among-thousands-of-critical-patients-stuck-in-gaza/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "It was a glimmer of familial normality in Gaza for a nine-year-old and her younger sibling that ended in tragedy.\nHanan is one of thousands of critically ill patients waiting for medical evacuation from Gaza but unable to leave following the closure of the Rafah crossing to Egypt in early May.\nTens of thousands of injured Palestinians and a severe lack of medicine, doctors, and electricity, have proved a lethal combination.\nThe only hope for many is to be evacuated through the Rafah crossing into Egypt and get treatment in neighboring countries.\nsbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv sbv"}, {"id": "72fe1abc-1c29-4228-8d2e-cda5981ce0a2", "title": "Troops Rescue 34 Women , Children From ISWAP Captivity In Borno", "date": "2024-06-17 16:45", "url": "https://saharareporters.com/2024/06/17/troops-rescue-34-women-children-iswap-captivity-borno", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "Troops from Operation Lake Sanity 2, under Task Force Wulgo, have neutralised one terrorist and rescued 34 women and children from a Boko Haram camp in villages of Mazuri, Itsari, Mudu, and Maleri on the outskirts of southern Lake Chad in Nigeria.\nAbdullahi identified the ISWAP fighters as, Babakura Abubakar (20 years old), Abacha Kyari (28 years old), and Mohammad Adam (29 years old), who were currently undergoing interrogation for further action.\n“Moreover, in our continued air assault operations aimed at dismantling terrorist operations across the Lake Chad area, an air interdiction mission was conducted on 9 June 2024 at Kollaram.\nThis precise strike exemplifies the efficacy and capabilities of Troops Contributing Countries air force units in neutralising high-value terrorist targets and mitigating potential threats.\n“The combined efforts of ground and air operations are significantly degrading the operational strength and morale of terrorist factions in the region.\""}, {"id": "ce7fa7a5-8bad-48ab-9de6-8b25de358b56", "title": "Estonia batter Sahil Chauhan smashes quickest T20I ton off 27 balls , breaks Loftie Eaton record", "date": "2024-06-17 17:15", "url": "https://www.prokerala.com/news/articles/a1540185.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "New Delhi, June 17 : Estonia batter Sahil Chauhan on Monday produced an outrageous knock against Cyprus, as he smashed the fastest-ever T20I century off just 27 balls.\nIn the process, Chauhan broke the record previously held by Namibia's Jan-Nicol Loftie Eaton, who got to the three-figure mark off just 33 balls in February this year.\nNew Delhi, June 17 (IANS) Estonia batter Sahil Chauhan on Monday produced an outrageous knock against Cyprus, as he smashed the fastest-ever T20I century off just 27 balls.\nIn the process, Chauhan broke the record previously held by Namibiaâ€™s Jan-Nicol Loftie Eaton, who got to the three-figure mark off just 33 balls in February this year.\nHe brought up his century off just 27 balls, bettering the previous record held by Loftie Eaton."}, {"id": "54dfa98a-4a9a-4fac-86b8-2b6d7b8e7973", "title": "Salman Khan death threat : Court remands Rajasthan YouTuber to police custody till June 18 | Hindi Movie News", "date": "2024-06-17 03:00", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-death-threat-court-remands-rajasthan-youtuber-to-police-custody-till-june-18/articleshow/111047575.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Salman Khan's Safety at Risk?\nKhan Clan's Reaction to Death ThreatsSalman Khan narrates details of night gunmen shot at his Bandra residence: 'Slept late, woke up to gunshots...'The Mumbai Police have registered a new case related to the firing incident outside actor Salman Khan 's residence in April and have arrested a 25-year-old man from Rajasthan on charges of criminal intimidation.\nSix individuals were arrested in connection with that case, one of whom, Anuj Thapan, reportedly hanged himself in police custody on May 1.In a separate investigation, Navi Mumbai Police arrested five individuals, including a suspected member of the Bishnoi and Goldy Brar gangs from Haryana, for plotting to attack Salman Khan.\nFour gang members had surveyed Khan's farmhouse in Panvel, his Bandra home, and various film shooting locations.Lawrence Bishnoi, currently imprisoned at the Sabarmati Central Prison in Ahmedabad, Gujarat, in a different case, will be sought for custody by Mumbai police.\nHis brother Anmol, believed to be in Canada, has been listed as a wanted accused in the firing incident."}, {"id": "c1c63aac-0ffd-402b-b687-8bd2d83b5605", "title": "Georgia inmate fatally shoots kitchen worker before turning gun on himself : Officials", "date": "2024-06-17 03:45", "url": "https://gazette.com/news/wex/georgia-inmate-fatally-shoots-kitchen-worker-before-turning-gun-on-himself-officials/article_5c152a8c-a2c5-513d-8e76-d0392b8a8913.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "An inmate in a Georgia prison shot and killed a food service worker on Sunday before shooting and killing himself, authorities said.\nJaydrekus Hart, 34, was serving a 20-year sentence at Smith State Prison for voluntary manslaughter and aggravated battery.\nAfter Hart reportedly shot Aureon Shavea Grace, 24, he turned the weapon on himself and was subsequently pronounced dead.\nLast year, Smith State Prison reported another employee death in correctional officer Robert Clark, 42.\nInmate Layton Lester reportedly attacked Clark from behind with a homemade weapon while wounding another inmate."}, {"id": "efd81944-7390-4d15-b765-6b7ffcd2fb02", "title": "All Eyes On Taiwan – Could A Chinese Attack On Taiwan Still Be A Surprise ? Drawing Lessons From The 1973 Egyptian - Syrian Attack On Israel And The 1941 Japanese Attack On Pearl Harbor", "date": "2024-06-17 14:00", "url": "https://www.memri.org/reports/all-eyes-taiwan-%E2%80%93-could-chinese-attack-taiwan-still-be-surprise-drawing-lessons-1973", "domain": "memri.org", "domain_classification": "Unknown", "message": "China has been openly carrying out military drills simulating an invasion of Taiwan.\nIn light of these consistent threats, provocations, and preparations, could a Chinese surprise attack still be possible?\nMeanwhile, Syria also carried out military drills in preparation for the joint invasion of Israel.\nThe Israelis assumed that the goal of an Egyptian invasion would be to reoccupy the entire Sinai Peninsula.\nA surprise attack is possible even when there are clear indications that an attack is imminent."}, {"id": "5505868a-800d-45d6-961c-412f8aebe7b6", "title": "China New Robo - Dog Soldier : More Bark Than Bite ? ", "date": "2024-06-17 19:00", "url": "https://www.cheddar.com/media/chinas-new-robo-dog-soldier-more-bark-than-bite/", "domain": "cheddar.com", "domain_classification": "Unknown", "message": "In an interview with a local state broadcaster, a Chinese soldier reportedly stated that the robot dog can help urban combat operations, making reconnaissance easier.\nAnd CNN is quick to point out that military dogs — particularly robot dogs — aren’t new, either.\nFor example, the U.S. Army has considered arming its remote-controlled robot dogs with high-tech rifles.\nFor the more popular name in robotics, Boston Dynamics, attaching a gun to a robot dog is a no-no.\nHowever, one thing is clear: the world’s largest militaries are exploring the possibilities of robot technology."}, {"id": "415d10ac-5e89-48b2-9d4a-f9a7cfe7d84b", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/taiwan-not-seeking-war-china-031055911.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Incoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiIncoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiTAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "bafcd6f6-346f-4bd6-a573-e9efb3572c6d", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://gazette.com/news/us-world/taiwan-is-not-seeking-war-with-china-defence-minister-says/article_362df78a-b32b-5b8f-94c0-a418a30a68a5.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "TAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "4dc7f3e9-bffb-4e1b-a750-99641c1f409d", "title": "If MGCS drags out , Rheinmetall pitches Concept Unmanned Turret as near - term alternative", "date": "2024-06-17 18:45", "url": "https://breakingdefense.com/2024/06/if-mgcs-drags-out-rheinmetall-pitches-concept-unmanned-turret-as-near-term-alternative/", "domain": "breakingdefense.com", "domain_classification": "Unknown", "message": "EUROSATORY 2024 — If Europe’s future Main Ground Combat System drags out too long, Germany’s Rheinmetall is pitching a nearer-term option dubbed the “Concept Unmanned Turret” (CUT) for its Panther KF51 main battle tank.\nAs for turret features, it can be outfitted with a 130mm future gun system or the company’s 120mm smoothbore cannon and includes a 25-round autoloader, Rheinmetall says.\nRheinmetall’s announcement comes as questions linger about the health of the MGCS program.\nThe future tank is expected to be integrated with state-of-the-art technologies, ranging from new fires and artificial intelligence to advanced electronic warfare capabilities.\nThe manufacturer is also pitching the Ascalon gun as the best fit for a MGCS main gun."}, {"id": "459d2f22-800e-4dcc-a57c-6b4fbe7f57cf", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on - Boston News , Weather , Sports", "date": "2024-06-17 12:00", "url": "https://whdh.com/news/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nAnd as far as the Houthi forces watching his postings, Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\nThe carrier also has been the most-deployed carrier among the U.S.’s entire fleet over the last five years, according to an analysis by the U.S.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "aa0237e5-eab8-4f01-9c48-bbfe0c99f398", "title": "US aircraft carrier captain counters false Houthi claims on social media", "date": "2024-06-17 15:45", "url": "https://www.voanews.com/a/us-aircraft-carrier-captain-counters-false-houthi-claims-on-social-media/7658944.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it's still fighting — despite repeated false claims by Yemen's Houthi rebels.\nChristopher \"Chowdah\" Hill, and his social media profile directly in what has become an increasingly bizarre internet front line as the campaign goes on.\nThe visit by two AP journalists and others to the Eisenhower represents part of the effort the Navy has made to try to counter the Houthi claims.\n\"The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,\" Hill said.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "50a88193-2e9d-4abb-a32e-558cf82c0a2c", "title": "Despite false Houthi claims , the Ike aircraft carrier fights on", "date": "2024-06-17 18:15", "url": "https://www.navytimes.com/news/your-navy/2024/06/17/despite-false-houthi-claims-the-ike-aircraft-carrier-fights-on/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA — The aircraft carrier Dwight D. Eisenhower may be one of the oldest in the Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\nAfter one false Houthi claim, Hill responded by posting images of cinnamon rolls and muffins in the bakery on board the Eisenhower — a subtle jab at the claims.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nA sailor transports ammunition to a fighter jet on the flight deck of the aircraft carrier Dwight D. Eisenhower in the Red Sea on Tuesday, June 11, 2024.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "d71d1aa9-aabc-4963-8858-8c6f28a06bde", "title": "Monolith Wonder Woman Receives First Details Alongside Concept Art", "date": "2024-06-17 14:00", "url": "https://wccftech.com/monoliths-wonder-woman-details-art/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "Details about Monolith Productions' Wonder Woman game have surfaced alongside concept art.\nThe art and first details of the game 'leaked' through an online marketing survey, which was picked up by various outlets (including DSOGaming).\nAside from iconic DC characters, Wonder Woman will also introduce unique procedurally generated enemies and allies.\nAs this original Wonder Woman story unfolds, you must also repair your relationship with your mother, Queen Hippolyta, and your fellow Amazons who feel betrayed by your decision to leave Themyscira many years ago.\nLate last year, Warner Bros. did say that the game would be a single-player title, not designed for live service."}, {"id": "a07b5498-a228-42c4-8842-34814db7ae3f", "title": "On board The USS Dwight D . Eisenhower : The aircraft carrier Houthi rebels claim to have sunk three times", "date": "2024-06-17 10:00", "url": "https://www.independent.co.uk/news/world/middle-east/uss-dwight-eisenhower-houthi-rebels-b2563788.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the US Navy, but it's still fighting, on the sea and online.\nThe carrier has been sunk three times according to false claims by Yemen's Houthi rebels.\nA fighter jet pilot maneuvers on the flight deck of the USS Dwight D. Eisenhower in the Red Sea on Tuesday, June 1 ( Copyright 2024 The Associated Press.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said."}, {"id": "5a0e3735-7966-4b05-bdb1-10e3efea826f", "title": "Henry Cavill is looking for tips on fatherhood", "date": "2024-06-17 10:45", "url": "https://www.cnn.com/2024/06/17/entertainment/henry-cavill-fathers-day-scli-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —“Superman” star Henry Cavill has asked dads the world over for their advice as he and partner Natalie Viscuso prepare for the birth of their first child.\nCavill confirmed he and Viscuso (right) were expecting their first child back in April.\nCavill and Viscuso, a television executive, have been dating for several years.\nThe actor also recently admitted that he is not a fan of sex scenes, suggesting that graphic love scenes can sometimes feel gratuitous.\nAppearing on the podcast “Happy Sad Confused” in February, Cavill said he felt that intimate scenes are sometimes “overused.”"}, {"id": "77ad70ea-1811-4f0b-b012-14de635d2ad1", "title": "Robot craze in Russia - Ukraine war shines light on their drawbacks", "date": "2024-06-17 15:00", "url": "https://www.defensenews.com/unmanned/2024/06/17/robot-craze-in-russia-ukraine-war-shines-light-on-their-drawbacks/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "Since the appearance of a Russian unmanned ground vehicle, or UGV, in Ukraine in April 2022, several new prototypes have popped up across the battlefield.\nThe robot craze has seemingly engulfed both Russia and Ukraine, as evidenced by the former’s plan to make them an integral part of its military and the latter’s intention to create an army of robots.\nBut the popularity of such systems predates the war by several years.\n“Prior to its invasion of Ukraine, the Russian military was one of the global leaders in UGV research, development and evaluation.\nShe covers a wide range of topics related to military procurement and international security, and specializes in reporting on the aviation sector."}, {"id": "2b717248-fd2e-46e5-b929-528bd2fa0058", "title": "House of the Dragon : All dragons and dragonriders", "date": "2024-06-17 03:15", "url": "https://www.polygon.com/23381183/house-dragon-all-dragons-riders-vhagar", "domain": "polygon.com", "domain_classification": "Unknown", "message": "House of the Dragon season 1 saw a lot of politicking.\nBut by the final episode, the dragons — and their use in the coming Dance of the Dragons — take center stage.\nAs we see in episode 10, even with the proper rider, dragon warfare can lead to calamitous consequences.\nSunfyreRider: Aegon TargaryenA bright-gold dragon with pink-membraned wings, Sunfyre is the dragon of Aegon Targaryen and a swift flier, though far from the biggest of the Targaryens’ remaining dragons.\nBecause of this, the dragon remains fairly small by the time House of the Dragon picks up with Jace."}, {"id": "3fd96ae0-dddc-479a-9a36-fbff60d7c918", "title": "The Daily Heller : Vintage Japanese Infographics", "date": "2024-06-17 12:45", "url": "https://www.printmag.com/daily-heller/the-daily-heller-japanese-vintage-infographics/", "domain": "printmag.com", "domain_classification": "Unknown", "message": "Somehow, humanity purports to believe that war has rules of conduct, when the only rule (conventions to the contrary) is that there are no rules.\nOne such is this rare set of cautionary graphics, “National Air Defense Maps,” created by the Great Japan Air Defense Association during World War II to instruct civilians on how to safely behave during perilous times.\nThese graphics are not designed to make warfare more palatable, but to attract they eye and trigger sensitivity to lifesaving procedures.\nUnfortunately, the Japanese contribution to this ‘alternative’ history of graphic design has not been sufficiently appreciated to date.\nThis large-format (755 x 515 mm) publication, complete with all pages, from the Dainihon Bōkū Hōkokukai (Great Japan Air Defense Association) provides an important building block for this aspect of graphic design history."}, {"id": "165d8e0b-c158-48d8-9977-9fca0fc36c8f", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-17 03:30", "url": "https://www.tvguide.co.uk/schedule/91b9e802-7ae2-5081-828f-31486e9a0725/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 17 June Share Add toCalendar +SAS Season 4 Episode 7 of 10 S SubtitlesA Hollywood blockbuster needs an authentic Second World War SAS jeep within two weeks.\nIt's a tight deadline but military equipment collector Bruce Crompton is determined to meet it, as the wartime SAS is a passion of hisCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 17 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "fa5a8848-d6d1-424a-b6bf-6854f6dc071d", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 08:15", "url": "https://www.ivpressonline.com/news/world/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/article_6993c935-9dfd-5e32-b086-205138833530.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "4faf323a-5f9c-4556-a8d7-35735e630079", "title": "An army of zombie symbiotes are invading Manhattan and it up to Daredevil plus Daredevil to stop them in Marvel new Venom War spin - off", "date": "2024-06-17 15:30", "url": "https://www.gamesradar.com/comics/marvel-comics/venom-war/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "Marvel's new Venom War event pits father and son against each other as Eddie and Dylan Brock battle to decide who will be the \"one true Venom\".\nWe already know that Black Widow will be one of those, and now Newsarama can exclusively reveal the identity of another character who will be getting their own Venom War spin-off: Daredevil.\nVenom War: Daredevil #1 is written by Chris Condon and drawn by Lan Medina.\n\"As Venom War rages, Manhattan finds itself besieged by an infectious new strain of symbiotes – one that drives their living hosts to an all-encompassing hunger for human flesh and can even reanimate the dead!\nVenom War: Daredevil #1 is published by Marvel Comics on September 25."}, {"id": "87006f23-7880-4c36-866b-d7947fb4f9bc", "title": "US aircraft carrier captain playfully counters Houthi false online claims of hitting his ship", "date": "2024-06-17 16:30", "url": "https://santamariatimes.com/news/world/us-aircraft-carrier-captain-playfully-counters-houthis-false-online-claims-of-hitting-his-ship/article_ebfab797-bdfd-5ba8-8ad5-b757fe9e0df4.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels"}, {"id": "dfdb8b80-fcaa-4015-9723-6cf92ef9af00", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 06:30", "url": "https://www.mymotherlode.com/news/national/general-election/3376603/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "US aircraft carrier captain playfully counters Houthi’s false online claims of hitting his ship View PhotoABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\nThe Houthis and social media accounts supporting them repeatedly have falsely claimed they hit or even sank the carrier in the Red Sea.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nThe carrier also has been the most-deployed carrier among the entire U.S. fleet over the last five years, according to an analysis by the U.S.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "063f33b9-ed3d-4a97-a408-205da5b37cce", "title": "Albany - area military recruiters seek next generation of nation warriors", "date": "2024-06-17 18:30", "url": "https://www.ajc.com/partner/albany-area-military-recruiters-seek-next-generation-of-nations-warriors/TO6CBSJRCBERLL624Q2MWZ7RX4/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "738f3c43-e14f-4efa-8430-4e6a0f33b7b2", "title": "Ukrainian soldier captures four Russian troops in Donetsk Oblast", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/ukrainian-soldier-captures-four-russian-100708915.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Ukrainian soldier belonging to one of the combat brigades of Ukraine's Armed Forces has recently single-handedly captured four Russian troops in Donetsk Oblast.\nIn particular, a Ukrainian soldier belonging to one of the combat brigades of the AFU has recently single-handedly captured four Russian occupiers in Donetsk Oblast.\nI thank him and all Ukrainian defenders, who take their duties responsibly, for their dedicated service!\"\nDetails: The General Staff of the AFU told Ukrainska Pravda that the soldier in question served with the Ground Forces.\nThe event took place in the area of responsibility of the Donetsk Operational Group of Ukrainian forces."}, {"id": "7211189b-c7cb-4e99-b753-ae01c1db789c", "title": "Israeli Defense Exports Hit Record as Global Arms Spending Soars", "date": "2024-06-17 16:45", "url": "https://www.bnnbloomberg.ca/israeli-defense-exports-hit-record-as-global-arms-spending-soars-1.2086083", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- Israel’s defense exports reached a record last year as wars including those in Ukraine and Gaza raise the specter of a global arms race.\nMilitary exports rose by $500 million from 2022 to $13.1 billion, a doubling of the figure from five years ago, the country’s Defense Ministry said on Monday.\nOne of the biggest contracts signed in 2023 was for the supply of the Arrow 3 long range air-defense system to Germany.\n“While our industries are primarily focused on providing the defense establishment with the capabilities to support our troops and defend our citizens, they are also continuing to pursue areas of cooperation and exports to international partners,” Israeli Defense Minister Yoav Gallant said in a statement.\nWhile that conflict continues to rage, Israeli firms are once again focusing on international markets."}, {"id": "bd7dcad7-3ef1-4b3e-b7e4-409b0e0b4cf3", "title": "Israel says Rafah offensive goals nearly achieved", "date": "2024-06-17 18:30", "url": "https://www.yahoo.com/news/israel-says-rafah-offensive-goals-170451654.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Omar Ashtawy/APA Images via ZUMA Press Wire/dpaThe Israeli military says it will soon have achieved its aims in the offensive in Rafah.\nSome 60-70% of the territory of the city in the southern Gaza Strip is under the \"operational control\" of Israeli troops, the army said on Monday.\nIsrael's army launched the operation in Rafah, which lies on the border with Egypt, at the beginning of May.\nThe offensive was highly controversial internationally because more than 1 million Palestinians were in Rafah at the time.\nMost of them had fled there from other parts of the Gaza Strip to escape the war."}, {"id": "e011739a-a9da-4754-a5d3-088a2bf916fe", "title": "  Bring It On !: House Of The Dragon Showrunner Talks That Bloody Second Season Premiere , And How Hell Handle Any Online Backlash", "date": "2024-06-17 14:00", "url": "https://www.cinemablend.com/interviews/bring-it-on-house-of-the-dragons-showrunner-talks-that-bloody-second-season-premiere-and-how-hell-handle-any-online-backlash", "domain": "cinemablend.com", "domain_classification": "Unknown", "message": "SPOILERS for the first episode of House of the Dragon Season 2 are ahead.\nWhen it comes to House of the Dragon, you know there is going to be a crazy amount of deaths.\nThe finale of House of the Dragon was released in 2022, signaling the start of the Targaryen Civil War, otherwise known as the Dance of Dragons.\nAnd yeah, it's really the catalyst for all the events that are going to follow in this season.\nHowever, it's nice to know that Condal is ready and waiting for any backlash he gets, so sharpen your pitchforks."}, {"id": "085f92bf-4dbb-436e-a0de-2144be303332", "title": "Latvia - led drone coalition for Ukraine gains more funding , members", "date": "2024-06-17 17:15", "url": "https://www.defensenews.com/global/europe/2024/06/17/latvia-led-drone-coalition-for-ukraine-gains-more-funding-members/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "PARIS — The international coalition to supply drones to Ukraine has received almost $600 million in commitments from Western allies, with Italy and France being the latest countries to join the alliance, the Latvian minister of defense said.\nAccording to the official, the drone alliance has received over €500 million euros ($590 million) in international pledges, which he expects will increase further in the future.\nSpruds added that the coalition, which is spearheaded by his home country and the U.K., recently gained two new members – Italy and France – following a meeting of NATO defense ministers in Brussels.\nOn a national level, Baltic states have accelerated their drone procurement and training programs, with a special focus on first-person-view types, which have come to dominate the battlefield in Ukraine.\nShe covers a wide range of topics related to military procurement and international security, and specializes in reporting on the aviation sector."}, {"id": "972d12dc-d494-4f5b-8555-0fa59407ed2d", "title": "UN probe finds Israel GUILTY of crimes against humanity in Gaza – NaturalNews . com", "date": "2024-06-17 18:30", "url": "https://www.naturalnews.com/2024-06-17-un-probe-israel-guilty-war-crimes-gaza.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "UN probe finds Israel GUILTY of crimes against humanity in GazaThe UN Independent International Commission of Inquiry (COI) made this conclusion on June 12, deeming Tel Aviv guilty of the atrocities committed during its eight-month-long campaign of genocide against Palestinians in Gaza.\n(Related: UN experts call for investigation into Israeli human rights violations against Palestinian women and girls.)\nNot just Gaza: COI discovers Israel's war crimes in the West BankThe COI also mentioned that Tel Aviv committed war crimes in the occupied West Bank.\nWhile the report mainly focused on Israel's war crimes, the COI also zoomed in on the misdeeds of Hamas and six other Palestinian armed groups.\nUnited Nations accuses Israel of BLOCKING humanitarian aid deliveries into Gaza StripHorrifying details emerge of Israeli soldiers torturing and sexually abusing Palestinian detainees."}, {"id": "a72c706a-6cbe-42b4-9b71-508969bf6126", "title": "Editorial : D - Day , and pride in America as democracy defender", "date": "2024-06-17 16:15", "url": "https://www.yahoo.com/news/editorial-d-day-pride-america-152400861.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Department of Veterans Affairs estimates that only 1,000 of the 16 million Americans who served in World War II will still be alive for the next one in 2034.\nA wavering worldIs the free world wavering in its devotion to the principles of liberty and democracy that hung in the balance on D-Day?\nA new evil empireThe United States that saved the free world in World War II is in danger of descending into despotism.\nHe’s the most openly racist politician to have led any Western government since World War II.\n____The Sun Sentinel Editorial Board consists of Opinion Editor Steve Bousquet, Deputy Opinion Editor Dan Sweeney, editorial writer Martin Dyckman and Editor-in-Chief Julie Anderson."}, {"id": "aef89d00-72fa-4511-9c01-369fceeda3e3", "title": "North Korea hates the South propaganda loudspeakers . But how effective are they , really ? ", "date": "2024-06-17 04:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3266853/north-korea-hates-souths-propaganda-loudspeakers-how-effective-are-they-really", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "South Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nThe loudspeakers deployed by South Korea to wage psychological warfare against North Korea have faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\n02:43 North Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nNorth Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nWhat appear to be North Korean loudspeakers are pictured from across the border in South Korea on June 11."}, {"id": "3fb9dff4-f4de-40e1-9552-3b9adf92f1ed", "title": "8 superhero games we wish were made ( and who could develop them ) ", "date": "2024-06-17 03:30", "url": "https://bamsmackpow.com/posts/superhero-games-we-wish-were-made-who-could-develop-them-01hzge7wrdhr", "domain": "bamsmackpow.com", "domain_classification": "Unknown", "message": "8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel.\n8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel"}, {"id": "37f1bfa1-e163-4bf9-89b9-8713cb959a0e", "title": "Henry Cavill seeks parenting tips on Father Day , shares picture of crib", "date": "2024-06-17 11:00", "url": "https://www.indiatoday.in/movies/hollywood/story/henry-cavill-seeks-parenting-tips-on-fathers-day-shares-picture-of-crib-2554151-2024-06-17", "domain": "indiatoday.in", "domain_classification": "Unknown", "message": "'Superman' actor Henry Cavill asked his fans for parenting tips in a heartwarming Father's Day post.\nThe British star, who is set to welcome his first child with his girlfriend, Natalie Viscuso, also shared a picture of himself with a crib on Sunday, June 16.\nIn the picture, Henry Cavill, 41, sought parenting tips from fans.\nIn April this year, Henry Cavil announced that he is expecting his first child with girlfriend Natalie Viscuso.\nMeanwhile, work-wise, Henry Cavill will be next seen in 'The Ministry of Ungentlemanly Warfare '."}, {"id": "60a49c1b-b6f3-47d9-acee-b64fe3cf7ad4", "title": "Space Debris Removal Market to Skyrocket : Projected Growth", "date": "2024-06-17 16:45", "url": "https://www.openpr.com/news/3541861/space-debris-removal-market-to-skyrocket-projected-growth", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Space Debris Removal Market to Skyrocket: Projected Growth to $0.6 Billion by 2028, at a CAGR of 41.7%Space Debris Removal Markethttps://www.marketsandmarkets.com/Market-Reports/space-debris-removal-market-179602300.htmlhttps://www.marketsandmarkets.com/pdfdownloadNew.asp?id=179602300https://www.marketsandmarkets.com/pdfdownloadNew.asp?id=179602300&utm_source=ABNewswire&utm_medium=Referral&utm_campaign=PAID-PRhttps://www.marketsandmarkets.com/Enquiry_Before_BuyingNew.asp?id=179602300https://www.marketsandmarkets.com/Enquiry_Before_BuyingNew.asp?id=179602300&utm_source=ABNewswire&utm_medium=Referral&utm_campaign=PAID-PRhttps://www.marketsandmarkets.com/Market-Reports/space-debris-removal-market-179602300.htmlhttps://www.marketsandmarkets.com/Market-Reports/space-debris-removal-market-179602300.htmlhttps://www.abnewswire.com/email_contact_us.php?pr=space-debris-removal-market-to-skyrocket-projected-growth-to-06-billion-by-2028-at-a-cagr-of-417https://www.marketsandmarkets.com/Market-Reports/space-debris-removal-market-179602300.htmlThe global Space Debris Removal Market in terms of revenue was estimated to be worth $0.1 billion in 2023 and is poised to reach $0.6 billion by 2028, growing at a CAGR of 41.7%.The [] Market will expand from USD 0.1 billion in 2023 to USD 0.6 billion by 2028.\nThis remarkable growth, characterized by a Compound Annual Growth Rate (CAGR) of 41.7%, highlights the increasing urgency and investment in tackling space debris.Download PDF Brochure @Key Segments:The Space Debris Removal Market is categorized into several key segments:By Solution:* Ground-Based Solutions* Space-Based SolutionsBy Technology:* Robotic Arms* Harpoons* Nets* Lasers* OthersBy End-User:* Government* CommercialInquire Before Buying @Growth Drivers:Multiple factors are driving the exponential growth of the Space Debris Removal Market:Increasing Space Missions: With the rise in satellite launches and space missions, the accumulation of space debris has surged, necessitating effective debris removal solutions.Government Initiatives: Governments worldwide are prioritizing space sustainability and investing in technologies to mitigate the risks posed by space debris.Technological Advancements: Innovations in debris removal technologies, such as robotic arms and laser systems, are enhancing the efficiency and feasibility of space debris mitigation.Private Sector Involvement: The entry of private companies into the space industry has boosted investments in debris removal, spurred by the need to protect valuable space assets.Challenges:The market faces several significant challenges:High Costs: The development and deployment of space debris removal technologies are capital-intensive, posing financial challenges.Technical Complexities: Designing and implementing effective debris removal solutions involve intricate technical hurdles.Regulatory Hurdles: Navigating international regulations and achieving global consensus on debris removal protocols can be complex and time-consuming.View detailed Table of Content here -Opportunities:Despite the challenges, the market presents numerous opportunities:Collaborative Efforts: International collaborations and partnerships can drive innovation and cost-sharing in debris removal initiatives.Sustainable Space Operations: The increasing emphasis on sustainability in space operations creates opportunities for companies to develop and market advanced debris removal technologies.Commercial Ventures: The growing commercial space industry, including satellite mega-constellations, opens new avenues for debris removal services to protect operational satellites and infrastructure.Key Players:Several key players are at the forefront of the Space Debris Removal Market:Northrop Grumman Corporation: Known for its pioneering mission extension vehicles and innovative space solutions.Astroscale Holdings Inc.: A notable company dedicated exclusively to on-orbit servicing and debris removal.ClearSpace SA: Innovators in space debris removal, focused on delivering sustainable space solutions.Media ContactCompany Name: MarketsandMarkets Trademark Research Private Ltd.Contact Person: Mr. Aashish MehraEmail:Send Email [Phone: 18886006441Address:630 Dundee Road Suite 430City: NorthbrookState: IL 60062Country: United StatesWebsite:"}, {"id": "4d590442-3a20-4c59-85fb-b9077473cea3", "title": "Ukraine summit strives for consensus , way forward uncertain", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/world/ukraine-summit-strives-consensus-way-forward-uncertain", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Over 90 countries attended the two-day talks at a Swiss Alpine resort at the behest of Ukrainian President Volodymyr Zelenskiy, billed as a \"peace summit\" even though Moscow was not invited.\n\"We are responding to Russia's full-scale invasion of Ukraine not only with a full-scale defence of human life, but also with full-scale diplomacy,\" Zelenskiy said.\nNo peace talks have been held for more than two years.\n[[nid:678352]]No country came forward to host another such meeting, with notable silence from Saudi Arabia, mooted as a possible future venue.\n\"Of course we...understand perfectly that a time will come when it will be necessary to talk to Russia,\" Ukrainian Foreign Minister Dmytro Kuleba said."}, {"id": "5f58951f-ebb3-49d2-b3e7-5571a60a2d37", "title": "China is almost ready for its war with the West", "date": "2024-06-17 16:45", "url": "https://www.telegraph.co.uk/news/2024/06/17/china-is-almost-ready-for-its-war-with-the-west/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The five worst muddles politicians have got themselves into over trans rights"}, {"id": "729deacc-8181-464a-87be-dcff5a6135ef", "title": "Battle tank concepts mushroom at Paris arms show", "date": "2024-06-17 17:15", "url": "https://www.defensenews.com/industry/techwatch/2024/06/17/battle-tank-concepts-mushroom-at-paris-arms-show/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "PARIS — If Europeans fail to pull off a common next-generation battle tank design, it will not have been for a lack of ideas.\n“We have to have a next-gen tank” before that, he told reporters.\nWith the gun and turret concept complete, KNDS plans to unveil a fully functioning demonstrator at the Eurosatory show in 2026, spending the time until then fleshing out the chassis design, Scheibel said.\nRheinmetall unveiled the concept for an unmanned turret at the Eurosatory arms show outside of Paris on June 17, 2024.\nAn unmanned turret, the company said, will enable the crew to sit lower in the protected chassis and provide 25 “ready rounds” for the 130mm main gun."}, {"id": "c057ee8f-e702-4271-a417-f9b0640add40", "title": "Sean Parnell :  Vindicated  By  Family Court System  After Custody Battle", "date": "2024-06-17 05:00", "url": "https://www.breitbart.com/politics/2024/06/16/sean-parnell-fathers-day-vindicated-family-court-system-custody-battle/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Sean Parnell, a former senatorial and congressional candidate in Pennsylvania, revealed in a Father’s Day update that he has been “vindicated” by the “family court system” after a custody battle with his ex-wife.\n“On this Father’s Day, I wanted to share a significant personal update,” Parnell began.\n“After enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAfter enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAs a father in family court the deck will always be stacked against you."}, {"id": "0fb7d35f-8c57-41cb-bdf6-6c0f16fcd08d", "title": "defence firms : Israel defence exports hit record $13 . 1 billion in 2023", "date": "2024-06-17 12:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-defence-exports-hit-record-13-1-billion-in-2023/articleshow/111061156.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "RECOMMENDED STORIES FOR YOU(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIsraeli defence exports rose to a record $13.1 billion in 2023, a government report said on Monday, citing hundreds of contracts signed at various defence firms Some 36% of exports came from missile rocket and air defence systems , followed by radar and electronic warfare, weapon stations and launchers at 11% each, with crewed aircraft and avionics at 9%, the Defence Ministry said.Defence exports, which totalled $12.5 billion in 2022, have doubled over the past five years.The ministry said defence exports had become a central priority as part of an effort to strengthen security-strategic relations worldwide, enter new markets, remove bureaucratic barriers and reduce regulation.\n\"While our industries are primarily focused on providing the defence establishment with the capabilities to support our troops and defend our citizens .\nThey are also continuing to pursue areas of cooperation and exports to international partners,\" said Defence Minister Yoav Gallant"}, {"id": "86f36417-f94b-476a-bb9b-0b7b39b622a3", "title": "AI - Equipped Underwater Drones Helping US Navy Scan for Threats", "date": "2024-06-17 17:15", "url": "https://finance.yahoo.com/news/ai-equipped-underwater-drones-helping-153947268.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "(Bloomberg) -- The US Navy is boosting its deployment of artificial intelligence that automatically detect targets after successfully testing it on underwater drones, according to defense officials.\nAI models loaded onto underwater drones have mostly replaced a time-consuming chore for sailors: parsing underwater drone footage to distinguish fish traps from explosives.\nSuccessful AI models often require rapid retraining to help adapt to new terrains.\nIdentifying objects against a sandy ocean floor is different from identifying them against a rocky ocean floor or seabed strewn with debris, Ksiasek said.\nThe underwater drones are already deployed in the Indo-Pacific region and have participated in exercises there, he added."}, {"id": "ab20d098-1726-4dae-937f-53e092eead7b", "title": "Ukraine to get German - made  Frankenstein  tank", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/ukraine-german-made-frankenstein-tank-105144931.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A mocked-up image showing how the new 'Frankenstein' tank will probably look - RheinmetallA new “Frankenstein” air defence tank designed to shoot down Russian drones and missiles is to be supplied to Ukraine by a top German arms firm.\nRheinmetall has announced it will mount its state-of-the-art Skyranger anti-aircraft system on Cold War-era Leopard 1 tank hulls, creating a new vehicle to bolster Ukraine’s defences.\nBack into actionBy repairing the vehicles in Ukraine, the company hopes to cut the time it takes to get tanks back into action.\nAt first, only Marder armoured vehicles and the older version of the Leopard tank will be repaired at the factory.\nBut the company has said that it wants to repair more modern Leopard 2 tanks inside Ukraine as well."}, {"id": "04a01f64-0b5c-4cbc-bd20-4a5764a2b623", "title": "Denmark developing measures to curb oil transport by Russia shadow fleet", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/denmark-developing-measures-curb-oil-084859676.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: European Pravda, citing the minister's interview with Danish news outlet Information and DanwatchQuote: \"Denmark has gathered a group of countries to consider further measures against the shadow fleet.\nDetails: Rasmussen did not elaborate on what the new measures would entail but added that he \"takes the problem of the shadow fleet very seriously\".\nOutdated oil tankers make up Russia's so-called shadow fleet, which it uses to circumvent sanctions on oil exports.\nRasmussen did not disclose what countries would try to curb the shadow fleet.\nPrior to that, media reports indicated that there were still disagreements among EU countries over measures targeting Russia's so-called \"shadow fleet\", which consists of semi-legal oil tankers."}, {"id": "4c49a8fc-4d54-4e19-b733-abc839ac62cd", "title": "AI - Equipped Underwater Drones Helping US Navy Scan for Threats", "date": "2024-06-17 16:45", "url": "https://www.bnnbloomberg.ca/ai-equipped-underwater-drones-helping-us-navy-scan-for-threats-1.2086112", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- The US Navy is boosting its deployment of artificial intelligence that automatically detect targets after successfully testing it on underwater drones, according to defense officials.\nAI models loaded onto underwater drones have mostly replaced a time-consuming chore for sailors: parsing underwater drone footage to distinguish fish traps from explosives.\nSuccessful AI models often require rapid retraining to help adapt to new terrains.\nIdentifying objects against a sandy ocean floor is different from identifying them against a rocky ocean floor or seabed strewn with debris, Ksiasek said.\nThe underwater drones are already deployed in the Indo-Pacific region and have participated in exercises there, he added."}, {"id": "8b35c33e-31bb-45e2-a8b7-10d2398ef1d7", "title": "Jabalia showdown : IDF paratroopers clash with Hamas in unconquered stronghold", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/magazine/article/byan3ynbc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "At 18:45 comes the pinnacle of the day’s battle as a huge blast shakes the Jabaliya refugee camp.\nAs in any neighborhood IDF ground operates, the water and electricity systems were cut off as soon as the Jabaliya refugee camp was occupied.\nThe IDF announced in December that Southern Command’s 162nd Division had completed its ground operations by defeating Hamas’ Jabaliya battalion and that the forces left had taken operational control of the city.\nHamas terrorists also eat the displaced people’s food.\nThe last of the soldiers pulled out last Thursday, completing three weeks of the IDF’s first operation in the Jabaliya refugee camp."}, {"id": "9b0c1d33-e366-4101-b62d-7a77ad36ea16", "title": "IDF says it will gain full control of Rafah from Hamas in two weeks", "date": "2024-06-17 16:45", "url": "https://www.jpost.com/israel-hamas-war/article-806594", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF's invasion of RafahThe IDF’s invasion of Rafah started on May 6 and by May 20, it had control of around 30-40% of Rafah, including the Philadelphi Corridor.\nAs of May 20, the IDF had said it had killed around 130 Hamas terrorists.\nSince May 20, IDF progress has been slower, but steady, including the need for extensive time to explore the tunnel networks.\nAmid international opposition, the IDF took the Palestinian side of the Rafah crossing on May 7, attaining full operational control of the crossing.\nIsrael had maintained the importance of operating in Rafah to eliminate the last four Hamas battalions, which it believed were still in the region."}, {"id": "ad62d340-ca50-40ad-92da-bcd5abfc5b1f", "title": "Sanctifying the profane : the Russian Orthodox Church at the front", "date": "2024-06-17 09:15", "url": "https://globalvoices.org/2024/06/17/sanctifying-the-profane-the-russian-orthodox-church-at-the-front/", "domain": "globalvoices.org", "domain_classification": "Unknown", "message": "Kirill Shamiev and Ksenia Luchenko, both Visiting Fellows at the European Council on Foreign Relations, wrote for the Russia Post about the role of the Russian Orthodox Church in Putin’s regime and the full-scale Invasion of Ukraine.\nThe Russian Orthodox Church has actively participated in Russia’s full-scale war against Ukraine since the very beginning.\nChurch TV channels — the Moscow Patriarchate’s widely watched Spas and the Orthodox “patriotic” channel Tsargrad — stress the sanctity of the war.\nVasiliev had served in the town’s church for over 20 years and was close to the military leadership stationed there.\nHe also claimed that about 100 Orthodox priests were on the front line every day, many of them not for the first time."}, {"id": "dae43580-eeb9-4255-b1df-404a5cbc04d0", "title": "Ancient Scottish settlement was built to  defend country from aliens , claims expert", "date": "2024-06-17 16:45", "url": "https://www.dailystar.co.uk/news/latest-news/ancient-scottish-settlement-built-defend-33049368", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nFor out-of-this-world news, sign up for the Spaced Out newsletterSomething went wrong, please try again later.\nMr Halliday told Scottish Sun: \"There are Scottish objects and sites that could be related to ancient aliens.\"\nHe declared: \"In my mind, the background to some of these ancient structures has never been satisfactorily explained.\""}, {"id": "2851abd2-a159-49b1-80c3-204cd821f513", "title": "Between hollow rhetoric and war : how sanctions work – and why they often dont | US foreign policy", "date": "2024-06-17 00:15", "url": "https://www.theguardian.com/us-news/article/2024/jun/17/between-hollow-rhetoric-and-war-how-sanctions-work-and-why-they-often-dont", "domain": "theguardian.com", "domain_classification": "International", "message": "It was known as the Megarian decree, and it was arguably the first recorded case of economic sanctions.\nThe Peloponnesian war, pitting Athens against Sparta, erupted a year later, and some ancient historians believe it was triggered by the Megarian sanctions.\nThe current thicket of western sanctions on Russia are a clear failure in those terms.\nUS-led sanctions were also instrumental in persuading Tehran to the negotiating table to accept significant limitations on its nuclear programme in return for sanctions relief.\n“Biden came in saying there is going to be a review of the use of sanctions and we are going to be far more judicious about using them, and Biden winds up using sanctions more than any other president.”"}, {"id": "630befd2-0d55-4d4a-80f5-7552a40f1b42", "title": "Ukraine summit strives for consensus , way forward uncertain", "date": "2024-06-17 12:15", "url": "https://www.stabroeknews.com/2024/06/17/news/world/ukraine-summit-strives-for-consensus-way-forward-uncertain/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "Over 90 countries attended the two-day talks at a Swiss Alpine resort at the behest of Ukrainian President Volodymyr Zelenskiy, billed as a “peace summit” even though Moscow was not invited.\n“We are responding to Russia’s full-scale invasion of Ukraine not only with a full-scale defense of human life, but also with full-scale diplomacy,” Zelenskiy said.\nNo peace talks have been held for more than two years.\nNo country came forward to host another such meeting, with notable silence from Saudi Arabia, mooted as a possible future venue.\n“Of course we…understand perfectly that a time will come when it will be necessary to talk to Russia,” Ukrainian Foreign Minister Dmytro Kuleba said."}, {"id": "3bb44818-22a9-4c7a-907d-72e512e09eec", "title": "Jacobite pistol  taken as Culloden spoil of war  to be auctioned", "date": "2024-06-17 10:15", "url": "https://www.heraldscotland.com/news/24391657.jacobite-pistol-taken-culloden-spoil-war-auctioned/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "It bears two engraved panels – one stating 'Taken at the Battle of Colloden [sic]', and the other Rich-Vyse-C--nt / R.D.T'.\nRe-enactors re-fight the Battle of Culloden (Image: NQ)Vyse had a long and successful career in the British army, beginning as a cornet in the 5th Dragoons on 13 February 1762.\nREAD MORE: The 'biggest myth about the Jacobites' and the propaganda warThe pistol has been in the same family since the early 1960s.\nIt may be a coincidence, but the pistol was acquired by our family in the same year.\n\"This is of particular significance as one of the most recounted stories of the Jacobite charge at Culloden is the wounding of Donald Cameron of Lochiel, known as ‘The Gentle Lochiel’."}, {"id": "94409b28-de27-43cc-8e47-7083ddee8526", "title": "US military seizes Iranian missile parts bound for Houthi rebels", "date": "2024-06-17 12:00", "url": "http://www.myanmarmuslim.net/news/20240617152b599791.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US Navy Seals seized Iranian-made missile parts and other weaponry from a ship bound for Yemen’s Houthi rebels in a raid last week in which two commandos went missing, the US military said on Tuesday.\nThe seized missile components included types likely to have been used in those attacks.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nA United Nations resolution bans arms transfers to Yemen’s Iranian-backed Houthi rebels.\nTehran has long denied arming the rebels, despite physical evidence, numerous seizures and experts tying the weapons back to Iran."}, {"id": "9794ff45-80fa-4630-a487-4a9c50fb4880", "title": "Russia - Ukraine war : Delhi court denies bail to man accused of trafficking Indian citizens", "date": "2024-06-17 15:30", "url": "https://indianexpress.com/article/cities/delhi/russia-ukraine-war-delhi-court-denies-bail-to-man-accused-of-trafficking-indians-9398064/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "A Delhi court has denied bail to a man accused of trafficking Indian citizens to Russia to be deployed on the battlefront in the war against Ukraine against their will, observing that the charges against him are serious and he could try to destroy evidence.\nAdvertisementThe accused had sought bail claiming he was himself was a victim of the racket and falsely implicated in the case.\nThe CBI alleged that the victims were “deceptively made to sign contract for joining Russian army”.\nThey were trained in combat roles and provided Russian army uniform and badges.\nAdvertisementThese Indian nationals were then deployed in war zones against their wish and their lives were put in danger, the CBI alleged, adding that some of them also got grievously injured."}, {"id": "1401dc77-b6af-419f-80ca-562a8ca5c49f", "title": "House Of The Dragon Trailer Reveals What Coming Up In Season 2", "date": "2024-06-17 15:00", "url": "https://www.gamespot.com/articles/house-of-the-dragon-trailer-reveals-whats-coming-up-in-season-2/1100-6524310/", "domain": "gamespot.com", "domain_classification": "Unknown", "message": "After the way House of the Dragon Season 1 ended, it was inevitable that Queen Rhaenyra Targaryen (Emma D'Arcy) was going to want revenge for the death of her son.\nThanks to a callous act on Rhaenyra's behalf, the Targaryen civil war is only going to be more intense, as seen in the new House of the Dragon Season 2 trailer.\nWarning: the following contains spoilers from the Season 2 premiere of House of the Dragon.\nThe season premiere went out of its way to establish that Aegon's love for Jaehaerys was real.\nHouse of the Dragon Season 2 will continue on Sunday, June 23 on HBO and Max."}, {"id": "c179cd12-7fea-487b-917d-c928609d471b", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/asia/south-koreas-loudspeakers-face-questions-over-reach-north", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SEOUL - The loudspeakers deployed by South Korea to wage psychological warfare against North Korea faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nMr Kim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea's own loudspeakers in the area further diminish the reach of South Korea's psychological warfare.\nNorth Korea's broadcasts are less aimed at winning over people in the South and more at \"suppressing\" the South's broadcasts by overpowering or muddling the message, he said.\n[[nid:689268]]At least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "223fe31d-5792-4344-a89b-fb2ed81102a9", "title": "Euro 2024 : Austria fans break baguette to taunt France", "date": "2024-06-17 19:00", "url": "https://ftw.usatoday.com/2024/06/euro-2024-italy-pasta-break-france-baguette", "domain": "ftw.usatoday.com", "domain_classification": "Unknown", "message": "You know it’s a sin to break spaghetti before cooking it, right?\nAnyway, this is pertinent because we’re seeing an emerging trend on social media at Euro 2024: fans breaking carbs to taunt opposing die-hards.\nIt happened earlier this week when Albanian fans ripped some spaghetti in front of their Italian counterparts, and the reaction was hilarious.\nThen, Autria’s fans did the same with a baguette in front of some French die-hards.\nItaly went on to win 2-1. https://t.co/XpCzUPsRlK pic.twitter.com/WxLyh9Iqzo — ABC News (@ABC) June 16, 2024"}, {"id": "36f806c5-5ff7-4e6c-b0bb-3d93d130761a", "title": "Biden $30m Weekend Fundraising Blitz Breaks Democratic Party Records – Mother Jones", "date": "2024-06-17 17:00", "url": "https://www.motherjones.com/politics/2024/06/biden-campaign-fundraiser-30-million-hollywood-clooney-obama/", "domain": "motherjones.com", "domain_classification": "Unknown", "message": "Fight disinformation: Sign up for the free Mother Jones Daily newsletter and follow the news that matters.\nBiden’s weekend donor cash splash hit like a tidal wave, according to the president’s campaign on Sunday morning.\nAttracted by celebrities like Jimmy Kimmel, Julia Roberts, and George Clooney for a glamorous Hollywood event, party-goers coughed up $30 million, breaking records for the Democratic Party’s largest single fundraiser ever, according to the campaign.\nWhile Biden has generally been considered to have the bigger cash advantage, Trump is also aggressively raising money and attracting significant amounts.\nHis conviction in the “hush money” trial unleashed a $52.8 million deluge to his coffers in 24 hours, according to his campaign."}, {"id": "05290e0f-b4c4-4563-beb3-ae21db90030e", "title": "MoD of Russia Report for June 17th , 2024 … – Windows to Russia", "date": "2024-06-17 17:30", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-17th-2024.html", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "MoD of Russia Report for June 17th, 2024…Russian Defence Ministry report on the progress of the special military operation (17 June 2024)The Armed Forces of the Russian Federation continue the special military operation.\nThe enemy losses were up to 300 Ukrainian troops, four pickup trucks, one 152-mm D-20 howitzer, one 122-mm D-30 howitzer, and one BM-21 Grad MLRS fighting vehicle.\nThe AFU losses were up to 405 Ukrainian troops, three armoured fighting vehicles, seven motor vehicles, two Gvozdika self-propelled artillery systems, and one Nota electronic warfare station.\nThe AFU losses were up to 150 Ukrainian troops, three motor vehicles, two 155-mm Polish-made Krab artillery systems, and two 155-mm British-made FH-70 howitzers.\nThe AFU losses were up to 50 Ukrainian troops, two motor vehicles, one 152-mm D-20 gun, and one 122-mm D-30 howitzer."}, {"id": "973a9dc2-ee08-462d-b4a0-2954999bdaf2", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-16/south-korea-loudspeakers-north-14204857.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "South Korean soldiers work next to a military facility (Green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju, South Korea, June 10, 2024.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nKim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea’s own loudspeakers in the area further diminish the reach of South Korea’s psychological warfare.\nNorth Korea’s broadcasts are less aimed at winning over people in the South and more at “suppressing” the South’s broadcasts by overpowering or muddling the message, he said.\nAt least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "4547fcb3-cf52-4b4e-931f-099c9054c358", "title": "China blasts  dangerous situation  over US military aid to Taiwan", "date": "2024-06-17 17:00", "url": "http://www.myanmarmuslim.net/news/20240618358a599633.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "China has criticised the latest package of US military assistance to Taiwan, saying that such funding was pushing the self-governing island republic into a “dangerous situation”.\nOn Tuesday, the US senate passed 95 billion dollars in war aid to Ukraine, Israel and Taiwan after months of delays and contentious debate over how involved the United States should be in foreign wars.\nThe mainland’s Taiwan Affairs Office said the aid “seriously violates” US commitments to China and “sends a wrong signal to the Taiwan independence separatist forces”.\nThe package covers a wide range of parts and services aimed at maintaining and upgrading Taiwan’s military hardware.\nChina launches daily incursions into waters and airspace around Taiwan by navy ships and warplanes."}, {"id": "311a9b81-7a8a-48f5-a244-d1d22c918fba", "title": "HAL receives RFP from Defence Ministry for procurement of 156 Light Combat Helicopters", "date": "2024-06-17 12:15", "url": "https://economictimes.indiatimes.com/news/defence/defence-ministry-issues-request-for-proposal-for-procurement-of-156-light-combat-helicopters/articleshow/111060293.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIn a bid to push aatmanirbharta in the defence sector, Hindustan Aeronautics on Monday announced that the Defence Ministry has issued a Request for Proposal (RFP) for 156 Light Combat Helicopters.\n\"We would like to inform that, Request for Proposal (RFP) has been issued by the Ministry of Defence for procurement of 156 Light Combat Helicopter ,\" the official statement of the company said.Of the 156 LCH requested by the Defence Ministry, 90 are being procured for the Indian Army (IA) while the remaining 66 are for the Indian Air Force (IAF), said HAL 's official statement.\nThe tender is expected to be worth over Rs 45,000 crore with helicopters to be acquired by the Indian Air Force and Indian Army.Earlier, Defence Ministry Rajnath Singh after assuming charge again for the second straight time announced that the aim will be to further strengthen the security apparatus of the country, with focus on achieving self-reliance in defence manufacturing.\n\"Armed Forces modernisation and the welfare of the soldiers, both serving and retired, will continue to be our main focus,” he said.The LCH, also known as Prachand, has similarities with the Advanced Light Helicopter Dhruv.\nAdditionally, the helicopter can also be used against slow-moving aircraft and remotely piloted aircraft (RPAs) of adversaries.Several key aviation technologies like a glass cockpit and composite airframe structure have been indigenised."}, {"id": "437c53d9-28d4-40e3-a0ff-a7dac3367b34", "title": "Unit 360 Prepares 400 Volunteers Up North Amid Escalating Tension", "date": "2024-06-17 16:15", "url": "https://www.israelnationalnews.com/news/391678", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "As tension escalates in the North, security forces, hospitals, and first responders are equipping themselves in case of an attack.\nRabbi Meir Barel, the Commander of Special Operations of Rescue Unit 360, announced that 400 volunteers are currently positioned in the North, to ensure casualties of battle receive immediate and dignified burials.\nFamilies waited in agony for weeks until the bodies of the family members were located and identified, and should an attack occur in the North, Rabbi Barel is determined to prevent that.\nIn an urgent video message to the public, Rabbi Meir Barel requested help in securing gear for the volunteers.\nReaders can take part in equipping Israel’s first responders in case of an attack, by donating on the Unit 360’s campaign page."}, {"id": "5f604714-eb6a-4e99-9ed7-5eb55b79a36c", "title": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punch – Winnipeg Free Press", "date": "2024-06-17 12:45", "url": "https://www.winnipegfreepress.com/world/2024/06/17/the-war-between-russia-and-ukraine-is-set-to-grind-on-as-a-peace-conference-packs-little-punch", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy walks during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nUkrainian President Volodymyr Zelenskyy, centre, and Fiji's President Wiliame Maivalili Katonivere walk during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"}, {"id": "5c767777-6666-4740-826c-d6ef98fb5a53", "title": "Chael Sonnen Ready To Fight  Overrated  Jorge Masvidal In A Boxing Match", "date": "2024-06-17 00:00", "url": "https://www.lowkickmma.com/chael-sonnen-fight-overrated-jorge-masvidal/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Blasting Jorge Masvidal for his foolish business practices and claiming he couldn’t remember the last time Masvidal won a fight.\nChael Sonnen Speaks on Looming Jorge Masvidal Fight“This whole thing was just part of the process,” Chael Sonnen began, speaking on the Anderson Silva fight (H/T MMA Fighting).\n“I’m boxing Jorge Masvidal.\n“Masvidal’s a little bit overrated, in all fairness, within his own mind,” Chael Sonnen said.\n“It just keeps getting worse for Jorge Masvidal."}, {"id": "cc969710-8c5f-4b50-9489-bedfd12b9c68", "title": "Russia Sets Closed Espionage Trial for US Reporter Gershkovich", "date": "2024-06-17 14:00", "url": "https://www.theepochtimes.com/world/russia-sets-closed-espionage-trial-for-us-reporter-gershkovich-5669897", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "MOSCOW—Russia’s espionage trial of detained Wall Street Journal reporter Evan Gershkovich, who has denied charges of collecting secrets for the CIA, will be held behind closed doors, the trial court said on June 17.\nThe first American journalist to be detained on spy charges in Russia since the Cold War more than three decades ago, Mr. Gershkovich has repeatedly denied the charges.\nThe Journal says that Mr. Gershkovich was doing his job and denied he was a spy.\nRussia said Mr. Gershkovich was caught “red-handed.” President Vladimir Putin has said there has been contact with Washington about potentially swapping Mr. Gershkovich although such negotiations should be held away from the media.\nMr. Putin suggested in February that Mr. Gershkovich could be swapped."}, {"id": "6dae88ea-5d80-4191-be5e-1df9e4772340", "title": "Monolith Wonder Woman Game Details Have Leaked", "date": "2024-06-17 14:00", "url": "https://gameranx.com/updates/id/501374/article/monoliths-wonder-woman-game-details-have-leaked/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "It looks like a Nemesis game will be playable to younger gamers for the first time.\nSome details for Monolith’s Wonder Woman game seem to have leaked.\nHere’s the text of the description:“You are Wonder Woman in this single-player action-adventure game developed by Monolith Productions.\nGiven the DMCAs from WB Games, the publisher inadvertently confirmed that this leak is real.\nWe hope that WB Games also has a trailer reveal scheduled very soon."}, {"id": "fb4e560a-79ad-4dc6-a234-a09ce17ff573", "title": "  Undercover Agents Walked Down The Gazan Street As If It Was Tel Aviv  – The Yeshiva World", "date": "2024-06-17 12:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2290533/undercover-agents-walked-down-the-gazan-street-as-if-it-was-tel-aviv.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Within three hours, the locals helped them find a large house to rent on the street where Argamani was being held.\nOne team consisted of two commandos disguised as a typical Gazan couple – the woman dressed in a long black dress and hijab.\nThe couple walked down the street “with complete confidence as if they were walking down a street in Tel Aviv.\nBehind them walked four more undercover men armed to give them backup.”Five additional undercover officers remained at the rental house as backup.\nOn June 5th, the undercover team still in Nuseirat was instructed to leave the area without arousing suspicion."}, {"id": "ea0adc59-77b3-4f1c-a712-91d8058367d3", "title": "HAL gets over ₹45 , 000 - crore tender for 156 light combat helicopters", "date": "2024-06-17 19:00", "url": "https://article.wn.com/view/2024/06/17/HAL_gets_over_45000crore_tender_for_156_light_combat_helicop/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "In a big boost for Made in India in defence, Hindustan Aeronautics Limited (HAL) on Monday said the Defence Ministry has issued a Request for Proposal (RFP) for 156 Light Combat Helicopters (LCH).\nA HAL light combat helicopter during a flight in Ladakh (HAL) \"In terms of Regulation 30 of the SEBI (Listing... read full story"}, {"id": "025b2a45-15e1-4b9f-a915-305bba95ad03", "title": "Online rumours of civil war in Philippines tied to China covert agenda", "date": "2024-06-17 11:45", "url": "https://www.scmp.com/week-asia/politics/article/3266870/online-rumours-civil-war-philippines-tied-chinas-covert-agenda", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "A recent surge of online rumours about civil war in the Philippines may be linked to China’s attempts to manipulate public opinion amid the South China Sea conflict, reflecting Beijing’s broader disinformation tactics and strategic goals.\nPhoto: APWithin days, more than 60 social media accounts posted about Mindanao’s “independence campaign”, fuelling speculation of conflict and blaming President Ferdinand Marcos Jnr ’s “pro-United States” policy for the rift, the Philippine Star reported.\n“Its excessive claims in the South China Sea, its Belt and Road Initiative, among others, are part of this goal.\nNormally, Beijing resorts to blame-shifting, such as blaming the [Philippines’ coastguard] for the water cannon and collision incidents ,” he said.\nMore importantly, Beijing’s media mouthpieces, like the Global Times and the China Daily, conveniently parrot such narratives."}, {"id": "b7d137e8-1817-4007-be58-beab46a12469", "title": "More than 80 nations back talks to ease path to peace in Ukraine", "date": "2024-06-17 03:30", "url": "https://www.bostonglobe.com/2024/06/16/world/more-than-80-nations-back-talks-ease-path-peace-ukraine/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But Zelensky has long argued that a lasting peace in Ukraine can be achieved only with Russia’s full withdrawal.\nUkraine’s Western allies have said little about possible peace talks with Russia.\nAdvertisementSuch talks, he said, would build on the gathered nations’ endorsement of “the notion of sovereignty and territorial integrity” outlined in the United Nations Charter.\nTo end the war, diplomatic backing could strengthen Ukraine’s hand in eventual peace talks.\nHe said Ukraine was already in talks with countries that had indicated an interest in hosting such a meeting."}, {"id": "a4a4a97e-98ff-4314-847b-aa671dc4effb", "title": "Lesotho : MP Backs Call for State of Emergency to End Famo Killings", "date": "2024-06-17 13:00", "url": "https://allafrica.com/stories/202406170272.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Mr Makhalanyane told the Lesotho Times this week that a state of emergency could be the required solution to empower law enforcement agencies to sweep out the famo gangs.\nMr Makhalanyane encouraged the government to declare a state of emergency for a designated period to enable law enforcement agencies to focus on rooting out the famo gangs.\n\"A week after the legal notice criminalising famo gangs was released, people were killed at different places.\nHe said criminalising famo gangs might have made it more difficult for members of the famo gangs to freely come to the table for fear of being arrested.\nMr Sekonyela said the task team had failed to submit any report regarding the task it had been given."}, {"id": "730e62d8-7be0-4fb9-b3ee-bf3b349f1079", "title": "Despite false Houthi claims , the Ike aircraft carrier fights on", "date": "2024-06-17 15:30", "url": "https://www.yahoo.com/news/despite-false-houthi-claims-ike-144803759.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA — The aircraft carrier Dwight D. Eisenhower may be one of the oldest in the Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\nAfter one false Houthi claim, Hill responded by posting images of cinnamon rolls and muffins in the bakery on board the Eisenhower — a subtle jab at the claims.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nA sailor transports ammunition to a fighter jet on the flight deck of the aircraft carrier Dwight D. Eisenhower in the Red Sea on Tuesday, June 11, 2024.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "efe719c9-c5a9-498d-85bc-8d78175924ad", "title": "Militaries are turning to armed robot dogs", "date": "2024-06-17 15:30", "url": "https://www.yahoo.com/news/militaries-turning-armed-robot-dogs-135409043.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The NewsThe Chinese and US militaries are experimenting with robot “dogs” to work alongside infantry.\nA state-run Chinese news agency released footage of a quadrupedal robot armed with an assault rifle being used in urban-combat training scenarios.\nEarlier videos showed similar dogbots being dropped from drones or launching smoke grenades and other munitions: Chinese researchers claimed one has marksmanship as good as top human sharpshooters.\nMeanwhile, the Pentagon has also outfitted experimental robots with rifles and anti-tank weapons.\nSemi-autonomous dogs are already used in base security and other non-combat applications, but “robotics companies have had an eye on weaponization” for some time, WIRED reported."}, {"id": "a4caddee-7490-4bd2-b793-89c25d1637dc", "title": "Netanyahu criticizes military plans for 11 - hour daily pauses in fighting", "date": "2024-06-17 00:15", "url": "https://www.foxnews.com/us/israeli-prime-minister-netanyahu-criticizes-militarys-plans-daily-pauses-fighting", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu was critical of plans announced Sunday by his military to hold 11-hour pauses in fighting along a main road into Gaza to facilitate getting aid into the bomb-stricken area.\nReuters reported that the Israeli military announced daily pauses in battle from 5 a.m. to 4 p.m. local time between Kerem Shalom Crossing and Salah al-Din Road, then northwards.\nISRAELI WAR CABINET MINISTER BENNY GANTZ QUITS NETANYAHU'S EMERGENCY GOVERNMENTNetanyahu’s reaction highlights heightened political tensions over aid being delivered into Gaza, where international groups have warned of a growing humanitarian crisis.\nBBC ANCHOR ASKS IF ISRAELI FORCES WARNED PALESTINIANS AHEAD OF HOSTAGE RESCUE MISSION: DEFEATS ‘THE PURPOSE’Last Sunday, Israeli war cabinet minister Benny Gantz quit Netanyahu’s emergency government, saying the prime minister was making \"total victory impossible.\"\n\"Months after the October disaster, the situation in the country and in the decision-making cabinet has changed,\" Gantz added."}, {"id": "7513c859-f02a-482e-8595-4bc654d40884", "title": "Lull in Gaza fighting despite blasts in south", "date": "2024-06-17 16:30", "url": "https://gulfnews.com/world/mena/lull-in-gaza-fighting-despite-blasts-in-south-1.103158821", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "GAZA STRIP: Israel struck Gaza on Monday and witnesses reported blasts in the besieged territory’s south, but fighting has largely subsided after a day of relative calm and as Muslims marked Eid al-Adha.\nAt least one strike hit Bureij refugee camp in the central Gaza Strip, residents said.\nMahmud Basal, spokesman for the civil defence agency in the Hamas-ruled territory, said that apart from the deadly Gaza City strikes overnight, “the other areas of the Gaza Strip are somewhat calm”.\nThe Gaza health ministry said on Monday it had recorded 10 deaths over the past 24 hours, in one of the lowest daily tolls since the war began.\nAn Israeli military convoy moves inside Gaz Strip on June 17, 2024."}, {"id": "6c1eb1da-af9d-4ee6-bd41-e7964189abec", "title": "Lull in Gaza fighting as Biden urges truce in Eid message - World", "date": "2024-06-17 11:45", "url": "https://www.brecorder.com/news/40308803/lull-in-gaza-fighting-as-biden-urges-truce-in-eid-message", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "GAZA STRIP: Israel struck Gaza on Monday and witnesses reported blasts in the besieged territory’s south, but fighting has largely subsided after a day of relative calm and as Muslims marked Eid al-Adha.\nBlinken urges Middle East leaders to press Hamas for Gaza ceasefireOn Sunday, the first day of Eid al-Adha, or the feast of the sacrifice, the spokesman said “calm has prevailed across all of Gaza”.\nEgyptian, Qatari and US mediators have been pushing for a new Gaza truce, so far without success.\nWashington has been pressing Israel and Hamas to formally accept Biden’s truce plan, which would allow an initial six-week pause to fighting.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire – demands Israel has repeatedly rejected."}, {"id": "992cefa0-e181-404f-8083-89a03cf95776", "title": "RENK Unveils ATREX Hybrid Transmission System", "date": "2024-06-17 19:00", "url": "http://defense-update.com/20240617_atrex-hybrid-transmission.html", "domain": "defense-update.com", "domain_classification": "Unknown", "message": "At Eurosatory 2024, RENK Group AG introduced its new ATREX transmission system, a groundbreaking hybrid solution for main battle tanks.\nThe ATREX system, short for “Advanced Transmission Electric Cross Drive with Drive-by-Wire,” represents a significant advancement in drivetrain technology for military tracked vehicles.\nAt Eurosatory 2024, RENK is also showcasing its Next Generation Mobility System, featuring an ATREX propulsion system configured for a future battle tank.\nOne of the core innovations of ATREX is its electro-mechanical steering system, which doubles as an electrical propulsion system and a power generator.\nThe ATREX system also introduces new operational capabilities such as Silent Watch, Manoeuvring, and Sprint Boost."}, {"id": "4237511a-3d9d-46d4-a1e6-76e4542980dd", "title": "Israeli High Court suspends State Comptroller probe Into October 7 failures", "date": "2024-06-17 10:30", "url": "https://news.webindia123.com/news/Articles/World/20240617/4206501.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The comptroller, also known as the state ombudsman, periodically releases reports auditing Israeli preparedness and the effectiveness of government policies.\nIn May, High Court Justice Gila Canfy-Steinitz ruled against stopping the State Comptroller's probe.\nEnglman's probe was also opposed by Israel Defense Forces Chief of Staff Lt. Gen. Herzi Halevi as well as the State Attorney's office.\nA separate independent commission of inquiry with a broader mandate including political failures is expected to take place after the war.\nSuch commissions have broader authority to summon witnesses and collect evidence, and are headed by a senior Supreme Court justice."}, {"id": "ead7d089-5cfb-4899-b3e1-e4afb169bc32", "title": "Motorcyclist dies on route to hospital after crash in Battle Creek", "date": "2024-06-17 16:00", "url": "https://wwmt.com/news/local/helmer-beckley-road-motorcycle-crash-battle-creek-woman-curb-witnesses-safety-police-medical-injuries-hospital-public-safety-officers-calhoun-county-west-michigan", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "A 36-year-old motorcyclist died on the way to the hospital after a crash in Battle Creek.\nThe crash happened at the intersection of Beckley Road and Helmer Road at about 3:30 p.m. Friday, according to Battle Creek police.\nCalhoun County:While turning left off of Helmer Road, the motorcyclist struck a curb on the south side of Beckley Road and crashed, police said.\nShe was wearing a full-face helmet.\nPHOTOS:Based on information gathered from witnesses, speed does not appear to be a factor in the crash, according to police."}, {"id": "47176643-406b-40ef-98bf-b30f13b9a4cd", "title": "Lull in Gaza fighting as Biden urges truce in Eid message", "date": "2024-06-17 10:15", "url": "https://www.al-monitor.com/originals/2024/06/lull-gaza-fighting-biden-urges-truce-eid-message", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 17, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israel struck Gaza on Monday and witnesses reported blasts in the besieged territory's south, but fighting has largely subsided after a day of relative calm and as Muslims marked Eid al-Adha.\nA daytime \"pause\" for aid deliveries around a southern Gaza route, announced at the weekend by Israel's military, appeared to be holding on Monday.\nHe reported military movements and gunfire in parts of Rafah as well as Bureij camp in central Gaza.\nThe Gaza health ministry said on Monday it had recorded 10 deaths over the past 24 hours, in one of the lowest daily tolls since the war began.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected."}, {"id": "53b31b5c-0284-43b9-bb90-e036353b8fcd", "title": "  House of the Dragon  Character Scorecard : Season 2 Premiere", "date": "2024-06-17 03:30", "url": "https://www.vulture.com/article/house-of-the-dragon-season-2-premiere-characters-ranking-scorecard.html", "domain": "vulture.com", "domain_classification": "Unknown", "message": "Rhaenyra and Alicent grieve and contemplate and try to prevent the men in their lives from setting the world on fire.\nSo let’s assess our most and least valuable players as the Dance of the Dragons kicks off in earnest.\n— Tries to have his chaotic counterpart killed but hires two idiots who mess it up and kill someone else.\nThink about it all for a second: His son married Rhaenyra and then “died” — a faked death, but still — under mysterious circumstances.\nBut I’m going to go with “the instant he kicked the dog.”Did I think it was going to escalate from there straight to beheading a child in front of his mother?"}, {"id": "6e802b76-1367-4721-a18a-b14be13d35b1", "title": "The Substitute : An Underrated 90s Action Gem ? ", "date": "2024-06-17 19:00", "url": "https://www.joblo.com/the-substitute-an-underrated-90s-action-gem/", "domain": "joblo.com", "domain_classification": "Unknown", "message": "In the 80s and 90s, an interesting cycle of inspirational teacher movies was being made.\nThen, there were the more fanciful, tough-guy teacher movies, like Nick Nolte’s Teachers and James Belushi’s underrated The Principal.\nBut of all these movies, the most badass, by far, is a little movie called The Substitute starring Tom Berenger.\nTom Berenger is an interesting case of a guy who came very close to becoming a movie star but never quite crossed over.\nMarc Anthony, before he became better known as a pop star, plays the student drug-dealing kingpin, head of a gang called the KOD."}, {"id": "610b4553-e47b-4dbc-83e9-44b8a989e53a", "title": "House Of The Dragon Season 2 Bloody New Title Sequence Is Based On A Real Work Of Art", "date": "2024-06-17 17:15", "url": "https://www.gamespot.com/articles/house-of-the-dragon-season-2s-bloody-new-title-sequence-is-based-on-a-real-work-of-art/1100-6524320/", "domain": "gamespot.com", "domain_classification": "Unknown", "message": "Viewers got their first look at Episode 1 (entitled \"A Son For A Son\") over the weekend, and the episode naturally kicked off with an intro sequence featuring the series' iconic theme song.\nJust like Season 1, Season 2 starts each episode off with a bloody (yet undeniably beautiful) animation sequence, but the visuals have been completely changed for the new season.\nKnown as The Dance Of Dragons, that war is now in full-swing, and the new season's title sequence is no less bloody than the last.\nThe intro sequence currently features various moments from Targaryen history, like The Doom Of Valyria (which left House Targaryen as the only remaining dragon-riders) and Aegon's conquest of Westeros.\nThe franchise's various intro sequences are known to change over time as each season progresses, so it's likely that viewers will see new events depicted on the tapestry as Season 2 continues."}, {"id": "4e4bb10a-a899-4a07-8671-9f71c1edc441", "title": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punch | iNFOnews", "date": "2024-06-17 12:45", "url": "https://infotel.ca/newsitem/eu-russia-ukraine-war/cp957260031", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punchUkrainian President Volodymyr Zelenskyy, centre, and Fiji's President Wiliame Maivalili Katonivere walk during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nIt did not resolve the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"}, {"id": "04e78abe-d55d-47d4-94fb-dabd5cf1509a", "title": "Brazil and French Guiana coordinating to combat illegal mining", "date": "2024-06-17 15:30", "url": "https://www.bnamericas.com/en/news/brazil-and-french-guiana-coordinating-to-combat-illegal-mining", "domain": "bnamericas.com", "domain_classification": "Unknown", "message": "Brazil and French Guiana are planning to coordinate and ramp up measures to combat illegal mining.\nBrazilian President Luiz Inácio Lula da Silva met his French counterpart Emmanuel Macron on the sidelines of the G7 meetings in Italy to discuss collaboration between the countries in combating illegal mining in Brazil and the French department.\nFrench Guiana borders the northern Brazilian state of Amapá, a part of the country that has historically seen significant illegal mining by garimpeiros, as they are known in Brazil.\nDuring Macron's visit to Brazil in March, \"Brazil and France signed an agreement to combat threats to security and the environment, and health risks affecting the cross-border region,\" the Brazilian government said in a statement.\nRaul Jungmann, head of Brazilian mining association Ibram and former national defense minister, has made it one of his priorities at Ibram to call on the government to make more effort to tackle illegal mining in the north of the country."}, {"id": "f35abb97-dd19-4d5d-b2ac-6c8e7c1bcad4", "title": "McDonald plans to reduce litter at Mousehold Lane site", "date": "2024-06-17 19:00", "url": "https://www.edp24.co.uk/news/24391272.mcdonalds-plans-reduce-litter-mousehold-lane-site/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "This is part of a five-step plan released by the fast-food giant to combat fears from locals that its controversial site in Mousehold Lane will remain \"clear of litter\".\nConcerns were raised by people living near to the Mousehold Lane site about the increase in litter (Image: Newsquest)It says: \"Managers should walk local roads, footpaths and parks at different times of the day and evening\" looking for where litter is being left and the time of the day it starts piling up.\nREAD MORE: 'Death trap' changes to controversial roundabout criticisedIt added staff will be checking \"a minimum of 100 metres in all directions\" around the restaurant.\nMcDonald's has outlined its management plan to combat litter in the area (Image: Newsquest)As well as litter, people living nearby are also convinced the drive-through restaurant's traffic will make the \"dangerous\" Mousehold Lane junction, next to the M&S petrol station, even worse.\nThe new site for McDonald's in Mousehold Lane (Image: Newsquest)"}, {"id": "7233d35b-1ca6-43ea-86e1-d4a042755583", "title": "IAF contingent participates in Exercise Red Flag 2024 at Alaska", "date": "2024-06-17 00:15", "url": "https://news.webindia123.com/news/Articles/India/20240617/4206385.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "An Indian Air Force (IAF) contingent participated in Exercise Red Flag 2024, conducted at Eielson Air Force Base, Alaska, of the United States Air Force, from June 4 to June 14, the Ministry of Defence said in a release on Sunday.\nThis was the second edition of Exercise Red Flag 2024, which is an advanced aerial combat training exercise held four times a year by the US Air Force.\nAccording to the release, the exercise witnessed the participation of the Indian Air Force along with the Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), German Luftwaffe, and the US Air Force (USAF).\nRed Flag is an air combat exercise conducted with multiple scenarios designed to provide realistic combat settings.\nEnriched with the Red Flag exercise experience, the IAF keenly looks forward to hosting the participating contingents from other countries during Ex-Tarang Shakti-2024, which is the first-ever Indian multinational air exercise to be held later this year, the release added."}, {"id": "bea6920c-a9ad-4d60-90a6-d3219b08f7c7", "title": "Trump Tariff Plan to End Income Tax Means Stagflation , Trade Wars", "date": "2024-06-17 19:00", "url": "https://www.businessinsider.com/trump-tariff-income-tax-proposal-stagflation-yellen-summers-trade-war-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Trump's idea to replace the US income tax with tariffs notched criticism from two treasury secretaries.\n\"This is a prescription for the mother of all stagflations,\" former secretary Larry Summers told Bloomberg TV.\nSecretary Janet Yellen noted that it would make life unaffordable for Americans.\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nThe idea, floated by Donald Trump to Republicans last week, would be to slash income taxes by raising tariffs on imports."}, {"id": "b7435c8d-5f15-4083-a3de-f9d26e55f03f", "title": "PD : Motorcyclist dies after crashing into curb in Battle Creek", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/pd-motorcyclist-dies-crashing-curb-013310630.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PD: Motorcyclist dies after crashing into curb in Battle CreekBATTLE CREEK, Mich. (WOOD) — The driver of a motorcycle died Sunday afternoon after crashing, according to police.\nAround 3 p.m., Battle Creek Police were called to the intersection of Beckley Road and Helmer Road S for a crash.\nOfficers found that the driver, a 36-year-old woman, was headed south on Helmer Road, turning left onto eastbound Beckley Road when she hit the southside curb of Beckley.\nShe was taken to the hospital but died in the ambulance while enroute, according to police.\nFor the latest news, weather, sports, and streaming video, head to WOODTV.com."}, {"id": "47643304-39c6-4440-a2b8-c7ab3a9c64cd", "title": "Russia sets closed espionage trial for US reporter Gershkovich", "date": "2024-06-17 09:30", "url": "https://www.swissinfo.ch/eng/russia-sets-closed-espionage-trial-for-us-reporter-gershkovich/80921797", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia sets closed espionage trial for US reporter Gershkovichreuters_tickers4 minutesBy Guy FaulconbridgeMOSCOW (Reuters) -Russia’s espionage trial of detained Wall Street Journal reporter Evan Gershkovich, who denies charges of collecting secrets for the U.S. CIA, will be held behind closed doors, the trial court said on Monday.\nThe first American journalist to be detained on spy charges in Russia since the Cold War more than three decades ago, Gershkovich has denied the charges.\nThe Journal says Gershkovich was doing his job and denies he is a spy.\nU.S. State Department spokesperson Matthew Miller told reporters the U.S. was concerned that the trial was to be held behind closed doors.\nRussia said Gershkovich was caught “red-handed”."}, {"id": "0fc881e8-823f-4c9c-8081-2026449301a9", "title": "Repeated Western narratives of China nuclear  threat  are what lead to a dangerous world", "date": "2024-06-17 15:15", "url": "https://www.globaltimes.cn/page/202406/1314282.shtml", "domain": "globaltimes.cn", "domain_classification": "Unknown", "message": "While giving a stark warning about the threat from China, he said a world where countries like China have nuclear weapons, and NATO does not, is \"a more dangerous world.\n\"What truly constitutes a dangerous world is the world's largest war machine hyping a nuclear war that could bring devastating consequences to mankind.\nStoltenberg is telling the world that NATO would go beyond being just a conventional combat force, and become a nuclear alliance.\nStrength can be best reflected by the nuclear weapons China owns.\nIf the US and NATO do not want to live in a dangerous world, they should start by changing their own perception of China."}, {"id": "a2611b02-0b42-4fd9-b8cb-8935a8d98e2f", "title": "Israel plan for  tactical pause  for aid raises questions and deepens rifts . Here what we know", "date": "2024-06-17 16:45", "url": "https://www.yahoo.com/news/israel-plan-tactical-pause-aid-154441015.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel’s plan for ‘tactical pause’ for aid raises questions and deepens rifts.\nThe IDF said the “humanitarian pause” is meant to help the UN collect and distribute aid at its crossings, where Israel has said aid is piling up.\nCOGAT said on Sunday that there are 1,000 humanitarian aid trucks on the Gazan side of the Kerem Shalom crossing waiting to be collected and distributed.\n- Ashraf Amra/Anadolu/Getty ImagesLand crossings, which aid groups say are the most effective way of getting aid into Gaza, remain limited.\nThe Government Media Office (GMO) in Gaza has denied that a “tactical pause” is now in effect in the southern Gaza Strip."}, {"id": "84ff6780-2dc4-4e21-b5e5-57a1122f1055", "title": "Pirate - Themed Action Game Captain Blood Releases This Fall for All Major Platforms", "date": "2024-06-17 17:00", "url": "https://www.vgchartz.com/article/461457/pirate-themed-action-game-captain-blood-releases-this-fall-for-all-major-platforms/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Pirate-Themed Action Game Captain Blood Releases This Fall for All Major Platforms - News/ 349 Viewsby, posted 4 hours agoPublisher SNEG and developers Seawolf Studio and General Arcade announced the pirate-themed action game set on the Spanish Main in the 17th century, Captain Blood, will launch for the PlayStation 5, Xbox Series X|S, Nintendo Switch, PlayStation 4, Xbox One, and PC via Steam this Fall.\nCaptain Blood is a pirate-themed action game set on the Spanish Main in the 17th century, where you step into the boots of a fearsome pirate on a quest for gold and glory.\nKey Features:Epic Pirate Shenanigans: As Captain Blood, live the life of the bravest and most fearsome pirate on the Spanish Main (or at least fake it convincingly).\nAs Captain Blood, live the life of the bravest and most fearsome pirate on the Spanish Main (or at least fake it convincingly).\nDive into fiery hand-to-hand combat and show enemy pirates and landlubbers alike who’s the boss with various slick combat techniques."}, {"id": "4c12299f-fac8-41a0-8ed5-647f4941055c", "title": "Spending on nuclear weapons hit $91 . 4 billion in 2023 , watchdog finds", "date": "2024-06-17 10:15", "url": "https://www.voanews.com/a/spending-on-nuclear-weapons-hit-91-4-billion-in-2023-watchdog-finds/7658631.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "ICAN reports the United States spent $51.5 billion, “more than all the other nuclear-armed countries put together.” It says the next biggest spender was China at $11.8 billion with Russia spending the third largest amount at $8.3 billion.\nThe combined total of the five other nuclear powers, France, India, Israel, Pakistan, and North Korea, amounted to $11.6 billion last year.\nThe authors of the report say companies involved in the production of nuclear weapons received new contracts worth just less than $7.9 billion in 2023.\nAnalysis of data gathered over the past five years shows that the nuclear-armed states collectively spent $387 billion on their nuclear arsenals.\nIn fact, it is threatening people wherever they live.”Arms control experts share these concerns and warn of the dangers of a new arms race as the nuclear powers build up their arsenals in defiance of the spirit of the Treaty on the Non-Proliferation of Nuclear Weapons, which aims to prevent the spread of nuclear weapons and weapons technology."}, {"id": "41987309-98fb-4156-8d8c-88688fac7d61", "title": "S . Korea , China To Hold  2+2  Diplomatic Security Talks On Tuesday", "date": "2024-06-17 12:00", "url": "https://menafn.com/1108340778/SKorea-China-To-Hold-22-Diplomatic-Security-Talks-On-Tuesday", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The South Korea-China and security dialogue will take place in Seoul on Tuesday, led by First Vice Foreign Kim Hong-kyun and Chinese Vice Foreign Minister Sun Weidong, Seoul's Foreign Ministry said.\nThe talks draw attention as they will likely coincide with Putin's visit to North Korea widely expected to take place from Tuesday through Wednesday.\nSouth Korea responded by resuming the propaganda loudspeaker broadcasts toward North Korea.\nThe current security landscape and developments on and around the Korean Peninsula will likely be high on the agenda at Tuesday's talks.\nThe previous talks took place among the director generals in 2013 and 2015."}, {"id": "e5860408-3d0d-4d77-94c0-9a2fea6bd644", "title": "Putin makes trip to Russian military HQ close to border with Ukraine", "date": "2024-06-17 16:45", "url": "http://www.myanmarmuslim.net/news/20240618791e599204.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian president Vladimir Putin visited the southern military district headquarters in Rostov-on-Don as he assessed the state of his country’s forces in Ukraine as the war drags on toward winter.\nVideo shared by a Russian state news agency showed Mr Putin being greeted late on Thursday by defence minister Sergey Shoigu and Valery Gerasimov, chief of the general staff.\nShortly after Putin’s visit to the military headquarters, Kremlin spokesperson Dmitry Peskov said Russia was pressing ahead with its goals in Ukraine.\n“In the absence of conditions for a political-diplomatic settlement, we are continuing the special military operation,” Mr Peskov said.\nAround the time that Putin was visiting his southern military headquarters, Russia launched a drone attack on Ukraine."}, {"id": "7985dd8d-59ff-40e1-ade3-efeef3d3d4a3", "title": "  House of the Dragon  Season 2 Episode 1 Recap :  A Son For A Son  ", "date": "2024-06-17 03:00", "url": "https://decider.com/2024/06/16/house-of-the-dragon-season-2-episode-1-recap/", "domain": "decider.com", "domain_classification": "Unknown", "message": "Remember the stirring tracking shot that closed out season 1 of House of the Dragon?\nRhaenyra’s husband-uncle Prince Daemon Targaryen (Matt Smith) is raring to incinerate enormo-dragon Vhagar and Prince Aemond Targaryen (Ewan Mitchell), her one-eyed rider.\n“A son for a son.” Go off, Daemon, you ruthless weirdo.\nBefore anything else, she is compelled to see where Lucerys “Luke” Velaryon and his dragon Arrax bought it.\nstream 'house of the dragon' for free Max is currently offering a one-week free trial to new subscribers."}, {"id": "f41ff496-8488-4582-9062-050f6d2bc4af", "title": "  House of the Dragon : Key Targaryens , events and deaths to know ahead of Season 2", "date": "2024-06-17 15:15", "url": "https://www.columbian.com/news/2024/jun/17/house-of-the-dragon-key-targaryens-events-and-deaths-to-know-ahead-of-season-2/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "When her uncle Daemon, now loyal to Viserys, returns to King’s Landing, they form a powerful connection.\nRhaenyra eventually has three sons during her marriage to Leanor, but their lineage is questioned because both spouses pursue relationships outside their marriage — Rhaenyra with Ser Harwin Strong and Laenor with men including Ser Joffrey Lonmouth.\nBut with each new marriage and birth, these alliances shift and their individual claims to the throne grow more complicated.\nMeanwhile in Dragonstone, Rhaenyra learns that her father has died and her half brother Aegon has ascended to the throne.\nBut tragedy strikes when Lucerys and his dragon Arrax are killed by Vhagar, the unruly dragon belonging to Aemond Targaryen, Aegon’s younger brother."}, {"id": "92574cdb-0a4d-46a3-bf0b-4f1e1c89d872", "title": "Almost 10 years later , a sequel to cult horror movie Circle is in the works", "date": "2024-06-17 16:45", "url": "https://www.gamesradar.com/entertainment/horror-movies/circle-sci-fi-horror-movie-getting-surprise-sequel-10-years-later/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "Cult horror movie Circle is getting a surprise sequel.\nAdditionally, every two minutes, a person is killed at random unless the group vote (and agree) on a specific victim to be sacrificed.\n\"After being pawns in a cruel game of psychological warfare, the survivors of an invasion face a new threat,\" the synopsis reads.\nNardelli, who played Eric in the first film, is re-teaming with Brent Stiefel to produce the flick, while The Flash actor Devon Graye is writing the script.\nGiven the premise of the movie, and their subsequent fates, it's highly unlikely that any of the cast outside Nardelli will return."}, {"id": "8e1b1ecf-7ed2-49b2-ae81-fee353e9fcc0", "title": "UK elections 2024 : Clashing pro - Gaza candidates boost Labour chances in Blackburn", "date": "2024-06-17 17:00", "url": "https://www.middleeasteye.net/news/uk-clashing-gaza-labour-chances-blackburn", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "In May's local elections, Labour lost a third of its vote share in areas with Muslim majorities.\nThe Workers Party candidate was visibly aggrevated by the situation, though he kept calm and courteous.\nBut independent candidate Adnan Hussain is not convinced.\n“He’s shown no evidence,” Hussain told MEE.\n\"An independent candidate will promise everything and deliver nothing,\" she said, describing herself as the \"only candidate with a proven record for delivering on all the issues that matter to our community\"."}, {"id": "35408d9f-3932-42b8-b561-5ba01a3a538d", "title": "Israeli military says it has carried out small raids into Gaza Strip", "date": "2024-06-17 16:00", "url": "http://www.myanmarmuslim.net/news/20240617101f599893.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The Israeli military has said for the first time that ground troops have been operating inside the Gaza Strip.\nIsrael has been massing troops along the Gaza border since last Saturday’s deadly incursion by Hamas militants.\nIsrael has been pounding Gaza with airstrikes since Hamas militants carried out the unprecedented cross-border attack, killing more than 1,300 people in a brutal rampage.\nAnd in a statement on Friday, Egypt’s Foreign Ministry condemned the Israeli army’s decision to tell people in Gaza to evacuate.\nThe world body earlier warned of “devastating humanitarian consequences” after the Israeli military told the entire population of northern Gaza to leave."}, {"id": "ae0f3665-c95d-4447-acb3-88cbd8f5c1c3", "title": "Heated financial mismatch for Claudia Tenney , Mario Fratto", "date": "2024-06-17 14:00", "url": "https://buffalonews.com/news/local/government-politics/claudia-tenney-mario-fratto-new-york-24th-congressional-district/article_51517dd4-2a5e-11ef-8b9d-bfb01ce199d6.html", "domain": "buffalonews.com", "domain_classification": "Unknown", "message": "For both Tenney and Fratto, it's a question of character in 24th Congressional GOP primary The Tenney-Fratto battle in New York's 24th Congressional District is not exactly a battle of ideas.\nSo why are Republican establishment forces spending money on Tenney’s behalf while she is spending so much on her own?\n“I think they’re in trouble,” Fratto said of the Tenney campaign.\nFor example, they can consider the fact that as of June 5, the Tenney campaign had spent $1.56 million so far in this election cycle.\nEven amid her primary spending spree, she had $552,189 in her campaign war chest."}, {"id": "46b55ea0-11ed-472e-af6e-4a2b703f88bb", "title": "Post Fire : More than 1 , 200 campers evacuated due to explosive wildfire on the Grapevine in Los Angeles County", "date": "2024-06-17 17:15", "url": "https://abc30.com/post/post-fire-more-1200-campers-evacuated-due-explosive/14964836/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Valley firefighters continue to assist with battling Post Fire in Los Angeles CountyFresno County crews and other firefighters from across Southern California are helping battle the Post Fire, burning along the Grapevine.\nFresno County crews and other firefighters from across Southern California are helping battle the Post Fire, burning along the Grapevine.\nFresno County crews and other firefighters from across Southern California are helping battle the Post Fire, burning along the Grapevine.\nFresno County crews and other firefighters from across Southern California are helping battle the Post Fire, burning along the Grapevine.\nIn a social media post, Kings County Firefighters announced Sunday they were heading to help battle the Post Fire."}, {"id": "1b2c6161-751a-4e99-84e5-76c487497674", "title": "Circles : 2015 sci - fi thriller Circle is getting a sequel", "date": "2024-06-17 19:00", "url": "https://www.joblo.com/circle-sequel/", "domain": "joblo.com", "domain_classification": "Unknown", "message": "Now Variety has broken the news that Circle is getting a sequel called Circles , with the first film’s star Michael Nardelli (The Collection) coming back to produce the follow-up with Brent Stiefel.\nIf you need a refresher, Circle had the following synopsis: In a massive, mysterious chamber, fifty strangers awaken to find themselves trapped with no memory of how they got there.\nDevon Graye, who wrote the Helen Hunt thriller I See You and worked on season 2 of the Starz series The Girlfriend Experience, is writing the screenplay for Circles.\nI have definitely never seen it – but since it apparently has a cult following, I’m glad its fans are going to have the chance to see a sequel.\nAre you a fan of Circle, and are you glad to hear that a sequel called Circles is coming down the line?"}, {"id": "91d6b454-f3ff-4409-94ec-38c1c9c88a01", "title": "Sunak briefed as Russian submarine spotted off coast of Scotland", "date": "2024-06-17 16:15", "url": "https://www.yahoo.com/news/sunak-briefed-russian-submarine-spotted-152728550.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russian nuclear-powered submarine Kazan, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbour - ADALBERTO ROQUE/AFP via Getty ImageRishi Sunak was briefed by the Ministry of Defence (MoD) after a Russian submarine, Kazan, was sighted off Scotland’s west coast last week near Britain’s naval base at Faslane.\nA Russian missile attack on Ukraine’s east-central Poltava region on Monday damaged several apartment blocks and injured at least nine people.\nA new “Frankenstein” air defence tank designed to shoot down Russian drones and missiles is to be supplied to Ukraine by a top German arms firm.\nThe Security Service of Ukraine (SBU) said it had destroyed 1,006 Russian tanks since the start of the war.\nMr Syrsky’s comments came just hours after a Russian missile attack in Ukraine’s Poltava region left nine injured."}, {"id": "fdcd6a6a-f338-4e69-90c6-38827fa9694c", "title": "Russia holds closed - door espionage trial for WSJ reporter", "date": "2024-06-17 15:00", "url": "https://www.biznews.com/global-citizen/2024/06/17/russia-closed-door-trial", "domain": "biznews.com", "domain_classification": "Unknown", "message": "Wall Street Journal reporter Evan Gershkovich’s espionage trial in Russia will be held behind closed doors, the court announced.\nThe U.S. government calls the charges “ridiculous” and demands his release, highlighting the severe risks journalists face in conflict zones.\nBy Guy FaulconbridgeRussia’s espionage trial of detained Wall Street Journal reporter Evan Gershkovich, who denies charges of collecting secrets for the Central Intelligence Agency (CIA), will be held behind closed doors, the trial court said on Monday.\nThe first American journalist to be detained on spy charges in Russia since the Cold War more than three decades ago, Gershkovich has repeatedly denied the charges.\nThe enterprise sits at the heart of the Urals region, where Russia conducts some of its most secret weapons production and research."}, {"id": "b74cc006-09ef-4913-9031-27f1ed148907", "title": "All Destiny 2 Exotic missions in release order", "date": "2024-06-17 15:30", "url": "https://www.destructoid.com/all-destiny-2-exotic-missions-in-release-order-listed/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "It’s easy to forget, then, that there’s a third important category of challenging content in this game, too: Exotic missions.\nNo, our topic for the day is specifically Exotic missions.\nSo, from those legends onward, here’s the full and comprehensive list of all of Destiny 2‘s Exotic missions in the order of their release!\nAll Destiny 2 Exotic missions in the order of releaseImage via Bungie#1: The Whisper – July 2018 (Original) / April 2024 (Reprised)The ultimate blueprint that all the other Exotic missions are compared with, The Whisper came about mostly as a surprise in the early years of Destiny 2‘s lifecycle.\nImage via Dorje Bellbrook#12: Starcrossed – November 2023The second Exotic mission set in the Black Garden, Starcrossed plays host to the admittedly middling Wish-Keeper Exotic bow."}, {"id": "4708aede-1dbf-4ac1-9170-51a5cdd3a49f", "title": "IAF Rafales Roar in Alaska , Execute Complex Missions With F - 16s , F - 15s At Red Flag War Drills", "date": "2024-06-17 11:00", "url": "https://www.news18.com/world/iafs-rafales-roar-in-alaska-execute-complex-missions-with-f-16s-f-15s-at-red-flag-war-drills-8934960.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The key takeaways from participating in the Red Flag exercise for the IAF included insight on interoperability with international partners and a collaborative understanding of missions in a multinational environment, the defence ministry said on Sunday.\nIndian Air Force has successfully completed its participation in Exercise Red Flag 2024 conducted by @usairforce at Eielson Air Force Base, #Alaska.\nIAF’s #Rafale aircraft took part in this multi-nation advanced aerial combat exercise for the first time.\nBesides the Indian Air Force (IAF), the exercise witnessed the participation of the Republic of Singapore Air Force (RSAF), the UK’s Royal Air Force (RAF), the Royal Netherlands Air Force (RNLAF), the German Luftwaffe, and the US Air Force (USAF).\nThis was the first time the IAF Rafale aircraft participated in this exercise."}, {"id": "7f9e17cd-b9f5-41fa-a8b3-6e4a1b45b01b", "title": "China and Russia are supporting each other  expansionism  ", "date": "2024-06-17 16:45", "url": "https://www.yahoo.com/news/china-russia-supporting-other-expansionism-151413179.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wu called on democracies to align in countering Russia and China’s military assertiveness in Europe, the South China Sea and beyond.\nWu warned about the risk of a potential conflict in the South China Sea, a resource-rich area and key transit route for global trade, where China has overlapping territorial claims with several of its neighbors.\nWu said tensions in the South China Sea are “more dangerous” than those in the Taiwan Strait, and they indicate China’s ambition to project power in the region.\n“And I think … we shouldn’t lose the vision that the expansionism of authoritarianism is everywhere in the Indo-Pacific.”Wu said joint military drills between China and Russia in the region raise tensions in Japan and other neighboring countries.\n“We don’t provoke the other side of the Taiwan Strait, and we don’t bow to the pressure,” Wu said."}, {"id": "b75d92c3-79b9-43a6-ae13-e9e54a2ec24f", "title": "Read Receipt ( 06 / 17 / 24 - FULL SHOW ) | 99 . 3 The Buzz", "date": "2024-06-17 18:30", "url": "https://993thebuzz.iheart.com/featured/tino-cochino-radio/content/2024-06-17-270-the-tino-cochino-podcast-read-receipt-061724-full-show/?pname=www.993thebuzz.com&sc=dnsredirect", "domain": "993thebuzz.iheart.com", "domain_classification": "Unknown", "message": "Tino continues to battle a hoarse voice, Matt says your partner should ALWAYS have full access to your phone, Are You Smarter Than Nicasio, and Serina reveals her flexibility..."}, {"id": "d32b65b3-f677-4e50-b3a2-cf50d4968864", "title": "Read Receipt ( 06 / 17 / 24 - FULL SHOW ) | Wild 104", "date": "2024-06-17 18:15", "url": "https://wild104.iheart.com/featured/tino-cochino-radio/content/2024-06-17-270-the-tino-cochino-podcast-read-receipt-061724-full-show/", "domain": "wild104.iheart.com", "domain_classification": "Unknown", "message": "Tino continues to battle a hoarse voice, Matt says your partner should ALWAYS have full access to your phone, Are You Smarter Than Nicasio, and Serina reveals her flexibility..."}, {"id": "0cdf315d-7340-4ef2-9ac6-9704765adcd9", "title": "Read Receipt ( 06 / 17 / 24 - FULL SHOW ) | 104 . 7 KISS FM Phoenix", "date": "2024-06-17 19:00", "url": "https://1047kissfm.iheart.com/featured/tino-cochino-radio/content/2024-06-17-270-the-tino-cochino-podcast-read-receipt-061724-full-show/", "domain": "1047kissfm.iheart.com", "domain_classification": "Unknown", "message": "Tino continues to battle a hoarse voice, Matt says your partner should ALWAYS have full access to your phone, Are You Smarter Than Nicasio, and Serina reveals her flexibility..."}, {"id": "1068fcf3-96bc-4c0e-ad5a-3457dcf4bee2", "title": "Watch The Killers play  Battle Born  for the first time in 11 years", "date": "2024-06-17 13:00", "url": "https://www.nme.com/news/music/watch-the-killers-play-battle-born-for-the-first-time-in-11-years-3766079", "domain": "nme.com", "domain_classification": "Unknown", "message": "The Killers played their song ‘Battle Born’ for the first time in 11 years at their show in Dublin over the weekend – watch the footage below.\nAdvertisementTo round off the evening, the group played an extended version of the ‘Battle Born’ title track – marking its first appearance in the setlist since 2013.\nSee the performance of ‘Battle Born’ below, along with more fan-shot videos from the show.\nThe Killers are scheduled to play four gigs at the Co-Op Live arena in Manchester this week ahead of three dates at Glasgow’s OVO Hydro.\nJUNE18 – Co-Op Live, Manchester19 – Co-Op Live, Manchester21 – Co-Op Live, Manchester22 – Co-Op Live, Manchester25 – OVO Hydro, Glasgow26 – OVO Hydro, Glasgow27 – OVO Hydro, GlasgowJULY04 – The O2, London05 – The O2, London07 – The O2, London08 – The O2, London10 – The O2, London11 – The O2, London"}, {"id": "df7b6655-197b-431d-ae35-9b5c6df6a6f2", "title": "House of the Dragon season two filming locations and where to find them", "date": "2024-06-17 17:15", "url": "https://www.bbc.co.uk/news/articles/cw990r91lppo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The second series of the hit fantasy series House of the Dragon debuted in the UK on Monday, with the Welsh landscape taking centre stage.\nThe Game of Thrones spin-off filmed in eight locations across north Wales last year.\nThe five-week shoot included valleys and quarries as a suitably ominous backdrop for the HBO show's fictional kingdom of Westeros.\n“I had no hesitation in taking House of the Dragon there... and we were blessed with the most glorious weather too.\nThank you, Wales!”So where in Wales was House of the Dragon series two filmed?"}, {"id": "265a9986-55a7-4b84-ba48-df09990b4472", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://995thefox.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "995thefox.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "70827a6c-6557-47b9-8254-f6fbd94c0335", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://rock1067.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "rock1067.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "36037968-1325-4216-85b5-db6a3d3e7542", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://wqmf.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "wqmf.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "2aed4ab6-785c-4827-ba17-5feafebdc6bd", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1015.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1015.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "c88c3d8b-4f63-4b9d-b7dd-cfd94c32da43", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://newstalk1049.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "newstalk1049.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "f62e2063-0fe5-468f-8afa-76a2c98ac897", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://kiss1027fm.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "kiss1027fm.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "802e53c8-1c28-4018-8683-0571671b1256", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://ktok.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "ktok.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "db2749ba-b976-48b1-9296-f0c0d2473eec", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://941zbq.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "941zbq.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "b7acfaeb-8105-4260-b85f-8042aae44c75", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://z107fm.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "z107fm.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "a1786cc5-c1c5-4962-b638-b8f22a784686", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1061fmtalk.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}]