[{"id": "fcba31f0-d463-4822-9aab-13c3c3a162a6", "title": "Here are projected rain totals for Carolinas amid Tropical Storm Debby", "date": "2024-08-08 12:45", "url": "https://www.wbtv.com/2024/08/08/here-are-projected-rain-totals-carolinas-amid-tropical-storm-debby/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Thursday, Aug. 8 released updated projections of rain totals and Tropical Storm Debby’s trajectory for the next few days.\nRain totals near 30 inches were initially possible in South Carolina near Charleston, according to the National Hurricane Center.\nParts of North, South Carolina to see most rainSoutheast North Carolina and northeast South Carolina were projected to see the most rain on Thursday and Friday -- though central Virginia could also see significant rainfall.\n(National Hurricane Center)The western parts of the Carolinas should see much less rain this week.\nThe coast along the Carolinas could see 1-3 feet of storm surge amid Tropical Storm Debby, the National Hurricane Center posted on Aug. 7, 2024."}, {"id": "e99d5f91-66eb-4dad-a40c-46efcf27dff8", "title": "Debby Path Tracker : What to expect in New Hampshire as storm moves west", "date": "2024-08-08 16:45", "url": "https://news.yahoo.com/news/debby-path-tracker-expect-hampshire-135724971.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "A graphic illustrating the predicted impacts of Hurricane Debby in the northeast for this weekend.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThe hurricane center uses only the top four or five highest-performing models to help make its forecasts.\nThis article originally appeared on wickedlocal.com: Debby Path: Tropical Storm Debby moves west."}, {"id": "00ba2646-016f-43e2-8a0f-5ed693ead24c", "title": "Debby Path Tracker : Tropical Storms moves west changing RI forecast . What to expect", "date": "2024-08-08 14:45", "url": "https://news.yahoo.com/news/debby-path-tracker-tropical-storms-132547909.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "With Tropical Storm Debby veering to the west, the weekend forecast in Rhode Island is looking much better than it previously did.\nThe latest rainfall predictions maps from the National Hurricane Center show Rhode Island getting less than an inch.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on wickedlocal.com: Tropical Storm Debby Update: RI weather forecast changes."}, {"id": "2c3c7521-89f6-482e-8b2f-f9cc113b5580", "title": "Tropical Storm Debby : Latest forecast track as it makes second landfall in South Carolina , drenching East Coast", "date": "2024-08-08 13:15", "url": "https://www.yahoo.com/news/tropical-storm-debby-latest-forecast-track-as-it-makes-second-landfall-in-south-carolina-drenching-east-coast-144015484.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The slow-moving storm still poses a \"major flood threat\" for parts of the mid-Atlantic and Northeast, forecasters say.\nA South Carolina resident cleans up around his house after Tropical Storm Debby hit the area.\nAccording to an update from the National Hurricane Center on Thursday, Debby was moving north through the Carolinas after making landfall near Charleston.\n(Mic Smith/AP)Rain and storm surge, forecasters say.\nWhat other areas could see impacts from Tropical Storm Debby?"}, {"id": "e89011c4-0177-4d1b-87d7-e3534e66ac4e", "title": "Gov . Kemp extends state of emergency through next week for all of Georgia", "date": "2024-08-08 19:45", "url": "https://www.yahoo.com/news/gov-kemp-extends-state-emergency-182516756.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kemp extends state of emergency through next week for all of GeorgiaGov.\nBrian Kemp has extended the State of Emergency for all 159 counties in Georgia until August 15.\nThe decision follows the impact of Tropical Storm Debby, which has caused significant rainfall and flooding across multiple states.\nAccording to Severe Weather Team 2, the storm dumped nearly a foot of rain on Monday and Tuesday in Southeast Georgia.\nThe extended State of Emergency allows state agencies to respond swiftly to citizens’ needs, reassign personnel, and deploy vehicles and equipment to address the situation."}, {"id": "a18d20a1-d3a8-4a95-bcd1-c45c29a6890e", "title": "Tsunami warning in Japan after 7 . 1 magnitude earthquake", "date": "2024-08-08 16:30", "url": "https://inews.co.uk/inews-lifestyle/travel/japan-tsunami-warning-earthquake-3216381", "domain": "inews.co.uk", "domain_classification": "Unknown", "message": "Tsunami warnings are in place for Japan following a 7.1 magnitude earthquake that hit the country on Thursday.\nThe UK Foreign Office (FCDO) has updated its advice for travel after the earthquake affected south-western Japan, in and around the Miyazaki prefecture.\nThe epicentre of the 7.1 magnitude earthquake (Photo: Mehmet Yaren Bozgun/Anadolu via Getty Images)“The Japanese meteorological agency has issued a megaquake advisory after Thursday’s quake.\nIn March 2011, the “Great East Japan Earthquake”, with a magnitude of 9.1, killed nearly 20,000 people and a further 2,500 are missing to this day.\nOn 1 January this year, a magnitude 7.6 earthquake struck the north-central region of Noto, killing at least 241 people."}, {"id": "12a96a81-b7af-479d-873e-a4a0f9537d96", "title": "Tropical storm Debby makes 2nd US landfall in South Carolina and threatens devastating flooding as it presses northward", "date": "2024-08-08 06:30", "url": "https://edition.cnn.com/2024/08/08/weather/tropical-storm-debby-landfall-forecast-thursday/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Tropical Depression Debby is now centered 45 miles east of Charlotte, North Carolina, according to the center’s 5 p.m. advisory.\nParts of Springfield Middle School lay on the ground after being ripped off by a tornado, spawned by Debby, in Lucama, North Carolina, Thursday.\n• At least a dozen tornadoes confirmed: Debby has whipped up at least a dozen tornadoes as of Thursday that have roared through parts of Florida, South Carolina, North Carolina and Virginia.\nET for 6.8 million people in parts of eastern North Carolina and southern Virginia, including the cities of Raleigh, Virginia Beach and Richmond.\n• ‘Be prepared for a deluge,’ North Carolina governor says: Gov."}, {"id": "b11eb4ff-f04e-4b90-844d-79e7b2188d63", "title": "🌧️ Share your Tropical Storm Debby pictures with us here", "date": "2024-08-08 17:45", "url": "https://www.wbtv.com/2024/08/08/share-your-tropical-storm-debby-pictures-with-us/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Tropical Storm Debby was expected to make a second landfall in South Carolina late Wednesday or early Thursday.\nBoth North and South Carolina, but especially South Carolina, were forecast to receive potentially historic amounts of rain on Thursday, Aug. 8 through Friday, Aug. 9.\nTropical Storm Debby made a second landfall early Thursday morning in the Carolinas after churning over the Atlantic Ocean on Wednesday.\nFlood warnings active for some countiesFlood warnings have been issued for two Charlotte-area counties in North Carolina and two in South Carolina as Tropical Storm Debby moves through the region Thursday.\nAccording to Kim Stenson, director of the South Carolina Emergency Management Division, the anticipated rainfall could set new records for the state."}, {"id": "369c0a7e-4d59-40f2-9782-091c98c39fa9", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 02:30", "url": "https://www.fox17online.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "fox17online.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "ffb44207-5977-46f7-9526-281c39c4877c", "title": "Tropical Storm Debby stalls , poised to move north in US", "date": "2024-08-08 03:45", "url": "https://www.canberratimes.com.au/story/8723408/tropical-storm-debby-stalls-poised-to-move-north-in-us/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Bann said that by Friday Debby would dump up to 20cm of rain on Virginia up into Pennsylvania, where ground in some patches was already soaked from other storms this week, heightening flooding concerns there."}, {"id": "af9e832c-f869-4dcd-b2fa-4d21c9afdd4d", "title": "Tropical Storm Debby makes second landfall in South Carolina as dangerous flood threat continues", "date": "2024-08-08 08:15", "url": "https://nypost.com/2024/08/08/us-news/tropical-storm-debby-makes-second-landfall-in-south-carolina-as-dangerous-flood-threat-continues/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall near Bulls Bay, South Carolina as Debby slowly moves up the Eastern Seaboard and unleashes a dangerous flood threat for millions of Americans.\nPresident Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nGetty Images4 President Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nFox WeatherTropical Storm Warnings remain in effect on the South Carolina and southeastern North Carolina coasts.\nNOAA’s Weather Prediction Center has issued a Level 4 flood risk, the highest threat on its scale through Thursday, in parts of northeastern South Carolina and southeastern North Carolina."}, {"id": "748ed942-3c29-4bab-bfab-b7bcf5500d10", "title": "USDA Meteorologist , Brad Rippey : Debby took the best ag route possible through the southeast", "date": "2024-08-08 20:00", "url": "https://www.rfdtv.com/usda-meteorologist-brad-rippey-debby-took-the-best-ag-route-possible-through-the-southeast", "domain": "rfdtv.com", "domain_classification": "Unknown", "message": "What is left of Hurricane Debby is bringing a lot of rain to the south and east coast.\nSoutheast Georgia and coastal Carolina saw rain totals of anywhere from 10-20 inches, leading to historic flooding and a devastating end to the growing season for some farmers.\nWhile the rain has caused concern, some say the moisture was needed because the summer heat caused crop conditions to decline drastically.\nUSDA Meteorologist Brad Rippey says that Debby took what could be considered the best ag route possible so far this week.\n“Initially from an agricultural standpoint, Debby moved through about the best possible area you could take a hurricane through the southeastern United States."}, {"id": "0bb55271-5b8e-4aac-8fe6-ebf104811b55", "title": "Debby makes second landfall , another Atlantic system spotted | Hurricane Center", "date": "2024-08-08 14:00", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/atlantic-hurricane-season-debby-second-landfall-system-spotted/article_19be5487-36cf-5855-addb-a7a2e8df0424.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "c094e447-0102-4ff2-a040-a12abeaa618c", "title": "Tropical Storm Debby Heads for Tri - State Area , Risk of Flash Flooding", "date": "2024-08-08 19:15", "url": "https://wsus1023.iheart.com/content/2024-08-08-tropical-storm-debby-heads-for-tri-state-area-risk-of-flash-flooding/", "domain": "wsus1023.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already made landfall twice in South Carolina, is expected to hit the tri-state area by Friday.\nThe storm is predicted to bring heavy rain and potential flooding to New Jersey, New York, and Pennsylvania.\nThe ground is already saturated from rains earlier this week, increasing the risk of flash flooding.\nIt is now a tropical storm with maximum sustained winds at 50 mph.\nA major part of the region is under a medium risk for flash flooding Friday afternoon into the overnight hours."}, {"id": "a38b388d-6278-43a0-8bba-1b6401ccc0cb", "title": "Tropical Storm Debby Heads for Tri - State Area , Risk of Flash Flooding", "date": "2024-08-08 18:15", "url": "https://wnnj.iheart.com/content/2024-08-08-tropical-storm-debby-heads-for-tri-state-area-risk-of-flash-flooding/", "domain": "wnnj.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already made landfall twice in South Carolina, is expected to hit the tri-state area by Friday.\nThe storm is predicted to bring heavy rain and potential flooding to New Jersey, New York, and Pennsylvania.\nThe ground is already saturated from rains earlier this week, increasing the risk of flash flooding.\nIt is now a tropical storm with maximum sustained winds at 50 mph.\nA major part of the region is under a medium risk for flash flooding Friday afternoon into the overnight hours."}, {"id": "3f09283a-399e-4e56-8e44-431b7ba194a4", "title": "DC , Maryland prepare for Tropical Storm Debby", "date": "2024-08-08 01:30", "url": "https://www.yahoo.com/news/dc-maryland-prepare-tropical-storm-225251863.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "WASHINGTON (DC News Now) — In D.C., preparations for the remnants of Tropical Storm Debby are underway.\nThe District’s Emergency Operations Center will be staffed over the next few days to respond.\nWest Virginia emergency crews on alert as Tropical Storm Debby approachesD.C.’s Emergency Operations Center is gearing up for a potentially dangerous storm Thursday night into Friday.\nTropical Storm Debby heading towards Virginia: Here’s how drivers can stay safeThe county has flood sensors near certain roads to alert drivers.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "ff359380-b6ec-4e96-a783-6243cbf83f63", "title": "Tropical Storm Debby track shifts west", "date": "2024-08-08 01:15", "url": "https://www.unionleader.com/news/weather/tropical-storm-debby-track-shifts-west/article_fe9e78e4-550a-11ef-9ff9-37b0f1eec9d0.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "9a3f3d7f-cc79-4fec-83d4-e6f3b390dcc5", "title": "Japan tsunami warning as powerful 7 . 1 magnitude earthquake hits | World | News", "date": "2024-08-08 10:00", "url": "https://www.express.co.uk/news/world/1933536/japan-tsunami-warning-earthquake", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Japan: Tsunami warning issued after 7.1 magnitude earthquakeA powerful earthquake measuring magnitude 7.1 has hit southern Japan, with a tsunami warning issued.\nJapan's Maritime Self-Defence Force (JMSDF) is currently conducting aerial damage assessments of the areas affected by the earthquake.\nREAD MORE Millions on alert as 6.3 magnitude quake rocks southern island in JapanIn another clip shot in a shopping mall, clothes racks shake uncontrollably as the earthquake strikes.\nJapan was hit by a tsunami after a massive earthquake in 2011, which had a magnitude of 9.0.\nA 6.9 magnitude earthquake hit the Hyuga-nada Sea in Japan."}, {"id": "dfc5eef9-b5ae-48f9-bc43-e0f3940441e5", "title": "Debby Tracker : DC forecast cone map , path , live radar , rainfall totals", "date": "2024-08-08 22:15", "url": "https://www.fox5dc.com/news/debby-tracker-dc-forecast-cone-map-path-radar-rainfall-totals", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "The remnants of Tropical Storm Debby are expected to bring heavy downpours, flooding conditions, and possibly isolated tornadoes to the Washington, D.C. region.\nWhere is Tropical Storm Debby?\nTracking Tropical Storm Debby (FOX Weather)Tracking Tropical Storm Debby (FOX Weather)Where is Debby headed?\nImage 1 of 3 ▼ Tropical Storm Debby: DC region braces for intense rain, flooding, tornado threatsHow much rain will fall?\nTropical Storm Debby Future Rainfall MapMORE ONLINE: Tracking Tropical Storm Debby (FOX Weather)"}, {"id": "df8402c4-753b-4801-b90c-36b19b044909", "title": "Tropical Storm Debby updates from the National Hurricane Center for Thursday , Aug 08", "date": "2024-08-08 16:30", "url": "https://www.yahoo.com/news/tropical-storm-debby-updates-national-145704858.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debby no longer forecast to be a tropical storm.\nWith sustained winds of 35 miles per hour, Debby has downgraded from a tropical storm to a tropical depression.\nTropical Depression Debby is 45 miles east of Charlotte North Carolina and 95 miles west-southwest of Raleigh North Carolina, with maximum sustained wind of 35 mph.\nYESTERDAY (Wednesday):Yesterday, South Carolina's coastline was expected to encounter Debby, coming from the Atlantic OceanCHANGES WITH THIS ADVISORY:All Tropical Storm Warnings have been discontinued.\nTORNADOES: A few tornadoes may occur through tonight from central and eastern North Carolina into central and southeast Virginia."}, {"id": "d29195da-f28d-4584-9edd-8ae06ee69863", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 01:30", "url": "https://www.fox9.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox9.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "33c75ea1-dc3c-4466-8409-84e8749bebee", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 10:30", "url": "https://www.mid-day.com/news/world-news/article/powerful-earthquake-hits-southern-japan-tsunami-advisory-issued-23373164", "domain": "mid-day.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of KyushuRepresentational ImageListen to this article Powerful earthquake hits southern Japan; tsunami advisory issued x 00:00A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nADVERTISEMENTThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres (18.6 miles).\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "27224ab4-21d4-4758-add7-d25919d294fc", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 00:00", "url": "https://www.fox26houston.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "130c2adc-e8bc-4c93-bd82-471da67e639b", "title": "Huge earthquake sparks tsunami warning as map shows exact location set for waves", "date": "2024-08-08 09:15", "url": "https://www.dailystar.co.uk/news/world-news/breaking-huge-earthquake-sparks-tsunami-33419638", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nA map shows waves are expected to batter a huge length of the country's entire Pacific coastline after the quake.\nThe 7.1 magnitude beast occurred today at 4:42 pm local time near Miyazaki, Japan, reported by the United States Geological Survey.\nThey include: Kochi Prefecture; Bungo Channel coast, Oita Prefecture; Miyazaki Prefecture and Eastern Kagoshima Prefecture."}, {"id": "733a94ef-ac35-434f-9703-1fe5213104c1", "title": "No tsunami threat in B . C . after powerful Japan earthquake", "date": "2024-08-08 20:00", "url": "https://www.timescolonist.com/local-news/no-tsunami-threat-in-bc-after-powerful-japan-earthquake-9326785", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Thursday’s quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometresThere are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday’s quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometres.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island, triggering a local tsunami advisory that urged residents to stay away from the coastline, but there were no reports of serious damage.\nThe British Columbia government protocols require Emergency Information B.C.\nto initiate its enhanced notification process immediately if the National Tsunami Warning Centre in the United States issues a tsunami watch, advisory or warning."}, {"id": "ce8b42af-6fff-4b5a-b7c3-8b88eda4bf6c", "title": "No Tsunami threat in B . C . after powerful Japan earthquake", "date": "2024-08-08 15:30", "url": "https://www.timescolonist.com/bc-news/no-tsunami-threat-in-bc-after-powerful-japan-earthquake-9325199", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "There are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday's quake registered magnitude 7.\nThere are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday's quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometres.\nto initiate its enhanced notification process immediately if the National Tsunami Warning Centre in the United States issues a tsunami watch, advisory or warning."}, {"id": "21115e33-515f-4222-98aa-b767bc5282e7", "title": "Debby Now Inland . Flood Threat Expands From Carolinas To Northeast . ", "date": "2024-08-08 12:45", "url": "https://weather.com/storms/hurricane/news/2024-08-07-tropical-storm-debby-northeast-carolinas-rain-flood-forecast", "domain": "weather.com", "domain_classification": "Unknown", "message": "Current status: Debby's center is accelerating north after it made its final landfall in South Carolina early Thursday morning.\nH​ow much more rain:Southeastern North Carolina: An additional 3 to 6 inches with locally higher amounts is possible.\nCentral North Carolina to Virginia: Totals could be 3 to 7 inches, with locally higher amounts up to 10 inches possible.\nIt then strengthened into Tropical Storm Debby late on Aug. 3 in the southeast Gulf of Mexico.\nG​usts over 60 mph were clocked at Cedar Key, Sarasota-Bradenton Airport (63 mph) and at Folly Beach, South Carolina (63 mph)."}, {"id": "1a36c4a7-0a3a-47db-89b8-da0f607a6894", "title": "Malaysians in areas affected by southern California earthquake urged to remain vigilant", "date": "2024-08-08 08:15", "url": "https://www.thestar.com.my/news/nation/2024/08/08/malaysians-in-areas-affected-by-southern-california039s-earthquake-urged-to-remain-vigilant", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "PUTRAJAYA: Malaysians in areas affected by the earthquake in southern California are urged to remain vigilant and adhere to safety guidelines issued by local authorities, said the Foreign Ministry.\nAccording to a statement, the Foreign Ministry, through the Consulate General of Malaysia in Los Angeles, is actively monitoring the situation following a 5.2-magnitude earthquake that occurred near Bakersfield, Southern California.\n\"The Foreign Ministry will continue to closely monitor the developments and provide updates as necessary to ensure the safety and well-being of all Malaysians in the affected regions,” the statement read.\nAccording to the Foreign Ministry, Malaysians requiring consular assistance can contact the Consulate General of Malaysia in Los Angeles at 777 South Figueroa Street, Suite 600, Los Angeles, California or telephone +1-213-892 1238 or email mwlosangeles@kln.gov.my.\n\"As we continue to handle the ongoing Atlantic hurricane season, including monitoring Tropical Storm Debby in Florida, we are extending our vigilance to the earthquake effects in California,” the statement added."}, {"id": "53bfd6f2-8a36-4b75-a77e-dc919732c523", "title": "Live radar : Tropical Storm Debby moves into Carolinas", "date": "2024-08-08 12:45", "url": "https://www.wbtv.com/2024/08/08/live-radar-tropical-storm-debby-moves-into-carolinas/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Tropical Storm Debby made a second landfall early Thursday morning, and is expected to drop several more inches of rain across the Carolinas.\nParts of northeast South Carolina could see more than 20 inches of rain by Saturday, according to the National Hurricane Center.\nSoutheast North Carolina near the South Carolina border could receive anywhere from 6-15 inches of rain as the storm moves through, according to a graphic published by the hurricane center.\nThe projected rain trajectory for Tropical Storm Debby between Aug. 7 and Aug. 10, 2024, according to the National Hurricane Center.\n(National Hurricane Center)Flood warnings and watches were active for several North and South Carolina counties in the Charlotte Metro area."}, {"id": "491bf71f-11f4-490c-a2d3-c01ae10ffd73", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-08 19:15", "url": "https://www.tvguide.co.uk/schedule/368f303c-966f-5d53-afcc-90ca6cfc7dd8/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 1:00 AM to 2:00 AM Friday 9 August Share Add toCalendar +Half-Country Hurricane Season 1 Episode 3 S SubtitlesHurricane Ida slammed the Louisiana coast in 2021.\nShocked eyewitnesses filmed encounters with tornadoes and flooding all the way to New York CityIn the Eye of the Storm airs on Discovery Channel HD at 1:00 AM, Friday 9 August .\n(Subtitles.)"}, {"id": "6265afdd-d810-425d-ad81-c966222fcebf", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-08 15:30", "url": "https://www.tvguide.co.uk/schedule/ca60ac75-3d62-5e5c-9e28-0c30d7aefb9b/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 9:00 PM to 10:00 PM Thursday 8 August Share Add toCalendar +Half-Country Hurricane Season 1 Episode 3 New S SubtitlesHurricane Ida slammed the Louisiana coast in 2021.\nShocked eyewitnesses filmed encounters with tornadoes and flooding all the way to New York CityIn the Eye of the Storm airs on Discovery Channel HD at 9:00 PM, Thursday 8 August .\n(Subtitles, new.)"}, {"id": "d3942751-f25d-400f-96ad-d1cd53af95e0", "title": "NOAA updates hurricane forecast as peak of Atlantic season approaches", "date": "2024-08-08 21:30", "url": "https://www.yahoo.com/news/noaa-updates-hurricane-forecast-peak-183255504.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MIAMI – Hot ocean temperatures continue to fuel an \"extremely active\" Atlantic hurricane season, according to NOAA’s latest outlook for the remainder of the 2024 season.\nThe latest outlook drops the number of named storms to between 17 and 24, including the four named storms so far this season.\nBased on ocean and atmospheric conditions, NOAA forecasters predict the 2024 Atlantic hurricane season has a 90% probability of being an above-normal season.\nThe official peak of the Atlantic hurricane season is Sept. 10, when there is most likely to be a named storm in the Atlantic.\nOriginal article source: NOAA updates hurricane forecast as peak of Atlantic season approaches"}, {"id": "da1120b4-4143-4727-9144-c7f4eb16d621", "title": "The Latest : Debby moves inland as the tropical depression soaks the Carolinas", "date": "2024-08-08 21:45", "url": "https://gazette.com/ap/national/the-latest-debby-moves-inland-as-the-tropical-depression-soaks-the-carolinas/article_69619776-b92c-545a-a198-eb66d545af73.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "c769cbd3-5b43-4067-aa7d-b4603e2bf899", "title": "Tropical storm Debby brings tornadoes and more rain to North Carolina after 2nd US landfall", "date": "2024-08-08 13:15", "url": "https://saudigazette.com.sa/article/644721/World/America/Tropical-storm-Debby-brings-tornadoes-and-more-rain-to-North-Carolina-after-2nd-US-landfall", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "It is on track to move into North Carolina by Thursday evening and into northern Virginia by Friday morning.\n• ‘Be prepared for a deluge,’ North Carolina governor says: Gov.\nThat includes four tornadoes in Florida, four in South Carolina and two in North Carolina.\n• Tornado watch issued in North Carolina and Virginia: A tornado watch has been issued for parts of eastern North Carolina and southeastern Virginia.\nSouth Carolina hasn’t seen a named storm make landfall on its shores since Hurricane Ian’s arrival in 2022 as a Category 1 storm."}, {"id": "cdc680fd-9c61-4a1f-b4b2-5f6fdf229ade", "title": "Back in S . C ., Tropical Storm Debby could drop 9 ″ of rain in region", "date": "2024-08-08 12:45", "url": "https://www.pennlive.com/weather/2024/08/back-in-sc-tropical-storm-debby-could-drop-9-of-rain-in-region.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "It is now a tropical storm with maximum sustained winds at 50 mph.\nDebby could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nDebby also dumped rain on communities all the way up to the Great Lakes and New York and New Jersey.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nAs much as 6 inches of rain fell in parts of New Jersey in less than four hours."}, {"id": "249096cf-4b37-42ff-9c56-1bb40b748671", "title": "Tropical Storm Debby stalls off Carolinas , poised to move north", "date": "2024-08-08 04:45", "url": "https://www.rappler.com/world/us-canada/tropical-storm-debby-united-states-updates-august-7-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "TROPICAL STORM DEBBY.\nA woman uses her phone to capture images from the pier as Tropical Storm Debby drifts in the East Coast, in Myrtle Beach, South Carolina, US, August 7, 2024.\nAt least six people have died in Florida and Georgia in the wake of Tropical Storm Debby.\n“All North Carolinians across our state need to be prepared for a deluge,” North Carolina Governor Roy Cooper said at a briefing at the state’s Department of Emergency Management on Wednesday.\nIt was forecast to make landfall again further north in South Carolina early Thursday, the National Hurricane Center said."}, {"id": "c5c49a12-f65e-4273-baf0-1b488e60098c", "title": "Hurricane Debby drenches the southeast . Is this much rain normal ? ", "date": "2024-08-08 22:45", "url": "https://www.vox.com/climate/366041/climate-hurricane-debby-drenches-the-southeast", "domain": "vox.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, a plodding, waterlogged system that has already saturated four southeastern states, bears many characteristics of a warming planet, climate scientists say.\nNorth Carolina Gov.\nAs recently as late June, 99 of the state’s 100 counties were experiencing drought conditions ranging from abnormally dry to severe, according to the State Climate Office.\n“The extremes become more extreme.”Tropical Storm Debby is reminiscent of two historic hurricanes that hit North Carolina — Matthew in 2016 and Florence in 2018.\nA person walks through a flooded street caused by the rain and storm surge from Tropical Storm Debby on August 5, 2024, in Cedar Key, Florida."}, {"id": "d156b485-503e-4647-bc1b-b9726b533bf0", "title": "Storm Debby expected to have caused produce losses in Florida and South Carolina", "date": "2024-08-08 14:45", "url": "https://www.freshplaza.com/north-america/article/9648102/storm-debby-expected-to-have-caused-produce-losses-in-florida-and-south-carolina/", "domain": "freshplaza.com", "domain_classification": "Unknown", "message": "This past Monday, Hurricane Debby made landfall in Florida as a category 1 hurricane before weakening to a tropical storm.\nFrom Florida, the storm slowly moved up the East Coast and hit Georgia and South Carolina.\nIn South Carolina, the state's key vegetable growing region is in the far south where some of the greatest rainfall occurred.\nOver in South Carolina, heavy rain is still falling, and damage assessments won't begin until Friday.\nFlorida and parts of South Carolina are likely dealing with drowning crops, causing complete losses of production."}, {"id": "290cf6c9-c2d0-4ddd-9a3e-4c30f3c67e3a", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 01:15", "url": "https://www.kjrh.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "06d216a2-7dd5-4b83-a8cc-974b23812e75", "title": "Flood damage outpaces some repairs in hard - hit Vermont town", "date": "2024-08-08 17:30", "url": "https://www.yahoo.com/news/flood-damage-outpaces-repairs-hard-170200328.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A washed out road and bridge in Lyndon, Vt. is shown Wednesday, Aug. 7, 2024, more than a week after storms caused flooding.\n(AP Photo/ Lisa Rathke)LYNDON, Vt. (AP) — The Vermont town of Lyndon was hit by severe flash floods twice last month.\nIt came three weeks after after flooding in the north and center of the state from the remnants of Hurricane Beryl.\nThat storm killed two people, including a driver in the village who was swept away by floodwaters.\nThe reaction is more significant considering the state the town is in, he said."}, {"id": "20320404-d9d8-4f17-8ca8-445b507ec479", "title": "Tropical Storm Debby : Tropical storm Debby : Coastal flooding , tornadoes and power outages ravage southern states in US", "date": "2024-08-08 06:00", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debby-coastal-flooding-tornadoes-and-power-outages-ravage-southern-states-in-us/articleshow/112361270.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Impact of stormTropical Storm Debby persisted over the coastal regions of Georgia and the Carolinas on Wednesday, continuing to bring heavy rainfall to the area before moving northward.\nMultiple water rescues were reported in the city and its surrounding areas.Severe storms left nearly 330,000 customers in Ohio without power as of Wednesday afternoon.\nFirstEnergy's Illuminating Company announced on social media that power restoration could take days due to extensive damage.\nThe sixth victim, a 48-year-old man in Gulfport, Florida, was found after his anchored sailboat partially sank.\nStates of emergency were declared in North Carolina and Virginia, while Maryland issued a state of preparedness to coordinate efforts without declaring an official emergency."}, {"id": "baf0b380-ae22-45f7-b75a-7592150623c5", "title": "Flood damage outpaces some repairs in hard - hit Vermont town", "date": "2024-08-08 18:30", "url": "https://www.kob.com/news/us-and-world-news/flood-damage-outpaces-some-repairs-in-hard-hit-vermont-town/", "domain": "kob.com", "domain_classification": "Unknown", "message": "LYNDON, Vt. (AP) — The Vermont town of Lyndon was hit by severe flash floods twice last month.\nIt came three weeks after after flooding in the north and center of the state from the remnants of Hurricane Beryl.\nThat storm killed two people, including a driver in the village who was swept away by floodwaters.\n“Our fear is if Debby comes through with all that rain we’re going to lose the house, too,” she said.\nThe reaction is more significant considering the state the town is in, he said."}, {"id": "3eb75bae-d46c-43ab-952d-8baba98d173d", "title": "Debby drenched the southeast : Climate change is making storms like this even wetter", "date": "2024-08-08 16:45", "url": "https://www.yahoo.com/news/debby-drenched-southeast-climate-change-155553864.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "North Carolina Gov.\n“There’s a lot of water in this system that’s just ready to come out,” North Carolina’s state climatologist, Kathie Dello, said.\nAs recently as late June, 99 of the state’s 100 counties were experiencing drought conditions ranging from abnormally dry to severe, according to the State Climate Office.\nAlthough both were Category 1 storms, they caused disproportionate damage because they stalled over land and dumped historic amounts of rain—as much as 3 feet—in eastern North Carolina.\nJohn Uehling co-authored the paper with Carl Schreck III, both of whom are scientists at the North Carolina Institute for Climate Studies."}, {"id": "c0c1f683-59dd-4c86-b119-82462da9054a", "title": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves through", "date": "2024-08-08 07:00", "url": "https://www.wwaytv3.com/clarkton-residents-worry-about-canal-flooding-as-tropical-storm-debby-moves-through/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves throughCLARKTON, NC (WWAY) — In Bladen County, there are growing concerns about inland flooding from Tropical Storm Debby.\nIn the town of Clarkton, some residents are worried the canals won’t be able to move all the rainwater away from their homes.\nSome areas of Clarkton flooded earlier this week after a storm, which caused a tree to fall into one of the canals.\nClarkton resident Rhonda Caballero said she feels the town didn’t do enough after Hurricane Florence to prevent flooding of the canals again.\nPrior to Debby, I was at a meeting at a church in town and I could not get back to my home."}, {"id": "1c274f84-45b5-49ed-a1b8-c236aded35f2", "title": "China self - developed intelligent platforms enhance marine early warning , forecasting capabilities", "date": "2024-08-08 15:45", "url": "https://www.globaltimes.cn/page/202408/1317672.shtml", "domain": "globaltimes.cn", "domain_classification": "Unknown", "message": "As Typhoon Gaemi approaches, huge waves pound the shore in Yilan, China's Taiwan island, on July 24, 2024.\nPhoto: VCGChina has made significant progress in developing advanced intelligent tsunami monitoring and early warning platforms in recent years.\nIt has the ability to quickly determine preliminary earthquake parameters within three to five minutes, and then transmit these parameters in real time to the tsunami warning system, triggering the corresponding warnings.Compared to early systems that could only make forecasts based on human experience, current systems can provide quantitative forecasts of tsunami arrival time, wave height, and warning levels for different coastal locations, as well as corresponding response measures.According to Wang, the system integrates real-time ocean data from over 600 stations worldwide, including along the coast of China.\nIt can complete parameter calculations for these regions in about three minutes, shortening warning times.In addition, the system, with the help of a global observation network, has specially configured buoys for tsunami monitoring.\nRelevant departments in the field of natural resources will continue to deepen the strengthening of the marine warning and forecasting system, actively promoting the steady improvement of its forecasting capabilities.Global Times"}, {"id": "fd1baa56-09af-456d-afb2-cb8d9b7029f9", "title": "Tropical Storm Debby path : Storm heading north", "date": "2024-08-08 00:45", "url": "https://www.ctvnews.ca/climate-and-environment/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents-1.6991347", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimetres) of rain from Debby.\nIn South Carolina, Gov.\nThe centre of Debby was over the Atlantic on Wednesday evening, about 40 miles (65 kilometres) east-southeast of Charleston, the National Hurricane Center said.\nIn Charleston, South Carolina, the Brown Dog Deli closed early Monday and couldn't open Tuesday due to a curfew decreed by local officials.\n------Collins reported from Columbia, South Carolina."}, {"id": "72442983-f1e2-494d-94a1-1a1687fcbbab", "title": "The Latest : Debby moves inland as the tropical depression soaks the Carolinas", "date": "2024-08-08 22:45", "url": "https://wacotrib.com/ap/national/the-latest-debby-moves-inland-as-the-tropical-depression-soaks-the-carolinas/article_c2ba2c08-5f05-58d3-ac1d-6725210143ad.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "As Tropical Depression Debby drenches the Carolinas, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the mid-Atlantic states and Northeast through Saturday morning.\nDebby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "78d6c92f-e12c-4989-9357-b94dfb074c6d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://newstalk1130.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newstalk1130.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "58c99e68-a1f2-4e6f-b9ea-457c7678069f", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://wlac.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wlac.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "926edd78-1bb7-43bf-a331-64c3757563ca", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://newsradio710.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio710.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "c4059358-6658-4f78-b470-4d7e180b5fe9", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://970kfbx.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "d00b3f75-3608-4b73-b309-367775e0a59a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | NewsRadio WKCY", "date": "2024-08-08 17:45", "url": "https://newsradiowkcy.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "dff9ec11-f059-435d-8f2c-680fdbcb7a5c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://veropatriot.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "13715d64-8931-473c-addd-9ff705c1b212", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:15", "url": "https://woc1420.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "d6f07326-d281-434d-a3f5-b5dd9ef2530a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-08-08 19:15", "url": "https://powertalk1460.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "powertalk1460.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "39405ed4-5de8-407f-88f9-0f61dbb2ea76", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:15", "url": "https://whp580.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whp580.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "244a27d6-634d-4e54-9437-7c6ed001c376", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:15", "url": "https://790waeb.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "790waeb.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "efa8d807-1233-428f-86a6-1435c248a059", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:15", "url": "https://1061fmtalk.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "2eef5d73-bb10-4de9-9a75-3a24bed254db", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://kfyr.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfyr.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "98bf1207-f3b4-4423-b2be-f3e728be1ceb", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://wflanews.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "d091bf31-d249-4a75-826f-9883379fa19c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://1150wima.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "1150wima.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "f225ea0a-a069-46cf-a1a2-81f7705269c5", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | News Radio 920 AM & 104 . 7 FM", "date": "2024-08-08 16:45", "url": "https://newsradiori.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradiori.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "1faa0d1a-4ab7-4c12-9264-7251a7de107d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://kfbk.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfbk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "ac5e3e28-481d-44a4-add2-09d4151179f7", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://newstalk1090.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newstalk1090.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "f659ef3c-8209-4818-a414-d394e6594046", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | NewsTalk WMEQ", "date": "2024-08-08 15:45", "url": "https://wmeq.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wmeq.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "aa876b10-c18c-432e-9c0a-32a156fc051d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://wercfm.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wercfm.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "fdb809c7-cf4e-4836-8c36-abeb0f4eda2c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://whoradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "1e64ae1c-9827-4558-89b8-b1fa516b0c1e", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 14:45", "url": "https://kfiam640.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bfd06f95-bfc0-4b49-b4cb-01500cbb8049", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 14:45", "url": "https://wdov.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wdov.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "52646ee2-dbe3-448b-858b-b45fd15eb4ba", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wham1180.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wham1180.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7201c514-c496-4b65-9b2b-f917610bd14c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wwnc.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wwnc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bb3add72-8c39-45f6-841e-3845e7d26058", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://khvhradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "khvhradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "4b61b659-1be7-4fd2-9371-757ec62f8dda", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wjdx.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wjdx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bd486dd2-1de1-48a8-97ae-89f0ef447bbc", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | AM 600 WMT", "date": "2024-08-08 16:15", "url": "https://600wmtradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "600wmtradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "da4015f7-55cd-4965-90f0-9344918d1b4a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | Newsradio WOOD 1300 and 106 . 9 FM", "date": "2024-08-08 15:30", "url": "https://woodradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woodradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "e1e878d8-9306-475f-af2a-e25d4bc48683", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:30", "url": "https://whyn.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whyn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "ae9f64e1-dc0d-48cf-a446-acaca92b4c5d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:30", "url": "https://650keni.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "650keni.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "0e72dd5e-2e41-48ca-ac1d-8b4f0b6150b5", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:00", "url": "https://newsradio967.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio967.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "aa5a8073-6eb9-4b93-9078-7e43f886a838", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | Talk Radio 105 . 9", "date": "2024-08-08 15:00", "url": "https://knrs.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "knrs.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "f2d683f8-e618-49b0-9b8b-51aaec8c3b6b", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:00", "url": "https://powertalk967.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "powertalk967.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "75e8ccd5-e142-42af-b500-bbc3193b4b56", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:00", "url": "https://960weli.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "960weli.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7719e3c5-e34a-4d63-a230-073b05b01905", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:15", "url": "https://woai.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woai.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "eefdce6d-fb73-4cf0-9903-525b941afc9e", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:15", "url": "https://newsradio910wltp.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio910wltp.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7959d0c8-007a-4543-94d4-80125a2e95b1", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:30", "url": "https://koacolorado.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "koacolorado.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "013dd076-4e1b-43d3-bc3d-08e6b6185804", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:30", "url": "https://590kqnt.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "590kqnt.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "1f80beec-3ccb-4a19-8f59-3681d3938bf2", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | News Radio 103 . 1 and 810 WGY", "date": "2024-08-08 15:45", "url": "https://wgy.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wgy.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "40b178af-8a8e-4da9-998e-3533dbd4ba39", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://wvoc.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wvoc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "41a54b9a-0bdb-4a75-8567-2fa1c721d07a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:00", "url": "https://710wor.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "710wor.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "2d8e522b-5d53-4f15-a0f0-135b834bd92c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:30", "url": "https://khow.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "khow.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7c0ec5ff-32b7-466a-bf81-e6ddc1ffd638", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:45", "url": "https://wmrn.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wmrn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "94dfdc81-3e57-4aca-9ea1-8420eed088fd", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:00", "url": "https://abcnews.go.com/International/wireStory/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-112669097", "domain": "abcnews.go.com", "domain_classification": "International", "message": "However, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough.\nIn Osaki in neighboring Kagoshima prefecture, concrete walls collapsed and a wooden house was damaged, but no injuries were reported."}, {"id": "7902910b-c1a6-4fde-a9f6-f745d4eb93ab", "title": "Hardest Debby Impacts Into Friday", "date": "2024-08-08 12:45", "url": "https://www.whsv.com/2024/08/08/hardest-debby-impacts-into-friday/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is impacting the region on Thursday night into very early Friday.\nA FIRST ALERT Weather night and morning with the heaviest rain and the risk of flooding.\nFLOODING CONCERNSWith most tropical systems, flooding is often a main hazard for those in its path.\nTORNADO POTENTIALOne final threat for the region with Debby is the isolated tornado potential Thursday night into Friday.\nWhile not a high probability, tropical systems do bring the threat for severe weather in their strongest bands and storms, Debby being no exception."}, {"id": "fd1e4648-30b8-4bf4-9376-73ce00ff21fc", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 21:15", "url": "https://dailyvoice.com/connecticut/greenwich/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "3b397fcb-6127-44ec-a01a-a13c893c2608", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 03:45", "url": "https://dailyvoice.com/new-york/newrochelle/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "57745801-a1fe-402d-aef2-c59bbaafd135", "title": "Heavy rain expected up the East Coast from Tropical Storm Debby", "date": "2024-08-08 13:30", "url": "https://www.boston.com/news/weather/2024/08/08/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east-coast/", "domain": "boston.com", "domain_classification": "Unknown", "message": "Weather Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast Residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nCollins reported from Columbia, South Carolina."}, {"id": "749070fb-b1b6-461b-a06a-404b603bb67f", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 15:00", "url": "https://www.dailypioneer.com/2024/top-stories/a-powerful-earthquake-hits-off-southern-japan--tsunami-advisory-issued.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "8e6c9ead-fb45-4897-ab2a-e7f966471c42", "title": "Tropical Storm Debby tests severe - weather readiness", "date": "2024-08-08 21:00", "url": "https://www.csmonitor.com/Environment/2024/0808/tropical-storm-debby-flooding-readiness", "domain": "csmonitor.com", "domain_classification": "Unknown", "message": "Events like Tropical Storm Debby bring mounting insurance, construction, and financial stresses.\nLike the alligator spotted this week swimming through a flooded suburban neighborhood in Bluffton, South Carolina, Tropical Storm Debby posed real danger as it slammed the U.S. Southeast, causing floods and seven deaths as of Wednesday afternoon.\n“She ... just stayed there and just rained and rained and rained.”If warming temperatures mean larger, more dangerous storms, Debby isn’t the most severe example.\nWhy We Wrote This Events like Tropical Storm Debby bring mounting insurance, construction, and financial stresses.\nMarco Bello/Reuters A youth driveway-surfs on floodwater as Tropical Storm Debby moves off Georgia to the North Atlantic, in Isle of Palms, South Carolina, Aug. 6, 2024."}, {"id": "2f332a11-3ce6-480a-8d4e-871ebd98d1f9", "title": "Japan news : powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:30", "url": "https://www.9news.com.au/world/japan-news-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/b72e3249-bbd1-48ce-b81d-e714b4a114b2", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A powerful earthquake struck off southern Japan causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nHowever, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nA powerful earthquake struck off Japan 's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nPeople take shelter outside building following an earthquake in Miyazaki, western Japan."}, {"id": "5444f930-3c73-4049-8b8b-08f56d68ca0a", "title": "Japan issues first  megaquake  warning for Nankai Trough after strong earthquake hits Miyazaki", "date": "2024-08-08 19:45", "url": "https://www.nzherald.co.nz/world/japan-issues-first-megaquake-warning-for-nankai-trough-after-strong-earthquake-hits-miyazaki/FPL7SAYODZGAXC6TGMJEXOC5TE/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "The plains in northern Miyazaki Prefecture and the Satsuma area of Kagoshima Prefecture both experienced a seismic intensity of lower 5.\nThe earthquake caused a tsunami with a height of 50cm to reach Miyazaki Port in Miyazaki at 5.14pm, according to the JMA.\nhttps://t.co/Ql8D7Mpe6M — The Washington Post (@washingtonpost) August 8, 2024Emergency response office set upThe Government set up an emergency response office on Thursday.\nKyushu Electric Power Co said its Sendai nuclear power plant in Kagoshima Prefecture and Genkai nuclear power plant in Saga Prefecture were operating normally.\nShikoku Electric Power Co also said its Ikata nuclear power plant in Ehime Prefecture was operating normally."}, {"id": "1764d746-24aa-4263-85e0-162046f5643f", "title": "Powerful earthquake hits southern Japan – NBC New York", "date": "2024-08-08 09:30", "url": "https://www.nbcnewyork.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/5683204/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan southern on Thursday, causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nHowever, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough."}, {"id": "ae3f318f-e81e-452f-b8d3-fa318c5c6359", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued – Winnipeg Free Press", "date": "2024-08-08 09:00", "url": "https://www.winnipegfreepress.com/world/2024/08/08/a-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off southern Japan on Thursday, causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nPeople take shelter outside building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nPolice stand outside a damaged building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024."}, {"id": "714fb454-9648-4db0-a97a-84d4676e0e1a", "title": "Powerful earthquake hits southern Japan – NBC4 Washington", "date": "2024-08-08 11:45", "url": "https://www.nbcwashington.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3688606/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan southern on Thursday, causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nHowever, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough."}, {"id": "ffad6237-b9f3-466f-a473-d8f17e743c28", "title": "Tsunami alert as powerful quake hits western Japan", "date": "2024-08-08 09:00", "url": "https://www.canberratimes.com.au/story/8724009/tsunami-alert-as-powerful-quake-hits-western-japan/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "That does not mean there is an imminent danger of a big quake, but they urged residents on the coasts along the trough - which spans about 500km - to review their quake preparedness, University of Tokyo seismologist Naoshi Hirata, a member of an expert panel, told a joint news conference with JMA officials."}, {"id": "e7213b98-0b73-4a02-b257-00e5d4d04a18", "title": "Debby makes second landfall in South Carolina – NBC 5 Dallas - Fort Worth", "date": "2024-08-08 07:45", "url": "https://www.nbcdfw.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3615650/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "cbc942ce-74d4-4b3e-a58a-638b8efca1dd", "title": "Flooding closes part of Morehead Street near Uptown", "date": "2024-08-08 17:45", "url": "https://www.wbtv.com/2024/08/08/flooding-closes-part-morehead-street-near-uptown/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Part of West Morehead Street near Uptown was closed Thursday due to flooding amid the tropical storm.\nWest Morehead Street was closed near Freedom Drive in Charlotte due to the flooding of Stewart Creek on Thursday, Aug. 8.\nTropical Storm Debby dropped several inches of rain on the Charlotte Metro area in the first half of Thursday.\nFlood warnings remained active beyond Thursday, however.\nClick here for more details about flood warnings and watches in the Charlotte Metro area."}, {"id": "8cc19cd4-01bd-4560-9a14-98db75661004", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 17:45", "url": "https://abc11.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "49017425-4572-4499-b413-e947b5a1e613", "title": "Powerful earthquake hits southern Japan – NBC 7 San Diego", "date": "2024-08-08 12:45", "url": "https://www.nbcsandiego.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3591683/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan southern on Thursday, causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nHowever, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough."}, {"id": "b0bf8bb7-709d-422c-82cc-b18338f07f4d", "title": "Debby makes second landfall in South Carolina – NBC Los Angeles", "date": "2024-08-08 07:45", "url": "https://www.nbclosangeles.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3482407/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "de8e4d91-5054-4d50-8223-397c8d22ee33", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 14:30", "url": "https://abc13.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "deddaffa-86bd-4551-8951-5950b355da64", "title": "7 . 1  Megaquake  Sparks Fear Across Pacific", "date": "2024-08-08 21:00", "url": "https://charismanews.com/news/7-1-megaquake-sparks-fear-across-pacific/", "domain": "charismanews.com", "domain_classification": "Unknown", "message": "This time, the 7.1 magnitude quake’s epicenter was located at the southern portion of mainland Japan near the Miyazaki Prefecture and tsunami advisory was sounded.\nThankfully, no reports of significant damage have been reported at this time.\nStay up-to-date with current issues, Holy Spirit news, Christian teachings, Charisma videos & more!\nThe Japan Meteorological Agency assessed the quake to have taken place 19 miles beneath the ocean’s surface.\nJoin Charisma Magazine Online to follow everything the Holy Spirit is doing around the world!"}, {"id": "36ec6974-2ed2-4052-8f4e-d05292fec9a0", "title": "Powerful earthquake hits southern Japan – NBC Bay Area", "date": "2024-08-08 09:30", "url": "https://www.nbcbayarea.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3619053/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan southern on Thursday, causing mostly minor injuries but raising the level of concern over possible major quakes stemming from an undersea trough east of the coast.\nHowever, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough."}, {"id": "e6ea1c7f-1bf4-43e5-89b2-0e6b9cee91fe", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/national/2024/08/08/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "It only took 15 seconds for a tornado to devastate Genesis Cooper’s home in Lucama, North Carolina, a small town about 40 miles (64 kilometers) east of Raleigh.\n“Like something is squeezing, like your ears are popping.”The tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nNorth Carolina Gov.\nHenry McMaster also warned Thursday that Debby's effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "979b8f6f-9717-4181-ade5-d080c21f708f", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:15", "url": "https://www.ky3.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "ky3.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "5e2c7a27-1822-4486-a70b-1b984948a610", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 14:15", "url": "https://abc7ny.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "094339f8-04e9-4f9c-a714-9355e1208bb8", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:30", "url": "https://gazette.com/ap/national/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east/article_b18943e6-6fe5-5e90-a374-58c90582b0f2.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "a9d9c197-244e-4a79-b43d-63e6d09bcb99", "title": "Debby makes second landfall in South Carolina – NBC Chicago", "date": "2024-08-08 07:30", "url": "https://www.nbcchicago.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3516190/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "d603b6f7-e508-4134-950f-e87cbe7eb5cb", "title": "Debby makes second landfall in South Carolina as it marches northward", "date": "2024-08-08 19:15", "url": "https://dunyanews.tv/en/World/829623-debby-makes-second-landfall-in-south-carolina-as-it-marches-northward", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Debby makes second landfall in South Carolina as it marches northwardWorld World Debby makes second landfall in South Carolina as it marches northwardThe system could spawn tornadoes in the region on ThursdayFollow on Updated On: Thu, 08 Aug 2024 23:08:19 PKTATLANTA (Reuters) - Tropical Storm Debby made a second landfall northeast of Charleston early on Thursday as it dumped more rain on coastal South and North Carolina, exacerbating fears of flash flooding in areas already soaked by the slow-moving weather system.\nDebby, which has killed at least seven people, was located about 80 miles (125 km) southeast of Charlotte, North Carolina, and 110 miles (180 km) southwest of Raleigh, on Thursday morning.\nRainfall totals could reach 15 inches (38 cm) in southeastern North Carolina and 10 inches (25 cm) in parts of Virginia.\nAn apparent tornado killed one man when his house collapsed as it tore through eastern North Carolina and damaged at least 10 houses, a church and a school in Wilson County, North Carolina, early on Thursday morning, county officials reported on social media.\nBy the weekend, Debby could produce up to 6 inches (15 cm) of rain from Maryland into northern Vermont."}, {"id": "b3174fdf-77de-4ee4-89e9-fce5277a1018", "title": "Debby makes second landfall in South Carolina – NBC Connecticut", "date": "2024-08-08 09:15", "url": "https://www.nbcconnecticut.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3357649/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "5d7ab9f8-a639-48d8-b6a0-13953336a1be", "title": "Debby makes second landfall in South Carolina – NBC10 Philadelphia", "date": "2024-08-08 09:00", "url": "https://www.nbcphiladelphia.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3937797/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "56e140cf-aa48-4c7b-a416-f7f9ed1ded73", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://abcnews.go.com/US/wireStory/latest-debby-makes-landfall-tropical-storm-soaks-south-112668297", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Henry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nA falling tree smashed the windshield of two deputies patrol cars overnight as they surveyed flooded roads in a North Carolina county.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.\nTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "5ca588c9-5644-48a5-952e-d4ee50876da0", "title": "Tropical Storm Debby : Person killed in likely tornado in North Carolina", "date": "2024-08-08 23:30", "url": "https://www.fox5ny.com/news/tropical-storm-debby-south-carolina-east-coast", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Tornadoes produced by Tropical Storm Debby damaged homes and a school and killed one person early Thursday, as heavy rain and floods slammed North and South Carolina.\nOn Thursday morning, the National Weather Service in Wilmington, North Carolina, issued Flash Flood Warnings for several counties in southeastern North Carolina and northeastern South Carolina.\nRELATED: Tropical Storm Debby moves up East Coast as flood threat continues for CarolinasFILE-A man walks on a flooded street due to Tropical Storm Debby on August 06, 2024 in Charleston, South Carolina.\nWarning boxes are color coded as: Severe Thunderstorm Warnings in yellow, Tornado Warnings in red, Tornado Warnings with a confirmed tornado in purple, Flash Flood Warnings in green and Flash Flood Emergencies in pink.\n(FOX Weather)According to FOX Weather, President Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida."}, {"id": "976edc1c-4d2b-4963-900c-76fe6495a0d6", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 15:45", "url": "https://abc30.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "85b70d97-9726-48bb-97d6-20603b2ea8b3", "title": "Hurricane season : 2024 mid - season forecast while reflecting back", "date": "2024-08-08 19:15", "url": "http://www.myplainview.com/news/article/2024-atlantic-gulf-of-mexico-hurricane-season-19626099.php", "domain": "myplainview.com", "domain_classification": "Unknown", "message": "A person looks out toward the flooded interstate after Hurricane Beryl swept through the area on July 8, 2024, in Houston, Texas.\nHurricane season for the Atlantic basin season runs from June 1 to Nov. 30, according to the National Oceanic and Atmospheric Administration (NOAA).\nColorado State University and NOAA both published forecasts that suggested 2024 would be an active hurricane season in part from the sea surface temperatures reaching record-level temperatures.\nTo take a step back and reflect on the 2024 hurricane season, here are landfall dates, wind speed and precipitation images from the season, which kicked off with the first named storm, Tropical Storm Alberto, on June 19.\nAdvertisement Article continues below this adRainwater floods an underpass during Hurricane Beryl on July 08, 2024 in Houston, Texas."}, {"id": "f1de8373-e2cb-407e-bf99-aec64436de54", "title": "Hurricane Ian financial impact on Charlotte County still being tallied", "date": "2024-08-08 21:30", "url": "https://winknews.com/2024/08/08/hurricane-ians-financial-impact-on-charlotte-county-still-being-tallied/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "After years, one neighborhood is finally seeing a decision made for what they hope is a future park, but this comes as Jaycee Park-ers are still waiting to hear what is next for them and their beloved green space."}, {"id": "64b948b7-5756-4bfc-bd9f-30e396324e70", "title": "Tropical Storm Debby makes second U . S . landfall , in South Carolina", "date": "2024-08-08 07:00", "url": "https://www.nbcnews.com/news/weather/tropical-storm-debby-makes-second-us-landfall-south-carolina-rcna165679", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already dumped more than a foot of rain on parts of the South and is forecast to bring more, made a second landfall in the U.S. early Thursday when it crossed back into South Carolina.\nThe storm, which had 50 mph winds, made landfall near Bulls Bay, South Carolina, the National Hurricane Center said in a 2 a.m.\nDebby brought tornado warnings to parts of North Carolina early Thursday.\nThere’s a high risk for flash flooding for Wilmington, North Carolina, up to Roanoke, Virginia.\nThrough the rest of Thursday, 3 million people will be at risk for tropical tornadoes from eastern North Carolina into central Virginia."}, {"id": "1d224c00-be07-4e9c-9ac7-75e586a2d4a4", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 10:30", "url": "http://lasvegassun.com/news/2024/aug/07/tropical-storm-debby-makes-2nd-landfall-in-south-c/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, S.C. (AP) — Tropical Storm Debby spawned damaging tornadoes, flooded a town and temporarily shut down part of Interstate 95 early Thursday as it blew into North Carolina after making a second landfall overnight.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph (80 kph).\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer."}, {"id": "2ea4afb7-d4b0-4b7a-8108-0e1a294b8ad1", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:30", "url": "https://www.wsmv.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "221d918d-2baf-47b9-8e63-3f5d1491c2de", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:45", "url": "https://isp.netscape.com/news/story/0001/20240808/d90428b0417df35fa1cae8b24793f5c5", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "“Like something is squeezing, like your ears are popping.”The tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nNorth Carolina Gov.\nSouth Carolina Gov.\nHenry McMaster also warned Thursday that Debby's effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "743bd1be-84dd-4fdb-807a-005d28ff9cf0", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:45", "url": "https://www.wafb.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "wafb.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "aec39c81-cad2-41a7-8e93-67901fb6a2e9", "title": "Bangkok Post - Damage minimal after strong quake off Japan", "date": "2024-08-08 15:45", "url": "https://www.bangkokpost.com/world/2843986/damage-minimal-after-strong-quake-off-japan", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "But officials investigating whether risk of trench-type ‘megaquake’ is increasingPeople gather on a street after an earthquake with a magnitude of 7.1 shook Miyazaki in southwestern Japan on Thursday.\n(Photo: Kyodo)TOKYO - A powerful earthquake with a magnitude of 7.1 shook southwestern Japan on Thursday afternoon but no major damage was reported and only relatively minor tsunami waves reached the coast.\nThe quake occurred at 4.43pm local time at a depth of around 30 kilometres off Miyazaki prefecture.\nServices on the Kyushu and Nishi Kyushu shinkansen bullet trains were temporarily suspended due to the quake, the operator said.\nIt said it has started investigating whether there is a link between the temblor and a potential massive trench-type “megaquake” along the Nankai Trough off western and central Japan."}, {"id": "4c3f6046-988e-4e5a-804f-9105ba26ab61", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 12:45", "url": "https://www.dailyherald.com/20240808/nation-and-world/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east-coast/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone Thursday as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby in Bladenboro, North Carolina.\nAPLUCAMA, N.C. — Tornadoes spawned by Tropical Storm Debby leveled homes, damaged a school and killed one person early Thursday, as the system dropped heavy rain and flooded communities across North and South Carolina.\nNorth Carolina Gov.\n“And that was all we could do.”Debby made a second landfall in South Carolina early Thursday, the National Hurricane Center said.\nHenry McMaster said Thursday afternoon that Debby's effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream."}, {"id": "86660615-c40b-4d31-84a2-d4d67abeb83f", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina", "date": "2024-08-08 14:45", "url": "https://www.ksl.com:443/article/51094213/tropical-storm-debby-makes-2nd-landfall-in-south-carolina", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Standing water a few feet deep covered parts of the tiny North Carolina town.\nDamaged trucks are seen at a car dealer after a tornado hit the area as Tropical Storm Debby drifts in the East Coast, in Moncks Corner, S.C., Wednesday.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMeanwhile, floodwaters haven't even fully drained out of some homes in South Carolina.\nA state of emergency was in effect for both North Carolina and Virginia."}, {"id": "9510c928-f6e5-445e-b704-d0edaa0b576a", "title": "Restaurants in Beaufort prepare for Tropical Storm Debby", "date": "2024-08-08 03:00", "url": "https://www.witn.com/2024/08/08/restaurants-beaufort-prepare-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "BEAUFORT, N.C. (WITN) - Tropical Storm Debby is inching closer to eastern Carolina, and restaurants across the area are preparing for the impact.\nAround Beaufort, tables and chairs were seen stacked as the town braces for Debby.\nCiara Heuser recently moved to the area and says the restaurant she works at will take the storm day by day.\n“We are one of the higher restaurants,” said Front Street Grill at Saltwater general manager Shannon Piner.\nTropical storms are something Piner says she is used to, which is why safety is top priority."}, {"id": "65171d44-57ea-436a-8fc0-69e75dfcade3", "title": "Japan earthquake : Authorities issue MEGAQUAKE warning for the first time ever after tremors earlier in the same area  one of the world deadliest earthquake hit nearly 80 years ago", "date": "2024-08-08 18:15", "url": "https://www.dailymail.co.uk/news/article-13724853/japan-earthquake-megaquake-warning.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Japan has issued its first ever megaquake warning following tremors earlier today in the same area 'one of the world's deadliest earthquakes' hit almost 80 years ago.\nThe 7.1 magnitude earthquake struck off the coast of Japan's southern island of Kyushu, close to the city of Nichinan, at 4.43pm local time.\nThe most recent quake to hit the area was 78 years ago in December 1946.\nThe 7.1 magnitude earthquake struck off the coast of Japan's southern island of Kyushu, close to the city of Nichinan, at 4.43pm local timePeople take shelter outside following the earthquake.\nJapan's Meteorological Agency has issued a tsunami warning following the powerful quakeVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki."}, {"id": "290349b8-c81c-4ddf-a07c-ae41908b751f", "title": "Debby returns to SC and the slow - moving tropical storm continues to drench the Midlands", "date": "2024-08-08 13:15", "url": "https://www.yahoo.com/news/debby-returns-sc-slow-moving-122943836.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debby returns to SC and the slow-moving tropical storm continues to drench the MidlandsAfter a lull where Debby was over the Atlantic Ocean, the tropical storm returned to South Carolina on Thursday, and is continuing to soak the Columbia area as it slowly moves through the Palmetto State.\nThe forecast for Tropical Storm Debby tracks through South Carolina.\nLocalized amounts in other parts of the area could be higher, the National Weather Service said.\nThe forecast for Tropical Storm Debby tracks through South Carolina.\nThe forecast for Tropical Storm Debby tracks through South Carolina."}, {"id": "be18686d-92f9-41d8-a921-ea5d052088ce", "title": "7 . 1 magnitude earthquake strikes southern Japan", "date": "2024-08-08 16:45", "url": "https://www.foxla.com/news/7-1-magnitude-earthquake-strikes-southern-japan", "domain": "foxla.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on Jan. 1 in Japan’s north-central region of Noto left more than 240 people dead."}, {"id": "ae361c3e-bde1-44c7-b17a-e63db16f7b66", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:00", "url": "https://www.yahoo.com/news/latest-debby-makes-landfall-again-061607281.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Latest: Debby moves inland as the tropical depression soaks the CarolinasRandy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nDebby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "ce11e230-135d-4343-a78f-4598b0bb144e", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:45", "url": "https://www.ksat.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Debby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "763d5625-e31d-41cc-a488-565ebcaaf43d", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.clickondetroit.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Debby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "24128c41-4986-4317-a260-edaf822890ae", "title": "New Update : Tropical Storm Debby Expected To Become Hurricane As It Heads Toward US Coast", "date": "2024-08-08 16:15", "url": "https://dailyvoice.com/connecticut/newcanaan/tropical-system-now-expected-to-make-landfall-in-us-as-hurricane-heres-what-to-know-now/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby heading north toward the Big Bend of Florida from Cuba, and has sustained winds of 40 miles per hour, the National Hurricane Center said in an update early Sunday morning, Aug. 4.\nIt's expected to be a Category 1 or 2 hurricane when making landfall along Florida's west coast, which is projected for Monday morning, Aug. 5.\nRainfall totals could exceed 12 to 18 inches along the Southeast US coast next week, posing a major flooding and public safety risk.\nCheck back to Daily Voice for updates.\nClick here to follow Daily Voice New Canaan and receive free news updates."}, {"id": "89785dc8-5ef6-4d1f-92c0-a39ff94ebf68", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.local10.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Debby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "2de034e4-0fea-43e1-b625-ed1e64ae8751", "title": "Tropical Storm Debby brings catastrophic flooding , tornadoes after making 2nd landfall - Boston News , Weather , Sports", "date": "2024-08-08 17:30", "url": "https://whdh.com/news/tropical-storm-debby-brings-catastrophic-flooding-tornadoes-after-making-2nd-landfall/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "LUCAMA, N.C. (AP) — Tropical Storm Debby spawned damaging tornadoes that killed one person, flooded a town and temporarily shut down part of Interstate 95 early Thursday as it blew into North Carolina after making a second landfall overnight.\nIt was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph (80 kph).\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nOne person died in a home damaged by the tornado in Lucama, North Carolina, Wilson County spokesman Stephen Mann said in an email.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer."}, {"id": "8be9a3a4-3219-49bc-aeb9-ed177232a1e8", "title": "Tornado death raises Tropical Storm Debby toll to 7 as heavy rains keep falling", "date": "2024-08-08 17:00", "url": "https://www.pressherald.com/2024/08/08/tornado-death-raises-tropical-storm-debby-toll-to-7-as-heavy-rains-keep-falling/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "It was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nOne person died in a home damaged by the tornado in Lucama, North Carolina, Wilson County spokesman Stephen Mann said in an email.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nA state of emergency was in effect for both North Carolina and Virginia."}, {"id": "5c30dac4-12ec-4d3e-8a6b-3b2ac6698066", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Debby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "cc84fbcc-dbee-41c3-9024-8bd64acbf899", "title": "2024 Atlantic Hurricane Season : CSU updates forecast , still calls for  active season  ", "date": "2024-08-08 10:00", "url": "https://www.yahoo.com/news/2024-atlantic-hurricane-season-csu-091557328.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Colorado State University (CSU) just updated their prediction for the 2024 hurricane season.\nThe revised forecast, released on Tuesday, Aug. 6, still calls for an extremely active Atlantic hurricane season, which lasts from June 1 to November 30..\nWhy are they predicting an active hurricane season in 2024?\nWhy did CSU change their Atlantic Hurricane Season forecast?\nThis article originally appeared on The Patriot Ledger: 2024 Hurricane Season: CSU updates forecast."}, {"id": "9005b151-a05b-4fef-aa26-1fa7b5191445", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – The Durango Herald", "date": "2024-08-08 07:15", "url": "https://www.durangoherald.com/articles/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×LUCAMA, N.C. (AP) — Tornadoes spawned by Tropical Storm Debby leveled homes, damaged a school and killed one person early Thursday, as the system dropped heavy rain and flooded communities across North and South Carolina.\nNorth Carolina Gov.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nYou have to disinfect everything.”A state of emergency was in effect for both North Carolina and Virginia.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "88c7e89e-2062-43c0-ba00-bb9e777cf64e", "title": "A powerful earthquake measuring magnitude 6 . 9 hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:00", "url": "https://abcnews.go.com/International/wireStory/powerful-earthquake-measuring-magnitude-69-hits-off-southern-112668925", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Trump was 'very happy' with how Walz handled riots"}, {"id": "ca4bb6ae-f38b-4150-894c-52841759de06", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 14:45", "url": "https://komonews.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "komonews.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "1bf66dac-1567-421e-be88-01d808e8f36b", "title": "  Megaquake  warning issued by Japan after 7 . 1 magnitude earthquake", "date": "2024-08-08 19:45", "url": "http://www.lmtonline.com/news/article/japan-issues-megaquake-warning-earthquake-19628373.php", "domain": "lmtonline.com", "domain_classification": "Unknown", "message": "This graphic released by the Japan Meteorological Agency shows the seismic intensity from the 7.1 magnitude earthquake on Aug. 8, 2024.\nGraphic courtesy of the Japan Meteorological AgencyAfter a 7.1 magnitude earthquake impacted the Miyazaki Prefecture at 4:42 p.m. local time (3:42 a.m.\nET) today, Japan has issued the first “megaquake” warning for fears of a massive earthquake in the Nankai Trough.\nIn the future, if a large-scale earthquake occurs, it is expected to generate strong shaking and high tsunami waves.\nThe odds make a large-scale earthquake occurring in the Nankai Region relatively high compared to normal times."}, {"id": "4405e63b-6dcb-434d-9b32-2ae88bd7203c", "title": "New York Residents Warned To Prepare For Tropical Storm Debby", "date": "2024-08-08 03:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/update-new-york-residents-warned-to-prepare-for-tropical-storm-debby/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is making its way to New York State, forcing Empire State officials to warn New Yorkers to prepare.\nIt's been downgraded to a Tropical Storm but is expected to break rainfall records in both Georgia and South Carolina.\nHochul notes Tropical Storm Debby will hit later in the week, but right now there's a flood watch in effect for many parts of the state.\nFor all the news that the Hudson Valley is sharing make sure to follow Hudson Valley Post on Facebook, download the Hudson Valley Post Mobile\"Rain could fall at rates up to two inches per hour with local rainfall rates up to three inches at times.\nThen, Empire State residents have to worry about Tropical Storm Debby."}, {"id": "f0a1bb2a-ad23-4d28-84a3-2637357920a3", "title": "The Latest : Debby moves inland as the tropical storm soaks South Carolina", "date": "2024-08-08 17:45", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/the-latest-debby-moves-inland-as-the-tropical-storm-soaks-south-carolina/article_d364f93c-138d-580d-87d8-10bf3fa7674d.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "9cc0702d-6b43-4081-8899-dfc3115af2f4", "title": "National Hurricane Center predicting 2024 hurricane season could  rank among busiest on record  ", "date": "2024-08-08 18:00", "url": "https://www.yahoo.com/news/national-hurricane-center-predicting-2024-162908755.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NOAA predicting 2024 hurricane season could 'rank among busiest on record'NOAA has updated its prediction for the 2024 Atlantic hurricane season, more than two months and four named storms after its first prediction was released in May.\nNOAA predicting 17-24 named storms for 2024 Atlantic hurricane seasonNOAA updated its 2024 Atlantic hurricane season forecast on Aug. 8, 2024.\nGet weather alerts via textOriginal NOAA hurricane season forecast issued in MayNational Hurricane Center releases 2024 Atlantic hurricane season prediction.\nAccuWeather predicting 2024 Atlantic hurricane season could break recordAccuWeather released its 2024 hurricane seasonal forecast Wednesday, March 27 calling for an above normal season.\nNational Hurricane Center making changes for 2024 hurricane seasonThe National Hurricane Center will be experimenting with a new cone later this hurricane season."}, {"id": "07524bdf-48e2-495e-b83b-41949ac71093", "title": "Powerful 7 . 1 magnitude earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 12:45", "url": "https://www.yahoo.com/news/powerful-7-1-magnitude-earthquake-104609954.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nPolice stand outside a damaged building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024."}, {"id": "d1ae6441-67b3-49dd-95d1-06c88da53bc9", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 13:30", "url": "https://wset.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wset.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "dffb7447-6b02-4cb1-a4e3-9958e0f8afef", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 14:30", "url": "https://wjla.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wjla.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "eb171e4f-131f-4a1b-8300-4009a873e282", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina ; heavy rain expected up the East Coast", "date": "2024-08-08 12:45", "url": "https://www.weau.com/2024/08/08/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-up-east-coast/", "domain": "weau.com", "domain_classification": "Unknown", "message": "LUCAMA, N.C. (AP) — Tornadoes spawned by Tropical Storm Debby leveled homes, damaged a school and killed one person early Thursday, as the system dropped heavy rain and flooded communities across North and South Carolina.\nNorth Carolina Gov.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nYou have to disinfect everything.”A state of emergency was in effect for both North Carolina and Virginia.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "ec264d41-9dd5-4dc5-9297-4fad26fdeef3", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 05:45", "url": "https://www.santafenewmexican.com/news/national_and_world_news/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents/article_f3223330-3d86-5480-979f-737d6d86e5e8.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "9e2f8231-f073-4c1f-ac82-d7f611c5377a", "title": "Tropical Storm Debby touches down in DC region Thursday with damaging winds , possible flooding", "date": "2024-08-08 15:30", "url": "https://wtop.com/weather/2024/08/tropical-storm-debby-touches-down-in-dc-region-thursday-with-damaging-winds-possible-flooding/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "Alexandria residents prepare for possible flooding from DebbyListen live to WTOP for traffic and weather updates on the 8s.\nThe National Weather Service said “torrential rainfall is occurring with this storm, and may lead toflash flooding” around the D.C. area.\nDC activates emergency operations centerThe District activated its Emergency Operations Center in anticipation of Tropical Depression Debby’s impacts.\nIf you have a water emergency or a sewer backup, immediately report it to DC Water’s Water and Sewer Emergency Line by calling (202) 612-3400.\nFORECASTSteadier rain bands arrive this afternoon, separated by briefer dry breaks as Tropical Depression Debby heads deeper into the Carolinas."}, {"id": "0e8412c4-a698-47e6-a83c-edacd110233b", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 04:15", "url": "https://www.live5news.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "A few doors down, Charles Grainger was cleaning up after about 8 inches (20 centimeters) of water got into his home.\nIt’s part of living on the creek.”The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimeters) of rain from Debby.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nTropical Storm Debby strengthened over the Atlantic Ocean.\nAt least six people have died due to the storm, five of them in traffic accidents or from fallen trees."}, {"id": "e5b667ae-e4d7-425d-9d72-a38148c6d451", "title": "Powerful Earthquake Hits Off Southern Japan", "date": "2024-08-08 21:15", "url": "https://www.aol.com/powerful-earthquake-hits-off-southern-125628728.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "TOKYO — A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nHe urged residents of the affected region to stay away from the coastline.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "b26a2d6b-c8ac-40e0-90ff-b07ed33e4bef", "title": "Strong earthquake with preliminary magnitude of 7 . 1 strikes coast of Japan", "date": "2024-08-08 09:30", "url": "https://abcnews.go.com/International/71-magnitude-earthquake-strikes-coast-japan/story?id=112669098", "domain": "abcnews.go.com", "domain_classification": "International", "message": "LONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan but the Japan Meteorological Agency has now lifted tsunami advisories for all but Miyazaki Prefecture.\nPeople take shelter outside building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nThe Japan Meteorological Agency initially issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPolice officers stand guard near a building damaged following an earthquake in Miyazaki, southwestern Japan, August 8, 2024, in this photo taken by Kyodo."}, {"id": "51d19dfc-0aaa-4808-8f05-53a8f114ed58", "title": "7 . 1 magnitude earthquake strikes coast of Japan , tsunami advisories triggered", "date": "2024-08-08 09:15", "url": "https://abc7ny.com/71-magnitude-earthquake-strikes-coast-of-japan-tsunami-advisories/15158199/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "7.1 magnitude earthquake strikes coast of Japan, tsunami advisories triggeredLONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan as tsunami advisories have been triggered in the region, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan.\nMiyazaki, with a population of approximately 400,000 people, is now on alert for potential tsunamis in the aftermath of the quake.\nThe Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPeople have been urged to stay away from the coast or river and have been warned that other quakes -- even on the same magnitude --may occur."}, {"id": "0061d923-4766-4c51-b178-ba79c6b5aace", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:45", "url": "https://wsbt.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "9d715059-f8f0-42e2-8826-042234506822", "title": "Flash flooding in Guilford as Storm Debby delays Wyndham", "date": "2024-08-08 17:45", "url": "https://journalnow.com/news/local/flash-flooding-in-guilford-as-tropical-storm-debby-delays-wyndham-start/article_dcd04c0b-3555-51c9-a405-2700be484803.html", "domain": "journalnow.com", "domain_classification": "Unknown", "message": "The National Weather Service has extended a flash flood warning for Guilford and Forsyth counties until 4 p.m. today, while at least 22,000 Triad households have lost power due to heavy rains and wind gusts from Tropical Storm Debby, weather officials and Duke Energy report.\nA flood watch means conditions are favorable for flooding, while a flood warning, as in Guilford, means flooding is imminent or \"already happening,'' according to National Weather Service.\nThe National Weather Service reported a wind gust of 52 mph in Greensboro.\nAnd by Thursday afternoon, residents of the Piedmont may see an \"isolated tornado threat'' spread into the region from the eastern part of the state, the weather service reported.\nPatrick County, Virginia, is also under a flood watch and Davie County is under a wind advisory."}, {"id": "8aeec369-a6e6-4252-99a5-1a78f9143726", "title": "Water district  takes dam safety very seriously  even in wake of  small earthquake  – St George News", "date": "2024-08-08 02:15", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/07/mgk-water-district-takes-dam-safety-very-seriously-even-in-wake-of-small-earthquake/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Jessop and others quickly checked the dams at the Kolob, Sand Hollow, Quail Creek, Ivins and Gunlock reservoirs for any potential problems.\nThe water district also works closely with engineers and the state’s own dam safety program, he said.\nOver 800 dams in Utah are monitored and inspected by the Division of Water Rights’ Dam Safety Section while the 50 federal dams in the state are overseen by the Bureau of Reclamation.\nBoth the state and federal agencies have standards for dam construction that include taking seismic, or earthquake, potential into account.\nZach Renstorm, the general manager of the county water district, praised the swift response of Jessop and others who made sure the dams weren’t affected by the earthquake."}, {"id": "6753f86a-eb01-499d-91b4-0c1458790ddb", "title": "Tropical Storm Debby claims a 7th life as it makes landfall for a 2nd time", "date": "2024-08-08 16:30", "url": "https://www.10news.com/weather/tropical-storm-debby-makes-second-landfall-in-south-carolina-as-flooding-continues", "domain": "10news.com", "domain_classification": "Unknown", "message": "Debby has weakened to tropical depression intensity after coming ashore for a second time in South Carolina early on Thursday.\nRain of 3 to 7 inches could fall from North Carolina north across Virginia, with some areas seeing up to 10 inches.\nRiver flooding, catastrophic flash flooding and urban flooding were expected.\nA man was killed in Lucama, North Carolina, after a tornado from Tropical Storm Debby hit his house, officials said Thursday.\nPresident Joe Biden previously approved emergency declarations for Florida, Georgia, South Carolina and North Carolina."}, {"id": "6a2bd265-58aa-47f8-9375-285897894b10", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 13:15", "url": "https://www.fox19.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "fox19.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "759ad223-d700-49fa-9b4a-0cef4cd36b3d", "title": "Rest of hurricane season to be more active than normal : NOAA | Environment", "date": "2024-08-08 21:15", "url": "https://www.nola.com/news/environment/rest-of-hurricane-season-to-be-more-active-than-normal-noaa/article_5316e1be-55b9-11ef-b9a0-3ffd798a1620.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "28f09dec-ee88-4068-b7c4-5e8d095f0449", "title": "Tropical Storm Debby spawns deadly tornado and life - threatening flooding in North Carolina after 2nd US landfall", "date": "2024-08-08 18:15", "url": "https://ktvz.com/cnn-weather-environment/2024/08/08/tropical-storm-debby-brings-tornadoes-and-more-rain-to-north-carolina-after-2nd-us-landfall/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "Tropical Depression Debby is now centered 45 miles east of Charlotte, North Carolina, according to the center’s 5 p.m. advisory.\n• At least a dozen tornadoes confirmed: Debby has whipped up at least a dozen tornadoes as of Thursday that have roared through parts of Florida, South Carolina, North Carolina and Virginia.\nA tornado in Snow Hill, North Carolina early Thursday was described as “large, extremely dangerous and potentially deadly.” A tornado watch is in effect through 8 p.m.\nET for 6.8 million people in parts of eastern North Carolina and southern Virginia, including the cities of Raleigh, Virginia Beach and Richmond.\n• ‘Be prepared for a deluge,’ North Carolina governor says: Gov."}, {"id": "4b069c39-f4ef-40de-92ff-75e1d64ab3e5", "title": "Strong quake , small tsunamis hit southern Japan", "date": "2024-08-08 11:45", "url": "https://www.manilatimes.net/2024/08/08/world/strong-quake-small-tsunamis-hit-southern-japan/1962726", "domain": "manilatimes.net", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency (JMA) also said there was one quake with a magnitude of 7.1.\nAdvertisementThe Pacific Tsunami Warning Center issued a warning that said hazardous tsunami waves were possible within 300 kilometers (185 miles) of the epicenter.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nKYODO NEWS VIA AP Visitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nAdvertisementIn March 2022, a 7.4-magnitude quake off the coast of Fukushima shook large areas of eastern Japan, killing three people."}, {"id": "af55f217-b23a-491e-95dc-cd069d7c322e", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:00", "url": "https://fox11online.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "146708a7-1a2d-47a6-961f-b1e7189ba316", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:15", "url": "https://www.clickondetroit.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "f3d72dbb-20e9-4b13-a138-913d29c0857c", "title": "Charlotte gears up for storm : Hardware stores see surge , county Monitors water levels", "date": "2024-08-08 03:30", "url": "https://www.wbtv.com/2024/08/08/charlotte-gears-up-storm-hardware-stores-see-surge-county-monitors-water-levels/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Charlotte residents are preparing for the approaching storm as local groups work to ensure they’re ready to respond.\nTim Trautman, the Mecklenburg County Stormwater Program Manager, highlighted a network of sensors and cameras monitoring water levels in real-time.\nThese systems become crucial during heavy rainfall events, alerting authorities to areas at risk of overflowing creeks and subsequent road closures.\nTrautman warned that last week’s storms brought water levels halfway up the banks of some creeks, raising concerns about potential flooding with the expected rainfall.\n“They communicate messages to our staff as well as our emergency managers, so that they can decide where to deploy resources.”Local hardware stores are experiencing a surge in storm preparation supplies."}, {"id": "fe631169-463f-4b9d-b051-8c1edf4c6c1a", "title": "Quake with 6 . 9 magnitude hits western Japan , tsunami alerts issued", "date": "2024-08-08 10:00", "url": "https://www.timeslive.co.za/news/world/2024-08-08-quake-with-69-magnitude-hits-western-japan-tsunami-alerts-issued/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "566638d1-07b0-4b3b-9a6b-d0e015ec15fa", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:45", "url": "https://upnorthlive.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline."}, {"id": "3afca8e9-92e9-45b2-9491-d8741df5bd90", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:00", "url": "https://www.clickorlando.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "61808f30-aed7-4e6a-921a-67508d5b38f7", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – Winnipeg Free Press", "date": "2024-08-08 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/07/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "It only took 15 seconds for a tornado to devastate Genesis Cooper’s home in Lucama, North Carolina, a small town about 40 miles (64 kilometers) east of Raleigh.\n“Like something is squeezing, like your ears are popping.”The tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nNorth Carolina Gov.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nHenry McMaster also warned Thursday that Debby’s effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream."}, {"id": "c29e607f-5af6-4f45-b71b-06a7b768d3ba", "title": "Powerful quake hits off Japan coast", "date": "2024-08-08 19:45", "url": "https://www.ksl.com:443/article/51094307/powerful-quake-hits-off-japans-coast", "domain": "ksl.com", "domain_classification": "Unknown", "message": "However, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe Japan Meteorological Agency said that Thursday's quake registered magnitude 7.1 and was centered in waters off the eastern coast of Kyushu at a depth of about 19 miles below sea surface.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough."}, {"id": "6c96145e-087e-423a-9b75-408fa5c52f2b", "title": "Tornado death raises Tropical Storm Debby toll to 7 as heavy rains keep falling", "date": "2024-08-08 19:45", "url": "https://www.ksl.com:443/article/51094213/tornado-death-raises-tropical-storm-debby-toll-to-7-as-heavy-rains-keep-falling", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Standing water a few feet deep covered parts of the tiny North Carolina town.\nDamaged trucks are seen at a car dealer after a tornado hit the area as Tropical Storm Debby drifts in the East Coast, in Moncks Corner, S.C., Wednesday.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMeanwhile, floodwaters haven't even fully drained out of some homes in South Carolina.\nA state of emergency was in effect for both North Carolina and Virginia."}, {"id": "7f832ada-fe51-45e1-83a8-fdcdacd0710d", "title": "Back - to - back strong earthquakes hit southern Japan , Tsunami warning issues – Firstpost", "date": "2024-08-08 08:45", "url": "https://www.firstpost.com/world/back-to-back-strong-earthquakes-hit-southern-japan-tsunami-warning-issues-13802389.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Two earthquakes, one of magnitude 6.9 and the other of 7.1, hit southern Japan on Thursday (August 8) read moreTsunami advisory has been issued following two earthquakes in southern Japan.\nImage source: Japan Meteorological AgencyAn earthquake of magnitude 6.9 hit southern Japan on Thursday (August 8).\nAdvertisementThe Japanese government established a special task force in response to the earthquakes, as stated in an official announcement.\nThe government of Japan has already set up a special task force in response to the quakes, according to a statement.\nIn fact, it accounts and accounts for around 18 percent of the world’s earthquakes."}, {"id": "7d5b165a-4f28-4b74-a4e8-24cf52935224", "title": "Magnitude 7 . 1 earthquake hits Japan southern region , tsunami warnings issued", "date": "2024-08-08 09:00", "url": "https://www.forexlive.com/news/magnitude-71-earthquake-hits-japans-southern-region-tsunami-warnings-issued-20240808/", "domain": "forexlive.com", "domain_classification": "Unknown", "message": "NHK is reporting that the earthquake have triggered tsunami warnings for several regions in the Japanese islands of Kyushu and Shikoku.\nThese warnings are also extended to the Kagoshima and Ehime prefectures, with the Miyazaki prefecture the one impacted the most.\nThe height of the tsunami is estimated to reach 1 metre.\nUSD/JPY is hovering around 145.70-80 levels still, keeping its track lower since the start of European morning trade.\nUpdate: We are seeing more headlines trickle in with NHK reporting that there are no abnormalities with the Sendai Nuclear Power Plant, which is located in Satsumasendai in the Kagoshima prefecture."}, {"id": "36698c5a-68b1-4342-8c4f-a8107fb9df97", "title": "Nine injured as powerful earthquake strikes off southern Japan", "date": "2024-08-08 14:45", "url": "https://www.irishexaminer.com/world/arid-41452687.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nNine people were injured, most of them slightly, but there were no reports of serious damage.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe Nuclear Regulation Authority said all 12 nuclear reactors, including three that are currently operating, on Kyushu and Shikoku remained safe.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "8e163c94-657d-40c7-8138-15c2be6efd6a", "title": "Japan issues advisory over possible Nankai Trough earthquake - Nikkei Asia", "date": "2024-08-08 21:30", "url": "https://asia.nikkei.com/Economy/Natural-disasters/Japan-issues-advisory-over-possible-Nankai-Trough-earthquake", "domain": "asia.nikkei.com", "domain_classification": "Unknown", "message": "Following the afternoon quake, the Japan Meteorological Agency launched investigations into its possible relationship to a potential Nankai Trough earthquake, which experts have warned for years could cause huge loss of life and property across a wide stretch of central and western Japan.\nThe agency issued its Nankai Trough Earthquake Extra Information for the first time ever on Thursday evening.\nThe agency urged caution for a week, with the probability of large earthquakes being higher just after the Miyazaki quake.\nThe agency said a Nankai Trough earthquake may be limited to the vicinity of Thursday's quake or extend over the \"entire Nankai Trough.\"\nIt was not immediately clear if the heightened Nankai Trough earthquake risk would impact his plans."}, {"id": "f2d7a1e3-f1d3-458d-b39b-f7943a0afe6b", "title": "Tropical Storm Debby makes second landfall in South Carolina , bringing rain , tornadoes", "date": "2024-08-08 18:15", "url": "https://thefrontierpost.com/tropical-storm-debby-makes-second-landfall-in-south-carolina-bringing-rain-tornadoes/", "domain": "thefrontierpost.com", "domain_classification": "Unknown", "message": "LAUREN SFORZA –Tropical Storm Debby made its second landfall Thursday in South Carolina as it continues to batter the East Coast with heavy rains and strong winds.\nAs of Thursday morning, more than 7,000 households are without power in South Carolina, and more than 137,000 have outages in North Carolina, according to poweroutage.us.\nDebby first made landfall in Florida as a Category 1 hurricane but has since weakened into a tropical storm.\nThe center said that the storm currently has sustained winds of 45 mph, keeping it in the tropical storm category.\nThe NWS added that tropical storm conditions will affect parts of the coastal Carolinas through Thursday and that flooding in the area due to the storm surge is possible."}, {"id": "84ee357f-132e-4086-9218-84ef9d069868", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://www.yahoo.com/news/tropical-storm-debby-move-over-040947508.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It only took 15 seconds for a tornado to devastate Genesis Cooper’s home in Lucama, North Carolina, a small town about 40 miles (64 kilometers) east of Raleigh.\n“Like something is squeezing, like your ears are popping.”The tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nNorth Carolina Gov.\nHenry McMaster also warned Thursday that Debby's effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "ce0d5b26-18c0-4f1a-8ac3-db4ff952709b", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://abcnews.go.com/US/wireStory/tropical-storm-debby-move-soggy-south-carolina-coast-112667020", "domain": "abcnews.go.com", "domain_classification": "International", "message": "It only took 15 seconds for a tornado to devastate Genesis Cooper’s home in Lucama, North Carolina, a small town about 40 miles (64 kilometers) east of Raleigh.\n“Like something is squeezing, like your ears are popping.”The tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nNorth Carolina Gov.\nHenry McMaster also warned Thursday that Debby's effects aren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}]