[{"id": "e6000b93-d2be-47e9-80fe-837ac2683803", "title": "2 hurt as Hezbollah shells north launches explosive drones", "date": "2024-06-03 00:45", "url": "https://muslimnews.co.uk/news/syria/2-hurt-as-hezbollah-shells-north-launches-explosive-drones/", "message": "smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smcThe Israel Defense Forces said Sunday morning 2 hurtThat it had carried out an overnight airstrike with fighter jets against a Hezbollah compound in northeastern Lebanon’s Baalbek.\nThe IDF said the strike came as a response to Hezbollah shooting down a military drone over southern Lebanon on Saturday.\nHezbollah claimed to have targeted an Iron Dome battery in the area with several explosive drones.\nAnother rocket attack on Kiryat Shmona lightly wounded two people, the municipality said.\nA composite image of damage caused by rockets from Lebanon in the city of Kiryat Shmona on June 2, 2024."}, {"id": "d998152c-f73e-4389-9516-bf963dbc2844", "title": "2 Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287040/2-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- IANS) Beirut, June 3 (IANS) Two people were killed and four others in an Israeli on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said on Sunday that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders, Xinhua news agency reported.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "2b99e432-6c43-4fe4-a194-e9e1c1ea4d3b", "title": "The Israeli army says it investigates itself", "date": "2024-06-03 00:30", "url": "https://www.chicagotribune.com/2024/06/02/israeli-army-investigates-itself/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nArmy officials initially said dozens of Palestinians were killed in a stampede when huge crowds tried to grab supplies off the pre-dawn convoy of 30 army trucks carrying flour toward hard-hit northern Gaza.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military."}, {"id": "ecf1eb02-96ee-45c9-b41c-6d561b04c620", "title": "Where do the IDF internal investigations stand ? ", "date": "2024-06-03 04:15", "url": "https://www.ctvnews.ca/world/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand-1.6910783", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael's military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "11e8733f-52f5-460a-8e01-87fbbd40003e", "title": "Real target of Dalston shooting says  I wish it was me  ", "date": "2024-06-03 00:15", "url": "https://www.thetimes.co.uk/article/real-target-of-dalston-shooting-says-i-wish-it-was-me-h7lgn2tmp", "message": "The target for the gangland shooting which left a schoolgirl fighting for her life survived a previous assassination attempt and wishes the bullet had hit him rather than the innocent child.\nBeytullah Gunduz, who has been linked to the Turkish underworld, was with friends outside a restaurant in Dalston until 15 minutes before a gunman opened fire on diners last week.\nHe returned to the restaurant to find three of his friends with gunshot wounds.\nThe girl, who had been sitting with her family inside, was on the floor after being shot in the head.\nThe attack has led to concerns that the shooting will reignite a bloody gang war between Tottenham Turks and their rivals, the Hackney Turks."}, {"id": "7dcdd475-6627-4847-b0ef-294ed9d28ece", "title": "What the status of Israeli army investigations into itself ? ", "date": "2024-06-03 01:30", "url": "https://www.nbcbayarea.com/news/national-international/israeli-army-investigates-itself/3554840/", "message": "Israel’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army’s chain of command.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "d7dd4f90-80fb-4490-a51d-c3aa4e0e07c4", "title": "Hezbollah strikes Israeli bases as clashes intensify - Newspaper", "date": "2024-06-03 04:15", "url": "https://www.dawn.com/news/1837460/hezbollah-strikes-israeli-bases-as-clashes-intensify", "message": "BEIRUT: Hezbollah said on Sunday its fighters had bombarded two army bases in the Israeli-annexed Golan Heights within hours, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hezbollah annou­nce­ment came several hours after Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hezbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "ae910c70-f8b7-42f8-9dfc-32769089c404", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 04:45", "url": "https://www.yahoo.com/news/german-police-officer-injured-mannheim-032959235.html", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died."}, {"id": "67f2a823-4164-4478-a9c4-f8e62e5a69ac", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 03:45", "url": "https://www.upi.com/Top_News/World-News/2024/06/02/germany-Mannheim-injured-police-officer-dies/5531717382085/", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died."}, {"id": "8f438055-7a53-4eee-8416-039a0a241025", "title": "Vladimir Putin Strikes Ukraine Largest Hydro - Electricity Plant : Photos", "date": "2024-06-03 01:15", "url": "https://radaronline.com/p/vladimir-putin-missiles-russian-strike-ukraine-hydro-electricity-plant/", "message": "The Dnipro plant, situated on a bridge in Zaporizhzhia, was struck by the 600-mph rocket despite having been targeted by Russian forces previously on March 22.\nUkrainian workers were still in the process of repairing the plant from the previous attack when the missiles hit, exacerbating the damage caused.\nThe assault, part of an overnight blitz employing KH-101 missiles, marks the second major attack on the Dnipro Hydro-electric Power Plant since March.\nThe plant's generating capacity has been severely crippled, with any breach of the 200ft dam posing a significant risk of flooding downstream."}, {"id": "2107aaea-8395-478b-bccf-9c4a77df5cc7", "title": "2 killed in Israeli airstrike on Lebanese village - Xinhua", "date": "2024-06-03 00:15", "url": "https://english.news.cn/20240603/c0ed96de293c409db1b811108e34086b/c.html", "message": "BEIRUT, June 2 (Xinhua) -- Two people were killed and four others injured on Sunday in an Israeli airstrike on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 airstrikes on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "ea4e1ac3-2861-4b21-ac0e-ac636c5372be", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 00:15", "url": "https://www.2news.com/news/national/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/article_96e5df36-e35a-5b27-9cdf-5d9f3bd7b84d.html", "message": "FILE - Palestinians look at the destruction after an Israeli strike where displaced people were staying in Rafah, Gaza Strip, Monday, May 27, 2024.\nThroughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly events in which its military forces are suspected of wrongdoing.\nThe commitment comes in the face of mounting claims — from human rights groups and the International Criminal Court's chief prosecutor — that the country's leaders are committing war crimes in Hamas-ruled Gaza.\n(AP Photo/Jehad Alshrafi, File)"}, {"id": "41b21df6-11c8-4337-92af-0353467b82ca", "title": "Israel has pledged to investigate a series of events where its military has been suspected of wrongdoing", "date": "2024-06-03 06:30", "url": "https://www.newstalkzb.co.nz/news/world/israel-has-pledged-to-investigate-a-series-of-events-where-its-military-has-been-suspected-of-wrongdoing/", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military."}, {"id": "79c9ea34-a634-48d3-ab6a-e4ddae6f1c6e", "title": "Israel airstrike on Syria Aleppo causes casualties , material damage", "date": "2024-06-03 03:45", "url": "http://www.presstv.ir/Detail/2024/06/02/726747/israel-attack-syria-aleppo-material-damage", "message": "The Israeli regime has launched a new act of aggression against Syria’s northwestern city of Aleppo, causing casualties and some material damage.\nSyria’s official SANA news agency, quoting an unnamed military source, said the new airstrike came from the direction of southeastern of Aleppo shortly after the midnight on Monday.\nThe report added that the Israeli strike targeted several locations in the vicinity of Aleppo, leaving a number of people dead while causing some material damage.\nThe statement by the Syrian military source did not specify the number of those killed in the attack and whether they were military personnel or civilians.\nThe regime’s attacks targeted a central site and a residential building in Baniyas city in Syria’s coastal region, as well as the countryside of the eastern Syrian city of Homs."}, {"id": "ef6a85ef-e836-43a5-9c25-4efdbef8158d", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:30", "url": "https://japantoday.com/category/world/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure", "message": "(AP Photo/Alexander Zemlianichenko)By SAMYA KULLAB and ELISE MORTONUkraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "e02941f6-e656-4b6d-a399-c724af700abd", "title": "Lebanon Hizbollah says strikes Israeli bases as clashes intensify", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/region/lebanons-hizbollah-says-strikes-israeli-bases-clashes-intensify", "message": "It said the attack was in retaliation for Israeli strikes in eastern Lebanon's Bekaa Valley.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hizbollah announcement came several hours afer Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hizbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hizbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone."}, {"id": "e304fb3f-8f53-49d1-b1d8-7741fa3c404a", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:15", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-energy-shutdowns-w05563", "message": "KYIV, Ukraine — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov."}, {"id": "f50b1d3a-f4d3-4e01-8c98-4819a30dff60", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 02:30", "url": "https://www.foxnews.com/us/knife-wielding-florida-teen-allegedly-murders-boy-sleepover-injures-adult-violent-premeditated-attack", "message": "A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff's Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack."}, {"id": "566a9d46-782b-48f9-b9a4-b1955ec828f9", "title": "Suspected Israel airstrikes kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536379.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike."}, {"id": "528d74d3-6831-4a5f-ae01-8ba609e615b0", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536380.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike."}, {"id": "7ef8c16a-f0fd-4733-a726-3b360a5e9622", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 06:45", "url": "https://www.thestatesman.com/world/suspected-israel-airstrike-kill-several-people-in-syria-1503306289.html", "message": "An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria’s Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria’s second city of Aleppo is burning following an airstrike.\nAdvertisementSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike.\nThe Israel side did not make any comments to confirm."}, {"id": "11956af6-6532-4bd5-999f-d32f4b0da7e7", "title": "Israeli Prime Minister Benjamin Netanyahu accepts invitation to address joint meeting of US Congress", "date": "2024-06-03 05:00", "url": "https://freerepublic.com/focus/f-news/4241834/posts", "message": "Israeli Prime Minister Benjamin Netanyahu accepts invitation to address joint meeting of US CongressCNN ^ | 06/02/2024 | Annie GrayerPosted on by SeekAndFindIsraeli Prime Minister Benjamin Netanyahu has accepted an invitation from US congressional leaders to address a joint meeting of Congress, his office said in a statement Saturday.\nThe top four US congressional leaders on Friday formally invited Netanyahu to address a joint meeting of Congress.\nby 8 posted onby Ciaphas Cain (If they can do that to Trump then they can do that to YOU.\nby 9 posted onby Liz (This then is how we should pray: Our Father who art in heaven, Hallowed be thy name . )\nby 10 posted onby Liz (This then is how we should pray: Our Father who art in heaven, Hallowed be thy name . )"}, {"id": "d759888c-94e9-4e1a-a5b9-0f15c4525246", "title": "The Jewish video Obama doesnt want on the web", "date": "2024-06-03 05:00", "url": "https://freerepublic.com/focus/f-news/4241831/posts", "message": "I told you not to drink so much and smoke three blunts on that long plane trip over here.”To: SunkenCivThat’s right.\nIsrael used 26.3% of US aid on its own global defense industry (not on US-made weapons).\n<><>-will allow Israel to update “the lion’s share” of its fighter aircraft,<><>includes purchasing additional F-35 Joint Strike Fighters.\n<><>Israel is to initially receive thirty-three F-35 aircraft,<><>the first two F-35’s will be delivered in December.\nIsrael already has these US munitions in its inventory, and will have no difficulty absorbing the additional US munitions into its armed forces."}, {"id": "cc7d277f-c462-4660-82da-667ebf6bb21b", "title": "Ukraine war briefing : Kyiv mourns prominent combat medic and journalist killed in action", "date": "2024-06-03 01:00", "url": "https://www.theguardian.com/world/article/2024/jun/03/ukraine-war-briefing-kyiv-mourns-prominent-combat-medic-and-journalist-killed-in-action", "message": "Almost 1,000 mourners gathered in central Kyiv on Sunday for the funeral of a high-profile journalist and volunteer combat medic who was killed in action last week .\n“I am not sorry to die, because I am finally living the life I would like,” it read in part.\nZelenskiy added: “Regrettably, Russia, using Chinese influence on the region, using Chinese diplomats also, does everything to disrupt the peace summit.\nUkraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure.\nIgor Nechiporenko, deputy head of Korochansky district administration, was killed as a result of ammunition detonating, said Belgorod governor Vyacheslav Gladkov on Telegram."}, {"id": "d9da8503-3cf0-4178-b3ab-2cc21615f7aa", "title": "Man stabs 2 foreign residents  for no reason  ", "date": "2024-06-03 07:00", "url": "http://www.koreaherald.com/view.php?ud=20240603050545", "message": "A 37-year-old man has been indicted for attempted murder of two foreign residents in Incheon, local prosecutors said Monday.\nHe told officials that he was drunk and there was \"no particular reason\" for his actions.\nIt is unclear whether the stabbings were part of a random attack against anyone, or against foreigners specifically.\nWhile the suspect launched an attack against four foreigners, Hambak Maeul is a rare village where the majority of its residents are non-Koreans.\nAs of 2023, about 61 percent of its 12,000 residents had foreign nationality."}, {"id": "f0e51bb0-ad18-4b0f-b179-55f877d68c28", "title": "German police officer stabbed in neck and head in Mannheim , Germany , at anti - Islam event dies in hospital", "date": "2024-06-03 01:30", "url": "https://www.skynews.com.au/world-news/german-police-officer-stabbed-in-neck-and-head-in-mannheim-germany-at-antiislam-event-dies-in-hospital/news-story/de6adc584971b753034f6dd77f64a6ee?nk=9444015928cb19cda8be2a72bea8447f-1717377420", "message": "A policeman who was stabbed in the neck and head at an anti-Islam rally in Mannheim, Germany, has died from his injuries.\nThe 29-year-old officer, Rouven L., was stabbed multiple times in the horror knife attack after tackling another man to the ground.\nVideo of the attack showed Ataee swinging his knife wildly and slashing at a man’s thigh as he was brought to the ground.\nIn a joint statement, German police and prosecutors said the police officer underwent an emergency operation immediately after the attack and was put in an induced coma.\nSpeaking to Echo, a local newspaper, a local man said the knifeman “didn’t look like a bad guy”."}, {"id": "2988aba3-2aa1-4724-8a19-13329b0c298f", "title": "16 - year - old forces way into home , fatally stabs 15 - year - old at sleepover : police", "date": "2024-06-03 03:15", "url": "https://nypost.com/2024/06/02/us-news/16-year-old-forces-way-into-home-fatally-stabs-15-year-old-at-sleepover-police/", "message": "A 16-year-old boy forced his way into a Florida home and fatally stabbed a 15-year-old who was hosting a sleepover with friends, according to police.\nThe 15-year-old victim, Connor Michael Gill, opened the door, and Hernandez fought his way inside and allegedly stabbed him.\nSumter County Sheriff's OfficeThe two victims were airlifted to an area hospital.\nPolice said Hernandez ordered the weapons online Thursday before walking 6 miles and stabbing Sumter County Sheriff\u0092s OfficeThe teen told detectives he ordered the two weapons last Thursday online.\nBoth of the teens were homeschooled, according to police, but it’s not clear how they knew each other."}, {"id": "f4b570c4-c537-4259-8f8a-f96321a9532c", "title": "Russia claims capture of village in Ukraine Donetsk region", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/world/russia-claims-capture-village-ukraines-donetsk-region", "message": "File photo of a Soviet-era World War II monument near a destroyed cultural centre near Avdiivka, in Ukraine's Donetsk region taken on March 21 (AFP photo)MOSCOW — Russia's defence ministry claimed on Sunday to have captured a tiny village in the Donetsk region of eastern Ukraine, where it has been on the offensive making territorial gains.\nRussian troops \"have managed to liberate the village of Umanskoye in the popular republic of Donetsk\", the ministry said in reference to the Ukrainian village of Umanske.\nUmanske is a tiny village that had fewer than 180 inhabitants before Russia launched its military offensive in Ukraine in February 2022.\nIt lies about 25 kilometres to the northwest of Donetsk, which is the main city of the region and is under Russian control.\nMeanwhile, a Ukrainian drone attack “on a car this morning” in the Kursk region “wounded three” people, who were taken to hospital, Governor Alexei Smirnov said."}, {"id": "e47a6b0a-311e-4726-9a97-683b5153c379", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 00:15", "url": "https://www.columbian.com/news/2024/jun/02/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure/", "message": "KYIV, Ukraine (AP) — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday’s drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nWithout adequate air defenses to counter assaults and allow for repairs, though, the shortages could still worsen as need spikes in late summer and the bitter-cold winter."}, {"id": "1e444a8d-f676-4942-9b3c-e4522e912e45", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:00", "url": "https://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel."}, {"id": "d73fc5b2-9eae-4860-8414-c608e6db35b0", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:30", "url": "http://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel."}, {"id": "bf4da1b8-8d43-4bd6-97b9-a81d1f4153ba", "title": "Yemen Houthis launch 2nd strike on U . S . aircraft carrier in less than 24 hours", "date": "2024-06-03 07:15", "url": "http://en.people.cn/n3/2024/0603/c90000-20177274.html", "message": "Yemen's Houthis launch 2nd strike on U.S. aircraft carrier in less than 24 hoursXinhua) 11:04, June 03, 2024SANAA, June 2 (Xinhua) -- Yemen's Houthi group said Saturday night it had launched fresh attacks on the U.S. aircraft carrier Eisenhower, another U.S. warship and four commercial cargo vessels in the Red Sea and Arabian Sea.\nThat marked the group's second strike against Eisenhower in less than 24 hours, Houthi military spokesman Yahya Sarea said on Houthi-run al-Masirah TV.\nThere was no immediate comment from the U.S. Navy or the targeted shipping companies.\nThe targeted ships included MAINA, ALORAIQ, and ABLIANI.\nIn response, the U.S.-British naval coalition stationed in the waters has since January conducted air raids and missile strikes against Houthi targets."}, {"id": "e39dd7a2-e803-4440-9300-432373993f5c", "title": "  Nowhere in Gaza is safe  for Palestinians in Rafah - Asia News NetworkAsia News Network", "date": "2024-06-03 03:00", "url": "https://asianews.network/nowhere-in-gaza-is-safe-for-palestinians-in-rafah/", "message": "June 3, 2024RAFAH – The intensifying Israeli military offensive in Rafah, a southern city in the Palestinian territory of Gaza, has left displaced Palestinians who had been sheltering there in even more of a predicament as food supplies and safe areas become scarce.\nThe airstrike hit a neighborhood adjacent to Al-Mawasi, a coastal district the Israeli military had designated as a “humanitarian zone.” The area was packed with basic tents erected by displaced Palestinians.\n“Enough is enough.”In May, the Israeli military warned people in eastern Rafah to evacuate to coastal areas such as Al-Mawasi.\nRelief and Works Agency for Palestine Refugees in the Near East (UNRWA), about 945,000 people have been displaced from Rafah since the Israeli military operation there began.\nThe situation in Rafah is chaotic as people seek shelter, and getting food and water there is becoming increasingly difficult."}, {"id": "7ed5886b-adbd-4372-b731-5a216e9bbf58", "title": "Teenager denies GBH over 2021 Norwich knife attack | Norwich Evening News", "date": "2024-06-03 06:00", "url": "https://www.eveningnews24.co.uk/news/24358971.teenager-denies-gbh-2021-norwich-knife-attack/", "message": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalised with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year."}, {"id": "84fde4f0-b0ad-4f29-9700-2f97bb983f61", "title": "Ukrainian Drones Attack Lukoil Refinery In Komi", "date": "2024-06-03 07:30", "url": "https://charter97.org/en/news/2024/6/3/597439/", "message": "Ukrainian Drones Attack Lukoil's Refinery In Komi 7 3.06.2024, 7:4617,716It is 1800 kilometres from the enterprise to the border with Ukraine.\nRussian propagandists said that on the afternoon of June 2, an explosion was heard in the town of Ukhta in the Republic of Komi near the Lukoil oil refinery.\nThen the Russian Ministry of Emergency Situations published a photo of the damaged tank and claimed about the deaths, liga.net writes.\nTwo Russians died of gas poisoning and burns, while three others were injured in the incident, Russian authorities claim.\nIt is about 1,800 kilometres from here to the Ukrainian border."}, {"id": "c854482f-aa27-4e92-9319-e10c7ac1435f", "title": "US Air Force awards first Joint Strike Missile contract - Australian Defence Magazine", "date": "2024-06-03 03:15", "url": "https://www.australiandefence.com.au/news/news/us-air-force-awards-first-joint-strike-missile-contract", "message": "Kongsberg Defence and Aerospace has been awarded a US$141 million (~$212 million) contract by the US Air Force (USAF) to provide the service with an initial lot of the Kongsberg-Raytheon Joint Strike Missile (JSM).\nThe contract, which covers work through the end of August 2026, is for an undisclosed number of all up JSM rounds, containers, and test equipment for the missile.\nBAE Systems Australia is a key supplier on the JSM as it provides a passive radio frequency sensor to all up rounds.\nDespite this, Australia is yet to order the missile, which can be carried internally by Block 4 F-35As and Cs.\nThe recently released 2024 Integrated Investment Plan (IIP) states simply that \"Defence is also investigating the integration of the Joint Strike Missile for the F‑35A.\""}, {"id": "9814dfdf-cc2e-453c-878d-ee888222dbf6", "title": "Russian Army Advances In Kharkiv , As Western Nations Permit Ukraine To Strike Targets In Russia", "date": "2024-06-03 06:30", "url": "https://menafn.com/1108285490/Russian-Army-Advances-In-Kharkiv-As-Western-Nations-Permit-Ukraine-To-Strike-Targets-In-Russia", "message": "Russian forces are now advancing west towards Chasiv Yar, aiming to control the high ground to approach the strategic city of Kramatorsk.\nBoth Russian military bloggers and Ukraine's DeepStateMap report minor Russian advances into recaptured Ukrainian territory.\nWestern nations permit Ukraine to strike targets in Russia, sparking nuclear concernsIn a significant policy shift, Germany has joined several NATO members in allowing Ukraine to use German-supplied weapons against targets within Russia's borders.\nFrench President Emmanuel Macron argued that Ukraine should be able to target specific Russian military sites, while Poland and Denmark have also authorised the use of their weapons against Russian targets.\nPreviously, Russian President Vladimir Putin had threatened“serious consequences” if Western countries allowed Ukraine to strike targets within Russia."}, {"id": "8f471828-e5f6-403d-b7eb-96a24f02b798", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo : NGO", "date": "2024-06-03 07:00", "url": "https://www.bssnews.net/international/192788", "message": "BEIRUT, June 3, 2024 (BSSAFP) - At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defence said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests."}, {"id": "224aa7bb-d1d0-4477-a27f-c9732dc58267", "title": "1 arrested after stabbing a man in northeast Atlanta", "date": "2024-06-03 06:30", "url": "https://www.wsbtv.com/news/local/1-arrested-after-stabbing-man-northeast-atlanta/OJ5CFV6Y2FHUZPBNZBXHVCVUGY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "5cfec8ec-f086-49d7-9284-cd927836fd37", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 00:30", "url": "http://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel."}, {"id": "dcd1190a-4cb3-4895-9fd4-3b33653586ac", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 01:00", "url": "https://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel."}, {"id": "f772ce8b-3a7e-4195-abda-98a849ad84b2", "title": "Man stops officer , arrested for allegedly stabbing another man in downtown Portland", "date": "2024-06-03 00:15", "url": "https://www.yahoo.com/news/man-stops-officer-arrested-allegedly-213635555.html", "message": "PORTLAND, Ore. (KOIN) — After flagging down police, a man was arrested for allegedly stabbing another man moments earlier in downtown Portland early Saturday morning.\nAccording to PPB, a man – identified as 41-year-old Basir Noorzai – grabbed the attention of an officer near Southwest 4th Avenue and Main Street just after midnight, claiming he was being chased by three other men.\nPortland woman jumps from car, man faces kidnapping, sex abuseHowever, officers reportedly found out one of the men chasing Noorzai had been stabbed by him during an earlier fight on the waterfront near the Hawthorne Bridge.\nNoorzai then tried to run from police with the knife in his possession, but was soon arrested for assault, unlawful use of a weapon and a parole violation.\nThe stabbing victim then went to the hospital with non life-threatening injuries, authorities say."}, {"id": "dba48610-7230-4469-bfa1-52e41fa457e8", "title": "Rafah Battles Intensify As Israel Takes Over Gaza - Egypt Border Strip", "date": "2024-06-03 04:30", "url": "https://menafn.com/1108287494/Rafah-Battles-Intensify-As-Israel-Takes-Over-Gaza-Egypt-Border-Strip", "message": "The Israeli forces launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken \"operational control\" of the narrow border area, where he said troops had \"discovered around 20 tunnels\".\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nWitnesses also said Israeli forces had demolished several buildings in the city's eastern areas where the Israeli incursion began on May 7, initially focusing on the vital Rafah border crossing, a key entry point for humanitarian aid.\nA steady stream of civilians have fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts."}, {"id": "93759d22-a112-4aad-ac8d-8ee65372d136", "title": "Man arrested after 2 women killed , man injured in Springfield", "date": "2024-06-03 01:15", "url": "https://www.bostonglobe.com/2024/06/02/metro/man-arrest-2-women-killed-man-injured-springfield-stabbings/", "message": "Upon arrival, officers found two women, whose identities have not been released, suffering from stab wounds.\nBoth died at the scene, according to the statement.\nA suspect is in custody after two women were killed and a man was seriously injured in a series of stabbings at a Springfield home on Sunday morning, officials said.\nA third victim, a man, was later found and taken to Baystate Medical Center in Springfield with serious injuries, according to the statement.\nMembers of the Springfield Police Homicide Unit and the Hampden district attorney’s office are investigating the stabbings, according to the statement."}, {"id": "6d7124d2-55ae-4d43-aeff-8a737779b636", "title": "Man accused of waterfront stabbing arrested after seeking police help", "date": "2024-06-03 07:15", "url": "https://katu.com/news/local/man-accused-of-waterfront-stabbing-arrested-after-seeking-police-help-hawthrone-bridge-portland-multnomah-county-oregon", "message": "A man accused of stabbing another man during a fight near the waterfront last night has been arrested.\nPortland Police say the suspect waived down a police officer after the stabbing for help.\nOfficers determined that one of the men chasing Noorzai had been stabbed by him during a fight near the Hawthorne Bridge.\nNoorzai then reportedly tried to run from the officer, but she caught up to him.\nAccording to Portland Police, the officer saw Noorzai had a knife in his hand and ordered him to set it down."}, {"id": "c1171189-d96c-4d0f-9636-1b5a81262880", "title": "Real target of Hackney shooting says he wishes he had been shot in the head instead of little girl still fighting for her life in hospital", "date": "2024-06-03 00:45", "url": "https://www.dailymail.co.uk/news/article-13486937/Real-target-Hackney-shooting-said-wished-shot-head-instead-little-girl-fighting-life-hospital.html", "message": "The real target of the Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nBeytullah Gunduz, 37, who has links to the Turkish criminal world, attended a restaurant in Dalston, east London on May 29.\nOfficers were called at around 9.20pm on May 29 to reports of a shooting near Evin restaurant on Kingsland High Street.\nThe real target of Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nHe is reported as saying 'that little girl is an innocent person'."}, {"id": "47c8519e-5186-4454-8bbc-0d5624b1fc06", "title": "Israeli army investigates deadly events", "date": "2024-06-03 06:00", "url": "https://www.postcourier.com.pg/israeli-army-investigates-deadly-events/", "message": "In one of the highest-profile cases, an attack on a World Central Kitchen convoy that killed five foreign aid workers, the Israeli army promptly published its findings, acknowledged misconduct by its forces and dismissed two soldiers.\nIsrael’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe military refused to disclose the full list of investigations and told the AP it could only respond to queries about specific probes.\nSunday’s strike killed at least 45 people and caused widespread destruction.\nHagari said the destruction may have been caused by secondary explosions, possibly from Palestinian militants’ weapons in the area."}, {"id": "1ea2d4ef-ab2f-43fc-a8ea-376dc9e59416", "title": "Palwal firing incident :  Around 10 - 15 individuals fired at my residence , says BJP MLA Jagdish Nair", "date": "2024-06-03 06:15", "url": "https://news.webindia123.com/news/Articles/India/20240603/4202857.html", "message": "Bharatiya Janata Party MLA from Hodal Assembly, Jagdish Nair, has responded to the firing incident that took place at his residence, stating that unidentified bikers arrived and abused his staff.\nWhen his staff attempted to stop them, the accused opened fire on his residence.\nJagdish Nair, the MLA allegedly targeted in the attack, asserted, \"Approximately 10-15 individuals arrived on motorcycles and began abusing my staff.\nMeanwhile, a team of police officials inspected Nair's residence on Sunday, following the alleged shooting incident.\nThe Investigation Officer (IO) Sanjay Kumar said, \"The incident took place on June 1, at around 5.30 pm, when 10-15 individuals arrived on bikes and fired shots at the MLA's residence."}, {"id": "84f88bae-ef7a-4f10-b8c7-23f8bfdf7d38", "title": "Russia attacks Ukraine energy grid", "date": "2024-06-03 01:30", "url": "https://www.bostonherald.com/2024/06/02/russia-attacks-ukraines-energy-grid/", "message": "KYIV, Ukraine — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nFollowing Saturday’s barrage, Ukraine’s air force said Sunday that air defenses had shot down all 25 drones launched overnight.\nRussia claimed Sunday that it had taken control of the village of Umanske in the partially Russian-occupied Donetsk region."}, {"id": "76371953-3d36-4e73-931d-5eaf6a43b1fe", "title": "Two Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287310/Two-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- Nam News Network) BEIRUT, Jun 3 (NNN-NNA) – Two people were killed and four others yesterday, in an Israeli on the south-eastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that, an Israeli warplane bombed a house in central Houla, with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region, and fired 70 shells on 13 villages and towns, in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group, Hezbollah, said, it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.– NNN-NNA"}, {"id": "353a2169-a76d-4d85-9cae-b0d54dac7f7b", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 00:15", "url": "https://www.2news.com/news/national/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure/article_d643d233-05d1-5635-8cf6-c2f30e55ce6a.html", "message": "Representatives of the diplomatic corps look at U.S.-made M1 Abrams tank, and other U.S. military vehicles, hit and captured by Russian troops during the fighting in Ukraine as they visit an exhibition of Western military equipment seized from Ukrainian forces, in Moscow, on Friday, May 31, 2024.\nThe exhibit, organized by the Russian Defense Ministry, features more than 30 pieces of Western-made heavy equipment, including a U.S.-made M1 Abrams tank and a Bradley armored fighting vehicle."}, {"id": "98cb5baf-642c-4aae-94bf-a0f61a223a91", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 03:45", "url": "https://wfin.com/fox-national-news/knife-wielding-florida-teen-allegedly-murders-boy-at-sleepover-injures-adult-violent-premeditated-attack/", "message": "​A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff’s Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack."}, {"id": "d9fc3316-91f8-49ab-ade4-cc426790b510", "title": "Teen girl killed in Reserve shooting | Crime / Police", "date": "2024-06-03 00:45", "url": "https://www.theadvocate.com/baton_rouge/news/crime_police/teen-girl-killed-in-reserve-shooting/article_d52ce074-2f93-593d-8d3e-0458e85bcf31.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "ea2c1a1f-3bd0-4f51-b164-ac5735c1f640", "title": "Teen girl killed in Reserve shooting | Crime / Police", "date": "2024-06-03 02:15", "url": "https://www.nola.com/news/crime_police/teen-girl-killed-in-reserve-shooting/article_3c4489f8-2127-11ef-9389-3f6bba69f1e7.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "e6d8f034-19be-4958-8361-548f212a3714", "title": "Tension Escalates : Deadly Israeli Airstrikes Hit Syria Again", "date": "2024-06-03 00:30", "url": "https://www.devdiscourse.com/article/law-order/2959004-tension-escalates-deadly-israeli-airstrikes-hit-syria-again", "message": "A number of people were killed in an Israeli air attack targeting sites in the vicinity of the Syrian city of Aleppo on Monday, Syrian state media said citing a military source, the second reported attack on the country in less than a week.\nThe strikes at around 12:20 a.m. (2120 GMT on Sunday) \"led to a number of fatalties and some material damage\", the source said, without elaborating.\nIsrael launched air attacks on May 29 on Syria's central region as well as the coastal city of Baniyas,killing a child and injuring ten civilians, according to Syrian state media.\nIn April, Iran retaliated by firing missiles at Israel after a presumed Israeli strike that destroyed a building in Iran's embassy compound in Damascus and killed several Iranian officers including a top general.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "fdf91ddc-8042-443e-aeb3-e9187d4aafa1", "title": "Hezbollah Says Launched Series Of Retaliatory Attacks On Israel", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108286880/Hezbollah-Says-Launched-Series-Of-Retaliatory-Attacks-On-Israel", "message": "(MENAFN- Khaleej Times) Published: Sat 1 Jun 2024, 4:19 PMLebanese Hezbollah said it launched a series of on Israeli military positions on Saturday after state reported Israel had stepped up its own strikes the night before.\nSince the start of the war in the Gaza Strip between Israel and Hamas on October 7, Hezbollah has exchanged almost daily fire with the Israeli army.\nThe Israeli military said in a statement that \"two Hezbollah terrorists operating in the region of Majdal Selm were struck by an aircraft\".\nHezbollah, which has increased its use of drones in recent weeks, has also claimed responsibility for several attacks against Israeli military positions \"in response to Israeli aggression against southern localities and civilian homes\".\nOn the Israeli side, at least 14 soldiers and 11 civilians have been killed in the violence, according to Israeli authorities."}, {"id": "682daecd-1dd9-415d-a995-16d607753a5a", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-03 03:30", "url": "https://www.tvguide.co.uk/schedule/317e51b7-dc57-5633-89f7-d830958c1f7e/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 3 June Share Add toCalendar +Battle of Britain Season 3 Episode 7 of 10 S Subtitles Audio DescriptionAt Biggin Hill, south-east London, military equipment collector Bruce Crompton views a collector's haul of Second World War Spitfires.\nPlus, the twins prepare some wartime artillery guns to export to Australia - but it's no easy featCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 3 June .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "a175289d-dfbb-4caa-9355-5028cc1dc3d9", "title": "Adapting Russian Tactics : Enhancing the Indian Army T - 90 Fleet – Indian Defence Research Wing", "date": "2024-06-03 07:00", "url": "https://idrw.org/adapting-russian-tactics-enhancing-the-indian-armys-t-90-fleet/", "message": "Adapting Russian Tactics: Enhancing the Indian Army’s T-90 Fleet| BySOURCE: AFIThe Indian Army, with its robust fleet of T-90 tanks, stands at a critical juncture where adopting innovative tactics and upgrades could significantly enhance its combat effectiveness.\nRecent developments in Russia’s own handling of the T-90 tanks present valuable lessons and opportunities for India.\nThe dual armor plates have demonstrated superior resilience against these threats compared to the cope cage.\nThe additional weight of the cope cage can impede the tank’s mobility, a critical factor in combat scenarios.\nBy replacing the cope cage with armor plates, the overall weight of the tank is better managed, enhancing its maneuverability."}, {"id": "cf23c369-2b6c-4ec8-8127-dbf077e02762", "title": "Hometown Patriot : Remembering D - Day", "date": "2024-06-03 05:00", "url": "https://www.ktbs.com/community/hometown-patriot-remembering-d-day/article_14f037c6-2136-11ef-8ca6-ab0ee3e893eb.html", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "35a5a359-bf63-45bd-af80-135630314572", "title": "Germany hosts NATO air force training exercises", "date": "2024-06-03 07:00", "url": "https://www.yahoo.com/news/germany-hosts-nato-air-force-045604840.html", "message": "A NATO flag flies in the wind during the \"National Guardian 2024\" exercise as part of the \"Quadriga\" series of Bundeswehr exercises at the Oberlausitz military training area.\nRobert Michael/dpaSome 60 fighter jets and other combat aircraft are set top participate in NATO tactical air force exercises at a German airbase from Monday.\nThe squadron in Jagel is also due to mark its 30th anniversary as part of the NATO manoeuvre.\nEach day, the host nation issues a fictitious scenario that becomes increasingly complex as the exercise progresses, the Bundeswehr said.\nThe gathering is one of the largest exercises for joint air warfare operations in Europe and offers particularly valuable experience for the participating aircrews, the army added."}, {"id": "7dcfb72c-9d70-4523-a487-89da80384fa7", "title": "Guardians Of Gaia Windows game", "date": "2024-06-03 06:15", "url": "https://www.indiedb.com/games/guardians-of-gaia", "message": "Choose from a diverse set of characters with unique abilities.\nExchange your spoils from battle to unlock new skills and master new weapons.\nDiscover different weapon styles, character traits and the use of Gaia elements.\nUse team work and mobility to control the arena.\nBecome Gaia."}, {"id": "21082053-d19e-4f07-aada-8c146b050b5e", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:45", "url": "https://www.smh.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "4acd4211-4511-4692-80af-5ac20f2c3046", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:15", "url": "https://www.theage.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "457776e2-9bef-447d-aa60-604369205867", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 07:00", "url": "https://www.brisbanetimes.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous."}, {"id": "c10ca78d-e7bd-45be-8621-0b18bb819cef", "title": "Riveting speech , rousing concert mark ceremony in Laguna Woods", "date": "2024-06-03 01:45", "url": "https://www.ocregister.com/2024/06/02/riveting-speech-rousing-concert-mark-ceremony-in-laguna-woods/", "message": "The All-American Boys Chorus of Santa Ana sings the armed forces medley during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\n(Photo by Frank D’Amato, Contributing Photographer)The Laguna Woods Korean American Association Choir sings “God Bless America” during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\n(Photo by Frank D’Amato, Contributing Photographer)Kathy Rath of the Laguna Woods American Legion Post 257 sings the national anthem at the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\nPark during the Memorial Day ceremony at the Laguna Woods Village Performing Arts Center on Monday, May 27, 2024.\nThe ceremony opened with a moment of silence and an invocation by Alan Clark, chaplain of Laguna Woods’ American Legion Post 257."}, {"id": "15181606-693b-4b73-91d9-f78817c4b1d4", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461201/new-zealand-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 754 Viewsby, posted 10 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "35ea933f-f456-4c4f-b3d0-f3ec0fb672c3", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461201/paper-mario-the-thousand-year-door-debuts-in-2nd-on-the-new-zealand-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 756 Viewsby, posted 10 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "a2b151fe-d0c3-4eaf-8997-d2d30f6c3c25", "title": "Navy Seals are accused of going woke after pride post sparks backlash", "date": "2024-06-03 01:00", "url": "https://www.dailymail.co.uk/news/article-13486927/Navy-Seals-pride-month-facebook-woke.html", "message": "Defense bosses found themselves in hot water with former Navy Seal vets after marking the start of June with a Facebook post celebrating the beginning of Pride Month.\nThe post on the official page of Naval Special Warfare Command was also posted to the US Navy Seal and SWCC page, according to Libs of TikTok.\nThe controversial post came on the day the Department of Defense made an embarrassing gaffe with a Facebook post that appeared to confuse Pride Month with Post Traumatic Stress Disorder Month.\nBut the post was illustrated with a 'Progress Pride Flag' and attached to a picture captioned 'Celebrate Pride Month 2024'.\nThe Pentagon deemed June to be PTSD Awareness Month in June 2014, a year before it recognized June as Pride Month."}, {"id": "fd9bf135-8607-4b84-9907-ebbd33e84eb0", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461200/australia-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 682 Viewsby, posted 10 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "46f9095e-e59b-465d-b625-15f8d0fac005", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461200/paper-mario-the-thousand-year-door-debuts-in-1st-place-on-the-australian-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 684 Viewsby, posted 10 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "9593a960-809b-41f8-b4c9-0bcff5f2f692", "title": "Why did North Korea bombard the South with trash balloons ? ", "date": "2024-06-03 00:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/why-did-north-korea-bombard-the-south-with-trash-balloons/articleshow/110648842.cms", "message": "SEOUL: North Korea launched 720 balloons across the world's most heavily armed border overnight Saturday, hitting South Korea with their payloads: plastic bags full of cigarette butts and other trash.Since last Tuesday, North Korea has sent roughly 1,000 of these trash balloons across the Demilitarized Zone separating the two Koreas.\nOn Sunday, the office of President Yoon Suk Yeol accused North Korea of \"dirty provocations no normal country would think of.\"\nIt said South Korea would start taking \"steps that North Korea would find unbearable.\nIt has accused North Korean defectors living in South Korea of \"scattering leaflets and various dirty things\" over its border counties in recent days.Here's what to know about the unusual offensive.When South Korea reports objects launched from North Korea, they are usually rockets carrying satellites or ballistic missiles of a kind the North says is capable of delivering nuclear warheads.\nOn social media, people posted pictures of the North Korean balloons in trees, on farmland or on urban side streets bursting with trash."}, {"id": "54d37bc9-fd77-4ec8-aad6-bc603222831e", "title": "Daly Bread : Battling in Opposition space ; can Paray or Mickela articulate feasible crime plan ? ", "date": "2024-06-03 02:15", "url": "http://wired868.com/2024/06/02/daly-bread-battling-in-opposition-space-can-paray-or-mickela-articulate-feasible-crime-plan/", "message": "It was published after the contest for Opposition space intensified during the immediately preceding days and was extensively covered in all media.\nThe contest between the Kamla slate and the Paray slate will take place soon, on 15 June.\nI link both the UNC internal and external battles with the paramount issue of violent crime for a specific reason.\nThe current People’s National Movement (PNM) Government is widely seen as incapable of inhibiting the assault of violent crime on our oppressed population and, perhaps, even indifferent to it.\nHowever, in light of our electoral history, Paray and The Patriotic Front may soon have to share what their plans and policies are to combat violent crime."}, {"id": "68a9c798-c2b8-4879-8fc5-08012fee9b7b", "title": "Pine Nuts : Church of Divined Connections", "date": "2024-06-03 01:30", "url": "https://www.carsonnow.org/story/06/02/2024/pine-nuts-church-divined-connections", "message": "Inspired by Carson City’s, “Connections,” a friend of mine, Baobab, is constructing an emerging theology, and has agreed to an interview.\nQuestion: “So how does one welcome folks into a brand-new religion?”Baobab: “We welcome everybody to The Church of Divined Connections, Epicenter of Engagement in Empathy Toward Earth.\nAn improved attitude and resulting engagement will help us repair our sick atmosphere.”When intreated for thoughts on violence, Baobab intimated, “Violence never solves problems, only intensifies them.\nOne wag indicated to me that The Church of Divined Connections was going viral and quite possibly could put a lid on violence as a problem solver for today and ever after.\nIt seems where most religions are built upon the past, the Church of Divined Connections is building upon the future, and that is appealing to a new generation of thinkers."}, {"id": "d8bde442-2049-4633-9f23-31ca1ec98fbb", "title": "Pine Nuts : Church of Divined Connections", "date": "2024-06-03 00:45", "url": "https://carsonnow.org/story/06/02/2024/pine-nuts-church-divined-connections", "message": "Inspired by Carson City’s, “Connections,” a friend of mine, Baobab, is constructing an emerging theology, and has agreed to an interview.\nQuestion: “So how does one welcome folks into a brand-new religion?”Baobab: “We welcome everybody to The Church of Divined Connections, Epicenter of Engagement in Empathy Toward Earth.\nAn improved attitude and resulting engagement will help us repair our sick atmosphere.”When intreated for thoughts on violence, Baobab intimated, “Violence never solves problems, only intensifies them.\nOne wag indicated to me that The Church of Divined Connections was going viral and quite possibly could put a lid on violence as a problem solver for today and ever after.\nIt seems where most religions are built upon the past, the Church of Divined Connections is building upon the future, and that is appealing to a new generation of thinkers."}, {"id": "bb1244cd-5a1b-4438-8c39-4d0c59554593", "title": "Welcome to World War III , where truth is the first casualty", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804356", "message": "In fact, I believe that we have already entered a Third World War.\n(credit: AFP VIA GETTY IMAGES)Like most wars – World War II is a perfect example – it is fought on two fronts.\nA war of ideologiesWHILE THIS world war revolves around the acquisition of land and partisan belief systems, it is also a War on Freedom, a War on Justice, and a War on Truth.\nIn this war, as in most wars, truth is the first casualty.\nWho will win this Third World War?"}, {"id": "c38b6696-4270-457f-8cf9-08447eaa99e6", "title": "Local WWII veteran celebrates 100th birthday", "date": "2024-06-03 02:45", "url": "https://www.wbay.com:443/2024/06/02/local-wwii-veteran-celebrates-100th-birthday/", "message": "WAUPACA, Wis. (WBAY) - A local veteran who served in World War II and was a prisoner of war celebrated his 100th birthday on Sunday.\nThey say that during the battle, Gilles’ unit was overrun and he suffered shrapnel injuries to his back and ankle.\nHe became a prisoner of war and was moved from one prison to another, often in extreme winter conditions.\nHe would survive, crediting his faith for guiding him through the ordeal, and was liberated at Moosburg on April 29, 1945.\nIn June of 1945, Gilles returned to the U.S. and eventually married his sweetheart Elaine Kleist on Thanksgiving 1947."}, {"id": "a881401d-5133-489c-b1bc-e761681a9f67", "title": "The call for renegotiation must go on - Kaieteur News", "date": "2024-06-03 06:45", "url": "https://www.kaieteurnewsonline.com/2024/06/03/the-call-for-renegotiation-must-go-on/", "message": "The call for renegotiation must go onKaieteur News – We have been at the forefront of the calls for renegotiation of the criminal oil contract that enslaves Guyana to ExxonMobil.\nWhen there were few other voices calling for renegotiation of the lopsided American oil company contract with this country, we were there, and we have been loud and persistent.\nRenegotiation affords some relief, some reversal, of this unspeakable crime that ExxonMobil has committed on the Guyanese people, and the ones unborn as of today.\nRenegotiation of the contract is not just leadership duty, a nice thing to preside over, a mere corrective measure.\nRenegotiation of the oil is more than to improve the state of Guyanese."}, {"id": "4c5d6ee6-9f0c-462c-894a-0a1c79eac74f", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II – Winnipeg Free Press", "date": "2024-06-03 06:00", "url": "https://www.winnipegfreepress.com/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii", "message": "WHO TOOK PARTFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "aeb40570-a883-4515-af06-5ee4dbd2407a", "title": "D - Day : 80th anniversary ceremonies kick off with parachute jump over Normandy", "date": "2024-06-03 01:15", "url": "https://www.kiro7.com/news/trending/d-day-80th-anniversary-ceremonies-kick-off-with-parachute-jump-over-normandy/Q2H36UYEURDGPD722XNGJVB3GA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "818475b7-d4a4-44b2-8579-6515865eae13", "title": "DFL delegates condemn antisemitism , call for cease - fire in Gaza", "date": "2024-06-03 03:45", "url": "https://www.twincities.com/2024/06/02/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war/", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone."}, {"id": "996b10c0-bbef-4a8b-9dae-24eb6fc9009a", "title": "NATO greenlights Ukraine use of weapons to target Russia , threatening nuclear war", "date": "2024-06-03 04:30", "url": "https://www.wsws.org/en/articles/2024/06/03/hphh-j03.html", "message": "The International Committee of the Fourth International (ICFI) condemns the latest escalation of the US-NATO war against Russia, which is rapidly spiraling into full-scale war between nuclear-armed states.\nAs for its European allies, their collaboration in this escalation is rivaled in its recklessness only by their catastrophic launching of World War I in 1914 and World War II in 1939.\nThe global capitalist system, whose insoluble global crisis is the underlying cause of genocide and war, is descending into barbarism.\nIt is the first time since the end of the Second World War that the US and its allies are directly targeting Russian territory.\nThe escalation against Russia therefore will entail a morphing of the conflict in Ukraine into a truly global war."}, {"id": "8e121123-4392-4b9d-bf4b-257e2809eccd", "title": "India joins U . S . Red Flag air and RIMPAC naval exercises", "date": "2024-06-03 02:30", "url": "https://www.thehindu.com/news/national/india-joins-uss-red-flag-air-and-rimpac-naval-exercises/article68243619.ece", "message": "Indian Air Force (IAF) and Indian Navy are taking part in two mega multinational war games hosted by their U.S. counterparts.\nThe IAF has deployed Rafale fighter jets for the two-week multinational air exercise Red Flag which commenced in Alaska on May 30.\nAn IAF contingent arrived today at the Eielson AF Base of US airforce, at Alaska, US, to participate in the upcoming edition of the multi-national exercise Red Flag 24.\nAimed to integrate aircrew in a multinational environment, Ex Red Flag is a two-week advanced aerial combat training exercise, it added.\nIndia has taken part in Ex Red Flag in the past which even saw the deployment of Russian SU-30MKI fighter jets."}, {"id": "5abbcd5b-63c0-4d04-875b-49be1112c7d8", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.yahoo.com/news/remembering-d-day-key-facts-052335249.html", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone."}, {"id": "94e341a1-5e2e-4ee3-8573-b0e723af7e72", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://apnews.com/article/dday-wwii-france-invasion-military-b02d03fa11f66767a521a3b01357a89a", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive."}, {"id": "9b4b8dba-8b7a-453a-be6b-d07950775772", "title": "Remembering D - Day : Key Facts and Figures about the Invasion That Changed the Course of World War II", "date": "2024-06-03 06:45", "url": "https://www.newsmax.com/world/globaltalk/dday-wwii-france-invasion-military/2024/06/03/id/1167206/", "message": "Nearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive."}, {"id": "32d6a214-38f2-425b-a94c-f89b9cb7bf63", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.ksat.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "b1ebd38a-f1d7-46d4-b483-3785805be8cb", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.clickondetroit.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "97495f1f-eed7-4a11-9e3c-1a8eac86cdc3", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.click2houston.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "50b73604-eb9c-40a7-96f9-fe1e63e83282", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.kiro7.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "862471e2-ae6c-4ceb-b0df-31646f937c8e", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.news4jax.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "55eac112-b0aa-46bc-8f27-c6873f5af45e", "title": "  He was a very , very good man : Son of D - Day medic talks about dad war legacy in Nat Geo series", "date": "2024-06-03 03:45", "url": "https://www.news24.com/life/arts-and-entertainment/tv/he-was-a-very-very-good-man-son-of-d-day-medic-talks-about-dads-war-legacy-in-nat-geo-series-20240603", "message": "For Stephen Woodson, son of World War 2 medic Waverly Woodson, telling his father's story of being part of the Battle of Normandy on 6 June 1944 was emotional but cathartic.\nStephen featured in National Geographic's (DStv 181) new series Erased: WW2's Heroes of Colour, which started airing on 26 May and ends on 16 June."}, {"id": "0fccf2a8-9970-4a60-887b-1a56def14317", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:30", "url": "https://www.clickorlando.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "55fb4fde-1dd4-4c46-ab7a-61f16b2c992c", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 07:00", "url": "https://www.wfmz.com/news/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of/article_70d7f7c9-0ef5-551f-998b-9460578e8a71.html", "message": "There might be a stray shower lingering early in the morning, primarily east.\nA couple showers or a thunderstorm will also be possible later in the afternoon into the early evening.\nWinds light and variable..TonightPartly cloudy.\nThere is a very low chance for an early evening shower or thunderstorm however most if not all should remain dry.\nWinds light and variable."}, {"id": "27530812-a520-489e-9ce7-f1a6297469d0", "title": "Israeli Airstrikes Rattle Aleppo : Casualties Reported", "date": "2024-06-03 04:30", "url": "https://www.devdiscourse.com/article/law-order/2959034-israeli-airstrikes-rattle-aleppo-casualties-reported", "message": "Israeli airstrikes around Aleppo, Syria, early Monday resulted in multiple fatalities, Syrian state media reported.\nThe state-run SANA news agency did not specify the toll, stating only that the strikes targeted the southeastern edge of Aleppo.\nSANA termed the attack as an 'aggression' that resulted in casualties and material damage.\nIsrael has not confirmed the strikes, a typical approach when dealing with Syria.\nIsrael and Syria have been in a state of war since Israel's establishment in 1948, with recent Israeli strikes often aimed at Iranian assets supporting Syrian President Bashar Assad in the prolonged conflict."}, {"id": "3d3e963b-5f61-434a-a0a1-5b1c4033b5c9", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II | iNFOnews", "date": "2024-06-03 06:15", "url": "https://infotel.ca/newsitem/d-day-80th-anniversary-by-the-numbers/cp2019097038", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIOMAHA BEACH, France (AP) — The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler's defenses in western Europe and change the course of World War II.\nWHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive."}, {"id": "d9d9b5d5-2048-4f15-b58d-5c54c60fb37c", "title": "MoD of Russia Report for June 2nd , 2024 … – Windows to Russia", "date": "2024-06-03 06:30", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-2nd-2024.html", "message": "MoD of Russia Report for June 2nd, 2024…Russian Defence Ministry report on the progress of the special military operation (2 June 2024)The Armed Forces of the Russian Federation continue the special military operation.\nSeven counter-attacks launched by units of the AFU 42nd Mechanised Brigade, 71st Jaeger Brigade, 82nd Assault Brigade were repelled near Glubokoye, Liptsy, and Volchansk (Kharkov region).\nThree counter-attacks launched by assault detachments of the AFU 63rd Mechanised Brigade were repelled near Chervonaya Dibrova (Lugansk People’s Republic).\nThe AFU losses amounted to 465 Ukrainian troops, one tank, three armoured fighting vehicles, and five pick-up trucks.\nThe AFU losses amounted to up to 290 Ukrainian troops, two armored fighting vehicles, and two motor vehicles."}, {"id": "a6149f1d-2524-4805-978f-97c644e34628", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsls.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans."}, {"id": "d24fd99e-93df-45ba-bde5-bfc1ec8f3440", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsbradio.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "31a3fb2c-72fc-4508-8fb4-8fe1e257e8d4", "title": "Israeli reservists fight in Gaza but question what comes after the war", "date": "2024-06-03 07:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-02/israel-reservists-gaza-ceasefire-14062383.html", "message": "Golan, a reserve tank instructor and student at Tel Aviv University, says she is troubled by the toll the uncertainty of the Gaza war is taking.\n(Heidi Levine/The Washington Post)ISRAEL-GAZA BORDER — As Israel’s war in Gaza rages, it’s leaning on a backbone of reservists to fight - soldiers who say they are committed to serve but who are also divided over what comes next.\nSince Israel launched its ground invasion of Gaza in late October, 293 Israeli troops have been killed, according to the military.\nThe official tally does not identify which casualties were reservists, and the Israel Defense Forces declined to comment.\nThen he added: “We can’t leave without an absolute victory.”But not everyone believes Israeli military control is the answer - even if they want to see Hamas defeated."}, {"id": "d07a0f81-fb25-4b75-9bb1-dcbefc03a735", "title": "The IAF Quest for 126 Mirage 2000 - 5 : A Tale of Bureaucracy , Costs , and Lost Opportunities – Indian Defence Research Wing", "date": "2024-06-03 07:00", "url": "https://idrw.org/the-iafs-quest-for-126-mirage-2000-5-a-tale-of-bureaucracy-costs-and-lost-opportunities/", "message": "The IAF’s Quest for 126 Mirage 2000-5: A Tale of Bureaucracy, Costs, and Lost Opportunities| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIn the late 1990s and early 2000s, the Indian Air Force (IAF) was on a quest to enhance its fighter jet fleet with a proven performer, particularly the upgraded Mirage 2000-5.\nThis quest was fueled by the superior performance of the Mirage 2000H during the Kargil War.\nThe French Dassault Mirage 2000-5 was an upgraded variant, boasting advanced avionics, radar systems, and improved combat performance.\nConsequently, the original Mirage 2000H procurement plans were shelved to save money, setting a precedent that would influence future decisions.\nFast forward to 2024, the acquisition of the Mirage 2000-5 or its equivalent remains unresolved."}, {"id": "294aaf62-0211-4fac-a8de-0b1ec02645b5", "title": "My Hero Academia Epilogue Debuts Deku Post - War Makeover", "date": "2024-06-03 06:45", "url": "https://comicbook.com/anime/news/my-hero-academia-manga-epilogue-deku/", "message": "Massive spoilers for My Hero Academia Chapter 424 to follow!\nMy Hero Academia has officially kicked off the epilogue for the manga series with its newest chapter, and with it has debuted Izuku Midoriya's new look after the war!\nMy Hero Academia has been spending the last few years fighting through the final battles against All For One and Tomura Shigaraki, and with the previous chapter officially brought these fights to an end with the final blow against All For One.\nMy Hero Academia has ushered in an official epilogue following the end of the fight against the villains, but it's clear that the manga is far from over.\n(Photo: Shueisha / Viz Media)My Hero Academia 424: Deku Begins His Post-War LifeMy Hero Academia Chapter 424 confirms that the fight against All For One has ended, and heroes from all over the world have come to Japan to help with the recovery efforts."}, {"id": "d4f90192-91b7-4635-9622-2a24f528f558", "title": "FReeper Canteen ~ Hall of Heroes : SSG Robby Miller ~ 03 June 2024", "date": "2024-06-03 00:30", "url": "https://freerepublic.com/focus/f-news/4241798/posts", "message": "~ Hall of Heroes ~ SSG Robby Miller Medal of Honor: Colleagues recall heroics of 'happy warrior' The ambush started with a shout of \"Allah akbar!\"\nRobby Miller's Special Forces team and the Afghan soldiers with it.\nThe two went through Special Forces training together, so McGarry was glad to see him when he arrived for duty with Company A, 3rd Battalion, 3rd Special Forces Group at Fort Bragg.\nSpecial Forces soldiers train to work with military forces in foreign countries.\n\"Without him doing what he did, there would be seven less Special Forces soldiers on the face of the Earth right now.\""}, {"id": "e4fc8f3c-3961-4392-967d-2f6a3616a746", "title": "Iran cyber attacks threaten the world - The Jerusalem Post", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804713", "message": "This warning, later confirmed by UK Minister for Security Tom Tugendhat, underscores the persistent and evolving threat posed by Iran’s cyber operations.\nIran’s cyber operations are not limited to state infrastructure; they also target the Jewish Diaspora.\nCYFIRMA’S report highlights that Iran’s cyber capabilities are among the most advanced globally.\nEnhancing cybersecurity measures and fostering a culture of vigilance are crucial to mitigating the risks posed by Iranian cyber operations.\nBy focusing on resilience and preparedness, the Jewish Diaspora, GCC countries, and Western societies can better protect themselves from the ever-growing threat of Iranian cyber warfare."}, {"id": "7b36ef2b-ec7e-4730-bc3d-3304184fa630", "title": "AI and War Top Agenda as Globalist Elites Gather for Bilderberg Meeting", "date": "2024-06-03 01:45", "url": "https://www.breitbart.com/politics/2024/06/02/future-of-warfare-tops-agenda-as-globalist-elites-gather-for-secretive-bilderberg-meeting-in-spain/", "message": "Founded in 1954 with a meeting hosted by Prince Bernhard of The Netherlands in the Hotel de Bilderberg in the Dutch village of Oosterbeek, the annual meeting of the Bilderberg Group is believed to be a driving force behind numerous globalist projects.\nUnlike similar institutions such as the World Economic Forum (WEF), the Bilderberg Meeting is conducted strictly behind closed doors with participants bound by the Chatham House Rule, which prohibits the disclosure of the identity of those behind any idea mentioned within the meeting.\nOfficially intended to allow for the free flow of discourse, the back-room nature of the meeting of global elites has fostered many theories about the influence the conference may exert on international policy.\nOther noteworthy participants include former Google CEO Eric Schmidt, Pfizer CEO Albert Bourla, Google DeepMind CEO Hassabis Demis, Microsoft AI CEO Mustafa Suleyman, and failed Georgia gubernatorial candidate Stacey Abrams.\nThe Guardian reports that security for this year’s conference was “intense… even by Bilderberg standards”, noting that protection featured “police drones hovering over the hotel”."}, {"id": "60ce5317-04ab-4c6a-904b-aecf34903f51", "title": "On This Day : Ayatollah Khomeini died in 1989", "date": "2024-06-03 03:45", "url": "https://in-cyprus.philenews.com/international/on-this-day-ayatollah-khomeini-died-in-1989/", "message": "1965: Astronaut Edward H. White II became the first American to perform a spacewalk during the Gemini 4 mission.\n1989: Ayatollah Ruhollah Khomeini, the Supreme Leader of Iran and a key figure in the 1979 Iranian Revolution, died.\n1989: Edward H. White II, the first American to walk in space, was posthumously awarded the Congressional Space Medal of Honor.\n1998: A high-speed train derailed near the town of Eschede, Germany, resulting in the deadliest railway accident in German history with 101 fatalities.\n2013: The trial of Chelsea Manning (formerly Bradley Manning), a US soldier who leaked classified documents to WikiLeaks, began at Fort Meade, Maryland."}, {"id": "5dfc663d-40dc-4c11-a568-202d2a1c8489", "title": "Why America loses wars", "date": "2024-06-03 06:15", "url": "https://tribune.com.pk/story/2469489/why-america-loses-wars", "message": "“Do we still understand how wars are won?” was the headline of an article written by Bret Stephens for his newspaper, The New York Times.\nAmerica withdrew in humiliation from Saigon in 1975, Beirut in 1984, Mogadishu in 1993 and Kabul in 2021.\n“If you’re on the left, you’d probably say that most if not all of these wars were unnecessary, unwinnable, or unworthy.\nScholars and policymakers in Pakistan should follow the conduct of America’s little wars across the globe.\nThe newspaper studied America’s 20-year involvement in Afghanistan by investigating thousands of cases that left a poor legacy for America in this critical country."}, {"id": "179ebad7-a684-44db-972f-a064d717e521", "title": "Hundreds Bid Farewell to Ukrainian Volunteer Medic Killed on Front Lines", "date": "2024-06-03 06:15", "url": "https://www.kyivpost.com/post/33674", "message": "Almost 1,000 mourners gathered in central Kyiv on Sunday for the memorial service of a high-profile journalist and volunteer combat medic who was killed in action last week.\nAt her funeral service at the Saint Michael's Golden-Domed Monastery on Sunday, hundreds wore colourful Ukrainian vyshyvankas -- embroidered national shirts -- and carried Ukrainian flags and flowers.\nPart of the Hospitallers volunteer battalion, Tsybukh was credited with saving the lives of many soldiers, often risking her own life to evacuate injured servicemen from the front lines.\nOther Topics of Interest ISW Russian Offensive Campaign Assessment, June 2, 2024 Latest from the Institute for the Study of War.\nLast year while serving on the front lines in the eastern Donetsk region, she wrote a farewell letter to be published in the case of her death."}, {"id": "7106badc-eef8-4b03-9e75-27b1ed2ab01c", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 05:00", "url": "https://www.inforum.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "a0b4e9aa-0a6c-47e8-8005-44e627625fab", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 02:15", "url": "https://www.duluthnewstribune.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "2b538224-5cbf-4aba-aedb-c63e3503b491", "title": "FG to deploy technology for surveillance of mining sites", "date": "2024-06-03 07:30", "url": "https://dailytrust.com/fg-to-deploy-technology-for-surveillance-of-mining-sites/", "message": "Dr Dele Alake, the Minister of Solid Minerals Development, says the Federal Government will deploy technology for the surveillance of mining sites across the country.…Dr Dele Alake, the Minister of Solid Minerals Development, says the Federal Government will deploy technology for the surveillance of mining sites across the country.\nHe said that the technology would be in addition to the 2,220 personnel of the Mining Marshal Corps drawn from the Nigeria Security and Civil Defence Corps (NSCDC) to combat illegal mining.\n“We are introducing some technology, we are not just relying on men and materials alone.\n“The satellite surveillance gadgets we are putting in there is to enable us see in real time in all mining sites in Nigeria.\n“But the mine marshals are just the face of the security apparatus that we are putting in place to combat illegal mining,” he said."}, {"id": "075f7096-e5b3-41ac-9c70-c229923835ff", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 01:30", "url": "https://www.postbulletin.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war-2", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nADVERTISEMENTPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nThat resolution, which condemns antisemitism, was amended to take the contested language out and delegates approved the resolution on Sunday."}, {"id": "2fcb5fb7-73bc-43e1-80ee-d1658065e10c", "title": "  A Death Trap for the Kremlin Force – Ukraine at War Update for June 3", "date": "2024-06-03 01:15", "url": "https://www.kyivpost.com/post/33672", "message": "After Russia conducted waves of drone and missile attacks on Ukraine’s energy infrastructure over the weekend, the nation’s grid operator announced daily energy restrictions, as its largest energy company specified how much power each major municipality would require.\nIt said that if the imposed limits are exceeded, regional distribution companies may reinstate hourly outage schedules as necessary.\nIn addition to power infrastructure, the attacks also hit civilian infrastructure and cultural heritage centers.\nAt present, Ukraine can import no more than 1,700 MWh of electricity from the EU at a time.\n“The video showing Russian soldiers abusing Ukrainian prisoners of war is spreading online,” Lubinets wrote."}, {"id": "54ac1d46-4422-48cc-9b9e-81b87bd23477", "title": "2025 Toyota LandCruiser Prado v GWM Tank 500 : Spec battle", "date": "2024-06-03 06:00", "url": "https://www.examiner.com.au/story/8650462/2025-toyota-landcruiser-prado-v-gwm-tank-500-spec-battle/?cs=34616", "message": "The Tank 500 is new for 2024 so there are no previous generations to compare against.\nEven in its most expensive variant, however, it's cheaper than the entire Prado range after on-road costs are applied."}, {"id": "206cd531-3f5f-4ff8-a9f1-2f8211bd37a6", "title": "Haikyu : The Dumpster Battle Posts Official Clip : Watch", "date": "2024-06-03 06:45", "url": "https://comicbook.com/anime/news/haikyu-dumpster-battle-movie-watch-clip/", "message": "The Dumpster Battle has shared the first official clip from its theatrical debut!\npic.twitter.com/0OIDqmG6Fl — Crunchyroll (@Crunchyroll) June 1, 2024What Is Haikyuu!!\nThe Dumpster Battle?\nThe Dumpster Battle is now available in theaters in the United States and Canada.\nThe Dumpster Battle as such:\"Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant.'"}, {"id": "605a0cb8-52b4-4bd3-8e17-9cdfa93bfc21", "title": "Israel battles Hamas as mediators urge both to accept Gaza truce plan", "date": "2024-06-03 04:30", "url": "https://economictimes.indiatimes.com/news/defence/israel-battles-hamas-as-mediators-urge-both-to-accept-gaza-truce-plan/articleshow/110649613.cms", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "45ee12c9-9935-4e22-98bf-0805f3eaca58", "title": "Massive drug haul in Chaibasa , Police recover Doda worth Rs 3 . 15 crores", "date": "2024-06-03 04:15", "url": "https://www.nyoooz.com/news/ranchi/1722494/massive-drug-haul-in-chaibasa-police-recover-doda-worth-rs-315-crores/", "message": "Doda is often called \"the poor mans heroin\" because its a narcotic derived from the same plant: the opium poppy.\nHe emphasized that such operations are crucial in the ongoing fight against drug trafficking in the region.\nThe recovered doda has been taken into police custody and further investigations are underway to identify the individuals involved in this large-scale drug operation.\nAuthorities have also urged the public to remain vigilant and report any suspicious activities to help in the fight against drug trafficking.\nThis substantial seizure of doda underscores the persistent efforts by the Chaibasa police to combat drug trafficking in the region."}, {"id": "4beb4d04-64b6-4d86-9160-ffe3f698292c", "title": "Mass parachute jump over Normandy kicks off commemorations for 80th anniversary of D - Day", "date": "2024-06-03 01:30", "url": "https://japantoday.com/category/world/a-mass-parachute-jump-over-normandy-kicks-commemorations-for-the-80th-anniversary-of-d-day", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,\" he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nLooping around one after another, the C-47s dropped strings of jumpers — 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history's force as she exited her plane into the Normandy skies."}, {"id": "1f811fe0-4523-4876-be49-1217d12d32b1", "title": "A mass parachute jump over Normandy kicks off commemorations for the 80th anniversary of D - Day", "date": "2024-06-03 03:45", "url": "https://www.cp24.com/news/a-mass-parachute-jump-over-normandy-kicks-off-commemorations-for-the-80th-anniversary-of-d-day-1.6910767", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,\" he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nLooping around one after another, the C-47s dropped strings of jumpers — 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history's force as she exited her plane into the Normandy skies."}, {"id": "2a5d992e-ee73-4670-959c-06111838da0e", "title": "Israel battles Hamas as mediators urge both to accept Gaza truce plan", "date": "2024-06-03 06:00", "url": "https://dunyanews.tv/en/World/815999-Israel-battles-Hamas-as-mediators-urge-both-to-accept-Gaza-truce-plan", "message": "Israel battles Hamas as mediators urge both to accept Gaza truce planWorld World Israel battles Hamas as mediators urge both to accept Gaza truce planHamas has said it \"views positively\" what Biden described as an Israeli proposal.\nPalestinian militant group Hamas, meanwhile, has said it \"views positively\" what Biden described as an Israeli proposal.\nMediators the United States, Qatar and Egypt later said they \"call on both Hamas and Israel to finalise the agreement embodying the principles outlined by President Joe Biden\".\nIn the besieged territory's north, Israeli helicopters fired at Gaza City's Zeitun and Sabra areas, AFP reporters said.\nThe Hamas government media office said that at least 32 people, many of them children, have died of malnutrition in Gaza since the war began."}, {"id": "57f1b537-8c2e-4b84-980d-ba613824fed1", "title": "Indian Maoists summon masses to … vote for big business Congress Party Part 1", "date": "2024-06-03 04:30", "url": "https://www.wsws.org/en/articles/2024/06/02/qqwq-j02.html", "message": "A section of the platform at the Maoist CPI (M-L) Liberation's Feb. 2023 Patna \"Save Democracy, Save India\" rally.\nIts campaign has been fronted by Congress Party leader Rahul Gandhi, the son, grandson and great grandson of Indian prime ministers.\nThe Trinamool Congress is nominally part of the INDIA alliance but rejected any “seat-sharing” with the Congress and the CPM-CPI led Left Front.\nThe CPI (M-L) Liberation election Charter was clearly drafted with a view to not embarrassing or offending its big business political allies.\nThrough this partnership, and with the full complicity and support of the Congress Party, the Indian bourgeoisie has harnessed the Indian people to US imperialism’s war drive, particularly against China."}, {"id": "35277d1d-b603-4289-8ecb-e41bc6bf9c1b", "title": "US , South Korean medics train to treat patients wounded in chemical , biological attacks", "date": "2024-06-03 07:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-03/south-korea-medics-cbrn-attacks-14063301.html", "message": "U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes)DAEJEON, South Korea — Soldiers with the 2nd Infantry Division recently joined South Korean army officers for a team-building and barrier-busting exercise in combat first aid.\nU.S. and South Korea medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes) U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\nU.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024."}, {"id": "4879117b-84be-449a-ac78-ce18d6d7bc96", "title": "Mediators press Israel , Hamas to agree to truce proposal", "date": "2024-06-03 06:00", "url": "https://www.ewn.co.za/2024/06/03/mediators-press-israel-hamas-to-agree-to-truce-proposal", "message": "RAFAH - Fresh strikes were reported in the Gazan city of Rafah overnight into Monday, as mediators urged Israel and Hamas to agree to a truce and hostage release deal outlined by US President Joe Biden.\nHamas has said it \"views positively\" what Biden described as an Israeli proposal.\nIn the calls, Blinken \"commended\" Israel on the proposal and \"emphasised that Hamas should take the deal without delay\".\nProtesters backing an immediate hostage release, who rallied again Saturday in Tel Aviv, want him to strike a truce deal, but his far-right allies are threatening to bring down the government if he does.\nMediators the United States, Qatar and Egypt later said they called \"on both Hamas and Israel to finalise the agreement embodying the principles outlined by President Joe Biden\"."}, {"id": "b847ac56-7770-4335-90ab-3e1e1ddd0bca", "title": "2025 Toyota LandCruiser Prado v GWM Tank 500 : Spec battle", "date": "2024-06-03 06:15", "url": "https://www.illawarramercury.com.au/story/8650462/2025-toyota-landcruiser-prado-v-gwm-tank-500-spec-battle/?cs=34616", "message": "The Tank 500 is new for 2024 so there are no previous generations to compare against.\nEven in its most expensive variant, however, it's cheaper than the entire Prado range after on-road costs are applied."}, {"id": "06e4e55f-132a-46a4-b76f-871c5ba0cb6f", "title": "In photos : The future of Saskatchewan pilots prepare for the sky", "date": "2024-06-03 00:15", "url": "https://globalnews.ca/news/10540615/in-photos-the-future-of-saskatchewan-pilots-prepare-for-the-sky/", "message": "She is one of several students enrolled at the Regina Flying Club, as demand for pilots across Canada continues to grow.\nRegina Flying Club General Manager James Topinka said the pilot shortage comes from increased demand rather than a lack of interest.\nAndrew Benson / Global NewsAt the club’s open house Sunday, they unveiled their new ‘Stratus Flight Academy’ to expand their reach to students.\nAndrew Benson / Global NewsView image in full screen Some of the instruments used by pilots.\nAndrew Benson / Global News"}, {"id": "5565bfef-c237-4c60-85b9-183887685792", "title": "Dumelo donates motorbikes , streetlights to UG Security Department", "date": "2024-06-03 05:30", "url": "http://www.businessghana.com/site/news/entertainment/307883/Dumelo-donates-motorbikes,-streetlights-to-UG%E2%80%99s-Security-Department", "message": "The donation was made personally by Mr. Dumelo on Tuesday, May 28, 2024.\nIn a post on X on Wednesday, May 29, John Dumelo expressed hope that this contribution would help combat incidents of phone snatching and petty thefts on both the Legon and UPSA campuses.\n“Yesterday I presented 2 brand new Motorcycles and streetlights to the security department of the University of Ghana.” The actor cum Politician said.\n“I hope this kind gesture will aid them to combat incidents of phone snatching and petty thefts on Legon and Upsa Campuses.\nThe Students need to be protected.” He added"}, {"id": "9bc592d6-c065-4ddf-883f-c75a8055fdfe", "title": "A mass parachute jump over Normandy kicks off commemorations for the 80th anniversary of D - Day", "date": "2024-06-03 06:15", "url": "https://www.pressherald.com/2024/06/02/a-mass-parachute-jump-over-normandy-kicks-off-commemorations-for-the-80th-anniversary-of-d-day/", "message": "“I thought that would have been the last view of England some of those lads of 1944 had,” he said.\nU.S. President Joe Biden, Ukrainian President Volodymyr Zelenskyy and British royals are among the VIPs that France is expecting for D-Day events.\nAdvertisementLooping around one after another, the C-47s dropped strings of jumpers – 70 in all, dressed in WWII-style uniforms.\nThe Normandy town was at the heart of D-Day drop zones in 1944, when paratroopers jumped in darkness into gunfire, many scattering far from their objectives.\nThe only woman was 61-year-old Dawna Bennett, who felt history’s force as she exited her plane into the Normandy skies."}]