[{"id": "2ea135d6-76c0-47d0-b5d8-1b62e2d2ca30", "title": "Kemp issues state of emergency ahead of Tropical Storm Debby", "date": "2024-08-06 03:00", "url": "https://www.wrdw.com/2024/08/05/ahead-storm-concerns-swirl-around-private-sc-dams/", "domain": "wrdw.com", "domain_classification": "Unknown", "message": "AUGUSTA, Ga. (WRDW/WAGT) - Ahead of Tropical Storm Debby’s possibly historic flooding, officials in South Carolina reached out to dam owners across the state.\nMore than 50 dams across South Carolina were breached during the 1,000-year flood.\nSouth Carolina leaders worry Debby could cause similar destruction this week.\nThey are asking dam owners to prepare now by:Clearing debris from spillways.\nStaff members with the South Carolina Department of Environmental Services are performing pre-storm assessments at high-hazard dams."}, {"id": "f8e74c5a-3479-4567-a1c6-70265b4ea239", "title": "How did Debby surge in Tampa Bay compare to previous storms ? ", "date": "2024-08-06 02:30", "url": "https://www.tampabay.com/hurricane/2024/08/05/tropical-storm-debby-data-flooding/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "Tampa Bay escaped Hurricane Debby without suffering surge flooding as harsh as other recent storms, data from the National Oceanic and Atmospheric Association shows.\nIn Tampa Bay, water levels at the region’s tidal gauge stations were elevated Monday, combining with excessive rainfall to cause severe flooding throughout low-lying neighborhoods, including Shore Acres and Riviera Bay.\nBut the storm surge was less severe than recent storms, including an unnamed December 2023 storm that never reached hurricane strength.\nAt points of high tide, water levels around Tampa Bay reached about 3 feet above the average height of the highest tide recorded each day.\n• • •Tampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters."}, {"id": "346dc2d6-a1f9-4d01-8144-094d67d10a13", "title": "Over $1 Million in Cocaine Blown onto Florida Beach by Hurricane Debby", "date": "2024-08-06 02:00", "url": "https://www.breitbart.com/weather/2024/08/05/over-1-million-cocaine-blown-florida-beach-hurricane-debby/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "More than $1 million worth of cocaine was washed onto a Florida beach as Hurricane Debby reached Florida, bringing heavy rains and flooding.\nSamuel Briggs II, the Acting Chief Patrol Agent for the United States Border Patrol in Miami revealed in a post on X that “25 packages of cocaine,” or roughly 70 pounds worth of cocaine was blown onto a beach located in the Florida Keys.\n“Hurricane Debby blew 25 packages of cocaine (70 lbs.)\nU.S. Border Patrol seized the drugs, which have a street value of over $1 million dollars.”Hurricane Debby blew 25 packages of cocaine (70 lbs.)\nMore: https://t.co/tW4KeGe9uJ pic.twitter.com/bhmOjb61f3 — National Hurricane Center (@NHC_Atlantic) August 5, 2024CNN reported that after hitting Florida as a hurricane, Debby would continue to “dump historic levels of rain and bring catastrophic flooding” while being classified as a tropical storm."}, {"id": "ff58447f-41f1-48ef-b246-27a3cc3819f2", "title": "Debby impact on Florida and Georgia shows another example of the growing trend in destructive , stalling hurricanes", "date": "2024-08-06 03:30", "url": "https://abc13.com/post/debbys-impact-florida-georgia-shows-another-example-growing-trend-destructive-stalling-hurricanes/15147542/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Debby yet another example of slow-moving or stalling hurricanes, part of a growing trendHurricane Debby made landfall as a Category 1 storm near Steinhatchee, Florida, early Monday morning.\nDebby is another example of a tropical storm or hurricane that slowed down or stalled after landfall.\nThree other notable storms that did the same were hurricanes Harvey in 2017, Florence in 2018, and Dorian in 2019.\nSeeing tropical storms or hurricanes \"slow down\" is not a new phenomenon.\nBecause tropical storms and hurricanes are large weather systems, it takes longer for them to fizzle out finally."}, {"id": "f883bbd4-9028-430b-adfd-22efea0758c7", "title": "Tropical Storm Debby is expected to send flooding to the Southeast . Here how much rain could fall", "date": "2024-08-06 04:30", "url": "https://www.yahoo.com/news/tropical-storm-debby-expected-send-040936220.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is expected to send flooding to the Southeast.\nBut experts say the worst is yet to come as the storm system is expected to stall over the Southeast region.\nMore than 23 inches (58 centimeters) of rain was recorded in South Carolina after that storm hit the Carolinas.\nNorthern Florida as well as low-lying areas including Savannah, Georgia, and Hilton Head Island and Charleston, South Carolina, are expected to see the most severe flooding.\nFew places in South Carolina are as susceptible to flooding as Charleston."}, {"id": "bbf073d9-bd4e-49b9-afdf-eb25f1ffa1a4", "title": "Debby bringing  catastrophic  flooding to Southeast", "date": "2024-08-06 02:45", "url": "https://www.yahoo.com/news/debby-bringing-catastrophic-flooding-southeast-002116565.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Forecasters are warning that Tropical Storm Debby could bring “catastrophic flooding” to the Southeast this week after the storm ripped through Florida on Monday.\nThe storm brought severe flooding and high winds to the state, where Gov.\nIt downgraded to a tropical storm by 11 a.m., according to the governor’s office.\n“Potentially historic heavy rainfall across southeast Georgia and the coastal plain of South Carolina through Saturday morning will likely result in areas of catastrophic flooding,” the National Hurricane Center said in its forecast.\n“As Tropical Storm Debby passes, stay safe and avoid driving if you are in an impacted area."}, {"id": "47f424cf-28ac-4d57-9564-0a517dd744e1", "title": "4 dead after Debby slams Florida , causing massive flooding and widespread outages : Updates", "date": "2024-08-06 04:30", "url": "https://www.aol.com/hurricane-debby-very-near-landfall-092234843.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Ron DeSantis said the Florida National Guard and Florida State Guard were activated to support humanitarian assistance and search-and-rescue missions.\nHenry McMaster declared a state of emergency on Sunday as Tropical Storm Debby readied to hit South Carolina’s coast this week.\n– Savannah Moss, Greenville NewsTropical Storm Debby is forecast to drop big rainfall as it crawls through the Southeast.\nIn Taylor County, where Hurricane Debby made landfall at 7 a.m., more than 97% of utility customers lost power at one point.\nContributing: ReutersThis article originally appeared on USA TODAY: Debby updates: Deadly storm slams Florida with rain, powerful winds"}, {"id": "d74c8fdf-8d5f-4269-accd-0e5eedb07f03", "title": "Five dead as Tropical Storm Debby soaks south - eastern US", "date": "2024-08-06 04:30", "url": "https://www.myjoyonline.com/five-dead-as-tropical-storm-debby-soaks-south-eastern-us/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "At least five people have been killed after Hurricane Debby slammed into Florida before weakening to a tropical storm.\nThe National Hurricane Center warned of a \"life-threatening\" flood threat as the \"slow-moving storm\" drops \"torrential rains\".\nDebby made landfall on Monday morning as a category one hurricane in the Big Bend region of Florida's Gulf Coast.\nThe slow-moving pace of the storm could bring “catastrophic flooding”, Jamie Rhome, the deputy director of the hurricane centre, said.\nBefore the storm made landfall, Florida Governor Ron DeSantis declared a state of emergency for 61 of Florida's 67 counties."}, {"id": "b364027c-44bc-4a1d-bcdd-c739d860e854", "title": "Tropical Storm Debby : Tropical storm Debby ravages Florida and Georgia : Many dead , cities flooded , thousands left without power", "date": "2024-08-06 03:00", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debby-ravages-florida-and-georgia-many-dead-cities-flooded-thousands-left-without-power/articleshow/112302649.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Key developments:Casualties:Rescues and evacuations:Flooding threat:Power outages:State of emergency:Flight cancellations:Charleston curfew:Government response:Continued threat:Historical context:Uncertainty ahead:As Tropical Storm Debby continues to wreak havoc across the southeastern United States, the storm has brought unprecedented rainfall, deadly winds, and widespread flooding .\nThe storm, which made landfall in Florida as a Category 1 hurricane, has already resulted in multiple deaths, mass evacuations, and significant damage across Florida, Georgia , and the Carolinas.Authorities are racing against time to rescue residents from flooded homes, particularly in Sarasota, Florida, and Manatee County, where hundreds have been rescued.\nThe storm's path has brought it into Georgia and is expected to stall, bringing even more rainfall and potential catastrophic flooding to the region.The storm has since weakened to a tropical storm but continues to pose a significant threat, particularly to low-lying areas along the Eastern seaboard.\nIn Florida, a 13-year-old boy died when a tree fell on a mobile home.\nAdditionally, a truck driver was killed in Tampa after losing control of his vehicle in the storm.Approximately 500 people were rescued from flooded homes in Sarasota, while 186 were saved in nearby Manatee County."}, {"id": "90627644-f8f1-4bec-b63e-643a5126b5ff", "title": "Tropical Storm Debby could prove just as dangerous as a major hurricane", "date": "2024-08-06 03:15", "url": "http://www.houstonchronicle.com/news/article/tropical-storm-debby-could-prove-just-as-19621697.php", "domain": "houstonchronicle.com", "domain_classification": "Unknown", "message": "(NOAA via AP) AP Storm surge breaks over a small sea wall near boat docks, Monday, Aug. 5, 2024, in Horseshoe Beach, Fla. Hurricane Debby made landfall early this morning.\nHurricane Debby made landfall early this morning.\nChris O'Meara/APTALLAHASSEE, Fla. (AP) — Tropical Storm Debby came ashore in Florida as a Category 1 hurricane Monday and quickly downgraded, but the storm still poses serious threats as it slogs on toward Georgia and South Carolina.\nWinds won’t be the biggest danger, making the storm's category far less important than the potential for catastrophic flooding.\nThe circumference of a storm, how fast it’s moving, the amount of rain it delivers, storm surge and high tides are all other factors that matter."}, {"id": "62a82e16-f127-4778-8d94-3c888b7c9573", "title": "Tropical Storm Debby could prove just as dangerous as a major hurricane", "date": "2024-08-06 03:15", "url": "https://apnews.com/article/hurricane-debby-florida-georgia-south-carolina-f69572001f569842faa46235bc2640a6", "domain": "apnews.com", "domain_classification": "International", "message": "TALLAHASSEE, Fla. (AP) — Tropical Storm Debby came ashore in Florida as a Category 1 hurricane Monday and quickly downgraded, but the storm still poses serious threats as it slogs on toward Georgia and South Carolina.\nWinds won’t be the biggest danger, making the storm’s category far less important than the potential for catastrophic flooding.\nThe Saffir-Simpson Scale measures only the strength of a hurricane’s winds from Category 1 to Category 5, the strongest.\nIf I don’t live in the zone, I don’t flood.’ No!\nNot being in that special risk area doesn’t mean you don’t flood, it just means the insurance is cheaper,” he said."}, {"id": "3d0b9af7-0cb6-4eee-9ebb-0a102e0ab5e2", "title": "Tropical Storm Debby could prove just as dangerous as a major hurricane", "date": "2024-08-06 00:00", "url": "https://www.local10.com/news/national/2024/08/05/tropical-storm-debby-could-prove-just-as-dangerous-as-a-major-hurricane/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(NOAA via AP)TALLAHASSEE, Fla. – Tropical Storm Debby came ashore in Florida as a Category 1 hurricane Monday and quickly downgraded, but the storm still poses serious threats as it slogs on toward Georgia and South Carolina.\nWinds won’t be the biggest danger, making the storm's category far less important than the potential for catastrophic flooding.\nRecommended VideosThe Saffir-Simpson Scale measures only the strength of a hurricane’s winds from Category 1 to Category 5, the strongest.\nIf I don’t live in the zone, I don’t flood.’ No!\nNot being in that special risk area doesn’t mean you don’t flood, it just means the insurance is cheaper,” he said."}, {"id": "e84bdfea-5c05-4da3-9cc8-36bba0878aa2", "title": "Tropical Storm Debby could prove just as dangerous as a major hurricane", "date": "2024-08-06 03:15", "url": "https://isp.netscape.com/news/story/0001/20240805/f69572001f569842faa46235bc2640a6", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby could prove just as dangerous as a major hurricaneTALLAHASSEE, Fla. (AP) — Tropical Storm Debby came ashore in Florida as a Category 1 hurricane Monday and quickly downgraded, but the storm still poses serious threats as it slogs on toward Georgia and South Carolina.\nWinds won’t be the biggest danger, making the storm's category far less important than the potential for catastrophic flooding.\nThe Saffir-Simpson Scale measures only the strength of a hurricane’s winds from Category 1 to Category 5, the strongest.\nIf I don’t live in the zone, I don’t flood.’ No!\nNot being in that special risk area doesn’t mean you don’t flood, it just means the insurance is cheaper,” he said."}, {"id": "3b6cae2a-27aa-4b10-b7f1-8de711be269f", "title": "Threat of flooding remains as Tropical Storm Debby continues path towards NC", "date": "2024-08-06 04:00", "url": "https://www.yahoo.com/news/threat-flooding-remains-tropical-storm-022442685.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Those days of heavy rain means the threat of flooding later this week.\nThe time over the water could allow for the storm to gradually strengthen into a strong tropical storm Thursday.\nIn addition to the rain issues, tropical storm conditions are possible along the coast of North Carolina.\nA Tropical Storm Watch has been issued for a part of the North Carolina coastline from around Surf City down toward the South Carolina border.\nA Tropical Storm Watch means tropical storm conditions of sustained winds of 39 to 73 m.p.h."}, {"id": "cc9b7ea2-8b57-45e6-bbe6-eb209f146148", "title": "Debby blamed for at least 4 deaths in Florida as it bears down on Georgia", "date": "2024-08-06 02:45", "url": "https://www.wishtv.com/weather/weather-stories/debby-blamed-for-at-least-4-deaths-in-florida-as-it-bears-down-on-georgia/", "domain": "wishtv.com", "domain_classification": "Unknown", "message": "No evacuations planned for now in South Carolina, officials sayState officials don’t plan any evacuations in South Carolina for now as Tropical Storm Debby slowly spins toward the state.\nVice President Harris postpones trip to GeorgiaVice President Kamala Harris is postponing a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nDebby made landfall in Florida on Monday as a Category 1 hurricane and was expected to bring potentially record-setting rainfall to Georgia and South Carolina as it heads east.\nDebby made landfall as a hurricane in the Big Bend region of Florida, one of the state’s least populated areas.\nForecasters are still warning that heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia."}, {"id": "4db12d58-64c5-45b7-a35e-e9aadc1b81ee", "title": "The Latest : Debby blamed for multiple deaths in Florida , Georgia , leaves thousands without power", "date": "2024-08-06 02:00", "url": "https://gazette.com/ap/national/the-latest-debby-blamed-for-multiple-deaths-in-florida-georgia-leaves-thousands-without-power/article_6c218af5-d063-5455-a4e6-408d930573ff.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical storm Debby made landfall as a hurricane in one of the least populated areas of Florida, but it's been blamed for at least four deaths in that state"}, {"id": "6fd4e5bb-2821-4332-ac11-2983800cd17a", "title": "Slow - moving Tropical Storm Debby bringing torrential rains , major flood threat to southeastern US", "date": "2024-08-06 04:30", "url": "https://www.yahoo.com/news/slow-moving-tropical-storm-debby-040751505.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Flash flood warnings were issued in Savannah, Georgia, and Charleston, South Carolina, among other areas of coastal Georgia and South Carolina.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday.\nNorth Carolina is also under a state of emergency after Gov.\nSeveral areas along the state’s coastline are prone to flooding, such as Wilmington and the Outer Banks, according to the North Carolina Floodplain Mapping Program.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "3c0d4fd0-8872-4320-bc01-8f775284a882", "title": "At least 4 Florida deaths linked to Hurricane Debby – NBC Bay Area", "date": "2024-08-06 01:30", "url": "https://www.nbcbayarea.com/news/national-international/hurricane-debby-brings-flooding-damage-to-florida/3615961/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Two people were killed in a crash in Dixie County while one person was killed in a crash in Hillsborough County, DeSantis said.\nGetty Images A person walks through a flooded street caused by the rain and storm surge from Hurricane Debby on Aug. 5, 2024, in Cedar Key, Florida.\nHurricane Debby has followed a track “very similar to Idalia 11 months ago,” DeSantis said.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nPerez, the director of the town’s tourism department, said she has a new roof after Hurricane Idalia tore it apart in August 2023."}, {"id": "2234f844-891f-4018-94e4-067acd32a02c", "title": "Tropical Storm Debby hits Florida with floods , threat of record rain in Georgia and the Carolinas", "date": "2024-08-06 03:15", "url": "https://www.theday.com/nation/20240805/tropical-storm-debby-hits-florida-with-floods-threat-of-record-rain-in-georgia-and-the-carolinas/", "domain": "theday.com", "domain_classification": "Unknown", "message": "“We are facing an unprecedented weather event with Hurricane Debby,” said Jodie Fiske, public safety director for Manatee County public.\nHurricane Debby made landfall early Monday.\n19 in Tarpon Springs, Fla., Monday morning, Aug 5, 2024, as Hurricane Debby passes the Tampa Bay area offshore.\nForecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nOlds Park, Monday morning, Aug. 5, 2024, in Oldsmar Fla., as Hurricane Debby passes the Tampa Bay area offshore."}, {"id": "7208ac11-55ab-40ea-8629-a8df144d2932", "title": "At Least 700 Rescued From Hurricane Debby Floodwaters , Some Deaths Reported", "date": "2024-08-06 03:30", "url": "https://www.klove.com/news/us-and-world/at-least-700-rescued-from-hurricane-debby-floodwaters-some-deaths-reported-51426", "domain": "klove.com", "domain_classification": "Unknown", "message": "“We are facing an unprecedented weather event with Hurricane Debby,” said Jodie Fiske, Manatee County's public safety director.\nNo evacuations planned for now in South Carolina, officials sayState officials don’t plan any evacuations in South Carolina for now as Tropical Storm Debby slowly spins toward the state.\nBiden approves request from South Carolina's governor for emergency declarationThe White House said Monday that President Joe Biden has approved a request from South Carolina Gov.\nVice President Harris postpones trip to GeorgiaVice President Kamala Harris is postponing a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nForecasters are still warning that heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia."}, {"id": "f608f2de-d86c-48cb-b994-dc03af40c7fb", "title": "Biden OKs federal aid for South Carolina following emergency declaration request", "date": "2024-08-06 02:15", "url": "https://www.yahoo.com/news/biden-oks-federal-aid-south-000510503.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MYRTLE BEACH, S.C. (WBTW) — FEMA on Tuesday announced the availability of disaster assistance for South Carolina to supplement response efforts related to Tropical Storm Debby.\nDebby made landfall Tuesday morning as a Category 1 hurricane on the Florida bend before weakening back to a tropical storm.\nOver the next several days, a “catastrophic flash and urban flooding” is almost certain in coastal areas of South Carolina, with more than 30 inches of rain possible.\nHenry McMaster on Monday issued a state of emergency for potential effects from Tropical Storm Debby.\nHe is a veteran South Carolina reporter with previous stops at the Greenwood Index-Journal, Post & Courier and The Sun News in Myrtle Beach."}, {"id": "7ec0d6d7-950e-419b-b7e6-dc924fe388bd", "title": "  Catastrophic  Tropical Storm Debby headed to South Carolina , McMaster details response", "date": "2024-08-06 01:15", "url": "https://www.yahoo.com/news/catastrophic-tropical-storm-debby-headed-233535183.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Henry McMaster and several state emergency management officials detailed response plans Monday to Tropical Storm Debby.\nAccording to the National Hurricane Center, Tropical Storm Debby is expected to hit South Carolina’s coast this week.\nSouth Carolina Emergency Management Division has several resources including the 2024 South Carolina Hurricane Guide, which is available in English and Spanish.\n“Tropical Storm Debby is not just a coastal event, it’s a statewide event,” South Carolina Emergency Management Division Director Kim Stenson said.\nMcMaster warns of 'catastrophic' storm headed to South Carolina"}, {"id": "77ef2cfe-2104-4e64-bd40-0c5590f5cb8f", "title": "US Border Patrol : Hurricane Debby unexpected find : $1 million in cocaine found on Florida beach amidst hurricane aftermath", "date": "2024-08-06 04:30", "url": "https://timesofindia.indiatimes.com/world/us/hurricane-debbys-unexpected-find-1-million-in-cocaine-found-on-florida-beach-amidst-hurricane-aftermath/articleshow/112305581.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Hurricane Debby that made landfall on Florida on Monday, not only brought high winds and torrential rain but also an unexpected discovery- 25 tightly sealed packages of cocaine worth over a staggering $1 million.\n\"Hurricane Debby blew 25 packages of cocaine (70 lbs.)\nonto a beach in the Florida Keys,\" US Border Patrol acting chief patrol Agent Samuel Briggs II wrote on X.The valuable stash, which Briggs estimated at over $1 million, was found by a concerned citizen who contacted the authorities, as reported by AFP.This isn't the first time such an incident has occurred.\nIn July 2023, the mayor of Tampa, Florida, similarly stumbled upon 70 pounds (31.7 kilograms) of cocaine that had washed ashore in the Florida Keys during a vacation.Debby struck Florida's northern Big Bend region as a Category One hurricane before weakening to a tropical storm.\nAs the storm's effects were felt across the state, with the cocaine washing up along the southernmost shores of the Florida Keys.In addition to bringing cocaine, Debby has killed one person, knocked out power for hundreds of thousands of people, and could produce life-threatening storm surges as well as catastrophic flooding.The Florida Keys, a chain of islands extending from the southern tip of the state, are situated near several Caribbean nations that are key transit points for cocaine trafficking from South America to Europe and North America, including into Florida."}, {"id": "1ebda177-4b30-4ea5-8ce3-60c95194d7e4", "title": "Hurricane Debby missed Tampa Bay . Is the worst over ? ", "date": "2024-08-06 02:30", "url": "https://www.tampabay.com/news/florida-politics/2024/08/05/hurricane-debby-missed-tampa-bay-is-worst-over/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "For the umpteenth consecutive hurricane, the Tampa Bay region was spared the worst of a major system — in this case, Category 1 Hurricane Debby, which barreled into Steinhatchee in Florida’s Big Bend.\nFor some around the Tampa Bay area, there will be no anxiety over the behavior of rivers and bays.\nNo major hurricane has hit the Tampa Bay region since October 1921.\nEmergency planners and meteorologists often say with a run of luck this good, they fear the Tampa Bay region could grow complacent.\nBut Clay said Debby will remind Tampa Bay that complacency is dangerous between the months of June and November."}, {"id": "c676f279-4546-4408-9ac3-ddf9461c6604", "title": "The Latest : Debby blamed for multiple deaths in Florida , Georgia , leaves thousands without power", "date": "2024-08-06 03:15", "url": "https://isp.netscape.com/news/story/0001/20240806/e555c97a3dbaae9c14119f6d046f7e33", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "The Latest: Debby blamed for multiple deaths in Florida, Georgia, leaves thousands without powerHigh winds and heavy rains from Tropical Storm Debby lashed Florida on Monday.\n“We are facing an unprecedented weather event with Hurricane Debby,” said Jodie Fiske, Manatee County's public safety director.\nNo evacuations planned for now in South Carolina, officials sayState officials don’t plan any evacuations in South Carolina for now as Tropical Storm Debby slowly spins toward the state.\nBiden approves request from South Carolina's governor for emergency declarationThe White House said Monday that President Joe Biden has approved a request from South Carolina Gov.\nForecasters are still warning that heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia."}, {"id": "e3d69125-5047-414f-a643-5d5a756d8516", "title": "Tropical Storm Debby hits Florida with floods , threat of record rain in Georgia and the Carolinas", "date": "2024-08-06 03:15", "url": "https://isp.netscape.com/news/story/0001/20240806/eb9fc50d578826784824f35ba943a6da", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "“We are facing an unprecedented weather event with Hurricane Debby,” said Jodie Fiske, public safety director for Manatee County.\nThe potential for high water also threatened Savannah, Georgia, and Charleston, South Carolina.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nSeveral areas along the state’s coastline are prone to flooding, such as Wilmington and the Outer Banks, according to the North Carolina Floodplain Mapping Program.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "57f23355-3902-4609-9093-885881191672", "title": "Tropical Storm Debby hits Florida with floods , threat of record rain in Georgia and the Carolinas", "date": "2024-08-06 02:00", "url": "https://gazette.com/ap/national/tropical-storm-debby-hits-florida-with-floods-threat-of-record-rain-in-georgia-and-the/article_2798124c-bced-58ce-9389-353f706b272e.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby hits Florida with floods, threat of record rain in Georgia and the CarolinasTropical Storm Debby slammed Florida with torrential rain, high winds and flooding, contributing to at least five deaths as it turned menacingly toward the Eastern Seaboard’s low-lying regions and threatened to flood some of America’s most historic Southern cities"}, {"id": "10bf86e9-3e61-4033-bdda-0f65b06afcd3", "title": "McMaster , state officials give update on Tropical Storm Debby preparations", "date": "2024-08-06 01:30", "url": "https://www.live5news.com/2024/08/05/mcmaster-state-officials-give-update-tropical-storm-debby-preparations/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WCSC) - Residents of South Carolina are bracing for Tropical Storm Debby, which is expected to bring heavy rain and flash flooding to the entire state.\nHenry McMaster is urging South Carolinians to be prepared, calling Tropical Storm Debby “an animal that we don’t think we’ve seen before.”Even though this storm is not classified as a hurricane, Gov.\nMaybe — we don’t know, so stay alert, stay tuned, and stay safe,” McMaster said.\nMcMaster declared a state of emergency Sunday evening, citing the likely effects of Tropical Storm Debby.\n“Team South Carolina is closely monitoring Tropical Storm Debby and has begun preparing for its potential impact on our state,” McMaster said."}, {"id": "db550d56-7f8a-4cc1-85b2-a4da7ef1336a", "title": "Hurricane Debby is dangerously rainy because it formed over abnormally warm water", "date": "2024-08-06 03:00", "url": "https://www.capeandislands.org/2024-08-05/hurricane-debby-is-dangerously-rainy-because-it-formed-over-abnormally-warm-water", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Rebecca Hersher from NPR's climate desk explains why a hotter planet is partly to blame for flooding from Debby.\nREBECCA HERSHER, BYLINE: Debby is carrying an absolutely tremendous amount of moisture.\nWell, one reason is that Debby formed over abnormally warm water in the Gulf of Mexico.\nAll of which means more moisture for hurricanes, which means more rain from storms like Debby.\nRebecca Hersher, NPR News."}, {"id": "7e4292fe-ac68-4df2-9bcb-ea64bef9b664", "title": "Debby disrupts travel plans as delays , cancellations continue at South Florida airports", "date": "2024-08-06 00:00", "url": "https://www.local10.com/weather/hurricane/2024/08/05/debby-disrupts-travel-plans-as-delays-cancellations-continue-at-south-florida-airports/", "domain": "local10.com", "domain_classification": "Unknown", "message": "While South Florida may have been spared from severe damage, the storm made landfall as a Category 1 hurricane on Monday, disrupting travel plans across the region.\nAt Miami International Airport, long lines continued to back up Monday as the arrival and departure boards remained covered in delays and cancellations.\n“Right now we are looking at about 137 cancellations,” airport spokesperson Jack Varela said.\n“That is the first time we have seen hurricane winds.”At Fort Lauderdale-Hollywood International Airport, there were more than 90 delays and 47 cancellations.\nOfficials said they are hopeful that as Debby makes its way out into the Atlantic, it will alleviate some of the flight delays and cancellations."}, {"id": "59e76e01-9e97-4507-be0d-bf80112cbb2f", "title": "Hurricane Debby Washes $1 Million Worth Of Cocaine Onto Florida Beach", "date": "2024-08-06 02:15", "url": "https://dailycaller.com/2024/08/05/hurricane-debby-1-million-cocaine-florida-beach/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "U.S. Border Patrol acting chief patrol Agent Samuel announced on social media Hurricane Debby washed $1 million worth of cocaine onto a Florida beach Monday.\nOver $1 million worth of cocaine washed ashore in the Florida Keys following the havoc wreaked by Hurricane Debby, a Category 1 storm struck the Gulf Coast’s Big Bend area.\nHurricane Debby blew 25 packages of cocaine (70 lbs.)\nAfter the discovery, the individual contacted the authorities, leading to the seizure of the narcotics by the US Border Patrol.\nJust another Florida Day with Hurricane Debby."}, {"id": "cfdb6162-43e9-43ef-95e6-82ba8cf6c803", "title": "Tropical Storm Debby moving through Gulf toward Florida with hurricane warnings", "date": "2024-08-06 03:00", "url": "https://www.local3news.com/local-news/alabama/tropical-storm-debby-moving-through-gulf-toward-florida-with-hurricane-warnings/article_9b06f32f-05e8-5714-8e33-f65411134980.html", "domain": "local3news.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "3be4ff68-bae8-4f5e-ad03-6458c68975fc", "title": "Tropical Storm Debby hits Florida with floods , threat of record rain in Georgia and the Carolinas", "date": "2024-08-06 04:00", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/tropical-storm-debby-hits-florida-with-floods-threat-of-record-rain-in-georgia-and-the/article_815ac7df-e3cc-5f17-b4d9-21a97593ae15.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}]