[{"id": "292f51a5-4115-427e-b336-9cb403e8c1f5", "title": "Rishi Sunak pledges to keep British Jews safe amid Israel", "date": "2024-06-16 11:30", "url": "http://www.myanmarmuslim.net/news/20240616173e599772.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Rishi Sunak has said he will “stop at nothing” to keep Britain’s Jewish community safe, before promising support for Israel along with other world leaders after the Hamas attacks.\nThe UK prime minister addressed a synagogue in north London to express his solidarity for Israel and to reassure Britain’s Jews.\n“We stand with Israel, the United Kingdom stands with Israel against this terrorism today, tomorrow and always,” Mr Sunak said.\nIn Westminster, around 2,000 people attended a Jewish community vigil, arranged by the Board of Deputies of British Jews and the Jewish Leadership Council.\nIt’s not going to lead anywhere.”The British Red Cross has launched an emergency fundraising appeal to provide humanitarian support in Israel and Gaza."}, {"id": "dbebff99-96ed-4ae2-8da2-13c4aa95e5bb", "title": "Charlotte Church joins pro - Winning Odds", "date": "2024-06-16 13:30", "url": "http://www.myanmarmuslim.net/news/20240616574f599423.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Welsh singer Charlotte Church said she was spreading a “loving message” as she joined a pro-Palestine rally following the backlash she received for singing a protest chant.\nIn late February, the 38-year-old led a rendition of From The River To The Sea at a Sing For Palestine fundraising event in Wales which the Campaign Against Antisemitism called a “genocidal chant”.\nOn Saturday, the singer from Cardiff marched alongside thousands of protesters in central London calling for an immediate ceasefire in Gaza.\n“But a strong, a peaceful, a loving message, that’s what every single march that I’ve been on for Palestine has been about.\nIt comes as the Government’s counter-extremism tsar warned that London’s streets have become a “no-go zone for Jews” during pro-Palestine protests."}, {"id": "cb0236a5-4f7a-4cf6-ba81-f4d997c11614", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "5a6e32c4-82cf-4580-b32a-8e6ea1a65d25", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 06:00", "url": "https://www.brisbanetimes.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "de8397fc-6189-4f43-b5bc-5919299bb808", "title": "Letters : In praise of the kindness of strangers at a frightening time", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/letters/letters-in-praise-of-the-kindness-of-strangers-at-a-frightening-time/a1951174018.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "I am extremely grateful to each and every one for the kindness shown to me at the time I needed it most.\nAnd people who fancy a flutter or a visit to a racetrack might reflect on what they are supporting.\nI would like to think the Government will respond to the RTÉ report, an example of public broadcasting at its best.\nOur relay teams typify the ­Ireland that I love, which is built on that great Irish custom of inclusiveness.\nGiven the world we live in today and as a fellow Dubliner, I think it’s important to say this again."}]