[{"id": "66286c64-7ca4-4672-b87f-fb224d4698b5", "title": "Israel strikes Baalbek after Hezbollah multi - drone attack on Tiberias", "date": "2024-05-16 10:30", "url": "https://www.naharnet.com:443/stories/en/305241-israel-strikes-baalbek-after-hezbollah-multi-drone-attack-on-tiberias", "message": "Israeli jets raided areas in the Baalbek district overnight after Hezbollah launched multiple drones at a base near the Israeli city of Tiberias -- one of its deepest attacks into Israeli territory in months of cross-border fighting.\nThe Israeli military said there were no injuries from the strike.\nThe Israeli strikes came hours after Hezbollah attacked with explosive drones an Israeli military base near the city of Tiberias.\nIsrael and Hamas ally Hezbollah have exchanged near-daily fire following the Palestinian group's October 7 attack on southern Israel that sparked the war in Gaza.\nEarlier on Wednesday, Hezbollah said it launched dozens of rockets at military positions in northern Israel."}, {"id": "130d9c3b-dfbf-44ef-bdb0-010242844292", "title": "Over 60 Rockets Launched At Israeli Military Bases , Says Hezbollah", "date": "2024-05-16 11:30", "url": "https://www.ndtv.com/world-news/over-60-rockets-launched-at-israeli-military-bases-says-hezbollah-5676102", "message": "Lebanon's Iran-backed Hezbollah group said it launched on Thursday \"more than 60\" rockets at Israeli military positions in retaliation for overnight air strikes on the country's east.\nHezbollah fighters \"launched a missile attack with more than 60 Katyusha rockets\" on several Israeli military positions in the Israeli-annexed Golan Heights, the group said in a statement.\nEarlier Thursday, Lebanese state-run media reported an overnight Israeli air raid on the Baalbek area, where Hezbollah holds sway, hours after the group launched an attack deep into Israeli territory.\nThe Israeli strikes \"slightly injured a citizen\" and caused fires, the NNA added.\nA source close to Hezbollah told AFP that one of the strikes \"hit a Hezbollah military camp\"."}, {"id": "4715bbe9-429c-4d07-a602-4e76e598a125", "title": "Live updates : Israel - Hamas war , Rafah invasion looms as Israel battles Hamas in the north", "date": "2024-05-16 11:15", "url": "https://www.cnn.com/world/live-news/israel-hamas-war-gaza-news-05-16-24/", "message": "President Joe Biden delivers remarks while meeting with the Joint Chiefs and Combatant Commanders in the Cabinet Room of the White House in Washington, DC, on May 15.\nIt is unlikely to be taken up in the Democratic-led Senate and the White House has said that Biden would veto the bill if Congress passed it.\nThe legislation would cut off funds from several key executive-branch entities, including the State Department, the Defense Department and the National Security Council until any withheld weapons are sent to Israel.\nThree Republicans crossed over and voted against the measure, and 16 Democrats voted for it.\nBiden said while the US would continue to provide defensive weapons to Israel, including for its Iron Dome air defense system, other shipments would end should a major ground invasion of Rafah begin."}, {"id": "c3c19502-ea1c-4f4a-8c6f-2995d8d0a4ca", "title": "Lebanon media says Israel struck Hezbollah eastern stronghold overnight", "date": "2024-05-16 12:15", "url": "https://thefrontierpost.com/lebanon-media-says-israel-struck-hezbollah-eastern-stronghold-overnight/", "message": "BEIRUT (AFP) : Lebanese state-run media reported Thursday an overnight Israeli air raid on eastern Lebanon, where Hezbollah holds sway, hours after the Iran-backed armed group launched an attack deep into Israeli territory.\nIsrael and Hamas ally Hezbollah have exchanged near-daily fire following the Palestinian group’s October 7 attack on southern Israel that sparked the war in Gaza, now in its eighth month.\nHezbollah launchrocket barrage at Israeli positionsLebanon’s Iran-backed Hezbollah group said it launched on Thursday “more than 60” rockets at Israeli military positions in retaliation for overnight air strikes.\nThe cross-border fighting has killed at least 413 people in Lebanon, mostly militants but also including dozens of civilians, according to an AFP tally.\nIsrael says 14 soldiers and 10 civilians have been killed on its side of the border."}, {"id": "c80b0b1a-4e0f-465f-9983-c44166e2f02b", "title": "Hezbollah Fires Missile Barrage at Israel After Commander Death", "date": "2024-05-16 10:45", "url": "https://www.bnnbloomberg.ca/hezbollah-fires-missile-barrage-at-israel-after-commander-death-1.2073791", "message": "(Bloomberg) -- Hezbollah said it launched “more than 60 rockets” at Israeli military sites on Thursday in response to an attack that killed one of its senior commanders.\nHezbollah described it as an assassination and fired “heavy Burkan” missiles at Israeli military facilities on Wednesday.\nIsrael and Hezbollah have been exchanging fire almost every day since the Israel-Hamas war broke out in October.\nIsrael has been targeted by thousands of Hezbollah missiles, drones and artillery shells since Oct. 7 — the date Hamas militants invaded the country.\nRoughly 350 people have been killed by Israeli strikes on Lebanon, most of them Hezbollah fighters."}, {"id": "2f507bab-6942-4f1e-9e8b-af6052e154ee", "title": "Hezbollah Fires Missile Barrage at Israel After Commander Death", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/hezbollah-fires-missile-barrage-israel-092812475.html", "message": "(Bloomberg) -- Hezbollah said it launched “more than 60 rockets” at Israeli military sites on Thursday in response to an attack that killed one of its senior commanders.\nHezbollah described it as an assassination and fired “heavy Burkan” missiles at Israeli military facilities on Wednesday.\nIsrael and Hezbollah have been exchanging fire almost every day since the Israel-Hamas war broke out in October.\nIsrael has been targeted by thousands of Hezbollah missiles, drones and artillery shells since Oct. 7 — the date Hamas militants invaded the country.\nRoughly 350 people have been killed by Israeli strikes on Lebanon, most of them Hezbollah fighters."}, {"id": "2bdf9c17-3c69-4d6e-b453-4ee6d75ea10f", "title": "China presses Pakistan to address security concerns of workers , projects", "date": "2024-05-16 00:15", "url": "https://www.voanews.com/a/china-presses-pakistan-to-address-security-concerns-of-workers-projects/7613785.html", "message": "China on Wednesday hailed its \"ironclad\" relationship with Pakistan and vowed to further enhance economic and anti-terrorism security cooperation between the neighboring countries at a bilaterial strategic dialogue in Beijing.\nChinese Foreign Minister Wang Yi renewed the pledge at a news conference after hosting formal talks with his Pakistani counterpart, Ishaq Dar, who concurrently serves as deputy prime minister.\nThey reiterated that no one is permitted to threaten other countries, including Pakistan, from Afghanistan.\nDar insisted the decade-long CPEC undertaking \"has transformed Pakistan's economic landscape by eliminating power outages and developing a robust infrastructure network, thus laying a strong foundation for Pakistan's future development.\"\nPakistan's foreign minister noted that the two sides agreed to \"further upgrade and expand\" CPEC cooperation."}, {"id": "4ce91e9d-2c02-4bca-837f-f35bca2c6477", "title": "Battles rage across Gaza , Israel releases images of armed men at UN site", "date": "2024-05-16 06:30", "url": "https://dunyanews.tv/en/World/812031-Battles-rage-across-Gaza,-Israel-releases-images-of-armed-men-at-UN-site", "message": "Battles rage across Gaza, Israel releases images of armed men at UN siteWorld World Battles rage across Gaza, Israel releases images of armed men at UN siteIsraeli troops fought Hamas fighters across Gaza on Wednesday, including the southern city of Rafah.\nAntagonism between Israel and the United Nations worsened as the Israeli army sought an explanation for footage showing armed men next to UN Palestinian relief agency vehicles.\nIn the northern Jabalia refugee camp, residents said Israeli tanks had destroyed clusters of homes but were facing heavy resistance.\nReuters verified the location of footage released by the Israeli army but could not verify when it was filmed or the identity of the men.\nUNRWA estimates that 450,000 civilians have fled Rafah in the week since Israel told them to evacuate."}, {"id": "fee42847-062f-4c97-b671-4423df7c9410", "title": "Two killed in Israeli drone strike on car in Ramadiyeh - Qana", "date": "2024-05-16 14:00", "url": "https://www.naharnet.com/stories/en/305252-two-killed-in-israeli-drone-strike-on-car-in-ramadiyeh-qana", "message": "Lebanese state-run media said an Israeli strike on a car in the country's south on Thursday killed two people, with Hezbollah-affiliated rescuers saying at least one of them was a group member.\n\"Two people were martyred in the raid that targeted a car on the Ramadiyeh-Qana road,\" the official National News agency (NNA) said, after earlier reporting a drone strike.\nA rescuer from the Hezbollah-affiliated Islamic Health committee said an Israeli strike on a car in Qana had killed two young men, including a member of the Iran-backed movement.\nA source close to Hezbollah told AFP one of the strikes \"hit a Hezbollah military camp\".\nThe group said Israeli fire had killed Hussein Makki, who was identified as a Hezbollah field commander by a source close to the group."}, {"id": "7c0015e7-5a1c-49f5-acb5-b6495221fbcb", "title": "The Latest | US military finishes pier for delivering aid into Gaza as Israel presses in Rafah", "date": "2024-05-16 11:15", "url": "https://www.local10.com/news/world/2024/05/16/the-latest-us-military-finishes-pier-for-delivering-aid-into-gaza-as-israel-presses-in-rafah/", "message": "The Latin Patriarchate in Jerusalem says Cardinal Pierbattista Pizzaballa entered Gaza on Thursday and visited the Holy Family Church in Gaza City.\nHeavy fighting has erupted in areas adjacent to Gaza City in recent days.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nThe fighting began shortly after Israel launched its war against Hamas following the militant group’s attack on southern Israel.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "f6dc76f3-f769-463a-a420-754264ddbd39", "title": "How to Lose an Ally in Ten Days", "date": "2024-05-16 05:45", "url": "https://townhall.com/columnists/spencerbrown/2024/05/16/how-to-lose-an-ally-n2639104", "message": "One area Biden has proven successful in, unfortunately for the United States and its allies, is jettisoning our key partners.\nIn the immediate aftermath of Hamas and other Iran-backed terrorists’ October 7 invasion of Israel and massacre, President Biden managed to say the right things a few times.\nThere are plentiful examples of Biden's inexplicable actions toward Israel, but here are ten days on which the president and his cabinet demonstrated their uncanny ability to lose an ally.\nOn April 5, Secretary of State Antony Blinken claimed in a speech that Israel risked becoming \"indistinguishable\" from barbaric Hamas terrorists.\nNetanyahu and Israel realized, like several others have since Biden took office, that the U.S. is no longer a reliable ally on whom they can depend."}, {"id": "23519b67-215f-4951-8207-b310479c8a13", "title": "War on Gaza : Israel sends additional brigade to Rafah as five soldiers killed in Jabalia friendly - fire", "date": "2024-05-16 07:00", "url": "https://www.middleeasteye.net/news/israel-sends-additional-brigade-rafah-five-soldiers-killed-jabalia-friendly-fire", "message": "The Israeli army announced on Thursday that it was sending an additional brigade to Rafah, as the government mulls widening its assault on southern Gaza.\nThe tank forces identified a gun barrel from one of the buildings, reportedly believing they were Palestinian fighters, and fired two tank shells.\nIsraeli military assessments say the strikes hit a Hezbollah weapons manufacturing plant, although this has not been independently confirmed.\nIsraeli forces reportedly stormed several money exchange shops in the city, vandalised and stole from some of them, and arrested at least one of the shop owners.\nSeveral raids were also reported in other cities in the West Bank, with Israeli forces distributing leaflets to money exchange shops accusing them of financing \"terrorism.\""}, {"id": "a603978e-d861-41f8-8bec-6c910a9bf0ad", "title": "Ukraine defences thin on ground as Russia advances on Kharkiv | Ukraine", "date": "2024-05-16 10:45", "url": "https://www.theguardian.com/world/article/2024/may/16/ukraines-defences-thin-on-ground-as-russia-advances-on-kharkiv", "message": "The fact that Russian forces have been able to advance about 4 miles at multiple points in five days raises serious questions about Kyiv’s ability to defend itself.\nIn May it began to menace Kharkiv region with the hope of frightening the population to move.\nIn May, Russia began to menace Kharkiv region with the hope of frightening the population to move.\nRussia has been bombing Kharkiv city since the end of March with air-launched glide bombs.\nView image in fullscreen A damaged high-rise building after a Russian missile attack on 14 May in Kharkiv, Ukraine."}, {"id": "57879380-a439-49b9-bc9c-12ddf56d134e", "title": "Fort Drum soldiers earn Ace status for shooting down unmanned aircraft systems in Iraq", "date": "2024-05-16 05:15", "url": "https://www.nny360.com/news/fortdrum/fort-drum-soldiers-earn-ace-status-for-shooting-down-unmanned-aircraft-systems-in-iraq/article_f97a8778-5c7e-5cc8-ba3b-2c71b03fdddc.html", "message": "Six-day (Tuesday through Sunday) print subscribers of the Watertown Daily Times are eligible for full access to NNY360, the NNY360 mobile app, and the Watertown Daily Times e-edition, all at no additional cost.\nIf you have an existing six-day print subscription to the Watertown Daily Times, please make sure your email address on file matches your NNY360 account email.\nYou can sign up or manage your print subscription using the options below."}, {"id": "572d2c45-6874-403c-8728-96566481afb4", "title": "TERROR IN ISRAEL : IDF Officer Injured In Stabbing Attack , Manhunt Launched For The Terrorist", "date": "2024-05-16 12:00", "url": "https://www.theyeshivaworld.com/news/israel-news/2283679/terror-in-israel-israeli-injured-in-stabbing-attack.html", "message": "An IDF non-commissioned officer was injured in a stabbing attack on Thursday morning at the Yitzhar intersection in the Shomron, south of Shechem and near Huwara.\nThe terrorist assaulted the officer when he stopped at an intersection, stabbing him through his open car window.\nThe officer managed to continue driving to an IDF checkpoint, where he received emergency medical aid and was evacuated in moderate condition to Beilinson Hospital in Petach Tikvah in a military intensive mobile care unit.\nA large number of IDF forces arrived at the scene and launched a search for the terrorist, who fled the scene by foot.\nSeveral hours later, IDF soldiers caught the terrorist in a Palestinian town near the site of the attack."}, {"id": "4e98211e-c16f-49b4-a6af-d129b77b5411", "title": "Iran threatens Britain for defending Israel in April attack", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/iran-threatens-britain-defending-israel-102542351.html", "message": "“France, Germany, and England should not think that they brought their planes that night and the issue was resolved and gone,” he added, referring to Iran’s April 13 attack on Israel.\nOn April 13, Iran fired some 300 suicide drones and missiles at Israel, almost all of which were shot down by the US, UK and Israel.\nAs soon as Iran launched the unprecedented mass drone and missile attack against Israel, four RAF Typhoons stationed in Cyprus were swiftly scrambled.\nThe Typhoon FGR4 multi-role fighter jets were deployed over Iraq and Syria to defend Israel, intercepting and shooting down approximately 10 to 20 Shahed suicide drones.\nThe Islamic Republic has lauded the operation as a triumph, with officials and regime supporters leveraging the attack for domestic political gains."}, {"id": "f47adfd7-db46-42f1-96f9-1acbda95966c", "title": "Iran threatens Britain for defending Israel from April attack", "date": "2024-05-16 11:15", "url": "https://www.telegraph.co.uk/world-news/2024/05/16/iran-threatens-britain-for-defending-israel-april-attack/", "message": "Britain will pay the price for helping to defend Israel from Iranian missiles and suicide drones, a top general from the country’s Islamic Revolutionary Guard Corps (IRGC) has warned.\n“France, Germany, and England should not think that they brought their planes that night and the issue was resolved and gone,” he added, referring to Iran’s April 13 attack on Israel.\n“While that night has passed, their account remains in place,” Brig Gen Qaani warned, using a Persian idiom implying that punishment is coming.\nIt is the first time an official from the Islamic Republic has directly threatened Britain and other Western nations since the recent surge of tensions across the Middle East.\nOn April 13, Iran fired some 300 suicide drones and missiles at Israel, almost all of which were shot down by the US, UK and Israel."}, {"id": "0c05f9ee-aa29-45f2-adcc-2eb06603d38b", "title": "Coalville man convicted after sharing deadly terror attack footage and saying he would  love  to do same", "date": "2024-05-16 12:15", "url": "https://www.leicestermercury.co.uk/news/local-news/coalville-man-convicted-after-saying-9287745", "message": "A Leicestershire man who shared footage of a terrorist attack that killed 51 people and said he would “love” to do the same has been found guilty of encouraging terrorism.\nEdward Griffiths, of Whitwick, near Coalville, shared videos of the March 2019 attack at a mosque in Christchurch, New Zealand.\nHe also called the attacker a “hero” in a social media post, it added.\nFollowing an investigation, officers from Counter Terrorism Policing East Midlands executed a warrant in June 2022 which led to Griffiths being arrested at his home.\nDetective Inspector Glynn Jehu, from Counter Terrorism Policing East Midlands, said after the verdicts: “Fifty one people lost their lives in the Christchurch attacks."}, {"id": "5cc1f35e-7483-449b-a479-be5f5473895b", "title": "Russia alleges interception of 11 UAVs across five regions , including occupied Crimea", "date": "2024-05-16 08:45", "url": "https://www.yahoo.com/news/russia-alleges-interception-11-uavs-080700425.html", "message": "The Russian Ministry of Defense reported the \"interception\" and \"destruction\" of 11 UAVs over the Belgorod, Bryansk, Kaluga, Tula oblasts, as well as in the temporarily occupied Crimea on May 16, its Telegram message reads.\nRead also: Ukrainian drones strike fuel depot in Russia’s Rostov OblastThe Russian authorities claim that they managed to shoot down and intercept five drones over the temporarily occupied Crimea, one each over Bryansk and Kaluga oblasts, and two drones over Tula Oblast.\nRead also: Russia claims to have downed drones overnight over 4 Russian oblasts and temporarily occupied CrimeaAs a result of the attack on the temporarily occupied Crimea in the early hours of May 15, the main artillery depot of the Belbek military airfield was reportedly damaged.\nRead also: Drone strikes fuel train in Russia's Volgograd Oblast, causing explosion, derailment, and spillWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine"}, {"id": "b08ad35b-9d06-4357-b397-980af1d70d40", "title": "Hezbollah fires rocket barrage at Israeli positions", "date": "2024-05-16 21:45", "url": "https://www.thedailystar.net/news/world/news/hezbollah-fires-rocket-barrage-israeli-positions-3611921", "message": "Lebanon's Iran-backed Hezbollah group said it yesterday launched \"more than 60\" rockets at Israeli military positions in retaliation for overnight air strikes on the country's east.\nHezbollah fighters \"launched a missile attack with more than 60 Katyusha rockets\" on several Israeli military positions in the Israeli-annexed Golan Heights, the group said in a statement.\nThe strikes were \"in response to the Israeli enemy's attacks last night on the Bekaa region\" in eastern Lebanon's Baalbek area, the group added.\nThe Israeli army later said it had identified \"approximately 40 launches\" from Lebanon \"towards the Golan Heights\", causing \"no injuries\".\nThe army reported several more attacks from Lebanon on northern Israel, to which it had also responded with strikes."}, {"id": "38f1a8d7-0475-405b-99e1-d4140eccca55", "title": "FBI And DHS Issue Warning On Foreign Terrorist Groups For June  Pride Month  ", "date": "2024-05-16 03:45", "url": "https://www.zerohedge.com/political/fbi-and-dhs-issue-warning-foreign-terrorist-groups-june-pride-month", "message": "“Organizations like ISIS may seek to exploit increased gatherings associated with the upcoming June 2024 Pride Month,” the announcement said.\nAfter the incident, pro-ISIS groups “praised this attack as one of the high-profile attacks in Western countries” and “supporters celebrated it,” the FBI and DHS said.\nThere was no evidence that the ISIS terrorist group was directly involved in plotting that shooting, the shooter, Omar Mateen, called 911 after the incident started and pledged allegiance to the group.\nOther FBI WarningsIn April, the FBI announced that it had arrested an 18-year-old Idaho man for allegedly plotting to carry out a terrorist attack targeting local churches.\nHe then made reference to a terrorist attack claimed by ISIS in Moscow, Russia, that left more than 140 people dead."}, {"id": "0843d39c-c625-46f1-9e7f-6eed11e39527", "title": "The Latest | US military finishes pier for delivering aid into Gaza as Israel presses in Rafah", "date": "2024-05-16 12:15", "url": "https://www.mymotherlode.com/news/middle-east/3358983/the-latest-us-military-finishes-pier-for-delivering-aid-into-gaza-as-israel-presses-in-rafah.html", "message": "The Latest | Israel says it will send more troops to Rafah, as fighting also rages in Gaza’s northThe Latest | Israel says it will send more troops to Rafah, as fighting also rages in Gaza’s north View PhotoIsrael’s defense minister said the military would send more troops into Rafah, a city along Gaza’s southern border with Egypt, as fighting also rages in northern Gaza, where Hamas has regrouped.\nThe Latin Patriarchate in Jerusalem says Cardinal Pierbattista Pizzaballa entered Gaza on Thursday and visited the Holy Family Church in Gaza City.\nHeavy fighting has erupted in areas adjacent to Gaza City in recent days.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "148265ef-0923-419e-8890-971ba6b45e2a", "title": "US Military Finishes Pier For Delivering Aid Into Gaza As Israel Presses In Rafah – 710am KURV", "date": "2024-05-16 14:00", "url": "https://www.kurv.com/us-military-finishes-pier-for-delivering-aid-into-gaza-as-israel-presses-in-rafah/", "message": "In northern Gaza, Israeli evacuation orders have displaced at least 100,000 people so far.\n3 PALESTINIANS KILLED BY ISRAELI FORCES IN WEST BANKJERUSALEM — The Palestinian Health Ministry said Thursday that Israeli forces killed three Palestinians in the northern West Bank.\nIn other violence, the Israeli military said Thursday a noncommissioned officer was moderately wounded in a stabbing attack in the West Bank.\nISRAELI FORCES KILL 3 PALESTINIANS IN WEST BANKJERUSALEM — The Palestinian Health Ministry said Thursday that Israeli forces killed three Palestinians in the northern West Bank.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "0356b28c-2e85-406b-998e-165acffecbc1", "title": "Houthi leader vows to target any ship heading to Israel , not only in Red Sea", "date": "2024-05-16 16:45", "url": "https://www.israelnationalnews.com/news/390073", "message": "Houthi rebel leader Abdulmalik al-Houthi vowed that the terrorist organization would target any ship headed for Israeli ports, whether or not they pass through the Red Sea.\nIn a speech today (Thursday), al-Houthi said that the Houthis would target any ship heading to Israel that comes within range of their weapons.\nThe Iran-backed rebel group has attacked ships in the Red Sea in support of its fellow Iranian proxy, the Hamas terrorist organization, in the seven months since the Hamas massacre of October 7, 2023.\nEarlier in April, Houthi forces in Yemen claimed they had launched rockets and drones at British, US, and Israeli ships.\nThe Iran-aligned group said it had targeted a British ship and a number of US frigates in the Red Sea, while in the Arabian Sea and Indian Ocean it had attacked two Israeli vessels heading to Israeli ports."}, {"id": "e15fdcc3-4d30-45f4-8492-90cd8c8cedf1", "title": "The Latest | Palestinians mark 76 years of their dispossession as more catastrophe unfolds in Gaza", "date": "2024-05-16 01:30", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/the-latest-palestinians-mark-76-years-of-their-dispossession-as-more-catastrophe-unfolds-in-gaza/article_f0324bfd-6a15-5616-a2df-f1f5cdf5dc1a.html", "message": "The Latest | Palestinians mark 76 years of their dispossession as more catastrophe unfolds in GazaPalestinians are marking 76 years of dispossession, commemorating their mass expulsion from what is today Israel as a potentially even larger catastrophe unfolds in Gaza"}, {"id": "168daa6a-0457-45a2-83bb-95c0d2514fc8", "title": "US official : We share Gallant concern on Gaza", "date": "2024-05-16 01:00", "url": "https://www.israelnationalnews.com/news/390025", "message": "A senior official in US President Joe Biden’s administration said on Wednesday that Washington shares the concerns voiced by Defense Minister Yoav Gallant on the issue of who will rule Gaza after the war.\n“We share the Minister of Defense Gallant's concern that Israel has not developed any plans for holding and governing territory the IDF clears, thereby allowing Hamas to regenerate in those areas,” the senior official said.\n\"We must dismantle Hamas’ governing capabilities in Gaza.\"\nThe Defense Minister said, \"In the absence of such an alternative, only two negative options remain: Hamas’ rule in Gaza, or Israeli military rule in Gaza.\"\nHe then stressed, \"I must reiterate - I will not agree to the establishment of Israeli military rule in Gaza."}, {"id": "32b045d1-67d7-43c8-a94a-08f642218834", "title": "2 killed , 1 injured in Israeli drone attack in S . Lebanon", "date": "2024-05-16 21:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/17/content_117193579.htm", "message": "You are here:视频播放位置 下载安装Flash播放器BEIRUT, May 16 (Xinhua) -- Two Hezbollah members were killed and a civilian wounded on Thursday when an Israeli drone hit a car in southern Lebanon's Tyre district, said Lebanese military sources.\nThe sources, who spoke anonymously, said an Israeli drone targeted, with an air-to-surface missile, a car that was driving on the road between Qana and Ramadiyeh in Tyre, causing a fire and killing the people inside it.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 465 people on the Lebanese side, including 293 Hezbollah members and 86 civilians, according to Lebanese security sources."}, {"id": "95554d0b-a8c2-4a1b-93a8-450f1974fdc3", "title": "Gaza fighting intensifies , Israel asks why armed men were at UN site", "date": "2024-05-16 05:45", "url": "https://www.unionleader.com/news/military/gaza-fighting-intensifies-israel-asks-why-armed-men-were-at-un-site/article_37ab0730-b724-5f3e-a4ce-7c03edf02599.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "763e4714-3c3c-4084-acc8-510fa1c4c544", "title": "The Latest | Israel says it will send more troops to Rafah , as fighting also rages in Gaza north", "date": "2024-05-16 23:30", "url": "https://www.yumasun.com/news/national_news/the-latest-israel-says-it-will-send-more-troops-to-rafah-as-fighting-also-rages/article_9fb6ee35-76a7-5e38-ab26-a3ddd60da155.html", "message": "Our directory features more than 18 million business listings from across the entire US.\nHowever, if we're missing your business, add your business by clicking on Add Your Business."}, {"id": "067b2c16-c4c3-404d-91f3-1e1d92856ae9", "title": "Israel moves in on north Gaza Hamas stronghold , pounds Rafah without advancing", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/israel-moves-north-gaza-hamas-101336596.html", "message": "\"We are wearing Hamas down,\" Israeli Defence Minister Yoav Gallant said, announcing that more troops would be deployed in Rafah, where he said several tunnels had been destroyed.\nSouth Africa asked the top U.N. court to order a halt to Israel's Rafah offensive, saying it was \"part of the endgame in which Gaza is utterly destroyed\".\nIsrael has denied South African allegations of genocide in Gaza and said it had complied with an earlier court order to step up aid.\nIsrael declared major operations over in northern Gaza months ago while pledging to return to prevent Hamas regrouping.\nIn the southern tip of Gaza, tanks held their positions in eastern neighbourhoods and outskirts of Rafah while keeping up pressure with aerial and ground bombardments."}, {"id": "956a8d5f-6c63-4336-8b46-cea1a218c75b", "title": "Slovakia : PM Fico able to speak ,  lone wolf  suspect charged – DW – 05 / 16 / 2024", "date": "2024-05-16 18:30", "url": "https://www.dw.com/en/slovakia-pm-fico-able-to-speak-lone-wolf-suspect-charged/a-69093218", "message": "Slovakia's president-elect visited Prime Minister Robert Fico in hospital, saying he was able to speak but not easily.\nSlovakia's Prime Minister Robert Fico remained in a serious condition on Thursday after doctors managed to stabilize him following an assassination attempt a day earlier.\nFico was shot several times in an attack that is believed to have had a political motive.\nSlovak President Zuzana Caputova, a political rival of Fico, appealed for calm and described the assassination attempt as an \"attack on democracy.\"\nAccording to Heger, the political debate in the run-up to the presidential election, won by Fico's ally Peter Pellegrini, had been \"very dirty.\""}, {"id": "09b0eada-a5bf-4e92-9414-ba5c24ef9bc9", "title": "Shooting of Slovakian PM deepens dangerous divisions in Europe", "date": "2024-05-16 17:30", "url": "https://inews.co.uk/news/world/shooting-slovakian-pm-deepens-divisions-europe-3058701", "message": "The assassination attempt on Slovakia’s prime minister has exposed tensions not only within the country but across Europe as the war in Ukraine intensifies and populist politics take hold, say analysts.\nRussia’s Vladimir Putin called it a “monstrous crime” adding that he knew Mr Fico “as a courageous and strong-minded man”.\nHe described Mr Fico as a “central and polarising figure” in Slovakia since the 1990s, with much of his support coming from an older electorate with nationalistic tendencies.\nMr Fico, a populist, has “taken a degree of inspiration” from fellow central European Prime Minister Viktor Orban of Hungary.\n“These complexities have all led to the rise in nationalist and populist politics – with some politicians exploiting the crisis to advance their agendas,” she said."}, {"id": "3096c371-6800-4cad-b374-7d6f9b4dfd24", "title": "Israel Attacks Hezbollah Strongholds In Lebanon", "date": "2024-05-16 04:45", "url": "https://menafn.com/1108219566/Israel-Attacks-Hezbollah-Strongholds-In-Lebanon", "message": "The airstrike was in retaliation to the Hezbollah attack in northern Israel on Wednesday late night and Thursday early morning hours.\nThe Hezbollah had claimed that it had launched Kamikaze drones towards an IDF base in Tiberias in northern Israel.\nThe Hezbollah had in a statement on Wednesday late night said that it had struck within Israel as a retaliation to the assassinations carried out by Israel.\nA top Hezbollah commander Hussain Mekki was killed by the IDF drone attack in southern Lebanon on Tuesday.\nMekki, according to Israel, was responsible for attacks on Israeli civilians since the ongoing war against Hamas commenced on October 7, 2023."}, {"id": "bc8bcf4d-655f-4479-9fe5-f071814455c8", "title": "  Combat Vehicles Research and Development Establishment should focus more on innovation  | Chennai News", "date": "2024-05-16 15:15", "url": "https://timesofindia.indiatimes.com/city/chennai/combat-vehicles-research-and-development-establishment-should-focus-more-on-innovation/articleshow/110183922.cms", "message": "CHENNAI: Combat Vehicles Research and Development Establishment ( CVRDE ) should focus more on innovation, said secretary of department of Defence Research and Development and chairman of the Defence Research and Development Organisation ( DRDO ) Samir V Kamat.Speaking at the Golden Jubilee celebrations of CVRDE in Avadi on Thursday, Kamat appreciated CVRDE’s efforts for achieving self-reliance in armoured fighting vehicle (AFV) categories and insisted that the institution should \"focus more on innovations to adapt to the emerging scenario in the defence ecosphere.\n\"CVRDE is one of the premier defence research institutes under DRDO, which has provided several ground-breaking inventions in the field of combat vehicles, including its flagship product, the Battle Tank Arjun, in the last 50 years.\n\"CVRDE displayed the hallmark of a competitive research establishment by being alert to emerging security challenges that resulted in the design and development of Light Tank in a record time.\nAfter Independence, this establishment was moved to Ahmednagar from the Technical Development Establishment (TDE-Vehicles).\nIn 1965, a detachment of VRDE was established as a nucleus at Avadi to render R&D support to Heavy Vehicles Factory (HVF), which was subsequently rechristened as 'Combat Vehicles Research and Development Establishment' (CVRDE) on March 26, 1975."}, {"id": "41620048-0191-4d30-9a97-ec03090cd921", "title": "US warns Israel of power vacuum in Gaza and wants post - war plan", "date": "2024-05-16 11:15", "url": "https://www.courant.com/2024/05/16/us-warns-israel-of-power-vacuum-in-gaza-and-wants-post-war-plan-2/", "message": "The U.S. warned Israel it risks creating a power vacuum across swaths of Gaza and urged the country’s leaders to focus more on post-war planning for the Palestinian territory.\nHe spoke as Israeli forces battle in areas of northern Gaza — including Jabalia, near Gaza City — that were cleared of Hamas fighting units months ago, underscoring the group’s ability to reassemble.\nThat’s led to some criticism of Israel’s tactics of rapidly moving troops out of areas when Hamas has been routed.\nPart of the problem is that Israel lacks the manpower to hold and administer large parts of Gaza.\nLast week, Israel told civilians in parts of Rafah to leave ahead of a possible full-on assault."}, {"id": "6a250ff8-dda7-4590-9fab-1520a8c656c5", "title": "Chief of Staff : Soldiers in north have  high level of readiness  ", "date": "2024-05-16 16:45", "url": "https://www.israelnationalnews.com/news/390075", "message": "And that's what you are telling me, you are showing me very high level of readiness,\" Halevi said.\n\"I’m returning from here with a sense of very high levels of readiness, you will continue to develop it and we will make the decisions based on the developments.\nThe important thing, high readiness, strong responses, finding the right targets, harming the other side,' he said.'\nMinutes later, Hezbollah fired another missile which killed Fingerhut.\nToday (Thursday), Three IDF soldiers were wounded, one very seriously, as a result of a missile strike on Metula."}, {"id": "b5f9945f-069f-4a8a-93d7-ab9c83836d65", "title": "Robert Fico : why the attempted assassination of Slovakian prime minister could fuel the information war between Russia and Europe", "date": "2024-05-16 19:15", "url": "https://theconversation.com/robert-fico-why-the-attempted-assassination-of-slovakian-prime-minister-could-fuel-the-information-war-between-russia-and-europe-230249", "message": "The assassination attempt on Slovakian prime minister Robert Fico on May 15 has sent a shockwave through Europe.\nWith that said, it is virtually certain that this will have a massive impact on Slovak, and even European Union, politics.\nFico and his Smer party have largely dominated the political scene in the country since the 2000s.\nRussian media outlets have immediately seized on this to accuse Ukraine of masterminding the assassination attempt against Fico.\nBefore the attack, Fico was already rolling out plans to place the Slovak national broadcaster under governmental control, sparking protests from the public."}, {"id": "675fc4f0-c609-4414-88c7-06d0f9512430", "title": "Nuclear war expert reveals what would really happen after an atomic blast - and the safest part of the world to live", "date": "2024-05-16 11:30", "url": "https://www.dailymail.co.uk/femail/article-13420801/Nuclear-war-expert-wipe-billions.html", "message": "A nuclear war expert who claims we are getting closer to atomic warfare says it would take 72 minutes to wipe out five billion people if the worst comes to pass.\nThe author said if the world went into nuclear war you would 'want to die instantly' because 'there is no more law and order.'\nElsewhere Annie revealed North Korea has launched more than 100 ballistic missiles in an 18-month period from 2022.\nOn one hand I say there are no rules to nuclear war, but there are a few nuclear rules to nuclear deterrence, like you tell neighbours.'\nIf nuclear war did break out Annie said the safest place to be would be in Australia or New Zealand because of the agricultural resources."}, {"id": "18ce6674-4fb1-44f7-b857-ed557f239d44", "title": "GOC Vajra Corps Packs a Punch with Integrated Weapon Systems and Hexa Copters – Indian Defence Research Wing", "date": "2024-05-16 04:45", "url": "https://idrw.org/goc-vajra-corps-packs-a-punch-with-integrated-weapon-systems-and-hexa-copters/", "message": "GOC Vajra Corps Packs a Punch with Integrated Weapon Systems and Hexa Copters| BySOURCE: AFIThe Indian Army’s GOC Vajra Corps is at the forefront of innovation in combat techniques.\nRecent operations in Kashmir saw the Corps deploy a unique integrated weapons system, combining small arms firing with Hexa Copters – a first for the Indian Army during counter-terrorism encounters.\nThis cutting-edge system equips soldiers with Hexa Copters, also known as multi-rotor drones, equipped with underslung AK rifles.\nThe successful deployment of this integrated system by the GOC Vajra Corps signifies the Indian Army’s commitment to staying ahead of the curve in combat technology.\nIt’s a testament to the Army’s dedication to developing indigenous solutions to address the evolving challenges of modern warfare."}, {"id": "ed0cdfc7-6b8d-4c93-9233-2eb71d17d94e", "title": "Funerals held for victims of attack on DR Congo camp", "date": "2024-05-16 09:00", "url": "https://www.justiceinfo.net/en/131924-funerals-held-for-victims-of-attack-on-dr-congo-camp.html", "message": "Mourners gathered Wednesday for the funerals of victims of an attack on a camp for internally displaced people in eastern DR Congo which the government has called a \"war crime\".\nThe mainly Tutsi-led M23 resumed its armed campaign in the Democratic Republic of Congo in 2021 and has seized swathes of territory.\nOn May 3, bombs struck huts in the Mugunga camp for displaced people on the outskirts of Goma.\nThe Rwandan government has dismissed the US accusation as \"ridiculous\", saying Rwanda has a \"professional army\" that would \"never attack\" a camp for displaced people.\nResidents in the camp had been driven out of their villages by an M23 offensive."}, {"id": "ca1caeed-dc46-4dd4-99c0-525201e7a603", "title": "Man arrested for terrorism offences and  causing explosion , as police discover ... ", "date": "2024-05-16 07:15", "url": "https://www.lbc.co.uk/news/man-arrested-terrorism-bedfordshire-caddington/", "message": "Man arrested for terrorism offences and 'causing explosions', as police discover 'suspicious substances' at homeThe man was arrested in Caddington, near Luton.\nPicture: Google/AlamyBy Kit HerenA man has been arrested on suspicion of terror offences, with police finding \"suspicious substances\" at his home.\nThe 31-year-old from Bedfordshire was initially arrested by local police on May 6 for causing explosions likely to endanger life, and for possessing Class A drugs.\nBedfordshire Police also found several items, including \"a number of suspicious substances\" at an address in the village of Caddington, near Luton.\nBedfordshire Police told counter-terrorism officers in the Metropolitan police about their find, and the man was bailed while investigations continued."}, {"id": "226a0a3f-4ea3-4e74-bb03-a69610c61237", "title": "The Incel Terrorist - Macleans . ca", "date": "2024-05-16 05:30", "url": "https://www.macleans.ca/longforms/incel-terrorism/", "message": "The Incel Terrorist Oguzhan Sert was 17 when he walked into a Toronto massage parlour and killed an employee with a sword.\nBy Lana Hall Share Copy LinkEmailFacebookXLinkedInWhatsAppReddit April 3, 2024The morning of February 24, 2020, began like any other at Crown Spa.\nThey said that the attacks at Crown Spa were not being prosecuted as a terrorist group offence, so no organization or communication with a larger group was required.\nThat too is a high-profile terror case, involving a lone actor radicalized online with a loosely defined ideology.\nThe Sert case blows up those assumptions, demanding that both perpetrators and victims receive more attention and effort from law enforcement and courts."}, {"id": "226c42e7-9a9f-4404-bd78-3e0970ad995f", "title": "Slovak PM fights for his life as leaders condemn assassination attempt", "date": "2024-05-16 07:15", "url": "https://www.hurriyetdailynews.com/slovak-pm-fights-for-his-life-as-leaders-condemn-assassination-attempt-193592", "message": "Slovak PM fights for his life as leaders condemn assassination attemptHANDLOVASlovak Prime Minister Robert Fico fought for his life in the hospital Wednesday after being shot multiple times in what the government called a \"political assault,\" as world leaders reacted with shock and condemnation after the shooting.\n\"An assassination attempt on one of the highest constitutional officials is an unprecedented threat to Slovak democracy,\" he added on X, formerly Twitter.\nDeputy Prime Minister Tomas Taraba told the BBC he believed the leader's hospital procedure had gone well.\n\"I have absolutely no idea what father was thinking, what he was planning, why it happened,\" the alleged suspect's son told Slovak news site aktuality.sk.\nRobert Fico is fighting for his life because of your hatred,\" Blaha said."}, {"id": "60749800-2a78-49bd-bd6a-b4b1b13e23c1", "title": "Israel - Hamas War Day 223 : What is happening in Gaza , Lebanon ? ", "date": "2024-05-16 05:00", "url": "https://www.jpost.com/israel-hamas-war/2024-05-16/live-updates-801359", "message": "(photo credit: Alet Pretorius/Reuters)Israel must be stopped from wiping Gaza off the map, South Africa argued in an urgent appeal to the International Court of Justice to stop the war and prevent the IDF from making the enclave uninhabitable.\n“Israel's declared aim of wiping Gaza from the map is about to be realized,” British attorney Vaughan Lowe told the ICJ during a hearing at The Hague.\n“The court is not powerless,” Lowe said as he urged the ICJ to assert both its authority and that of international humanitarian law.\nSouth Africa at the ICJ“In order to secure the entry and distribution of food and humanitarian supplies, and to save lives, a halt to Israeli military operations across Gaza is essential,” Lowe stated.\nThe ICJ is already adjudicating South Africa’s charge, filed in December, that Israel violated the United Nations 1948 convention on the prevention of genocide."}, {"id": "f1f6e433-bc74-4412-b158-4d499d8f2117", "title": "Editorial : Shooting of Slovak prime minister Robert Fico is an attack on democracy itself", "date": "2024-05-16 05:00", "url": "https://www.independent.ie/opinion/editorial/editorial-shocking-shooting-of-robert-fico-is-an-attack-on-democracy-itself/a1155046454.html", "message": "The assassination attempt on Slovakia’s prime minister Robert Fico has rightly sent a shudder down the spine of European democracy.\n“The attack on prime minister Fico is an attack on democracy, a fundamental value of the European Union and one we all share,” he said.\nOpponents of Mr Fico had concerns Slovakia was on course to abandon the country’s pro-Western course and follow the direction of Hungary under populist prime minister Viktor Orban.\nHowever, condemnation of political violence came from all sides.\nThe priority now must be to make sure the attack is not exploited to fuel further violence across the European political landscape."}, {"id": "ffcb0a72-811f-4150-b634-63e2eda89d60", "title": "Slovak PM  no longer in life - threatening condition  after assassination attempt", "date": "2024-05-16 07:45", "url": "https://www.yahoo.com/news/slovak-pm-no-longer-life-055725437.html", "message": "Slovak Prime Minister Robert Fico is no longer in life-threatening condition after being shot several times during an assassination attempt, a Slovak deputy prime minister said late in the evening on May 15.\nInterior Minister Matus Sutaj Estok said that the suspected assailant fired five shots, three of which hit the prime minister.\n\"Fortunately, as far as I know, the operation went well, and I guess in the end he will survive,\" Slovak Deputy Prime Minister and Environment Minister Tomas Taraba told the BBC's Newshour, adding: \"He's not in a life-threatening situation at this moment.\"\nA 71-year-old man is reportedly suspected of carrying out what Slovak government officials have called an assassination attempt and has been detained.\nRead also: Slovak citizens raise funds to buy over 2,500 shells for UkraineWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "e21755a7-0f79-4092-ad39-a524b7df7a79", "title": "GIABA , EFCC , governor , others speak on tackling terrorism financing , violent conflicts", "date": "2024-05-16 09:00", "url": "https://www.premiumtimesng.com/news/more-news/694885-giaba-efcc-governor-others-speak-on-tackling-terrorism-financing-violent-conflicts.html", "message": "The West African anti-money laundering body, GIABA, civil society organisations, professionals, a Nigerian anti-corruption agency, and a state governor, on Wednesday, called for collective measures to combat terrorism financing, extremism, and violent conflicts in Nigeria.\nHe emphasised the necessity for both state actors and non-state actors to address the various sources of terrorism financing, which underpin terrorism and other violent conflicts in Nigeria.\nMr Musa highlighted the roles of terrorism financing in sustaining terrorist groups, facilitating weapon procurement, recruitment of militants, and operational activities.\nArticle Page with Financial Support Promotion Support PREMIUM TIMES' journalism of integrity and credibility At Premium Times, we firmly believe in the importance of high-quality journalism.\nMr Olukoyede highlighted EFCC’s efforts in combating money laundering and terrorism financing through policy implementation, including technology adoption for tracking laundered funds and ransom payments to kidnappers."}, {"id": "6cf915d2-f5cb-4cc5-ada7-27be74f5b12f", "title": "Operation Iron Swords", "date": "2024-05-16 03:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-15.htm", "message": "Operation Iron Swords - Day 222 - 15 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nOver the course of decades.\u0094 The five mentioned countries criticized the recent Israeli military operation in Rafah.\nThe footage also included a series of attacks on Israeli military vehicles, including the Merkava tank, with anti-tank missiles.\nEuropean Union Foreign Affairs Commissioner Josep Borrell expressed his anger at repeated settler attacks on humanitarian aid convoys heading to the Gaza Strip.\nOperation Iron Swords - By the NumbersIn a recent interview on the Call Me Back podcast with Dan Senor, Israeli Prime Minister Benjamin Netanyahu disclosed startling statistics regarding the casualties in the ongoing conflict between Israel and Hamas."}, {"id": "82566ddf-964c-42be-8d6b-b82c459c1a2d", "title": "Combat Vehicles Research and Development Establishment celebrates golden jubilee", "date": "2024-05-16 15:30", "url": "https://www.thehindu.com/news/national/tamil-nadu/combat-vehicles-research-and-development-establishment-celebrates-golden-jubilee/article68182791.ece", "message": "The Combat Vehicles Research and Development Establishment (CVRDE), a unit of the Defence Research and Development Organisation (DRDO), celebrated its golden jubilee at its campus in Avadi on Thursday.\nOn the occasion, various products developed by the CVRDE were on display.\nA panel discussion on the operational and technological requirements of tank warfare in the 21st Century was held.\nThe CVRDE designed the country’s main battle tank – Arjun – and made improvements through its MBT Arjun Mk-1A.\nArjun ARRV, Combat Improved Ajeya, Carrier Motor Tracked, Bridge Layer Tank, Carrier Command Post Tracked, Advanced Tracked Armoured Fighting Vehicles (T-AFV) are among the products designed by the CVRDE."}, {"id": "377d8ee4-798e-4864-8903-0935365ddf87", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-16 21:45", "url": "https://www.foxnews.com/world/look-high-profile-political-assassinations-attempts-century", "message": "Slovakia's prime minister Robert Fico was gravely injured in an apparent assassination attempt that rocked the small country and the rest of Europe just weeks before an election.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\nThe gunman was later killed in a shootout with police.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "6a1fd5f6-f605-4075-b107-93b2bc192802", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-16 21:00", "url": "https://www.clickondetroit.com/news/world/2024/05/16/a-look-at-high-profile-political-assassinations-and-attempts-this-century/", "message": "FILE - Slovakia's Prime Minister Robert Fico speaks during a press conference with Hungary's Prime Minister Viktor Orban at the Carmelite Monastery in Budapest, Hungary, Tuesday, Jan. 16, 2024.\nSlovakia's populist Prime Minister Robert Fico was wounded in a shooting Wednesday May 15, 2024 and taken to hospital.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "796d1a4b-1a88-48c1-8d94-036b2de7b0d1", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-16 21:45", "url": "https://www.local10.com/news/world/2024/05/16/a-look-at-high-profile-political-assassinations-and-attempts-this-century/", "message": "FILE - Slovakia's Prime Minister Robert Fico speaks during a press conference with Hungary's Prime Minister Viktor Orban at the Carmelite Monastery in Budapest, Hungary, Tuesday, Jan. 16, 2024.\nSlovakia's populist Prime Minister Robert Fico was wounded in a shooting Wednesday May 15, 2024 and taken to hospital.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "b232d396-d8dd-4d18-b1cc-618838c9b68b", "title": "Slovakian PM Robert Fico  not out of the woods yet  as suspect charged with attempted murder over shooting", "date": "2024-05-16 17:30", "url": "https://www.independent.co.uk/news/world/europe/slovakia-fico-shot-assassination-gun-b2546250.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A man has been charged with the attempted murder of Slovakian prime minister Robert Fico, who is in a stable condition in hospital but is “not out of the woods yet” according to officials.\nMr Fico was still critical on Thursday after undergoing five hours of surgery with doctors working around the clock to save his life.\nHe added that if the bullets struck just a few millimetres either side, Mr Fico would have been killed.\n“There was a lot of it yesterday,” Mr Tusk said in a post on Twitter/X, illustrated with a screenshot of a comment."}, {"id": "0ab4fdd6-28bc-4c00-b4af-ba017a94352c", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-16 19:15", "url": "https://www.news4jax.com/news/world/2024/05/16/a-look-at-high-profile-political-assassinations-and-attempts-this-century/", "message": "FILE - Slovakia's Prime Minister Robert Fico speaks during a press conference with Hungary's Prime Minister Viktor Orban at the Carmelite Monastery in Budapest, Hungary, Tuesday, Jan. 16, 2024.\nSlovakia's populist Prime Minister Robert Fico was wounded in a shooting Wednesday May 15, 2024 and taken to hospital.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "9552b741-0a09-4550-8729-161dafb7966e", "title": "Let Talk About Ukraine Attack On Russian Radar Station , Air Base in Crimea with Storm Shadow , ATACMS", "date": "2024-05-16 23:00", "url": "https://theaviationist.com/2024/05/16/ukraine-attack-in-crimea-with-storm-shadow-atacms/", "message": "Leading Russian defense analysis forums also confirmed the strike on the Belbek air base, and said Ukraine used the MGM-140B ATACMS (Army Tactical Missile System).\nAs claimed, the first footages showing the aftermath of the ATACMS strike on Russian Belbek military airfield, near Sevastopol, Crimea.\nDrive Black Sea Fleet from Sevastopol with daily precision strikes – Ditto for Russian Air Force at Saky, etc.\nLand forces can come later.”Priority: use long-range precision strike to isolate Crimea, then make it untenable for Russian forces.\nRussian forces in Crimea can fortify it at will."}, {"id": "fd84a8fa-1382-4b06-af0d-82e7c514be4e", "title": "Man arrested in terrorism probe after  suspicious substance found in village", "date": "2024-05-16 00:00", "url": "https://www.kentonline.co.uk/news/national/man-arrested-in-terrorism-probe-after-suspicious-substances-found-in-village-117676/", "message": "The 31-year-old man from Bedfordshire was arrested on Wednesday on suspicion of possession of articles for terrorist purposes and remains in custody, police said (Peter Byrne/PA)A man has been arrested by counter-terrorism officers after “a number of suspicious substances” were found at a property in Bedfordshire.\nThe 31-year-old man, from Bedfordshire, was arrested on Tuesday on suspicion of possession of articles for terrorist purposes and remains in custody, the Metropolitan Police said.\nHe had previously been arrested on May 6 by Bedfordshire Police on suspicion of causing explosions likely to endanger life and possession of class A drugs, but was bailed before being re-arrested.\nThe investigation was taken over by the Met’s Counter Terrorism Command on Monday after continued searches at the residential address, the Met said.\nThe Met added it continues to work closely with colleagues from Bedfordshire Police and the Eastern Region Special Operations Unit as the investigation continues."}, {"id": "e20ab98b-15b4-4a1c-bcbc-ce17498a45a4", "title": "The US Navy only forward - deployed aircraft carrier , USS Ronald Reagan , is leaving Japan after nearly a decade in the Pacific", "date": "2024-05-16 18:00", "url": "https://news.yahoo.com/news/us-navys-only-forward-deployed-153926735.html", "message": "After nearly a decade, the USS Ronald Reagan is leaving the Pacific.\nUSS Ronald Reagan has served in other roles, providing air support in Afghanistan and aiding Japan after its 2011 disaster.\nThe USS Ronald Reagan, the only aircraft carrier in the US Navy forward deployed, or permanently stationed in another country, is leaving Japan after spending nearly a decade in the Pacific.\nUSS Ronald Reagan traveling through the Straits of Magellan, to San Diego, CA, in a transfer move.\n\"Whether it's aboard USS Ronald Reagan today or USS George Washington in the future, we will continue to strengthen those ties at all levels, on-shore and at-sea.\""}, {"id": "941cc89d-0b48-45c3-9785-b2b20ebcacb1", "title": "Who is the 71 - year - old suspected to have shot Slovakia PM Robert Fico ? ", "date": "2024-05-16 06:30", "url": "https://www.firstpost.com/explainers/slovakia-pm-robert-fico-assassination-attempt-71-year-old-suspect-13771415.html", "message": "Slovakia’s prime minister Robert Fico is in hospital after being shot at five times in an attempted assassination in Handlova.\nWho is Robert Fico?\nSlovakia’s prime minister Robert Fico is now stable in hospital after being shot five times in an assassination attempt.\nRescue workers wheel Slovak prime minister Robert Fico, who was shot and injured, to a hospital in the town of Banska Bystrica, central Slovakia.\nA person is detained after shooting incident of Slovak PM Robert Robert Fico."}, {"id": "e8e95412-b3c2-4a1b-8e13-089a575047e3", "title": "Yemen Houthi rebels acknowledge attacking a US destroyer that shot down missile in the Red Sea - New Delhi Times - India Only International Newspaper", "date": "2024-05-16 21:45", "url": "https://www.newdelhitimes.com/yemens-houthi-rebels-acknowledge-attacking-a-us-destroyer-that-shot-down-missile-in-the-red-sea/", "message": "Yemen’s Houthi rebels on Wednesday claimed targeting a U.S. Navy destroyer and a commercial ship in the Red Sea.\nHowever, the attack on the warship apparently happened nearly two days earlier and saw the vessel intercept the missile targeting it.\nThe Mason, an Arleigh Burke-class guided-missile destroyer, has been in the Red Sea and the wider region as part of a U.S.-led coalition trying to prevent Houthi attacks on shipping.\nOn Monday night, the Mason “successfully engaged and destroyed one inbound anti-ship ballistic missile launched by (the) Iranian-backed Houthis from Yemen over the Red Sea,” the U.S. military’s Central Command said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat."}, {"id": "cc23dd1e-19e7-48e5-bc18-51b0da40161d", "title": "US warns Israel of Gaza power vacuum and wants post - war plan", "date": "2024-05-16 03:45", "url": "https://gazette.com/ap/international/us-warns-israel-of-gaza-power-vacuum-and-wants-post-war-plan/article_9128b7a1-afbe-5fa7-b95d-447d4d593c7b.html", "message": "You have permission to edit this article."}, {"id": "53ed595b-0e00-40a2-83ed-8ffdf5fb194b", "title": "Brits on Interpol Most Wanted list such as  White Window  as supercops hunt  The Fly  ", "date": "2024-05-16 10:15", "url": "https://www.dailystar.co.uk/news/latest-news/brits-interpols-most-wanted-list-32821822", "message": "(Image: INTERPOL/AFP via Getty Images)Interpol's most wanted list currently features 12 Brits from the notorious White Widow terrorist to a neighbour killer.\nShe is currently at large in London, despite being wanted in India.\nThey reported: \"When asked how it felt to still be wanted for murder by Interpol, he locked the motor and fled back inside.\nHe is due to face charges of murder and culpable homicide not amounting to murder.\nDespite this, he remains on the Interpol list with the United States insisting on his capture."}, {"id": "74750b28-1eb0-48b4-80f6-0f261b382a9c", "title": "US postured to lose without a Standing Combined Joint Task Force in INDOPACOM", "date": "2024-05-16 22:45", "url": "https://breakingdefense.com/2024/05/us-postured-to-lose-without-a-standing-combined-joint-task-force-in-indopacom/", "message": "In this companion piece, Rosenberger raises concerns about the other half of the equation: a Standing Combined Joint Task Force positioned specifically for the China threat.\nIn the FY23 National Defense Authorization Act (NDAA), Congress directed the SECDEF to create a fully equipped and persistent operational Joint Task Force within INDOPACOM.\nA year later, in the FY24 NDAA, Congress directed the SECDEF to send Congress his implementation plan to bring this Combined Joint Task Force to life.\nFrustratingly, we see the opposite approach in INDOPACOM training exercises today.\nFor two years, serving directly for the SACEUR, he orchestrated the training of all NATO Combined Joint Task Forces in Europe in planning and executing large scale conventional operations."}, {"id": "388457d0-9cdc-49f8-8ba1-829e4228b4f0", "title": "Paramount+ Lands  We Will Dance Again  Documentary About Oct . 7 Hamas Terrorist Attack", "date": "2024-05-16 16:45", "url": "https://www.yahoo.com/news/paramount-lands-dance-again-documentary-154215395.html", "message": "Paramount+ has landed We Will Dance Again, a documentary about Hamas’ Oct. 7 terrorist attack at the Nova Music Festival.\nThe project from See It Now Studios features new interviews with more than a dozen survivors, who recorded their experience throughout the attack, and exclusive footage.\nThe doc also includes eyewitness accounts from those survivors, as well as footage captured by other victims and Hamas.\n“It is a painful story of unfathomable tragedy, and also of bravery, sacrifice and heroism.”Yariv Mozer directed We Will Dance Again, which was originally announced the week after the attacks took place.\nThe project, Bearing Witness, featured 43 minutes of footage of acts committed by Hamas terrorists against Israeli citizens on Oct. 7."}, {"id": "88e8ed23-60ea-4459-a9fc-69078eee4d69", "title": "Paramount+ Lands Documentary About Oct . 7 Hamas Terrorist Attack", "date": "2024-05-16 16:45", "url": "https://www.hollywoodreporter.com/tv/tv-news/paramount-documentary-hamas-terrorist-attack-1235901192/", "message": "Paramount+ has landed We Will Dance Again, a documentary about Hamas‘ Oct. 7 terrorist attack at the Nova Music Festival.\nThe project from See It Now Studios features new interviews with more than a dozen survivors, who recorded their experience throughout the attack, and exclusive footage.\nThe doc also includes eyewitness accounts from those survivors, as well as footage captured by other victims and Hamas.\n“The human cost of what happened on October 7th in Israel, and the war in Gaza, has been catastrophic.\nThe project, Bearing Witness, featured 43 minutes of footage of acts committed by Hamas terrorists against Israeli citizens on Oct. 7."}, {"id": "864f0c3e-81b2-4e83-93a4-473bdad24a5e", "title": "Robert Fico assassination : Everything we know as Slovakian PM  able to speak  and only just survived - World News", "date": "2024-05-16 15:30", "url": "https://www.mirror.co.uk/news/world-news/robert-fico-assassination-everything-know-32827159", "message": "Slovakia's Prime Minister Robert Fico was shot several times in Handlova, in what has been described as an assassination attempt - and a 71-year-old man has been charged with attempted murderRobert Fico assassination: Everything we know as Slovakian PM 'able to speak' and only just survivedSlovakian Prime Minister Robert Fico \"survived by a hair\" after being shot several times in an apparent assassination attempt.\nA 71-year-old man has today been charged with attempted murder and reports say he could face life in prison.\nMr Fico, 59, is now able to speak but remains in a serious condition in hospital.\nA physical attack on the prime minister is, first of all, an attack on a person, but it is also an attack on democracy.\nImage: AP) AP)Mr Fico has divided opinion in Slovakia by calling to end military aid to Ukraine and sanctions on Russia."}, {"id": "8e9a5e9a-b400-4353-afbe-f5a1454dfe18", "title": "China shows off its robot  dogs of war  in Cambodia", "date": "2024-05-16 17:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/17/2003818006", "message": "China shows off its robot ‘dogs of war’ in CambodiaAFP, KAMPONG CHHNANG, CambodiaChina’s military yesterday showed off its machine-gun equipped robot battle “dogs” at the start of its biggest ever drills with Cambodian forces.\nA Chinese soldier tests a robot dog at the Golden Dragon military exercise in Cambodia’s Kampong Chhnang Province yesterday.\nOpening the exercises, Cambodian armed forces commander-in-chief Vong Pisen said that they would “enhance the capabilities” of the two armies in the fight against terrorism.\nAfter Cambodia dismantled facilities at Ream naval base near the Cambodian port city of Sihanoukville, built partly with US funding and having played host to US military exercises, China began funding its renovation.\nWashington says that Ream could give Beijing a key strategic position on Gulf of Thailand near the disputed South China Sea."}, {"id": "882a70ce-adb5-4a19-9cd8-563577ac973a", "title": "  If we ignore this threat ...: How  dastardly  shooting of Slovak PM has rattled Europe", "date": "2024-05-16 16:45", "url": "https://www.moneycontrol.com/news/world/if-we-ignore-this-threat-how-dastardly-shooting-of-slovak-pm-has-rattled-europe-12724220.html", "message": "You are already a Moneycontrol Pro user."}, {"id": "4be2bb06-988f-4deb-a17e-c848b65bf430", "title": "Radiological material found at terror probe house", "date": "2024-05-16 20:30", "url": "https://www.yahoo.com/news/radiological-material-found-terror-probe-192017887.html", "message": "Police said there was no risk to local residents or the wider public [Tony Fisher/BBC]The Metropolitan Police said \"small traces of radiological material\" had been detected during a counter-terrorism operation in Bedfordshire.\nSpecialist officers have been searching a house in Caddington, near Luton, after suspicious substances were found earlier this month.\nA 31-year-old man from Bedford has been arrested on suspicion of terrorism offences and remained in custody.\n\"During the searches over the past few days, some very small traces of radiological material have been detected,\" he added.\nOn Tuesday, the suspect was additionally arrested on suspicion of possession of articles for terrorist purposes."}, {"id": "44e977c8-85a4-437a-9ca0-c43362abdadb", "title": "J & K : Two terrorists gunned down as army foils infiltration bid along LoC in Kupwara | India News", "date": "2024-05-16 09:15", "url": "https://timesofindia.indiatimes.com/india/jk-two-terrorists-gunned-down-as-army-foils-infiltration-bid-along-loc-in-kupwara/articleshow/110172643.cms", "message": "(With inputs from agencies)NEW DELHI: Two terrorists were killed on Thursday as the Indian Army foiled an infiltration bid along the Line of Control ( LoC ) in the Kupwara district of Jammu and Kashmir The operation, conducted jointly by the Indian Army and Jammu and Kashmir Police, was initiated based on specific intelligence inputs in the Amrohi, Tangdhar, and Kupwara areas on May 15, 2024, as per a statement from the official X handle of the army's Chinar Corps .During the ensuing search operation, security forces recovered two pistols, ammunition, and other war-like stores, indicating the nefarious intentions of the infiltrators.The search operation remains ongoing in the area, with further updates awaited as the situation unfolds.This development comes on the heels of the recent ' Operation Redwani Payeen ,' where the Indian Army successfully neutralized three terrorists after a vigil spanning 40 hours.\nLaunched in response to the ambush of an IAF vehicle that resulted in the loss of a senior Air Force officer's life, the operation underscored the army's relentless efforts to combat terrorism in the region."}, {"id": "3a480f15-c88b-4665-8765-a8dc50c21336", "title": "Man arrested in terrorism probe after  suspicious substance found in village", "date": "2024-05-16 01:30", "url": "https://www.belfasttelegraph.co.uk/news/uk/man-arrested-in-terrorism-probe-after-suspicious-substances-found-in-village/a467305202.html", "message": "The 31-year-old man from Bedfordshire was arrested on Wednesday on suspicion of possession of articles for terrorist purposes and remains in custody, police said (Peter Byrne/PA)A man has been arrested by counter-terrorism officers after “a number of suspicious substances” were found at a property in Bedfordshire.\nThe 31-year-old man, from Bedfordshire, was arrested on Tuesday on suspicion of possession of articles for terrorist purposes and remains in custody, the Metropolitan Police said.\nHe had previously been arrested on May 6 by Bedfordshire Police on suspicion of causing explosions likely to endanger life and possession of class A drugs, but was bailed before being re-arrested.\nThe investigation was taken over by the Met’s Counter Terrorism Command on Monday after continued searches at the residential address, the Met said.\nThe Met added it continues to work closely with colleagues from Bedfordshire Police and the Eastern Region Special Operations Unit as the investigation continues."}, {"id": "5037f75a-04bd-4265-9111-9854e7c3ddd6", "title": "Two Ukrainian Railways workers killed in Russian attack", "date": "2024-05-16 03:15", "url": "https://www.yahoo.com/news/two-ukrainian-railways-workers-killed-024501716.html", "message": "A railway inspector and repairman working for Ukrainian Railways (Ukrzaliznytsia) were killed by Russian shelling of civilian railroad infrastructure in Dnipropetrovsk Oblast, Ukrzaliznytsia reported on May 15.\nRussian forces have carried out deadly attacks against Dnipropetrovsk Oblas since 2022.\nRussia’s April 19 strike on downtown Dnipro killed three people and wounded 24 others, according to local officials.\nThe UN's humanitarian coordinator in Ukraine, Denise Brown, later issued a statement condemning the attack.\nUkrainian President Volodymyr Zelensky visited Dnipro soon after the attack, calling on Western partners to provide meaningful air defense support."}, {"id": "72cc3363-245f-4b5e-a708-6367155c452f", "title": "French defense committee takes swipe at German industry tack", "date": "2024-05-16 15:15", "url": "https://www.defensenews.com/global/europe/2024/05/16/french-defense-committee-takes-swipe-at-german-industry-tack/", "message": "Competition between European defense companies is “very strong” and even increasing, mainly because industrial cooperation is weak.\nOnly 18% of capital expenditure on defense by European Union member states is collaborative, against a target of 35%, according to the rapporteurs.\nWhile lack of political will may weigh on joint programs, the committee says the main hurdles are difficulties such as excessive time frames.\nStrong intra-European competition is linked to “non-cooperative national strategies,” with the European space industry the biggest victim, according the committee.\nThe project promotes Israel’s Arrow-3 and the U.S. Patriot system, “even though our Franco-Italian SAMP/T ground-air defense system could have met German requirements,” Thiérot said."}, {"id": "607e90ac-443e-4d1f-9425-3a6bf8a07672", "title": "Kerem Shalom reopens to Gaza aid days after deadly Hamas attack", "date": "2024-05-16 20:30", "url": "https://www.jewishledger.com/2024/05/kerem-shalom-reopens-to-gaza-aid-days-after-deadly-hamas-attack/", "message": "(JNS) Israel reopened the Kerem Shalom crossing with the Gaza Strip on Tuesday morning after a deadly Hamas rocket attack from Rafah on Sunday caused its closure.\nFollowing the closure of Kerem Shalom crossing due to rocket fire by Hamas, the Kerem Shalom Crossing is now open for the entry of humanitarian aid into the Gaza Strip.\nCOGAT noted that the Erez Crossing continued to facilitate the entry of humanitarian aid into Gaza while Kerem Shalom was shuttered.\nThousands of humanitarian aid trucks have passed through Kerem Shalom during the war.\nRafah-based terrorists again attacked Kerem Shalom on Tuesday morning, firing two rockets and later four mortars, according to the IDF."}, {"id": "17b1cb71-a4bc-48fa-a66e-a3225380841c", "title": "The 8 at 8 : Thursday", "date": "2024-05-16 07:15", "url": "https://www.thejournal.ie/the-8-at-8-thursday-45-6381028-May2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "eedb3e1e-c7c3-4a17-b429-1112752c486f", "title": "Slovakian prime minister riddled with bullets in assassination attempt", "date": "2024-05-16 16:45", "url": "https://www.theblaze.com/news/slovakian-prime-minister-riddled-with-bullets-in-assassination-attempt", "message": "Slovakian Prime Minister Robert Fico was riddled with bullets Wednesday in an apparent assassination attempt.\nDeputy Prime Minister Tomas Taraba told the BBC that Fico's surgery, which dragged on for five hours, \"went well,\" adding, \"I guess in the end he will survive.\"\n'This assassination attempt was politically motivated and the suspect made the decision to do it shortly after the presidential election.'\nPellegrini wrote on X, \"An assassination attempt on the Prime Minister is a threat to everything that has adorned Slovak democracy so far.\"\nNATO Secretary General Jens Stoltenberg wrote, \"Shocked and appalled by the shooting of Prime Minister Robert Fico."}, {"id": "1d3e2681-4c79-49e1-aacb-5112a4fb2b38", "title": "UN Court Opens Hearings On Israel Offensive in Rafah", "date": "2024-05-16 18:30", "url": "https://www.shtfplan.com/headline-news/un-court-opens-hearings-on-israels-offensive-in-rafah", "message": "A top United Nations court has opened a hearing on Israel’s operation in Rafah after a request from South Africa.\nThe African nation is requesting Israel halt its offensive in the Southern Gaza city of Rafah.\nSouth Africa has recently asked the court to order Israel to withdraw from Rafah and to take measures to ensure unimpeded access for U.N. officials, humanitarian organizations, and journalists to the Gaza Strip.\nU.S. Claims There’s No Signs Of Genocide In GazaThis war began after Hamas attacked southern Israel on October 7th, 2023.\nIsrael continues to reiterate that its goal is the total elimination of Hamas, the terrorist group that carried out the attack that started this war."}, {"id": "0a5271a2-d388-447e-85f0-1e4df9046772", "title": "PM Modi On Attack On Slovak Minister Robert Fico : Cowardly , dastardly act", "date": "2024-05-16 05:15", "url": "https://www.ndtv.com/india-news/pm-modi-on-attack-on-slovak-minister-robert-fico-cowardly-dastardly-act-5674295", "message": "PM Modi condemned the attack on Slovakia's PM Robert Fico.\nPrime Minister Narendra Modi on Thursday condemned the attack on Slovakia's PM Robert Fico, calling it a \"cowardly and dastardly act\".\nExpressing shock over the attack, PM Modi posted on his X handle, \"Deeply shocked at the news of the shooting at Slovakia's Prime Minister, H.E.\nMr. Robert Fico.\nAccording to local media, the Slovak Prime Minister is no longer in a life-threatening condition after surgery."}, {"id": "90cab2c0-d615-491c-a99b-cd6df524be3d", "title": "Battles rage across Gaza - News Today | First with the news", "date": "2024-05-16 04:45", "url": "https://newstodaynet.com/2024/05/16/battles-rage-across-gaza/", "message": "Israeli troops fought militants across Gaza on Wednesday, including in the southern city of Rafah that had been a refuge for civilians, in an upsurge of the more than seven-month war that has killed tens of thousands of Palestinians.\nAntagonism between Israel and the United Nations worsened as the Israeli army sought an explanation for footage showing armed men next to U.N. Palestinian relief agency vehicles.\nSeparately, the U.N. said it was investigating an unidentified strike that killed an international staff member in Gaza earlier this week.\nSince Hamas’ Oct. 7 attack, Israel has killed 35,000 Palestinians, according to Gaza health officials, with 82 dead on Tuesday in the highest single-day toll for weeks.\nIn the northern Jabalia refugee camp, residents said Israeli tanks had destroyed clusters of homes but were facing heavy resistance."}, {"id": "1fef14e2-3e79-4a4d-804f-4476069adca6", "title": "Is Russia assault on northeastern Ukraine already losing steam ? | Russia - Ukraine war News", "date": "2024-05-16 14:00", "url": "https://www.aljazeera.com/news/2024/5/16/is-russias-assault-on-northeastern-ukraine-already-losing-steam", "message": "As Russia’s war on Ukraine escalates, it has been viewed more than 13,000 times since.\nVovchansk is an industrial town in the northeastern Kharkiv region that sits just 5km (3 miles) away from the Russian border and has been under attack since Friday.\nThat’s when Russian forces began their two-pronged raid on the region and seized almost a dozen villages within days.\nSo far, the raid is Russia’s largest ground attack on Ukraine since August 2022, when the Ukrainian military kicked out the invaders from most of the Kharkiv region.\nSazonov posted on his Telegram channel written refusals that were found on the bodies of four Russian servicemen killed near the village of Staritsa."}, {"id": "5d7890af-399a-44c5-a6b3-36a7448e3f75", "title": "Five Israeli soldiers killed in Gaza friendly fire attack", "date": "2024-05-16 07:00", "url": "https://www.rte.ie/news/2024/0516/1449448-middle-east-gaza-israel/", "message": "The army said that the five soldiers were killed when two Israeli tanks mistakenly fired shells at the building they were in during clashes in the northern Jabalia refugee camp yesterday.\nAFP reporters, witnesses and medics said that Israeli warplanes again targeted areas across Gaza overnight, including in Gaza City and its southern Zeitun area, Jabalia and the Nuseirat refugee camp.\nThe Israeli premier insisted yesterday that any planning for a post-war Gaza was \"empty talk\" until Hamas is defeated.\nIsrael's military retaliation has killed at least 35,233 people, mostly civilians, according to the health ministry in Hamas-ruled Gaza.\nIsrael's latest fatalities take to 278 the number of its troops killed in the Gaza military campaign since the start of the ground offensive on 27 October."}, {"id": "533b4cd5-48ef-45bb-ac3d-5c2d8f47c661", "title": "  Cowardly , Dastardly Act , Says PM Modi On Attack On Slovak PM Robert Fico", "date": "2024-05-16 06:00", "url": "https://menafn.com/1108219769/Cowardly-Dastardly-Act-Says-PM-Modi-On-Attack-On-Slovak-PM-Robert-Fico", "message": "(MENAFN- IANS) New Delhi, May 16 (IANS) Prime Minister Narendra Modi on Thursday condemned the attack on Slovakia's PM Robert Fico, calling it a \"cowardly and dastardly act\".\nExpressing shock over the attack, PM Modi posted on his X handle, \"Deeply shocked at the news of the shooting at Slovakia's Prime Minister, H.E.\nMr. Robert Fico.\nAccording to local media, the Slovak Prime Minister is no longer in a life-threatening condition after surgery.\nThe attack has been classified as a politically motivated assassination attempt, according to Slovak Interior Minister Matus Sutaj Estok."}, {"id": "1381ed07-40b2-44bb-a837-ccec374e5f98", "title": "Israel moves in on Hamas stronghold in northern Gaza , strikes Rafah without advancing", "date": "2024-05-16 12:15", "url": "https://www.theglobeandmail.com/world/article-israel-moves-in-on-hamas-stronghold-in-northern-gaza-strikes-rafah/", "message": "“We are wearing Hamas down,” Israeli Defence Minister Yoav Gallant said, announcing that more troops would be deployed in Rafah, where he said several tunnels had been destroyed.\nSenior Hamas official Sami Abu Zuhri responded that the group would defend its people “by all means”.\nIsrael has denied South African allegations of genocide in Gaza and said it had complied with an earlier court order to step up aid.\nIsrael accuses Hamas of diverting aid, something it denies.\nIsrael declared major operations over in northern Gaza months ago while pledging to return to prevent Hamas regrouping."}, {"id": "d9bc70a8-c8e3-4240-8df5-c702b238a99e", "title": "The Latest | US military finishes pier for delivering aid into Gaza as Israel presses in Rafah", "date": "2024-05-16 11:15", "url": "https://www.clickorlando.com/news/world/2024/05/16/the-latest-us-military-finishes-pier-for-delivering-aid-into-gaza-as-israel-presses-in-rafah/", "message": "The Latin Patriarchate in Jerusalem says Cardinal Pierbattista Pizzaballa entered Gaza on Thursday and visited the Holy Family Church in Gaza City.\nHeavy fighting has erupted in areas adjacent to Gaza City in recent days.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nThe fighting began shortly after Israel launched its war against Hamas following the militant group’s attack on southern Israel.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "f9e3f729-e751-4b58-94e5-998899a7cbdb", "title": "Fugitive Moldovan Oligarch Gets Russian Citizenship", "date": "2024-05-16 15:45", "url": "https://www.rferl.org/a/fugitive-shor-moldova-russian-citizienship/32950124.html", "message": "But some positive signs could be seen, President-elect Peter Pellegrini told reporters after visiting Fico.\n\"He is able to speak but only a few sentences and then he is really tired because he is on some medication,\" Pellegrini, a key ally of the prime minister, added.\n\"During the night doctors managed to stabilize the patient's condition,\" Deputy Prime Minister Robert Kalinak told reporters gathered at the hospital where Fico was being treated.\nInterior Minister Matus Sutaj Estok told reporters that an initial investigation showed there was “a clear political motivation” behind the attack on Fico.\nGerman Chancellor Olaf Scholz said the \"news of the cowardly assassination attempt on Slovakian Prime Minister Fico shocks me deeply."}, {"id": "2269d797-c5e0-4b18-a341-16db3a04c0b8", "title": "The Latest | US military finishes pier for delivering aid into Gaza as Israel presses in Rafah", "date": "2024-05-16 10:45", "url": "https://www.news4jax.com/news/world/2024/05/16/the-latest-us-military-finishes-pier-for-delivering-aid-into-gaza-as-israel-presses-in-rafah/", "message": "The Latin Patriarchate in Jerusalem says Cardinal Pierbattista Pizzaballa entered Gaza on Thursday and visited the Holy Family Church in Gaza City.\nHeavy fighting has erupted in areas adjacent to Gaza City in recent days.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nThe fighting began shortly after Israel launched its war against Hamas following the militant group’s attack on southern Israel.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "30b7d744-5f45-44b8-84e2-84a40ff5c47d", "title": "In Moscow , Hints of Support for Strategic Defense", "date": "2024-05-16 03:15", "url": "https://www.heritage.org/europe/report/moscow-hints-support-strategic-defense", "message": "Evidence has been accumulating that Moscow is rethinking seriously its long opposition to strategic defense.\nThe new awareness of the Third World missile threat could lead Moscow to field anti-missile defenses as a way to protect itself against this threat.\nThis Ministry of Defense report comes on the heels of a year- long debate inside the Soviet military in which some key experts have voiced support for strategic defenses.\nThroughout the Cold War the Soviet military planned primarily for a major war against the U.S. and the West.\nNo longer does the Soviet military view America as the sole potential military adversary."}, {"id": "b95cc4a5-2a2f-4c75-9496-1c0270069a1b", "title": "How Chinese Maoism Intellectually Shaped Modern Palestinian Jihadism", "date": "2024-05-16 15:30", "url": "https://thediplomat.com/2024/05/how-chinese-maoism-intellectually-shaped-modern-palestinian-jihadism/", "message": "Founded in 1964, the PLO recognized that Maoist China played an important role in the global resistance front against Western imperialism and colonialism.\nIn fact, Maoist China was the first non-Arab government to officially recognize the PLO.\nDuring the 1960s and 1970s, Chinese state media drew inaccurate comparisons between the Chinese revolution and the Palestinian situation.\nDuring the 1970s, Maoism became a leading ideological framework for the fractured Palestinian cause and an important part of the Palestinian political milieu.\nConstant surveillance and vigilance for foreign agents and saboteurs characterized both Maoist China and Hamas-controlled Gaza."}, {"id": "b9fddf49-b67a-409d-97a7-a32659493ab1", "title": "Fierce battles as Israeli forces push further into Gaza", "date": "2024-05-16 01:30", "url": "https://www.indaily.com.au/news/2024/05/16/fierce-battles-as-israeli-forces-push-further-into-gaza", "message": "Israeli tanks reached densely populated neighbourhoods and narrow alleyways of the militant stronghold of Jabalia in the northeast, facing heavy resistance.\nThe armed wing of Hamas ally Islamic Jihad said its militants killed and wounded Israeli footsoldiers during fierce clashes in eastern Jabalia, the biggest of eight refugee camps built in Gaza after the 1948 Middle East Arab-Israeli war.\nThe Israeli military said it had begun an operation overnight against “terrorist operatives and infrastructure” in the centre of Jabalia.\nIt said earlier that a soldier had been killed in combat in the southern Gaza Strip on Tuesday.\nThe UN agency for Palestinian refugees said on Wednesday that families were being forcibly displaced again by Israeli forces evacuation orders and enhancing military operations."}, {"id": "ef3a0e04-ff25-4f23-8359-2358724866d5", "title": "A PAPER TIGER ? RUSSIANS ARE TOO AFRAID TO SENT THEIR NEWEST  ARMATA  TANK TO UKRAINE |", "date": "2024-05-16 16:15", "url": "https://freerepublic.com/focus/f-chat/4238184/posts", "message": "RUSSIANS ARE TOO AFRAID TO SENT THEIR NEWEST 'ARMATA' TANK TO UKRAINE || 2024Warthog Defense You Tube Channel ^ | 15 May 2024 | Warthog DefensePosted on by MeganCSynopsis: The Russian T-14 'Armata' has been deployed to active duty in the Russian army but will not see combat in Ukraine.\n@Bfdidc 1 day ago A weapon you refuse to deploy for fear of losing it is not much of a weapon.\n@Tea-nOpals 1 day ago They built a tank that can't be sent into battle because they can't afford to lose it.\n@polocarthaigh893 1 day ago I wonder if all those russki flags at the cemetery were made in China?\n@de-bodgery 1 day ago Armata is \"too expensive to use\"...LOL!"}, {"id": "a947a044-dd14-4f83-aad8-4150d046dbf1", "title": "Slovak Premier Condition Stable But Serious , Minister Says", "date": "2024-05-16 09:30", "url": "https://www.bnnbloomberg.ca/slovak-premier-s-condition-stable-but-serious-minister-says-1.2073735", "message": "(Bloomberg) -- Slovak Prime Minister Robert Fico’s injuries remain life-threatening even as his condition stabilized a day after he was shot, as a fuller picture emerged of a “lone wolf” assailant driven by political animus.\n‘Lone Wolf’Authorities have identified the suspected assailant as Juraj C. from the western Slovak town of Levice.\nWho Is Robert Fico, the Slovak PM Who Has Been Shot?\nIt was the first shooting of a European head of state or government since the assassination of Serbian Prime Minister Zoran Djindjic in March 2003.\nSince his return to power, the Slovak leader has drawn protests nationwide for rewriting the criminal code and scrapping a special prosecutor’s office, tasked with fighting serious crime and corruption."}, {"id": "0ec35c60-00da-4d60-88d1-641917282656", "title": "The Latest | US military finishes pier for delivering aid into Gaza as Israel presses in Rafah", "date": "2024-05-16 09:15", "url": "https://isp.netscape.com/news/world/story/0001/20240516/c7318fc513e79580082c0a80ae6878b6", "message": "The Latest | Israel says it will send more troops to Rafah, as fighting also rages in Gaza's northIsrael's defense minister said the military would send more troops into Rafah, a city along Gaza's southern border with Egypt, as fighting also rages in northern Gaza, where Hamas has regrouped.\nThe Latin Patriarchate in Jerusalem says Cardinal Pierbattista Pizzaballa entered Gaza on Thursday and visited the Holy Family Church in Gaza City.\nHeavy fighting has erupted in areas adjacent to Gaza City in recent days.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "20812144-fdc3-4839-b342-1d2b90dd1fb7", "title": "Slovak PM shot in assassination bid ,  extremely serious  ", "date": "2024-05-16 06:15", "url": "https://www.rediff.com/news/report/slovak-pm-shot-in-assassination-bid-extremely-serious/20240516.htm", "message": "IMAGE: Slovak Prime Minister Robert Fico speaks during a press conference, before a shooting incident where he was wounded, in Handlova, Slovakia, May 15, 2024.\nPhotograph: Radovan Stoklasa/ReutersThe critically wounded prime minister is still undergoing surgery in the town of Banska Bystrica.\nAll our thoughts are with Prime Minister Fico and his family.'\n'Appalled to learn about the shooting of Slovak Prime Minister Robert Fico.\n'I was deeply shocked by the heinous attack against my friend, Prime Minister Robert Fico."}, {"id": "12ddd67f-35ed-4f7d-8b50-04d0abfc4d1c", "title": "Putin ally says Ukraine risks dragging the West into a major war with Russia", "date": "2024-05-16 11:15", "url": "https://www.channelnewsasia.com/world/putin-ally-says-ukraine-risks-dragging-west-major-war-russia-4340586", "message": "President Vladimir Putin's war in Ukraine has touched off the worst breakdown in relations between Russia and the West since the 1962 Cuban Missile Crisis.\nHe said that Ukrainian lawmakers were trying to convince the United States to allow Kyiv to use US-supplied weapons to strike Russian territory.\nThe United States has been wary of its weapons being used in a direct attack on Russia, the world's biggest nuclear power, due to the wider risks.\nRussia has warned that the use of US and Western weapons against targets inside Russia could trigger a new level of confrontation - and Putin has ordered tactical nuclear weapon exercises, partly as a response to Western statements.\nPutin accused the West last week of risking a global conflict and said no one would be allowed to threaten Russia."}, {"id": "91ead838-519f-4e9e-97f4-ce9b37a315ea", "title": "Palestinian social media groups celebrate stabbing attack", "date": "2024-05-16 14:15", "url": "http://www.israelnationalnews.com/news/390054", "message": "Residents of Judea and Samaria report that Palestinian social media groups have been celebrating the stabbing attack at Yitzhar Junction this morning, and calling for others to imitate the attacker.\nA message that has gone viral on Palestinian Telegram groups shows a picture of a man with a kefiyyeh and a knife approaching a man in haredi garb, with a caption reading, \"Stab and plunge your knife into their skulls.\"\nResidents of the area report that recently, security forces have received orders to clear numerous roadblocks, some built by the forces and some by Israeli civilians, that have been closing the roads out of Palestinian Authority towns in Judea and Samaria since the early months of the war.\nThe residents believe that the stabbing attack is a direct result of the order to reopen the roads, and groups from many towns are planning protests with the intent of keeping the roads closed to Palestinian traffic."}, {"id": "696acbab-f337-42a8-9648-0e21f7448df2", "title": "Putin ally says Ukraine risks dragging the West into a major war with Russia", "date": "2024-05-16 11:15", "url": "https://www.swissinfo.ch/eng/putin-ally-says-ukraine-risks-dragging-the-west-into-a-major-war-with-russia/77695470", "message": "Putin ally says Ukraine risks dragging the West into a major war with Russia2 minutesMOSCOW (Reuters) – The speaker of Russia’s lower house of parliament warned that Ukraine was dragging the United States and Europe into a major global war and on Thursday urged Western leaders to act responsibly to avoid a catastrophe.\nPresident Vladimir Putin’s war in Ukraine has touched off the worst breakdown in relations between Russia and the West since the 1962 Cuban Missile Crisis.\nHe said that Ukrainian lawmakers were trying to convince the United States to allow Kyiv to use U.S.-supplied weapons to strike Russian territory.\nThe United States has been wary of its weapons being used in a direct attack on Russia, the world’s biggest nuclear power, due to the wider risks.\nPutin accused the West last week of risking a global conflict and said no one would be allowed to threaten Russia."}, {"id": "322a22b7-90c3-42a1-b048-577d04179fbb", "title": "  Lone wolf  charged with shooting prime minister , Slovak interior minister says", "date": "2024-05-16 13:30", "url": "https://www.irishexaminer.com/world/arid-41396443.html", "message": "The Slovak interior minister said on Thursday that a “lone wolf” has been charged in the shooting that seriously wounded Prime Minister Robert Fico.\nThe attempted assassination has shocked the small central European nation, with leaders blaming the attack in part on extreme political polarisation that has divided the country.\nInterior minister Matus Sutaj Estok told a press conference that the man charged did not belong to any political groups.\nThe interior minister said on Wednesday that an initial investigation found “a clear political motivation” behind the attack on Mr Fico while he was attending a government meeting in a former coal mining town.\nHowever, he said Thursday that the suspect charged was a lone wolf who “did not belong to any political groups”."}, {"id": "1ae806b1-2803-48e8-893c-6d70a86330dd", "title": "Slovak PM Fico no longer in life - threatening condition after being shot , minister says", "date": "2024-05-16 06:15", "url": "https://www.news24.com/news24/world/news/slovak-pm-fico-no-longer-in-life-threatening-condition-after-being-shot-minister-says-20240516", "message": "CONTENT WARNING: Graphic video below that might upset viewersSlovak Prime Minister Robert Fico is no longer in a life-threatening condition after he was shot in an assassination attempt on Wednesday.\nSlovak Deputy Prime Minister and Environment Minister Tomas Taraba told the BBC that Fico was \"not in a life-threatening situation at this moment\".\nSlovak Prime Minister Robert Fico is no longer in a life-threatening condition after he was shot in an assassination attempt when leaving a government meeting on Wednesday, a government minister said.\nThe gunman shot Fico, 59, five times, initially leaving the prime minister in critical condition and undergoing surgery hours later on Wednesday evening.\nInterior Minister Matus Sutaj Estok had said earlier that Fico was in a life-threatening condition while he remained in the operating room."}, {"id": "641a6302-8095-414b-b2c0-7333eee8426c", "title": "Moment wife of Slovakian  assassin  is taken away by cops  for her own protection  as minister warns country is  on the edge of civil war  after shooting of PM Robert Fico", "date": "2024-05-16 12:00", "url": "https://www.dailymail.co.uk/news/article-13425673/Moment-wife-Slovakian-assassin-taken-away-cops-protection-minister-warns-country-edge-civil-war-shooting-PM-Robert-Fico.html", "message": "Slovakia's Prime Minister Robert Fico was 'millimetres from death', president-elect Peter Pellegrini has declared, after he was shot by a 'lone wolf' assassin in a shocking attack and rushed to intensive care yesterday.\nIf the 'gunshot wounds were just a few millimetres either side, we would be talking about him as the late prime minister,' Pellegrini solemnly told reporters today.\nFico returned to power in Slovakia last year, having previously served twice as prime minister.\nOn Wednesday, Russian President Vladimir Putin sent a message to President Caputova, expressing his support and wishing the prime minister a fast and full recovery.\n'I know Robert Fico as a courageous and strong-willed person."}, {"id": "2c49136e-afa7-41dd-b4e4-8a671626b34a", "title": "Slovak prime minister in critical condition after apparent assassination attempt", "date": "2024-05-16 02:00", "url": "https://www.yahoo.com/news/slovak-prime-minister-critical-condition-011317866.html", "message": "Slovakia's Prime Minister Robert Fico speaks during a press conference with Hungary's Prime Minister Viktor Orban at the Carmelite Monastery in Budapest, Hungary, Tuesday, Jan. 16, 2024.\n| Denes ErdosSlovak Prime Minister Robert Fico suffered life-threatening injuries on Wednesday when he was shot and wounded in an apparent assassination attempt that stunned his small Central European nation and sent shockwaves across Europe three weeks before EU Parliament elections are scheduled to be held.\nA physical attack on the prime minister is, first of all, an attack on a person, but it is also an attack on democracy.\nFico, a reported admirer of Hungary’s Prime Minister Viktor Orban, has increasingly expressed opposition to allowing Ukraine to join NATO.\nAfter today’s event, Orban said, “I was deeply shocked by the heinous attack against my friend, Prime Minister Robert Fico."}, {"id": "50428b53-158d-4c8d-908f-a25e53390779", "title": "US Missing How China Could Seize Taiwan Without Invading : Experts", "date": "2024-05-16 22:30", "url": "https://www.businessinsider.com/us-missing-how-china-could-seize-taiwan-without-invading-experts-2024-5", "message": "download the appSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily.\nDefense experts say that an aggressive Chinese coercion campaign, short of war but still threatening, is more likely than a full-scale invasion and the US needs to prepare for such an event.\nEconomic and diplomatic pressure is notable, and Chinese misinformation operations and the potential to slowly set up a blockade of Taiwan are also concerns.\nAnnabelle Chih/Getty ImagesThe report identifies four things key to resisting Chinese coercion.\nCM-11 tanks fire artillery during the 2-day live-fire drill, amid intensifying threats military from China, in Pingtung county, Taiwan, 7 September 2022."}, {"id": "cb9865f2-be5a-4c9f-8c6a-800ede4a3ecc", "title": "UN staff member killed , another injured in another attack as Israel deliberately targets aid workers – NaturalNews . com", "date": "2024-05-16 20:30", "url": "https://www.naturalnews.com/2024-05-16-un-staff-killed-injured-in-israeli-attack.html", "message": "\"Israel’s allies need to recognize that these attacks that have killed aid workers have happened over and over again, and they need to stop.\"\nMore related stories:Israel kills SEVEN Gaza food aid workers in “accidental” airstrikes where Israeli drones hunted, targeted and destroyed three clearly marked food aid vehicles.\nIsrael accused of targeting aid workers and deliberately provoking famine in Gaza.\nUnited Nations accuses Israel of BLOCKING humanitarian aid deliveries into Gaza Strip.\nIsrael \"systematically targeted\" Gaza food aid workers, new evidence shows — it wasn’t an \"accident!\""}, {"id": "39b54d46-27e4-4149-a3c9-3591fffc5ca5", "title": "Slovakian government could go down dark path following attempted assassination", "date": "2024-05-16 16:45", "url": "https://www.irishtimes.com/world/europe/2024/05/16/slovakian-government-could-go-down-dark-path-following-attempted-assassination/", "message": "Photograph: Jakub Gavlak/EPAThe attempted assassination of the prime minister of Slovakia will probably be a turning point for politics in the central European country, but not necessarily for the better.\nHe previously served as prime minister from 2006 to 2010 and again from 2012 until 2018, when he resigned amid controversy.\nHungary's prime minister Viktor Orban speaks with Slovakia's prime minister Robert Fico in October.\nWhile many politicians on all sides have called for calm, others have framed the attack on the prime minister within a familiar us-vs-them narrative.\nThe attempted assassination might lead to a genuine effort across the political spectrum to tone down the divisive rhetoric."}, {"id": "e39f73a9-cc53-4bf7-bd96-faaf601c05d6", "title": "Five Israeli troops killed by friendly fire in Gaza", "date": "2024-05-16 12:15", "url": "https://gulfnews.com/world/mena/five-israeli-troops-killed-by-friendly-fire-in-gaza-1.102655664", "message": "AFP reporters, witnesses and medics said on Thursday that Israeli warplanes again targeted areas across Gaza overnight, including in Gaza City and its southern Zeitun area, Jabalia and the Nuseirat refugee camp.\n‘Alternative to Hamas’The Israeli premier insisted on Wednesday that any planning for a post-war Gaza was “empty talk” until Hamas is defeated.\nIsrael’s military retaliation has killed at least 35,233 people, mostly civilians, according to the health ministry in Hamas-ruled Gaza.\nIsrael’s latest fatalities take to 278 the number of its troops killed in the Gaza military campaign since the start of the ground offensive on October 27.\nAmid the bloodiest ever Gaza war and the surging civilian death toll, Israel has faced a storm of international anger and a global wave of pro-Palestinian demonstrations."}, {"id": "9e6a28a0-5f89-4f44-bb2c-eac0062cd63b", "title": "Slovak PM Fico no longer in life - threatening condition after being shot , minister says | World News", "date": "2024-05-16 03:15", "url": "https://indianexpress.com/article/world/slovak-pm-fico-no-longer-in-life-threatening-condition-after-being-shot-minister-says-9331992/", "message": "Slovak Prime Minister Robert Fico is no longer in a life-threatening condition after he was shot in an assassination attempt when leaving a government meeting on Wednesday, a government minister said.\nThe gunman shot Fico, 59, five times, initially leaving the prime minister in critical condition and undergoing surgery hours later on Wednesday evening.\nDefence Minister Robert Kalinak told a news briefing hours earlier that Fico had suffered \"serious polytrauma\" after several shot wounds.\nInterior Minister Matus Sutaj Estok had said earlier that Fico was in a life-threatening condition while he remained in the operating room.\nRead more | Who is Robert Fico, the Slovak PM shot at after government meeting?"}, {"id": "a1ccf2d0-ead8-40fd-90f0-1c346582c691", "title": "Overnight missile attack destroys Russian air defense and jets in occupied Crimea", "date": "2024-05-16 12:15", "url": "https://www.yahoo.com/news/overnight-missile-attack-destroys-russian-103700727.html", "message": "A Russian S-400 air defense system and two MiG-31 fighter jets were destroyed, and a fuel depot was set ablaze in an evening attack on the Belbek military airfield in Sevastopol, temporarily occupied Crimea, according to the Russian Telegram channel ASTRA on May 16.\nLater that morning, a missile struck the S-400 Triumph air defense system near the village of Vyshneve, causing a fire.\nEarlier, the pro-Ukrainian resistance movement Atesh reported that the main artillery depot at the Belbek airfield had been damaged.\nResidents of Hvardiiske, home to another military airfield, also reported hearing loud explosions.\nRussian propaganda outlets accused Ukraine of attacking Crimea with ATACMS ballistic missiles, claiming that their air defenses intercepted the missiles."}, {"id": "3f711afa-9dda-48ff-9e95-ca7e5cc16690", "title": "Australian Conservative Lawmaker Told to Remove  Israeli Scarf  During Senate Nakba Vote | The Jewish Press - JewishPress . com | David Israel | 8 Iyyar 5784 – Thursday , May 16 , 2024", "date": "2024-05-16 12:15", "url": "https://www.jewishpress.com/news/left-vs-right/australian-conservative-lawmaker-told-to-remove-israeli-scarf-during-senate-nakba-vote/2024/05/16/", "message": "“Labor wants to reward Hamas terrorism because that group of antisemitic barbarians has huge support in the socialist left of Labor and the Australian Greens.\nThe speech prompted a walkout by Senate members of the Australian Greens.\nOn June 22, 2017, Hanson introduced a motion in the Australian Senate calling on the government to respond to the Halal inquiry.\nOn August 17, 2017, Hanson wore a burqa on the floor of the Australian Senate in a move to rally support for a national ban on the religious attire, citing “national security” concerns.\nConclusion: If you’re Jewish and living in Australia, don’t vote Labor or Greens."}, {"id": "d37a435f-78a7-496e-a76d-183957e40936", "title": "Slovakia PM Robert Fico not in life - threatening condition", "date": "2024-05-16 04:45", "url": "https://www.the-star.co.ke/news/world/2024-05-16-slovakia-pm-robert-fico-not-in-life-threatening-condition-deputy-pm/", "message": "Slovak Prime Minister Robert Fico is no longer in a life-threatening condition after being shot several times, the deputy prime minister has said.\nEarlier the defence minister said Mr Fico was \"fighting for his life\" after being gravely injured in an attack in the small town of Handlova.\n\"As far as I know, the operation went well and I guess that at the end he will survive,\" Mr Taraba said.\nIn his interview with the BBC, Deputy Prime Minister Taraba blamed \"false narratives\" by opposition parties in Slovakia for the shooting.\nMr Fico returned to power in Slovakia after elections last September, as the head of a populist-nationalist coalition."}, {"id": "9ed39301-e5df-49f0-a338-aae1fb673f45", "title": "Senator pro - Palestine comments inappropriate , PM says", "date": "2024-05-16 00:15", "url": "https://www.centralwesterndaily.com.au/story/8630459/senators-pro-palestine-comments-inappropriate-pm-says/", "message": "Senator Payman's comments were made on the 76th anniversary of the Nakba, translated as 'the catastrophe', which marks the 1948 Palestine War where thousands of Palestinians were killed in massacres by Israeli military forces, and hundreds of thousands more were expelled from their homes in the land that would become Israel."}, {"id": "2bd72d3e-44c1-4055-8deb-16383b16b2e3", "title": "Senator pro - Palestine comments inappropriate , PM says", "date": "2024-05-16 01:00", "url": "https://www.theleader.com.au/story/8630459/senators-pro-palestine-comments-inappropriate-pm-says/?cs=30776", "message": "Senator Payman's comments were made on the 76th anniversary of the Nakba, translated as 'the catastrophe', which marks the 1948 Palestine War where thousands of Palestinians were killed in massacres by Israeli military forces, and hundreds of thousands more were expelled from their homes in the land that would become Israel."}, {"id": "3341ed8f-69ee-443f-8fb1-077e9b13414f", "title": "Senator pro - Palestine comments inappropriate , PM says", "date": "2024-05-16 00:45", "url": "https://www.juneesoutherncross.com.au/story/8630459/senators-pro-palestine-comments-inappropriate-pm-says/?cs=9676", "message": "Senator Payman's comments were made on the 76th anniversary of the Nakba, translated as 'the catastrophe', which marks the 1948 Palestine War where thousands of Palestinians were killed in massacres by Israeli military forces, and hundreds of thousands more were expelled from their homes in the land that would become Israel."}, {"id": "dd1468f8-d256-4bc2-91c7-c2076b0285c3", "title": "Senator pro - Palestine comments inappropriate , PM says", "date": "2024-05-16 00:45", "url": "https://www.dailyliberal.com.au/story/8630459/senators-pro-palestine-comments-inappropriate-pm-says/", "message": "Senator Payman's comments were made on the 76th anniversary of the Nakba, translated as 'the catastrophe', which marks the 1948 Palestine War where thousands of Palestinians were killed in massacres by Israeli military forces, and hundreds of thousands more were expelled from their homes in the land that would become Israel."}, {"id": "88b788aa-0796-42e7-a98b-7ea7ce60ba93", "title": "Senator pro - Palestine comments inappropriate , PM says", "date": "2024-05-16 00:00", "url": "https://www.naroomanewsonline.com.au/story/8630459/senators-pro-palestine-comments-inappropriate-pm-says/?cs=14264", "message": "Senator Payman's comments were made on the 76th anniversary of the Nakba, translated as 'the catastrophe', which marks the 1948 Palestine War where thousands of Palestinians were killed in massacres by Israeli military forces, and hundreds of thousands more were expelled from their homes in the land that would become Israel."}, {"id": "36f6837e-53cb-4794-8a63-4b8ee4bcd0d9", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 07:15", "url": "https://www.breakingnews.ie/world/slovakian-prime-ministers-condition-not-life-threatening-after-shooting-1626085.html", "message": "Slovakia’s populist prime minister Robert Fico is “not in a life threatening situation” after he was shot multiple times and gravely wounded on Wednesday, his deputy prime minister has said.\nThe prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nAdvertisementGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "432cd569-6026-4658-90cc-edcf360d11f9", "title": "Erdoğan condemns attempted assassination of Slovak PM Fico", "date": "2024-05-16 07:15", "url": "https://www.dailysabah.com/politics/diplomacy/erdogan-condemns-attempted-assassination-of-slovak-pm-fico", "message": "President Recep Tayyip Erdoğan strongly condemned \"the heinous assassination attempt” against Slovakia’s Prime Minister Robert Fico on Wednesday.\n\"I extend my get-well wishes to the people and government of Slovakia on behalf of my country and nation,” said Erdoğan as he wished him a speedy recovery.\nHe also wished Fico a speedy recovery and said he hoped for the condemnation of such savage attacks worldwide and accountability for the perpetrators.\n\"I wish a speedy recovery to Slovakian Prime Minister Robert Fico, who was seriously injured as a result of the armed attack.\nFico was taken to a hospital after he was shot and injured, according to state-run media."}, {"id": "e48634ad-9df5-4858-924c-735e62293d38", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 05:45", "url": "https://www.bournemouthecho.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "cb280193-7e06-4c8d-b702-9b521cd85f3d", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 05:15", "url": "https://www.thetelegraphandargus.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "3a4d1fb0-8b4b-4d2f-83fc-fa2ebb82c0f0", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 07:30", "url": "https://www.salisburyjournal.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "aefcb05a-1127-408a-8a77-040a1e453df8", "title": "Slovakia : PM Fico in  very seriou state after shooting – DW – 05 / 16 / 2024", "date": "2024-05-16 10:15", "url": "https://www.dw.com/en/slovakia-pm-fico-in-very-serious-state-after-shooting/a-69093218", "message": "Slovakia's president-elect visited Prime Minister Robert Fico in hospital, saying he was able to speak but not easily.\nSlovakia's Prime Minister Robert Fico remained in a serious condition on Thursday after doctors managed to stabilize him following an assassination attempt a day earlier.\nFico was shot several times in an attack that is believed to have had a political motive.\nSlovak President Zuzana Caputova, a political rival of Fico, appealed for calm and described the assassination attempt as an \"attack on democracy.\"\nAccording to Heger, the political debate in the run-up to the presidential election, won by Fico's ally Peter Pellegrini, had been \"very dirty.\""}, {"id": "d986b013-6b7d-442c-9679-d51bdecd2767", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 07:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "d427a0e7-49c0-4253-a8d8-e324328c95b4", "title": "Turkish intel eliminates 2 PKK terrorists plotting attack in Iraq", "date": "2024-05-16 07:15", "url": "https://www.dailysabah.com/politics/war-on-terror/turkish-intel-eliminates-2-pkk-terrorists-plotting-attack-in-iraq", "message": "Türkiye’s National Intelligence Organization (MIT) has eliminated two PKK terrorists preparing to attack Turkish military posts in the northern Iraqi region of Hakurk, security sources said Thursday.\nThe terrorists, identified as Ahmet Bayar, code-named “Tufan Koçer,” and Ahmed Ibrahim Al-Ahmed, code-named “Mervan Zerevan,” were instructed to infiltrate Turkish military bases, sources said.\nThe PKK carried out attacks, killing more than a dozen Turkish soldiers in the past two months in Metina.\nThe high toll led to an increase in Turkish operations, which sometimes take place deep into Iraqi territory.\nAnkara is also preparing to provide Iraq with technical assistance for securing its borders to prevent the mobility of PKK around the region."}, {"id": "aba97b21-64b2-4ca5-ac91-185b60ad1833", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 05:30", "url": "https://www.eadt.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "6686ccbf-016c-4583-92b0-15f66fdcf460", "title": "Global Airborne Fire Control Radar Market Size To Worth USD", "date": "2024-05-16 01:30", "url": "https://www.globenewswire.com/news-release/2024/05/16/2883038/0/en/Global-Airborne-Fire-Control-Radar-Market-Size-To-Worth-USD-3-972-5-Million-By-2033-CAGR-of-3-51.html", "message": "New York, United States , May 15, 2024 (GLOBE NEWSWIRE) -- The Global Airborne Fire Control Radar Market Size to Grow from USD 2,813.4 Million in 2023 to USD 3,972.5 Million by 2033, at a Compound Annual Growth Rate (CAGR) of 3.51% during the forecast period.\nThese radar systems are crucial for increasing situational awareness, enabling air-to-air and ground combat capabilities, and ensuring the success of aerial missions.\nAs militaries strive to increase operational capabilities and preserve a competitive edge, investment in next-generation radar systems remains a major priority.\nInquire Before Buying This Research Report: https://www.sphericalinsights.com/inquiry-before-buying/4277Insights by RegionNorth America is anticipated to dominate the Airborne Fire Control Radar Market from 2023 to 2033.\nNorth American defence businesses leverage their technological expertise and global networks to sell airborne fire control radar systems to allies and foreign customers."}, {"id": "0060b4b7-ec9a-440f-8846-13b8737335f9", "title": "Slovak PM condition  not life threatening  after attack", "date": "2024-05-16 07:00", "url": "https://www.rte.ie/news/world/2024/0516/1449444-slovakia-fico/", "message": "Slovak Prime Minister Robert Fico was speaking but tired and still in a \"really difficult condition\" a day after being shot multiple times, the president-elect said after visiting his ally.\n\"He is able to speak but only a few sentences and then he is really, really tired because he is on some medication ...\nAppearing alongside her at a news conference before his visit to Mr Fico, Mr Pellegrini urged parties to suspend or tone down their campaigning for next month's European Parliament elections.\nVeteran leaderMr Fico has dominated Slovak politics for much of the past two decades, winning re-election last October for a fourth stint as prime minister.\nMr Fico was shot while greeting supporters in the street after chairing a government meeting in the central town of Handlova."}, {"id": "bdfe637c-74bd-4f4e-a6f7-63024abd59e6", "title": "Aid delivery to Gaza  almost impossible  amid intensified fighting : UN", "date": "2024-05-16 21:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/17/content_117193666.htm", "message": "You are here:视频播放位置 下载安装Flash播放器GAZA, May 16 (Xinhua) -- The United Nations (UN) on Thursday considered humanitarian aid distribution \"almost impossible\" in the Gaza Strip amid the ongoing war between Israel and the Islamic Resistance Movement (Hamas), which has lasted over 200 days.\nThe UN Office for the Coordination of Humanitarian Affairs (OCHA) said that distributing humanitarian aid \"is almost impossible\" in Gaza, due to the irregular fuel supply and interrupted communications amid intense fighting there.\nShortly after its reopening on May 8, militants fired eight rockets from southern Gaza's Rafah toward the Kerem Shalom crossing area in Israel.\nOCHA and other humanitarian organizations warned of the devastating impact of the crossings' closure on over 2 million Palestinians in war-stricken Gaza.\nOn Thursday, the Jordan Armed Forces said it conducted three airdrops of humanitarian aid over various locations in southern Gaza."}, {"id": "fba25dbc-1bb4-4e32-8121-bb2ae4e8a784", "title": "  Small traces of radiological material  found after man arrested in Bedfordshire", "date": "2024-05-16 20:30", "url": "https://www.belfasttelegraph.co.uk/news/uk/small-traces-of-radiological-material-found-after-man-arrested-in-bedfordshire/a222643662.html", "message": "“Very small traces of radiological material” were found at a Bedfordshire property during a counter-terrorism probe, the Metropolitan Police has said.\nA 31-year-old man from Bedfordshire who was arrested on Tuesday on suspicion of a terrorism offence is still in police custody and officers believe there is no risk to the public.\n“During the searches over the past few days, some very small traces of radiological material have been detected.\nThe man was first arrested and bailed on suspicion of causing explosions likely to endanger life and possession of class A drugs.\nThe next day he was arrested on suspicion of possession of articles for terrorist purposes and he remains in custody."}, {"id": "d9e383c4-e2f6-4285-bcdb-0ea865206d14", "title": "Netanyahu claims  no humanitarian crisi as hundreds of thousands flee Rafah", "date": "2024-05-16 07:00", "url": "https://www.hurriyetdailynews.com/netanyahu-claims-no-humanitarian-crisis-as-hundreds-of-thousands-flee-rafah-193595", "message": "Netanyahu claims 'no humanitarian crisis' as hundreds of thousands flee RafahJERUSALEMIsraeli Prime Minister Benjamin Netanyahu on Wednesday insisted there was no \"humanitarian catastrophe\" in Rafah, even as hundreds of thousands fled the south Gaza city amid intense bombardments.\nBut even as he announced that hundreds of thousands had been \"evacuated\", Netanyahu insisted there was no humanitarian crisis in Rafah.\nThe United Nations agency for Palestinian refugees, UNWRA, meanwhile said \"600K people have fled Rafah since military operations intensified\".\nIsraeli Defense Minister Yoav Gallant on Wednesday said he would \"not agree to the establishment of an Israeli military administration in Gaza, Israel must not have civilian control over the Gaza Strip\".\n'Civilians are starving'The Israeli military said Wednesday its aircraft had \"struck and eliminated approximately 80 terror targets\" including military compounds, missile launchers and weapons depots."}, {"id": "232d58a6-bb77-43b7-a1d2-6f69571e152b", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 07:15", "url": "https://www.theboltonnews.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "53aefc95-b30e-435e-bfd1-bad88652782b", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 07:00", "url": "https://www.thenorthernecho.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "The prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\n“He’s not in a life threatening situation at this moment.”Speaking outside of the hospital where the prime minister was receiving treatment, defence minister Robert Kalina told reporters that the prime minister had been hit in the abdomen and that doctors had fought for his life for several hours.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "e710475a-a968-4b29-8ec7-be21a9a2d328", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 05:30", "url": "https://www.lbc.co.uk/world-news/8f54f1171ddb4edc867aadc63b1c06ce/", "message": "Deputy prime minister Tomas Taraba told the BBC: ‘He’s not in a life threatening situation at this moment.’Slovakia’s populist prime minister Robert Fico is “not in a life threatening situation” after he was shot multiple times and gravely wounded on Wednesday, his deputy prime minister has said.\nThe prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nDeputy prime minister Tomas Taraba and the defence minister of Slovakia Robert Kalinak during a press conference at the hospital (Denes Erdos/AP)Deputy prime minister Tomas Taraba told the BBC: “I guess in the end he will survive.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "0d0b8c78-d041-47e8-a2e0-1879de405527", "title": "  Small traces of radiological material  found after man arrested in Bedfordshire", "date": "2024-05-16 19:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24326070.small-traces-radiological-material-found-man-arrested-bedfordshire/", "message": "A 31-year-old man from Bedfordshire who was arrested on Tuesday on suspicion of a terrorism offence is still in police custody and officers believe there is no risk to the public.\n“As we’ve said previously, we have found a number of suspicious substances at the address in Caddington.\n“During the searches over the past few days, some very small traces of radiological material have been detected.\nThe man was first arrested and bailed on suspicion of causing explosions likely to endanger life and possession of class A drugs.\nThe next day he was arrested on suspicion of possession of articles for terrorist purposes and he remains in custody."}, {"id": "cc8a16ef-7067-4ed4-bb9d-6c1e7b62a63e", "title": "Slovakia prime minister expected to survive assassination attempt as shock reverberates across Europe", "date": "2024-05-16 07:15", "url": "https://www.foxnews.com/world/slovakia-prime-minister-expected-survive-assassination-attempt-shock-across-europe", "message": "Slovakia’s prime minister is expected to survive after he was shot multiple times and gravely wounded during an attempted assassination on Wednesday, according to his deputy.\n\"I guess in the end he will survive,\" Deputy Prime Minister Tomas Taraba told the BBC, adding: \"He’s not in a life-threatening situation at this moment.\"\nA suspect was swiftly arrested following the attack Wednesday and an initial investigation found \"a clear political motivation,\" Interior Minister Matus Sutaj Estok said.\n\"A physical attack on the prime minister is, first of all, an attack on a person, but it is also an attack on democracy,\" said outgoing President Zuzana Caputova, Fico’s political rival.\nCzech Prime Minister Petr Fiala chimed in with other world leaders and wished the prime minister a swift recovery, saying \"we cannot tolerate violence, there’s no place for it in society.\""}, {"id": "2eb94e56-8b2b-4720-adea-acb82bee9789", "title": "Putin next target may be the  NATO lake  – Butler Eagle", "date": "2024-05-16 05:15", "url": "https://www.butlereagle.com/20240516/putins-next-target-may-be-the-nato-lake/", "message": "The rest of the coastal littoral is in NATO hands: Sweden, Finland, Estonia, Latvia, Lithuania, Poland, Germany and Denmark.\nThen, the Baltic naval situation was fairly balanced between U.S.-NATO on one side and USSR-Warsaw Pact on the other.\nNaval Forces in Europe (and my key aide at NATO a decade ago), was a senior observer and mentor of the exercise.\nRussia will push back against any NATO Baltic drills, although the correlation of forces at sea is now weighted heavily against them.\nFortunately, the addition of Sweden and Finland to the alliance — call it “Putin’s Folly” — gives NATO more options than ever in the Baltic Sea."}, {"id": "471800a0-4e3b-4f95-87ad-4b4a145df694", "title": "  Strongly condemn this cowardly act : PM Modi wishes speedy recovery to Slovak PM Robert Fico", "date": "2024-05-16 08:15", "url": "https://www.firstpost.com/world/prime-minister-narendra-modi-wishes-slovakia-prime-minister-robert-fico-assaissination-plot13771410-13771410.html", "message": "“I strongly condemn this cowardly and dastardly act and wish PM Fico a speedy recovery.\nI strongly condemn this cowardly and dastardly act and wish PM Fico a speedy recovery.\nThe incident occurred after the Slovakian prime minister was leaving a government meeting.\nThe gunman shot Fico, 59, five times, initially leaving the prime minister in critical condition and undergoing surgery hours later on Wednesday evening.\nSlovak Deputy Prime Minister Tomas Taraba said that one bullet went through Fico’s stomach and a second hit a joint."}, {"id": "4afa6667-d774-40c5-8780-7216332eb426", "title": "Slovakia PM Robert Fico not in life - threatening condition - deputy PM", "date": "2024-05-16 04:15", "url": "https://www.bbc.co.uk/news/world-europe-69019121", "message": "Slovak Prime Minister Robert Fico is in a stable but serious condition after being shot several times on Wednesday, according to doctors.\nThe hospital director said he was currently in an intensive care unit after five hours in surgery.\nEarlier Mr Fico, 59, was said to have been fighting for his life after being gravely injured in an attack in the small town of Handlova.\nMiriam Lapunikova, director of the F. D. Roosevelt University Hospital in Banska Bystrica, where Mr Fico was admitted, told a press conference that his condition \"is truly very serious\".\nMr Fico is a divisive figure at home - and controversial in the EU - for his calls to end military aid to Ukraine and sanctions on Russia."}, {"id": "1ecd7931-19ae-44aa-8afa-3ee1baa9b85c", "title": "Slovak PM suffers life - threatening wounds in assassination attempt", "date": "2024-05-16 02:15", "url": "https://myrepublica.nagariknetwork.com/news/slovak-pm-suffers-life-threatening-wounds-in-assassination-attempt/", "message": "Published On: May 16, 2024 07:45 AM NPT By: Republica | @RepublicaNepalBRATISLAVA, May 16 : Slovakia's Prime Minister Robert Fico was battling life-threatening wounds Wednesday after officials said he was shot multiple times in an assassination attempt condemned by European leaders.\nOutgoing Slovak President Zuzana Caputova told reporters that \"police have detained the attacker\".\nSlovak television showed footage of a middle-aged man in jeans being handcuffed on the ground.\n\"An assassination attempt on one of the highest constitutional officials is an unprecedented threat to Slovak democracy,\" he added on X, formerly Twitter.\nRobert Fico is fighting for his life because of your hatred,\" Blaha said."}, {"id": "55fa1c37-b864-4bf0-a0c0-57512aba70f7", "title": "There Been an Update on Slovakian PM After Assassination Attempt", "date": "2024-05-16 15:30", "url": "https://townhall.com/tipsheet/leahbarkoukis/2024/05/16/slovakian-president-update-n2639149", "message": "Slovakian Prime Minister Robert Fico is expected to recover after he was shot multiple times in an assassination attempt Wednesday after a government meeting in Handlova.\n“Fortunately, as far as I know, the operation went well and I guess in the end he will survive,” Taraba said of the five-hour surgery.\n\"Our prime minister several times mentioned in the past that he was afraid that this would happen,\" Mr Taraba said in another interview with the BBC's World Tonight programme.\nMr Estok added that he believed \"this assassination [attempt] was politically motivated\".\n(BBC)On Thursday, Slovakian police charged former security guard and poet Juraj Cintula, 71, with attempted murder in the shooting of Fico."}, {"id": "17a91007-706c-49fa-8dcb-cc9ce4785281", "title": "Israel Massacres Civilians Seeking Internet Access : Gaza", "date": "2024-05-16 07:30", "url": "https://www.miragenews.com/israel-massacres-civilians-seeking-internet-1236369/", "message": "Notably, the Israeli army continues to repeatedly target and kill Palestinian civilians, including journalists, as they attempt to access communications and Internet services to reach their families or employers.\nUsing aerial bombardment,snipers, or drones, Israel directly targets these individuals—who pose no threat or danger to its army—in various areas of the Gaza Strip.\nAn Israeli drone fired a missile at a group of Palestinian civilians in the heart of Gaza City on Wednesday afternoon.\nThe Israeli military's systematic, pervasive, anddeliberate killing of Palestinian civilians is essential to the genocide that Israel is being allowed to commit against the people of the Gaza Strip.\nUrgent international intervention is necessary toend Israel's impunity, make sure that those responsible for the genocide in the Gaza Strip are held accountable, and ensure that all survivors are fairly compensated."}, {"id": "4a5b3a14-6b6f-4e51-a883-115625c64c6b", "title": "Despite Hamas Ties , Biden Removes Cuba From List of Terror States", "date": "2024-05-16 10:45", "url": "https://www.frontpagemag.com/despite-hamas-ties-biden-removes-cuba-from-list-of-terror-states/", "message": "The Communist regime in Cuba has a long history of terrorism, and not just the Marxist kind either.\nOn Feb. 25th, a Hamas delegation publicly visited Jorge León Cruz, the Cuban Ambassador in Lebanon.\nAccording to US reports, Cuba has provided key intelligence to Iran, Syria, Hamas, and Hezbollah, to conduct terrorist attacks.\nCuba and Iran have long-term relationships with terrorist groups Hamas and Hezbollah, and a decades-long hostility toward Israel, a U.S. ally in the Middle East.\nSince Oct. 7, Iran and Cuba have publicly backed Hamas and refused to condemn its terrorist attacks against Israel."}, {"id": "4d0c19e1-d1a4-4def-8b35-3742cd293174", "title": "Slovak PM Fico no longer in critical condition after being shot five times", "date": "2024-05-16 06:15", "url": "https://www.geo.tv/latest/544332-slovak-pm-fico-no-longer-in-critical-condition-after-being-shot-five-times", "message": "Slovak PM Fico no longer in critical condition after being shot five timesSlovakia PM survived an assassination attempt and was left in critical condition after being shot five timesSlovakia's Prime Minister Robert Fico looks on during a press conference with German Chancellor Olaf Scholz in Berlin, Germany, January 24, 2024.\nFico, 59, survived an assassination attempt and was left in critical condition and had to go through surgery after being shot five times while leaving a government meeting a day earlier.\nThe shooting in the central Slovak town of Handlova, which Slovak media said was carried out by a 71-year-old man, stunned the small central European nation and drew international condemnation.\nSecurity officials detain a person after the shooting of Slovak PM Robert Fico in Handlova, Slovakia on May 15.\nFico has long been critical of Slovakia's mainstream media, refusing to speak to some outlets."}, {"id": "8b6e8d18-9ac7-49e7-859b-25feb89b3188", "title": "Slovak PM no longer in life - threatening condition after being shot , minister says", "date": "2024-05-16 04:00", "url": "https://www.thedailystar.net/news/world/news/slovak-pm-no-longer-life-threatening-condition-after-being-shot-minister-says-3611206", "message": "Slovak Prime Minister Robert Fico is no longer in a life-threatening condition after he was shot in an assassination attempt when leaving a government meeting on Wednesday, a government minister said.\nThe gunman shot Fico, 59, five times, initially leaving the prime minister in critical condition and undergoing surgery hours later on Wednesday evening.\nInterior Minister Matus Sutaj Estok had said earlier that Fico was in a life-threatening condition while he remained in the operating room.\nThe shooting in the central Slovak town of Handlova, which Slovak media said was carried out by a 71-year-old man, stunned the small central European nation and drew international condemnation.\nBroadcaster TA3 reported the leftist prime minister had been hit in the abdomen in the attack."}, {"id": "a0a4439e-424a-41c6-b382-6e7603d1ff69", "title": "  Small traces of radiological material  found after man arrested in Bedfordshire", "date": "2024-05-16 20:30", "url": "https://www.thenorthernecho.co.uk/news/national/24326070.small-traces-radiological-material-found-man-arrested-bedfordshire/", "message": "A 31-year-old man from Bedfordshire who was arrested on Tuesday on suspicion of a terrorism offence is still in police custody and officers believe there is no risk to the public.\n“As we’ve said previously, we have found a number of suspicious substances at the address in Caddington.\n“During the searches over the past few days, some very small traces of radiological material have been detected.\nThe man was first arrested and bailed on suspicion of causing explosions likely to endanger life and possession of class A drugs.\nThe next day he was arrested on suspicion of possession of articles for terrorist purposes and he remains in custody."}, {"id": "e0238326-875c-4f5e-9536-5b8cfe7d1f04", "title": "The US is worried about an invasion , but China could take control of Taiwan without firing a shot , war experts warn", "date": "2024-05-16 23:00", "url": "https://www.yahoo.com/news/us-worried-invasion-china-could-214601138.html", "message": "The US is worried about an invasion, but China could take control of Taiwan without firing a shot, war experts warnThe US and its allies are focused on preventing a Chinese invasion of Taiwan.\nA new report argues there's a lack of readiness for other ways China could take control of Taiwan.\nAn aggressive Chinese coercion campaign is far more likely than an invasion and already happening, experts warn.\nDefense experts say that an aggressive Chinese coercion campaign, short of war but still threatening, is more likely than a full-scale invasion and the US needs to prepare for such an event.\nCM-11 tanks fire artillery during the 2-day live-fire drill, amid intensifying threats military from China, in Pingtung county, Taiwan, 7 September 2022."}, {"id": "233d1f89-b8f6-4279-84b1-820b653af93e", "title": "Slovakian prime minister condition  not life threatening  after shooting", "date": "2024-05-16 05:15", "url": "https://www.ipswichstar.co.uk/news/national/24323410.slovakian-prime-ministers-condition-not-life-threatening-shooting/", "message": "Slovakia’s populist prime minister Robert Fico is “not in a life threatening situation” after he was shot multiple times and gravely wounded on Wednesday, his deputy prime minister has said.\nThe prime minister had been greeting supporters at an event in the town of Handlova, 85 miles north-east of the capital.\nGovernment officials confirmed that five shots were fired outside of the cultural centre where the prime minister was attending a government meeting.\nA hospital official in Banska Bystrica said Mr Fico was in a serious but stable condition.\nConcern is mounting that populists and nationalists like Mr Fico could make gains in the 27-member bloc."}, {"id": "f7bb1e27-3b62-438f-a8c3-405433979e23", "title": "Clinton warns of  proxies , terrorists  coming to Syria", "date": "2024-05-16 04:00", "url": "https://www.defenceweb.co.za/security/national-security/clinton-warns-of-proxies-terrorists-coming-to-syria/", "message": "U.S. Secretary of State Hillary Clinton said that the crisis in Syria must not be allowed to descend into sectarian warfare and she warned against “proxies or terrorist fighters” being sent in to join the conflict.\n“We have to send very clear expectations about avoiding sectarian warfare.\nThose who are attempting to exploit the situation by sending in proxies or terrorist fighters must realise that will not be tolerated,” Clinton said at a news conference in the South African capital Pretoria.\nShe did not elaborate on her reference to “proxies or terrorist fighters” or name any particular country or group.\nClinton said the international community must step up work on planning for a post-Assad Syria."}, {"id": "b7ae8a64-cd92-46e6-8d80-79859f4ce440", "title": "A Challenge for the U . S . in an Unstable Peru", "date": "2024-05-16 03:15", "url": "https://www.heritage.org/americas/report/challenge-the-us-unstable-peru", "message": "IN AN UNSrABLE PERU INTRODUCTION Because of a decade of turmoil, Peru has become a major foreign policy concern for the United States.\nSupport Fujimoris anti-narcotics initiative through increased tech nological and material assistance for Peruvian drug interdiction and eradication efforts.\nBe cause of his Japanese an cestry, many Peruvians ap parently see him as a leader who could bring Japan-style economic prosperity to Peru PERUS UNCERTAIN POLITICAL FUTURE 3 Winning Praise.\nThese measures not only impede Perus economic development, but also raise the cost of goods to U.S. consumers by billions of dollars.\nIt obtains its weapons by steal ing them from the Peruvian military or buying them on the international arms market."}, {"id": "b1fde7e5-4062-46b5-b785-9c1badd4fec9", "title": "Ukraine getting more longe - range missiles that leave the Russians with  nowhere to hide  ", "date": "2024-05-16 22:15", "url": "https://www.yahoo.com/news/ukraines-getting-more-longe-range-212335712.html", "message": "Ukraine's getting more longe-range missiles that leave the Russians with 'nowhere to hide'Ukraine's Western allies have promised to send it more long-range missiles.\nThe number of missiles isn't publicly known, but ATACMS missiles average about $1.3 million each.\nThese air-dropped missiles can fly at low altitudes to avoid detection and have been used to strike Russian naval headquarters and vehicle-repair depots in the occupied Crimean peninsula.\nIndeed, Kyiv has used the American missiles in recent weeks to strike Russian airfields and troop gatherings.\nMissiles like ATACMS and Storm Shadow \"will enable Ukraine to neutralize Russia's advantages and eventually enable them to regain the initiative,\" he added."}, {"id": "4f2e1094-ae03-4a46-a45f-d214e66d2b3c", "title": "  A wake - up call to West : Europe on edge after assassination attempt on Slovakian PM Robert Fico", "date": "2024-05-16 04:45", "url": "https://timesofindia.indiatimes.com/world/europe/a-wake-up-call-to-west-europe-on-edge-after-assassination-attempt-on-slovakian-pm-robert-fico/articleshow/110164222.cms", "message": "Who is Robert Fico?\nEurope on edgeIn a disturbing incident that has sent shockwaves across Europe, Slovak Prime Minister Robert Fico was targeted in an assassination attempt that left him seriously injured.\nThe event unfolded on a seemingly ordinary day in Handlova, Slovakia, when Fico was approached by a gunman as he was engaging with supporters.\nDescribing the shooting as a \"monstrous\" crime, Putin said in a telegram sent to Slovakia's President Zuzana Caputova: \"I know Robert Fico as a courageous and strong-minded man.\nIf we ignore this latest threat to Western security the chances of getting drawn into a wider war in Europe are manifestly greater."}, {"id": "021cfb9e-3784-4e9d-87c5-a380e20429c3", "title": "IDF soldier injured in West Bank stabbing attack", "date": "2024-05-16 10:30", "url": "https://www.ynetnews.com/article/byggonmxr", "message": "A man hunt was underway after a terrorist stabbed and wounded a member of the IDF near the West Bank city of Huwara on Thursday.\nThe wounded man suffering from a chest wound, drove himself to a near by military post at the entrance to Nablus, where he was given initial medical treatment and was later evacuated, fully conscious, to hospital."}, {"id": "e7cbc9ef-d8f8-45f0-8c06-24578d428848", "title": "Rift in Israel war cabinet as defence chief opposes  military rule  in Gaza | Israel War on Gaza News", "date": "2024-05-16 09:15", "url": "https://www.aljazeera.com/news/2024/5/16/rift-in-israel-war-cabinet-as-defence-chief-opposes-military-rule-in-gaza", "message": "On Wednesday, Gallant said he was opposed to the Israeli military control or taking responsibility for the governance of Gaza.\n“I must reiterate … I will not agree to the establishment of Israeli military rule in Gaza.\nIsrael must not establish civilian rule in Gaza,” he told a news conference.\n“This is all really showing deepening divisions among members of the war cabinet at a very critical time,” said Al Jazeera’s Mohammed Jamjoom, reporting from Amman, Jordan, following an Israeli ban on the network.\nOn Thursday, the Israeli military said five soldiers were killed in northern Gaza, attributing it to “friendly fire”."}, {"id": "ed636a87-a9a2-4634-af5b-93fcc54b5d97", "title": "Global leaders condemn shooting attack on Slovak PM ; wish him speedy recovery", "date": "2024-05-16 04:30", "url": "https://timesofoman.com/article/145572-global-leaders-condemn-shooting-attack-on-slovak-pm-wish-him-speedy-recovery", "message": "\"I am alarmed to hear reports of an attack on Slovak Prime Minister Robert Fico.\n\"The United States condemns the shooting of Slovak Prime Minister Fico.\n\"Shocked by the shots that hit Slovak Prime Minister Robert Fico.\n\"I strongly condemn the heinous assassination attempt against Slovakian Prime Minister Robert Fico, and I wish a speedy recovery to Mr. Fico, who was injured in the attack.\nSlovakia's President Zuzana Caputova said in a news conference that the attack on Slovak Prime Minister was \"also an attack on democracy.\""}, {"id": "02965f9e-7e7b-4264-90d9-397e1ac580bf", "title": "Slovakian Prime Minister Robert Fico conscious again after being shot", "date": "2024-05-16 01:45", "url": "https://www.yahoo.com/news/slovakian-prime-minister-robert-fico-004406410.html", "message": "Bodyguards take Slovakian Prime Minister Robert Fico to safety in a car from the scene of the incident.\nRadovan Stoklasa/TASR/dpaSlovakian Prime Minister Robert Fico, who was critically injured in an assassination attempt on Wednesday, has regained consciousness after an operation lasting several hours, local media reported.\nRescue workers carry the shot and injured Slovakian Prime Minister Robert Fico on a stretcher to a hospital in Banska Bystrica.\nJan Kroslák/TASR/dpaRobert Fico, Prime Minister of Slovakia, arrives for a government meeting at the House of Culture.\nSlovakian Prime Minister Fico has been shot and injured after a cabinet meeting in the town of Handlova."}, {"id": "da2e198e-3abb-4147-b200-af26cab4beb6", "title": "Slovakian Prime Minister Robert Fico expected to survive shooting , deputy says", "date": "2024-05-16 04:00", "url": "https://apnews.com/article/slovakia-prime-minister-shooting-robert-fico-handlova-bdaaf0bba01035a700145a67d871a482", "message": "BANSKA BYSTRICA, Slovakia (AP) — Slovakia’s populist Prime Minister Robert Fico was shot multiple times and gravely wounded Wednesday, but his deputy prime minister said he believed Fico would survive.\nThe prime minister had been greeting supporters at an event when the attempted assassination took place, shocking the small country and reverberating across Europe weeks before an election.\nSlovak Prime Minister Robert Fico is in life-threatening condition after being wounded in a shooting after a political event Wednesday afternoon, according to his Facebook profile.\nSlovakia’s populist Prime Minister Robert Fico is in life-threatening condition after being wounded in a shooting Wednesday afternoon, according to his Facebook profile.\nSlovakia's populist Prime Minister Robert Fico is in life-threatening condition after being wounded in a shooting Wednesday afternoon, according to his Facebook profile."}, {"id": "634f958c-fe91-4428-a8be-c55a7cc7685b", "title": "  Lone wolf  charged with shooting prime minister , Slovak interior minister says", "date": "2024-05-16 12:15", "url": "https://www.breakingnews.ie/world/lone-wolf-charged-with-shooting-prime-minister-slovak-interior-minister-says-1626209.html", "message": "Mr Fico, 59, was in a serious but stable condition a day after being shot multiple times in the stomach, a hospital official said.\nAdvertisementPresident-elect Peter Pellegrini said he spoke to Mr Fico at the hospital but confirmed his condition “remains very serious”.\nAdvertisementInterior minister Matus Sutaj Estok asked journalists to “reflect” on how they had covered Mr Fico’s policies.\n“I think each of you can reflect on the way you presented it.”At the same news conference, deputy prime minister Robert Kalinak also blamed the media for tensions in the country.\nMr Fico returned to power in Slovakia last year, having previously served twice as prime minister."}, {"id": "714850f9-1f49-4507-b388-f24093142600", "title": "Israel at War , Day 223 : Arab League Calls for International Force in Gaza , West Bank - Middle East News", "date": "2024-05-16 18:30", "url": "https://www.haaretz.com/middle-east-news/2024-05-16/ty-article/.premium/israel-at-war-day-223-arab-league-calls-for-international-force-in-gaza-west-bank/0000018f-8234-d7f9-a5ff-b7767c470000", "message": "Israel at War, Day 223: Arab League Calls for International Force in Gaza, West BankU.S. shares Israeli Defense Minister Gallant's concerns that Israel has no plans for 'day after' war, senior U.S. official says ■ More forces will join Israeli op in Rafah, Gallant says ■ U.S. anchors temporary floating pier for aid delivery to Gaza beach ■ IDF probing incident in which IDF tank fire killed five soldiers in Gaza ■ Hezbollah fires 40 rockets, explosive drone towards Israel ■ Here's what you need to know 223 days into the war"}, {"id": "4dd27d5c-0f59-4d29-a614-9ede4d9edde0", "title": "Counter - terror police seize  dirty bomb  explosives from garden shed and arrest  far - right extremist , 31 , in quiet village", "date": "2024-05-16 00:45", "url": "https://www.dailymail.co.uk/news/article-13423639/counter-terror-police-dirty-bomb-explosives-garden-shed.html", "message": "A 31-year-old man was arrested on suspicion of terror offences by police who allegedly seized 'dirty bomb' explosives and radioactive material from a garden shed as they swooped in.\nHe was bailed following his first arrest - but further searches discovered further 'suspicious substances'.\nThe operation was then passed to Metropolitan Police counter-terror officers and the man was arrested again on suspicion of possessing articles for terrorist purposes.\nBedfordshire Police would initially say that a man had been arrested after receiving 'reports of suspicious substances' being stored at the address.\nLocals said the arrested man was a loner who rarely went outside - and if he did, would venture out with a hood up covering his face."}, {"id": "1ab2a2a0-de0a-4de6-b6c8-bcdd9a247976", "title": "Slovakia Fico  stabilized but remains seriou after shooting", "date": "2024-05-16 08:45", "url": "https://www.yahoo.com/news/slovakias-fico-stabilized-remains-serious-074358697.html", "message": "Bodyguards take Slovakian Prime Minister Robert Fico to safety in a car from the scene of the incident.\nFico had been shot and injured after a cabinet meeting in the town of Handlova.\nRadovan Stoklasa/TASR/dpaThe condition of Slovakian Prime Minister Robert Fico, who was shot and critically injured in an assassination attempt on Wednesday, has \"stabilized but remains serious,\" Defence Minister Robert Kalinak told the news agency TASR on Thursday.\nRobert Fico, Slovakia's Prime Minister, opens a government meeting.\nSlovakian Prime Minister Fico has been shot and injured after a cabinet meeting in the town of Handlova."}, {"id": "4b16069b-9c2b-40f1-ba36-f3af3501a295", "title": "Nigeria : One Worshipper Killed , 24 Injured in Kano Mosque Bomb Explosion", "date": "2024-05-16 05:15", "url": "https://allafrica.com/stories/202405160084.html", "message": "The police say the 38-year-old suspect set off a petrol bomb in the mosque following a family dispute over inheritance.\nThe police have arrested a man who allegedly detonated a bomb that killed a worshipper and injured 24 others in a mosque in Gezawa Local Government Area of Kano State.\nThe incident occurred early Wednesday morning when the worshippers were observing the 'Subh' prayer at Gadan, a community in the LGA.\nThe police chief said preliminary forensic analysis indicated that the explosion was caused by a petrol bomb.\n\"Out of the 24 victims admitted at the hospital, one is dead,\" Mr Sanda said."}, {"id": "59b96c62-2bd8-4e1d-9f6e-41f73992eeca", "title": "A Palestinian converted to Judaism . An Israeli soldier saw him as a threat and opened fire", "date": "2024-05-16 17:30", "url": "https://www.startribune.com/a-palestinian-converted-to-judaism-an-israeli-soldier-saw-him-as-a-threat-and-opened-fire/600366343/", "message": "The Zeitoun family declined to speak with The Associated Press, fearing reprisal.\nAcross the West Bank, Jewish settlers live apart from Palestinians in guarded settlements where they're subject to different laws.\nNearly 500 Palestinians have been killed by Israeli fire since the war's start, according to the Palestinian Health Ministry.\nNo one from the Zeitoun family attended the funeral, said Parag, who's designing his friend's gravestone.\nHe said it will read: ''David Ben-Avraham Zeitoun Parag."}, {"id": "0ae1aa01-88e3-4589-8f5f-5a7824825da1", "title": "How impunity for extremist Jewish settlers shape Israel govt - Israel News", "date": "2024-05-16 21:45", "url": "https://www.jpost.com/israel-news/article-801455", "message": "Jews seen outside the Cave of the Patriarchs in the West Bank city of Hebron, on October 21, 2021.\nJews began returning to Hebron in 1967 when the West Bank was recaptured in the Six Day War.\nInternational scholars and human rights activists debate the legality of Jews settling in the West Bank amid a military occupation.\nThe New York Times report does not specify that the two politicians were involved in a terrorist organization.\nThe New York Times report then discusses a wave of violence throughout the 1980s against Palestinians by Jews in the West Bank."}, {"id": "8992912b-f6da-4216-b8a0-40a0085d20e4", "title": "China is quietly building the world first drone carrier", "date": "2024-05-16 01:00", "url": "https://www.zmescience.com/science/news-science/china-is-quietly-building-the-worlds-first-drone-carrier/", "message": "FacebookXLinkedInPinterestEmailThe previously unreported drone carrier (A) is longer but narrower than two drone motherships (C, D) built at the same yard.\nChina has quietly launched a revolutionary new type of aircraft carrier.\nHidden away in a shipyard on the Yangtze River, this vessel is probably the world’s first dedicated fixed-wing drone carrier.\nToday, the cost of building a nuclear-powered aircraft carrier, such as the Gerald R. Ford-class, is upwards of $13.3 billion.\nWhat’s intriguing is that at the same shipyard, right next to the drone carrier, are two large drone motherships, along with some target barges, one of which has the outline of an aircraft carrier."}, {"id": "6fc52cf3-d6a0-41e4-a218-bc5b579869b1", "title": "LankaWeb – Sri Lanka ends LTTE Terrorism : All foreigners commemorating  Mullaivaikkal Massacre  get your facts straight first", "date": "2024-05-16 03:15", "url": "https://www.lankaweb.com/news/items/2024/05/15/sri-lanka-ends-ltte-terrorism-all-foreigners-commemorating-mullaivaikkal-massacre-get-your-facts-straight-first/", "message": "Why does the UN or West not mention India’s involvement in birthing terror in Sri Lanka & against Sri Lanka?\nTherefore, we question the sincerity of all the entities that had close rapport with LTTE while pretending to want peace for Sri Lanka.\n3rd Parties quoting Sri Lanka dead” missing” allegingwar crimes by Sri Lanka’s Armed Forces without proof or evidence.\nLTTE & the Sri Lanka Armed Forces engaged in battle and exchanged fire.\nLTTE took civilians and refused to free them and fired at the Sri Lanka Army from among civilians."}, {"id": "7b0afda5-5a63-4538-9906-296633fb0831", "title": "AFU Drones , Javelin Smash Russian Column Headed By  Tank - Booth  ", "date": "2024-05-16 14:30", "url": "https://charter97.org/en/news/2024/5/16/595251/", "message": "AFU Drones, Javelin Smash Russian Column Headed By 'Tank-Booth' 6 16.05.2024, 11:087,926The battle near Andriivka was shown on video.\nUkrainian soldiers have repelled the assault of the Russian army in the Bakhmut direction of the front, in particular near the village of Andriivka.\nThe defenders hit the enemy armoured vehicles with the crews using drones and Javelin anti-tank missile system.\nSoldiers of the 93rd SMBR met the Russian convoy with Javelin ATGMs and FPV drones.\nThanks to their precise strikes, the soldiers of \"Kholodny Yar\" repelled the attack."}, {"id": "36ccb1c2-8f27-4e93-b444-02bdf0fa622d", "title": "Slovakia prime minister is expected to survive assassination attempt , deputy says", "date": "2024-05-16 06:45", "url": "https://www.theglobeandmail.com/world/article-slovakias-prime-minister-is-expected-to-survive-assassination-attempt/", "message": "Fico halted arms deliveries to Ukraine when he returned to power, his fourth time serving as prime minister.\nSlovakia's Prime Minister Robert Fico was in a 'very serious' but stable condition on May 16, a hospital official said, after he was shot five times in an assassination attempt that has laid bare deep political divisions in the country.\nFico returned to power in Slovakia last year after having previously served three terms as prime minister.\nOn Wednesday, Russian President Vladimir Putin sent a message to President Caputova, expressing his support and wishing the prime minister a fast and full recovery.\n“I know Robert Fico as a courageous and strong-willed person."}, {"id": "a6ca56a0-2916-4366-a904-4e0dbabbbe45", "title": "Slovak PM no longer in life - threatening condition after being shot , minister says", "date": "2024-05-16 06:30", "url": "https://dunyanews.tv/en/World/812044-Slovak-PM-no-longer-in-life-threatening-condition-after-being-shot,-mini", "message": "Slovak PM no longer in life-threatening condition after being shot, minister saysWorld World Slovak PM no longer in life-threatening condition after being shot, minister saysSlovak PM no longer in life-threatening condition after being shot, minister saysFollow on Updated On: Thu, 16 May 2024 12:19:57 PKTBANSKA BYSTRICA, Slovakia (Reuters) - Slovak Prime Minister Robert Fico is no longer in a life-threatening condition after he was shot in an assassination attempt when leaving a government meeting on Wednesday, a government minister said.\nThe gunman shot Fico, 59, five times, initially leaving the prime minister in critical condition and undergoing surgery hours later on Wednesday evening.\nInterior Minister Matus Sutaj Estok had said earlier that Fico was in a life-threatening condition while he remained in the operating room.\nThe shooting in the central Slovak town of Handlova, which Slovak media said was carried out by a 71-year-old man, stunned the small central European nation and drew international condemnation.\nBroadcaster TA3 reported the leftist prime minister had been hit in the abdomen in the attack."}, {"id": "c98b5d82-e37b-490f-a075-3de1313ac81a", "title": "  Must apologize : Vulnerable House Dem faces renewed backlash over comparison involving 9 / 11 terrorist", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/must-apologize-vulnerable-house-dem-080025697.html", "message": "\"If you think back to our founding as a country, we are a country of revolution,\" Kaptur is quoted as saying as the country was preparing for an invasion of Iraq.\nThat criticism was renewed this week by Kaptur’s critics in Ohio, including her Republican challenger, Republican Ohio state Rep. Derek Merrin.\nGOP CANDIDATE PUSHING TERM LIMITS SEEKS TO UNSEAT VULNERABLE 41-YEAR DEM INCUMBENT: 'COUNTRY IS IN TROUBLE'\"It’s clear Marcy Kaptur left her values behind many years ago,\" Merrin told Fox News Digital.\n\"When you've only passed five bills in forty years like Marcy Kaptur, apparently you have time on your hands to contemplate radical deep thoughts,\" Marinella said.\nOriginal article source: 'Must apologize': Vulnerable House Dem faces renewed backlash over comparison involving 9/11 terrorist"}, {"id": "411052b0-7015-4f93-a399-f48de2cd9cb0", "title": "Russia condemns attack on Slovak prime minister Kremlin spokesman", "date": "2024-05-16 05:45", "url": "https://tass.com/politics/1788723", "message": "Russia strongly condemns the assassination attempt on Slovak Prime Minister Robert Fico and hopes that he will recover, Russian presidential press secretary said.\nHe recalled that Russian President Vladimir Putin had sent a telegram to express his support for the Slovak prime minister and wished him the soonest recovery.\nAccording to Deputy Prime Minister Tomas Taraba, Fico is in very serious condition.\nMany foreign leaders and high-ranking officials have condemned the attack and expressed their support for the Slovak prime minister.\nThe prime minister speaks out for normalizing relations with Russia."}, {"id": "9b4713f5-fd50-4de6-9879-4c0eab8db7e2", "title": "Slovakia prime minister expected to survive assassination attempt weeks before election", "date": "2024-05-16 12:00", "url": "https://wset.com/news/nation-world/slovakias-prime-minister-robert-fico-expected-to-survive-assassination-attempt-weeks-before-election-europe-pro-russian-leader-handlova-suspect-in-custody-political-motivation-bansk-bystrica-hospital", "message": "The Slovak interior minister said Thursday that a “lone wolf” has been charged in the shooting that and prompted soul-searching among leaders in the deeply divided society.\nHowever, he said Thursday that the suspect charged was a lone wolf who “did not belong to any political groups.”The minister did not specify what the motivation was.\nFico returned to power in Slovakia last year, having previously served twice as prime minister.\nHe and his Smer party have most often been described as left-populist, though he has also been compared to politicians on the right like the nationalist prime minister of neighboring Hungary, Viktor Orbán.\nOn Wednesday, Russian President Vladimir Putin sent a message to President Caputova, expressing his support and wishing the prime minister a fast and full recovery."}, {"id": "c46d14ca-12c7-4983-8f70-3f789bfa7f74", "title": "Slovakia PM Robert Fico not in life - threatening condition - Deputy PM", "date": "2024-05-16 04:30", "url": "https://www.myjoyonline.com/slovakia-pm-robert-fico-not-in-life-threatening-condition-deputy-pm/", "message": "ReutersSlovak Prime Minister Robert Fico is no longer in a life-threatening condition after being shot several times, the deputy prime minister has said.\nOn Wednesday, Mr Fico was shot five times and seriously injured in what has been called a politically motivated assassination attempt.\n\"As far as I know, the operation went well and I guess that at the end he will survive,\" Mr Taraba said.\nIn his interview with the BBC, Deputy Prime Minister Taraba blamed \"false narratives\" by opposition parties in Slovakia for the shooting.\nMr Fico returned to power in Slovakia after elections last September, as the head of a populist-nationalist coalition."}, {"id": "eb4fd73a-a14f-44fb-b009-53397579a151", "title": "Slovakia populist prime minister shot in assassination attempt , shocking Europe before elections", "date": "2024-05-16 00:45", "url": "https://isp.netscape.com/news/world/story/0001/20240516/bdaaf0bba01035a700145a67d871a482", "message": "Slovakia’s prime minister is expected to survive assassination attempt, deputy saysBANSKA BYSTRICA, Slovakia (AP) — Slovakia’s populist Prime Minister Robert Fico was shot multiple times and gravely wounded Wednesday, but his deputy prime minister said he believed Fico would survive.\nThe prime minister had been greeting supporters at an event when the attempted assassination took place, shocking the small country and reverberating across Europe weeks before an election.\nA suspect was in custody, and an initial investigation found “a clear political motivation” behind the assassination attempt, Interior Minister Matus Sutaj Estok said as he briefed reporters alongside the defense minister.\nKicking off his fourth term as prime minister, his government halted arms deliveries to Ukraine, and critics worry that he will lead Slovakia — a nation of 5.4 million that belongs to NATO — to abandon its pro-Western course and follow in the footsteps of Hungary under populist Prime Minister Viktor Orbán.\nBut politics as usual were put aside as the nation faced the shock of the attempt on Fico’s life."}, {"id": "315a85a7-d460-4dc3-a77b-99486d1b0a73", "title": "Biden Removes Hamas Ally Cuba from Blacklist of Countries That Dont Cooperate to Fight Terrorism", "date": "2024-05-16 23:15", "url": "https://www.breitbart.com/latin-america/2024/05/16/biden-removes-hamas-ally-cuba-from-blacklist-countries-that-dont-cooperate-fight-terrorism/", "message": "U.S. Secretary of State Antony Blinken on Wednesday removed Cuba’s communist regime from the State Department’s list of countries “not cooperating fully” against terrorism.\nThe communist Castro regime also maintains a relationship with the Sunni jihadist terrorist group Hamas.\nSimilar to other far-left Latin American regimes and governments, the Castro regime has accused Israel of commiting “genocide” in its self-defense operations against Hamas, but not condemned the explicitly genocidal Hamas goal of destroying the Israeli nation and its people.\n¡Basta de brutalidad, basta de abuso, basta de impunidad!#FreePalestine#ShutItDown4Palestine pic.twitter.com/UEiVhoxUah — Miguel Díaz-Canel Bermúdez (@DiazCanelB) March 1, 2024The Castro regime has held several pro-Hamas events in the past few months.\nAgradecemos esfuerzos de congresistas de EEUU que han instado al presidente Biden retirar a #Cuba de lista de Estados patrocinadores del terrorismo."}, {"id": "ed793046-ce1b-43af-891d-180d171ba2eb", "title": "Slovak PM Fico condition  extremely seriou after shooting attack , says defence minister", "date": "2024-05-16 01:30", "url": "https://www.dnaindia.com/world/report-slovak-pm-fico-s-condition-extremely-serious-after-shooting-attack-says-defence-minister-3089482", "message": "Slovak PM Fico's condition 'extremely serious' after shooting attack, says defence ministerSlovak Prime Minister Robert Fico is in \"extremely serious\" condition following a shooting attack on Wednesday, according to Slovak Defence Minister Robert KalinakSlovak Prime Minister Robert Fico is in \"extremely serious\" condition following a shooting attack on Wednesday, according to Slovak Defence Minister Robert Kalinak, as reported by Al Jazeera, citing the TASR state-run news agency.\nSlovak Interior Minister, Matus Sutaj Estok also said that Robert Fico's condition remains critical, according to doctors.\n\"The attack on Slovakia's Prime Minister Robert Fico is appalling.\n\"Appalled to learn about the shooting of Slovak Prime Minister Robert Fico.\n\"I was deeply shocked by the heinous attack against my friend, Prime Minister Robert Fico."}, {"id": "54225a1a-da2b-4bf1-b969-1347eaf11e93", "title": "Slovakia populist prime minister shot in assassination attempt , shocking Europe before elections", "date": "2024-05-16 03:00", "url": "https://www.devdiscourse.com/article/politics/2940184-slovakias-populist-prime-minister-shot-in-assassination-attempt-shocking-europe-before-elections", "message": "Slovakia's populist Prime Minister Robert Fico was shot multiple times and gravely wounded Wednesday, but his deputy prime minister said he believed Fico would survive.\nThe prime minister had been greeting supporters at an event when the attempted assassination took place, shocking the small country and reverberating across Europe weeks before an election.\nKicking off his fourth term as prime minister, his government halted arms deliveries to Ukraine, and critics worry that he will lead Slovakia — a nation of 5.4 million that belongs to NATO — to abandon its pro-Western course and follow in the footsteps of Hungary under populist Prime Minister Viktor Orbán.\nThe attack comes as political campaigning heats up three weeks ahead of Europe-wide elections to choose lawmakers for the European Parliament.\nCzech Prime Minister Petr Fiala wished the premier a swift recovery."}, {"id": "5dfae1c0-cdf2-42d3-b584-59d1af0c2258", "title": "A Palestinian converted to Judaism . An Israeli soldier saw him as a threat and opened fire", "date": "2024-05-16 22:30", "url": "https://religionnews.com/2024/05/16/a-palestinian-converted-to-judaism-an-israeli-soldier-saw-him-as-a-threat-and-opened-fire/", "message": "Ben-Avraham, a Palestinian who was born a Muslim but made the almost unheard-of decision to convert to Judaism years earlier, was fatally shot by an Israeli soldier.\nA Palestinian aroused suspicions and an Israeli soldier killed him.\nA DEADLY SHOOTINGBen-Avraham was waiting outside a West Bank settlement for an Israeli bus to take him to Parag’s apartment March 19 when he got into an argument in Hebrew with an Israeli soldier.\nAcross the West Bank, Jewish settlers live apart from Palestinians in guarded settlements where they’re subject to different laws.\nHe said it will read: “David Ben-Avraham Zeitoun Parag."}, {"id": "bab64413-b6a7-43eb-a48e-f7575038ca7e", "title": "Slovakia prime minister is expected to survive assassination attempt , deputy says | World", "date": "2024-05-16 08:15", "url": "https://www.smdailyjournal.com/news/world/slovakia-s-prime-minister-is-expected-to-survive-assassination-attempt-deputy-says/article_1ecc7a4f-a23e-5915-9238-592311199f03.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "8709e075-c72b-467e-abc4-13fb9a0c5270", "title": "Robert Fico shooting : A look back at armed attacks on world leaders in recent times", "date": "2024-05-16 06:30", "url": "https://www.firstpost.com/explainers/robert-fico-shooting-a-look-back-at-armed-attacks-on-world-leaders-in-recent-times-13771419.html", "message": "Slovakia prime minister Robert Fico is hospitalised after he was shot multiple times in the central town of Handlova.\nThe incident serves as a reminder of the rising attacks against leaders around the world in recent times read moreSlovakia’s prime minister Robert Fico was shot multiple times on Wednesday following a meeting in the central town of Handlova.\nLocal media reported that the suspected gunman was among a small crowd waiting to greet the prime minister on the street outside the cultural centre where the meeting was held, reports CNN.\nLeaders around the world, including US president Joe Biden and Ukrainian president Volodymyr Zelenskyy, have strongly condemned this horrific act of violence.\nFico , a political veteran, had previously criticised Western support for Ukraine and promised to end Slovak military assistance to Ukraine."}, {"id": "7516d3f7-443a-4713-b787-bdf22c6f0721", "title": "Slovakia prime minister expected to survive assassination attempt , deputy says", "date": "2024-05-16 07:45", "url": "https://www.thehindubusinessline.com/news/world/slovakias-prime-minister-expected-to-survive-assassination-attempt-deputy-says/article68181428.ece", "message": "Slovakia's populist Prime Minister Robert Fico was shot multiple times and gravely wounded on Wednesday, but his deputy prime minister said he believed Fico would survive.\nThe prime minister had been greeting supporters at an event when the attempted assassination took place, shocking the small country and reverberating across Europe weeks before an election.\nA suspect was in custody, and an initial investigation found “a clear political motivation” behind the assassination attempt, Interior Minister Matus Sutaj Estok said as he briefed reporters alongside the defence minister.\nKicking off his fourth term as prime minister, his government halted arms deliveries to Ukraine, and critics worry that he will lead Slovakia — a nation of 5.4 million that belongs to NATO — to abandon its pro-Western course and follow in the footsteps of Hungary under populist Prime Minister Viktor Orbán.\nCzech Prime Minister Petr Fiala wished the premier a swift recovery."}, {"id": "8ce1a9d4-daed-4270-9704-318e7e11d59b", "title": "U . S . Fast - Tracks $2 Billion Military Aid for Ukraine", "date": "2024-05-16 21:45", "url": "https://oilprice.com/Geopolitics/International/US-Fast-Tracks-2-Billion-Military-Aid-for-Ukraine.html", "message": "The United States is fast-tracking $2 billion in military aid for embattled Ukrainian forces, U.S. Secretary of State Antony Blinken said, as they struggle to stave off a Russian advance in the northeastern Kharkiv region.\nThe package was approved several weeks ago following months of delays due to political bickering in the U.S. Congress.\n\"We're rushing ammunition, armored vehicles, missiles, air defenses to get them to the front lines,\" Blinken said, adding, \"For anyone who is tempted to bet against Ukraine, don't.\n\"We have not encouraged or enabled strikes outside of Ukraine, but ultimately Ukraine has to make decisions for itself about how it's going to conduct this war,\" Blinken said.\nMoscow in recent weeks has accused Ukraine, without providing evidence, of having started using the U.S.-supplied Army Tactical Missile Systems (ATACMS)."}, {"id": "62a67b67-462f-49e4-bcf5-fa5f0da41bdb", "title": "Slovakia PM May Survive Assassination Attempt ; PM Modi Condemns Attack", "date": "2024-05-16 16:45", "url": "https://pragativadi.com/slovakias-pm-may-survive-assassination-attempt-pm-modi-condemns-attack/", "message": "New Delhi: On Thursday, India’s Prime Minister Narendra Modi denounced the assault on Slovakia’s Prime Minister Robert Fico, labeling it as an act of cowardice and villainy.\nExpressing shock over the attack, PM Modi posted on his X handle, “Deeply shocked at the news of the shooting at Slovakia’s Prime Minister, H.E.\nMr. Robert Fico.\nIndia stands in solidarity with the people of the Slovak Republic.”As per reports from local media, the Slovak Prime Minister’s condition is no longer critical following surgery.\nSlovakia’s Prime Minister, Robert Fico, was gravely wounded in an assassination attempt on Wednesday."}, {"id": "427ec51a-c350-440a-baf8-34d1f9288103", "title": "FBI , Homeland Security warn of possible threats to LGBTQ events , including Pride Month activities", "date": "2024-05-16 04:30", "url": "https://www.orlandosentinel.com/2024/05/14/fbi-homeland-security-warn-of-possible-threats-to-lgbtq-events-including-pride-month-activities/", "message": "By REBECCA SANTANA (Associated Press)WASHINGTON (AP) — Foreign terrorist organizations or their supporters might target LGBTQ-related events and venues as part of June’s Pride Month, federal agencies warned in a recent public announcement.\nThe FBI and the Department of Homeland Security issued the announcement May 10 to raise awareness of “foreign terrorist organizations (FTOS) or their supporters potential targeting of LGBTQIA+-related events and venues.”“Foreign terrorist organizations or supporters may seek to exploit increased gatherings associated with the upcoming June 2024 Pride Month,” the agencies wrote.\nAccording to the release, foreign terrorist groups and supporters have in the past promoted anti-LGBTQ rhetoric and targeted related events.\nThe release noted that June 12 marks the eighth anniversary of the attack on the Pulse Nightclub in Orlando, Florida.\nPride Month, held in June, is a particularly important time in the LGBTQ+ rights movement."}, {"id": "025bacf0-aa0f-411e-898e-1f3752715df2", "title": "Slovakian PM critically ill in hospital after being shot several times", "date": "2024-05-16 04:30", "url": "https://news.sky.com/story/slovakian-pm-critically-ill-in-hospital-after-being-shot-several-times-13136803", "message": "Slovakia's prime minister remains in a very serious condition because of how \"complicated\" his gunshot injuries are, the country's defence minister says.\nPM Robert Fico was shot several times in an attempted assassination yesterday.\nDoctors spent the night \"fighting for his life\", defence minister Robert Kalinak said.\nWho is Slovak prime minister Robert Fico?\nConcern is mounting that populist and nationalists similar to Mr Fico could make gains in the 27-member bloc."}, {"id": "576daedb-c2be-4db9-a8b6-fd099daf262f", "title": "Soldier from Michigan who died in Korean War accounted for more than 70 years later", "date": "2024-05-16 21:30", "url": "https://www.mlive.com/news/2024/05/soldier-from-michigan-who-died-in-korean-war-accounted-for-more-than-70-years-later.html", "message": "WASHINGTON -- A Michigan man who was killed in the Korean War has been accounted for according to the Defense POW/MIA Accounting Agency (DPAA).\nThomas A. Smith, 17 of Grant, Michigan, were accounted for on Sept. 22, 2023, nearly 70 years after he was presumed dead.\n52 years later a plan was proposed to disinter the remains of 652 Korean War Unknowns and in March 2019, the remains were disinterred.\nThe DPAA used DPAA used dental and anthropological analysis to determine that Unknown X-5077 did in fact contain Smith’s remains.\nWhile Smith’s name has been recorded at the Courts of the Missing at the Punchbowl along with other missing Korean War veterans, his name will now feature a rosette indicating he has been accounted for."}, {"id": "983677c9-8ae2-4f43-b8e9-004a59326b53", "title": "  Cowardly & dastardly act : PM Modi says deeply shocked over attack on Slovak PM", "date": "2024-05-16 06:30", "url": "https://www.moneycontrol.com/news/india/cowardly-dastardly-act-pm-modi-says-deeply-shocked-over-attack-on-slovak-pm-12723033.html", "message": "You are already a Moneycontrol Pro user."}, {"id": "ad61540f-e8e3-4080-bc96-d4404f5af01f", "title": "Slovakia PM Robert Fico not in life - threatening condition - International", "date": "2024-05-16 07:30", "url": "https://www.dailymirror.lk/international/Slovakia-PM-Robert-Fico-not-in-life-threatening-condition/107-282720", "message": "BBC- Slovak Prime Minister Robert Fico is no longer in a life-threatening condition after being shot several times, the deputy prime minister has said.\nTomas Taraba told the BBC Mr Fico's surgery had gone \"well\" and \"I guess that at the end he will survive\".\nEarlier Mr Fico, 59, was said to have been \"fighting for his life\" after being gravely injured in the attack in the small town of Handlova.\nMr Fico is a divisive figure at home - and controversial in the EU - for his calls to end military aid to Ukraine and sanctions on Russia.\nThe gunman fired five shots at close range and Mr Fico was hit in the stomach and in the arm."}, {"id": "4ace9c01-f94f-46ba-9128-c342f2f7b340", "title": "Scientists ID remains of Michigan soldier killed in 1950 during Korean War", "date": "2024-05-16 02:45", "url": "https://www.wxyz.com/news/scientists-id-remains-of-michigan-soldier-killed-in-1950-during-korean-war", "message": "Thomas A. Smith, 17 of Grant, Michigan, killed during the Korean War, has been accounted for.\nIn late 1950, the U.S. Army Quartermaster Corps (AGRSG) was responsible for recovering, identifying and repatriating those lost during the Korean War.\nIn February 1956, the remains were buried at the National Memorial Cemetery of the Pacific, known as the Punchbowl, in Honolulu, with other Korean War Unknowns.\nIn July 2018, the DPAA proposed a plan to disinter 652 Korean War Unknowns from the Punchbowl.\nIn March 2019, DPAA disinterred X-5077 as part of Phase One of the Korean War Disinterment Plan and sent the remains to the DPAA laboratory for analysis."}]