[{"id": "2271b7f1-d8f9-4d1b-803e-f396a60616a5", "title": "HATERS : Masked Anti - Israel Protesters Crash Agudah Antisemitism Event At DNC", "date": "2024-08-21 05:15", "url": "https://www.theyeshivaworld.com/news/general/2307369/haters-masked-anti-israel-protesters-crash-agudah-antisemitism-event-at-dnc.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Agudah Chairman Shloime Werdiger opened the jammed packed event with a straightforward explanation:“The Jewish people are living though very trying times.\nAs the banners around the room sadly show, the rise of antisemitism is extremely alarming.\nThe identifiable Orthodox Jewish communities we represent have been subjected to an unprecedented level of antisemitic incidents over the past few years.\n“You may have noticed that outside of this convention, not too far away from here, there are thousands of anti-Israel protesters.\nPerhaps they thought they could intimidate us so that we would not be here so that our voices would be silenced."}, {"id": "062f92c8-c5c4-4c41-b77f-e8ecdfbb4a01", "title": "Anti - Israel Protesters Disrupt Orthodox Jewish DNC Event , Chant  Zionism Has Got to Fall  ", "date": "2024-08-21 21:00", "url": "https://www.algemeiner.com/2024/08/21/anti-israel-protesters-disrupt-orthodox-jewish-dnc-event-chant-zionism-has-got-to-fall/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Anti-Israel demonstrators protested a program for the Orthodox Jewish community during the Democratic National Convention (DNC) in Chicago on Tuesday, sparking widespread outrage and concern over the safety of Jewish attendees at the event.\nThough it is not known how the protesters located the event, it is presumed that they identified visibly Jewish DNC attendees and followed them.\n“Jewish events at the DNC are held in undisclosed locations to protect participants from these brownshirts.\n“This wasn’t a Zionist event, it was a Jewish event.\nOnly an antisemite would still deny that so-called anti-Israel protests are antisemitic,” the Coalition for Jewish Values posted on X/Twitter."}, {"id": "ca4c7384-a23e-4cec-a33f-08e96ed63288", "title": "Columbia University names Katrina Armstrong as interim president", "date": "2024-08-21 15:15", "url": "https://ejpress.org/columbia-university-names-katrina-armstrong-as-interim-president/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "By JNSFollowing the resignation of Minouche Shafik, president of Columbia University, the elite college announced internist Katrina Armstrong to serve as interim president.\n“Katrina is well-known to the Columbia community,” wrote David Greenwald and Claire Shipman, co-chairs of the Trustees of Columbia University.\nIn her first presidential statement to the university, Armstrong acknowledged the recent challenges the school had seen and her faith they could be overcome.\n“I am acutely aware of the trials the university has faced over the past year.\n“Jewish students and faculty have been mocked, harassed and assaulted simply for their identity."}, {"id": "313b4602-41b1-4cd1-b435-a9334321ed13", "title": "CA Educators Are Resisting Anti - Palestine Bills Pushing  Academic Police State  ", "date": "2024-08-21 00:45", "url": "https://truthout.org/articles/ca-educators-are-resisting-anti-palestine-bills-pushing-academic-police-state/", "domain": "truthout.org", "domain_classification": "Unknown", "message": "Activists say the bills will make public education more hostile for people already targeted by anti-Palestinian racism.\nAs lawmakers convene in Sacramento this month to conclude the current legislative session, a coalition of educators and advocates is organizing to stop four proposed bills: Senate Bills 1277 and 1287, and Assembly Bills 2918 and 2925.\nHate crime data also excludes some forms of discrimination, including employment and education discrimination and state-sanctioned violence.\nThe people most threatened by this raft of legislation are educators and students of color, Muslims, Palestinians, and their allies.\nOn August 15, AB 2918’s drafters shelved the legislation following an advocacy day, where California Palestine Solidarity Coalition members met with lawmakers."}, {"id": "8d35234c-ccc7-4e61-a0f6-928b6a1a9b5a", "title": "Kamala Harri choice of Jewish liaison director draws criticism over Israel , Iran stance :  Red flag  ", "date": "2024-08-21 10:30", "url": "https://www.yahoo.com/news/kamala-harris-choice-jewish-liaison-080044428.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A senior Republican Congressional staffer who has engaged with him told Fox News Digital, \"Goldenberg's job in the Biden-Harris administration has been to undermine Israel.\nNETANYAHU REPORTEDLY UPSET WITH HARRIS OVER VP'S ISRAEL REMARKS AS WHITE HOUSE PUSHES BACKIlan Goldenberg testifying at a hearing of the House Foreign Affairs subcommittee.\nIsrael was attacked on Oct. 7, and Hamas is a terrorist organization, and we’re going to be behind Israel supporting its response.\nFox News Digital asked Halie Soifer, the CEO of the Jewish Democratic Council of America, about the criticism leveled against Goldenberg.\nOriginal article source: Kamala Harris' choice of Jewish liaison director draws criticism over Israel, Iran stance: 'Red flag'"}, {"id": "ff33c704-8fe9-4926-8791-8e9b28dd3828", "title": "Swinney faces  conference from hell  as Israel diplomat row continues", "date": "2024-08-21 17:15", "url": "https://www.heraldscotland.com/news/24533963.swinney-faces-conference-hell-israel-diplomat-row-continues/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "Next week's SNP annual conference is looking set to be rather tumultuous.\nPut more bluntly, as one source told my colleague Andrew Learmonth, First Minister John Swinney is facing \"the conference from hell\".\nTo clarify the source referred to the conference from hell should Mr Swinney not sack Mr Robertson.\nA week on Mr Robertson seems in no mood to step down or the First Minister to remove him.\nNow instead the SNP has annoyed members of the Jewish community, supporters of Palestinians, its own members – and all right before its party conference."}, {"id": "6b9065a3-503d-4310-88cd-2cf12ae80c6e", "title": "Kamala Harri choice of Jewish liaison director draws criticism over Israel , Iran stance :  Red flag  ", "date": "2024-08-21 15:15", "url": "https://wfin.com/fox-world-news/kamala-harris-choice-of-jewish-liaison-director-draws-criticism-over-israel-iran-stance-red-flag/", "domain": "wfin.com", "domain_classification": "Unknown", "message": "Harris appointed Jerusalem-born Ilan Goldenberg — he renounced his Israeli citizenship to work for former President Obama’s first administration — last week, sparking intense criticism from sectors of the American Jewish community and among Israeli Americans.\nA senior Republican Congressional staffer who has engaged with him told Fox News Digital, “Goldenberg’s job in the Biden-Harris administration has been to undermine Israel.\nOn Monday, Goldenberg delivered his first speech as Harris’ director of outreach to the Jewish community at a side event at the Democratic National Convention in Chicago.\nAccording to Jewish Insider, speaking about Harris, he told the audience, “From the very beginning, she was completely adamant that Israel has a right to defend itself.\nIsrael was attacked on Oct. 7, and Hamas is a terrorist organization, and we’re going to be behind Israel supporting its response."}, {"id": "203dba53-6f83-41b6-bd1e-e4b8e6bb8e4a", "title": "Pro - Israel Group , Denied Permit to March , Gathers at  Hostage Square  in Chicago", "date": "2024-08-21 21:30", "url": "https://www.breitbart.com/politics/2024/08/20/pro-israel-group-denied-permit-to-march-gathers-at-hostage-square-in-chicago/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "CHICAGO, Illinois — A pro-Israel group that was denied a permit to march during the Democratic National Convention gathered in a makeshift “Hostage Square” in the West Loop on Tuesday to make their voices heard.\nThe Democratic convention has reportedly downplayed the role of Jewish or pro-Israel speakers, given the tensions within the party over the war in Gaza.\nAmid the political struggles, “Hostage Square” became a refuge for pro-Israel activists, many of whom have felt beseiged by the presence of dozens of pro-Palestinian groups at the convention.\n“Hostage Square” is the only pro-Israel event near the convention — and fears of antisemitic attacks are high enough that the location was not publicized.\nUnlike the one in Israel, this “Hostage Square” will only last a day."}, {"id": "bae33a48-1333-4f43-9dcd-f89cf019ea56", "title": "Rally outside Israeli Consulate sees confrontation with police and demonstrators detained", "date": "2024-08-21 02:30", "url": "https://www.yahoo.com/news/rally-outside-israeli-consulate-sees-013400809.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CHICAGO — An unsanctioned demonstration began outside the Israeli Consulate on Tuesday evening and quickly escalated into a standoff between police and protesters.\nHundreds chanted “Long live the intifada” as they headed toward the consulate, which is located in the Accenture Building on Madison Street.\nChicago police officers lined the street in front of the consulate, with several others visible inside.\nLarry Snelling and other members of the CPD command staff stood outside the building monitoring demonstrators stopped marching to hold a rally.\nThe group behind the consulate demonstration, Behind Enemy Lines, derided Monday’s event in a series of social media posts, blaming its lower-than-expected turnout on organizers’ cooperation with police and city officials."}, {"id": "a4a4d652-851d-44f2-a153-3a81d06f93b9", "title": "The Man Who Saved France From Marine Le Pen", "date": "2024-08-21 12:00", "url": "https://www.yahoo.com/news/man-saved-france-marine-le-100000039.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Many figures on the French left played important roles in the victory, such as new star Marine Tondelier, who heads the Green Party.\nBut it’s safe to say that, without Raphael Glucksmann, Le Pen could have soared to victory.\nIt’s Le Penism, and it’s the far-right triumph.”At the same time, Glucksmann is stark about his sentiments regarding both Macron and Mélenchon.\n(The Socialist Party in France, on the other hand, has a history of engaging in bilateral peace efforts between Israelis and Palestinians.)\nHe broke away from the Socialist Party, taking with him more than enough parliamentarians to help topple a party that was already teetering due to a confusion of vision."}, {"id": "15046df7-e850-4131-981a-a2e8fc594e12", "title": "Latest Articles", "date": "2024-08-21 21:45", "url": "https://freerepublic.com/tag/*/index?more=4259931", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "The challenge for Iran in retaliation was trying to go beyond its April attack on Israel.\nIran now wants to message about how it reserves the right to at some later date.\nAlmost three weeks after the killing of Hamas leader Ismail Haniyeh in Iran, the Iranian regime is trying to step down from its early claims it would carry out an attack on Israel in retaliation.\nThe regime in Tehran has built up a lot of expectations regarding how it would attack Israel.\nThe challenge for Iran in retaliation was trying to..."}, {"id": "416b8b1d-1898-42fe-9b19-da2ed1f37405", "title": "DNC 2024 live updates : Barack and Michelle Obama to deliver keynote speeches endorsing Kamala Harris", "date": "2024-08-21 02:30", "url": "https://www.yahoo.com/news/live/dnc-2024-live-updates-barack-and-michelle-obama-to-deliver-keynote-speeches-endorsing-kamala-harris-005529453.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It has been a constant stream of gripes and grievances that's actually been getting worse now that he's afraid of losing to Kamala,\" Obama said.\npic.twitter.com/3VYOlEY1GV — Yashar Ali 🐘 (@yashar) August 21, 2024 On July 21, Lee publicly endorsed Kamala Harris on his Instagram account.\nLaBelle, who has previously voiced her support for President Biden and Vice President Kamala Harris, gave a shout-out to Harris at the end of her performance.\nThe \"Veep\" actress said that while her fictional character Selina Meyer was a female vice president, that's the only similarity the character and Vice President Kamala Harris share.\n\"Just because you vote for Kamala Harris in 2024 doesn't mean you're a Democrat."}]