[{"id": "bd7545ab-2bce-4d77-a2df-ca2545d71b5e", "title": "Zelensky assassination plot : Ukraine arrests two officials for treason over alleged Russian plot", "date": "2024-05-07 13:45", "url": "https://edition.cnn.com/2024/05/07/europe/zelensky-assassination-plot-ukraine-russia-intl/", "message": "CNN —Ukraine has detained two security officials allegedly involved in a Russian plot to assassinate President Volodymyr Zelensky, which Kyiv’s state security service (SBU) said it foiled.\nThe prosecutor’s office said one of the suspects received two drones and ammunition from Russia’s state security service (FSB), which they intended to transfer to another accomplice to carry out an explosion.\nZelensky has reportedly faced several attempts on his life since Russia began its full-scale invasion of Ukraine in February 2022.\nA woman from the southern Ukrainian region of Mykolaiv was arrested in August 2023 in connection to a plot to assassinate Zelensky.\nThe SBU said it caught the woman “red-handed” as she tried “to pass intelligence to the invaders.”In April, a Polish man was accused of assisting another alleged Russian assassination plot against Zelensky."}, {"id": "a1cf9f6c-0eee-4082-a30f-caf7c0c91d7d", "title": "IDF names two fatalities in Monday drone strike on Metula", "date": "2024-05-07 07:30", "url": "https://www.ynetnews.com/article/skx787vmc", "message": "The IDF said on Tuesday that 31-year old Master sergeant (res.)\nNahman Natan Hertz from the West Bank settlement of Elazar and 31-year old Master sergeant (res.)\nDan Kamkagi from the settlement of Kfar Oranim were killed in the Monday Hezbollahdrone strike on Metula"}, {"id": "e13b1685-3c35-41b4-b47e-0cd5d5bbf6a1", "title": "Ukraine Foils Plot To Assassinate Zelensky , Arrests 2 Security Officials", "date": "2024-05-07 15:15", "url": "https://leadership.ng/ukraine-foils-plot-to-assassinate-zelensky-arrests-2-security-officials/", "message": "The Ukrainian State Security Service (SBU) said two government protection unit colonels have been arrested for allegedly planning to assassinate President Volodymyr Zelensky.\nThe SBU said on Tuesday that the officials were apprehended after it exposed a network of agents belonging to Russia’s State Security Service (FSB).\nThe SBU said it had “foiled” the “actively developing plans” to assassinate Zelensky.\nThe Ukrainian security agency said the assassination plot also targeted other senior officials, including the head of the SBU, Vasyl Maliuk, and the head of the Defence Intelligence of Ukraine, Kyrylo Budanov.\nIn August 2023, a woman from the southern Ukrainian region of Mykolaiv was equally arrested over a a plot to assassinate Zelensky."}, {"id": "bf605ebf-c2dd-4f54-b4e5-573ad785fd4d", "title": "Teen shot dead by police blows up toilet with homemade bomb", "date": "2024-05-07 03:30", "url": "https://www.perthnow.com.au/news/teen-shot-dead-by-police-blows-up-toilet-with-homemade-bomb-c-14574103", "message": "Footage has resurfaced of the Perth teenager shot dead by police using a homemade explosive to blow up a school toilet two years earlier.\nIn the video, students are left screaming and laughing following the explosion inside Rossmoyne Senior High School in Perth.\nREAD NOWCamera Icon The 16-year-old was shot by police after a carpark stabbing.\nSupplied Credit: NCA NewsWireCamera Icon The Rossmoyne Senior High School student had been enrolled in a deradicalisation program.\nCamera Icon The 16-year-old boy blew up a school toilet with a homemade explosive device."}, {"id": "6e7bcaf2-fca7-47ed-9963-656016b79ea6", "title": "Israel : Two reservists killed by Hezbollah fire on Lebanese border", "date": "2024-05-07 10:45", "url": "https://www.prokerala.com/news/articles/a1529040.html", "message": "DO NOT RELEASE----Israel: Two reservists killed by Hezbollah fire on Lebanese border.\nImage Source: IANS NewsTel Aviv/Beirut, May 7 : Two Israeli reservists have been killed in a drone attack by the Lebanese Shiite militia Hezbollah, the Israeli army said on Tuesday.\nThe two 31-year-old soldiers were killed on Monday in an incident on Israel's northern border, the army said.\nAccording to Lebanese reports, four civilians - a couple and their two sons - were killed in an Israeli airstrike in Lebanon on Sunday.\nSince the beginning of the Gaza war seven months ago, there have been repeated military confrontations between Israel's army and the Hezbollah militia in Lebanon on the border, with multiple casualties on both sides."}, {"id": "90b3c1b5-b318-4570-9e73-361b206ee86b", "title": "Iran IRGC Terrorists Sail Warship into Southern Hemisphere", "date": "2024-05-07 03:30", "url": "https://www.breitbart.com/middle-east/2024/05/06/irans-irgc-terrorists-sail-warship-into-southern-hemisphere/", "message": "Iran announced that Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\nThe Shahid Mahdavi is on a “long-distance mission” in international waters, the Iranian state-owned PressTV propaganda outlet reported.\nIranian state media claimed that the warship was “conducting its biggest mission in terms of distance and operation,” without specifying further.\nIran's IRGC Navy floating base Shahid Mahdavi used as mobile platform at sea to launch ballistic missiles.\nDezful medium-range ballistic missile launched from 40-foot containers on the deck of the Shahid Mahdavi."}, {"id": "826b2456-414c-4af3-bacf-d6ad1faa90e8", "title": "Russian plot to assassinate Zelensky foiled , Ukraine intelligence agents say", "date": "2024-05-07 13:00", "url": "https://www.yahoo.com/news/russian-plot-assassinate-zelensky-foiled-105733310.html", "message": "Ukrainian intelligence agents say they have foiled a Russian plot to assassinate Volodymyr Zelensky.\nUkraine’s SBU State Security Service said it had caught Russian agents within the Ukrainian state guard plotting the kidnap and assassination of the president and other senior governmental officials.\nWithout providing evidence, they wrote: “The enemy was actively developing plans to eliminate President Volodymyr Zelensky.\nMr Zelensky said in 2022 there had been at least 10 attempts to assassinate him.\nAlso, prosecutors in Poland said last month a Polish man had been arrested on allegations of being ready to spy on behalf of Russia’s military intelligence in an alleged plot to assassinate Mr Zelensky."}, {"id": "6bde2994-65e1-4556-ad98-bed905b9a684", "title": "Do you know these men ? NSW Police reveal new faces of Wakeley riot after Mar Mari Emmanuel was stavved", "date": "2024-05-07 04:00", "url": "https://www.dailymail.co.uk/news/article-13389131/Search-people-church-riots-Sydney.html", "message": "The first person depicted (Person P) is described as being a man of Mediterranean/Middle Eastern appearance, slim build, with short dark hair.\nHe is shown wearing light coloured clothing, dark coloured shoes and carrying a black bag across his body.\nHe is shown wearing a grey hooded jumper, black cap, black shorts and white shoes.\nHe is shown wearing a black singlet, shorts, cap and shoes.\nShe is shown wearing a singlet top and shorts, with a shirt tied around her waist and a dark coloured cap."}, {"id": "940c2731-ecda-4cea-a4ea-afbf009595ac", "title": "Early Edition : May 7 , 2024", "date": "2024-05-07 13:00", "url": "https://www.justsecurity.org/95475/early-edition-may-7-2024/", "message": "by Beatrice YahiaSignup to receive the Early Edition in your inbox here.\nHere’s today’s news:ISRAEL-HAMAS WARThe Israeli military said this morning it has “operational control” of the Palestinian side of the Rafah crossing.\nThe “vast majority” of people ordered to evacuate parts of Rafah have left the area, the Israeli military said today.\nHopes for a pause in the fighting have been renewed after Hamas said yesterday it has agreed to a Qatari-Egyptian ceasefire proposal.\nPolice arrested some 125 activists as they broke up a pro-Palestinian demonstration camp at the University of Amsterdam early today."}, {"id": "a564fbdf-93cf-46f5-aece-a08bd515d650", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 06:30", "url": "https://www.yahoo.com/news/hrw-israel-attack-lebanon-rescuers-055011584.html", "message": "The March 27 strike levelled the emergency services centre in the Lebanese village of Habariyeh (Rabih DAHER)Human Rights Watch said Tuesday an Israeli strike in Lebanon that killed seven first responders was \"an unlawful attack on civilians\", and urged Washington to suspend weapons sales to Israel.\n\"An Israeli strike on an emergency and relief centre\" in the southern village of Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and constituted an \"unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\nThe Israeli military did not immediately comment when contacted by AFP.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" HRW's Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\"."}, {"id": "7a79b251-892c-4ee7-bec3-bdf8f006d787", "title": "After the Attacks Between Israel and Iran : What Can We Expect Next ? ", "date": "2024-05-07 12:00", "url": "https://www.thenation.com/article/world/offensive-error/", "message": "Comment / After the Attacks Between Israel and Iran—What Comes Next?\nYet on closer inspection, Israel’s tense escalatory exchanges with Iran were hardly a win for Israel.\nTehran calculated that, in the ongoing shadow war between Israel and Iran, time was on Iran’s side.\nIsrael appears to have easily evaded Iran’s air defenses, inflicting damage on some military installations, though the extent of the damage remains unknown.\nSimilarly, the notion that this episode revealed a new military alliance between Israel and Arab states does not survive scrutiny."}, {"id": "3f5f1c62-3c58-4918-894c-d460eac05701", "title": "US cannot blame Israel for civilian deaths and ignore its own history", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800170", "message": "Quite frankly, the hypocrisy and holier-than-thou attitude of the United States toward Israel is truly infuriating.\nThe United States had tracked a 53-year-old shepherd in northern Syria with a highly sophisticated Predator Drone.\nTurns out, the United States tracked a simple shepherd named Lufti Hassan Masto thinking he was an al-Qaeda leader.\nIt makes clear that the United States, too, makes mistakes.\nOne report I read brought the total of innocent civilians killed by the United States via drone and missile strikes to 140,000."}, {"id": "cd0ec7ba-183c-44ed-823a-fa9a63dbcfa7", "title": "Putin inauguration - united kingdom and US boycott ceremony as Kremlin leader sworn in again - World News", "date": "2024-05-07 07:45", "url": "https://www.mirror.co.uk/news/world-news/putins-inauguration-uk-boycotts-opulent-32750266", "message": "Image: POOL/AFP via Getty Images) POOL/AFP via Getty Images)\"The UK will not field a representative at the inauguration of President Vladimir Putin,” said a spokesman for the Foreign Office.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)On Monday, ambassador Nigel Casey was summoned to the Foreign Ministry in Moscow, according to Russian reports.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)This was a “serious escalation and confirmation of London's increasing involvement in military operations on the side of Kyiv”.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)It comes as Russia has lost another £40 million Su-34 bomber on a combat mission.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)One key area to watch is the Defence Ministry."}, {"id": "b108a26a-0954-4dd2-8357-cdd0383713f3", "title": "It time to for Rafah action - The Jerusalem Post", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800164", "message": "Entering Rafah will enable Israel to directly confront the terrorist infrastructure that poses an existential threat to its citizens.\nBy establishing a presence in Rafah, Israel would be able to further degrade Hamas’s ability to launch attacks and disrupt its ability to operate with impunity.\nBy showing resolve, Israel can better deter future attacks and create a more secure environment for its people.\nBy intervening in Rafah, Israel can help alleviate human suffering, facilitate the delivery of aid, and provide hope for a better future for all residents of Gaza.\nBy confronting the terrorist threat head-on, Israel can protect its citizens, deter future attacks, and pave the way for a brighter future for everyone in the region."}, {"id": "f5eb8676-6388-4fd1-89cd-3d1c71d9b9fd", "title": "A street in Kharkiv to be named after a fallen IDF soldier", "date": "2024-05-07 00:00", "url": "https://www.jpost.com/diaspora/article-800183", "message": "A street in the city of Kharkiv will be named after Corporal Alexei-Asher Nikov, who was killed in a terrorist attack during an operation in Gush Katif in 1998.\nFollowing his heroic act, the city council of his birthplace, Kharkiv, Ukraine, decided to name a street after him.\nUploaded on 7/5/2024 (credit: Courtesy)Nikov studied at the Jewish school \"Ohr Avner\" in Kharkiv, founded by the city's Chief Rabbi and Chabad emissary, Rabbi Moshe Moskovitz.\nThe school is now located on the street named after Nikov.\nThe initiative was supported by Israeli journalist and historian Shimon Briman, together with the head of the city council, Irina Goncharova, and Rabbi Moshe Moskovitz."}, {"id": "f4df7778-6600-42c5-b011-9a7f236959db", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 03:30", "url": "https://www.standard.net.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "dae19975-0c8b-4079-afc6-1d22303406d8", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:30", "url": "https://www.examiner.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=2596", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "3581995c-13ac-45cd-842a-fb7440c3fd3b", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 11:00", "url": "https://www.irishnews.com/news/world/israeli-forces-take-control-of-gaza-side-of-rafah-crossing-with-egypt-ARECKTAEWRMDXKR2ZRG5P7LXCQ/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP) (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah) (Ismael Abu Dayyah/AP)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "256616ee-ddd2-4c6d-b504-4078bc4b5fb8", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 04:30", "url": "https://www.illawarramercury.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "63147625-19d6-42d4-805c-6cee9509417f", "title": "U . N . Condemns Israel After Mass Graves Found in Gaza", "date": "2024-05-07 05:45", "url": "https://www.mediaite.com/news/u-n-condemns-israel-after-mass-graves-found-in-gaza-bodies-reportedly-showing-signs-of-torture-and-summary-executions/", "message": "The United Nations condemned Israel’s ongoing war in Gaza after the discovery of mass graves discovered at two hospitals.\nIsrael has been waging war in Gaza since the Oct. 7 terrorist attacks in which Hamas militants killed 1,200 Israelis and abducted more than 200 others.\nHamas, which controls Gaza, said on Monday it accepted the terms of a ceasefire agreement proposed by Egypt and Qatar.\nMore than 30,000 Palestinians have been killed in Gaza, where nearly 90% of the population has been displaced.\n“We are horrified at details emerging from mass graves recently unearthed in the Gaza Strip,” the U.N. press release stated."}, {"id": "f134cae0-e41a-428c-a979-1bd6b7a20dc1", "title": "IRGC warship sails into Southern Hemisphere", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240505-isna01.htm", "message": "IRGC's warship sails into Southern HemisphereISNA - Iranian Students' News AgencySun / 5 May 2024 / 11:46A domestically-developed oceangoing warship operated by Iran's Islamic Revolution Guards Corps (IRGC) Navy has crossed the line of zero degrees latitude, the Equator, and sailed into the Southern Hemisphere.\nThe 2,100-tonne vessel, which is 240 meters in length and 27 meters in width, joined the IRGC's naval fleet in March 2023.\nThe oceangoing warship is equipped with a three-dimensional phased array radar, sea-to-sea and sea-to-air missiles, and sophisticated telecommunication systems for electronic warfare.\nIn February 2024, the IRGC Navy launched two ballistic missiles from inside two containers on board the warship.\nLeader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has repeatedly called for efforts to maintain and boost Iran's defense capabilities."}, {"id": "eed1e71a-80eb-4362-a483-050b2b5b0ebc", "title": "Obama 2010 Defense Budget : Top Five Worst Choices for National Security", "date": "2024-05-07 12:45", "url": "https://www.heritage.org/defense/report/obamas-2010-defense-budget-top-five-worst-choices-national-security", "message": "President Obama has submitted a defense budget request to Congress for fiscal year 2010 that, if implemented, will dramatically reshape America's military.\nScaling Back Missile DefensePresident Obama's 2010 defense budget proposes cutting $1.4 billion from the Missile Defense Agency's budget.\nIt is one thing to carefully oversee the operational capability and technical feasibility of specific ballistic missile defense (BMD) programs; it is an entirely different endeavor to substantially cut the overall missile defense budget when the risk of a ballistic missile launch is palpably growing.\nThe ideological opposition by many to missile defense dates back to the Cold War, when the left believed missile defense would destabilize America's relationship with the Soviet Union.\nBut the Cold War has been over for nearly 20 years, and missile defense today is a clear tool for peace."}, {"id": "1980cdef-4592-4016-85a4-915e72ef19c8", "title": "Hamas accepts Gaza truce proposal , Israel urges Rafah evacuation", "date": "2024-05-07 02:15", "url": "https://www.philstar.com/world/2024/05/07/2353268/hamas-accepts-gaza-truce-proposal-israel-urges-rafah-evacuation", "message": "RAFAH, Palestinian territories — Hamas on Monday said it accepts a proposal for a truce in the seven-month-old war in Gaza, as Israel renewed an order for Palestinians in Rafah to evacuate ahead of a long-threatened invasion of the city.\nHamas member Khalil al-Hayya told the Qatar-based Al Jazeera channel the proposal agreed to by Hamas includes a three-phased truce.\nLater, Dujarric said that Guterres called on both Israel and Hamas to \"go the extra mile needed\" to seal a truce.\n'Return all hostages'Soon after the war started, Israel told Palestinians in northern Gaza to move south to \"safe zones\" –- including Rafah.\nEmergency workers said air strikes killed 16 people in Rafah on Sunday, hours after Hamas rockets killed the Israeli soldiers."}, {"id": "f8966a52-c967-4392-917b-b4b785c3c47b", "title": "Australian boy killed by police was in deradicalization program since causing school explosion", "date": "2024-05-07 13:15", "url": "https://www.mymotherlode.com/news/asia/3353494/australian-boy-killed-by-police-was-in-deradicalization-program-since-causing-school-explosion.html", "message": "Australian boy killed by police was in deradicalization program since causing school explosionAustralian boy killed by police was in deradicalization program since causing school explosion View PhotoMELBOURNE, Australia (AP) — A 16-year-old boy who was shot dead by police after stabbing a man in the Australian west coast city of Perth had been engaged in a deradicalization program since he detonated a homemade explosive device in a school toilet block two years ago, police said on Tuesday.\nWestern Australia Police Commissioner Col Blanch said the boy killed in Perth had been a voluntary participant of the federally funded Countering Violent Extremism program since 2022 when he caused an explosion at a toilet at the Rossmoyne Senior High School, which he attended.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney."}, {"id": "b18ed475-8d96-4a76-9ec4-adeba146497f", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:45", "url": "https://www.theadvocate.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=2605", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "4434ad30-a2b7-4dc7-9be9-60be5504455a", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:45", "url": "https://www.theadvocate.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "7b4115af-72d6-40e7-a652-cf7adcabb6d7", "title": "Hamas accepts Gaza truce proposal , Israel urges Rafah evacuation", "date": "2024-05-07 03:15", "url": "https://dunyanews.tv/en/World/809957-Hamas-accepts-Gaza-truce-proposal,-Israel-urges-Rafah-evacuation", "message": "Hamas accepts Gaza truce proposal, Israel urges Rafah evacuationWorld World Hamas accepts Gaza truce proposal, Israel urges Rafah evacuationIsrael renewed an order for Palestinians in Rafah to evacuate ahead of a long-threatened invasion.\nHamas member Khalil al-Hayya told the Qatar-based Al Jazeera that the proposal agreed to by Hamas includes a three-phased truce.\nLater, Dujarric said that Guterres called on both Israel and Hamas to \"go the extra mile needed\" to seal a truce.\nAsked how many people should move, an Israeli military spokesman said: \"The estimate is around 100,000 people.\"\n\"RETURN ALL HOSTAGES\"Soon after the war started, Israel told Palestinians in northern Gaza to move south to safe zones, including Rafah."}, {"id": "570043c2-d55b-4434-a57b-5f3eecfa8f8c", "title": "Commander Allied Air Command General James B . Hecker visited the Czech Republic", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-czechmdfa01.htm", "message": "Commander Allied Air Command General James B. Hecker visited the Czech RepublicMinistry of Defence & Armed Forces of the Czech Republic6.5.2024Author: by Filip TesařCommander of the Allied Air Command (AIRCOM) General James B. Hecker visited the Czech Republic on April 29-30th.\nThe Czech Air Force Commander Major General Petr Čepelka accompanied him during his visit of the 21st Tactical Air Force Base Čáslav on Monday.\nGeneral Hecker opined the aircraft with the support of other components should overcome the Russian air defence.\nAccording to General Hecker, the Čáslav Air Force Base, which is being prepared for the F-35 aircraft, is very promising.\nLastly, General Hecker and General Řehka emphasised the importance to continue the support of Ukraine."}, {"id": "991218f5-0c81-4ad5-86c6-e7941c1c538b", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.cessnockadvertiser.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/?cs=9676", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "9753e691-ada5-49d3-83a5-ba0a727e588e", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.katherinetimes.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "42bb81a0-ca9b-49f6-b468-abac424f5382", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.dailyliberal.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "56712aa6-a634-4767-a7c0-2e12ac6f3388", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:00", "url": "https://www.newcastleherald.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "8fb9b471-4bc7-4a7a-87f4-3aaab1469bb7", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:00", "url": "https://www.theleader.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/?cs=30776", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "77a1c6a2-256f-43d4-a9e4-e45da42fd735", "title": "Mother of Manchester Arena bombing victim to walk to Downing Street to demand new law", "date": "2024-05-07 02:30", "url": "https://news.sky.com/story/mother-of-manchester-arena-bombing-victim-to-walk-to-downing-street-to-demand-new-law-13130839", "message": "The mother of one of the Manchester Arena bombing victims has set off on a 200-mile walk from the spot her son was killed to Downing Street to demand stronger protections against terrorism.\nShe will arrive at Downing Street on 22 May, the seventh anniversary of her son's death.\nThis morning Greater Manchester mayor Andy Burnham joined family and friends, at the AO Arena in central Manchester, to see Ms Murray off at 11am.\nDuring the 186-mile walk to Downing Street, she will be visiting memorials to victims of terror attacks to pay her respects.\nRead more:Injured survivors from Manchester Arena bombing suing MI5Could MI5 have prevented Manchester bombing?"}, {"id": "cdddf3a6-35aa-4d28-b076-a5f22eeb3240", "title": "Hezbollah targets Israeli military command base in occupied Golan Heights", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-presstv06.htm", "message": "Hezbollah targets Israeli military command base in occupied Golan HeightsIran Press TVMonday, 06 May 2024 10:33 AMThe Lebanese Hezbollah resistance movement has targeted an Israeli military command base in the occupied Syrian Golan Heights with dozens of Katyusha rockets.\nHeavy rocket barrages were launched from southern Lebanon at Israeli military installations at the Galilee panhandle in the northern part of the 1948 Israeli-occupied territories as well as the occupied Golan Heights.\nIsraeli media outlets reported that sirens blared over incoming rocket fire in a number of communities in the Golan Heights and close to the border with Lebanon.\nThere were reports that nearly 70 missiles were launched from Lebanon at the southern Golan Heights.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions."}, {"id": "3cf28f21-6d1a-4b34-823a-68a0bd9d0c61", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 08:00", "url": "https://www.edp24.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "6ff5232b-5731-46b1-8309-a177320db8a4", "title": "WoW : Klassenänderungen - Nerfs für Dämonenjäger , Buff für Eulen - Set & mehr", "date": "2024-05-07 11:00", "url": "https://www.buffed.de/World-of-Warcraft-Spiel-42971/News/WoW-Klassenaenderungen-Nerfs-fuer-Daemonenjaeger-Buff-fuer-Eulen-Set-und-mehr-1446935/", "message": "WoW: Klassenänderungen - Nerfs für Dämonenjäger, PvP-Tuning & mehr Autor: Sebastian Glanzer Quelle: Blizzard 07.05.2024 um 09:10 Uhr - Mit dem ID-Reset am 8.\nDruideGleichgewichtSeason 4 (2) Set Bonus now increases the damage of your next Wrath or Starfire by 50% (was 30%).\nHealing Sphere healing increased by 10%.\nSeason 4 Set Bonus (4): Bloodthirst bonus damage increased to 35% per stack (was 30%).\nShadow Word: Pain and Purge the Wicked damage increased by 15% in PvP combat."}, {"id": "2761c1b7-2c62-466f-bf89-7bc19e7bb54e", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 07:30", "url": "https://www.theargus.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "4d64cf94-cf35-48d1-94c7-9e7f44b77b5c", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 12:45", "url": "https://www.justiceinfo.net/en/131654-hrw-israel-attack-on-lebanon-rescuers-was-unlawful.html", "message": "Human Rights Watch said Tuesday an Israeli strike in south Lebanon that killed seven emergency workers was \"an unlawful attack on civilians\", urging Washington to suspend weapons sales to Israel.\nThe Israel-Lebanon border area has witnessed near-daily cross-border fire after Palestinian militant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\n\"An Israeli strike on an emergency and relief centre\" in south Lebanon's Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and \"was an unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" said Ramzi Kaiss, Lebanon researcher at HRW.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\"."}, {"id": "6a544a3a-5e18-454d-af13-ff942ad2b9e7", "title": "Iraq Islamic resistance hits two Israeli military bases with drones", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-presstv09.htm", "message": "Iraq's Islamic resistance hits two Israeli military bases with dronesIran Press TVMonday, 06 May 2024 2:27 AMThe Islamic Resistance in Iraq says it has targeted two Israeli military bases in the occupied Palestinian territories using drones.\nThe Islamic Resistance in Iraq, which is an umbrella group of the country's anti-terror movements, made the announcement in separate statements early Monday.\n\"The Islamic Resistance in Iraq, on the morning of Monday, 06-05-2024, targeted a military facility of the Zionist occupation in our occupied lands by drone,\" the first statement said.\nThe attack on Tel Aviv, the first of its kind, targeted the Glilot intelligence center linked to the Israeli Mossad spy agency.\nThe Islamic Resistance in Iraq has also struck major American military bases in Syria and Iraq amid anger over the US support for Israel's onslaught on Gaza."}, {"id": "ed71f1ca-467b-40ef-a90b-7d7425b9bada", "title": "The mother - of - two special operator killed hunting ISIS : Navy cryptologist Shannon Kent husband tells the story of a warrior in a top secret unit taken away from her sons by a suicide bomber in Syria", "date": "2024-05-07 11:45", "url": "https://www.dailymail.co.uk/news/article-13389513/Shannon-Kent-Navy-cryptologist-killed-hunting-ISIS-Syria.html", "message": "The five medals and citations she received described her Special Operations work supporting the NSA while assigned to Cryptologic Warfare Activity SIXTY SIX.\nChief Kent was fluent in seven languages and was the first woman to complete the Naval Special Warfare Direct Support Course.\nShe wished she could have said she was a member of a Special Operations Unit.\nKent believes it is important to tell her story not just for their children, but for the many other women who serve in Special Operations.\nHer goal was to use her years of experience in intelligence and Special Operations to help veterans suffering from PTSD."}, {"id": "ebd98102-25ff-41fd-9ba7-d316751ac6dd", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 07:30", "url": "https://www.mandurahmail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/?cs=30776", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department."}, {"id": "81f74d72-301f-435b-aa57-01ee0c5889f6", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 07:30", "url": "https://www.mandurahmail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department."}, {"id": "b29e8858-03be-4a1c-84eb-52d256e7cda6", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 07:45", "url": "https://www.bunburymail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/?cs=30776", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department."}, {"id": "04ce0499-2a18-4359-aee8-1b108b8212b8", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 08:00", "url": "https://www.bunburymail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department."}, {"id": "53895f65-bead-492c-aad6-1741cad22ad0", "title": "Israeli airstrike that killed seven health workers in Lebanon used US bombs , analysis reveals – Ya Libnan", "date": "2024-05-07 02:15", "url": "https://yalibnan.com/2024/05/07/israeli-airstrike-that-killed-seven-health-workers-in-lebanon-used-us-weapons-analysis-reveals/", "message": "Pictures of the shrapnel sent by the Guardian were further verified by Human Rights Watch and an independent arms expert.\nJDAMs are guidance kits produced by US aerospace company Boeing which attach to 500-2,000lb “dumb bombs” and convert them into GPS-guided precision missiles.\nThey have been key to Israel’s war effort in Gaza and Lebanon, and have been one of the most requested munitions from the US.\nFive days after the attack on healthcare workers in Lebanon, Israel killed another seven aid workers employed by the World Central Kitchen in Gaza.\nThe Democratic senator Chris Van Hollen said that the attack on al-Habariyeh should be reflected in Blinken’s report to Congress."}, {"id": "ba14e13e-bf0a-4446-a8f3-82bb34d17c9a", "title": "Manchester Arena victim mum walks 200 miles for new venue law", "date": "2024-05-07 13:15", "url": "https://www.bbc.co.uk/news/articles/cjjep9z53j6o", "message": "The mother of a Manchester Arena attack victim has set off on a 200-mile (321km) trek to Downing Street to insist a law tightening security at public venues is introduced.\nFigen Murray began her walk from the Manchester Arena, where her son Martyn Hett was killed in 2017 by suicide bomber Salman Abedi.\nShe said campaigners \"cannot wait any longer\" for Martyn's Law, which would require venues to have counter-terrorism measures.\nA Home Office spokesman said the government was in the \"final stages\" of drafting the legislation."}, {"id": "4d856cd9-6aae-49b1-97a4-e56278b62a0b", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 06:30", "url": "https://www.bunburymail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/?cs=279", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department."}, {"id": "684f8c38-cea9-4c15-9c28-17f688c0d672", "title": "Dozens of major terrorist groups operating from Afghanistan", "date": "2024-05-07 04:45", "url": "https://tribune.com.pk/story/2465455/dozens-of-major-terrorist-groups-operating-from-afghanistan", "message": "The Taliban takeover has also facilitated the re-emergence and strengthening of terrorist groups other than the TTP.\nAs many as 23 major terrorist groups are operating from Afghanistan threatening some 53 countries.\nFormed in 2015, IS-K mostly comprises disgruntled elements of Afghan Taliban, TTP, Arabs and Central Asians.\nThe seventh terrorist group is Baloch Raji Ajoi Sangar (BRAS) which includes BLA BLF, BRG and Majeed Bridge.\nThe Government of Pakistan has shared irrefutable evidence of the terror groups operating from Afghanistan’s safe havens to UNSC and international community."}, {"id": "9c1464d1-90de-428b-af30-bb3a2a10d123", "title": "The Proof Is Out There : Military Mysteries Season 1 : How Many Episodes & When Do New Episodes Come Out ? ", "date": "2024-05-07 01:15", "url": "https://www.yahoo.com/entertainment/proof-military-mysteries-season-1-221135878.html", "message": "Here’s how many episodes are in The Proof Is Out There: Military Mysteries Season 1 and on what day new episodes come out.\nHow many episodes are in The Proof Is Out There: Military Mysteries Season 1?\nThe Proof Is Out There: Military Mysteries Season 1 has 5 episodes.\nWhen do new The Proof Is Out There: Military Mysteries Season 1 episodes come out?\nNew episodes of The Proof Is Out There: Military Mysteries Season 1 typically come out every Monday."}, {"id": "9f6c1c8a-47f4-432c-bc44-26c386e10457", "title": "seeking peace ... ", "date": "2024-05-07 03:45", "url": "https://yourdemocracy.net/drupal/node/50914", "message": "Home » Blogs » Gus Leonisky's blog seeking peace...\nIn wars of attrition, military operations are determined by a state's ability to replace losses and create new formations, not by tactical and operational maneuvers.\nLow-end formations hold the line and slowly gain experience, increasing their quality until they gain the ability to conduct offensive operations.\nThey must be launched on a broad front, seeking to overwhelm the enemy at multiple points with superficial attacks.\nIndeed, this regression is disturbingly reminiscent of the “sleepwalkers” on the eve of the First World War."}, {"id": "c9851473-5da1-4fb3-a0e2-40582aeeb1a4", "title": "seeking peace ... ", "date": "2024-05-07 03:45", "url": "https://www.yourdemocracy.net.au/drupal/node/50914", "message": "Home » Blogs » Gus Leonisky's blog seeking peace...\nIn wars of attrition, military operations are determined by a state's ability to replace losses and create new formations, not by tactical and operational maneuvers.\nLow-end formations hold the line and slowly gain experience, increasing their quality until they gain the ability to conduct offensive operations.\nThey must be launched on a broad front, seeking to overwhelm the enemy at multiple points with superficial attacks.\nIndeed, this regression is disturbingly reminiscent of the “sleepwalkers” on the eve of the First World War."}, {"id": "74d323b0-7843-4924-bdf5-929f2a29f03e", "title": "Middle East crisis update : Israel rejects Hama acceptance of Qatar - Egypt ceasefire proposal", "date": "2024-05-07 00:30", "url": "https://www.dailymaverick.co.za/article/2024-05-07-israel-rejects-hamas-acceptance-of-truce-deal-biden-netanyahu-meet-as-idf-orders-rafah-evacuation/", "message": "Palestinians leave Rafah, Gaza, 6 May 2024, after the Israeli army warned of imminent military operations.\nIsrael rejects Hamas’ acceptance of Gaza ceasefire proposalHamas said it had agreed to a ceasefire proposal put forward by Qatar and Egypt to halt fighting with Israel in Gaza.\nHowever, Israel rejected Hamas’ acceptance, saying its forces would continue their operation in Rafah to eradicate the Palestinian militant group.\nThe discussion came hours after Israel’s military told Palestinians to move out of parts of the city where more than a million people are sheltering.\nThe war erupted when Hamas attacked southern Israel from Gaza, killing 1,200 people and taking 250 hostage."}, {"id": "6ef0b6e5-7c7c-4afc-93f2-036f1a5195d8", "title": "Russia says Ukrainian drone attack killed 6 in Belgorod", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240506-voa02.htm", "message": "Russia says Ukrainian drone attack killed 6 in BelgorodBy VOA News May 06, 2024Officials in western Russia said a Ukrainian drone attack killed at least six people Monday in the Belgorod region near the Russia-Ukraine border.\nVyacheslav Gladkov, the regional governor in Belgorod, said on Telegram the drone struck several vehicles and that the attack injured more than 30 people.\nThe Ukrainian air force said the drones were intercepted over the Sumy region, located in northeastern Ukraine along the border with Russia.\nThere was no immediate information about any damage or casualties, with the agency saying the result of the attack was being clarified.\nStanding in front of the 1,000-year-old Saint Sophia Cathedral in Kyiv, Zelenskyy noted that Ukraine has now been fighting for 802 days against Russia."}, {"id": "d096bb2b-9033-4f1a-962d-f22b41ad8b27", "title": "2 Ukrainians detained for allegedly plotting Zelenskyy assassination with Russia , Ukraine says", "date": "2024-05-07 12:45", "url": "https://abcnews.go.com/International/2-ukrainians-detained-allegedly-plotting-zelenskyy-assassination-russia/story?id=108534193", "message": "Two colonels from Ukraine's SBU were recruited by Russia, Ukraine said.\nLONDON and KYIV -- Two colonels in Ukraine's State Protection Service were identified as part of a group planning to assassinate Ukrainian President Volodymyr Zelenskyy, Ukrainian officials said Tuesday.\nOther high-ranking officials were also allegedly targeted by the group, which SBU officials described as a \"network of agents.\"\nSBU head Vasyl Malyuk and the head of military intelligence, Kyrylo Budanov, were among those who had been targeted, officials said.\nThe colonels had allegedly obtained the drones they planned to use for the operation against Zelenskyy."}, {"id": "fe3a8757-285c-4cfb-996f-e08048c16ca1", "title": "Russian agents detained for plotting Zelenskyy assassination , Ukraine says", "date": "2024-05-07 12:45", "url": "https://6abc.com/russian-agents-detained-for-plotting-zelenskyy-assassination-ukrai/14778368/", "message": "Russian agents detained for plotting Zelenskyy assassination, Ukraine saysLONDON and KYIV -- Two colonels in Ukraine's State Protection Service were identified as part of a group planning to assassinate Ukrainian President Volodymyr Zelenskyy, Ukrainian officials said Tuesday.\nThe colonels, who have been detained but not yet been publicly identified, were recruited by the Russian Federal Security Service, known as the FSB, Ukraine said.\n\"Their mission involved identifying military personnel within Zelenskyy's security detail capable of abducting and assassinating him,\" Ukraine's State Protection Service, or SBU, said.\nOther high-ranking officials were also allegedly targeted by the group, which SBU officials described as a \"network of agents.\"\nThe colonels had allegedly obtained the drones they planned to use for the operation against Zelenskyy."}, {"id": "29494f23-e1a8-4b98-a716-0f420e176098", "title": "Russian agents detained for plotting Zelenskyy assassination , Ukraine says", "date": "2024-05-07 13:45", "url": "https://abc7ny.com/russian-agents-detained-for-plotting-zelenskyy-assassination-ukrai/14778368/", "message": "Russian agents detained for plotting Zelenskyy assassination, Ukraine saysLONDON and KYIV -- Two colonels in Ukraine's State Protection Service were identified as part of a group planning to assassinate Ukrainian President Volodymyr Zelenskyy, Ukrainian officials said Tuesday.\nThe colonels, who have been detained but not yet been publicly identified, were recruited by the Russian Federal Security Service, known as the FSB, Ukraine said.\n\"Their mission involved identifying military personnel within Zelenskyy's security detail capable of abducting and assassinating him,\" Ukraine's State Protection Service, or SBU, said.\nOther high-ranking officials were also allegedly targeted by the group, which SBU officials described as a \"network of agents.\"\nThe colonels had allegedly obtained the drones they planned to use for the operation against Zelenskyy."}]