[{"id": "3e72be21-ecb5-4bff-a01b-f40c1848e683", "title": "Tropical Storm Hone : Hawaii faces flooding and road closures as three Cyclones stir in Pacific", "date": "2024-08-27 03:30", "url": "https://timesofindia.indiatimes.com/world/us/hawaii-faces-flooding-and-road-closures-as-three-cyclones-stir-in-pacific/articleshow/112821416.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tropical storm Hone brings heavy rain to HawaiiImpact on Big IslandPrecautions against future fires amid Tropical Storm HoneHurricane Gilma and Tropical Storm Hector gain strengthThree tropical cyclones were active in the Pacific Ocean on Monday, bringing varied effects to different regions.\nTropical Storm Hone caused significant rainfall and flash floods in Hawaii , while Hurricane Gilma and Tropical Storm Hector were gaining strength and moving eastward.The impacts of these storms led to road closures and power outages to potential future flooding concerns.Tropical Storm Hone, pronounced \"hoe-NEH,\" caused road closures, downed power lines, and damaged trees in parts of the Big Island , according to William Ahue, a forecaster at the Central Pacific Hurricane Center in Honolulu.\n\"No major damage that we know of yet,\" news agency AP quoted Big Island mayor Mitch Roth as saying.\nAdditionally, four schools on the Big Island were closed because of power outages and flooded roads.\n\"We were experiencing tropical storm winds and heavy pounding rain through the night.\""}, {"id": "6e74dcc6-74db-4a11-a43b-49fb84ede299", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean | News , Sports , Jobs", "date": "2024-08-27 13:00", "url": "https://www.mauinews.com/news/local-news/2024/08/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific-ocean/", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "By JENNIFER SINCO KELLEHER and JULIE WALKER Associated PressHONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector, which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "02333cce-3a86-4cf0-b49d-661f4448b0d5", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 08:30", "url": "https://www.butlereagle.com/20240827/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific-ocean/", "domain": "butlereagle.com", "domain_classification": "Unknown", "message": "HONOLULU — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone which brought heavy rain to Hawaii, Hurricane Gilma which was gaining strength and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nIn the eastern Pacific Ocean, Hurricane Gilma intensified Monday into a strong Category 2 hurricane with maximum sustained winds at 110 mph.\nFarther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "3b99e970-e059-46ac-a25f-f8c80fbd5c45", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 05:30", "url": "https://www.mymotherlode.com/news/national/3413934/hone-swirls-past-hawaiis-main-islands-after-dumping-enough-rain-to-ease-wildfire-fears.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific OceanTropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean View PhotoHONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector, which was churning westward, far off the coast of southern tip of Baja California.\nBy midday Monday, Hone was 280 miles (450 kilometers) west-southwest of Honolulu with maximum sustained winds of 65 mph (110 kph).\nIn the eastern Pacific Ocean, Hurricane Gilma intensified Monday into a strong Category 2 hurricane with maximum sustained winds at 110 mph (175 kph).\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "c186de6e-8124-411d-96db-b0bbe90cc3f4", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 01:00", "url": "https://wacotrib.com/ap/national/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific/article_523a390c-d295-52ee-b6ec-61bb86c89914.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone which brought heavy rain to Hawaii, Hurricane Gilma which was gaining strength and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "5658e2c6-b59b-4e78-a5b8-676e0348ef41", "title": "Back - to - Back Hurricanes : Hawaii Could Face Gilma Less Than a Week After Hone", "date": "2024-08-27 01:15", "url": "https://www.theepochtimes.com/us/back-to-back-hurricanes-hawaii-could-face-gilma-less-than-a-week-after-hone-5713050", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone began its pass of the islands as a Category 1 Hurricane on Aug. 25, diminishing to a tropical storm in the process.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center/National Weather ServiceThe Hawaiian Islands could face back-to-back storms as the National Hurricane Center (NHC) forecasts Hurricane Gilma to arrive within striking distance by Labor Day Weekend—less than one week after Hurricane Hone.\nThere are currently three named storms in the Pacific, with Tropical Storm Hector following behind Gilma."}, {"id": "b2325d93-f740-43a9-acd4-c72bb1440d4c", "title": "Hurricane - season fire , power risks garner more attention", "date": "2024-08-27 05:15", "url": "https://www.yahoo.com/news/hurricane-season-fire-power-risks-032153598.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HONOLULU (KHON2) — Top emergency management officials said with this hurricane season, extra attention is on even more threats than before.\nClean-up efforts begin on Hawaii island as Hurricane Hone passes throughLong after Hurricane Hone had passed Hawaii island, and shelters meant to protect from wind, rain and flooding had closed, Hawaii County announced the re-opening of two shelters in parks for one specific reason: power.\nKHON2 asked James Barros, administrator of the Hawaii Emergency Management Agency, about the elevated attention to power outages.\nDOH plans change to ocean water testing during brown water advisories“We do, and we would be looking at our federal partners for assistance during an extended power shutdown,” Barros said.\nSo I’m more worried towards the end of hurricane season than I am at the beginning.”Copyright 2024 Nexstar Media, Inc. All rights reserved."}, {"id": "5e3410f1-9395-4ebd-a4cb-4120c345cd2a", "title": "Earthquake of 5 . 9 magnitude strikes Darwin", "date": "2024-08-27 05:15", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/earthquake-of-5-9-magnitude-strikes-darwin-in-australia/articleshow/112823593.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "A strong earthquake measuring 5.9 on the Richter scale occurred in the Banda Sea , off the coast of Darwin , Australia , on Tuesday.\nThe seismic event was detected at a depth of 62 km.According to the Bureau of Meteorology, \"there was no threat of a tsunami to Australia\" following the earthquake.\nGeoscience Australia received nearly 300 reports from individuals who felt the tremors.The significant seismic activity in the Banda Sea came shortly after a smaller, magnitude 3.0 earthquake struck the Gippsland region of Victoria on Monday evening at 7:54pm.The epicenter of this quake was located at Sandy Point, in close proximity to Wilsons Promontory, approximately 190km south-east of Melbourne."}, {"id": "62dcd38a-d729-423a-8ec1-753ebe5f78bc", "title": "Magnitude 5 . 9 earthquake recorded off coast of Darwin", "date": "2024-08-27 03:30", "url": "https://www.dailymail.co.uk/news/article-13782683/Magnitude-5-9-earthquake-recorded-coast-Darwin-Northern-Territory.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "An earthquake with a magnitude of 5.9 has been recorded off the coast of Darwin.\nThe earthquake was recorded in the Banda Sea at a depth of 62km at about midday on Tuesday.\nAlmost 300 people lodged reports on Geoscience Australia after feeling the quake, while some office workers in Darwin reported their buildings shaking.\nMeanwhile, residents in NSW's Upper Hunter region and beyond were rattled by a magnitude 5.0 earthquake just after 12pm on Friday.\nIt came just hours after a magnitude 3.2 earthquake shook the nearby town of Muswellbrook at 1.10am with another magnitude 2.5 quake felt at 2.30am."}, {"id": "1ed7dd2d-d844-41d4-b4ab-7cf18be54fcc", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 13:00", "url": "https://www.voanews.com/a/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/7758568.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "54a8d747-4f35-46ed-8d1e-f9db9805ffec", "title": "No more  wildfires of note  burning in B . C . ", "date": "2024-08-27 02:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-of-note-1.7305489", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "There are no longer any wildfires of note burning in British Columbia, with the B.C.\nThe Corya Creek wildfire, about 170 kilometres northeast of Terrace, B.C., was the last fire to be tagged with the label, which was lifted on Monday.\nFire information officer Emilie Peacock cautions the changing status doesn't mean the wildfire season is over.\nMore than 10,000 square kilometres of land has been burned in B.C.\nLast year's record wildfire season saw more than 28,000 square kilometres of land burned and forced the evacuations of communities in regions including the Okanagan and Shuswap."}, {"id": "5f29c87a-5214-4f1f-a721-b079060f9cd1", "title": "Closures update # 2 : One lane of Highway 11 between Punaluʻu and Whittington now open : Big Island Now", "date": "2024-08-27 06:15", "url": "https://bigislandnow.com/2024/08/26/tropical-storm-hone-road-and-park-closures-public-shelters-open-throughout-east-hawaii/", "domain": "bigislandnow.com", "domain_classification": "Unknown", "message": "7 a.m. Monday update: Bayfront Highway in Hilo and Highway 11 in Ka‘ū near mile marker 59 are closed traffic following weekend flooding brought by Hurricane Hone.\nHighway 11 at Kawa Flats in is closed between the 57 to 61 mile marker areas.\nHighway 11 is also closed between the 57 mile marker (Whittington Beach) and mile marker 63 (Punalu‘u Beach) due to flooding.\nRoad closures include Waipi‘o Valley Access Road and Kohala Mountain Road due to a downed tree at mile marker 17.\nWaiākea High School Gym in Hilo, located at 155 W Kawili St.Honoka‘a High School and Intermediate School Cafeteria, located at 45-527 Pakalana St. in Honoka‘a."}, {"id": "c53ecb4c-7de9-4e9a-ba58-e079a55da7e7", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 12:15", "url": "https://www.newsday.com/news/nation/us-extreme-weather-glance-l41056", "domain": "newsday.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "33f4d50e-ec41-4534-9fb9-831434d8a3f3", "title": "Wild weather week includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 13:00", "url": "https://www.yahoo.com/news/wild-weather-week-includes-heat-101206997.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "276f2e45-f309-47c7-b2ae-e5dd4361929a", "title": "Megathrust Earthquake : BMKG Urges Ministry to Ensure Disaster Preparedness of Tourist Destinations", "date": "2024-08-27 05:00", "url": "https://en.tempo.co/read/1908909/megathrust-earthquake-bmkg-urges-ministry-to-ensure-disaster-preparedness-of-tourist-destinations", "domain": "en.tempo.co", "domain_classification": "Unknown", "message": "TEMPO.CO, Jakarta - The Meteorology, Climatology, and Geophysics Agency (BMKG) urged the Ministry of Tourist and Creative Economy to ensure beaches have earthquake and tsunami mitigation standards to respond to megathrust earthquake potential.\nAccording to the BMKG Head of the Indian and Pacific Oceans Tsunami Mitigation Department, Suci Anugrah, many hotels and tourist destinations are neglecting the basic standards of earthquake and tsunami mitigation.\nSuci said a megathrust earthquake is inevitable as it’s been analyzed through scientific studies.\nTherefore, a structural mitigation plan is necessary since the precise timing of a megathrust earthquake cannot be predicted.\n\"Every tourism manager and related parties can refer to ISO emergency management in drafting evacuation and disaster mitigation standards,\" said Suci."}, {"id": "b8ac03a0-c963-4a8d-a6b9-c15656967b20", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:00", "url": "https://www.yahoo.com/news/wild-week-us-weather-includes-040726833.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Here's a look at some of the weather events:Midwest sizzles under heat waveMillions of people in the Midwest have been enduring dangerous heat and humidity.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "09fbd4f4-1622-443d-8c93-ec1c41a355ef", "title": "Americans Grapple With a Wild Week of Weather", "date": "2024-08-27 14:30", "url": "https://time.com/7015078/extreme-weather-us/", "domain": "time.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nHere's a look at some of the weather events:Midwest sizzles under heat waveMillions of people in the Midwest have been enduring dangerous heat and humidity.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "5c73da3f-b546-4803-80de-c11240d4adad", "title": "Storm tracker : National Hurricane Center tracking new disturbance in central Atlantic", "date": "2024-08-27 12:45", "url": "https://www.yahoo.com/news/storm-tracker-national-hurricane-center-121948259.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is tracking a new disturbance in the central Atlantic Ocean, the agency said in its latest advisory.\nThe National Hurricane Center is tracking a new disturbance in the central Atlantic Ocean, the agency said in its latest advisory Tuesday.\nThe storm was moving west at about 8 miles per hour on Monday evening as maximum sustained winds declined to about 100 mph, according to the National Hurricane Center.\nBefore its forecasted gradual weakening, the center said Gilma will likely \"remain a hurricane as it approaches the central Pacific basin.\"\nThis article originally appeared on USA TODAY: National Hurricane Center tracking new disturbance in central Atlantic"}, {"id": "dad780f1-5468-41b0-9a24-ae00f3d992b0", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:45", "url": "https://www.ksat.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "b3adbf6d-cf3b-4cd9-8193-af210789d550", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 07:45", "url": "https://www.click2houston.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "89ff54e8-38d7-40d6-960c-1e98e9348e2f", "title": "Forecasters monitoring disturbance in Atlantic after weeks of relative calm", "date": "2024-08-27 01:15", "url": "https://www.tampabay.com/hurricane/2024/08/26/forecasters-monitoring-disturbance-atlantic-after-weeks-relative-calm/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "After weeks of relative calm in the tropics, forecasters are monitoring a disturbance in the central Atlantic that could slowly develop over the next week.\nForecasters gave the disturbance a 0% chance of developing over the next 48 hours and a 20% chance of doing so over the next week.\nThe next named storm in the 2024 Atlantic hurricane season will be Francine.\n• • •Tampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters.\nForecasters predict ‘extremely active’ 2024 hurricane season."}, {"id": "553eaa23-e67d-4108-9083-0737bea9132f", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 04:45", "url": "https://www.clickorlando.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "0ff9312b-29d2-4e3b-aae1-6eb6837f5d08", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:00", "url": "https://www.wsls.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "2927b17c-0380-43f6-875a-0fc43f2d61f7", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "235a9941-7156-47ac-9e86-154732bc22cd", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "8b7c5a69-c859-474e-b36d-a9d72e5ca921", "title": "  Pretty scary : Tropical Storm Hone lashes parts of Hawaii Island as a Cat 1 hurricane", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/26/pretty-scary-tropical-storm-hone-lashes-parts-hawaii-island-cat-1-hurricane/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "(HONOLULU) - Tens of thousands of Hawaii Electric customers were without power across the state as Tropical Storm Hone moved through the islands over the weekend.\nIt upgraded to a Category 1 Hurricane late Saturday as it brushed the southern point of Hawaii Island on Sunday.\nAs of late Sunday evening, Hone was downgraded back to tropical storm as it pulled away from the islands.\nAt 11:30 a.m. Sunday, roughly 18,000 HECO costumers were without power across the state, the majority of them on Hawaii Island.\nHawaii Island residents can report damages from Hurricane Hone here or call (808) 935-0031."}, {"id": "d37efe65-3d5d-49c5-8a94-722163c68050", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/bc-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "8d5e2ba2-d750-4a87-92d7-f6eef579f85b", "title": "Wild Week of US Weather Includes Heat Wave , Tropical Storm , Landslide , Flash Flood , and Snow", "date": "2024-08-27 13:30", "url": "https://www.theepochtimes.com/us/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow-5713604", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Judah Boyle, of Des Moines, Iowa, splashes water as he runs on the beach at Gray's Lake Park, in Des Moines, Iowa on Aug. 26, 2024.\nJudah Boyle, of Des Moines, Iowa, splashes water as he runs on the beach at Gray's Lake Park, in Des Moines, Iowa on Aug. 26, 2024.\nCharlie Neibergall/AP PhotoFALCON HEIGHTS, Minn.—It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin, and Oklahoma.\nGarrett Lockrem/Mount Bachelor Ski Resort via APTropical Storm Dumps Heavy Rain on Hawaii Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California."}, {"id": "e57fa35c-a0e0-4150-8724-bc7494db4ebe", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:00", "url": "https://www.kiro7.com/news/national/wild-week-us-weather/DMGIUSLJXFDWZH3HOEFQIGZDV4/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "1598d4d2-707c-4ce2-a1d3-c75876a8b698", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:00", "url": "https://www.kob.com/news/us-and-world-news/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "kob.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "98730bca-d0c8-4576-abf9-d5bac8ca27ed", "title": "National Hurricane Center tracking new disturbance in Atlantic . Is quiet period over ? ", "date": "2024-08-27 11:00", "url": "https://www.yahoo.com/news/national-hurricane-center-tracking-disturbance-101618365.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "National Hurricane Center tracking new disturbance in Atlantic.\nThe National Hurricane Center is tracking a new disturbance in the central Atlantic, according to the latest advisory.\nThe Pacific continues to be busy — with the National Hurricane Center currently tracking two tropical storms and one hurricane.\nThe National Hurricane Center was monitoring a tropical disturbance and two tropical waves in the Atlantic basin, according to the 8 a.m. advisory.\nNational Hurricane Center map: What are forecasters watching now?"}, {"id": "57330ba6-4c75-4599-9843-89d62ad71eb0", "title": "Hurricane forecasters track disturbance in Atlantic Ocean | Hurricane Center", "date": "2024-08-27 03:15", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/hurricane-forecasters-track-disturbance-in-atlantic-ocean/article_c596eb90-b9e7-5009-8fff-48be440eb86c.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "8e618f23-bdf2-4535-8fe9-90e8b3119d4d", "title": "Hurricane forecasters track disturbance in Atlantic Ocean | Hurricane Center", "date": "2024-08-27 05:00", "url": "https://www.nola.com/news/hurricane/hurricane-forecasters-track-disturbance-in-atlantic-ocean/article_18055fd8-6419-11ef-81e5-df130621e3c4.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "18412ee5-7ec0-4eef-b350-b60082ea87ee", "title": "Cultural sector must do more to protect heritage , say campaigners , as Unesco sites most at risk from climate change revealed", "date": "2024-08-27 11:30", "url": "https://www.theartnewspaper.com/2024/08/27/cultural-sector-must-do-more-to-protect-heritage-say-campaigners-as-unesco-sites-most-at-risk-from-climate-change-revealed", "domain": "theartnewspaper.com", "domain_classification": "Unknown", "message": "New research has revealed the 50 Unesco World Heritage sites most under threat from climate change—prompting calls for the culture sector to do more to raise awareness of, and take action on, the issue.\nA study by the climate risk firm Climate X assessed all of Unescos 1,223 sites across the globe and identified the 50 most at risk from the effects of climate change.\nShe told The Art Newspaper: “This report is a clarion call to the dangers of climate change, already wreaking terrible destruction on places and communities.\nCulture and heritage tell the stories of ourselves, communities and values, the threads that connect us to one another in time and place.\nLosing shared heritage can negatively impact communities in so many ways.”UK sites under the microscopeMeanwhile, the impact of climate change on three other UK-based Unesco sites is going to be assessed in a separate study by heritage experts from Newcastle University."}, {"id": "8054856a-ac45-4c93-8b42-852a45b88e7e", "title": "Tsunami Risk Looms Over Yogyakarta Coast After Quake from Megathrust Zone", "date": "2024-08-27 09:45", "url": "https://en.tempo.co/read/1909069/tsunami-risk-looms-over-yogyakarta-coast-after-quake-from-megathrust-zone", "domain": "en.tempo.co", "domain_classification": "Unknown", "message": "TEMPO.CO, Bandung - The 5.8-magnitude earthquake, later updated to 5.5-magnitude, that shook Yogyakarta and other areas on the southern coast of Java on Monday night, August 26, 2024, was caused by the activity of the subduction zone or megathrust zone.\nThe quake’s epicenter, which occurred at 19:57 western Indonesian time (WIB), was closer to Yogyakarta Province compared to other areas.\n“According to data from the Geological Agency, residential areas affected by the tremors are primarily located in the Disaster Prone Area (KRB) for medium to high earthquakes,” he said.\nTsunami Threat of Over 3 MetersHadi explained that the quake did not cause a tsunami despite its origin in the megathrust zone.\nAHMAD FIKRI (CONTRIBUTOR)Editor’s Choice: BMKG: Tonight's Earthquake in Yogyakarta from Megathrust ZoneClick here to get the latest news updates from Tempo on Google News"}, {"id": "17e724a5-5053-4a56-b3f5-d271a61970f1", "title": "Impacts of the drought across the Shenandoah Valley", "date": "2024-08-27 04:15", "url": "https://www.whsv.com/2024/08/27/impacts-drought-across-shenandoah-valley/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "For a second year in a row, the Shenandoah Valley is facing the worst of it.\nFour out of the top five Ag producing counties in the state, are in the Shenandoah valley.\nAn idea of how impactful the drought really is:For the Shenandoah Valley, 4 out of the top 5 Ag producing Counties are in the SV.\nSoybeans instead of corn”Along the Shenandoah River is the Burnshire Dam in Shenandoah county.\nThe Virginia Department of Forestry says drought stress impacts the trees, but more so it’s going to be from disease or invasive insects."}, {"id": "b9d2e553-f6b0-4fbb-93cf-570cb4858ca5", "title": "Moderate earthquake , 5 . 9 mag has occurred near Kepulauan Babar , Indonesia", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/moderate-earthquake-5-9-mag-has-occurred-near-kepulauan-babar-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake magnitude 5.9 (ml/mb) has struck on Tuesday, Kepulauan Babar, Indonesia (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmzd.\nId of event: us6000nmzd.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Kepulauan Babar, Indonesia."}, {"id": "2f31c078-8c40-4c47-a1bd-8294dc8c4ee5", "title": "Light earthquake , 4 . 3 mag has occurred near Pagan region , Northern Mariana Islands", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-3-mag-has-occurred-near-pagan-region-northern-mariana-islands/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes Pagan region, Northern Mariana Islands (0 miles) on Friday.\nDate and time of earthquake in UTC/GMT: 02/08/24 / 2024-08-02 22:50:54 / August 2, 2024 @ 10:50 pm.\nId of earthquake: us7000n8m1.\nThe earthquake occurred at a depth of 193.843 km (120 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Pagan region, Northern Mariana Islands."}, {"id": "162855da-c191-45c8-ad85-f4aee532cee7", "title": "Local farmers in desperate need of drought assistance", "date": "2024-08-27 03:45", "url": "https://www.wsaz.com/2024/08/27/local-farmers-desperate-need-drought-assistance/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "HURRICANE, W.Va. (WSAZ) - An awareness meeting was held Monday in Hurricane to inform West Virginia farmers about programs to assist them during this historic drought.\nJoshua Lewis, the District Director of the Farm Service Agency, spoke at the meeting, held at the Holiday Inn Express, to inform people of assistance available through the agency.\nI mean, I know the big farmers has gotta have help, but us small farmers has to have help also,” Black said.\nI put it on Facebook, had everybody to share it,” said Jeanette Waller, a local farm owner.\nThe Farm Service Agency said farmers have until the end of the calendar year to apply and need to make sure to keep all receipts to get accurate funding."}, {"id": "6439e757-d72a-47ab-be67-fb8f1657132f", "title": "Light earthquake 4 . 5 mag , 60 km S of Kangding , China", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-60-km-s-of-kangding-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Tuesday, 60 kilometers (37 miles) from Kangding in China.\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000nmvn.\nEpicenter of the earthquake was 66 km (41 miles) from Kangding (c. 100 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 60 km S of Kangding, China."}, {"id": "fb7a7e9f-e517-46a9-af52-e62d4c52a09e", "title": "Light earthquake : M4 . 6 quake has struck near Calama in Chile", "date": "2024-08-27 12:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-m4-6-quake-has-struck-near-calama-in-chile-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Tuesday, 22 kilometers (14 miles) from Calama in Chile.\nId of earthquake: us6000nn0u.\nThe earthquake occurred at a depth of 90.943 km (57 miles) below the earth’s surface.\nEarthquake epicenter was 22 km (14 miles) from Calama (c. 143 100 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 22 km W of Calama, Chile."}, {"id": "83824d06-4e5f-4d18-bb7e-854c4d8fc65c", "title": "Floods , fires , hail : Making Canada buildings climate - resilient", "date": "2024-08-27 13:00", "url": "https://www.theglobeandmail.com/business/industry-news/property-report/article-floods-fires-hail-making-canadas-buildings-climate-resilient/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Mr. Gaglardi says Orion’s buildings are built with concrete walls that are between 12 to 14 inches thick and can withstand fire for two hours.\nMr. Gaglardi says his firm targets its work in B.C.’s Lower Mainland communities, such as Surrey, Langley and Abbotsford.\nClimate risk analysts say the real estate sector and regulators are moving too slow on considering measures to improve the climate resilience of Canada’s buildings.\nNew investments also factor in climate risk, meaning a higher rate of risk might require a higher rate of return, according to Mr. Simpson.\nShe says not all mitigation measures need to be huge costs and notes the sector needs to look at the future costs associated with failing to plan for climate resilience."}, {"id": "12386b2c-6d27-4177-9e36-9c5bc3fe541a", "title": "Light earthquake , 4 . 2 mag has occurred near Uchiza in Peru", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-2-mag-has-occurred-near-uchiza-in-peru/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 18 kilometers (11 miles) from Uchiza in Peru on Tuesday.\nId of earthquake: us6000nmz7.\nEpicenter of the earthquake was 31 km (19 miles) from Tocache (c. 29 000 pop), 19 km (12 miles) from Uchiza (c. 17 700 pop).\nNearest cities/city/towns to hypocenter/epicentrum was Tocache, Uchiza (min 5000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 18 km ENE of Uchiza, Peru."}, {"id": "93a3691a-eb31-425a-b16d-2a4cc27135c9", "title": "Light earthquake , 4 . 5 mag strikes near Pondaguitan in Philippines", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-strikes-near-pondaguitan-in-philippines-20/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Monday, 121 km SE of Pondaguitan, Philippines (75 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmyj.\nId of event: us6000nmyj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 121 km SE of Pondaguitan, Philippines."}, {"id": "02397b25-dc4a-47c3-bd31-071e4e77020d", "title": "Rain , cooler weather end campfire ban on Vancouver Island - Victoria Times Colonist", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/local-news/rain-and-cooler-weather-bring-end-to-campfire-ban-on-vancouver-island-9437434", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Fire danger ratings across most of Vancouver Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said recent rains and cooler temperatures will allow it to lift the campfire ban on Vancouver Island as of noon on Wednesday.\nFire danger ratings across most of the Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said in a statement.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "a8421b81-7abd-41e7-b92c-f3027010d9d0", "title": "Light earthquake : M4 . 9 quake has struck near Santa Maria in Philippines", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-m4-9-quake-has-struck-near-santa-maria-in-philippines-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has occurred on Friday, 35 kilometers (22 miles) from Santa Maria in Philippines.\nIds that are associated to the earthquake: us7000n8mg.\nThe earthquake was roughly at a depth of 35 km (22 miles).\nExact location of earthquake, longitude 126.7652 East, latitude 8.0167 North, depth = 35 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 35 km E of Santa Maria, Philippines."}, {"id": "ef88f6b0-7481-4ce8-a7b3-935aacd3192a", "title": "Light earthquake , 4 . 1 mag strikes near Acajutla in El Salvador", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-1-mag-strikes-near-acajutla-in-el-salvador/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) has struck on Monday, 32 kilometers (20 miles) from Acajutla in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 59.631 km (37 miles) below the earth’s surface.\nClose country/countries that might be effected, El Salvador (c. 6 052 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 32 km SE of Acajutla, El Salvador."}, {"id": "4ad14dc2-e0ec-4e29-b04e-3642adb24281", "title": "Light earthquake : M4 . 2 quake has struck near Brisas Barra de Suchiate in Mexico", "date": "2024-08-27 12:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-m4-2-quake-has-struck-near-brisas-barra-de-suchiate-in-mexico/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 24 kilometers (15 miles) from Brisas Barra de Suchiate in Mexico on Monday.\nThe earthquake occurred at a depth of 60.637 km (38 miles) below the earth’s surface.\nClose country/countries that might be effected, Guatemala (c. 13 550 000 pop), Mexico (c. 112 469 000 pop).\nNearest city/cities or towns, with min 5000 pop, to epicentrum/hypocenter was Cuyotenango, San Pedro Sacatepéquez, San Andrés Villa Seca.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 24 km WSW of Brisas Barra de Suchiate, Mexico."}, {"id": "012941bc-0223-4b51-8568-029290cbf598", "title": "Technical Discussion : A First Alert for dense fog , then for a midweek storm chance", "date": "2024-08-27 06:00", "url": "https://www.wfsb.com/page/technical-discussion-a-first-alert-for-dense-fog-then-for-a-midweek-storm-chance/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "The high in Bridgeport was 72°, setting a record for March 15th; previously, the record high was 65° from 1990.\n3-6″ fell in the Greater Hartford Area, as well as for inland sections of New Haven, Middlesex, and New London Counties.\nWhen it comes to temperature, it was the 9th warmest with an average temperature of 53.7° (4.2° above normal).\nJANUARY ‘23 SUMMARY…The first month of the year has gone down as the 3rd mildest, with an average temperature of 36.6° (9.5° above average).\nFor Bridgeport, the record high for Saturday was 72 (from 1961), it was surpassed by 1 degree."}, {"id": "d208334c-cfd0-434d-b247-6eb3c91ae858", "title": "Light earthquake , 4 . 8 mag has occurred near Barcelona in Philippines", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-8-mag-has-occurred-near-barcelona-in-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.8 (ml/mb) has occurred on Friday, 38 kilometers (24 miles) from Barcelona in Philippines.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the event: us7000n8np.\nThe earthquake occurred at a depth of 52.726 km (33 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 38 km ENE of Barcelona, Philippines."}, {"id": "35f41078-14c2-465a-abbf-80e423443b8a", "title": "Light earthquake , 4 . 3 mag has occurred near Champerico in Guatemala", "date": "2024-08-27 12:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-3-mag-has-occurred-near-champerico-in-guatemala-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 14 kilometers (9 miles) from Champerico in Guatemala on Tuesday.\nDate and time of earthquake in UTC/GMT: 27/08/24 / 2024-08-27 05:38:48 / August 27, 2024 @ 5:38 am.\nId of earthquake: us6000nn0t.\nCountry/countries that might be effected, Guatemala (c. 13 550 000 pop), Mexico (c. 112 469 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 14 km NW of Champerico, Guatemala."}, {"id": "9b9b45da-82fc-4c4d-aaf7-e56a219dedf2", "title": "Low - pressure system could show tropical formation in Atlantic", "date": "2024-08-27 11:45", "url": "https://www.wftv.com/news/local/low-pressure-system-could-show-tropical-formation-atlantic/QRIFW5BH6FHORHAQEGSX6SROFM/", "domain": "wftv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "17cb48f7-aaf9-4c21-81ec-2d960cf9e41b", "title": "UK Hurricane warning : Expert says  big beast  to hit Britain | Weather | News", "date": "2024-08-27 13:30", "url": "https://www.express.co.uk/news/weather/1940940/uk-hurricane-warning-storm-lilian-met-office", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The dissipation of dry sandy air off the Sahara could have implications for the UK, said Jim DaleThere are rising expectations of a “huge up-step” in the hurricane season next month, with a meteorologist warning a “big beast” could lash the UK within days.\nJim Dale, of British Weather Services, was speaking days after Storm Lilian barrelled over Britain, downing trees and causing significant travel disruption.\nAnd he suggested more is in the pipeline once autumn arrives, telling Express.co.uk: \"There’s rising expectations of a huge up-step in the hurricane season as we head into September and October.\n“Six to eight big beasts are not out of the question, with some akin to the first two eventually heading our way.\nWe've had heavy rain in the north of the UK through this morning ?"}, {"id": "e67b49f5-0133-4380-a36c-7fb6a88607e5", "title": "TROPICS : A new area of possible development in the Atlantic", "date": "2024-08-27 14:30", "url": "https://www.wptv.com/weather/tropical-weather/a-new-area-of-possible-development-in-the-atlantic", "domain": "wptv.com", "domain_classification": "Unknown", "message": "WEST PALM BEACH, Fla. — The National Hurricane Center on Tuesday is watching a new area of unsettled weather in the central Atlantic for possible development.\nA tropical wave will approach the Lesser Antilles as we get closer to the weekend or early next week.\nThis wave may become a tropical depression or storm.\nWPTVTRACKING THE TROPICS: Hurricane Center | Hurricane GuideFor now, it has a 20% chance of development.\nWe have plenty of time to track it,\" WPTV First Alert Weather meteorologist Jennifer Correa said."}, {"id": "6eacb16c-a1e6-4a4f-96ac-d3d321da32b0", "title": "Disaster unemployment assistance available to Vermonters who lost work during July 9 - 10 flooding​", "date": "2024-08-27 03:30", "url": "https://www.necn.com/news/local/disaster-unemployment-assistance-available-to-vermonters-who-lost-work-during-july-9-10-flooding/3318228/", "domain": "necn.com", "domain_classification": "Unknown", "message": "The U.S. Department of Labor has approved federal disaster unemployment assistance for Vermonters who lost work because of the flooding from the remnants of Hurricane Beryl on July 9 and 10, the state Labor Department said Monday.\nLast week, President Joe Biden approved a major disaster declaration for parts of the state that were hit by the flooding, including individual assistance disaster, which covers unemployment assistance, for residents in Addison, Caledonia, Chittenden, Essex, Lamoille, Orleans and Washington counties, the state said.\nHeavy rains washed out roads in Vermont in the latest round of flooding to hit the state.\n“Vermonters across the State have found their lives, homes, and businesses impacted again by this recent disaster,” Labor Commissioner Michael Harrington said in a statement.\nThe Labor Department will determine if the individual is eligible for regular unemployment or should apply for the federal benefit."}, {"id": "008c3b22-0b2b-45b8-9919-63e0fb6ed119", "title": "New Zealand Leader Stands By Climate Stance Amid UN Calls for Urgent Action", "date": "2024-08-27 06:45", "url": "https://www.theepochtimes.com/world/new-zealand-leader-stands-by-climate-stance-amid-un-calls-for-urgent-action-5713509", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Winston Peters has maintained his scepticism of the climate change consensus at the Pacific Island Forum also attended by the UN secretary-general.\nHowever, in response to questions on the matter, Peters, also New Zealand’s deputy prime minister, said, “Do I believe in climate change?\nTuvalu Prime Minister Feleti Teo said he was delighted that the U.N. highlighted climate change and its effect on smaller countries.\nTupou Vaipulu/AFP via Getty ImagesPapua New Guinea Prime Minister James Marape said he “could not be more satisfied” by Guterres’ advocacy.\nMeanwhile, New Zealand’s Prime Minister Christopher Luxon, in addressing the Lowy Institute only two weeks ago, said, “Climate change is a profound security threat."}, {"id": "bd06d563-d786-4eca-91ce-4b369bd70f2f", "title": "Talking the Tropics With Mike : Pacific remains the active basin ... waves to watch in the Atlantic", "date": "2024-08-27 13:00", "url": "https://www.wokv.com/weather/talking-tropics-with-mike-pacific-remains-active-basin-waves-watch-atlantic/2DDZ3KYZLVG2LE5J6CGJVZLPDQ/", "domain": "wokv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "f54b4591-2cb2-4878-89b5-473aff249da9", "title": "Clean - up efforts begin on Hawaii island as Hurricane Hone passes through", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/clean-efforts-begin-hawaii-island-012519326.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HILO, Hawaii (KHON2) — Hawaii island is cleaning up from Hurricane Hone.\nWhile no severe damages were reported, major roads remain closed and some have been without power since Saturday night.\nKauai County: No major impacts from Hone, monitoring looming storms in Eastern PacificFrom Kohala to Kau, Hone dumped over a foot of rain on parts of Hawaii island and some roads were damaged.\nSome volcano residents had power back on by 9 p.m. on Sunday night.\nThe county is hosting two hazard mitigation meetings over the next two days where residents can provide comments and feedback."}, {"id": "6dcd24f6-5c92-4a02-b169-d37fde4dfc02", "title": "Met Office has say on  heatwave that will make united kingdom hotter than Spain  ", "date": "2024-08-27 06:00", "url": "https://metro.co.uk/2024/08/27/met-office-say-heatwave-will-make-uk-hotter-spain-21490066/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Some headlines have said the UK will even be hotter than Barcelona this week, with temperature hitting hotter than 30°C.\nAnd while the Met Office forecast isn’t quite as fulsome, there is hope of hot weather ahead.\nThere are even even yellow weather warnings in place today for southwest Scotland, including Dumfries and Galloway, South Lanarkshire, and the Scottish Borders.\nLeeds Festival was disrupted when at least two stages had to close due to gale-force winds battering the site.\nBut it seems that there are some barbecues and beach days still in store; at least for those below Birmingham."}, {"id": "eb92a65a-6b04-422b-818f-2f0cc855fca8", "title": "Wilton in  recovery  after  100 - year flood  damages roads , fields", "date": "2024-08-27 11:15", "url": "http://www.thehour.com/news/article/wilton-rain-flood-recovery-mode-19723951.php", "domain": "thehour.com", "domain_classification": "Unknown", "message": "The floodwaters carried debris throughout the town, depositing large amounts of dirt on the high school’s track at Tom Fujitani Field, flooding town fields, and washing out ponds, officials said.\nOne of the more lasting impacts of the storm and flooding is the closure of Scribner Hill Road, Blanchfield said.\nThe road is closed between Blue Ridge Road and “just before” Rockhouse Road, Blanchfield said.\nThe town’s emergency response team, comprising police, fire, and the first selectwoman, have been meeting daily to assess damage and further plan, Blanchfield said.\nRegardless, the town’s teams will likely conduct door-to-door damage assessments in the Newtown Turnpike and Arrowhead areas of Wilton, he said."}, {"id": "fbb62b16-152b-4e6a-809f-5a9e369ee87e", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.vernonmorningstar.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "vernonmorningstar.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "c57bdc88-e6b8-4103-be26-95070d9c0f32", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.cloverdalereporter.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "cloverdalereporter.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "7039d88c-f5dc-49d5-92e8-3abe30c8e7c1", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 01:00", "url": "https://www.clearwatertimes.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "clearwatertimes.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C."}, {"id": "3b888e96-1ec0-4b70-a56c-f227a14f3fbb", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.mapleridgenews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "mapleridgenews.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "a1dbe416-19fc-43fe-9e1d-a7b3e1dafc58", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.sookenewsmirror.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "sookenewsmirror.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "b81ffe50-19dc-42d6-aa8c-5c222aa32986", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.westerlynews.ca/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "westerlynews.ca", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "e8b525fe-4283-4df5-b9c1-4bcc4e01cdc1", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.kelownacapnews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap."}, {"id": "cae75a5d-0178-46b7-a9a6-435a61743c0b", "title": "Typhoon No . 10 to Hit Kyushu , Severe Weather and Rail Disruptions Expected", "date": "2024-08-27 08:15", "url": "https://www.fukuoka-now.com/en/news/typhoon-no-10-to-hit-kyushu-severe-weather-and-rail-disruptions-expected/", "domain": "fukuoka-now.com", "domain_classification": "Unknown", "message": "10, a powerful storm, is expected to approach Kyushu around August 30, bringing with it severe weather conditions.\nThe typhoon is currently located approximately 140 kilometers east of Amami City, Kagoshima Prefecture, moving west-northwest at a speed of 10 kilometers per hour.\nOn August 28, the typhoon is forecasted to pass near the Amami region with very strong intensity, potentially causing violent winds and high waves.\nIn response to the approaching typhoon, JR Kyushu has announced the possibility of planned suspensions and extended service interruptions across its rail network.\nSpecifically, the Kyushu Shinkansen may suspend operations from the night of August 27, while the Nishi-Kyushu Shinkansen could face disruptions from August 28 onward."}, {"id": "c3e53a1c-8ed1-4322-89c4-e36b2e792b00", "title": "A very Virginia veggie", "date": "2024-08-27 08:30", "url": "https://richmond.com/news/community/powhatan-today/a-very-virginia-veggie/article_1521b30c-6379-11ef-a53b-a3c9b29c330a.html", "domain": "richmond.com", "domain_classification": "Unknown", "message": "Squash is plentiful in Virginia, with 401 farms growing squash on 726 acres in 2022, according to the most recent U.S. Census of Agriculture.\nThe three main types of summer squash are yellow, zucchini and white patty pan.\nA majority of Virginia was placed under a drought watch in June by the Virginia Department of Environmental Quality and the Virginia Drought Monitoring Task Force.\nWhen it comes to preparing summer squash, it depends on her mood.\n“For yellow squash, you’ve got to have it with onions and bacon."}, {"id": "c6783869-fc30-400e-a30b-a03a014678c9", "title": "People trapped at 200ft after  merciles ride shuts off during powerful storm", "date": "2024-08-27 11:45", "url": "https://metro.co.uk/2024/08/27/people-trapped-200ft-merciless-ride-shuts-off-powerful-storm-21494274/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "A torrential storm which closed in on the Six Flags complex led to dangerous conditions, with one ‘merciless’ ride forced to shut down.\nIt’s not clear how long the visitors were left trapped in the sky at the theme park in Mexico City.\nThe ride in question is the Supergirl Sky Flight, which spins at 40 mph and is described by Six Flags as ‘merciless’.\nThe ride, which can hit 30 km per hour, jammed around 30m off the ground with 13 people on board.\nCloser to home, 25 people were trapped mid-air on the Super Trooper ride in Skegness when it broke down on August 20."}, {"id": "29a5ccfd-48bd-4074-882e-b98658e72f26", "title": "Here what roads remain closed more than a week after CT floods", "date": "2024-08-27 11:45", "url": "http://www.nhregister.com/weather/article/ct-flooding-road-closures-weather-19723618.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Here's which state remain closed as of Monday:MonroeRoute 34: Route 34 is closed between Loughlin Road in Oxford and Route 111 in Monroe due to flood damage.\nAdvertisement Article continues below this adOxfordRoute 67: Route 67 is closed at Old State Road, and between Old State Road and Seymour Southbury Road due to flooding, the DOT said.\nA section of the road is also closed between Park Road and Great Hill Road due to flood damage.\nRoute 34: Route 34 is closed between Loughlin Road in Oxford and Route 111 in Monroe due to flood damage.\nSouthburyRoute 67: A section of Route 67 is closed between SR 487 and Community House Road due to flood damage."}, {"id": "cd206f96-fb92-4225-82c6-ec6eadc7b098", "title": "UN Secretary General Antonio Guterres issues climate SOS at earthquake - hit Tonga summit - as he warns that rapidly rising sea levels are  putting this Pacific paradise in peril  ", "date": "2024-08-27 00:15", "url": "https://www.dailymail.co.uk/news/article-13779281/Earthquake-rattles-opening-day-PIF-summit-Tonga.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The UN Secretary General Antonio Guterres has issued a climate SOS at the Tonga summit, warning that rising sea levels are 'putting this Pacific paradise in peril'.\nHe did this at a meeting of the Pacific Islands Forum, whose member countries are among those most imperilled by climate change.\nIt comes as a 6.6 magnitude earthquake rattled the opening day of the Pacific Islands Forum Leaders Meeting.\nNext month the United Nations General Assembly holds a special session to discuss rising seas.\nUnited Nations Secretary-General Antonio Guterres addressed Monday's opening ceremony, which celebrated the diversity of the region."}, {"id": "e470da4f-7115-4d89-90d4-6bc7d728d0f9", "title": "B . C . lifts last  wildfire of note  designation , as number of blazes drops below 300 - Medicine Hat NewsMedicine Hat News", "date": "2024-08-27 01:30", "url": "https://medicinehatnews.com/news/national-news/2024/08/26/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "lifts last ‘wildfire of note’ designation, as number of blazes drops below 300By The Canadian Press on August 26, 2024.\nWildfire Service, *MANDATORY CREDIT* A view of the Cory Creek wildfire is seen near Witset, B.C., in an Aug. 19, 2024, handout photo.\nWildfire Service, *MANDATORY CREDIT*Share this story:VANCOUVER – There are no longer any “wildfires of note” burning in British Columbia, with the BC Wildfire Service saying favourable weather has allowed crews to make good progress in the province’s battle against hundreds of blazes.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "89dbf402-4456-4acb-b7a6-e46afe7440c4", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.merimbulanewsweekly.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14264", "domain": "merimbulanewsweekly.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "b5afedc7-96bd-43e3-96cf-a809bb49dabd", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 03:45", "url": "https://www.hawkesburygazette.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "250556f2-79e9-4477-be6e-2d25e3856ad5", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:15", "url": "https://www.bunburymail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=30776", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "f63daea5-cb55-4364-a0a7-4146c6a8503f", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:15", "url": "https://www.bunburymail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "92a8dea1-87c2-445f-a92d-80a64434f5b4", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 07:00", "url": "https://www.singletonargus.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "10e59517-c229-4c6b-99fe-a5d64cd62d17", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 07:45", "url": "https://www.portstephensexaminer.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "portstephensexaminer.com.au", "domain_classification": "Unknown", "message": "\"We're very grateful for the UN secretary-general's commitment to the cause of the Pacific in terms of climate change and of course (reducing) fossil fuels is at the core of it,\" he told AAP."}, {"id": "a053c577-b709-423f-9e24-985e7e6682b3", "title": "They settled in Houston after Katrina and then faced a political storm", "date": "2024-08-27 12:15", "url": "https://grist.org/extreme-weather/they-settled-in-houston-after-katrina-and-then-faced-a-political-storm/", "domain": "grist.org", "domain_classification": "Unknown", "message": "Sanyika established a group for Katrina evacuees who settled in Houston.\nThe Houston Chronicle and several national newspapers blared with negative headlines — “Houston ties murder increase to Katrina,” “Katrina evacuees wearing out welcome in Houston,” “Katrina Evacuees Exporting Violence to Houston.”“As it relates to murders, there’s a definite Katrina effect,” Captain Dale Brown, a high-ranking officer in the Houston Police Department, told the Houston Chronicle in 2006.\nThe police would later claim that they tied 60 murders that took place in 2006 to Katrina evacuees.\nBill White, who served as mayor of Houston after Hurricane Katrina, at his home in 2010.\nAnd it was called the jail.” (The Houston Police Department has said it never tracked how many Katrina evacuees it arrested.)"}, {"id": "aa359dc6-7ffa-4389-9588-8a5affa691ec", "title": "Severe storm threat in forecast for Chicago area this week – NBC Chicago", "date": "2024-08-27 02:30", "url": "https://www.nbcchicago.com/news/local/severe-storm-threat-could-bring-heavy-rain-damaging-winds-to-chicago-area/3532611/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area is going to see near-record heat and oppressive humidity on Tuesday, but the threat of severe weather also exists, with gusty winds and heavy rain possible.\nAccording to the Storm Prediction Center, the Chicago area is at a “slight” risk of severe weather Tuesday, with wind gusts up to 60 miles per hour and heavy rains possible.\nThose readings could threaten records in Chicago, but more importantly could cause heat indices of 110-to-115 degrees across the area.\nThe threat of rain will continue into Wednesday, with isolated showers and thunderstorms possible throughout the day.\nStay tuned to the NBC Chicago app and the NBC 5 Storm Team for all the latest weather news and information."}, {"id": "73ec19ae-9e47-4a71-b7ba-442d9bacac86", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:15", "url": "https://www.recorderonline.com/news/national_news/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/article_e2e93176-fe64-5067-b26a-16e52ff51841.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "58f4f9e5-c393-4f3f-92b5-8c11a998d67e", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:00", "url": "https://keyt.com/news/2024/08/26/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "619e8b58-d76c-4577-ae4d-68c660694624", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:00", "url": "https://www.thesunchronicle.com/news/nation_world/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/article_a3025b74-1b78-5e08-b8df-cae7eaa37cc7.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "1e64ad58-91dc-4925-9e57-6de3ed0bb5e0", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:30", "url": "https://www.2news.com/news/national/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/article_ecadb655-5c80-5d03-a565-105ba77d5096.html", "domain": "2news.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "a7d23f1f-2a72-4ca4-b471-14a057d82146", "title": "China says it has  no intention  of breaching any nation airspace after Japan claim", "date": "2024-08-27 12:30", "url": "https://www.scmp.com/news/china/diplomacy/article/3276128/china-says-it-has-no-intention-breaching-any-nations-airspace-after-japan-claim", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "China says it has spoken with Japan and has “no intention” of violating any airspace after Tokyo claimed a People’s Liberation Army reconnaissance plane had made an “utterly unacceptable” incursionChinese foreign ministry spokesman Lin Jian told reporters in Beijing on Tuesday that the two sides had “maintained communication through existing working channels”.\n“I’d like to stress that China has no intention of breaching any country’s airspace,” Lin said.\nIt came after Japan on Monday said a Chinese military Y-9 reconnaissance plane had entered its airspace off the Danjo Islands – an uninhabited archipelago about 160km (100 miles) to the southwest of Nagasaki on the southern island of Kyushu."}, {"id": "87d9a1df-4c10-48e8-82fd-36a46e2d195b", "title": "National Hurricane Center Monitoring Tropical Wave in Atlantic", "date": "2024-08-27 14:15", "url": "https://999ktdy.com/national-hurricane-center-monitoring-tropical-wave-in-atlantic/", "domain": "999ktdy.com", "domain_classification": "Unknown", "message": "The Gulf Coast is bracing for the peak of hurricane season and now the National Hurricane Center is monitoring an area of disturbed weather.\nWe will continue to monitor this tropical wave and provide more updates here and on this station's mobile app in the days ahead.\nMeteorologists predict that the Atlantic will become more active in the weeks ahead as this hurricane season was predicted to be one of the most active in modern history.\nSo far, the season has been tame, but again, we are approaching the peak of hurricane season as we enter the month of September.\nHurricane season officially ends on November 30th."}, {"id": "c6499f58-bc35-4c87-917a-10cc44b8a34d", "title": "  Worldwide catastrophe  UNSG issues global SOS on sea level rise", "date": "2024-08-27 12:45", "url": "https://matangitonga.to/2024/08/27/worldwide-catastrophe-unsg-issues-global-sos-sea-level-rise", "domain": "matangitonga.to", "domain_classification": "Unknown", "message": "The ocean is overflowing.”The World Meteorological Organization (WMO) State of the Climate in the South-West Pacific 2023 report details how sea level rise in the region is above the global average.\nDespite accounting for just 0.02% of global emissions, the Pacific islands are uniquely exposed.\nYet even though some sea level rise is inevitable, its scale, pace, and impact are not.\nSea level riseIn much of the Western Pacific, sea level has risen approximately 10–15 cm, close to or nearly twice the global rate measured since 1993.\nIn the central Pacific, sea level has risen approximately 5-10 cm, according to the State of the Climate in the South-West Pacific 2023 Report."}, {"id": "9594871f-f7f4-4d8e-aae1-e5938e2aa84c", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:15", "url": "https://www.stalbertgazette.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436655", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "VANCOUVER — There are no longer any \"wildfires of note\" burning in British Columbia, with the BC Wildfire Service saying favourable weather had allowed crews to make good progress in the province's battle against hundreds of blazes.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "2bea9614-5c62-48f2-80c3-a7ec1a82bdb9", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:00", "url": "https://www.richmond-news.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "f5f8617b-791d-4a84-be5e-49f7b836ccd4", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 01:15", "url": "https://www.nsnews.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C."}, {"id": "27f6de04-abc3-4c89-9d87-d46d144383d7", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:30", "url": "https://www.mymotherlode.com/news/national/3414273/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Wild week of US weather includes heat wave, tropical storm, landslide, flash flood and snow View PhotoFALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nDeadly Alaska landslide crashes into homesA landslide that cut a path down a steep, thickly forested hillside crashed into several homes in Ketchikan, Alaska, in the latest such disaster to strike the mountainous region.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "4e275353-de0b-4732-88a8-2ae644f5241f", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.westernadvocate.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "westernadvocate.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "b9692c9f-8c1e-4f2c-b2f9-f6ca8c913d6c", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:45", "url": "https://www.bordermail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=9929", "domain": "bordermail.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "b1e8e37a-70d9-426d-b83a-6b919cef58ea", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 06:00", "url": "https://www.newcastleherald.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "fbff6e37-722e-4857-b88d-e7c91f7e2b3c", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 05:00", "url": "https://www.dailyadvertiser.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=9622", "domain": "dailyadvertiser.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said."}, {"id": "735350e9-426b-40ae-b7bc-ea8161772043", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:45", "url": "https://www.krmg.com/news/national/wild-week-us-weather/DMGIUSLJXFDWZH3HOEFQIGZDV4/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "ae269e9c-3d0a-4ae6-9da7-43abbc1280fb", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:30", "url": "https://www.wdbo.com/news/national/wild-week-us-weather/DMGIUSLJXFDWZH3HOEFQIGZDV4/", "domain": "wdbo.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "06dd98a3-0407-41bb-aca6-c7d3a0f79f18", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 08:00", "url": "https://www.wokv.com/news/national/wild-week-us-weather/DMGIUSLJXFDWZH3HOEFQIGZDV4/", "domain": "wokv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e202087f-f6ce-4828-8f74-ac5626f8b064", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 13:00", "url": "https://www.wokv.com/news/wild-week-us-weather/DMGIUSLJXFDWZH3HOEFQIGZDV4/", "domain": "wokv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "fe0a2208-3cb1-4eae-ac36-19996b67acc0", "title": "Red Cross : Weather continuing to take a toll on U . S . blood supplies | News , Sports , Jobs", "date": "2024-08-27 06:45", "url": "https://www.newsandsentinel.com/news/community-news/2024/08/red-cross-weather-continuing-to-take-a-toll-on-u-s-blood-supplies/", "domain": "newsandsentinel.com", "domain_classification": "Unknown", "message": "PARKERSBURG — Severe weather has further strained the blood supply, the American Red Cross said.\nThe Red Cross continues to experience a national blood emergency as remnants of Hurricane Debby and other severe weather across the country have further complicated efforts to rebuild the nation’s blood supply, the agency said.\nAnnually, severe weather such as blizzards, tornadoes, flooding and hurricanes impacts about 90,000 blood donations made to the Red Cross.\nTo make an appointment, download the Red Cross Blood Donor App, visit RedCrossBlood.org or call 1-800-RED CROSS (1-800-733-2767).\nThose who give Sept. 1-15 will receive a Red Cross raglan T-shirt, while supplies last."}, {"id": "48b8ca88-a3a9-466a-b444-39e11cab47c7", "title": "Storms drop significant amount of hail along South Coast - Boston News , Weather , Sports", "date": "2024-08-27 01:15", "url": "https://whdh.com/news/storms-drop-significant-amount-of-hail-along-south-coast/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(WHDH) - Pop-up thunderstorms that hit parts of southern New England dropped a significant amount of hail on several South Coast communities Monday.\nVideos and photos documented hail falling across the South Coast and Cape Cod.\nThe National Weather Service documented additional flooding in Dennis.\nThe National Weather Service issued several severe thunderstorm warnings and flash flood warnings Monday.\nA larger severe thunderstorm watch was scheduled to remain in effect across much of southern New England until 7 p.m.Stay with 7NEWS on-air and online for the latest updates on severe weather."}, {"id": "1cec1419-1a67-44c0-9c47-460946a8c4a5", "title": "Iowa Mosquito Population Making Comeback | NEWSRADIO 1040 WHO", "date": "2024-08-27 01:30", "url": "https://whoradio.iheart.com/content/2024-08-26-iowa-mosquito-population-making-comeback/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Iowa State University entomologist Ryan Smith credits regular rains and flooding for the booming populations.\nIowa has more 50 types of mosquitoes.\nIowa State reports so this year, 19 mosquito samples have tested positive for WNV, and one human case reported (in Harrison County).\nIn 2023, 96 mosquito samples tested positive for WNV, and 17 human cases were identified.\nTheir presence can really be a problem, especially in northwest Iowa, a known hot spot for this type of WNV-carrying mosquito,” Smith said."}, {"id": "660bb659-0996-4198-af65-b745227c01f1", "title": "Iowa Mosquito Population Making Comeback", "date": "2024-08-27 00:45", "url": "https://woc1420.iheart.com/content/2024-08-26-iowa-mosquito-population-making-comeback/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Iowa State University entomologist Ryan Smith credits regular rains and flooding for the booming populations.\nIowa has more 50 types of mosquitoes.\nIowa State reports so this year, 19 mosquito samples have tested positive for WNV, and one human case reported (in Harrison County).\nIn 2023, 96 mosquito samples tested positive for WNV, and 17 human cases were identified.\nTheir presence can really be a problem, especially in northwest Iowa, a known hot spot for this type of WNV-carrying mosquito,” Smith said."}, {"id": "654d648d-d4c4-4f27-8fbe-963f5d190f98", "title": "Hurricane Ian memorial proposal offered to Fort Myers ; city defers plan to Sanibel , Fort Myers Beach", "date": "2024-08-27 11:45", "url": "https://news.wgcu.org/top-story/2024-08-27/hurricane-ian-memorial-proposal-offered-to-fort-myers-city-defers-plan-to-sanibel-fort-myers-beach", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "On Monday afternoon, their spokesperson, artist, playwright and filmmaker Wendy White, presented a design for the memorial during a Fort Myers city council workshop.\nSubmitted / WGCU Concept drawing by Wendy White of proposed Hurricane Ian memorial.\nSubmitted / WGCU Concept drawing by Wendy White of proposed Hurricane Ian memorial.\n“There are scores of national military parks, battlefields and cemeteries around the country, plus the Oklahoma City National Memorial and Museum and three September 11 memorials and museums.\nKnowles argues for the construction of a National Hurricane Memorial and Museum."}, {"id": "dd02ad1c-5c9a-43e1-a7f0-c08e9b65255d", "title": "The 2024 hurricane season is not dead : Ryan Phillips – NBC 6 South Florida", "date": "2024-08-27 04:15", "url": "https://www.nbcmiami.com/weather/hurricane-season/the-2024-hurricane-season-is-not-dead-some-reminders-ryan-phillips/3401747/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The 2005 hurricane season was an extreme example of epic atmospheric performance orchestrated, in tandem, with epic fatigue for all who endured it.\nIt was 15 years later that a hurricane season combined the right ingredients to produce more storms (30) with more Gulf Coast landfalls than 2005.\nThe Hurricane season is on.\nBut as it stands, I’m left with a few sturdy reminders to share as we enter the heart of the season.\nA late-August lull has produced doubt about what the second part of hurricane season may look like."}, {"id": "8467cff8-006c-41a5-8eff-cfe6252725a3", "title": "Three Tropical Cyclones Swirl in Pacific : Track Storm Paths", "date": "2024-08-27 10:45", "url": "https://biztoc.com/x/eaca42ca2486153d", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "Three tropical cyclones swirled over the Pacific Ocean on Monday: Tropical Storm Hone, Hurricane Gilma, and Tropical Storm Hector.\nTropical Storm Hone hit Hawaii over the weekend, unleashing heavy rainfall and triggering flash floods.\nThe storms are set to continue westward and the tail…This story appeared on newsweek.com , 2024-08-27."}, {"id": "c96c133d-a421-4736-a9e8-b79e6b081da6", "title": "Thailand Braces For More Rain After Floods , Landslide Killed 22", "date": "2024-08-27 13:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219846/Thailand-Braces-For-More-Rain-After-Floods,-Landslide-Killed-22", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(PHOTO / AFP)Thailand is bracing for more tropical rainstorms after 22 people died in flash floods and landslides over the past week.\nThe flooding has affected more than 33,000 households in 13 provinces since Aug. 16, killing nine people, the Department of Disaster Prevention and Mitigation said in a statement Tuesday.\nWhile floods have receded from their peak, about 10,000 households in four provinces remain affected.\nA tropical depression is expected to strengthen through Wednesday, bringing more rain to northern, northeastern and southern provinces, the disaster mitigation agency said.\nThe government hasn’t provided information on the cost of damage to farm output nor to infrastructure from this month’s calamity."}, {"id": "f75828cf-a05f-42f0-bfde-c0db896abb2b", "title": "Emergency Declaration Issued For More Counties In New York State", "date": "2024-08-27 02:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/emergency-declaration-issued-for-more-counties-in-new-york-state/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "New York State issued another \"Disaster Emergency.\"\nNearly two dozen Long Island homes have been determined to have major damage and roughly 17-hundred Suffolk County homes have some damage.\nPresident Biden Approves Emergency Declaration for Suffolk CountyPresident Biden Speaks At West Point Commencement Getty Images loading...Late Sunday, Hochul announced that President Joe Biden had approved her request for a federal Emergency Declaration for Suffolk County.\n\"An Emergency Declaration can be declared for any occasion or instance in which the president determines federal assistance is needed,\" Hochul's Office states.\nKathy Hochul told the New York State Department of Environmental Conservation to issue an \"emergency declaration\" in nearly 20 counties."}, {"id": "880630da-dd85-4461-92ea-0a49251dac93", "title": "TROPICS : A new area of possible development in the Atlantic", "date": "2024-08-27 14:00", "url": "https://www.wflx.com/2024/08/27/new-area-possible-development-atlantic/", "domain": "wflx.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Tuesday is watching a new area of unsettled weather in the central Atlantic for possible development.\nA tropical wave will approach the Lesser Antilles as we get closer to the weekend or early next week.\nThis wave may become a tropical depression or storm.\n46419671-WPTV_Tropical Outlook-Auto.pngTRACKING THE TROPICS: Hurricane Center | Hurricane GuideFor now, it has a 20% chance of development.\nWe have plenty of time to track it,\" WPTV First Alert Weather meteorologist Jennifer Correa said."}, {"id": "e135031c-39fd-48df-9c48-92746ef485fe", "title": "Crabs , stingrays & fish dying in Little Sarasota Bay after Hurricane Debby", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/crabs-stingrays-fish-dying-little-003336036.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SARASOTA, Fla. (WFLA) — Hurricane Debby dropped massive amounts of rain on Sarasota County, inundating some neighborhoods with feet of water.\nSarasota Bay Estuary Program Director Dr. David Tomasko said samples collected in Lower Sarasota Bay show run-off from the storm is impacting water quality in the area weeks later.\nNHC monitoring potential tropical disturbance in AtlanticLast week, sampling conducting in Little Sarasota Bay found low to virtually no oxygen on the sea floor.\nTomasko said restoring the historic tidal connection would help flush pollutants out of Sarasota Bay after storms like Debby.\nWhat we have seen in Little Sarasota Bay is the same thing we saw after Hurricane Ian and our water quality in Little Sarasota Bay is the worst part, even though it doesn’t get the greatest amount of runoff in the area.”The estuary program will be back out later this week to collect additional samples in lower Sarasota Bay."}, {"id": "7181a5c9-9a54-4175-985f-84901f4808a3", "title": "Marin County supervisors green - light new Stinson Beach home", "date": "2024-08-27 02:00", "url": "http://www.sfchronicle.com/climate/article/stinson-beach-house-18488767.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "A one-story, 1,296-square-foot house is proposed to be built on the last vacant waterfront plot in Stinson Beach.\nLauren Segal/Special to the ChronicleThe Marin County Board of Supervisors has denied efforts to block a proposed house on the last vacant beachfront property in Stinson Beach.\nThe proposed house has been assessed at a value of $3.6 million.\nBut in the intervening decades, concerns about environmentally sensitive habitat and sea level rise have made development more difficult.\n“The county just paid for this great sea level rise study,” said Elizabeth Brekhus, a lawyer representing two neighbors, at the meeting."}, {"id": "c60c21b3-1387-47f3-87c3-de811e608908", "title": "How the Havasupai Tribe warns of flooding during monsoon season", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/27/how-havasupai-tribe-warns-flooding-during-monsoon-season/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "“We had multiple thunderstorms across the area, multiple warnings issued both Wednesday and again on Thursday,” said National Weather Service Flagstaff Meteorologist-In-Charge Brian Klimowski.\nGiven its location and limited access to cell service, the Havasupai Tribe says it does not have a warning system in place.\nAnd that’s really what we rely on most heavily when something like this occurs,” said Havasupai Tribe Spokesperson Abbie Fink.\nLast week’s monsoon was not the first time this area dealt with flooding.\nKlimowski says it’s important to have an escape plan before hiking in a canyon or an area prone to flooding."}, {"id": "d472efea-1967-4249-8ec2-f8cd6c6c5030", "title": "Fires in Brazil Sao Paulo state under control : authorities", "date": "2024-08-27 02:45", "url": "https://www.digitaljournal.com/world/fires-in-brazils-sao-paulo-state-under-control-authorities/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Amid prolonged drought, Sao Paulo state is experiencing its worst month of August for fires in decades - Copyright Japan's Ministry of Defense/AFP HandoutFires that have razed thousands of hectares of forest in Brazil’s Sao Paulo state have been brought under control, authorities said Monday, though an alert for fresh blazes remained in place.\nSince last Thursday, some 2,700 fires had been reported in the vast agricultural state, with more than 40 municipalities placed on high alert.\nAmid prolonged drought, Sao Paulo state is experiencing its worst August for fires in decades, with more than 3,480 separate blazes identified, according to INPE, the National Institute for Space Research.\nSeveral fires are still raging in the Brazilian Amazon, which is battling the largest number of blazes recorded in nearly two decades.\nExperts and authorities say climate change has exacerbated the dry, hot conditions for fires, most of which are set illegally to clear land for agriculture."}, {"id": "026cf9b1-66b7-424c-8dfb-26d164138686", "title": "Today in History : August 27 , catastrophic eruption of Krakatoa", "date": "2024-08-27 09:45", "url": "https://www.bostonherald.com/2024/08/27/today-in-history-august-27-catastrophic-eruption-of-krakatoa/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Today is Tuesday, Aug. 27, the 240th day of 2024.\nToday in history:On Aug. 27, 1883, the island volcano Krakatoa erupted with a series of cataclysmic explosions.\nRelated Articles Nation | The war and withdrawal from Afghanistan, a timelineThe war and withdrawal from Afghanistan, a timeline Nation | Today in History: August 26, French general leads victory march through ParisToday in History: August 26, French general leads victory march through Paris Nation | Today in History: August 25, National Park Service createdToday in History: August 25, National Park Service created Nation | Today in History: August 24, Earhart becomes first woman accomplish flight featToday in History: August 24, Earhart becomes first woman accomplish flight feat Nation | Today in History: August 23, the largest farm worker strike in U.S.\nIn 1982, Rickey Henderson of the Oakland A’s stole his 119th base of the season, breaking Lou Brock’s single-season stolen base record.\nIn 1990, blues musician Stevie Ray Vaughn and four others were killed in a helicopter crash near East Troy, Wisconsin."}, {"id": "c6d6b7ed-2f2d-4304-a4dd-f2d6f415a299", "title": "Suffolk County eyes FEMA funds to repair trail of storm damage", "date": "2024-08-27 03:00", "url": "https://www.newsday.com/long-island/suffolk/fema-suffolk-county-storm-emergency-declaration-otf0boh8", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Suffolk County officials said the dam would have to be replaced, joining a list of homes, roads and other facilities damaged by the record rainfall.\n“What we're facing is an ecological, an environmental, and an economic disaster,” Suffolk County Executive Edward P. Romaine told Newsday on Monday.\nWhat to know Suffolk County officials are eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nare eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nSign up for the Suffolk news this week newsletter The biggest news, politics and crime stories in Suffolk County, in your inbox every Friday at noon."}, {"id": "fe980592-5661-4fac-ad7f-6011c90d7b31", "title": "Today in History : August 27 , catastrophic eruption of Krakatoa", "date": "2024-08-27 05:00", "url": "https://www.news-gazette.com/news/nation-world/today-in-history-august-27-catastrophic-eruption-of-krakatoa/article_0b8a88ac-6ffd-58e9-a482-3e8773612779.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}]