[{"id": "99f102ec-d9ed-453f-b6aa-bfcc8cc643da", "title": "US rushes strike group to West Asia region amid Israel fears of retaliation from Iran", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US rushes strike group to West Asia region amid Israel's fears of retaliation from IranIran Press TVMonday, 12 August 2024 3:47 PMThe United States is sending a guided missile submarine to the West Asia region and speeding the transit of an aircraft carrier strike group, as Israel remains on high alert for retaliatory attacks from Iran.\nHe further ordered the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to accelerate its ongoing transit to the area.\nThe strike group will join the aircraft carrier Theodore Roosevelt and its accompanying warships already deployed to the Gulf of Oman.\nThe US deployment was announced following talks between Austin and Israel's minister of military affairs Yoav Gallant.\nIsrael fears Iran could coordinate its attack with Hezbollah, which has vowed its own retaliation for Israel's killing last month of Fuad Shakur, a top commander."}, {"id": "d042dfcb-1b4b-4461-be37-9b1bb2299f1c", "title": "Ship targeted multiple times in Red Sea", "date": "2024-08-13 08:15", "url": "https://www.voanews.com/a/maritime-officials-report-two-attacks-in-red-sea/7740303.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Maritime authorities were investigating multiple attacks on a ship reported in Red Sea overnight in an area where Iran-aligned Houthis have targeted global shipping.\nThe United Kingdom Maritime Trade Operations received a report of an explosion 174 kilometers northwest of Yemen’s Hodeidah early Tuesday morning.\nThe report came hours after two other blasts were reported by the captain of the same ship 117 kilometers southwest of Hodeidah, according to the private security firm Ambrey.\nIn the earlier incidents, an explosive was detonated near the ship, and crew members saw a small vessel “acting suspiciously,” coming close to the ship and flashing a light.\nThe Houthis began their campaign to disrupt shipping in the Red Sea to show solidarity with Palestinians in the war between Israel and Hamas."}, {"id": "ec35451d-6090-44aa-8b03-704922b40fe1", "title": "Maritime officials report two attacks in Red Sea", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240813-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Maritime officials report two attacks in Red SeaBy VOA News August 13, 2024Maritime authorities were investigating two separate attacks reported in the Red Sea overnight in an area where Iran-aligned Houthis have targeted global shipping.\nThe United Kingdom Maritime Trade Operations received a report of an explosion 174 kilometers northwest of Yemen's Hodeidah early Tuesday morning.\nThe report came about two hours after a separate incident was reported by the captain of a ship 117 kilometers southwest of Hodeidah.\nThe attacks were the first since Aug. 3, when a ship was hit by a missile.\nThe Houthis began their campaign to disrupt shipping in the Red Sea to show solidarity with Palestinians in the war between Israel and Hamas."}, {"id": "ce57d775-7668-4117-ac1f-0d0e143e18c8", "title": "White House Says Iran Could Attack Israel  This Week  in Retaliation for Hamas Assassination", "date": "2024-08-13 10:00", "url": "https://www.yahoo.com/news/white-house-says-iran-could-093307368.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Fears are mounting over prospects of a significant escalation of the war in Gaza, with the White House warning Tehran could attack Israel in a matter of days.\nBut John Kirby, White House national security spokesman, said the Biden administration shared Israel’s concerns on the timing of any Iranian action.\nIt wouldn’t mark the first time Iran has directly attacked Israel since Hamas swept into Israel, killing more than 1,100 people, on Oct. 7.\nWhile Israel has not claimed responsibility for Haniyeh’s assassination in the Iranian capital, the Netanyahu government hasn’t denied it either.\nOfficials had previously vowed to kill Haniyeh and other senior Hamas leaders, and the killing came just hours after Israel successfully targeted a top Hezbollah commander in Beirut."}, {"id": "ec0408d1-ed0c-4544-b7eb-ff86ed181ba5", "title": "China Condemns Hamas Chief Killing , Backs Iran as World Awaits Expected Attack on Israel", "date": "2024-08-13 00:30", "url": "https://www.breitbart.com/national-security/2024/08/12/china-condemns-hamas-chief-killing-backs-iran-as-world-awaits-expected-attack-on-israel/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Chinese Foreign Minister Wang Yi told his Iranian counterpart Ali Bagheri Kani on Sunday that the Chinese Communist Party supports Iran “defending its sovereignty, security and national dignity” prior to an expected Iranian attack on Israel.\nAn explosion in Haniyeh’s lodgings eliminated the terror chief during a visit to Iran for the inauguration of current President Masoud Pezeshkian.\nIranian officials have been promising a large-scale attack on Israel since Haniyeh’s death.\nChina was supportive towards Iran during the last large-scale attempted attack of Israel in April.\nAt the time, Iran claimed to be retaliating against a strike against the Iranian embassy in Damascus that Tehran blamed Israel for."}, {"id": "dba64466-2be6-4b08-a1be-07dd806cf443", "title": "Israel widens evacuation orders in southern Gaza , Hamas wants plans for deal", "date": "2024-08-13 00:45", "url": "https://www.wbal.com/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-deal/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nIn Lebanon, the Health Ministry said an Israeli strike near the southern town of Taybeh killed two people, without giving details.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants."}, {"id": "acdc863c-d8bd-4874-9188-66b02ce496cd", "title": "Hamas pushes for UN - backed truce deal", "date": "2024-08-13 02:30", "url": "http://usa.chinadaily.com.cn/a/202408/13/WS66bab885a3104e74fddb9abe.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "BED RAHIM KHATIB/APPalestinian militant group Hamas is pushing for implementing a Gaza cease-fire plan previously backed by the United Nations Security Council rather than holding further rounds of talks for a fresh pact, ahead of a meeting on Thursday proposed by negotiators.\nThe mediators should enforce the deal on Israel instead of pursuing further rounds of negotiations or new proposals as the process prolongs the killing of Palestinian civilians, Hamas said in the statement, as Israel continues its deadly airstrikes on Gaza.\nNetanyahu had been firm on his position of destroying Hamas and getting all hostages being held by the group, Iqbal said.\nHagari blamed Hamas for abusing civilians and civilian infrastructure to attack Israel.\nThe International Committee of the Red Cross made a call on X to make the Geneva Conventions a political priority."}, {"id": "87c9abb4-6ead-4b42-82ae-1e393bb3b2a0", "title": "Hamas pushes for UN - backed truce deal", "date": "2024-08-13 04:30", "url": "http://europe.chinadaily.com.cn/a/202408/13/WS66bab885a3104e74fddb9abe.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "BED RAHIM KHATIB/APPalestinian militant group Hamas is pushing for implementing a Gaza cease-fire plan previously backed by the United Nations Security Council rather than holding further rounds of talks for a fresh pact, ahead of a meeting on Thursday proposed by negotiators.\nThe mediators should enforce the deal on Israel instead of pursuing further rounds of negotiations or new proposals as the process prolongs the killing of Palestinian civilians, Hamas said in the statement, as Israel continues its deadly airstrikes on Gaza.\nNetanyahu had been firm on his position of destroying Hamas and getting all hostages being held by the group, Iqbal said.\nHagari blamed Hamas for abusing civilians and civilian infrastructure to attack Israel.\nThe International Committee of the Red Cross made a call on X to make the Geneva Conventions a political priority."}, {"id": "0dbd4575-d38c-4b99-a764-4c749e431ca4", "title": "Hamas pushes for UN - backed truce deal", "date": "2024-08-13 05:00", "url": "http://africa.chinadaily.com.cn/a/202408/13/WS66bab885a3104e74fddb9abe.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "BED RAHIM KHATIB/APPalestinian militant group Hamas is pushing for implementing a Gaza cease-fire plan previously backed by the United Nations Security Council rather than holding further rounds of talks for a fresh pact, ahead of a meeting on Thursday proposed by negotiators.\nThe mediators should enforce the deal on Israel instead of pursuing further rounds of negotiations or new proposals as the process prolongs the killing of Palestinian civilians, Hamas said in the statement, as Israel continues its deadly airstrikes on Gaza.\nNetanyahu had been firm on his position of destroying Hamas and getting all hostages being held by the group, Iqbal said.\nHagari blamed Hamas for abusing civilians and civilian infrastructure to attack Israel.\nThe International Committee of the Red Cross made a call on X to make the Geneva Conventions a political priority."}, {"id": "edb722b1-82ea-41a9-9dbb-674ca315707a", "title": "US Rushes Submarine , Fighter Jets To Protect Israel From Iran Attack", "date": "2024-08-13 03:00", "url": "https://menafn.com/1108547046/US-Rushes-Submarine-Fighter-Jets-To-Protect-Israel-From-Iran-Attack", "domain": "menafn.com", "domain_classification": "Unknown", "message": "It wasn't clear Sunday what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nThe carrier has F-35 fighter jets aboard, along with the F/A-18 fighter aircraft that are also on carriers.\nThe US military had already said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster Israeli defenses.\nIran has said the US bears responsibility in the assassination of Haniyeh because of its support for Israel.\nSeveral US and coalition personnel were wounded in a drone attack on Friday in Syria, in the second major attack in recent days against US forces amid soaring tensions in the Middle East."}, {"id": "974addcf-bf40-46fc-812a-68e45e9477fa", "title": "US beefs up posture in Middle East , warns an Iran - backed attack on Israel could come this week", "date": "2024-08-13 02:45", "url": "https://www.dailyherald.com/20240812/nation-and-world/us-beefs-up-posture-in-middle-east-warns-an-iran-backed-attack-on-israel-could-come-this-week/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "Defense Secretary Lloyd Austin speaks during a news conference at the United States Naval Academy in Annapolis, Md., Tuesday, Aug. 6, 2024.\nBritish Prime Minister Keir Starmer spoke to Pezeshkian and called on him to refrain from carrying out an attack, the Prime Minister’s office said.\nLast week, Austin said the Lincoln would arrive in the Central Command area by the end of the month.\nIt wasn't clear Sunday what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nHe said Austin and Gallant also discussed Israel's military operations in Gaza and the importance of mitigating civilian harm."}, {"id": "9a01e14e-d16e-438f-a5c0-caac340c5a1f", "title": "U . S . beefs up posture in Middle East , warns Iran - backed attack on Israel could be imminent", "date": "2024-08-13 00:45", "url": "https://www.centralmaine.com/2024/08/12/u-s-beefs-up-posture-in-middle-east-warns-an-iran-backed-attack-on-israel-could-come-this-week/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "British Prime Minister Keir Starmer spoke to Pezeshkian and called on him to refrain from carrying out an attack, the Prime Minister’s office said.\nLast week, Austin said the Lincoln would arrive in the Central Command area by the end of the month.\nIt wasn’t clear Sunday what his latest order means or how much more quickly the Lincoln will steam to the Middle East.\nRyder also did not say how quickly the USS Georgia guided missile submarine would get to the region.\nHe said Austin and Gallant also discussed Israel’s military operations in Gaza and the importance of mitigating civilian harm."}, {"id": "2ad1d0e3-c167-4f85-9e5a-7d97c356daf9", "title": "US beefs up posture in Middle East , warns an Iran - backed attack on Israel could come this week", "date": "2024-08-13 01:45", "url": "https://www.smdailyjournal.com/news/national/us-beefs-up-posture-in-middle-east-warns-an-iran-backed-attack-on-israel-could/article_a2d05e1c-58eb-11ef-92a6-b7d536dd1a1a.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.\nA new puzzle every day, seven days a week!"}, {"id": "aaf1bb04-ea12-4995-871a-3329184c179a", "title": "Israel continues Gaza strikes amid growing fears of wider war", "date": "2024-08-13 07:15", "url": "https://tribune.com.pk/story/2487670/israel-continues-gaza-strikes-amid-growing-fears-of-wider-war", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinians inspect the site of an Israeli strike on a house, amid Israel-Hamas conflict, in Gaza City August 12, 2024.\nPalestinian medics said Israeli military strikes on Khan Younis on Monday killed at least 18 people and wounded several.\nLater an Israeli airstrike killed five people in the Zeitoun suburb of Gaza City, and two others were killed in Rafah, near the border with Egypt, medics said.\nThe Israeli military on Monday released an updated document with names and other details of 31 fighters it said were killed in Saturday's strike.\nGaza health officials say most of the conflict's fatalities have been civilians but Israel says at least a third were fighters."}, {"id": "413b45e0-33e2-4913-bbee-9a154de66b2e", "title": "Israel Defends Attack on School Used by Hamas as Command Post", "date": "2024-08-13 02:45", "url": "https://www.theepochtimes.com/world/israel-defends-attack-on-school-used-by-hamas-as-command-post-5704613", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Hamas claims that up to 100 people were killed in the attack, while Israel lists the names and ranks of at least 31 terrorists eliminated in the operation.\nThe Israeli military defended its strike over the weekend against a school in a Gaza City mosque, one serving as a shelter but which Israel says was also used as a command post by Hamas and Islamic Jihad.\nCasualty figures released by Gaza health authorities, which Hamas controls, do not distinguish between civilians and members of the terror groups.\nOne of the targets of the attack, the IDF said, was Ashraf Juda, commander of Islamic Jihad’s Central Camps Brigade.\nThe IDF listed 19 terrorists it says were eliminated in its Aug. 10, 2024 strike at the Al Taba'een school in Gaza City, which it said was used as a Hamas command post."}, {"id": "afe2d1c5-c76e-4bae-abc9-a4785bcab3fa", "title": "Israel keeps up strikes in Gaza as fears of wider war grow", "date": "2024-08-13 03:45", "url": "https://dunyanews.tv/en/World/830460-israel-keeps-up-strikes-in-gaza-as-fears-of-wider-war-grow", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israel keeps up strikes in Gaza as fears of wider war growWorld World Israel keeps up strikes in Gaza as fears of wider war growIsraeli forces pressed on with operations near the southern Gaza city of Khan Younis.\nPalestinian medics said Israeli military strikes on Khan Younis on Monday killed at least 18 people and wounded several.\nLater an Israeli airstrike killed five people in the Zeitoun suburb of Gaza City, and two others were killed in Rafah, near the border with Egypt, medics said.\nThe potential escalation underlined how far the Middle East has been thrown into turmoil by the Gaza war, now in its 11th month.\nGaza health officials say most of the conflict's fatalities have been civilians but Israel says at least a third were fighters."}, {"id": "f506a7a7-dba8-453c-a5fa-89e61863d663", "title": "Hezbollah fires volley of rockets at Israeli targets", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-irna11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah fires volley of rockets at Israeli targetsIRNA - Islamic Republic News AgencyAug 12, 2024Tehran, IRNA -- Lebanon's Hezbollah Resistance Movement has fired dozens of rockets in retaliatory attacks on Israeli military positions in the northern occupied Palestinian territories.\nHezbollah said a volley of Katyusha rockets was fired at the newly established headquarters of the 146th Division in Giaton in the early hours of Monday.\nSome sources reported that more than 30 rockets were fired from Lebanon toward the north of occupied Palestine.\nThe new strike came hours after Hezbollah launched a series of drone, rocket and missile attacks on Zionist bases.\nSince the onset of the Israeli genocidal war on Gaza, Hezbollah and the regime's military have been exchanging fires along Lebanon's southern border almost on a daily basis."}, {"id": "4ed3fd05-5ebf-4833-b5c8-006f381db7a6", "title": "Russian Missile Attack Targets Sumy Infrastructure", "date": "2024-08-13 07:15", "url": "https://menafn.com/1108547547/Russian-Missile-Attack-Targets-Sumy-Infrastructure", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russian invaders launched a missile attack and an on infrastructure facilities in the city of Sumy overnight Tuesday.\nThat's according to the regional military administration , Ukrinform reports.\nEmergency recovery works are in progress.\nUkraine downs 30 Russian attackovernight TueThe consequences of the enemy attack are being verified, the statement reads.\nAs Ukrinform reported earlier, two residential buildings were damaged in Sumy as a result of a Russian airstrike on August 11."}, {"id": "a6a98d33-695d-4181-aa74-dccd592e0b40", "title": "US beefs up military presence in the Middle East", "date": "2024-08-13 02:15", "url": "https://www.stltoday.com/news/nation-world/us-military-middle-east/article_cd77d319-9fff-549e-9dbe-1580886da2f7.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "German Chancellor Olaf Scholz spoke by phone Monday with Iran's President Masoud Pezeshkian and \"expressed his great concern about the danger of a regional conflagration in the Middle East,\" the German government said.\nBritish Prime Minister Keir Starmer spoke to Pezeshkian and called on him to refrain from carrying out an attack, the Prime Minister's office said.\nIt wasn't clear what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nMeanwhile, the European Union’s top diplomat said it should consider sanctions in response to calls by Israel’s far-right national security minister to cut off aid to Gaza.\nBen-Gvir also repeatedly called for Israel to permanently reoccupy Gaza, rebuild Jewish settlements there and encourage the “voluntary” migration of Palestinians from the territory."}, {"id": "00f412c1-ab51-423f-8457-976347348086", "title": "US beefs up military presence in the Middle East", "date": "2024-08-13 03:15", "url": "https://omaha.com/news/nation-world/us-military-middle-east/article_8e4203a0-9995-59eb-bef9-0bc354253ff6.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "German Chancellor Olaf Scholz spoke by phone Monday with Iran's President Masoud Pezeshkian and \"expressed his great concern about the danger of a regional conflagration in the Middle East,\" the German government said.\nBritish Prime Minister Keir Starmer spoke to Pezeshkian and called on him to refrain from carrying out an attack, the Prime Minister's office said.\nIt wasn't clear what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nMeanwhile, the European Union’s top diplomat said it should consider sanctions in response to calls by Israel’s far-right national security minister to cut off aid to Gaza.\nBen-Gvir also repeatedly called for Israel to permanently reoccupy Gaza, rebuild Jewish settlements there and encourage the “voluntary” migration of Palestinians from the territory."}, {"id": "f6b391db-d776-416f-bc3c-9551b3e6df8e", "title": "Suspected attacks by Yemen Houthi rebels target shipping in the Red Sea , officials say", "date": "2024-08-13 06:30", "url": "https://www.wsls.com/news/world/2024/08/13/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "1b978e05-0796-4a71-957d-dd0f7bcc2708", "title": "A ship in the Red Sea is targeted in a third attack by suspected Houthis", "date": "2024-08-13 06:45", "url": "https://www.clickondetroit.com/news/world/2024/08/13/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "5691ac55-0c3d-4de0-8f33-4948522fab92", "title": "Israel - Palestine war : US wars Iran attack could come this week", "date": "2024-08-13 01:00", "url": "https://www.smh.com.au/world/middle-east/us-warns-an-iran-backed-attack-on-israel-could-come-this-week-20240813-p5k1z4.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Washington: US Defence Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, as the US said it believes Iran or its proxies may launch a strike against Israel as soon as this week.\nThe moves, announced by the Defence Department, come as the US and other allies push for Israel and Hamas to achieve a ceasefire agreement that could help calm soaring tensions in the region, following the assassination of Hamas political leader Ismail Haniyeh in Tehran and a senior Hezbollah commander in Beirut.\nA pilot speaks to a crew member on the deck of the USS Abraham Lincoln aircraft carrier in the Arabian Sea.\nCredit: APOfficials have been on the lookout for retaliatory strikes by both Iran and Hezbollah for the killings, and the US has been beefing up its presence in the region.\nJohn Kirby, the White House national security spokesman, said Iran’s response to the killings “could be this week,” but that “it is difficult to ascertain at this particular time if there’s an attack by Iran or its proxies what it could look like.” He said the US and its allies were preparing for a “significant set of attacks”."}, {"id": "006399ad-940c-4b31-8180-516cdcdbc195", "title": "Israel - Palestine war : US wars Iran attack could come this week", "date": "2024-08-13 01:00", "url": "https://www.theage.com.au/world/middle-east/us-warns-an-iran-backed-attack-on-israel-could-come-this-week-20240813-p5k1z4.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Washington: US Defence Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, as the US said it believes Iran or its proxies may launch a strike against Israel as soon as this week.\nThe moves, announced by the Defence Department, come as the US and other allies push for Israel and Hamas to achieve a ceasefire agreement that could help calm soaring tensions in the region, following the assassination of Hamas political leader Ismail Haniyeh in Tehran and a senior Hezbollah commander in Beirut.\nA pilot speaks to a crew member on the deck of the USS Abraham Lincoln aircraft carrier in the Arabian Sea.\nCredit: APOfficials have been on the lookout for retaliatory strikes by both Iran and Hezbollah for the killings, and the US has been beefing up its presence in the region.\nJohn Kirby, the White House national security spokesman, said Iran’s response to the killings “could be this week,” but that “it is difficult to ascertain at this particular time if there’s an attack by Iran or its proxies what it could look like.” He said the US and its allies were preparing for a “significant set of attacks”."}, {"id": "89ad936f-f38d-4b5d-bf96-8f58a1f76f4c", "title": "Israel - Palestine war : US wars Iran attack could come this week", "date": "2024-08-13 05:45", "url": "https://www.watoday.com.au/world/middle-east/us-warns-an-iran-backed-attack-on-israel-could-come-this-week-20240813-p5k1z4.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Washington: US Defence Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, as the US said it believes Iran or its proxies may launch a strike against Israel as soon as this week.\nThe moves, announced by the Defence Department, come as the US and other allies push for Israel and Hamas to achieve a ceasefire agreement that could help calm soaring tensions in the region, following the assassination of Hamas political leader Ismail Haniyeh in Tehran and a senior Hezbollah commander in Beirut.\nA pilot speaks to a crew member on the deck of the USS Abraham Lincoln aircraft carrier in the Arabian Sea.\nCredit: APOfficials have been on the lookout for retaliatory strikes by both Iran and Hezbollah for the killings, and the US has been beefing up its presence in the region.\nJohn Kirby, the White House national security spokesman, said Iran’s response to the killings “could be this week,” but that “it is difficult to ascertain at this particular time if there’s an attack by Iran or its proxies what it could look like.” He said the US and its allies were preparing for a “significant set of attacks”."}, {"id": "1bf391cc-482a-42f8-ad6a-aac9c9c26154", "title": "Israel - Palestine war : US wars Iran attack could come this week", "date": "2024-08-13 03:00", "url": "https://www.brisbanetimes.com.au/world/middle-east/us-warns-an-iran-backed-attack-on-israel-could-come-this-week-20240813-p5k1z4.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Washington: US Defence Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, as the US said it believes Iran or its proxies may launch a strike against Israel as soon as this week.\nThe moves, announced by the Defence Department, come as the US and other allies push for Israel and Hamas to achieve a ceasefire agreement that could help calm soaring tensions in the region, following the assassination of Hamas political leader Ismail Haniyeh in Tehran and a senior Hezbollah commander in Beirut.\nA pilot speaks to a crew member on the deck of the USS Abraham Lincoln aircraft carrier in the Arabian Sea.\nCredit: APOfficials have been on the lookout for retaliatory strikes by both Iran and Hezbollah for the killings, and the US has been beefing up its presence in the region.\nJohn Kirby, the White House national security spokesman, said Iran’s response to the killings “could be this week,” but that “it is difficult to ascertain at this particular time if there’s an attack by Iran or its proxies what it could look like.” He said the US and its allies were preparing for a “significant set of attacks”."}, {"id": "73c33820-01e6-4b7d-80b2-8dd27e8a197f", "title": "  Most Hamas Headquarters Were Found in School : Israeli Soldiers Describe Hama Human Shields Tactics | The Jewish Press - JewishPress . com | Noah Michaeli | 9 Av 5784 – Tuesday , August 13 , 2024", "date": "2024-08-13 10:00", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/most-hamas-headquarters-were-found-in-schools-israeli-soldiers-describe-hamas-human-shields-tactics/2024/08/13/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "“Most of the headquarters of Hamas that we found were in schools, UNRWA clinics, or mosques,” said a reservist named N.“In almost every house there we found weapons and Hamas propaganda materials,” N. stressed.\nBuilt under a childrens school.” In another school, Y. said he and his team found “textbooks explaining how to prepare explosives and mines.\nThe book was a chemistry book, and the examples were all how to make weapons… The schools were like greenhouses for terrorists.\nIsrael struck two Gaza City schools on Thursday used by Hamas for carrying out attacks.\nHamas has also been holding captive two Israeli civilians since 2014 and 2015, and the bodies of two soldiers killed in 2014."}, {"id": "a598130f-4394-42ce-90db-7590d485a9b9", "title": "US sends submarine to Middle East as tensions grow", "date": "2024-08-13 00:45", "url": "https://kahawatungu.com/us-sends-submarine-to-middle-east-as-tensions-grow/", "domain": "kahawatungu.com", "domain_classification": "Unknown", "message": "The US has sent a guided missile submarine to the Middle East, as tensions grow in the region.\nThe Iranians blamed Israel for the assassination of Mr Haniyeh on their soil, and have vowed to punish it.\nIn a statement on Sunday, the Pentagon said Mr Austin had sent the the USS Georgia guided missile submarine to the region.\nMr Smotrich had urged Israel to reject the US push for ceasefire talks, saying it would be a surrender to Hamas.\nMeanwhile the leaders of the UK, France and Germany echoed calls for ceasefire talks to resume."}, {"id": "c45c970b-aab7-45fe-a3e4-32e42b81ce99", "title": "US prepared for possible significant attacks in Middle East by Iran , White House says", "date": "2024-08-13 04:00", "url": "https://dunyanews.tv/en/World/830459-us-prepared-for-possible-significant-attacks-in-middle-east-by-iran-w", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US prepared for possible significant attacks in Middle East by Iran, White House saysWorld World US prepared for possible significant attacks in Middle East by Iran, White House saysDefense Secretary Austin had ordered the deployment of guided missile submarine to the Middle East.\nFollow on Published On: Tue, 13 Aug 2024 07:17:21 PKTWASHINGTON (Reuters) - The US has prepared for what could be significant attacks by Iran or its proxies in the Middle East as soon as this week, White House national security spokesperson John Kirby said on Monday (Aug 12).\n\"We have to be prepared for what could be a significant set of attacks,\" he said.\n\"We obviously don't want to see Israel have to defend itself against another onslaught, like they did in April.\nThe Pentagon said on Sunday that Defense Secretary Lloyd Austin had ordered the deployment of a guided missile submarine to the Middle East and for the Abraham Lincoln carrier strike group to accelerate its deployment to the region."}, {"id": "ebc75085-7ded-488f-ad64-8d4d46c2e7d2", "title": "U . S . beefs up posture in Middle East , warns an Iran - backed attack on Israel could come this week", "date": "2024-08-13 02:30", "url": "https://www.telegraphherald.com/ap/national/article_0c8fc132-58fe-11ef-a18f-030af3147f65.html", "domain": "telegraphherald.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "d42b5d2c-4b24-488b-8ec5-2322cc91cb6d", "title": "US Beefs Up Posture In Middle East , Warns An Iran - Backed Attack On Israel Could Come This Week – 710am KURV", "date": "2024-08-13 01:45", "url": "https://www.kurv.com/us-beefs-up-posture-in-middle-east-warns-an-iran-backed-attack-on-israel-could-come-this-week/", "domain": "kurv.com", "domain_classification": "Unknown", "message": "British Prime Minister Keir Starmer spoke to Pezeshkian and called on him to refrain from carrying out an attack, the Prime Minister’s office said.\nLast week, Austin said the Lincoln would arrive in the Central Command area by the end of the month.\nIt wasn’t clear Sunday what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nRyder also did not say how quickly the USS Georgia guided missile submarine would get to the region.\nHe said Austin and Gallant also discussed Israel’s military operations in Gaza and the importance of mitigating civilian harm."}, {"id": "c42b931f-82d2-485d-92ec-b188eeb415cb", "title": "Amid tensions , US deploys additional military resources to Middle East", "date": "2024-08-13 01:00", "url": "https://www.10news.com/world/israel-at-war/amid-heightened-tensions-us-deploys-additional-military-resources-to-middle-east", "domain": "10news.com", "domain_classification": "Unknown", "message": "For days now, U.S. officials have said they are trying to turn down the temperature in the Middle East amid escalating tensions.\nNow the U.S. is allocating additional military resources in the region.\nU.S. Secretary of Defense Lloyd Austin announced he had deployed the USS Georgia, a guided missile submarine, to the Middle East.\nIt's a notable move, since U.S. military officials don't usually publicize the deployment of those submarines.\nIsraeli officials claim Hamas fighters were hiding in that shelter."}, {"id": "a1a8e6b4-8428-41ba-97ec-d496349e4ea1", "title": "High - wire diplomacy on possible Iran retaliation on Israel draws in world", "date": "2024-08-13 13:15", "url": "https://www.naharnet.com/stories/en/307259-high-wire-diplomacy-on-possible-iran-retaliation-on-israel-draws-in-world", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Iran's threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers on Tuesday into a high-wire act of diplomacy.\nIt could also free the Israeli hostages who remain captive there since Hamas' Oct. 7 attack on southern Israel.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea.\nIran for years has asked for Sukhoi Su-35 fighter jets.\nTehran has also sought Russia's S-400 surface-to-air missile defense system, a possible deterrent for the American-made F-35 fighter jets flown by the U.S. and Israel."}, {"id": "b9aa2338-06d8-4a8a-b0ca-ec25afe72187", "title": "Israel preparing for large - scale attack from Iran as US orders warships to accelerate deployment", "date": "2024-08-13 02:30", "url": "https://news.yahoo.com/news/israel-preparing-large-scale-attack-134014280.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Israel is preparing for a large-scale military attack from Iran, defence minister Yoav Gallant, has told his US counterpart.\nThe Hamas attack killed some 1,200 people, with more than 250 taken into captivity in Gaza, according to Israeli tallies.\nAxios reported that Mr Gallant had told Mr Austin, in a conversation late on Sunday that Iran was preparing for a large-scale military attack on Israel within days.\nLast week, Mr Austin said the Lincoln would arrive in the central command area by the end of the month.\nPalestinian medics said Israeli military strikes on Khan Younis on Monday killed at least 18 people and wounded several."}, {"id": "fe1905c9-dec5-4044-9d45-05439003e161", "title": "Israeli hostage is  killed by his guard and two other women captives seriously injured in separate incidents , Hamas claims", "date": "2024-08-13 08:15", "url": "https://www.dailymail.co.uk/news/article-13738019/Israeli-hostage-killed-guards-two-women-captives-seriously-injured-separate-incidents-Hamas-claims.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Hamas fighters have shot dead one Israeli hostage and wounded two others, the group has declared, in the first public admission it has harmed prisoners taken from Israel on October 7.\nOne male hostage was killed, while two female hostages sustained gunshot wounds and are feared to be in critical condition.\nIn the days following Hamas' ruthless October 7 attacks, there were fears that Israeli hostages would face torture and executions - threats made by the same Hamas spokesperson that yesterday declared one of the hostages had been shot dead.\nMore than 70 Israeli hostages are thought to remain alive, with representatives of Israel, Hamas and international mediators engaged in ongoing ceasefire talks.\nIran and its Lebanese ally Hezbollah have vowed revenge for the killing of the political leader of the Palestinian group Hamas in Tehran, and of a Hezbollah commander in Beirut."}, {"id": "145cca18-9db1-4295-b9d8-849abb614d15", "title": "Zero Hour Escalated 6 . 2 Bugfix Update ! file", "date": "2024-08-13 04:30", "url": "https://www.moddb.com/mods/zero-hour-escalated/downloads/zero-hour-escalated-62-bugfix-update", "domain": "moddb.com", "domain_classification": "Unknown", "message": "I have also added three new units to GLA, and updated some unit models and balancing.\nBased on the feedback I've been getting, I've been able to fix some bugs the AI.\nThe unit only uses the machine gun against infantry, and automatically switches to bombs while attacking vehicles and structures.\nI decided to add these units new units to GLA to match what I've added to the US and China.\nI've added walls based on real life to make their structures look less flimsy."}, {"id": "e9b4baa4-cd75-4a7e-be89-5df9cc2aff23", "title": "UK Starmer urges Iran to refrain from Israel attack", "date": "2024-08-13 11:45", "url": "https://saudigazette.com.sa/article/644795/World/Mena/UKs-Starmer-urges-Iran-to-refrain-from-Israel-attack", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "LONDON — UK Prime Minister Sir Keir Starmer has urged Iran to \"refrain\" from attacking Israel during a phone call with Iran's new president.\nNews of the 30-minute discussion came as the UK issued a joint statement with the US, France, Italy and Germany — urging Iran to end its threats of an attack on Israel.\nThey called on Iran to \"stand down its ongoing threats of a military attack against Israel and discussed the serious consequences for regional security should such an attack take place\".\nFears of a wider conflict in the Middle East have been growing following the recent assassination of senior Hezbollah and Hamas leaders.\nIran blames Israel for the assassination of Hamas leader Ismail Haniyeh on their soil late last month and has vowed to punish it."}, {"id": "3114d7b9-76a6-4d54-9861-5472bfcde50d", "title": "Analysis : High - wire diplomacy on possible Iran retaliation in the Israel - Hamas war draws in world – Winnipeg Free Press", "date": "2024-08-13 12:00", "url": "https://www.winnipegfreepress.com/world/2024/08/13/analysis-high-wire-diplomacy-on-possible-iran-retaliation-in-the-israel-hamas-war-draws-in-world", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Iran’s threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers on Tuesday into a high-wire act of diplomacy.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu’s hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nin Tehran, Iran, Thursday, Aug. 1, 2024.\nIt also has backed efforts mediated by Egypt and Qatar to reach a cease-fire in the wider war.\nChina also has begun criticizing Israel more directly amid the war, rather than following its typical pattern of calling for restraint on all sides."}, {"id": "abeaf723-43f4-4ffc-be25-a3a5b4715f90", "title": "UK Starmer urges Iran to refrain from Israel attack", "date": "2024-08-13 06:15", "url": "https://www.the-star.co.ke/news/world/2024-08-13-uks-starmer-urges-iran-to-refrain-from-israel-attack/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "UK Prime Minister Sir Keir Starmer has urged Iran to \"refrain\" from attacking Israel during a phone call with Iran's new president.\nNews of the 30-minute discussion came as the UK issued a joint statement with the US, France, Italy and Germany - urging Iran to end its threats of an attack on Israel.\nThey called on Iran to \"stand down its ongoing threats of a military attack against Israel and discussed the serious consequences for regional security should such an attack take place\".\nIt had also ordered the USS Abraham Lincoln carrier strike group, which is carrying F-35C fighter jets, to accelerate its journey there.\nIran blames Israel for the assassination of Hamas leader Ismail Haniyeh on their soil late last month and has vowed to punish it."}, {"id": "7edbb7cf-c6a7-4e49-b605-331f0c5bbab0", "title": "White House Warns Of Potential Iranian Attack On Israel Amid Intensifying Gaza Ceasefire Talks", "date": "2024-08-13 01:30", "url": "https://www.newsx.com/world/white-house-warns-of-potential-iranian-attack-on-israel-amid-intensifying-gaza-ceasefire-talks/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "The White House has issued a stark warning about the possibility of a significant Iranian attack on Israel.\nSpeaking to reporters, he noted that the exact timing of any attack remains uncertain but could influence the course of the ceasefire talks.\nPotential attack on IsraelIn line with these concerns, Fox News has reported that Iran and its proxies in the Middle East might launch an attack on Israel within the next 24 hours.\nAs these developments unfold, Israel and the U.S. are making concerted efforts to prepare for a possible Iranian attack, particularly as negotiations to secure a ceasefire in Gaza intensify.\nThe possibility of an Iranian attack looms large as Israel and the U.S. brace for potential military action while pushing hard for a ceasefire in Gaza."}, {"id": "2995355c-ea11-45e0-af8c-49e8ad274d04", "title": "Trump talks about  Iron Dome  in interview with Musk : What does it mean ? ", "date": "2024-08-13 03:45", "url": "https://timesofindia.indiatimes.com/world/us/trump-talks-about-iron-dome-in-interview-with-musk-what-does-it-mean/articleshow/112481456.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "What is Iron Dome?\nWhen and Why Iron Dome was constructed?\nNEW DELHI: Former US president Donald Trump on Monday during his interview with tech giant Elon Musk praised Israel 's defence military system Iron Dome which can destroy short-range weapons.\nAfter a successful run in 2011 US announced to buy and test some Iron Dome batteries.Israel's military says the Iron Dome defence system has a success rate of up to 90 per cent.\nWhile Iron Dome has intercepted many rockets, some have gotten through, hitting populated areas and causing deaths and injuries."}, {"id": "0190811e-0ae4-4a1b-be4c-2f21da2a96ca", "title": "Hezbollah launches rockets on military base in N . Israel", "date": "2024-08-13 03:15", "url": "http://www.china.org.cn/world/2024-08/13/content_117363904.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器Hezbollah launched multiple Katyusha rocket barrages at a military base in northern Israel on Monday morning, in retaliation for Israeli strikes on villages in southern Lebanon the previous day.\nHezbollah media reported that the rockets targeted the \"newly established headquarters\" of the Israel Defense Forces' 146th Division in Gaaton, a town located in Western Galilee, northern Israel.\nThe IDF confirmed that Hezbollah fired around 30 rockets from Lebanon into the Western Galilee on Monday, with many landing in open areas near Kibbutz Kabri.\nLebanese military sources, speaking anonymously, said an Israeli airstrike on the village of Maaroub in southern Lebanon late Sunday injured 12 civilians and destroyed several homes.\nTensions remain high in Lebanon following Israel's attack on Beirut's southern suburbs on July 30, which killed Hezbollah senior military commander Fouad Shokor and seven others."}, {"id": "f95dd3f9-f73b-4e7b-9ccd-4e73e8657464", "title": "Zero Hour Escalated 6 . 2 AI Bugfix and General Update ! news", "date": "2024-08-13 04:30", "url": "https://www.moddb.com/mods/zero-hour-escalated/news/zero-hour-escalated-62-ai-bugfix-and-general-update", "domain": "moddb.com", "domain_classification": "Unknown", "message": "I have also added three new units to GLA, and updated some unit models and balancing.\nPosted by LordOfTadhg on Aug 13th, 2024Based on the feedback I've been getting, I've been able to fix some bugs the AI.\nThe unit only uses the machine gun against infantry, and automatically switches to bombs while attacking vehicles and structures.\nI decided to add these units new units to GLA to match what I've added to the US and China.\nI've added walls based on real life to make their structures look less flimsy."}, {"id": "602aafcd-0e0e-4c3a-a635-c840e37b7922", "title": "Iran dismisses calls from West to  stand down  retaliatory attack threats on Israel", "date": "2024-08-13 08:15", "url": "https://www.thejournal.ie/iran-dismisses-calls-from-west-to-stand-down-6462047-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "IRAN HAS DISMISSED calls by Western allies to “stand down” its threats of a retaliatory attack on Israel, claiming it shows “lack political logic and contradict principles of international law”.\nThe United States and other European allies said Iran must “stand down” its threats that it will launch a retaliatory attack on Israel following the assassination of the political leader of Hamas Ismail Haniyeh last month.\nIn a joint statement from the United States, United Kingdom, France, Germany, and Italy, the allies also expressed their full support for the de-escalation of violence in the Middle East and called for a ceasefire in Gaza.\nThe killings have stoked fears in Israel that Iran will issue a retaliatory attack for the assassination of Haniyeh, which was carried out in their territory, and Israeli citizens have been warned that a missile strike could be imminent.\nIsrael has accepted the latest invitation from the United States, Qatar and Egypt to send negotiators."}, {"id": "3d3898da-5c16-4ceb-984a-5dd5003ce57a", "title": "Hamas armed wing says one Israeli hostage killed , two captives  seriously wounded  ", "date": "2024-08-13 01:00", "url": "https://www.channelnewsasia.com/world/hamas-armed-wing-says-one-israeli-hostage-killed-two-captives-seriously-wounded-4542616", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "GAZA: One Israeli male hostage was killed by his guard and two women captives were seriously wounded in two separate incidents in Gaza, the spokesperson for Hamas' armed al-Qassam Brigades, Abu Ubaida, said on Monday (Aug 12).\nAbu Ubaida blamed the incident on what he described as Israeli \"massacres\" against Palestinians.\nHe said a committee has been formed to investigate, and findings will be announced later, adding efforts are underway to save the two wounded hostages.\nIt was the first time Al-Qassam has said its guards killed hostages.\nThe group has often attributed previous killings of hostages to Israeli bombardment."}, {"id": "baabad7e-3967-43af-801c-f98369a93352", "title": "Amid tensions , US deploys additional military resources to Middle East", "date": "2024-08-13 00:45", "url": "https://www.kjrh.com/world/israel-at-war/amid-heightened-tensions-us-deploys-additional-military-resources-to-middle-east", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "For days now, U.S. officials have said they are trying to turn down the temperature in the Middle East amid escalating tensions.\nNow the U.S. is allocating additional military resources in the region.\nU.S. Secretary of Defense Lloyd Austin announced he had deployed the USS Georgia, a guided missile submarine, to the Middle East.\nIt's a notable move, since U.S. military officials don't usually publicize the deployment of those submarines.\nIsraeli officials claim Hamas fighters were hiding in that shelter."}, {"id": "69e3db02-c361-4d99-ba75-2ee5f574dcd8", "title": "A ship in the Red Sea is targeted in a third attack by suspected Houthis", "date": "2024-08-13 06:45", "url": "https://www.ajc.com/news/nation-world/suspected-attacks-by-yemens-houthi-rebels-target-shipping-in-the-red-sea-officials-say/CXE3TR7MGFEBDHN3M4NUWETHZM/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "609e1c30-0866-489f-b98a-a02ce938cda2", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 02:30", "url": "https://www.yahoo.com/news/suspected-attack-yemens-houthi-rebels-020803696.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "401ccbc4-97da-4f8b-b621-a9492fc07183", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 03:45", "url": "https://www.thehindu.com/news/international/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/article68519039.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "A suspected attack by Yemen’s Houthi rebels targeted a ship in the southern reaches of the Red Sea early Tuesday (August 13, 2024), officials said, the latest in their campaign of assaults over the Israel-Hamas war.\nThe attack saw an explosive detonate near the ship, though “the vessel and crew are reported safe,” the UKMTO said.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning August 8, 2024, likely carried out by the rebels.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "f299ef9f-368c-4d8b-bf42-b578e7e3a792", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 02:45", "url": "https://apnews.com/article/yemen-houthi-rebels-red-sea-attacks-israel-hamas-ca514c95d58b0395dd09b70e76753e3b", "domain": "apnews.com", "domain_classification": "International", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "c726645b-2a5c-428d-8336-f012f2dcbc32", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 02:30", "url": "https://www.ksat.com/news/world/2024/08/13/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "d6a1ddb4-bff0-49e6-8604-89de751fc812", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 04:00", "url": "https://www.stripes.com/theaters/middle_east/2024-08-12/red-sea-ship-attack-14847454.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The ship was first attacked as an explosive was detonated near it, the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthis have targeted more than 70 vessels with missiles and drones since the start of the war in Gaza in October.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "b2e9acc7-64ff-4fb1-9773-6838cd043cb4", "title": "Israel - Hamas War Live : Israel PM , defence minister trade barbs over  aim  of Gaza war", "date": "2024-08-13 02:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-hamas-war-live-hezbollah-benjamin-netanyahu-ismail-haniyeh-al-gaza-school-ahli-al-tabeen/liveblog/112475870.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "23:57 (IST) Aug 12Israel is monitoring developments in Iran regarding a threatened strike against Israel, but the military has not changed its precautionary guidelines to the public, the Israeli military spokesperson said on Monday.\n\"We are following what is going on specifically with Iran, with all our capabilities.\nWe are following with the United States and other partners,\" said spokesperson Rear Admiral Daniel Hagari.\nHagari said that the military has not issued new safety guidelines to public, but if needed would update the Home Front about any changes as quickly as possible.\nAnd therefore, we are at peak preparedness for attack and defense,\" he said in broadcast comments."}, {"id": "2f617eca-0581-4fa9-b080-d2c41df4fa0d", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 04:45", "url": "https://abcnews.go.com/International/wireStory/suspected-attack-yemens-houthi-rebels-targets-ship-southern-112793159", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels."}, {"id": "dc488bdc-dadf-40de-8627-20858bdb93b5", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 04:45", "url": "https://www.news4jax.com/news/world/2024/08/13/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "f86cf6a3-1259-4414-bfb9-166826103cf0", "title": "Beirut Anonymous Billboards Reflect Growing Opposition to Hezbollah | The Jewish Press - JewishPress . com | Baruch Yedid / TPS | 9 Av 5784 – Tuesday , August 13 , 2024", "date": "2024-08-13 10:00", "url": "https://www.jewishpress.com/news/middle-east/lebanon/beiruts-anonymous-billboards-reflect-growing-opposition-to-hezbollah/2024/08/13/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: PixabayAnonymous billboards have recently appeared in Beirut voicing stark opposition to Hezbollah and escalating tensions with Israel.\nBillboards have popped up across Lebanon demanding Hezbollah back down.\nShortly after Hamas attacked Israel on October 7, Hezbollah began launching rockets and drones at northern Israel, drawing Israeli airstrikes, mostly in southern Lebanon.\nClashes Over Vacant ApartmentsOver 100,000 residents of southern Lebanon have fled their homes and the cost of living has skyrocketed.\nIsraeli officials have been calling for Hezbollah to be disarmed and removed from southern Lebanon in accordance with UN Security Council resolution 1701, which ended the 2006 Second Lebanon War."}, {"id": "ec02932c-9abc-401c-acb9-d1b5f5cb146c", "title": "Suspected attacks by Yemen Houthi rebels target shipping in Red Sea", "date": "2024-08-13 07:45", "url": "https://www.orissapost.com/suspected-attacks-by-yemens-houthi-rebels-target-shipping-in-red-sea/", "domain": "orissapost.com", "domain_classification": "Unknown", "message": "Dubai: Suspected attacks by Yemen’s Houthi rebels targeted shipping in the Red Sea Tuesday, officials said, the latest in their campaign of assaults over the Israel-Hamas war.\nThough the Houthis didn’t immediately claim the attack, it sometimes can take hours or even days to acknowledge their assaults.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until August 3, when they hit a Liberian-flagged container ship travelling through the Gulf of Aden.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning August 8 likely carried out by the rebels."}, {"id": "92203047-9e70-435c-8c69-46b51f761e9a", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 03:00", "url": "https://www.kob.com/news/us-and-world-news/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/", "domain": "kob.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels."}, {"id": "95a47341-cc4e-4ff2-8b1b-45b0a8ca6b94", "title": "Middle East talks to defuse tensions over Iran and Israel - Gaza war fuel hope of respite", "date": "2024-08-13 08:45", "url": "https://www.scmp.com/week-asia/politics/article/3274297/middle-east-talks-defuse-tensions-over-iran-and-israel-gaza-war-fuel-hope-respite", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "“It is not too late” to diplomatically avert retaliatory strikes on Israel by Iran, Lebanese Hezbollah and their allies, said Barbara Slavin, distinguished Middle East fellow of the Stimson Centre, a Washington think tank.\nIsrael continues to neither confirm nor deny accusations by Iran that it was involved in the assassination.\nIran’s mission to the United Nations appeared on Friday to signal Tehran’s interest in a diplomatic off-ramp from the escalating tensions in the Middle East.\nBut Israel and Hamas are expected to continue to make life difficult for mediators because neither side wants to end the war in Gaza.\n“I’m working literally every single day to see to it that it doesn’t escalate into a regional war."}, {"id": "8a362042-94b6-4817-b4b4-06f71761738f", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say – Winnipeg Free Press", "date": "2024-08-13 02:45", "url": "https://www.winnipegfreepress.com/world/2024/08/12/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A small ship “flashing lights” at the vessel had come close to the loaded tanker bound for Greece during the incident, the center said.\nA small ship later flashed lights at the Delta Atlantica before another explosion near it, the center said.\nHowever, many of the ships attacked have little or no connection to the conflict, including some bound for Iran.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8 likely carried out by the rebels.\nThat tanker, the Delta Blue, is managed by the same firm as the Delta Atlantica."}, {"id": "82b51e21-3628-415e-b1e7-8262c1eb1a79", "title": "Things Just Got Even More  Interesting  In The Middle East And In Ukraine", "date": "2024-08-13 04:45", "url": "http://theeconomiccollapseblog.com/things-just-got-even-more-interesting-in-the-middle-east-and-in-ukraine/", "domain": "theeconomiccollapseblog.com", "domain_classification": "Unknown", "message": "While millions in the western world are partying, an apocalyptic all-out war is threatening to erupt in the Middle East and Ukraine has launched a surprise invasion of Russia.\nNeedless to say, seeing Ukrainian troops come pouring across Russia’s lightly defended border in the Kursk region came as quite a shock to Vladimir Putin and his generals.\nThe Ukrainians have decided to take things to the next level, and the Russians are beyond angry.\nThe Ukrainian attack took Russian forces by surprise, according to one U.S. official who was not authorized to speak publicly.\nThe coming all-out war in the Middle East is another one."}, {"id": "b5985d8b-385b-4560-a5a7-0e9381916a00", "title": "White House says potential Iran retaliation against Israel could come this week", "date": "2024-08-13 01:00", "url": "https://www.cbsnews.com/news/white-house-says-potential-iran-hezbollah-israel-attack-this-week/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Israel to join cease-fire talks as it braces for possible attacksThe Biden administration is preparing for a potential attack on Israel by Iran and its proxies as soon as this week, in retaliation for the recent assassinations of top leaders of Hamas and Hezbollah.\nU.S. officials told CBS News that a limited attack from both Hezbollah and Iran could come with little to no warning.\nIran has made enough preparations to launch a limited attack with a little warning, potentially coordinated with a Hezbollah offensive.\nThe administration has been bracing for an attack ever since Iran publicly blamed Israel for back-to-back assassinations of top leaders of Hamas and Hezbollah at the end of July.\nHezbollah, according to the CIA World Factbook, has an estimated 150,000 rockets and missiles it could use against Israel while Israel is still fighting a war against Hamas in Gaza."}, {"id": "4b9deaf0-6a1a-416e-a64b-8c0ee5732904", "title": "US prepared for possible significant attacks in Middle East by Iran", "date": "2024-08-13 11:30", "url": "https://cde.news/us-prepared-for-possible-significant-attacks-in-middle-east-by-iran/", "domain": "cde.news", "domain_classification": "Unknown", "message": "Reading Time: 3 minutesThe U.S. has prepared for what could be significant attacks by Iran or its proxies in the Middle East as soon as this week, White House national security spokesperson John Kirby said on Monday.\nCould be this week,” Kirby told reporters.\nBut a U.S. official told Reuters the Lincoln carrier strike group was currently close to the South China Sea and would likely take over a week to reach the Middle East.\nThe US has sent a guided missile submarine to the Middle East, as tensions grow in the region.\nIt had also ordered the USS Abraham Lincoln carrier strike group, which is carrying F-35C fighter jets, to accelerate its journey there."}, {"id": "9019b4ec-97d7-4f3b-859e-0bbe8fd7670d", "title": "Key BLF terrorist slain by fellow comrade amid growing internal discord", "date": "2024-08-13 09:45", "url": "https://tribune.com.pk/story/2487700/key-blf-terrorist-slain-by-fellow-comrade-amid-growing-internal-discord", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "The incident highlights growing internal discord within the BLF, a terrorist group allegedly funded by India.\nThe BLF, along with other India-funded terrorist organisations, is said to be embroiled in an escalating power struggle over funding and authority.\nHis direct involvement in numerous attacks on security forces in Balochistan had made him one of the most notorious figures within the BLF.\nThe internal conflicts within the BLF, as well as among other terrorist groups receiving external support, are believed to be intensifying, further destabilizing their operations.\nIran claimed the strikes were aimed at two ‘terrorist bases’ of Jaish-al Adl, a terrorist group operating from Iran’s Sistan-Baluchistan province"}, {"id": "72a26be5-bc35-4fbd-b752-0acf8006672e", "title": "UN chief condemns continued loss of life following deadly Israeli strike on Gaza school", "date": "2024-08-13 01:30", "url": "http://en.people.cn/n3/2024/0813/c90000-20205075.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "UN chief condemns continued loss of life following deadly Israeli strike on Gaza schoolXinhua) 08:35, August 13, 2024People mourn victims killed in an Israeli airstrike at a school serving as shelters for displaced people in Al-Daraj neighborhood in Gaza City, Aug. 10, 2024.\nUNITED NATIONS, Aug. 12 (Xinhua) -- UN Secretary-General Antonio Guterres on Monday condemned the continued loss of life in Gaza, following a devastating strike by Israel on the Al-Taba'een school in Gaza City on Saturday killing over 100 Palestinians.\n\"The secretary-general condemns the continued loss of life in Gaza, including women and children, as we witness yet another devastating strike by Israel on the Al-Taba'een school in Gaza City, sheltering hundreds of displaced Palestinian families, with scores of fatalities, amidst continued horror, displacement, and suffering in Gaza,\" said Farhan Haq, the deputy spokesperson for the UN secretary-general.\nGuterres was dismayed to see that the provisions of UN Security Council resolution 2735 remain unimplemented, Haq said.\nMore than 100 Palestinians were killed and dozens of others were injured in an Israeli bombing of the Al-Taba'een school in central Gaza City early Saturday, Palestinian medical and security sources said."}, {"id": "35aa9493-27f4-4c7f-8668-4865d695d48c", "title": "British PM expresses  deep concern  over situation in Middle East", "date": "2024-08-13 12:45", "url": "https://www.albawaba.com/news/british-pm-expresses-deep-concern-over-1581272", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "LONDONBritish Prime Minister Keir Starmer expressed deep concern Monday over the situation in the Middle East in talks with Iranian President Masoud Pezeshkian, emphasizing de-escalation.\nDuring a phone call, Starmer urged all parties to de-escalate and avoid further regional confrontation, the Prime Minister's Office said in a statement.\nThe two leaders agreed that a constructive dialogue between the UK and Iran was in both countries’ interests, noted the statement.\nIn a joint statement Monday, the US, the UK, France, Germany and Italy called for de-escalation in the Middle East, expressing support for Israel against possible Iranian retaliation.\nHamas and Iran have accused Israel of carrying out Haniyeh’s assassination, while Tel Aviv has not confirmed or denied responsibility."}, {"id": "593830ab-ab96-4c8a-bf80-2b834a85f328", "title": "Gaza Death Toll Surges Amid Ongoing Israeli Genocide – Al - Manar TV Lebanon", "date": "2024-08-13 13:15", "url": "https://english.almanar.com.lb/2175076", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Seven civilians were martyred today in a devastating Israeli airstrike on a house in al-Bureij camp in the central Gaza Strip.\nEarlier in the day, at least four civilians, including two children, lost their lives in another bombing by Israeli occupation forces on Deir al-Balah.\nPart of the sorrowful funeral processions of Palestinians killed in Israeli occupation’s violent attacks on Khan Younis, southern Gaza Strip.\npic.twitter.com/5R7ITfYXiO — PALESTINE ONLINE 🇵🇸 (@OnlinePalEng) August 13, 2024Gaza Health ministry says in a statement that 39,929 people have been killed and 92,240 wounded by Israeli attacks since October 7.\npic.twitter.com/6v4AxHoTF7 — PALESTINE ONLINE 🇵🇸 (@OnlinePalEng) August 13, 2024Source: Al-Manar English Website and Palestinian media"}, {"id": "cef2b866-e55b-48b0-ac75-b7311c2475e5", "title": "Trump tells Musk  illegal immigration saved his life  in assassination attempt after ... ", "date": "2024-08-13 05:30", "url": "https://www.lbc.co.uk/news/donald-trump-elon-musk-interview-delayed-assassination-attempt-not-pleasant/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Trump tells Musk 'illegal immigration saved his life' in assassination attempt after 'cyber attack' delays interviewDonald Trump and Elon Musk spoke in an interview on X.\nPicture: AlamyBy Emma SoteriouDonald Trump opened up about the assassination attempt against him during an interview with businessman Elon Musk on Tuesday.\nTrump told Musk the experience was \"not pleasant\", adding that his first question was \"how many people have been killed?\"\nOnce the technical issues were resolved, Musk first addressed the assassination attempt with Trump.\nThe interview between Musk and Trump was unavailable for 40 minutes."}, {"id": "6606c4bc-c31a-4f97-aa54-d2c113c065ab", "title": "Western powers urge Mideast de - escalation , support Israel against Iran", "date": "2024-08-13 10:00", "url": "https://tribune.com.pk/story/2487741/western-powers-urge-mideast-de-escalation-support-israel-against-iran", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Five Western powers on Monday called for de-escalation in the Middle East while also voicing support for Israel against possible Iranian retaliation.\n“We expressed our support for the defense of Israel against Iranian aggression and against attacks by Iran-backed terrorist groups,” the statement also said.\nThey urged Iran to stand down its ongoing threats of a military attack against Israel, warning that such an attack would have serious consequences for regional stability.\nHamas and Iran have accused Israel of carrying out last month’s assassination in Tehran of Hamas political chief Ismail Haniyeh and vowed retaliation.\nLebanese Hezbollah is also expected to retaliate after Israel assassinated senior commander Fuad Shukr in an airstrike on a southern suburb of Beirut on July 30."}, {"id": "7dd662df-112a-4745-a3b0-85685271b459", "title": "Iran rejects Western calls to stand down Israel threat", "date": "2024-08-13 10:00", "url": "https://punchng.com/iran-rejects-western-calls-to-stand-down-israel-threat/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Iran on Tuesday rejected Western calls to stand down its threat to retaliate against Israel for the killing of Hamas political leader Ismail Haniyeh in Tehran late last month.\nIn a statement on Monday, the United States and its European allies urged Iran to de-escalate.\nThe United States has deployed an aircraft carrier strike group and a guided missile submarine to the region in support of Israel.\nInternational mediators have invited Israel and Hamas to resume negotiations this week on a ceasefire and hostage release deal, an invitation Israel has accepted.\nAnalyst Esfandyar Batmanghelidj said Iran was considering how to retaliate against Israel without derailing the ceasefire talks."}, {"id": "9e68e133-5c85-499b-97c4-1d3902efd78e", "title": "US warns about  significant set  of anti - Israeli retaliatory attacks by Iran , resistance front", "date": "2024-08-13 02:45", "url": "https://www.presstv.ir/Detail/2024/08/12/731256/United-States-warning-Iran-resistance-retaliation-Israel-Haniyeh-Shukr", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The US has warned that Iran and the regional resistance movements could launch “a significant set of attacks” against the Israeli regime in retaliation for the latter’s assassination of senior resistance figures last month.\nThe retaliation could come as early as “this week,” White House National Security Council spokesman John Kirby said on Monday.\nTel Aviv has denied responsibility for the atrocity, but the Islamic Republic has held it squarely responsible and vowed to serve it with a harsh response.\nResistance movements from Iraq and Yemen have also sternly vowed to join Iran and Hezbollah in avenging the blood of Haniyeh and Shukr.\nThe strike group will join aircraft carrier Theodore Roosevelt and its accompanying warships, which have already been deployed to the Gulf of Oman."}, {"id": "027a23b7-6039-4a92-ba61-7c3a4d5d51b7", "title": "  I Knew Immediately That It Was A Bullet : Donald Trump Recalls Assassination Attempt In Conversation With Elon Musk", "date": "2024-08-13 03:45", "url": "https://www.freepressjournal.in/world/i-knew-immediately-that-it-was-a-bullet-donald-trump-recalls-assassination-attempt-in-conversation-with-elon-musk", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "\", Trump responded to it, saying that the shooting was \"not pleasant\" and it was a very hard hit.\nHours after the shooting, Trump said that the bullet pierced the upper part of his right ear.\nIt is pertinent to note that Musk started the live stream conversation on X with Trump at 8:42 p.m.\n\"As this massive attack illustrates, there's a lot of opposition to people just hearing what President Trump has to say,\" he said.\nThe users on social media platform X faced numerous issues while looking for access to the livestream conversation of Elon Musk with Trump on the platform Monday night."}, {"id": "4f459b27-d3c0-4cd7-825e-33241f9baa84", "title": "Iran rejects Western calls to stand down Israel threat", "date": "2024-08-13 11:15", "url": "https://www.al-monitor.com/originals/2024/08/iran-rejects-western-calls-stand-down-israel-threat", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Iran on Tuesday rejected Western calls to stand down its threat to retaliate against Israel for the killing of Hamas political leader Ismail Haniyeh in Tehran late last month.\nIran has vowed to avenge the death, which came hours after an Israeli strike in Beirut killed a senior commander of Hezbollah, the powerful Iran-backed militant group in Lebanon.\nThe United States has deployed an aircraft carrier strike group and a guided missile submarine to the region in support of Israel.\nInternational mediators have invited Israel and Hamas to resume negotiations this week on a ceasefire and hostage release deal, an invitation Israel has accepted.\nAnalyst Esfandyar Batmanghelidj said Iran was considering how to retaliate against Israel without derailing the ceasefire talks."}, {"id": "17e9b6a7-8efa-403a-83f6-85da900818fa", "title": "US Military Races to Middle East to Defend Israel", "date": "2024-08-13 01:00", "url": "https://www.dailysignal.com/2024/08/12/defense-secretary-orders-warships-heading-toward-middle-east-to-sail-faster-as-iran-threats-intensify/", "domain": "dailysignal.com", "domain_classification": "Unknown", "message": "military forces are shoring up in the Middle East in anticipation of an Iranian-led attack against Israel, the Pentagon confirmed on Sunday evening.\nDefense Secretary Lloyd Austin ordered the USS Abraham Lincoln Carrier Strike Group to “accelerate its transit” to the Middle East, Ryder said.\nThe strike group, including an aircraft carrier, naval destroyers, and fighter jets, will join the USS Theodore Roosevelt Carrier Strike Group, which is equipped with similar capabilities and already located in the region.\nAbraham Lincoln Carrier Strike Group has heard the call!\n#BlueGreenTeam pic.twitter.com/dYZKnu53rf — USS Abraham Lincoln (@CVN_72) August 12, 2024Austin also directed the USS Georgia, a nuclear-powered submarine armed with cruise missiles, to join U.S. forces in the Middle East, according to Ryder."}, {"id": "8aa25173-f8ab-4e38-9e82-7ff5fcbc7663", "title": "Iran rejects Western calls to stand down Israel threat", "date": "2024-08-13 10:00", "url": "https://timesofmalta.com/article/iran-rejects-western-calls-stand-israel-threat.1096676", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "Iran on Tuesday rejected Western calls to stand down its threat to retaliate against Israel for the killing of Hamas political leader Ismail Haniyeh in Tehran late last month.\nIn a statement on Monday, the United States and its European allies urged Iran to de-escalate.\nThe United States has deployed an aircraft carrier strike group and a guided missile submarine to the region in support of Israel.\nInternational mediators have invited Israel and Hamas to resume negotiations this week on a ceasefire and hostage release deal, an invitation Israel has accepted.\nAnalyst Esfandyar Batmanghelidj said Iran was considering how to retaliate against Israel without derailing the ceasefire talks."}, {"id": "2468e049-fb04-4295-8519-57d8b343d47e", "title": "Al - Qassam Brigades claim responsibility for Jordan Valley operation", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-irna10.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Al-Qassam Brigades claim responsibility for Jordan Valley operationIRNA - Islamic Republic News AgencyAug 12, 2024Tehran, IRNA -- The Izz al-Din Al-Qassam Brigades, Hamas' military wing, have claimed responsibility for the shooting attack in the Jordan Valley in the northern West Bank, which left a Zionist trooper killed.\nAccording to the Palestinian Shehab news agency, the Al-Qassam Brigades stressed that its fighters succeeded in carrying out a shooting operation at close range on Sunday afternoon (August 11), targeting the car of 23-year-old Yonatan Deutsch near the Zionist settlement of Mehola in the Jordan Valley.\nAl-Qassam Brigades announced that it takes responsibility for the operation, stressing that it avenged the blood of Palestinian martyrs in response to the crime of bombing the Al-Tabin School in Gaza.\nAl-Qassam also stressed that its fighters in the West Bank, who once again pledged allegiance to Yahya al-Sinwar, the new head of Hamas' Political Bureau, continue to take up arms and pursue the occupying enemy everywhere until they are finally expelled from this land and its holy sites.\nOn Sunday, Israeli sources reported a shooting operation at a car carrying several settlers in the Jordan Valley in the West Bank, in which one Zionist was killed and another was wounded."}, {"id": "e65fbe33-3d9c-4bd1-a83d-a56106cb3c97", "title": "Ashlee Good : Family of mum who saved baby in Bondi attack speaks", "date": "2024-08-13 02:45", "url": "https://www.bbc.co.uk/news/articles/c1l5v8r804mo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The partner of a mother killed while saving her baby from a stabbing rampage in a busy Sydney shopping centre has spoken out for the first time, saying the day she died will \"never make sense\".\nAshlee Good, 38, was among six people killed by Joel Cauchi at Westfield Bondi Junction on 13 April.\nHer daughter Harriet, who was nine months old at the time of the attack, was also injured.\nAustralian authorities say the stabbing was \"mental health\" related, but they believe Cauchi targeted women.\nThanking those who had sent donations, Good's partner Dan Flanagan said \"the overwhelming support, kindness and generosity\" his family had received has given them \"strength\"."}, {"id": "857807a5-9c77-4ea0-aad0-8979f48e07dc", "title": "Ashlee Good : Family of mum who saved baby in Bondi attack speaks", "date": "2024-08-13 01:30", "url": "https://www.bbc.com/news/articles/c1l5v8r804mo", "domain": "bbc.com", "domain_classification": "International", "message": "Ashlee Good, 38, was among six people killed by Joel Cauchi at Westfield Bondi Junction on 13 April.\nHer daughter Harriet, who was nine months old at the time of the attack, was also injured.\nThanking those who had sent donations, Good's partner Dan Flanagan said \"the overwhelming support, kindness and generosity\" his family had received has given them \"strength\".\nMass killings are rare in Australia, and the attack - at one of the country's biggest and most popular shopping centres - stunned the world.\nHorrified witnesses have described how Good fled into a nearby store, desperately seeking help for her injured baby girl."}, {"id": "f2e66392-dd02-4216-b997-4413909b8a4a", "title": "Russian attacks against Ukraine kill 5 , injure 25 over past day", "date": "2024-08-13 07:00", "url": "https://www.yahoo.com/news/russian-attacks-against-ukraine-kill-063718003.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian attacks across Ukraine over the past day killed at least five civilians and injured at least 25, including children, regional authorities reported early on Aug. 13.\nIn Donetsk Oblast, Russian attacks killed four civilians and injured four others, Governor Vadym Filashkin said.\nRussian attacks against Kharkiv Oblast injured three people, Governor Oleh Syniehubov reported.\nRussian attacks against Kherson Oblast killed one person and injured at least 17, including two children, according to Governor Oleksandr Prokudin.\nRead also: Ukraine controls around 1,000 square km in Russia’s Kursk Oblast, Syrskyi saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "6789f1e4-52db-4f12-a1a7-c2d31311109d", "title": "Israeli Defense Minister Told Pentagon Chief Iran Preparing Large - Scale Attack", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-sputnik02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli Defense Minister Told Pentagon Chief Iran Preparing Large-Scale Attack - ReportsSputnik News20240812MOSCOW (Sputnik) - Israeli Defense Minister Yoav Gallant told US Defense Secretary Lloyd Austin that Iran was preparing for a large-scale attack on Israel, the Axios news portal reported, citing a source.\nThe movement blamed Israel and the United States for Haniyeh's death and said the attack would not go unanswered.\nIsraeli officials said they would not comment on Haniyeh's murder.\nThe United States was not involved in the death of the Hamas politburo chief, US Deputy Ambassador to the UN Robert Wood said later.\nOn the evening of July 31, the New York Times claimed, citing sources, hat Iran's Supreme Leader Ali Khamenei had ordered a direct strike on Israel in response to Haniyeh's murder in Tehran."}, {"id": "01894a4d-83ff-496c-a700-2f95fe4f91bb", "title": "  It was a hard hit : Donald Trump recalls assassination attempt in conversation with Elon Musk", "date": "2024-08-13 08:30", "url": "https://www.businessinsider.in/international/news/it-was-a-hard-hit-donald-trump-recalls-assassination-attempt-in-conversation-with-elon-musk/articleshow/112481669.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Washington: In a conversation with the billionaire CEO and entrepreneur Elon Musk , former US President Donald Trump opened up on the recent ' assassination attempt ', which he described as a 'hard hit', and said that it was a surreal situation.\n\", Trump responded to it, saying that the shooting was \"not pleasant\" and it was a very hard hit.\nHours after the shooting, Trump said that the bullet pierced the upper part of his right ear.\nIt is pertinent to note that Musk started the live stream conversation on X with Trump at 8:42 p.m.\n\"As this massive attack illustrates, there's a lot of opposition to people just hearing what President Trump has to say,\" he said."}, {"id": "c0228721-6df9-4d41-8d52-d0adcc9f0b3d", "title": "  It was a hard hit : Donald Trump recalls assassination attempt in conversation with Elon Musk", "date": "2024-08-13 03:00", "url": "https://news.webindia123.com/news/Articles/World/20240813/4224635.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "In a conversation with the billionaire CEO and entrepreneur Elon Musk, former US President Donald Trump opened up on the recent 'assassination attempt', which he described as a 'hard hit', and said that it was a surreal situation.\nIt was very, I guess you would say, surreal, but it wasn't surreal.\nIt is pertinent to note that Musk started the live stream conversation on X with Trump at 8:42 p.m.\n\"As this massive attack illustrates, there's a lot of opposition to people just hearing what President Trump has to say,\" he said.\nEarlier, Elon Musk announced that a massive DDoS attack hit his livestream with former US President Donald Trump, forcing X owner to scale down the live audience."}, {"id": "a7b2041d-91de-4fae-b752-91c7f7351fce", "title": "CPJ calls for protection of Al Jazeera Anas Al - Sharif in Gaza", "date": "2024-08-13 12:45", "url": "https://dohanews.co/cpj-calls-for-protection-of-al-jazeeras-anas-al-sharif-in-gaza/", "domain": "dohanews.co", "domain_classification": "Unknown", "message": "CPJ said it has documented the killing of at least seven journalists and media workers affiliated with Al Jazeera.\nThe Committee to Protect Journalists (CPJ) has called for the protection of Al Jazeera correspondent in northern Gaza Anas Al-Sharif following an incitement campaign by Israel as part of a wider targeting of the broadcaster.\n“Al Jazeera journalists have been paying a devastating price for documenting the war.\nCPJ said it has documented the killing of at least seven journalists and media workers affiliated with Al Jazeera.\nIsrael killed Al Jazeera’s cameraman Samer Abu Daqqa and severely injured the network’s journalist and Gaza bureau chief Wael Dahdouh in a missile strike on December 15 in Khan Younis."}, {"id": "8d276233-32dd-4280-92f2-fcede9035dae", "title": "  It was a hard hit , Trump recalls assassination attempt in conversation with Musk", "date": "2024-08-13 07:15", "url": "https://www.siasat.com/it-was-a-hard-hit-trump-recalls-assassination-attempt-in-conversation-with-musk-3078157/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Washington: In a conversation with the billionaire CEO and entrepreneur Elon Musk, former US President Donald Trump opened up on the recent ‘assassination attempt’, which he described as a ‘hard hit’, and said that it was a surreal situation.\nI knew immediately that it was a bullet,” Trump said of the moment when he said the bullet hit his ear,” the former US President told Musk in a conversation on X.\nIt is pertinent to note that Musk started the live stream conversation on X with Trump at 8:42 p.m.\n“As this massive attack illustrates, there’s a lot of opposition to people just hearing what President Trump has to say,” he said.\nEarlier, Elon Musk announced that a massive DDoS attack hit his livestream with former US President Donald Trump, forcing X owner to scale down the live audience."}, {"id": "9b1ee6a0-e821-416c-9c6a-73c4f339c2e8", "title": "More US vessels sent to Mideast | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-13 13:00", "url": "https://www.arkansasonline.com/news/2024/aug/13/more-us-vessels-sent-to-mideast/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "TEL AVIV -- The United States has deployed more vessels to the eastern Mediterranean Sea, including a submarine and several destroyers, as concerns grow in the region about a potential Iranian attack on Israel.\nThe destroyers USS Roosevelt and USS Bulkeley and a three-ship amphibious task force that includes the USS Wasp, the USS Oak Hill and the USS New York are already in the region.\nIran has blamed Israel for the assassination last month of Hamas' political leader Ismail Haniyeh and is promising revenge.\nIsrael has not commented on the killing but told U.S. officials immediately afterward that it was responsible.\nIsraeli officials fear Iran could coordinate its attack with Hezbollah, which has vowed its own retaliation for Israel's killing last month of Fuad Shakur, a top commander."}, {"id": "53504ac8-3423-410e-a3e4-752841178a63", "title": "UN Chief Condemns Continued Loss Of Life Following Deadly Israeli Strike On Gaza School", "date": "2024-08-13 04:45", "url": "https://menafn.com/1108547375/UN-Chief-Condemns-Continued-Loss-Of-Life-Following-Deadly-Israeli-Strike-On-Gaza-School", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) UNITED NATIONS, Aug 13 (NNN-XINHUA) – UN Secretary-General, Antonio Guterres, yesterday, condemned the continued loss of life in Gaza, following a devastating strike by Israel on the Al-Taba'een school in Gaza City on Saturday, killing over 100 Palestinians.\n“The secretary-general condemns the continued loss of life in Gaza, including women and children, as we witness yet another devastating strike by Israel on the Al-Taba'een school in Gaza City, sheltering hundreds of displaced Palestinian families, with scores of fatalities, amidst continued horror, displacement, and suffering in Gaza,” said Farhan Haq, the deputy spokesperson for the UN secretary-general.\nGuterres was dismayed to see that the provisions of UN Security Council resolution 2735 remain unimplemented, Haq said.\nGuterres also underlined that, international humanitarian law, including the principles of distinction, proportionality, and precautions in attack, must be upheld at all times, said Haq.\nMore than 100 Palestinians were killed and dozens of others were injured, in an Israeli bombing of the Al-Taba'een school in central Gaza City early Saturday, Palestinian medical and security sources said.– NNN-XINHUA"}, {"id": "68a4d679-2360-47c8-9b8b-15dbbaeff9ed", "title": "U . S . sends guided missile submarine to Middle East in fears of Iran retaliation against Israel", "date": "2024-08-13 11:30", "url": "http://www.foxradiook.com/2024/08/13/u-s-sends-guided-missile-submarine-to-middle-east-in-fears-of-irans-retaliation-against-israel/", "domain": "foxradiook.com", "domain_classification": "Unknown", "message": "The moves came amid mounting fears that Iran might soon respond to the assassination of Hamas’ political leader, Ismail Haniyeh, who was killed in Tehran last month after attending the inauguration ceremony for Iranian President Masoud Pezeshkian.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter it is widely believed to have carried out the assassination.\nAs Israel braces for retaliatory attacks from Iran and its proxies after the assassination of senior members of Hamas and Hezbollah, Israel Defense Forces spokesman Rear Adm. Daniel Hagari said in a statement Monday: “We’re following Hezbollah and Iran and ready.\nThe joint statement read: “They will bear responsibility for actions that jeopardize this opportunity for peace and stability.\nNo country or nation stands to gain from a further escalation in the Middle East.”Iran’s Supreme Leader Ayatollah Ali Khamenei vowed “severe punishment” for the assassination, but it remains unclear exactly how Iran plans to retaliate."}, {"id": "a859c892-af73-435d-ba46-e3fa66432df2", "title": "U . S . Navy Rushes To Further Bolster Presence In Middle East", "date": "2024-08-13 01:15", "url": "https://www.yahoo.com/news/u-navy-rushes-further-bolster-000615616.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An F-35C aboard the USS Abraham Lincoln.\nEarlier this month, the Department of Defense had said that the USS Abraham Lincoln was headed from the Pacific to the Middle East for a scheduled deployment to replace the USS Theodore Roosevelt.\nThe Pentagon now says that the Abraham Lincoln will provide additional capability, with the Theodore Roosevelt remaining in the Middle East.\nOn Aug. 2, USS Abraham Lincoln has been ordered to *replace* USS Theodore Roosevelt.\nOther U.S. Navy warships are headed to the Middle East, including the Arleigh Burke class destroyer USS Laboon, which has moved into the eastern Mediterranean Sea after transiting the Suez Canal from the Red Sea."}, {"id": "e79f974d-6440-4755-9568-299a9021dc8a", "title": "West tells Iran to  stand down  Israel attack threats", "date": "2024-08-13 02:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380467.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The United States and European allies called on Iran to \"stand down\" Monday, as fears mounted of an imminent attack on Israel that could spark an all-out war in the Middle East.\n\"We called on Iran to stand down its ongoing threats of a military attack against Israel and discussed the serious consequences for regional security should such an attack take place,\" they said after speaking on Monday.\nHamas political chief Ismail Haniyeh had been in Tehran for the new Iranian president's inauguration last month when Haniyeh was killed in an attack that Iran has blamed on Israel.\nPalestinian group Islamic Jihad, which has been fighting alongside Hamas in Gaza, said its fighters were battling Israeli troops in Khan Yunis.\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 the military says are dead."}, {"id": "5ad7f382-1c63-4fed-94cd-e253babe2486", "title": "  Biden dropping off a coup : What Trump told Musk during X interview marred by tech issues", "date": "2024-08-13 05:45", "url": "https://www.theweek.in/news/world/2024/08/13/biden-dropping-off-ticket-a-coup-what-trump-told-musk-during-x-interview-marred-by-tech-issues.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "The much-awaited Donald Trump-Elon Musk interview got off on a rocky start after tech issues delayed it for about 40 minutes.\nInterestingly, Trump had then mocked the delayed launch, posting on his social media Truth social: \"The DeSantus TWITTER launch is a DISASTER!\nWhen the interview finally began, the duo spent the first 20 minutes discussing the assassination attempt on Trump at a July rally in Butler, Pennsylvania.\n\"She hasn't done an interview since this whole scam started,\" Trump said, adding that Biden dropping off the ticket was a coup.\nThey’re coming from the Congo and 22 people came in from the Congo recently, and they’re murderers,\" Trump said."}, {"id": "71e8811c-fd12-4669-ac5a-9b34c24376d2", "title": "  Youre the greatest cutter : Trump praises Musk handling of worker strikes and layoffs", "date": "2024-08-13 03:45", "url": "https://timesofindia.indiatimes.com/world/us/youre-the-greatest-cutter-trump-praises-musks-handling-of-worker-strikes-and-layoffs/articleshow/112482200.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Republican presidential candidate Donald Trump praised billionaire entrepreneur Elon Musk for his approach to handling workforce reductions during an interview on Musk's social media platform, X, on Monday evening.During the conversation, Trump expressed admiration for Musk's decisive management style, especially in dealing with strikes and layoffs.\nHe commented, \"You're the greatest cutter.I mean, I look at what you do.\nAnd you say: 'That's okay, you’re all gone.\nHe posted a series of messages on the platform, which had been a primary communication tool during his previous campaigns and presidency.\nTrump's account, @realDonaldTrump, was restored a month after Musk acquired X."}, {"id": "94a30633-af0e-4f4b-8731-2c5a36baec0d", "title": "US Warns Of  Significant  Iran Attack On Israel This Week , Rushes Nuclear Submarine , F - 35s To The Middle - East | World News", "date": "2024-08-13 02:15", "url": "https://zeenews.india.com/world/us-warns-of-significant-iran-attack-on-israel-this-week-rushes-nuclear-submarine-f-35s-to-the-middle-east-2777322.html", "domain": "zeenews.india.com", "domain_classification": "Unknown", "message": "It could be this week,\" Kirby informed reporters, as reported by The Times of Israel.\nOn Monday, a joint statement by US President Biden and the leaders of the UK, France, Germany, and Italy urged Iran to cease its ongoing threats of a military attack against Israel.\nThey backed the joint initiative by President Biden, President Sisi of Egypt, and Amir Tamim of Qatar to resume talks later this week.\nAfter the Hamas political leader Ismail Haniyeh was killed in Tehran last month, which resulted in promises of \"punishment\" from Iran, Israel is preparing for a strong retaliation.\nFuad Shukr, the \"most senior Hezbollah military commander,\" was killed in the Israeli strike, the IDF had said in a statement."}, {"id": "b4fa1a1a-a6b8-4f68-9876-01b66acb063f", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 03:00", "url": "https://www.bostonglobe.com/2024/08/12/world/suspected-attack-by-yemens-houthi-rebels-targets-ship-southern-red-sea-officials-say/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The ship was first attacked as an explosive was detonated near it, the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthis have targeted more than 70 vessels with missiles and drones since the start of the war in Gaza in October.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "cd9bdf99-d88d-45d8-b7e2-4e2202fd1f03", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 02:30", "url": "https://www.ajc.com/news/nation-world/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/CXE3TR7MGFEBDHN3M4NUWETHZM/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "b9140dc4-4239-40fb-8d66-46b64eb7f44b", "title": "Suspected attack by Yemen Houthi rebels targets ship in southern Red Sea , officials say", "date": "2024-08-13 02:30", "url": "https://www.ajc.com/news/nation-world/suspected-attack-by-yemens-houthi-rebels-targets-ship-in-southern-red-sea-officials-say/7QQMFXXBHFAB7N5EYU45FBRN2E/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "2503c510-4b33-4d68-a017-efe3061fcc4d", "title": "China Supports Iran Efforts to Ensure Regional Peace , Stability", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240812-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "China Supports Iran's Efforts to Ensure Regional Peace, Stability - Foreign MinisterSputnik News20240812BEIJING (Sputnik) - Beijing supports Tehran's efforts to ensure regional peace and stability and is ready to maintain close contacts with Iran, Chinese Foreign Minister Wang Yi said on Monday in a phone conversation with Iranian Acting Foreign Minister Ali Bagheri Kani.\n\"China supports Iran in defending its sovereignty, security and national dignity in line with the law, as well as its efforts in maintaining regional peace and stability, and is ready to keep in close touch with the Iranian party,\" Wang said, as quoted by the Chinese Foreign Ministry in a statement.\nOn October 7, 2023, Israel was subjected to an unprecedented rocket attack from the Hamas-governed Gaza Strip.\nThe Israel Defense Forces launched Operation Iron Swords in the Gaza Strip with the declared goal of destroying Hamas and freeing the hostages.\nThe death toll from Israeli strikes on the Gaza Strip since October 7 has exceeded 39,790, according to the enclave's health ministry."}, {"id": "5c72d64f-4f55-470c-8d57-5db9eee3dd7e", "title": "US lifts restrictions on Saudi weapons , with eye on resolving Gaza", "date": "2024-08-13 04:00", "url": "https://dunyanews.tv/en/World/830457-us-lifts-restrictions-on-saudi-weapons-with-eye-on-resolving-gaza", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US lifts restrictions on Saudi weapons, with eye on resolving GazaWorld World US lifts restrictions on Saudi weapons, with eye on resolving GazaUnited States confirmed Monday it would resume sales of offensive weapons to Saudi Arabia.\nSince the truce, \"there has not been a single Saudi airstrike into Yemen and cross-border fire from Yemen into Saudi Arabia has largely stopped,\" Patel said.\nSAUDI ROLE IN GAZA WARIt is now the United States, Britain and recently Israel that have been striking Huthi targets in Yemen, with Saudi Arabia content to watch from the sidelines.\nSaudi Arabia has sought US security guarantees, a continued flow of weapons and potentially a civilian nuclear deal if it normalizes with Israel.\n\"I supported the Biden administration's initial decision to pause offensive arms sales to Saudi Arabia, and I hope to see compelling evidence that Saudi Arabia has changed its conduct,\" he said."}, {"id": "3db7a189-fc24-48ad-b6b3-03bce0f5b298", "title": "China expresses grave concern over heavy civilian casualties caused by Israeli military operations in Gaza : Spokesperson", "date": "2024-08-13 03:15", "url": "http://www.china.org.cn/world/2024-08/13/content_117363912.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People mourn victims killed in an Israeli airstrike at a school serving as shelters for displaced people in Al-Daraj neighborhood in Gaza City, Aug. 10, 2024.\n[Photo/Xinhua]China is gravely concerned over the large number of civilian casualties caused by Israeli military operations in the Gaza Strip, a foreign ministry spokesperson said on Monday, calling on Israel to cease fire immediately.\nSpokesperson Lin Jian made the remarks when answering a relevant question.\nMore than 100 Palestinians were killed and dozens of others injured in an Israeli bombing of a school in the Gaza City in the early hours of Saturday, the Hamas-run Gaza government media office said.\nThe international community should work together to make further efforts to alleviate and end the humanitarian disaster in Gaza, Lin added."}, {"id": "3835708b-adc1-4f21-a4d7-f52bd7a41202", "title": "Iran Israel LIVE : Tehran chilling warning as attack fears reach boiling point | World | News", "date": "2024-08-13 11:30", "url": "https://www.express.co.uk/news/world/1935423/iran-israel-live-tehran-keir-starmer", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Israeli intelligence says Iran and Hezbollah are set to avenge the deaths of two of their leaders this week.\nRonen Bergman, a security expert with close ties to Israeli intellignce, told Sky News that the attack would come in two parts.\n\"It will come and it will come, they say, between today, Monday, and the end of this week,\" he said.\nFirst, Hezbollah from the north and then Iran.\nMeanwhile, Iran has rejected a call by three European countries demanding it refrain from any attacks that would further escalate regional tensions - and insisting retaliation against Israel \"was its right\"."}, {"id": "97a75725-427f-4402-aa0f-93a4cd43b70e", "title": "Are We Headed for All - Out War in the Middle East ? ", "date": "2024-08-13 13:15", "url": "https://www.nakedcapitalism.com/2024/08/are-we-headed-for-all-out-war-in-the-middle-east.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "Alert readers might note the bland way this post describes how Israel might target civilian infrastructure inn Lebanon without mentioning that that would be a war crime.\nTensions also persist in southern Lebanon as Israel’s low-level conflict with Hezbollah repeatedly tips over into missile and air attacks.\nThe US military, though, is involved in direct conflict with other paramilitary and military proxies of Iran, in Yemen and Iraq.\nThese are rarely reported in the Western media outside of security publications but amount to an ongoing lower-level war.\nOverall, there may be serious concern about a potential enlarged war in the Middle East stemming from the existing Israeli wars against Hamas and Hezbollah, but there already is a wider war ongoing."}, {"id": "88783614-4a92-4502-9e5e-500258eb1814", "title": "Hamas armed wing says one Israeli hostage killed , 2 women captives  seriously wounded  ", "date": "2024-08-13 04:00", "url": "https://www.asiaone.com/world/hamas-armed-wing-says-one-israeli-hostage-killed-2-women-captives-seriously-wounded", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "One Israeli male hostage was killed by his guard and two women captives were seriously wounded in two separate incidents in Gaza, the spokesperson for Hamas' armed al-Qassam Brigades, Abu Ubaida, said on Monday (Aug 12).\nHe said a committee has been formed to investigate, and findings will be announced later, adding efforts are underway to save the two wounded hostages.\nIt was the first time Al-Qassam has said its guards killed hostages.\nOn Saturday, an Israeli airstrike on a Gaza City school compound housing displaced Palestinian families killed around 100 people.\nHamas wants a deal to end the war while Israeli Prime Minister Benjamin Netanyahu says the war would only end after Hamas is eradicated."}, {"id": "3b1ddf9b-ad8a-417b-92ae-8fe69bb91b06", "title": "Russo - Ukraine War - 12 August 2024", "date": "2024-08-13 01:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-12.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, 418 kamikaze drones were recruited to impress and carried out over 3,300 shelling at the positions of Ukrainian troops and settlements.\nIn the vremívs Наkomu direction, Russian forces committed six offensive actions towards Vodânogo, konstantinívka and vugledar.\nIn the Pridniprovsk direction, Russian forces also suffered defeats, six times attacking the defensive borders of Ukrainians."}, {"id": "cb936d96-e161-4cfc-9328-5933c141f8e6", "title": "Welsh radar site to  protect Britain from deep space warfare  ", "date": "2024-08-13 09:30", "url": "https://www.yahoo.com/news/welsh-radar-protect-britain-deep-001957033.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Credit: Illustration by Julia Wytrazek / Getty ImagesControversial plans for a deep space radar site in Wales have been given the go ahead despite bitter opposition from local campaigners and peace activists.\n'Emerging warfare frontier'The Deep Space Advanced Radar Capability, also known as Darc, will be developed at Cawdor barracks in south-west Wales by the Ministry of Defence.\n\"Deep space\" is the \"vast, unexplored region of space that extends beyond our Moon, to Mars and across our solar system\", said Explore Deep Space.\n'Star Wars agenda'Peace campaigners have \"united\" to condemn the Ministry of Defence's decision, reported the Morning Star.\nWhen the then-US President Ronald Reagan unveiled plans in March 1983 to combat nuclear war in space, the project became known as \"Star Wars\", said the BBC."}, {"id": "9712befc-3589-4033-8e0a-76339af3c623", "title": "Former Member Of Japanese Germ - Warfare Unit Returns To China To Expose War Crimes", "date": "2024-08-13 08:00", "url": "https://menafn.com/1108547648/Former-Member-Of-Japanese-Germ-Warfare-Unit-Returns-To-China-To-Expose-War-Crimes", "domain": "menafn.com", "domain_classification": "Unknown", "message": "He is expected to visit the Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army, and the former site of Unit 731, today.\nIn 2016, Shimizu revealed his identity as a former Unit 731 member and began to expose the atrocities of the Japanese Imperial Army, through public speeches and interviews, aiming to tell historical truths.\n“The war ended 79 years ago, and most members of Unit 731 have passed away.\nUnit 731 was a top-secret biological and chemical warfare research base, established in Harbin as the nerve centre for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons.– NNN-XINHUA"}, {"id": "d745387b-62bd-4d43-a1c9-1580bc1e9a01", "title": "Aircraft Carriers In The 1860s ? The Civil War Saga Of The Steamboat Fanny", "date": "2024-08-13 00:00", "url": "https://www.slashgear.com/1637800/civil-war-aircraft-carrier-steamboat-fanny-history/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "Which of these terms does not belong: Gettysburg, secession, cavalry charge, musket fire, or carrier-launched aerial reconnaissance platform?\nMost slot nicely into what we remember about the American Civil War from history class, but that last one jumps out.\nAn aircraft carrier?\nDuring the Civil War?\nStill, by definition, an ignominious little steamship named the Fanny became the world's first self-propelled aircraft carrier."}, {"id": "79e72a4f-1593-4d84-9e06-45f64f913d68", "title": "Former member of Japanese germ - warfare unit identifies war crimes in China", "date": "2024-08-13 08:15", "url": "http://europe.chinadaily.com.cn/a/202408/13/WS66baee74a3104e74fddb9bcf.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Xinhua]HARBIN -- Hideo Shimizu, a former member of Unit 731, the notorious Japanese germ-warfare detachment during World War II, identified the crimes of the Japanese army on Tuesday at the site where he served 79 years ago in China.\nHe had previously expressed a strong desire to return to China to pray for the deceased and apologize to their families.\n\"For me, overcoming many difficulties to return to China is about hoping that the Japanese authorities can face history squarely, safeguard peace, and not repeat the mistakes of war,\" Shimizu said.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "d6c4e783-cf40-4ff1-81bb-07a8de5d22a7", "title": "Walz : Im Not Stealing Valor , Im Redistributing It", "date": "2024-08-13 01:00", "url": "https://hotair.com/headlines/2024/08/12/walz-im-not-stealing-valor-im-redistributing-it-n3793054", "domain": "hotair.com", "domain_classification": "Unknown", "message": "\"Let me say categorically, I have never and will never steal anyone's valor,\" Walz stated, rubbing what looked like a homemade Purple Heart with his sleeve.\n\"What I will do, however, is redistribute valor from over-privileged owners of valor, such as soldiers who have courageously risked their lives for their country in combat.\nI believe in an equitable distribution of valor, where I, who bravely and self-sacrificially allowed my beloved unit to go into battle without me so that I could make sure my political career didn't suffer, may receive just as many accolades as a war-wounded vet who actually served in the Middle East.\"\nAdvertisement\"Say it with me — tax the valor-rich!\"\nWalz ended."}, {"id": "289068c5-4001-46ed-b8eb-8597adb17f6e", "title": "Former member of Japanese germ - warfare unit identifies war crimes in China", "date": "2024-08-13 07:45", "url": "http://www.china.org.cn/china/Off_the_Wire/2024-08/13/content_117364741.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:HARBIN, Aug. 13 (Xinhua) -- Hideo Shimizu, a former member of Unit 731, the notorious Japanese germ-warfare detachment during World War II, identified the crimes of the Japanese army on Tuesday at the site where he served 79 years ago in China.\nHe had previously expressed a strong desire to return to China to pray for the deceased and apologize to their families.\n\"For me, overcoming many difficulties to return to China is about hoping that the Japanese authorities can face history squarely, safeguard peace, and not repeat the mistakes of war,\" Shimizu said.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "7001d252-8066-4163-b8de-213b806013b3", "title": "Hezbollah Attacks Israel From the North Again", "date": "2024-08-13 01:00", "url": "https://hotair.com/jazz-shaw/2024/08/12/hezbollah-attacks-israel-from-the-north-again-n3793042", "domain": "hotair.com", "domain_classification": "Unknown", "message": "We've probably reached the point where we can stop asking whether or not the war in the Middle East might escalate.\nIt's already escalated in at least two additional directions beyond the original, direct conflict between Israel and Hamas in the Gaza Strip.\nYesterday, Hezbollah fired several dozen rockets into Israel from Lebanon.\nBut in reality, they were retaliating after Israel fired their own rockets into southern Lebanon a few days earlier.\nAs of this weekend, Hamas leader Yahya Sinwar was asking Egyptian and Qatari mediators to intervene and seek a path to a ceasefire."}, {"id": "abd06e5e-35ed-41eb-a3e6-c4faedb00b6c", "title": "Welsh radar site to  protect Britain from deep space warfare  ", "date": "2024-08-13 01:45", "url": "https://theweek.com/defence/welsh-radar-protect-britain-from-deep-space-warfare", "domain": "theweek.com", "domain_classification": "Unknown", "message": "Controversial plans for a deep space radar site in Wales have been given the go ahead despite bitter opposition from local campaigners and peace activists.\n'Emerging warfare frontier'The Deep Space Advanced Radar Capability, also known as Darc, will be developed at Cawdor barracks in south-west Wales by the Ministry of Defence.\n\"Deep space\" is the \"vast, unexplored region of space that extends beyond our Moon, to Mars and across our solar system\", said Explore Deep Space.\n'Star Wars agenda'Peace campaigners have \"united\" to condemn the Ministry of Defence's decision, reported the Morning Star.\nWhen the then-US President Ronald Reagan unveiled plans in March 1983 to combat nuclear war in space, the project became known as \"Star Wars\", said the BBC."}, {"id": "2e1a7bbc-3276-4f94-824e-794f0ac10815", "title": "Suriya  Kanguva  looks inspired by these 5 films : Apocalypto to RRR", "date": "2024-08-13 05:30", "url": "https://www.mensxp.com/entertainment/regional/168033-suriya-kanguva-trailer-looks-inspired-by-these-five-films.html", "domain": "mensxp.com", "domain_classification": "Unknown", "message": "Suriya’s upcoming period action film Kanguva recently dropped its trailer and its scale has skyrocketed fans’ hopes.\nWhile the trailer looks good, it presents nothing that we haven’t already seen in various period battle films.\nSuriya’s Kanguva looks inspired by these 5 iconic films Baahubali: The Beginning The whole setup of Bobby Deol’s clan looks like it is directly inspired by Kaalkeya’s army and battle throne.\nBlack Panther In Black Panther, we see some scars embedded on Killmonger and we see similar signs on Suriya’s hands in the trailer.\n© Marvel Studios In Black Panther, these scars represent the killings by the Killmonger, and in Kanguva, they could also mean the same."}, {"id": "8766ef49-8409-4979-ba4a-8374cdccf0f6", "title": "Putin lashes out at West as Ukrainian military incursions into Kursk continue", "date": "2024-08-13 12:45", "url": "https://www.foxnews.com/world/putin-lashes-out-west-over-ukrainian-incursion-russian-territory-report", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin is continuing to blame the West for his nation's difficulties subduing opposition forces in Ukraine.\nThe Russian president told regional governors and national defense officials on Monday that the Ukrainian military's current campaign in the territory of the Kursk region will not affect negotiations.\n\"The West is fighting us with the hands of the Ukrainians,\" Putin told them at his home outside the capital city of Moscow, according to a report from The New York Times.\nThe events have put the Russian military command under fire over the intelligence and tactical lapses that allowed such an attack to happen.\nExperts attribute the Ukrainian gains to \"unconventional\" tactics that have caught the much larger Russian military off-guard."}, {"id": "8a92f690-77c1-4172-8ce1-366bb0b1ee27", "title": "Ukraine week - old incursion into Russia has embarrassed Putin . How will it affect the war ? | Ap - top - news", "date": "2024-08-13 03:00", "url": "https://www.wfmz.com/news/ukraine-s-week-old-incursion-into-russia-has-embarrassed-putin-how-will-it-affect-the/article_2d4450da-8e6d-50b6-aee7-db9a81f12a6c.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "This photo released by the acting Governor of Kursk region Alexei Smirnov telegram channel on Tuesday, Aug. 6, 2024, shows a damaged house after shelling by the Ukrainian side in the city of Sudzha, Kursk region that borders Ukraine.\nRussian officials said Wednesday they were fighting off Ukrainian cross-border raids in a southwestern border province for a second day, as Kyiv officials remained quiet about the scope of the operation.\n(Governor of Kursk region telegram channel via AP)"}, {"id": "65076ca5-a87d-4bc6-b068-2c67900b7262", "title": "Ukraine launched a surprise attack in Kursk , now Russian territory is under occupation for the first time since WWII - 13 - Aug - 2024", "date": "2024-08-13 02:45", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404548", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "For the first time since World War II, Russian territory is under occupation.\nLast week, Kyiv's troops poured into the Kursk region from several directions in a surprise attack.\nRussian forces, which have a vast numerical supremacy and control 18 per cent of Ukrainian territory, have been advancing this year along the 1,000km front.\nThe big question now is whether Ukraine can hold onto the Russian territory and for how long.\n\"It is really quite significant that Ukraine can take sizeable amounts of Russian territory,\" he said."}, {"id": "655126e8-f93d-4f90-bc6d-7b49192dc79a", "title": "Ukraine launched a surprise attack in Kursk , now Russian territory is under occupation for the first time since WWII - 13 - Aug - 2024", "date": "2024-08-13 02:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404548&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "For the first time since World War II, Russian territory is under occupation.\nLast week, Kyiv's troops poured into the Kursk region from several directions in a surprise attack.\nRussian forces, which have a vast numerical supremacy and control 18 per cent of Ukrainian territory, have been advancing this year along the 1,000km front.\nThe big question now is whether Ukraine can hold onto the Russian territory and for how long.\n\"It is really quite significant that Ukraine can take sizeable amounts of Russian territory,\" he said."}, {"id": "47c0f498-98f6-4480-96e5-286aa2d39b62", "title": "From Japan with apologies for Unit 731", "date": "2024-08-13 09:45", "url": "http://usa.chinadaily.com.cn/a/202408/13/WS66baffe3a3104e74fddb9bee.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Xinhua]Hideo Shimizu, a former member of Unit 731, the notorious Japanese germ-warfare unit during World War II, flew down to Harbin, capital of Heilongjiang province, on Monday evening to testify and expose the crimes committed by his unit during the Japanese invasion of China.\nUpon Japan's surrender in 1945, Unit 731 tried to gun down all survivors and destroy all evidence of the atrocities they had committed.\nBy deposing and admitting to the crimes committed by Unit 731 on Tuesday, the 94-year-old Shimizu has defeated the Japanese right-wing political forces' efforts to deny all what happened.\nShimizu was just 14 years old and among the last batches of Unit 731 Youth Corps members sent by Japan to Unit 731 in Harbin almost 79 years ago.\nBefore Shimizu, in 2005, Yoshio Shinozuka, another Japanese soldier who served in Unit 731, had visited the former site and apologized for the atrocities they committed."}, {"id": "5e6990d2-7194-4d8d-bbba-c1b613622ed2", "title": "From Japan with apologies for Unit 731", "date": "2024-08-13 13:15", "url": "http://africa.chinadaily.com.cn/a/202408/13/WS66baffe3a3104e74fddb9bee.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Xinhua]Hideo Shimizu, a former member of Unit 731, the notorious Japanese germ-warfare unit during World War II, flew down to Harbin, capital of Heilongjiang province, on Monday evening to testify and expose the crimes committed by his unit during the Japanese invasion of China.\nUpon Japan's surrender in 1945, Unit 731 tried to gun down all survivors and destroy all evidence of the atrocities they had committed.\nBy deposing and admitting to the crimes committed by Unit 731 on Tuesday, the 94-year-old Shimizu has defeated the Japanese right-wing political forces' efforts to deny all what happened.\nShimizu was just 14 years old and among the last batches of Unit 731 Youth Corps members sent by Japan to Unit 731 in Harbin almost 79 years ago.\nBefore Shimizu, in 2005, Yoshio Shinozuka, another Japanese soldier who served in Unit 731, had visited the former site and apologized for the atrocities they committed."}, {"id": "448dc34c-4d14-427a-972a-88d74e2dc836", "title": "  Robot  Dogs of War Deployed in Ukraine", "date": "2024-08-13 02:45", "url": "https://nationalinterest.org/blog/buzz/robot-dogs-war-deployed-ukraine-212299", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "“Cry ‘Havoc!’ And let slip the dogs of war” probably wasn’t actually uttered by Roman General Mark Antony.\nEnter the Robot Dogs of WarIn June 2022, the U.S. Army announced it would provide Kyiv with a pair of robotic dogs that could aid in clearing minefields and in the disposal of other ordnance.\nWhile robotic dogs have already been used as guards to patrol the perimeter of a military base, the Ukrainian robotic dogs have been employed as scouts near villages on the frontlines around Toretsk, near the destroyed city of Bakhmut.\nIn June, China showcased an armed robot dog that also seemed similar in design to the Unitree Go2.\nThe difference from the robot dogs in Ukraine was the presence of a QBZ-95 (Type 95) assault rifle mounted to the top."}, {"id": "9c4b1fa1-4b73-41aa-a704-a0c8e3c6e261", "title": "Battle of Kursk II - Russo - Ukraine War", "date": "2024-08-13 01:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-kursk-2024-08-12.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Battle of Kursk II - 12 August 2024 - Day 7Ukraine's Commander-in-Chief Oleksandr Syrskyi declared that Ukraine now controls around 1,000 km² of Russian territory.\nSmirnov: \"480 square kilometers of territory and 28 settlementsin the Kursk region had been captured.\"\nYou tell us about the socio-economic situation and assistance to people,\"The acting governor of the Kursk region, Alexey Smirnov, reported on the beginning of the construction of defensive lines in the Kursk region.\nIn the Kursk region, General-Colonel Alexei Dyumin, an assistant to the President, will coordinate the actions of the Russian Armed Forces with law enforcement agencies and local authorities.\nThe amended train schedule for trains running through the Kursk region is being extended."}, {"id": "71eb57a9-dc3b-4cbe-8883-3a3f02bdadde", "title": "Russian Defence Minister Andrei Belousov addresses opening ceremony of ARMY 2024 International Military and Technical Forum", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240812-russia-mod04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russian Defence Minister Andrei Belousov addresses opening ceremony of ARMY 2024 International Military and Technical Forum12.08.2024Dear friends!\nWelcome to the opening ceremony of the ARMY 2024 International Military and Technical Forum.\nAs all of you know, the event takes place at a time of the special military operation.\nIt was decided to organise the work of the ARMY Forum around this key conclusion.\nAll of them - for the needs of our fighters in the special military operation zone."}, {"id": "90624623-dc7e-460f-9eed-b3b25d961bff", "title": "Revolutionising Combat : How cutting - edge AI is building the brain of future weapons systems", "date": "2024-08-13 07:15", "url": "https://economictimes.indiatimes.com/news/defence/revolutionising-combat-how-cutting-edge-ai-is-building-the-brain-of-future-weapons-systems/articleshow/112486582.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"\"My exposure to blast effects and defence technology during that time inspired me to focus on the defence sector.\nIn complex scenarios, such as the Balakot operation, advanced unmanned systems could have improved effectiveness and reduced casualties.\n\"The field of unmanned systems has seen remarkable advancements, particularly in Unmanned Aerial Systems (UAS).\nBy improving targeting accuracy and adapting to real-time data, AI is making military operations more precise and effective.\nThe integration of cutting-edge technologies into military operations promises to redefine the nature of combat and maintain technological superiority on the battlefield."}, {"id": "d7c8d873-dcdd-4706-8e61-5db2265a3285", "title": "Gaza : Hamas says guards killed hostage and wounded two others", "date": "2024-08-13 13:00", "url": "https://www.bbc.com/news/articles/c303d4pdpg6o", "domain": "bbc.com", "domain_classification": "International", "message": "Hamas says guards killed hostage and wounded two others in GazaIt is thought that 111 of the hostages abducted by Hamas in the 7 October attacks remain in GazaHe did not identify the hostages or give more details about when or where the attacks occurred, saying an investigation was under way.\nThe Israeli military said in response that it did “not have any intelligence information that allows us to refute or confirm Hamas’s claims”.\nHamas’s military wing says that two of its guards have shot and killed one Israeli male hostage held in Gaza and seriously wounded two female hostages.\nIt is thought that 111 of the hostages abducted by Hamas remain in Gaza, including the bodies of 39 who the Israeli military says are dead.\nAt least 39,929 people have been killed in Gaza during the current conflict, according to the territory’s Hamas-run health ministry."}, {"id": "b15072a2-775e-4396-a679-f6fd96826adb", "title": "F - 35 deliveries resume , but upgrade delays have ripple effects", "date": "2024-08-13 00:45", "url": "https://www.navytimes.com/air/2024/07/21/f-35-deliveries-resume-but-upgrade-delays-have-ripple-effects/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "Schmidt said the F-35 program is taking a “phased approach” to the delivery of these F-35s.\nBut the TR-3 delay is going to have ripple effects on the Air Force’s operations, procurements and subsequent upgrades to the F-35 for years to come.\nAs the training-only TR-3 jets start to come on board, Hecker said, the Air Force will likely send them to training bases.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "dbd1077c-46b5-4c38-bff5-7fd4907dcdf4", "title": "Former member of Japanese germ - warfare unit returns China to expose war crimes", "date": "2024-08-13 02:15", "url": "http://en.people.cn/n3/2024/0813/c90000-20205123.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Former member of Japanese germ-warfare unit returns China to expose war crimesXinhua) 09:11, August 13, 2024Hideo Shimizu waits for a flight to China at the Kansai International Airport in Osaka, Japan, Aug. 12, 2024.\nHe is expected to visit the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army and the former site of Unit 731 on Tuesday.\n\"The war ended 79 years ago, and most members of Unit 731 have passed away.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons.\n(Xinhua/Zhang Tao)This photo taken on Aug. 11, 2024 shows the former site of Unit 731 in Harbin, northeast China's Heilongjiang Province."}, {"id": "64b37a6f-2caa-4df6-9bb4-e3309d11ff7f", "title": "Former member of Japanese germ - warfare unit returns China to expose war crimes -- Beijing Review", "date": "2024-08-13 06:15", "url": "http://www.bjreview.com/Latest_Headlines/202408/t20240813_800374404.html", "domain": "bjreview.com", "domain_classification": "Unknown", "message": "He is expected to visit the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army and the former site of Unit 731 on August 13.\nIn 2016, Shimizu revealed his identity as a former Unit 731 member and began to expose the atrocities of the Japanese Imperial Army through public speeches and interviews, aiming to tell historical truths.\n\"The war ended 79 years ago, and most members of Unit 731 have passed away.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "8b7a92ea-9608-46de-bd85-5d19d2ec902f", "title": "Former member of Japanese germ - warfare unit returns China to expose war crimes -- China Economic Net", "date": "2024-08-13 04:30", "url": "http://en.ce.cn/main/latest/202408/13/t20240813_39102389.shtml", "domain": "en.ce.cn", "domain_classification": "Unknown", "message": "He is expected to visit the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army and the former site of Unit 731 on Tuesday.\nIn 2016, Shimizu revealed his identity as a former Unit 731 member and began to expose the atrocities of the Japanese Imperial Army through public speeches and interviews, aiming to tell historical truths.\n\"The war ended 79 years ago, and most members of Unit 731 have passed away.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "32097e88-5d44-4bd4-93e2-3f0a9db936bd", "title": "WW2 - Frontlines - U y", "date": "2024-08-13 04:15", "url": "https://www.tvguide.co.uk/schedule/f66af38d-7ac4-5b65-8a5c-00f2cc585f3e/ww2-frontlines", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "WW2 - FrontlinesU&Yesterday 10:00 AM to 11:00 AM Tuesday 13 August Share Add toCalendar +Midway Season 1 Episode 1 of 8 S Subtitles Audio DescriptionA look back at the battle of Midway, a major naval battle in the Pacific War.\nThe Japanese should have triumphed, yet the Americans turned the Japanese trap into a bold ambushWW2 - Frontlines airs on U&Yesterday at 10:00 AM, Tuesday 13 August .\n(Subtitles, audio description.)"}, {"id": "587af668-039a-46c1-84de-fb4d47f4524f", "title": "Battle 360 - Sky History", "date": "2024-08-13 09:30", "url": "https://www.tvguide.co.uk/schedule/f35cd6ad-6939-5b33-af52-9ee3aaa2934a/battle-360", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Battle 360Sky History 3:00 PM to 4:00 PM Tuesday 13 August Share Add toCalendar +Bloody Santa Cruz Season 1 Episode 4 of 10A CGI reconstruction of the Second World War battle of Santa Cruz, in which the USS Hornet was sunk and her sister ship the USS Enterprise suffered heavy casualties among the crewBattle 360 airs on Sky History at 3:00 PM, Tuesday 13 August ."}, {"id": "90b2c4c3-ec1e-40fe-bcdf-1a5e16bd0283", "title": "South Korea says North Korean hackers stole technical data on spy planes and tanks", "date": "2024-08-13 14:00", "url": "https://www.techradar.com/pro/security/south-korea-says-north-korean-hackers-stole-technical-data-on-spy-planes-and-tanks", "domain": "techradar.com", "domain_classification": "Unknown", "message": "The South Korean government has accused North Korea of stealing critical information about major military equipment.\nCiting reports in local media, BleepingComputer says South Korea’s ruling People Power Party (PPP) has warned about the theft of information on K2 tanks and Baekdu and Geumgang spy airplanes.\nNot an option, but a necessityThe K2 tank is South Korea’s main battle tank, and that the country currently has 260 units currently serving.\n\"Moreover, as North Korea's cyberattacks become more widespread and bold by the day, enacting the Basic Cyber Security Act to prevent North Korea's hacking and technology theft is no longer an option but a necessity,\" PPP said in a statement.\nPart of that department is Lazarus, an infamous threat actor that was attributed with some of the biggest cryptocurrency heists in history."}, {"id": "b79b71af-df41-49a6-9d00-798ef47653a8", "title": "Address on the opening of the Army 2024 International Military - Technical Forum", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240812-kremlin01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Address on the opening of the Army 2024 International Military-Technical ForumAugust 12, 202410:35President of Russia Vladimir Putin: Friends, foreign guests, ladies and gentlemen,I am delighted to welcome all the participants and guests of the Army 2024 International Military-Technical Forum.\nIn addition to this, we offered several foreign exhibitions an opportunity to set up their stands at the forum.\nOf course, the forum's agenda includes grand-scale presentations of the most advanced and largely unique and unrivalled achievements of Russia's defence manufacturers and its leading, internationally acclaimed corporations.\nFriends,The Army 2024 forum offers a very packed and detailed programme.\nI have no doubt that this event will help strengthen the existing ties and forge new ones by signing mutually beneficial contracts with Russia's Defence Ministry and defence industry enterprises."}, {"id": "545783ae-bee8-489d-b2b3-54fa3640ed1c", "title": "Ukraine - Russia war : How Ukraine pulled off its biggest gamble : invading Russia", "date": "2024-08-13 01:00", "url": "https://www.afr.com/world/europe/how-ukraine-pulled-off-its-biggest-gamble-invading-russia-20240813-p5k1w6", "domain": "afr.com", "domain_classification": "Unknown", "message": "Christopher Miller Aug 13, 2024 – 9.23am Save Share Copy link Copied Email LinkedIn Twitter Facebook Copy link Copied Share via...\nGift this article New Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe.\nIt was not lost on him that 81 years ago, another battle in Russia’s Kursk region marked a turning point for Europe.\nHe and the other soldiers of the 82nd air assault brigade listened to their commander’s instructions: eyes open, move swiftly and keep your country in your thoughts.\nThen, after a short prayer and a battle cry of “Glory to Ukraine!” they set out to invade Russia – the first foreign army to do so since the Second World War."}, {"id": "4554c193-b545-498a-ab53-d41343622259", "title": "Press Briefing by IDF Spokesperson RAdm . Daniel Hagari - August 12 , 2024", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-idf01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press Briefing by IDF Spokesperson RAdm.\nDaniel Hagari- August 12, 2024IDF Press ReleaseAugust 12, 202412.08.24IDFGood evening,Over the past few days, we have been monitoring our enemies and developments in the Middle East, with an emphasis on Hezbollah as well as Iran.\nWe have increased the patrols of Israeli Air Force aircraft over Lebanese skies, in order to detect and remove threats.\nLast night, during combat conducted by the division in the area, IDF soldier Sergeant Omer Ginzburg z\"l fell in action.\nThe IDF and all of the security agencies are making every effort to create the conditions for their return as quickly as possible."}, {"id": "f7748165-7266-4bff-968f-7ee7f8ab7204", "title": "Nellis  Aggressor Nation  plays Red Force during Bamboo Eagle 24 - 3", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-usaf03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Nellis 'Aggressor Nation' plays Red Force during Bamboo Eagle 24-3Published Aug. 12, 2024By Staff Sgt.\nJose Miguel T. Tamondong57th Wing Public AffairsNELLIS AIR FORCE BASE, Nev. (AFNS) -- Nellis-based Aggressor units and the 57th Operations Group intelligence flight comprised the Red Force ensemble for Bamboo Eagle 24-3 from Aug. 2-9.\nAs Red Force, the 57th Information Aggressor Squadron, 507th Air Defense Aggressor Squadron, 64th, 65th and 706th Aggressor Squadrons provide realistic, threat-representative, near-peer air combat adversaries for high-end U.S. and coalition training.\nBamboo Eagle 24-3 includes scenarios that stress an air expeditionary wing's ability to generate combat air power.\n\"So the saying goes, 'As iron sharpens iron', the Bamboo Eagle 24-3 participants will come out of this exercise ready to face any challenge.\""}, {"id": "5c088437-906b-43b2-8689-857cc2514c78", "title": "IRGC tells US Navy : We can reach you at  closest point  in international waters", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240812-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "IRGC tells US Navy: We can reach you at 'closest point' in international watersIran Press TVMonday, 12 August 2024 9:58 AMThe Islamic Revolution Guards Corps Navy is not just a coastal force but is capable of having a presence in international waters, a commander of the fifth Martyr Lieutenant General Haj Qassem Soleimani fleet of the IRGC Navy says.\n\"After the United States imposed sanctions on the IRGC Navy, we had to show that the IRGC Navy is not just a coastal force and is capable of supplying various types of heavy vessels, enabling it to have a presence in international waters,\" Colonel Soleimani said on Monday.\nDuring its mission, he noted, the Shahid Mahdavi warship passed through important and strategic straits of the world, including the Strait of Malaga.\nThe 2,100-tonne Shahid Mahdavi, a multipurpose vessel designed for long-range operations, is 240 meters in length and 27 meters in width.\nThe Shahid Mahdavi is capable of carrying various types of attack helicopters, combat drones as well as fast attack craft."}, {"id": "b241b7e8-8d4f-4b8d-aca0-3eb99cf840c7", "title": "Today in military history : Armistice ends the Spanish - American War", "date": "2024-08-13 02:00", "url": "https://news.yahoo.com/news/today-military-history-armistice-ends-223646154.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "On Aug. 12, 1898, the Spanish-American War ended in armistice.\nThe resulting war was focused on Cuba, but the growing American military contested Spain across its empire, resulting in combat from the Atlantic to Pacific.\nAmerican sympathy for Cuba grew and U.S. intervention became inevitable after the sinking of the USS Maine in Havana harbor.\nSome of the Spanish-American War Veterans, Tenth Cavalry.\nWikimedia CommonsThe Spanish-American War began in late April, and in the following three months, the U.S. Navy would serve Spain a staunch defeat."}, {"id": "772592c7-4c8b-44ed-afe0-1e1237c5487c", "title": "Tactical change as terrorists resorting to jungle warfare : Former J & K top cop", "date": "2024-08-13 06:30", "url": "https://www.newindianexpress.com/nation/2024/Aug/13/tactical-change-as-terrorists-resorting-to-jungle-warfare-former-jk-top-cop", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "SRINAGAR: As anti-militancy operations are going on in the forest areas of at least five districts of Jammu and Kashmir, former J&K police chief S P Vaid opined that militants have changed strategy and are now resorting to jungle warfare and carrying out hit and run attacks on security forces and ‘disappearing’.\nHe, however, questioned that amid heightened security how militants were getting supplies and replenishments.\nTalking to this newspaper, former J&K police chief S P Vaid said it is obvious that militants have changed their strategy.\n“From urban militancy, they are now resorting to jungle warfare.\nThis is quite evident the way militants have carried out attacks on security forces and engaged in encounters in dense forest areas of Jammu region and now recently in Kokernag in south Kashmir,” he said."}, {"id": "fb6aa51f-8c6b-4623-9698-7359f1df494c", "title": "The Emoji Movie , One of the Worst Animated Films , Is # 1 on Netflix", "date": "2024-08-13 03:15", "url": "https://www.indiewire.com/news/box-office/the-emoji-movie-one-of-the-worst-animated-films-netflix-1235035321/", "domain": "indiewire.com", "domain_classification": "Unknown", "message": "The #1 movie of 2024 (“Inside Out 2”), as well as #3 (“Despicable Me 4“), and #7 (“Kung Fu Panda”) are animated features.\nThe Garfield Movie (Sony) – $14.99Fandango at Home1.\nThe Garfield Movie (Sony) – $14.995.\nFuriosa: A Mad Max Saga (WB) – $9.99Netflix MoviesThese are the most-viewed, current rankings on Netflix’s domestic daily chart on Monday, August 12.\nSaving Bikini Bottom: The Sandy Cheeks Movie (2024 Netflix original animated film)7."}, {"id": "fabcdd47-200c-481c-8d3a-d6f4fee74e16", "title": "Russia links with Iran are growing stronger – POLITICO", "date": "2024-08-13 05:30", "url": "https://www.politico.eu/article/russia-iran-weapons-arms-ballistic-missiles-drones-defense-war-in-ukraine-war-in-gaza/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "And as Iran moves up the food chain in terms of what it can procure from Russia, the threat to U.S. interests and allies in the Middle East is expanding.\nOf course, Iran and Russia already had a strong defense relationship prior to February 2022.\nAnd over the last two years, drones have become the core element of the defense relationship between these two nations.\nDespite their relatively small payload, they still pack a punch as well, causing damage to civilian homes, energy infrastructure and front-line forces.\nAnd as of the end of February, Russia had fired some 4,600 Iran-designed drones at Ukraine."}, {"id": "500ccfdb-6504-43ee-ab8e-7eb314cabb85", "title": "US armored unit conducts live - fire drills in rapid deployment exercise", "date": "2024-08-13 07:45", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/205_380498.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "A U.S. armored unit staged live-fire drills at a firing range near the border with North Korea last week as part of an exercise designed to check its readiness to swiftly deploy from the U.S. mainland, the U.S. Army in South Korea said Tuesday.\nAfter being notified of the rapid deployment exercise in mid-July, the battalion based in Fort Bliss, Texas, arrived in South Korea late last month, where they received their combat equipment from a U.S. military base in the southeastern part of the country.\n\"This opportunity to train ... reinforces our commitment to the ROK in maintaining security and stability on the Korean Peninsula,\" Lt. Col. Christopher Lorete, the battalion commander, said in a release.\nROK stands for Republic of Korea, the South's official name.\nThe exercise took place as part of the U.S. military's Operation Pacific Fortitude, which routinely tests a unit's ability to rapidly deploy personnel to a given environment, conduct training and redeploy back home."}, {"id": "4fecc4b5-ce18-4193-b45b-865c678ba819", "title": "Fort Sill and Fort Leonard Wood to add 4 basic training companies", "date": "2024-08-13 00:00", "url": "https://www.militarytimes.com/news/your-army/2024/08/12/fort-sill-and-fort-leonard-wood-to-add-4-basic-training-companies/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "Basic combat training at Fort Sill, Oklahoma, and Fort Leonard Wood, Missouri, will each add two companies of recruits to their training cycles starting in October, officials said.\nFort Jackson hosts 43 basic combat training companies, while Fort Sill and Fort Leonard Wood host 19 and 13 companies, respectively, according to Army data.\nArmy officials did not provide a total price for the expansionThe Army currently runs 75 basic combat training companies.\nSoldiers who go through basic combat training then do follow on, job-specific training called Advanced Individual Training, or AIT.\nThe OSUT model combines basic combat training with AIT and is not included in the figures provided on standalone basic combat training sites."}, {"id": "914bda01-76df-42e1-9b6c-a44d058e8a8e", "title": "  They were at war : Wieambilla ambush was an act of terrorism fuelled by religious ideology , inquest hears | Wieambilla shooting", "date": "2024-08-13 04:15", "url": "https://www.theguardian.com/australia-news/article/2024/aug/13/wieambilla-police-shooting-massacre-inquest-train-family-ntwnfb", "domain": "theguardian.com", "domain_classification": "International", "message": "Roose said that their ambush constituted an “act of terrorism” under the definition under the commonwealth criminal code.\nIn May, Gareth started daily communications with American conspiracy theorist Donald Day Jr.View image in fullscreen Donald Day Jr, who uses the pseudonym ‘Geronimo’s Bones’.\nThe American interacted with the Trains online before the Wieambilla shooting.\n“Throughout the material, particularly the material between Gareth Train and Geronimo’s Bones, or Donald Day Jr, you can see them having that discussion about the return of Christ.\nDonald Day Jr has since been arrested by US police."}, {"id": "e906d66f-9c77-48b2-90bd-111846d073e9", "title": "Tim Walz coming to Southern California Tuesday", "date": "2024-08-13 07:45", "url": "https://www.nbcsandiego.com/news/national-international/tim-walz-coming-southern-california-tuesday-downtown-los-angeles-orange-county/3596222/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "The Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n\"It's a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,'' the county GOP contended.\nWalz served as a command sergeant major, but officially retired a rank lower because he had not completed some courses required for the higher rank.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "835665b9-9dff-4904-b47b-c4dae9d82355", "title": "Ukraine week - old incursion into Russia has embarrassed Putin . How will it affect the war ? | National News", "date": "2024-08-13 03:15", "url": "https://www.recorderonline.com/news/national_news/ukraine-s-week-old-incursion-into-russia-has-embarrassed-putin-how-will-it-affect-the/article_e043e54b-978e-5cc3-b828-bc674804a0e2.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Ukraine’s week-old incursion into Russia has embarrassed Putin.\nHow will it affect the war?\nThe swift Ukrainian incursion into Russia’s Kursk region that began last week has been the largest cross-border raid by Kyiv’s forces in the nearly 2 ½-year war, and has exposed Russia’s vulnerabilities and dealt a painful blow to the Kremlin"}, {"id": "bdddb58b-c86c-4cb0-a140-954c0ffadf34", "title": "Ukraine week - old incursion into Russia has embarrassed Putin . How will it affect the war ? | Nation / world", "date": "2024-08-13 03:15", "url": "https://www.ivpressonline.com/news/nation/ukraine-s-week-old-incursion-into-russia-has-embarrassed-putin-how-will-it-affect-the/article_7865ea48-7216-50a7-aadd-25c8d8afe9f2.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "Ukraine’s week-old incursion into Russia has embarrassed Putin.\nHow will it affect the war?\nThe swift Ukrainian incursion into Russia’s Kursk region that began last week has been the largest cross-border raid by Kyiv’s forces in the nearly 2 ½-year war, and has exposed Russia’s vulnerabilities and dealt a painful blow to the Kremlin"}, {"id": "ed5041af-b067-414d-8e81-8b5a9fad728c", "title": "US and South Korea to start joint military drills next week", "date": "2024-08-13 13:15", "url": "https://www.albawaba.com/news/us-and-south-korea-start-joint-military-1581277", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "SEOUL, Aug. 12 (UPI) -- The United States and South Korea will kick off a large-scale joint military exercise next week, both countries announced Monday, with a focus on deterring North Korea's growing nuclear, missile and cyber threats.\nThe Democratic People's Republic of Korea is the official name of North Korea.\nSome 19,000 South Korean troops will participate in the drills, Col. Lee Sung-jun, spokesman for South Korea's Joint Chiefs of Staff, said at a press briefing in Seoul on Monday.\n\"We are going to focus on deterring the use of weapons of mass destruction, including North Korea's nuclear missiles,\" Lee said.\nTrash from at least one balloon landed on the compound of South Korean President Yoon Suk Yeol last month, alarming officials."}, {"id": "75fc9611-a11d-496d-a0a1-89deaba0d068", "title": "Escalating Maritime Conflict in the Red Sea : Yemen Houthi Rebels Target Ships", "date": "2024-08-13 07:15", "url": "https://www.devdiscourse.com/article/law-order/3050226-escalating-maritime-conflict-in-the-red-sea-yemens-houthi-rebels-target-ships", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A ship in the Red Sea was attacked on Tuesday in a suspected operation by Yemen's Houthi rebels, marking the third such incident amidst the ongoing Israel-Hamas conflict, according to officials.\nThis series of assaults has disrupted the USD 1 trillion annual flow of goods along a vital maritime route connecting Asia, Europe, and the Middle East.\nThe Houthi attacks have led to the most severe combat for the US Navy since World War II.\nAn explosive detonated near the ship 115 kilometers south of Hodeida, followed by a second blast from a suspicious vessel, as reported by the United Kingdom Maritime Trade Operations center.\nSubsequent explosions occurred later the same day off the same ship, 180 kilometers northwest of Hodeida, according to the private security firm Ambrey."}, {"id": "30479177-dafd-4599-bd17-f943d15dd95d", "title": "Play Mafia , Crash Bandicoot and More Now on Xbox Game Pass", "date": "2024-08-13 12:00", "url": "https://www.cnet.com/tech/gaming/play-mafia-crash-bandicoot-and-more-now-on-xbox-game-pass/", "domain": "cnet.com", "domain_classification": "Unknown", "message": "Xbox Game Pass Ultimate, a CNET Editors' Choice award pick, offers hundreds of games you can play on your Xbox Series X, Series S, Xbox One and PC or mobile device for $20 a month.\nRead more: Figure Out Which Xbox Game Pass Plan Is Right for YouMicrosoft brought Call of Duty: Modern Warfare 3 and other titles to Game Pass Ultimate in July, and the company added these games to the service in August.\nCrash Bandicoot N. Sane TrilogyThis collection of remastered games updates the first three titles in the Crash Bandicoot franchise: Crash Bandicoot, Cortex Strikes Back and Warped.\nMafia: Definitive EditionIf you've always wanted to be a gangster, this remastered collection is for you.\nThis collection contains remakes of all three Mafia titles, remastered for the current generation of consoles so they look as good as a Scorsese film."}, {"id": "3aa83f93-50ad-45a5-a677-ed9b39ce9937", "title": "NATO exercise highlights international operability", "date": "2024-08-13 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240812-arnews01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "NATO exercise highlights international operabilityBy Spc.\nNATO countries conducted the exercise to familiarize themselves with each other's land fighting tactics and capabilities, ensuring they can work together and communicate effectively.\nAs collaboration continued, U.S. Army CH-47 Chinooks took to the sky as they transported Canadian troops into the field.\nTask Force Lobos Soldiers of 2nd General Support Aviation Battalion, 227th Aviation Regiment, 1st Air Cavalry Brigade, 1st Cavalry Division conducted air mobility operations with Canadian Army troops.\nThe collaboration gave the Canadian troops a realistic training experience and afforded Lobos crews the opportunity to hone their skills while gaining valuable NATO interoperability exposure from the training event."}, {"id": "42f9f658-a79c-4da1-a147-35ab129dabcd", "title": "Pennsylvania Democrat Sen . Bob Casey Defends Tim Walz Despite Stolen Valor Accusations", "date": "2024-08-13 00:30", "url": "https://www.breitbart.com/politics/2024/08/12/pennsylvania-democrat-sen-bob-casey-defends-tim-walz-despite-stolen-valor-accusations/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Tim Walz’s (MN) military record on Monday despite evidence that he misled the American public about his service.\nNBC News campaign embed Emma Barnett quoted Casey as defending the embattled Walz, who is under intense scrutiny due to stolen valor accusations.\nTim Walz days after VP nominee Sen. JD Vance accused Walz of “stolen valor.” Casey told reporters, “I think when someone serves as Gov.\n“Now, he’s covering for Tim Walz’s lies.”“You can’t trust Casey to tell the truth,” he added.\nHey @Bob_Casey – So you're perfectly fine with Tim Walz blatantly lying about his rank to advance his political career?"}, {"id": "e8ccf0c0-7a68-41fe-ab7d-b766a158e943", "title": "Polish billionaire plans to sue Meta over fake advertisements", "date": "2024-08-13 03:45", "url": "https://www.timeslive.co.za/sunday-times-daily/world/2024-08-13-polish-billionaire-plans-to-sue-meta-over-fake-advertisements/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "169fc293-b291-4b14-9877-dcac1647c8de", "title": "The Constitution , Foreign Policy , and Deterrence : The Separation of Powers in a Dangerous World", "date": "2024-08-13 07:00", "url": "https://www.heritage.org/political-process/report/the-constitution-foreign-policy-and-deterrence-the-separation-powers", "domain": "heritage.org", "domain_classification": "Unknown", "message": "- 1 -the degree of constitutional ambiguity has permitted periods of enhanced congressional activism in foreign policy, particularly when supported by popular myth.\nI can identify at least seven time-proved advantages of presidential foreign policy control.\nBut in the post-Vietnam setting, Congress has pursued an opposite policy of focus on constrain i ng, publicly and in advance, American foreign policy options.\nAs an Act of Congress, the War Powers Act has no authority to alter the constitutional structure of the sepa ration of powers.\nWe also must begin to appraise congressional action--even if clearly within congressional competence--by a broad standard of contribution to an effective American foreign policy."}, {"id": "eea42f98-0384-48ca-980b-ebc543f3b38e", "title": "Pfizer Faces Challenges After COVID - 19 Vaccine Boom", "date": "2024-08-13 01:45", "url": "https://www.newser.com/story/354329/pfizer-faces-challenges-after-covid-19-vaccine-boom.html", "domain": "newser.com", "domain_classification": "Unknown", "message": "Two years post-pandemic boom, Pfizer now faces challenges as it tries to pivot from the lucrative success of its COVID-19 vaccine and antiviral Paxlovid.\nCEO Albert Bourla is spearheading a $3.5 billion cost reduction strategy, which includes layoffs, while investing in treatments for cancer and obesity.\nThis comes as the company's stock plummeted to nearly half its peak value due to unmet expectations for vaccine and antiviral sales.\nBourla noted in an interview that while COVID-19 products remain crucial, revenue predictions were halved to approximately $10 billion due to government contract disputes.\nFurthermore, the ongoing development of a once-daily obesity pill shows promise based on Phase 2 studies involving over 1,400 patients."}, {"id": "6fa22fe5-6439-401e-942a-bf9d6e082db7", "title": "  Can I complain while were at war ?: Ukraine domestic violence dilemma", "date": "2024-08-13 05:00", "url": "https://www.aol.co.uk/news/complain-while-war-ukraine-domestic-040010956.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Women are less likely to complain when it [domestic violence] involves war veterans Ivanna Kovalchuk“He became angry a lot, started listening to rock music and fought with his girlfriend.\nWith Russia’s war against Ukraine in its third year, many women in the country are now fighting their own battle, as the number of domestic violence cases increases significantly.\nAccording to Ukraine’s internal affairs ministry, police registered more than 291,000 cases of domestic violence across the country in 2023 – a 20% increase on the previous year, when the Russian invasion began.\nIn the first two months of this year, there was a 56% increase in complaints of domestic violence that were registered as criminal offences in Ukraine.\nIvanna Kovalchuk, who works on gender-based violence at the International Medical Corps, says: “We find that women are less likely to complain when it [domestic violence] involves war veterans."}, {"id": "7be72780-2666-4e53-80e4-8e789d7eb642", "title": "  Can I complain while were at war ?: Ukraine domestic violence dilemma | Global development", "date": "2024-08-13 04:30", "url": "https://www.theguardian.com/global-development/article/2024/aug/13/women-war-combat-ptsd-ukraine-domestic-violence-gender", "domain": "theguardian.com", "domain_classification": "International", "message": "Women are less likely to complain when it [domestic violence] involves war veterans Ivanna Kovalchuk“He became angry a lot, started listening to rock music and fought with his girlfriend.\nWith Russia’s war against Ukraine in its third year, many women in the country are now fighting their own battle, as the number of domestic violence cases increases significantly.\nAccording to Ukraine’s internal affairs ministry, police registered more than 291,000 cases of domestic violence across the country in 2023 – a 20% increase on the previous year, when the Russian invasion began.\nIn the first two months of this year, there was a 56% increase in complaints of domestic violence that were registered as criminal offences in Ukraine.\nPhotograph: Chris McGrath/GettyIvanna Kovalchuk, who works on gender-based violence at the International Medical Corps, says: “We find that women are less likely to complain when it [domestic violence] involves war veterans."}, {"id": "d8fe6164-e4ac-4037-bf9a-276126d43fbc", "title": "Tim Walz to Speak at Downtown LA Union Convention , Newport Beach Fundraiser", "date": "2024-08-13 02:45", "url": "https://mynewsla.com/business/2024/08/12/tim-walz-to-speak-at-downtown-la-union-convention-newport-beach-fundraiser-4/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Walz is also set to speak later Tuesday at a fundraising reception in Newport Beach, with ticket prices range from $1,000 to $100,000, according to the invitation.\nAttorney Wylie Aitken, a major fundraiser for Democrats in Orange County who is one of the event’s co-hosts, said he has been “blown away by the enthusiasm” for Walz’s appearance in Newport Beach.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County."}, {"id": "5d03d83c-c221-4827-905b-a9ee3e3cf0f9", "title": "Hillary Clinton Attempts to Rescue Tim Walz After Stolen Valor Claims", "date": "2024-08-13 02:45", "url": "https://www.breitbart.com/2024-election/2024/08/12/hillary-clinton-attempts-rescue-embattled-vice-president-pick-tim-walz-stolen-valor-claims/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hillary Clinton — who once falsely claimed she took sniper fire in Bosnia — attempted to come to the rescue of Minnesota Gov.\n“Tim Walz served honorably for two decades.\nThe post did not address Walz’s false claims over the last two decades of being a retired command sergeant major when he actually retired at a rank below.\nNor did her post address Walz’s false claim that he carried weapons “in war” when he never served in combat.\nThe Harris campaign actually posted that video on its X account before Walz’s false claims about his military record grew into a scandal."}, {"id": "c4a56642-50ae-4c63-bee5-93968bc36713", "title": "Red Sea ship attacked three times in suspected Houthi rebel assault", "date": "2024-08-13 11:30", "url": "https://katu.com/news/nation-world/red-sea-ship-attacked-three-times-in-suspected-yemens-houthi-rebel-assault-israel-hamas-war-iran-retaliation-assassination-hamas-official-ismail-haniyeh-middle-east-regional-war-fears-maritime-trade-routes", "domain": "katu.com", "domain_classification": "Unknown", "message": "A ship in the Red Sea came under attack at least three times Tuesday in an assault that included the use of a bomb-carrying drone boat, likely the latest in a campaign by Yemen's Houthi rebels over the Israel-Hamas war, officials said.\nThe ship was first attacked as an explosive was detonated near it, the British military's United Kingdom Maritime Trade Operations center said.\nThe private security firm Ambrey similarly reported the attacks, saying the ship saw \"two 'close-proximity' explosions.\"\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "d21b5784-d43e-4059-8733-98c013783b1e", "title": "Stop senseless killings", "date": "2024-08-13 07:15", "url": "https://jamaica-gleaner.com/article/letters/20240813/stop-senseless-killings", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "THE EDITOR, Madam:I was horrified to read the news of the mass murder in Four Paths, Clarendon, which left eight dead and nine injured.\nJamaica is at the place where persons can be at a location enjoying themselves and brutal beasts just spray them with lethal bullets.\nGreed and, as Jamaicans would say ‘bad mind’ are the underpinnings of these murders.\nWe have to be strong, united, and fight against these forces of darkness that are arrayed against the peace in this country.\nCondolences to the people of Cherry Tree Lane; they should cooperate with the authorities and help to catch the criminals."}, {"id": "400455ac-0f39-405f-a6c1-07143546826b", "title": "Tim Walz to Speak at Downtown LA Union Convention , Newport Beach Fundraiser", "date": "2024-08-13 02:45", "url": "https://mynewsla.com/business/2024/08/12/tim-walz-to-speak-at-downtown-la-union-convention-newport-beach-fundraiser-5/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Walz is also set to speak later Tuesday at a fundraising reception in Newport Beach, with ticket prices range from $1,000 to $100,000, according to the invitation.\nAttorney Wylie Aitken, a major fundraiser for Democrats in Orange County who is one of the event’s co-hosts, said he has been “blown away by the enthusiasm” for Walz’s appearance in Newport Beach.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County."}, {"id": "769e125f-1506-4f60-86bf-e1253938ce93", "title": "Tim Walz to Speak at Downtown LA Union Convention , Newport Beach Fundraiser", "date": "2024-08-13 07:00", "url": "https://mynewsla.com/business/2024/08/12/tim-walz-to-speak-at-downtown-la-union-convention-newport-beach-fundraiser-8/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Attorney Wylie Aitken, a major fundraiser for Democrats in Orange County who is one of the event’s co-hosts, said he has been “blown away by the enthusiasm” for Walz’s appearance in Newport Beach.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\n“From the Lyon Air Museum and Veterans Memorial in Orange to Heroes Hall in Costa Mesa and Sid Goldstein Freedom Park in Westminster, Orange County honors our veterans.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County."}, {"id": "ba3fbdd8-b369-44f0-879e-34489c380df4", "title": "Tim Walz to Speak at Downtown LA Union Convention , Newport Beach Fundraiser", "date": "2024-08-13 07:00", "url": "https://mynewsla.com/business/2024/08/12/tim-walz-to-speak-at-downtown-la-union-convention-newport-beach-fundraiser-7/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Attorney Wylie Aitken, a major fundraiser for Democrats in Orange County who is one of the event’s co-hosts, said he has been “blown away by the enthusiasm” for Walz’s appearance in Newport Beach.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\n“From the Lyon Air Museum and Veterans Memorial in Orange to Heroes Hall in Costa Mesa and Sid Goldstein Freedom Park in Westminster, Orange County honors our veterans.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County."}, {"id": "f71d0c87-076f-47a9-8560-1940696dcb61", "title": "Strange Famou OldBoy Rhymes Taps Myka 9 For JEL - Produced  LIFTOFF  ", "date": "2024-08-13 02:15", "url": "https://allhiphop.com/music/strange-famous-oldboy-rhymes-taps-myka-9-for-jel-produced-liftoff/", "domain": "allhiphop.com", "domain_classification": "Unknown", "message": "Strange Famous Records, the label owned by battle-tested MC Sage Francis, has released its latest single from OldBoy Rhymes.\nTitled “LIFTOFF,” the track features Freestyle Fellowship OG Myka 9 and production by Anticon’s JEL and comes from OldBoy Rhymes’ latest album, The Sane Asylum.\nAs explained in a press release, The Sane Asylum “is the war journal of a reluctant combatant fighting for loved ones who can’t.\n“Since I was a kid, rhyming has been an outlet that I’ve leaned on to process my perspective on life and society.”Produced primarily by Rhode Island rap vet Mopes (the artist formerly known as Prolyphic), The Sane Asylum is currently available via Strange Famous.\nFeatures and collaborations include Sage Francis, Akil (Jurassic 5), BlackLiq, Brother Ali, JEL, Mr. Lif, Myka 9, Runt (of Jivin Scientists), Tom Thum, Locksmith, Lee Reed and the late Zumbi of Zion I."}, {"id": "e1464445-3e6d-4ea8-82de-ff02e9c6682e", "title": "Chinese - owned ship  unintentionally  behind Baltic pipeline damage : Report | News", "date": "2024-08-13 00:00", "url": "https://gazette.com/news/wex/chinese-owned-ship-unintentionally-behind-baltic-pipeline-damage-report/article_0b637a82-d968-55f9-8329-3feb61da4d76.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "China has not answered “a legal aid request” from NATO allies investigating the damage done to an undersea pipeline linking Finland and Estonia last year, according to Estonian officials, following a report that Beijing acknowledged the involvement of a Chinese-owned ship.\nChinese authorities reportedly have acknowledged the ship’s involvement and described the incident as unintentional.\n“The South China Morning Post understands that the Chinese authorities conducted an internal investigation and recently communicated the results to governments in the European countries,” the Hong Kong-based media outlet reported on Monday.\nChinese officials emphasized “the poor sea conditions at the time” in the first weeks after the incident, which took place in October 2023.\nWestern officials have said they believe “a pro-Ukrainian group carried out the attack,” according to the New York Times."}, {"id": "c1b09855-f05a-419d-a78a-ddbb3981f03d", "title": "Red Sea ship attacked three times in suspected Houthi rebel assault", "date": "2024-08-13 11:30", "url": "https://www.wcyb.com/news/nation-world/red-sea-ship-attacked-three-times-in-suspected-yemens-houthi-rebel-assault-israel-hamas-war-iran-retaliation-assassination-hamas-official-ismail-haniyeh-middle-east-regional-war-fears-maritime-trade-routes", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "A ship in the Red Sea came under attack at least three times Tuesday in an assault that included the use of a bomb-carrying drone boat, likely the latest in a campaign by Yemen's Houthi rebels over the Israel-Hamas war, officials said.\nThe ship was first attacked as an explosive was detonated near it, the British military's United Kingdom Maritime Trade Operations center said.\nThe private security firm Ambrey similarly reported the attacks, saying the ship saw \"two 'close-proximity' explosions.\"\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "71209234-2872-4443-8541-6781247e4333", "title": "Pfizer trying to turn the page towards cancer and obesity treatments", "date": "2024-08-13 07:15", "url": "https://jamaica-gleaner.com/article/business/20240813/pfizer-trying-turn-page-towards-cancer-and-obesity-treatments", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Bourla has responded with a US$3.5 billion cost-cutting effort, including layoffs, and new investments in drugs for cancer and obesity.\nI think the two products you mentioned will continue to be very important products for Pfizer because COVID-19 will continue to be important.\nWe release chemotherapy into the body, and it is attacking the cancer cells, but at the same time, is also attacking the healthy cells.\nThey have a system, which is the antibody, that is programmed to identify the cancer cells among the billions of cells in our body and attach to them.\nWhere does Pfizer’s pill version of popular obesity injections fit into the marketplace?"}, {"id": "2061f172-cc33-4468-873a-ce32995b35a5", "title": "Red Sea ship attacked three times in suspected Houthi rebel assault", "date": "2024-08-13 13:15", "url": "https://foxbaltimore.com/news/nation-world/red-sea-ship-attacked-three-times-in-suspected-yemens-houthi-rebel-assault-israel-hamas-war-iran-retaliation-assassination-hamas-official-ismail-haniyeh-middle-east-regional-war-fears-maritime-trade-routes", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "A ship in the Red Sea came under attack at least three times Tuesday in an assault that included the use of a bomb-carrying drone boat, likely the latest in a campaign by Yemen's Houthi rebels over the Israel-Hamas war, officials said.\nThe ship was first attacked as an explosive was detonated near it, the British military's United Kingdom Maritime Trade Operations center said.\nThe private security firm Ambrey similarly reported the attacks, saying the ship saw \"two 'close-proximity' explosions.\"\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "cae3d642-778b-456a-a009-9e67bff92113", "title": "Army high - energy laser competition to kick off early next year", "date": "2024-08-13 01:30", "url": "https://www.defensenews.com/digital-show-dailies/smd/2024/08/12/armys-high-energy-laser-competition-to-kick-off-early-next-year/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The first prototypes consist of a 50-kilowatt laser from Raytheon.\n“That informed the Enduring High Energy Laser [broad agency announcement] that we put out,” Rasch said.\nIt’s really, I think, opened up the aperture on what we know about how to make effective laser systems,” Rasch said.\nThe Army has also learned about what will be needed to sustain directed energy systems in the Middle East.\nShe holds a Master of Science degree in journalism from Boston University and a Bachelor of Arts degree from Kenyon College."}, {"id": "80cc4520-7725-4085-8157-2a4b5bec66b7", "title": "What next for Ukraine incursion into Russia ? ", "date": "2024-08-13 04:45", "url": "https://www.army-technology.com/news/whats-next-for-ukraines-incursion-into-russia/", "domain": "army-technology.com", "domain_classification": "Unknown", "message": "Ukrainian forces ride a military vehicle in the Sumy region near the Ukraine-Russia border, 11 August 2024. Credit: Reuters.\nIn their path, Ukraine’s forces – comprising four brigades, possibly more – have encompassed several villages and most of the town of Sudzha, where there is a gas transit point.\n“Sustaining a force of any size in Russia, and defending against counter-attacks, will be hard, given the limited reserves available to Ukraine,” noted Savill.\nWalker adds that “this incursion is not going to be easily or quickly repelled by Russia either.\n“While the Ukrainians have reversed the public narrative about being on the defensive, it seems unlikely they would want to sustain a large incursion for months,” Savill adds."}, {"id": "e5c216b3-3eea-4741-953e-704913846a36", "title": "No more peace negotiations with Ukraine - PUTIN says as Ukraine makes more advances into Russian territory ( VIDEO ) ", "date": "2024-08-13 02:00", "url": "https://www.kenyan-post.com/2024/08/no-more-peace-negotiations-with-ukraine.html", "domain": "kenyan-post.com", "domain_classification": "Unknown", "message": "Monday, August 12, 2024 - Russian President, Vladimir Putin on Monday, August 12, said there is no need for peace negotiations with Ukraine saying its neighbour aims to improve its position in future negotiations with its invasion into the Russian region of Kursk since last week.\n“However, what kind of negotiations can we have with those who indiscriminately attack civilians and civilian infrastructure, or pose threats to nuclear power facilities?\nPutin said that Kyiv’s invasion also aims to stop Moscow’s advance in eastern Ukraine, adding that the main task of the Russian forces is to drive out Ukrainian troops from its territory.\nLast Tuesday, Russia said that Ukrainian troops, including tanks and armoured combat vehicles, attacked its military positions near two border settlements in the Kursk region.\nSince then, Moscow has reported that it has been repelling incursions into the border region by Ukrainian forces, in addition to countering airstrikes launched at Kursk and surrounding regions."}, {"id": "ee25ccfd-6359-491f-af93-29201c1cfe4f", "title": "Will the attacks on Walz military service stick like they did to Kerry 20 years ago ? ", "date": "2024-08-13 11:30", "url": "https://www.clickondetroit.com/news/politics/2024/08/13/will-the-attacks-on-walzs-military-service-stick-like-they-did-to-kerry-20-years-ago/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "“It is a very different world,” said Tad Devine, a senior adviser to Kerry’s 2004 campaign.\nKamala Harris' campaign has pushed back against the attacks, but some Democrats worry Republicans might succeed in turning Walz's military service into a liability.\nIn 2004, Kerry and President George W. Bush, the Republican nominee, took public funding, receiving $74.6 million each from the government, barring them from private donations.\nCould attacks on Walz’s 24 years of military service boomerang on the Republican standard-bearer?\nThe former president has been criticized for avoiding military service over claims he suffered from bone spurs."}, {"id": "2501e3c0-bd21-4e44-aee0-2de2fc47c2eb", "title": "Harris camp ducks questions on why Walz retired from military before completing coursework for high rank", "date": "2024-08-13 09:00", "url": "https://www.foxnews.com/politics/harris-camp-ducks-questions-why-walz-retired-from-military-before-completing-coursework-high-rank", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "The Harris campaign dodged answering questions about why Gov.\nAfter returning from Italy, Walz was promoted to the command sergeant major rank, but he did not complete coursework with the U.S. Army Sergeants Major Academy to retain the rank in retirement.\nWalz instead retired as a master sergeant, one rank below command sergeant major.\nThe Harris campaign said last week that Walz \"misspoke\" when he claimed he carried firearms \"in war.\"\nHe had put his retirement papers in 5-7 months prior to his retirement in May,\" the Minnesota National Guard said in a statement last week as questions mounted around Walz’s military career."}, {"id": "1503cf10-bc42-48e1-a905-a9d4c6ec4484", "title": "Will the attacks on Walz military service stick like they did to Kerry 20 years ago ? ", "date": "2024-08-13 11:45", "url": "https://www.clickorlando.com/news/politics/2024/08/13/will-the-attacks-on-walzs-military-service-stick-like-they-did-to-kerry-20-years-ago/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "“It is a very different world,” said Tad Devine, a senior adviser to Kerry’s 2004 campaign.\nKamala Harris' campaign has pushed back against the attacks, but some Democrats worry Republicans might succeed in turning Walz's military service into a liability.\nIn 2004, Kerry and President George W. Bush, the Republican nominee, took public funding, receiving $74.6 million each from the government, barring them from private donations.\nCould attacks on Walz’s 24 years of military service boomerang on the Republican standard-bearer?\nThe former president has been criticized for avoiding military service over claims he suffered from bone spurs."}, {"id": "5d507a0d-c101-48ba-b1e9-d0b9fd5fa6ca", "title": "106th Rescue Wing 1st HH - 60W Jolly Green II Takes Flight", "date": "2024-08-13 01:45", "url": "https://www.aero-news.net/GetMoreFromANN.cfm?do=main.textpost&id=CC7C212A-56CB-4EBB-B40F-F2AC2B884901", "domain": "aero-news.net", "domain_classification": "Unknown", "message": "The 106th Plans To Complete Aircrew Training On The New Model By MarchThe 106th Rescue Wing’s first HH-60W Jolly Green II search and rescue helicopter made its inaugural flight from Francis S. Gabreski Air National Guard Base Aug. 4.\nThe new version of the HH-60 rescue helicopter takes its “Jolly Green II” nickname from the Sikorsky HH-3 helicopter’s search and rescue wings used from the 1960s until 1991.\nThe 106th Rescue Wing, based at Francis S. Gabreski Air National Guard Base in Westhampton Beach, New York, operates and maintains the HC-130J Combat King II search and rescue aircraft and the HH-60G Pave Hawk rescue helicopter.\nThe wing is home to a special warfare squadron with pararescuemen and combat rescue officers specializing in rescue and recovery and deploys for domestic and overseas operations.\n(ANN Salutes Senior Airman Sarah McKernan, 106th Rescue Wing, for the story)."}, {"id": "93ebbf53-5612-4a19-b058-8b6056e0b98b", "title": "106th Rescue Wing 1st HH - 60W Jolly Green II Takes Flight", "date": "2024-08-13 00:30", "url": "https://www.aero-news.net/subsite.cfm?do=main.textpost&id=CC7C212A-56CB-4EBB-B40F-F2AC2B884901", "domain": "aero-news.net", "domain_classification": "Unknown", "message": "The 106th Plans To Complete Aircrew Training On The New Model By MarchThe 106th Rescue Wing’s first HH-60W Jolly Green II search and rescue helicopter made its inaugural flight from Francis S. Gabreski Air National Guard Base Aug. 4.\nThe new version of the HH-60 rescue helicopter takes its “Jolly Green II” nickname from the Sikorsky HH-3 helicopter’s search and rescue wings used from the 1960s until 1991.\nThe 106th Rescue Wing, based at Francis S. Gabreski Air National Guard Base in Westhampton Beach, New York, operates and maintains the HC-130J Combat King II search and rescue aircraft and the HH-60G Pave Hawk rescue helicopter.\nThe wing is home to a special warfare squadron with pararescuemen and combat rescue officers specializing in rescue and recovery and deploys for domestic and overseas operations.\n(ANN Salutes Senior Airman Sarah McKernan, 106th Rescue Wing, for the story)."}, {"id": "97930e74-93ac-4c4c-bf3b-f478b6200ef1", "title": "Virginia school district makes U - turn on Confederate names", "date": "2024-08-13 14:15", "url": "https://www.yahoo.com/news/virginia-school-district-makes-u-133538794.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Briana Brown and A.D. Carter are starting their senior year of high school in Shenandoah County on Tuesday.\nBut their pride ends when it comes to the school’s name - Stonewall Jackson High School, named after a prominent Confederate general in America’s Civil War.\nBut just four years later, the school board reversed its decision, changing back to the original name honouring the Confederate general.\nAmong the common school names targeted are Jackson, founding father Thomas Jefferson, who owned slaves, and Confederate General Robert E. Lee.\nWhen the school board voted 5-1 to remove the name of Stonewall Jackson from the high school, in 2020, it stirred up local debate."}, {"id": "df67983e-a3b9-4789-9e8b-82bc56dbe819", "title": "Czech Republic swap equipment for Leopard 2A4 tanks", "date": "2024-08-13 04:45", "url": "https://www.army-technology.com/news/czech-republic-swap-equipment-for-leopard-2a4-tanks/", "domain": "army-technology.com", "domain_classification": "Unknown", "message": "Picture of a Leopard 2A4 deployed by the Czech Army, 10 May 2024. Credit: Shutterstock/TLF.\nThe German government has orchesterated a deal with the Czech Ministry of Defence to furnish it with 14 Leopard 2A4 main battle tanks (MBTs) and a single ARV 3 Buffalo armoured recovery vehicle in exchange for equipment bound for Ukraine.\nTick here to opt out of curated industry news, reports, and event updates How well do you really know your competitors?\nCurrently, the Czech Army operate 14 Leopard 2A4 units, and by the end of the MBT delivery, this will amount to 28 MBTs.\nA systematic solution to procurementThis swap scheme, which Germany calls its ‘Ringtausch’ (‘Ring swap’) initiative, is not the first of its kind."}, {"id": "d5a92816-edb4-4f88-8640-00ddf855be7e", "title": "Tim Walz makes a 5 - state dash for campaign cash this week , traveling solo for first time as running mate", "date": "2024-08-13 09:15", "url": "https://www.pressdemocrat.com/article/news/tim-walz-makes-a-5-state-dash-for-campaign-cash-this-week-traveling-solo-f/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "Tim Walz is branching out this week and holding his first solo events as Vice President Kamala Harris ’ running mate, making a five-state dash for campaign cash and addressing a key union gathering.\nWalz's focus on fundraising this week comes after he stormed through a series of battleground states with Harris last week to introduce himself to voters nationally.\nOhio Sen. JD Vance, who was announced as Republican Donald Trump 's running mate during the GOP convention in Milwaukee, had his own rollout largely overshadowed by unforeseen events.\nWalz has salted his early campaign appearances with talk of joy and positivity, stressing that he and Harris are championing being kind and neighborly.\nThe senator has also suggested that Harris chose Walz over another contender for running mate, Pennsylvania Gov."}, {"id": "05a2548b-c5e0-435b-af33-999c1e77f64b", "title": "Ukraine Russia gambit punctures Putin veneer of invincibility once again", "date": "2024-08-13 13:30", "url": "https://us.cnn.com/2024/08/13/europe/ukraine-incursion-russia-analysis-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —It is another coin-flip in a conflict punctuated with at least annual reminders of how frail Vladimir Putin’s Russia truly is.\nIt is purposefully unclear exactly where Ukraine’s forces are.\nIt is also unclear where Ukrainian forces are digging in and where they are just racing through.\nThis time it is Putin’s own FSB, who couldn’t keep control of the borders, in Putin’s war of choice.\nResidents of an apartment building damaged after shelling by the Ukrainian side stand near the building in Kursk, Russia, on Sunday."}, {"id": "113ff67b-7c99-45f3-80cd-772cf747357a", "title": "Ukraine penetrates into Kursk , Putin vows  worthy response  ", "date": "2024-08-13 12:45", "url": "https://www.albawaba.com/news/ukraine-penetrates-kursk-putin-vows-1581243", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Ukraine's senior commander says his forces have conquered 1,000 square kilometers of the Kursk region, while Russian President Vladimir Putin promises a \"worthy response\".\nWith Russia still battling to stop the surprise assault a week later, Ukraine's senior commander, Oleksandr Syrskyi, informed President Volodymyr Zelenskiy via video, saying the push into Russian territory was underway.\nIn a video published on Volodymyr Zelenskyy's Telegram channel, Syrskyi said \"We continue to conduct an offensive operation in the Kursk region.\n“The enemy will receive a worthy response,\" he said.\nAccording to regional governor Alexei Smirnov, 121,000 people have fled the Kursk region since the combat began, which has killed at least 12 civilians and injured 121 more."}, {"id": "e21a73c8-ae9a-4d09-b13f-7bd528da55c1", "title": "The Only Thing That Can Save Us", "date": "2024-08-13 04:30", "url": "https://www.theyeshivaworld.com/news/promotions/2305208/the-only-thing-that-can-save-us.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "CLICK HERE TO DONATEWe all know the situation in Eretz Yisroel today.\nThey are the battalion that is ensuring the safety of Klal Yisroel every single day.\nIn previous weeks, communities around the world rallied with unparalleled unity to heed the call of our gedolim and save the Torah learning of Eretz Yisroel.\nWednesday, July 24, saw Klal Yisroel come out en masse in support of Keren Olam HaTorah, exceeding the audacious fundraising goal of $10 Million in one night.\nThe zechus of their Torah learning, along with the incredible unity Klal Yisroel around the world has displayed in trying to save it, will ultimately bring us back to Yerushalayim and the third Bais HaMikdash."}, {"id": "e0ed01af-84c0-497c-b62f-9e663dff5c67", "title": "First Thing : Ukraine says it has seized 1 , 000 sq km of Russia as Putin vows  worthy response  | US news", "date": "2024-08-13 11:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/13/first-thing-ukraine-seized-1000-sq-km-russia-putin-worthy-response", "domain": "theguardian.com", "domain_classification": "International", "message": "Ukraine’s top commander says the army has seized 1,000 sq km (386 sq miles) of Russia’s bordering Kursk region a week into its surprise incursion, while the Russian president, Vladimir Putin, has promised a “worthy response” to the attack.\n“We continue to conduct an offensive operation in the Kursk region.\nZelenskiy said on Monday that Russia had used the Kursk region to launch many strikes.\nNancy Pelosi rebukes former Australian PM Paul Keating over ‘stupid statement’ on TaiwanView image in fullscreen Nancy Pelosi and Paul Keating.\nLast Thing: Why you, too, should avoid airplane fightsView image in fullscreen Tensions can rise quickly on a plane."}, {"id": "66bcbe73-54a2-4be2-ba81-27a4541119ef", "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia Kursk region", "date": "2024-08-13 02:15", "url": "https://www.stltoday.com/news/nation-world/top-ukrainian-commander-says-his-forces-now-control-almost-390-square-miles-of-russias-kursk/article_bfa4de26-c0fb-5ba2-bdf4-ff1b19339261.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine's top military commander said Monday his forces control 386 square miles of Russia's neighboring Kursk region, the first time a Ukrainian military official publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces pushed 7.5 miles into the Kursk region across a 25-mile front and control 28 Russian settlements.\nThe governor of the Belgorod region adjacent to Kursk also announced the evacuation of people from a district near the Ukrainian border."}, {"id": "36dd4488-635c-45b1-936c-c56185e2e894", "title": "Will the attacks on Walz military service stick like they did to Kerry 20 years ago ? ", "date": "2024-08-13 11:30", "url": "https://www.smdailyjournal.com/news/national/will-the-attacks-on-walzs-military-service-stick-like-they-did-to-kerry-20-years/article_ba526e4b-bd24-508b-8e5f-80419a3f509b.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "09925957-39ae-41c5-89d7-4847476680a3", "title": "Ilhan Omar fights for reelection after  the Squad  sees major losses : What to know about Tuesday primary", "date": "2024-08-13 09:45", "url": "https://www.yahoo.com/news/ilhan-omar-fights-reelection-squad-091634729.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ilhan Omar fights for reelection after 'the Squad' sees major losses: What to know about Tuesday's primaryRep. Ilhan Omar, D-Minn., a member of the progressive set of lawmakers known as “the Squad,” faces a fight for her political life on Tuesday in a closely watched showdown.\nThe two also competed in the district’s 2022 primary, a race that came down to just a few thousand votes.\nIlhan Omar's 2022 rematchFirst, let’s catch up on Omar and Samuels’ 2022 race.\nIt was much closer than her 2020 reelection primary, which she handily won by a little more than 35,000.\nContributing: Phillip Bailey and Karissa Waddick, USA TODAYThis article originally appeared on USA TODAY: Ilhan Omar fights for reelection after 'the Squad' sees major losses"}, {"id": "b91660c4-af40-4de3-8b65-e56762719db8", "title": "This Arkansas man is believed to have the highest number of recorded kills in the U . S . Marines", "date": "2024-08-13 02:30", "url": "https://www.yahoo.com/news/arkansas-man-believed-highest-number-002118350.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This Arkansas man is believed to have the highest number of recorded kills in the U.S. MarinesThis Arkansas man is believed to have the highest number of recorded kills in the U.S. MarinesFAYETTEVILLE, Ark.\nMeet Gunnery Sergeant Carlos Norman “Gunny” Hathcock II, who is believed to hold the highest number of recorded kills in the United States Marine Corps (USMC), according to the Encyclopedia of Arkansas.\nEarly and personal lifeU.S. Marine sniper Carlos Norman “Gunny” Hathcock II in Vietnam in the 1960s.\nMilitary careerHathcock had 93 confirmed sniper kills during the Vietnam War.\nCarlos Hathcock, Jr., standing by."}, {"id": "45a53298-067d-40fd-971e-88e34f890ee4", "title": "Russia intensifies attacks in eastern Ukraine as it fights against Kyiv cross - border incursion – Winnipeg Free Press", "date": "2024-08-13 13:00", "url": "https://www.winnipegfreepress.com/world/2024/08/13/russia-intensifies-attacks-in-eastern-ukraine-as-it-fights-against-kyivs-cross-border-incursion", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Meanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said that Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, barrel artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nPolish Prime Minister Donald Tusk said Tuesday that he backed the Ukrainian operation, though he said Kyiv officials didn’t consult him about it beforehand.\nUkraine’s undermanned army has been struggling to hold back the bigger and better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely-guarded military secret."}, {"id": "935aadb1-3a71-4d59-a3c9-aa9e71522b6c", "title": "Mustard gas , no mask : This WWI corpsman somehow survived Belleau Wood", "date": "2024-08-13 00:00", "url": "https://www.militarytimes.com/news/your-military/2024/08/12/mustard-gas-no-mask-this-wwi-corpsman-somehow-survived-belleau-wood/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "We just got here!”Williams’ statement came at the outset of a 25-day confrontation between the Marines and Germans at Belleau Wood.\nIn December 1916 he entered the Navy as a lieutenant junior grade, eventually earning the rank of lieutenant in 1918 before being assigned to support the 5th Marines in France.\nBefore sunrise that morning Lt. Col. Frederic Wise’s 2nd Battalion, 5th Marines — including Capt.\nFive Marines were awarded the Medal of Honor for actions there, as was Navy Corpsman Lt. Orlando Petty.\nHis family said his health had been deteriorating, with evidence pointing toward his exposure to mustard gas at Belleau Wood."}, {"id": "292c510f-e43d-4e64-8a6e-a8f2441783ce", "title": "Mustard gas , no mask : This WWI corpsman somehow survived Belleau Wood", "date": "2024-08-13 00:30", "url": "https://www.marinecorpstimes.com/news/your-military/2024/08/12/mustard-gas-no-mask-this-wwi-corpsman-somehow-survived-belleau-wood/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "We just got here!”Williams’ statement came at the outset of a 25-day confrontation between the Marines and Germans at Belleau Wood.\nIn December 1916 he entered the Navy as a lieutenant junior grade, eventually earning the rank of lieutenant in 1918 before being assigned to support the 5th Marines in France.\nBefore sunrise that morning Lt. Col. Frederic Wise’s 2nd Battalion, 5th Marines — including Capt.\nFive Marines were awarded the Medal of Honor for actions there, as was Navy Corpsman Lt. Orlando Petty.\nHis family said his health had been deteriorating, with evidence pointing toward his exposure to mustard gas at Belleau Wood."}, {"id": "b01801e7-2223-48bf-93c7-e4807d56541b", "title": "Town of Nichols deals with flooding days after TS Debby landfall", "date": "2024-08-13 00:00", "url": "https://wpde.com/news/local/nichols-flooding-roads-closed-tropical-storm-debby-landfall-rain-wind-mayor-lawson-battle-little-pee-dee-river-water-levels-crest-south-carolina", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Nichols is still dealing with the effects of Tropical Storm Debby, which made landfall in South Carolina last week.\nABC15 crews tried getting to the Town Hall to speak with Mayor Lawson Battle, however, couldn't due to flooding and roads being closed.\nHe said right now they are keeping an eye on the water level and will see what happens in the upcoming days.\nBattle told ABC15 that some low-lying homes have water inside, but for the most part, are not damaged.\nThe Little Pee Dee River crested on Sunday and Battle said officials will continue to keep an eye on it."}, {"id": "84af6d3f-35bf-444c-94ae-e51272fd442f", "title": "  Women contribution fundamental to achieving Qatar National Vision  ", "date": "2024-08-13 01:15", "url": "https://www.gulf-times.com/article/688530/qatar/womens-contribution-fundamental-to-achieving-qatar-national-vision", "domain": "gulf-times.com", "domain_classification": "Unknown", "message": "HE the Deputy Speaker of the Shura Council Dr Hamda bint Hassan al-Sulaiti speaking at the event.\nHE the Deputy Speaker of the Shura Council Dr Hamda bint Hassan al-Sulaiti underlined Qatar’s great interest in enhancing the status of women as one of the fundamental pillars in achieving Qatar National Vision 2030.\nShe called for providing security for Palestinian women and guaranteeing their basic rights, like other women in the world.\nThe ‘Investing in Women’s Participation in Political Life’ forum discusses, through its discussion panels and sessions, “the challenges of women’s participation in public life” and the importance of investing in women’s energies, women’s electoral experience, and the role of the media in enhancing their participation in public life.\nThe forum will also witness the launch of the second edition of the Guide to Combating Violence against Women in Public Life."}, {"id": "6ab77f65-7025-4685-b4db-44a616aa169c", "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia Kursk region - Boston News , Weather , Sports", "date": "2024-08-13 01:00", "url": "https://whdh.com/news/top-ukrainian-commander-says-his-forces-now-control-almost-390-square-miles-of-russias-kursk-region/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine (AP) — Ukraine’s top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia’s neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "10cc9899-a0b5-413c-8e32-36b64541a3d9", "title": "Russians evacuated from Kursk as Putin grapples with Ukrainian incursion", "date": "2024-08-13 00:45", "url": "https://www.theday.com/nation/20240812/russians-evacuated-from-kursk-as-putin-grapples-with-ukrainian-incursion/", "domain": "theday.com", "domain_classification": "Unknown", "message": "(Ministry of Emergency Situations press service via AP)A woman evacuated from a fighting between Russian and Ukrainian forces in Kursk region chooses clothes at a temporary residence center in Kursk, Russia, Monday, Aug. 12, 2024.\nUkrainian and Russian officials alike have noted that the operation marks the first military invasion of Russia since World War II.\nSmirnov said 121,000 people had been evacuated from the Kursk region to date.\nPodolyaka reported that Ukrainian military personnel had managed to take Gordeyevka village and were attacking Martynovka village.\nUkrainian military officials have declined to comment on the surprise operation, and government officials have been similarly tight-lipped."}, {"id": "67c366f7-3f85-4417-8e94-0a15a3579d57", "title": "France set to remember African role in WWII Provence landings", "date": "2024-08-13 11:30", "url": "https://www.khaleejtimes.com/world/europe/france-set-to-remember-african-role-in-wwii-provence-landings", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Goumiers, auxiliary soldiers supplied to the French army by Algerian or Moroccan tribes, march in Paris on July 14, 1945.\nOn August 15, 1944, some 100,000 American, British and Canadian troops landed on the beaches of the Var region on the French Riviera.\nThey were followed by 250,000 Free French soldiers, recruited mostly from French overseas colonies in Africa with the aim of recapturing key port cities Marseille and Toulon from the German occupiers.\nIt took decades for post-war France to highlight the crucial role of non-white soldiers in the fighting.\nMacron's 2019 call to name streets in France after African combatants has largely gone unheeded, although many French towns remember the African contributions in their own way, including on monuments and memorial sites."}, {"id": "e962757b-d332-413a-b673-d3b8b6fd5d0b", "title": "Mustard gas , no mask : This WWI corpsman somehow survived Belleau Wood", "date": "2024-08-13 00:45", "url": "https://www.navytimes.com/news/your-military/2024/08/12/mustard-gas-no-mask-this-wwi-corpsman-somehow-survived-belleau-wood/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "We just got here!”Williams’ statement came at the outset of a 25-day confrontation between the Marines and Germans at Belleau Wood.\nIn December 1916 he entered the Navy as a lieutenant junior grade, eventually earning the rank of lieutenant in 1918 before being assigned to support the 5th Marines in France.\nBefore sunrise that morning Lt. Col. Frederic Wise’s 2nd Battalion, 5th Marines — including Capt.\nFive Marines were awarded the Medal of Honor for actions there, as was Navy Corpsman Lt. Orlando Petty.\nHis family said his health had been deteriorating, with evidence pointing toward his exposure to mustard gas at Belleau Wood."}, {"id": "9768542b-07ca-4c8d-bbc6-6b1b2e94596c", "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia Kursk region", "date": "2024-08-13 03:00", "url": "https://www.wfmz.com/news/top-ukrainian-commander-says-his-forces-now-control-almost-390-square-miles-of-russias-kursk/article_0a8588c5-bf5d-57b7-aa78-c274210dcadb.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "In this photo taken from video released by the Russian Defense Ministry on Sunday, Aug. 11, 2024, Ka-52 helicopters gunships of the Russian air force take off to air strike on concentrations of manpower, armored vehicles and automobile military equipment of the Ukrainian Armed Forces in the border area of the Kursk region.\n(Russian Defense Ministry Press Service via AP)"}, {"id": "c2d050ad-540e-46cc-88b2-0f137b28a658", "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia Kursk region", "date": "2024-08-13 04:15", "url": "https://economictimes.indiatimes.com/news/defence/top-ukrainian-commander-says-his-forces-now-control-almost-390-square-miles-of-russias-kursk-region/articleshow/112482209.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "He did not elaborate.The Ukrainian operation is under tight secrecy, and its goals remain unclear.\nHe said Russian forces will carry on with their offensive in eastern Ukraine regardless.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.Smirnov said 12 civilians have been killed and 121 others, including 10 children, have been wounded.\n\"Regrettably, the group of forces protecting the border didn't have its own intelligence assets,\" he said on his messaging app channel.\n\"The combat inside Russia rekindled questions about whether Ukraine was using weaponry supplied by NATO members."}, {"id": "2f2c2550-6e5f-471a-8ef8-2bc28b499e00", "title": "Ukrainian Army Chief says his forces now control almost 1000 square kilometres of Russia Kursk region", "date": "2024-08-13 06:45", "url": "https://www.thehindu.com/news/international/top-ukrainian-commander-says-his-forces-now-control-almost-390-square-miles-of-russias-kursk-region/article68519241.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Russian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nMr. Zelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nHe said Russian forces will carry on with their offensive in eastern Ukraine regardless.\nKursk residents recorded videos lamenting that they had to flee the border area, leaving behind their belongings, and pleading with Mr. Putin for help.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "35b4c032-47e6-46e1-a5bd-8460cfa50dbe", "title": "  Women Contribution Fundamental To Achieving Qatar National Vision  ", "date": "2024-08-13 03:45", "url": "https://menafn.com/1108547131/Womens-Contribution-Fundamental-To-Achieving-Qatar-National-Vision", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) HE the Deputy Speaker of the Shura Council Dr Hamda bint Hassan al-Sulaiti underlined Qatar's great interest in enhancing the status of women as one of the fundamental pillars in achieving Qatar National Vision 2030.\nShe called for providing security for Palestinian women and guaranteeing their basic rights, like other women in the world.\nThe 'Investing in Women's Participation in Political Life' forum discusses, through its discussion panels and sessions,“the challenges of women's participation in public life” and the importance of investing in women's energies, women's electoral experience, and the role of the media in enhancing their participation in public life.\nThe forum will also witness the launch of the second edition of the Guide to Combating Violence against Women in Public Life.\nOn the sidelines of the Forum, HE the deputy Speaker met with Wafa Bani Mustafa, Minister of Social Development, Head of the Ministerial Committee for Women's Empowerment in Jordan."}, {"id": "28c89e1a-8118-4a13-ab2a-ccdb42ea7c8b", "title": "Tim Walz is making a five - state dash for campaign cash , traveling solo for first time as Harri running mate", "date": "2024-08-13 00:45", "url": "https://www.theglobeandmail.com/world/article-walz-is-making-a-five-state-dash-for-campaign-cash-traveling-solo-for/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Tim Walz speaks at a campaign rally on Aug. 10, 2024, in Las Vegas.Julia Nikhinson/The Associated PressMinnesota Gov.\nTim Walz is branching out this week and holding his first solo events as Vice President Kamala Harris ' running mate, making a five-state dash for campaign cash and addressing a key union gathering.\nOhio Sen. JD Vance, who was announced as Republican Donald Trump ‘s running mate during the GOP convention in Milwaukee, had his own rollout largely overshadowed by unforeseen events.\nWalz has salted his early campaign appearances with talk of joy and positivity, stressing that he and Harris are championing being kind and neighborly.\nThe senator has also suggested that Harris chose Walz over another contender for running mate, Pennsylvania Gov."}, {"id": "56667c8f-5d35-4401-bbb3-f8475c95c420", "title": "Ukraine wants more negotiating power as forces advance into Russia , humiliating Moscow", "date": "2024-08-13 07:30", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-wants-more-negotiating-power-as-forces-advance-into-russia-humiliating-moscow/5700463/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Ukraine believes the incursion will give it \"leverage\" and \"negotiating power\" in future initiatives to achieve a \"just peace.\"\nOne week on from the launch of the border raid and information is slowly emerging as to the size and scale of Ukraine's operation on Russian soil, and its objectives.\nRevealing further details in his first public comments on the Kursk operation, Ukraine's top military commander, Gen. Oleksandr Syrskyi, said Monday that Ukraine now controls around 1,000 square kilometers (386 square miles) of the region.\nRussian official Alexei Smirnov, the acting governor of the Kursk region, told a solemn-looking Putin via videoconference Monday that Ukraine controlled 28 settlements.\nGeopolitical analysts said the Kursk operation needed to be watched closely and could herald a breakthrough in the war."}, {"id": "aa2d2b10-8754-4175-9c6a-9e0ab415cfdd", "title": "FARK . com : Fark Video Player ( 13355502 ) Day 902 of WW3 : Well , well , well , how about that ? Claim : Kadyrovites secretly concluded an agreement with Ukraine on Kursk region and stood aside for Ukrainian troops . Betrayal ? In Russia ? Where my...", "date": "2024-08-13 13:30", "url": "https://www.fark.com/vidplayer/13355502", "domain": "fark.com", "domain_classification": "Unknown", "message": "MainDiscussionSportsBusinessSTEMEntertainmentFandomD'awwwFoodPoliticsKadyrovites secretly concluded an agreement with Ukraine on Kursk region#Kanal13 #likekanal13 #subscribekanal13 #warinukrainehttps://www.youtube.com/user/kanal13az?sub_confirmation=1 - SUBSCRIBE TO US!\nKadyrov's men understood the balance of power and did not want to lose their fighters by simply allowing the Ukrainian Armed Forces to penetrate deep into Russia.\nEarlier, Z-war correspondent Kotenok told the truth about the \"battles\" of \"Kadyrov's Tik-Tokers\" against the Armed Forces of Ukraine in the Kursk region.\nAt present the Ukrainian Armed Forces successfully advanced further in the Kursk region.\nIt is also noted that in favor of such tactics on the part of the Ukrainian Armed Forces, \"this would force them to pull back some of the efforts of the \"fire brigades\" from Sudzha and Korenevo.\""}, {"id": "3c9ef7cd-7e36-4f1b-ae47-38051ed21c0f", "title": "Russia Kursk region has had 386 miles seized by Ukraine – NBC New York", "date": "2024-08-13 02:45", "url": "https://www.nbcnewyork.com/news/national-international/ukraine-seized-miles-russias-kursk-region/5699720/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "2f0ae09e-c82d-4fcf-9887-8e5cf71ceee6", "title": "Ukrainian forces claim almost 390 square miles in Russia Kursk region", "date": "2024-08-13 12:00", "url": "https://www.wcti12.com/news/nation-world/ukrainian-forces-top-military-commander-claim-almost-390-square-miles-in-russias-kursk-region-lightning-incursion-kremlin-putin-zelenskyy-civilians-flee-kyiv-moscow-leverage-peace-talks-war", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring , the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "ec049e2e-cace-42b8-8532-bac86b62ec50", "title": "Ukraine wants more negotiating power as forces advance into Russia , humiliating Moscow", "date": "2024-08-13 09:45", "url": "https://www.nbcdfw.com/news/business/money-report/ukraine-wants-more-negotiating-power-as-forces-advance-into-russia-humiliating-moscow/3619884/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Ukraine believes the incursion will give it \"leverage\" and \"negotiating power\" in future initiatives to achieve a \"just peace.\"\nOne week on from the launch of the border raid and information is slowly emerging as to the size and scale of Ukraine's operation on Russian soil, and its objectives.\nRevealing further details in his first public comments on the Kursk operation, Ukraine's top military commander, Gen. Oleksandr Syrskyi, said Monday that Ukraine now controls around 1,000 square kilometers (386 square miles) of the region.\nRussian official Alexei Smirnov, the acting governor of the Kursk region, told a solemn-looking Putin via videoconference Monday that Ukraine controlled 28 settlements.\nGeopolitical analysts said the Kursk operation needed to be watched closely and could herald a breakthrough in the war."}, {"id": "fb6a1927-20ce-4c16-9635-355227b7a4f2", "title": "What does Ukraine want from its incursion into Russia ? ", "date": "2024-08-13 07:15", "url": "https://www.cnbc.com/2024/08/13/what-does-ukraine-want-from-its-incursion-into-russia.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "One week on from the launch of the border raid and information is slowly emerging as to the size and scale of Ukraine's operation on Russian soil, and its objectives.\nRussian official Alexei Smirnov, the acting governor of the Kursk region, told a solemn-looking Putin via videoconference Monday that Ukraine controlled 28 settlements.\n: Ukrainian soldiers run for shelter from Russian army attacks as the war between Russia and Ukraine continues in the city of Toretsk, Donetsk, Ukraine, on July 5, 2024.\nGeopolitical analysts said the Kursk operation needed to be watched closely and could herald a breakthrough in the war.\nGovernor of Kursk region telegram channel via AP"}, {"id": "7ee8ebe2-87e5-4e59-956e-4fdf0ac7e5d2", "title": "Attacks On Walz Service Lies Are Only Just Beginning , Trump Insiders Say", "date": "2024-08-13 00:00", "url": "https://dailycaller.com/2024/08/12/tim-walz-military-record-national-guard-swift-boat-chris-lacivita/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Tim Walz as his military falsehoods were exposed.\nDespite the media’s best efforts, attacks on Walz’s years of lies aren’t going anywhere, Trump campaign insiders told the Daily Caller.\nLaCivita, now running the Trump campaign, and his staff will continue to hammer the message, using its own veteran Sen. J.D.\nKamala Harris has done as many tough interviews as Tim Walz has battlefield deployments.\n“I would say the only dishonesty we should be talking about is Walz’s regarding his military service,” Ryun told the Caller."}, {"id": "057ed1e4-720e-4d30-be9d-7ce2cfcc2f8d", "title": "Russia Kursk region has had 386 miles seized by Ukraine – NBC 5 Dallas - Fort Worth", "date": "2024-08-13 04:30", "url": "https://www.nbcdfw.com/news/national-international/ukraine-seized-miles-russias-kursk-region/3619756/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "ddcf035e-4564-4060-b018-c23ced9dae4c", "title": "China Is in Denial About the War in Ukraine", "date": "2024-08-13 06:15", "url": "https://www.foreignaffairs.com/china/china-denial-about-war-ukraine", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "China has, in fact, incurred costs as a result of Putin’s war and Beijing’s economic and diplomatic support for it.\nThese blind spots matter because in China, the war in Ukraine is serving as both an observatory and a laboratory as the country prepares for heightened geopolitical conflict with the United States.\nThat effort offered a “vivid demonstration of the tools of economic power” that the United States could muster, Li wrote.\nAlthough Western sanctions have not broken the Russian economy, the war in Ukraine has spurred further global economic fragmentation.\nRussia’s war on Ukraine offers general lessons about the complexities of modern warfare, the possibilities for an international response to a purportedly regional dispute, and the costs of a protracted military conflict."}, {"id": "9850c04d-304b-4ac8-b1f5-2d3efe8c3b2e", "title": "Ukrainian forces claim almost 390 square miles in Russia Kursk region", "date": "2024-08-13 11:30", "url": "https://katu.com/news/nation-world/ukrainian-forces-top-military-commander-claim-almost-390-square-miles-in-russias-kursk-region-lightning-incursion-kremlin-putin-zelenskyy-civilians-flee-kyiv-moscow-leverage-peace-talks-war", "domain": "katu.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring , the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "70829d5f-a4ae-43aa-8da2-965d0c171929", "title": "Walz is making a 5 - state dash , traveling solo for 1st time as Harri running mate", "date": "2024-08-13 01:00", "url": "https://www.pressherald.com/2024/08/12/walz-is-making-a-5-state-dash-for-campaign-cash-traveling-solo-for-1st-time-as-harris-running-mate/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Tim Walz is branching out this week and holding his first solo events as Vice President Kamala Harris ’ running mate, making a five-state dash for campaign cash and addressing a key union gathering.\nWalz’s focus on fundraising this week comes after he stormed through a series of battleground states with Harris last week to introduce himself to voters nationally.\nOhio Sen. JD Vance, who was announced as Republican Donald Trump’s running mate during the GOP convention in Milwaukee, had his own rollout largely overshadowed by unforeseen events.\nThe senator has also suggested that Harris chose Walz over another contender for running mate, Pennsylvania Gov.\nTrump is 78, Harris is 59 and Walz is 60."}, {"id": "0b94ca78-4ebf-46db-a3a8-637737f8843b", "title": "Russia Kursk region has had 386 miles seized by Ukraine – NBC Los Angeles", "date": "2024-08-13 03:15", "url": "https://www.nbclosangeles.com/news/national-international/ukraine-seized-miles-russias-kursk-region/3486594/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "804b9bd8-2b37-4461-8e84-751a7905d27a", "title": "Russia Kursk region has had 386 miles seized by Ukraine – NBC 7 San Diego", "date": "2024-08-13 01:00", "url": "https://www.nbcsandiego.com/news/national-international/ukraine-seized-miles-russias-kursk-region/3596010/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}, {"id": "03dde8ab-d9af-4705-8c11-f8716077a645", "title": "Russia Kursk region has had 386 miles seized by Ukraine – NBC Bay Area", "date": "2024-08-13 04:00", "url": "https://www.nbcbayarea.com/news/national-international/ukraine-seized-miles-russias-kursk-region/3623654/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.\nRussian forces are still scrambling to respond to the surprise Ukrainian attack after almost a week of fierce fighting.\nZelenskyy confirmed for the first time that the Ukrainian military is inside the Kursk region.\nAlexei Smirnov reported to Putin that Ukrainian forces had pushed 12 kilometers (7.5 miles) into the Kursk region across a 40-kilometer (25-mile) front and currently control 28 Russian settlements.\nThe ministry said Russian forces also blocked an attempt by Ukrainian mobile groups to forge deep into Russian territory near Kauchuk."}]