[{"id": "c2982cb9-3ee6-4f77-84a3-ea8d549f184d", "title": "Probe finds two universities failed to protect Jewish and Muslim students", "date": "2024-06-18 00:45", "url": "https://www.adn.com/nation-world/2024/06/17/probe-finds-two-universities-failed-to-protect-jewish-and-muslim-students/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism and more.\nAn additional 106 cases are pending at the Office for Civil Rights in the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThere was also “no evidence” that the university complied with its legal requirements under Title VI of the Civil Rights Act, the report said.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found."}, {"id": "92aaf789-1efa-4d70-959b-4109db992745", "title": "Alsobrooks visits the heart of Baltimore Jewish community and Hogan country", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/alsobrooks-visits-heart-baltimore-jewish-011701533.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Prince George’s County Executive Angela Alsobrooks (D) traveled to the heart of Baltimore’s Jewish community Monday to meet with local leaders and promote her Senate candidacy.\n“Growing up in the 1970s, it was hard not to have conversations about the Jewish community and the African-American community being special friends,” she said.\n“I think it’s important for her to meet with the Jewish community here, hear what we’re working on, because she’s not from Baltimore,” said Howard Libit, executive director of the Baltimore Jewish Council.\n“She’s reached out to understand the issues that are important to the Jewish community,” he said.\nThey’re not going to want Republicans controlling the agenda.”The post Alsobrooks visits the heart of Baltimore’s Jewish community — and Hogan country appeared first on Maryland Matters."}, {"id": "759cf14a-b0ba-4e9e-a835-0fbba1ca5d22", "title": "Probe finds two universities failed to protect Jewish , Muslim students", "date": "2024-06-18 00:45", "url": "https://www.bostonglobe.com/2024/06/17/nation/probe-finds-two-universities-failed-protect-jewish-muslim-students/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism, and more.\nAn additional 106 cases are pending at the Office for Civil Rights at the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThe provision bars discrimination based on shared ancestry, including against those who are Jewish or Muslim.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found."}, {"id": "8a243968-1beb-4348-9bcb-760b64cdb432", "title": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearance", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/ben-cardin-touts-angela-alsobrooks-022700548.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearanceDuring their first joint campaign appearance since Angela Alsobrooks announced her campaign to succeed him, U.S. Sen. Ben Cardin on Monday touted the Prince George’s County executive, saying she was the best candidate to boost U.S.-Israel relations.\nCardin told a panel of Baltimore-area Jewish leaders that Alsobrooks would be the best choice to stand up for Jewish Marylanders against rising antisemitism and would support congressional efforts to promote peace in Gaza.\n“I always talk about how Jewish values are my North Star,” said Cardin, listing his support for stricter gun control and advocacy for LGBTQ rights and reproductive freedom.\nAndrew Cushnir, the chief executive and president of the Associated Jewish Federation of Baltimore, said the days since the Oct. 7 Hamas attack “have been incredibly difficult” for both Jewish Baltimoreans and Jewish people around the world.\nAlsobrooks said she was “grateful” for Van Hollen’s support, though she said the two had “different positions” on Israel and did not elaborate."}, {"id": "0e351688-fdc2-40bf-bd70-4e35145bde46", "title": "When violence and trauma visit American places , a complex question follows : Demolish , or press on ? ", "date": "2024-06-18 04:30", "url": "https://www.mymotherlode.com/news/national/3377202/when-violence-and-trauma-visit-american-places-a-complex-question-follows-demolish-or-press-on.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "When violence and trauma visit American places, a complex question follows: Demolish, or press on?\nIn Pittsburgh, the Tree of Life synagogue, site of a 2018 shooting, was torn down to make way for a new sanctuary and memorial.\nAnd Columbine High School still stands, though its library, where so much bloodshed occurred, was replaced after much impassioned debate.\n“Finding a balance between its function as a high school and the need for memorialization has been a long process,” former student Riley Burkhart wrote earlier this year in an essay.\nSometimes it’s simply a question of resources; not all school districts can afford to demolish and rebuild."}]