[{"id": "2af10586-6ffc-4947-9cdb-0793695c4479", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:30", "url": "https://www.yahoo.com/news/cargo-ship-hit-missile-gulf-022827213.html", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurtDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "41d719dd-25f4-444d-af94-45334e4fb140", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels", "date": "2024-06-09 03:45", "url": "https://abcnews.go.com/International/wireStory/cargo-ship-hit-missile-gulf-aden-suspected-attack-110960108", "message": "A suspected attack by Yemen’s Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden, with a missile hitting the vesselDUBAI, United Arab Emirates -- A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying “damage control is underway.\"\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "d756bd13-3f8f-4b8f-b607-cba9f8897353", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:45", "url": "https://apnews.com/article/yemen-houthi-rebels-ship-attack-israel-hamas-war-f72e5a614ba04254031de5b8aaa26f2f", "message": "DUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage."}, {"id": "2bcce5e7-36f4-4c02-8b58-89ee020c6d16", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:15", "url": "https://www.startribune.com/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/600372115/", "message": "DUBAI, United Arab Emirates — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people ''on board small boats in the vicinity opened fire on the ship during the incident,'' Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying ''damage control is underway.\"\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "4075c539-afe7-4119-bba6-ee61048c7f54", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-08/gulf-of-aden-missile-attack-14125180.html", "message": "(AP)DUBAI, United Arab Emirates — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military’s United Kingdom Maritime Trade Operations center similarly reported an attack late Saturday in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "9ee884e0-836c-4d4d-adac-9332fa57bd21", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt – Winnipeg Free Press", "date": "2024-06-09 03:15", "url": "https://www.winnipegfreepress.com/world/2024/06/08/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt", "message": "DUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week."}, {"id": "089c524a-0f13-4ec4-98ac-c468600f5516", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt | iNFOnews", "date": "2024-06-09 04:15", "url": "https://infotel.ca/newsitem/ml-mideast-tensions/cp1669742662", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\n(AP Photo)Original Publication Date June 08, 2024 - 7:31 PMDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "b459e101-543e-47f9-9622-357f7d1c87db", "title": "Two killed , fires rage in Lebanon after Israeli strikes - Newspaper", "date": "2024-06-09 03:45", "url": "https://www.dawn.com/news/1838745/two-killed-fires-rage-in-lebanon-after-israeli-strikes", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza war began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally."}, {"id": "cd994f01-5f6a-4ebe-9e65-51b936ca0b38", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:30", "url": "https://www.mymotherlode.com/news/middle-east/3372100/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt.html", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurtCargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurt View PhotoDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard."}, {"id": "efe54104-3b39-473c-a7d2-017afd83cadd", "title": "Time for US to end the delays on arming Kyiv", "date": "2024-06-09 00:00", "url": "https://thefrontierpost.com/time-for-us-to-end-the-delays-on-arming-kyiv/", "message": "With the availability of commercial satellite imagery, the Russian military buildup just across the border from Kharkiv was no secret.\nThe White House denied each request out of a fear that Ukraine using American weapons to strike inside Russia would be too escalatory.\nPerhaps the most consequential White House delay was over the delivery of the Army Tactical Missile System to Ukraine.\nEven Ukraine’s supporters in Congress, Republicans and Democrats alike, have called on the White House to provide them.\nPresident Biden needs to end the delays and understand that arming Ukraine to win, and not just to survive, is the fastest way to bring this war to an end."}, {"id": "c474019a-6f48-4cfc-a1fc-bcee39c219a9", "title": "Attacks in Russian - Occupied Ukrainian Regions Leave 28 Dead , Moscow - Appointed Officials Say", "date": "2024-06-09 01:45", "url": "https://www.theyeshivaworld.com/news/general/2289347/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say.html", "message": "Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia’s Defense Ministry said Saturday.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "1413bffc-8724-48c3-83e6-29d1943c429c", "title": "Israel - Gaza live updates : Israel says it rescued 4 hostages", "date": "2024-06-09 00:00", "url": "https://www.k101fm.net/syndicated-article/?id=1568393", "message": "Biden welcomed the safe return of four hostages from Gaza, pledging that the United States will not stop working until all hostages are home.\n-ABC News’ Samy Zyara and Nasser AttaJun 08, 7:12 AMIsrael says it rescued 4 hostagesIsrael rescued four hostages alive from two locations in the heart of Nuseirat, Gaza, Israel said Saturday.\nThe rescued hostages have been transferred to the ‘Sheba’ Tel-HaShomer Medical Center and are in good condition, the IDF said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike."}, {"id": "1402cf2c-5576-4e7a-a171-5942fe0525f1", "title": "Deputy shoots knife - wielding man in Jurupa Valley", "date": "2024-06-09 04:00", "url": "https://www.foxla.com/news/deputy-shoots-knife-wielding-man-jurupa-valley", "message": "JURUPA VALLEY, Calif. — A Riverside County Deputy shot a knife-wielding man during a welfare check in Jurupa Valley Saturday morning, according to deputies.\nThat's when the department said the man came at a deputy with the knife, and the deputy shot him.\nSUGGESTED: LASD deputy shot in back while sitting at traffic light; suspect arrestedNo other details were immediately available.\nThe man has not been identified, and the deputy who shot him has been placed on paid administrative leave.\nThe Riverside County District Attorney's Office and the Riverside Sheriff's Force Investigations Detail are investigating the shooting."}, {"id": "4822c7fa-a122-473a-af95-1d311cb1d97c", "title": "Rising Political Violence in Europe : Leaders Under Siege", "date": "2024-06-09 04:00", "url": "https://www.devdiscourse.com/article/politics/2976244-rising-political-violence-in-europe-leaders-under-siege", "message": "In a troubling trend, political violence is escalating across Europe, putting many leaders in direct danger.\nSlovakia's Prime Minister Robert Fico was shot in an assassination attempt last month and remains in recovery.\nOn Friday evening, Danish Prime Minister Mette Frederiksen was assaulted in downtown Copenhagen.\nExperts suggest that the rising tensions are fueled by deep societal divisions, migration pressures, and the ongoing war in Ukraine—Europe's largest conflict since World War II.\nThe most severe attack was against Fico, who has hinted that his pro-Russian and anti-American views made him a target."}, {"id": "dec91b21-1a76-4185-8ad3-f8c788f397ba", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels", "date": "2024-06-09 04:30", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_q/", "message": "A suspected attack by Yemen’s Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden, with a missile hitting the vessel ...... read full story"}, {"id": "041f92f6-15e7-4157-b8fa-32a7e31d67f6", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi ... ", "date": "2024-06-09 04:00", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_y/", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\n...... read full story"}, {"id": "07ba1e6e-210f-4340-8601-54d568fe6c2c", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 04:00", "url": "https://www.bssnews.net/news/194108", "message": "LONDON, June 9, 2024 (BSS/AFP) - An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n\"No injuries were reported,\" the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen's Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping."}, {"id": "aa9f88dc-edfb-4d49-b7bd-da5fe886c230", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-09 03:15", "url": "https://www.newstalkzb.co.nz/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say/", "message": "Russian-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nEmergency Ministry employees carry a wounded person from the side of the damaged apartment building following Friday's Ukrainian missile attack on Luhansk, the capital of Russian-controlled Luhansk region, eastern Ukraine.\nUkrainian air defence overnight shot down nine out of 13 Russian drones over the central Poltava region, southeastern Zaporizhzhia and Dnipropetrovsk regions, and the Kharkiv region in the northeast, Ukraine’s air force said.\nUkrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "6351f129-c21f-4fc4-af9d-af176f3f8e57", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 03:45", "url": "https://manilastandard.net/news/314457081/missile-strikes-cargo-ship-off-yemen-security-firm.html", "message": "- Advertisement -An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen on Saturday night, maritime security firm Ambrey said.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\nA second missile missed and “small boats in the vicinity opened fire on the ship” causing it to change direction to port.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping."}, {"id": "47f2dcd8-2152-4663-a497-c846187798d2", "title": "Mette Frederiksen : All On Polish Man Who Attacked Denmark PM", "date": "2024-06-09 02:00", "url": "https://www.timesnownews.com/world/europe/mette-frederiksen-all-on-polish-man-who-attacked-denmarks-prime-minister-article-110829698", "message": "Photo : TwitterA 39-year-old Polish man was remanded in custody for 12 days on Saturday following an assault on Danish Prime Minister Mette Frederiksen , which occurred the previous day.\nThe prime minister was hit by the suspect as he approached him in Copenhagen's downtown center.\nIt's incredibly touching,\" Frederiksen told Ritzau news agency in a written statement.\nA representative told Polish state radio, \"Danish authorities have informed us that the person detained is a Polish citizen, who has been staying in Denmark for some time.\"\nThis event happened shortly after Slovakia's Prime Minister Robert Fico was the target of a botched assassination attempt that left him gravely injured."}, {"id": "94b03b12-f654-4436-9bfd-0efd7bff26a0", "title": "Russo - Ukraine War - 08 June 2024", "date": "2024-06-09 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-08.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussians carried out more than 2,800 shelling on the positions of Ukrainian troops and settlements using different types of weapons.\nIn the Lyman direction, Russian forces tried seven times to advance in the direction of settlements Nevske, Terni, Ivanivka, Torske and Dibrova.\nThe AFU losses amounted to up to 135 Ukrainian troops, five motor vehicles, and one 122-mm 2S1 Gvozdika self-propelled artillery system."}, {"id": "f1a1cc4c-c4a4-4286-aabe-78e2dd0ab317", "title": "MechWarrior 5 : Clans Releases October 3 for PS5 , Xbox Series X", "date": "2024-06-09 04:30", "url": "https://www.vgchartz.com/article/461355/mechwarrior-5-clans-releases-october-3-for-ps5-xbox-series-xs-and-pc/", "message": "MechWarrior 5: Clans Releases October 3 for PS5, Xbox Series X|S, and PC - News/ 217 Viewsby, posted 1 hour agoDeveloper Piranha Games announced MechWarrior 5: Clans will launch for the PlayStation 5, Xbox Series X|S, and PC via Steam and Epic Games Store on October 3.\nMechWarrior 5: Clans linear campaign will be an evolution of gameplay and storytelling in the MechWarrior series, experienced from the perspective of Clan Smoke Jaguar in the pivotal conflict known as the Clan Invasion starting in the year 3050.\nMechWarrior 5: Clans features a captivating and intricately crafted story that immerses players in the conflicts of the Clan Invasion.\nMechWarrior 5: Clans explores a pivotal time in the MechWarrior universe brought on by the Clan Invasion and incredible technological advances in Mech warfare, reflected within the Clan Invasion time period.\nThis Isn’t Run-and-Gun, This is MechWarriorCelebrated core MechWarrior combat returns in MechWarrior 5: Clans."}, {"id": "8ca8f487-75bc-4bc0-86be-4b7ed40e2e86", "title": "Delta Force : Hawk Ops Q & A - Early Access in October , Release Window in Q1 2025", "date": "2024-06-09 01:30", "url": "https://wccftech.com/delta-force-hawk-ops-qa-early-access-in-october-release-window-in-q1-2025/", "message": "At Summer Game Fest, we checked out the tactical first-person shooter game Delta Force: Hawk Ops.\nCan you describe the tactical gameplay that players will experience in Delta Force: Hawk Ops in a bit more detail?\nWhat modes of communication are there in Delta Force: Hawk Ops, whether it's voice chat, text chat, pinging on a map, or anything else?\nBut in the two game modes of Delta Force: Hawk Ops, it's separated.\nAre you planning to make Delta Force: Hawk Ops Steam Deck compatible?"}, {"id": "fa879ecf-5237-4966-b679-50e16a7a54e7", "title": "Jordan , Egypt Condemn Israeli Rescue of Hostages ; EU , UN Officials Join In", "date": "2024-06-09 01:30", "url": "https://freerepublic.com/focus/f-news/4243118/posts", "message": "Jordan, Egypt Condemn Israeli Rescue of Hostages; EU, UN Officials Join InBreitbart ^ | 06/08/2024 | Joel B PollackPosted on by ChicagoConservative27Egypt and Jordan, two countries that have peace treaties with Israel, condemned the Israeli rescue of four hostages on Saturday — as did officials from the European Union (EU) and United Nations (UN) — over Palestinian casualties.\nby 2 posted onby CatOwner (Don't expect anyone, even conservatives, to have your back when the SHTF in 2021 and beyond.)\nby 3 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nby 4 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nTruly 200 “palestinians” some 80% of whom support Hamas, were killed as well as the Israeli Police commando chief to rescue 4 hostages... alive."}, {"id": "cf9e98a8-59af-4581-b25e-e100468a1410", "title": "South Carolina State Museum new World War II Exhibit unveiled at D - Day 80th Anniversary Salute", "date": "2024-06-09 01:30", "url": "https://www.wistv.com/2024/06/08/south-carolina-state-museums-new-world-war-ii-exhibit-unveiled-d-day-80th-anniversary-salute/", "message": "COLUMBIA, S.C. (WIS) - As the nation continues to mark the 80th anniversary of D-Day, dozens came out to the South Carolina State Museum on Saturday for a special event marking the pivotal World War II battle.\nThe museum also used the occasion to unveil a new World War II exhibit, highlighting South Carolinians’ contributions during the global conflict.\nThe Shared Sacrifice: South Carolina in World War II exhibition gallery highlights stories of military personnel from across South Carolina and their contributions in World War II.\nMany of the artifacts in the Shared Sacrifice exhibit were donated by people across the state.\nFeel more informed, prepared, and connected with WIS. For more free content like this, subscribe to our email newsletter, and download our apps."}, {"id": "6318ff08-8943-4e21-9c7c-b1457624a06d", "title": "Telling the story , hearing the truth", "date": "2024-06-09 01:30", "url": "https://www.theday.com/columnists/20240608/telling-the-story-hearing-the-truth/", "message": "Thursday’s observance of the 80th anniversary of D-Day was likely among the last ceremonies to include the presence of multiple veterans of that momentous battle.\nBut they have already performed one more sacred duty by telling about the determination, the fear, the waves, the blood, the struggle to take the beach.\nA few years before World War II, those who would soon be defending the nation were teenagers.\nSince 2016, a divided United States has normalized to the point that one of the few things all agree on is the heroism of World War II.\nRead a book about America, and then read more books."}, {"id": "0372de4f-4223-4e85-b922-f46b5e2a3db0", "title": "WWII veteran ties the knot with 96 - year - old bride near Normandy D - Day beaches", "date": "2024-06-09 02:15", "url": "https://news.sky.com/story/wwii-veteran-ties-the-knot-with-96-year-old-bride-near-normandys-d-day-beaches-13150006", "message": "A centenarian World War II veteran has tied the knot with his bride in a ceremony near Normandy's D-Day beaches.\nRead more:These D-Day commemorations felt differentTom Hanks speaks at D-Day memorialTory campaign derailed by D-Day blunderSpreaker Spreaker , which may be using cookies and other technologies.\nYou can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once.\nYou can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies.\nTo view this content you can use the button below to allow Spreaker cookies for this session only."}, {"id": "7c6ec2a8-4cb5-494c-92e9-593c858d832c", "title": "US WWII veteran marries 96 - year - old bride near Normandy D - Day beaches", "date": "2024-06-09 01:30", "url": "https://www.voanews.com/a/wwii-veteran-marries-96-year-old-bride-near-normandy-s-d-day-beaches-/7648569.html", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn her way into the nuptials, the bubbly bride-to-be said: \"It's not just for young people, love, you know?\n\"(The town of) Carentan was happy to host your wedding, and us, your wedding dinner,\" he told the couple.\nThe WWII veteran first visited France as a 20-year-old U.S. Army Air Forces corporal shortly after D-Day.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle."}, {"id": "3d01533d-99aa-4bcb-9728-bbd7f150d5dc", "title": "Kate Garraway was comforted by a D - Day veteran over the death of her husband Derek Draper - 09 - Jun - 2024", "date": "2024-06-09 02:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399915&fm=psp,tst", "message": "\"Kate's husband Derek died in January aged 56 following a four year health battle after contracting COVID-19 in 2020.\nShe admitted the emotional exchange between herself and John, a former Bombardier in the Royal Artillery, left him in tears.\nIt's hard to overstate really how important it is for them that we remember, and how important it is for us that we remember too.\"\nAs part of the anniversary service in France, King Charles and Queen Camilla led a silent prayer for D-Day veterans.\nSpeaking at the British Normandy Memorial in Ver-sur-Mer, the monarch hailed the wartime generation as \"remarkable\", and voiced his \"profound sense of gratitude\" for those who fought in the Second World War."}, {"id": "f552360c-b96b-4011-aceb-a375c1a6c4e7", "title": "WWII veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-09 04:30", "url": "https://www.theday.com/nation/20240608/wwii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/", "message": "But Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "160f45ea-df91-4175-b13b-a7579a6064c7", "title": "Gaza war protesters slam Biden in  red line  rally at White House", "date": "2024-06-09 04:00", "url": "https://www.bssnews.net/news-flash/194112", "message": "WASHINGTON, June 9, 2024 (BSS/AFP) - Thousands of Gaza war protesters held a \"red line\" rally near the White House on Saturday, voicing anger at what they said is US President Joe Biden's tolerance of Israel's bloody military campaign against Hamas.\nThe White House said in May that a deadly Israeli strike on Rafah did not cross a \"red line\" that Biden had seemingly set two months earlier when asked about a potential invasion of the southern Gazan city.\n\"This 'red line' in his rhetoric is rubbish... it shows his hypocrisy and his cowardice,\" Mahdawi told AFP.\nThe protesters -- almost all wearing red clothing -- held Palestinian flags and signs saying \"Biden's red line was a lie\" and \"Bombing children is not self-defense.\"\nThe White House stepped up security with an additional anti-scale perimeter fence ahead of the demonstration, which saw chartered buses ferrying in people from as far afield as Maine and Florida."}, {"id": "738820b9-c47c-4ad8-9e67-d09f245ad533", "title": "Sunday Morning Live - BBC One London", "date": "2024-06-09 04:15", "url": "https://www.tvguide.co.uk/schedule/1a111573-9726-53d6-a3ce-e649ca136693/sunday-morning-live", "message": "Sunday Morning LiveBBC One London 10:30 AM to 11:30 AM Sunday 9 June Share Add toCalendar +09/06/2024 Season 15 Episode 2 of 24 New S SubtitlesSean Fletcher and Holly Hamilton discuss taxing the wealthy to combat climate change and the link between unhealthy diets and rising numbers of cancer diagnoses in the under 50sSunday Morning Live airs on BBC One London at 10:30 AM, Sunday 9 June .\n(Subtitles, new.)\nTopics News ➝ Current Affairs"}, {"id": "6e9130fb-64f9-4c68-9742-4a237e6b0f77", "title": "The ZSL92 APC Tank Or WZ - 551 Is A Crucial Lynchpin In China Defense", "date": "2024-06-09 02:00", "url": "https://www.slashgear.com/1592902/zsl92-tank-what-made-armored-personnel-carrier-unique/", "message": "Here's What Made The ZSL92 APC Tank Unique From Its PredecessorsWhile it's true that war never changes, the implements of war absolutely do.\nMilitary powers constantly look to improve their arsenal, hoping to exceed the capabilities of older machinery and outgun their opposition.\nAlong the way, production may stumble, and designs may be forfeited for something more viable, as seen with China's WZ-551 family of infantry fighting vehicles (IFV).\nAs the project moved forward, two prototypes were made: The ZSL-90 and the ZSL-92.\nOf those, the ZSL-92 actually went into production, having improved upon the pitfalls of the original model and other armored vehicles used by the PLA."}, {"id": "cae713da-88e5-4c4b-949d-2e0485a5cadd", "title": "Lest We Forget gearing up for big D - Day reenactment", "date": "2024-06-09 02:00", "url": "https://www.wirx.com/2024/06/08/lest-we-forget-gearing-up-for-big-d-day-reenactment/", "message": "With the anniversary of D-Day this past Thursday, Lest We Forget is making the final plans for its D-Day reenactment planned at Tiscornia Beach in St. Joseph for later this month.\nGroup President Larry Wozniak tells us the big day will be June 22.\nWozniak says after the battle reenactments at Tiscornia Beach, events that weekend will move to the Southwest Michigan Regional Airport.\nWozniak says for the battle reenactments, the parking lot at Tiscornia Beach will be closed and people can park at nearby lots on Momany Drive.\nWozniak notes some World War II veterans are coming into town for the weekend, including one man who’s 106."}]