[{"id": "01571b32-d903-460d-a4b6-276256d9aa63", "title": "Israeli Jets Strike Lebanon Amid Hezbollah Threats", "date": "2024-08-25 03:30", "url": "https://www.devdiscourse.com/article/business/3063219-israeli-jets-strike-lebanon-amid-hezbollah-threats", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Israeli jets launched strikes in Lebanon early Sunday after military assessments indicated that Hezbollah, backed by Iran, was preparing to fire rockets towards Israel.\nThe Israel Defence Forces (IDF) confirmed the operation, stating that it was in response to imminent threats from the terrorist organization.\nFlights in and out of Tel Aviv's Ben Gurion airport were suspended, and Israel's cabinet convened for an emergency meeting at 7 a.m. (0400 GMT), according to Israeli media.\nThe strikes occur amid heightened fears of escalation following a missile strike in the Israeli-occupied Golan Heights last month that killed 12 youngsters and the Israeli military's assassination of a senior Hezbollah commander in Beirut.\nThe IDF has advised civilians in southern Lebanon to avoid areas where Hezbollah operates and promised new civil defense instructions soon."}, {"id": "53f53c36-416e-466a-aadc-45fe9a45e179", "title": "Fires Break Out on Abandoned Greek - Flagged Oil Tanker Sounion That Yemen Rebels Attacked in Red Sea", "date": "2024-08-25 03:00", "url": "https://www.theyeshivaworld.com/news/general/2308414/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen’s Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn’t immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military’s United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "55a7f438-ab2a-4388-ac27-827cd3c313a2", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah", "date": "2024-08-25 03:30", "url": "https://www.aol.com/israel-says-staging-airstrikes-inside-022301955.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The army said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nThe attacks came as Egypt hosts a new round of talks aimed at ending Israel’s war with Hamas, now in its 11th month.\nRear Adm. Daniel Hagari, the top Israeli military spokesman, said “dozens” of warplanes were striking targets in southern Lebanon.\nSocial media footage showed what appeared to be strikes in southern Lebanon.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "a0c4764b-b5d7-4fcc-a3c8-4b63516a1e35", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah – Winnipeg Free Press", "date": "2024-08-25 03:30", "url": "https://www.winnipegfreepress.com/world/2024/08/24/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-the-shiite-militia-hezbollah", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The army said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\n(AP Photo)The attacks came as Egypt hosts a new round of talks aimed at ending Israel’s war with Hamas, now in its 11th month.\nRear Adm. Daniel Hagari, the top Israeli military spokesman, said “dozens” of warplanes were striking targets in southern Lebanon.\nSocial media footage showed what appeared to be strikes in southern Lebanon.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel."}, {"id": "63da63c3-4e80-4939-bca5-e9672e796a3e", "title": "Israel says it is prepared for any retaliatory attack from Iran or Hezbollah - LocalNews8 . com", "date": "2024-08-25 03:00", "url": "https://localnews8.com/news/national-world/cnn-world/2024/08/24/israel-says-it-is-prepared-for-any-retaliatory-attack-from-iran-or-hezbollah/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Dana Karni, CNN(CNN) — Israel said Saturday its military was prepared for any possible retaliatory attacks by Iranian-backed militant group Hezbollah or Iran for the killings of their senior leaders.\nThe news comes amid claims in the Israeli media that there are situational assessments that Hezbollah could attack soon.\nBoth Hezbollah and Iran have been threatening to retaliate against Israel since a string of figures in Iran-backed militant groups were killed over a span of weeks.\nAsked about the threats of retaliation, the Israel Defense Forces (IDF) spokesman Daniel Hagari told reporters Saturday that the military was prepared for any possible attack by either Hezbollah or Iran.\nThis week, the bodies of six Israeli hostages were retrieved from tunnels in Gaza in an Israeli military operation in the city of Khan Younis."}, {"id": "8999db5c-68e7-49cf-8163-f50e97a6a2a7", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah", "date": "2024-08-25 03:00", "url": "https://www.princegeorgecitizen.com/world-news/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-the-shiite-militia-hezbollah-9418183", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Israel launched airstrikes inside Lebanon early Sunday that its military said targeted positions of the Shiite militia Hezbollah.\nJERUSALEM (AP) — Israel launched airstrikes inside Lebanon early Sunday that its military said targeted positions of the Shiite militia Hezbollah.\nIn a statement, the Israeli military accused Hezbollah of “preparing to file missiles and rockets toward Israeli territory.””‎‏In a self-defense act to remove these threats, the (Israeli military) is striking terror targets in Lebanon, from which Hezbollah was planning to launch their attacks on Israeli civilians,” Israeli military spokesman, Rear Adm. Daniel Hagari, said.\nHagari warned Hezbollah would “soon fire rockets, and possibly missiles and” drones into Israel.\nSirens sounded in northern Israel soon after the warning."}, {"id": "0b303883-5e37-4040-a935-fda870abd7f0", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah", "date": "2024-08-25 03:00", "url": "https://www.newwestrecord.ca/world-news/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-the-shiite-militia-hezbollah-9418214", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Israel launched airstrikes inside Lebanon early Sunday that its military said targeted positions of the Shiite militia Hezbollah.\nJERUSALEM (AP) — Israel launched airstrikes inside Lebanon early Sunday that its military said targeted positions of the Shiite militia Hezbollah.\nIn a statement, the Israeli military accused Hezbollah of “preparing to file missiles and rockets toward Israeli territory.””‎‏In a self-defense act to remove these threats, the (Israeli military) is striking terror targets in Lebanon, from which Hezbollah was planning to launch their attacks on Israeli civilians,” Israeli military spokesman, Rear Adm. Daniel Hagari, said.\nHagari warned Hezbollah would “soon fire rockets, and possibly missiles and” drones into Israel.\nSirens sounded in northern Israel soon after the warning."}, {"id": "d113fbcc-9f84-4017-aba4-535cc42a39d2", "title": "Israel says it is prepared for any retaliatory attack from Iran or Hezbollah", "date": "2024-08-25 00:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/08/24/israel-says-it-is-prepared-for-any-retaliatory-attack-from-iran-or-hezbollah/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Israel said Saturday its military was prepared for any possible retaliatory attacks by Iranian-backed militant group Hezbollah or Iran for the killings of their senior leaders.\nThe news comes amid claims in the Israeli media that there are situational assessments that Hezbollah could attack soon.\nBoth Hezbollah and Iran have been threatening to retaliate against Israel since a string of figures in Iran-backed militant groups were killed over a span of weeks.\nAsked about the threats of retaliation, the Israel Defense Forces (IDF) spokesman Daniel Hagari told reporters Saturday that the military was prepared for any possible attack by either Hezbollah or Iran.\nThis week, the bodies of six Israeli hostages were retrieved from tunnels in Gaza in an Israeli military operation in the city of Khan Younis."}, {"id": "d1f90f79-4f3f-4389-88bb-4f16e636df75", "title": "Manhunt under way after fire and explosion outside synagogue in southwest France", "date": "2024-08-25 01:00", "url": "https://www.euronews.com/my-europe/2024/08/25/manhunt-under-way-after-fire-and-explosion-outside-synagogue-in-southwest-france", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTPolice in France say they have arrested a man suspected of starting fires and causing an explosion outside a synagogue in the country’s southwest.\nFrench media said the suspect was shot and injured by police after he opened fire on the officers who came to arrest him in the city of Nîmes.\nPeople outside the Beth Yaacov synagogue in La Grande Motte, August 24, 2024 Screenshot from AP video 4513970Firefighters discovered additional fires at two entrances to the synagogue.\nFive people, including the rabbi, who were present in the synagogue complex at the time of the attack were unharmed.\n\"Once again, French Jews have been targeted and attacked because of their beliefs,\" Attal said after meeting with local officials and the synagogue staff."}, {"id": "47aaeca2-b2bf-4d74-900a-5d7cf2e6f9a3", "title": "Israel launches pre - emptive strikes at Lebanon to avert  large - scale  Hezbollah attack", "date": "2024-08-25 03:30", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-launches-pre-emptive-strikes-at-lebanon-to-avert-large-scale-hezbollah-attack/articleshow/112774059.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "In an attempt to mitigate the looming threat from Iran-backed militant group Hezbollah, the Israeli military early Sunday announced pre-emptive strikes in Lebanon .Israel said the strikes were carried out in the wake of detecting preparations for \"large-scale\" attacks by Hezbollah.\n\"We are monitoring Hezbollah's preparations to carry out large-scale attacks on Israeli territory near your homes.\nYou are in danger.\nWe are attacking and eliminating Hezbollah threats,\" the military said, in an Arabic-language warning to residents of southern Lebanon, reported news agency AFP.Israel, which has been pounding Gaza since the October 7 attack, called the strikes \"self-defence\" act to remove threats.\nThis information was shared on the military's Telegram channel.Hezbollah and other armed groups in Lebanon have been trading fire with Israel in parallel with the Gaza war.Last week, an Israeli air strike in southern Lebanon resulted in the deaths of nine people, including a woman and her two children, claimed Lebanon's health ministry."}, {"id": "2b60bc22-4d4f-46a1-b391-e600cc0d2520", "title": "4 injured in stabbing attack in Sydney , Australia , police say", "date": "2024-08-25 02:45", "url": "https://www.voanews.com/a/injured-in-stabbing-attack-in-sydney-australia-police-say-/7756082.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Four people — including a police officer — were injured on Sunday in a mass stabbing in Sydney, Australia, police said.\nIt was the latest in a series of stabbing attacks in the city this year.\nPolice said in a statement on Sunday morning that four people were \"injured following a crash and suspected stabbing a short time ago.\"\nSydney has seen a spate of knife attacks this year, prompting the New South Wales state government to toughen its knife laws.\nIn April, six people were killed and 12 injured in a knife attack at a mall in Sydney's Bondi area."}, {"id": "54870138-c313-4935-a0f1-f2acb9b3d162", "title": "Australian police say 4 people injured in Sydney stabbing attack", "date": "2024-08-25 02:30", "url": "https://www.asiaone.com/world/australian-police-say-4-people-injured-sydney-stabbing-attack", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SYDNEY - Australian police said on Aug 25 that four people, including a police officer, were injured in a mass stabbing in Sydney, the latest in a series of stabbing attacks in the city this year.\nPolice said in a statement that four people were \"injured following a crash and suspected stabbing a short time ago\".\nSydney has seen a spate of knife attacks this year, prompting the New South Wales state government to toughen its knife laws.\nIn April, six people were killed and 12 injured in a knife attack at a mall in Sydney's Bondi area.\nALSO READ: 3 dead after stabbing attack at festival in western Germany"}, {"id": "2d0ff7fd-b021-40c8-8f3f-e55d5b6d6d63", "title": "Solingen terror attack suspect , 26 , hands himself into police and says  I am the one you are looking for  - World News", "date": "2024-08-25 00:30", "url": "https://www.mirror.co.uk/news/world-news/solingen-attack-attack-suspect-says-33533800", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The 26-year-old man handed himself into police after another man and boy were arrestedSolingen terror attack suspect, 26, hands himself into police and says 'I am the one you are looking for'A man suspected of killing three people and injuring eight others in a knife attack at a German festival told police \"'I am the one you are looking for\" after he handed himself in.\nHe is suspected of stabbing two men, aged 67 and 56, and woman, 56, in Solingen, western Germany.\nHe told officers: \"I am the one you are looking for\", according to German news outlet Bild.\nA 36-year-old man and a 15-year-old boy were also arrested in connection with the terror attack.\nThe teenager is not the main suspect but is alleged to have known about the attack."}, {"id": "dd7f89cf-e82b-4f18-bd3e-890f7a1b38a9", "title": "Australia police say 4 people injured in Sydney stabbing attack", "date": "2024-08-25 02:00", "url": "https://www.thestar.com.my/news/world/2024/08/25/australia-police-say-4-people-injured-in-sydney-stabbing-attack", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "SYDNEY (Reuters) -Four people including a police officer were injured in a stabbing attack in Sydney early on Sunday, police said, the latest in a series of knife assaults in Australia's biggest city this year.\nThere is no ongoing threat to people in Sydney, said New South Wales state Police Minister Yasmin Catley.\nPolice said they did not believe anyone was killed in the attack, which followed a crash in the southern suburb of Engadine.\nSydney, a city of 5 million, has experienced a spate of knife attacks this year, prompting the New South Wales government to toughen its knife laws.\nIn April, six people were killed and 12 injured in a knife attack at a mall in Sydney's Bondi area."}, {"id": "4d5fa287-62b7-46bd-a913-dfe3f48417f6", "title": "Ukraine Zelensky touts new  drone missile , calls Russia Putin  sick old man  ", "date": "2024-08-25 02:45", "url": "https://www.asiaone.com/world/ukraines-zelensky-touts-new-drone-missile-calls-russias-putin-sick-old-man", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "KYIV - President Volodymyr Zelensky touted a newly developed Ukrainian \"drone missile\" on Aug 24 that he said would take the war back to Russia and scornfully derided Russia's Vladimir Putin as a \"sick old man from Red Square\".\nZelensky said the new class of Ukrainian weapon had been used for a successful strike on a target in Russia, but did not say where.\nHe used derisive language to describe Russia's 71-year-old president and the nuclear rhetoric coming out of Moscow.\nRussia, which has attacked Ukraine with many thousands of missiles and drones since it invaded in February 2022, has decried Ukraine's drone attacks as terrorism.\n‼️\"The sick old man from the red square, who keeps threatening everyone with the red button, will not dictate any of his red lines to us.\""}, {"id": "fd4e71ba-52fa-4c53-9cc5-610e3dc2366f", "title": "Ukraine shelling kills 5 civilians in Russia Belgorod region , governor says", "date": "2024-08-25 03:00", "url": "https://www.voanews.com/a/ukraine-shelling-kills-5-civilians-in-russia-s-belgorod-region-governor-says/7756092.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Five civilians died and 12 were injured in Ukraine's shelling of the town of Rakitnoye in Russia's Belgorod region, the governor of the region in the country's southwest said Sunday.\nAmong the injured are three children, Vyacheslav Gladkov, governor of the Belgorod region that borders Ukraine, said on the Telegram messaging app.\nBoth Russia and Ukraine deny targeting civilians in the war, which Russia launched with a full-scale invasion on its smaller neighbor in February 2022.\n\"Our enemy will ... know what the Ukrainian way for retaliation is.\nThe Russian Defense Ministry said its freed servicemen had been captured during Ukraine's attack in the Kursk region."}, {"id": "542ede9b-004f-421a-a811-51850e5aabdd", "title": "Zelensky touts new  drone missile , calls Putin  sick old man  ", "date": "2024-08-25 02:30", "url": "https://www.thenews.com.pk/print/1223598-zelensky-touts-new-drone-missile-calls-putin-sick-old-man", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "This combo of images shows, Ukrainian President Volodymyr Zelensky (left) and Russian President Vladimir Putin.\n— AFP/FileKYIV:President Volodymyr Zelenskiy touted a newly developed Ukrainian “drone missile” on Saturday that he said would take the war back to Russia and scornfully derided Russia’s Vladimir Putin as a “sick old man from Red Square”.\nZelenskiy said the new class of Ukrainian weapon had been used for a successful strike on a target in Russia, but did not say where.\nRussia, which has attacked Ukraine with many thousands of missiles and drones since it invaded in February 2022, has decried Ukraine’s drone attacks as terrorism.\n“It will be very difficult for Russia, difficult to even pronounce what exactly has hit it,” Zelenskiy said of the drone missile."}, {"id": "e2c2f476-9486-4a2d-b57e-242beb7a5d19", "title": "Syrian Asylum Seeker Arrested over German  Diversity Festival  Attack", "date": "2024-08-25 02:00", "url": "https://www.breitbart.com/europe/2024/08/24/syrian-asylum-seeker-arrested-over-mass-stabbing-at-german-festival-of-diversity/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "An asylum seeker from Syria has been arrested after a mass stabbing at a “festival of diversity” in Germany on Friday evening.\nAt around 11 pm local time on Saturday, over 24 hours after the attack in Solingen, 26-year-old “Issa al H.” surrendered to police.\nHe was reportedly not known to security authorities as an Islamic extremist, however, he is said to be a Sunni Muslim.\nIt was claimed that, according to witness statements gathered by police, the attacker had shouted out the Jihadi war cry “Allahu Akbar” as he carried out the attack on the diversity festival.\nMeanwhile, Bild reported that an Islamic State (ISIS) branch claimed responsibility for Friday’s attack, saying that it was intended as revenge for “Muslims in Palestine”."}, {"id": "881d4e9f-549b-46e4-b211-8e3e3b7e35ca", "title": "2 detained in deadly knife attack at German music festival : Police", "date": "2024-08-25 02:00", "url": "https://abc7chicago.com/2-detained-in-deadly-knife-attack-at-german-music-festival-police/15226648/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "2 detained in deadly knife attack at German music festival: PoliceGerman police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before.\nThree people were killed in the attack and eight others were injured -- four of whom are considered \"very seriously injured.\"\nISIS took credit for the attack on Saturday, according to Site Intelligence Group, an NGO that specializes in tracking jihadist media.\nLater in the day, police said they searched a refugee housing complex near the festival area based on a tip and arrested a second person in connection with the stabbing attack.\nThe police have not yet commented on the connection of this second person to the attack, and whether or not they could be the perpetrator."}, {"id": "5185cff8-3612-41c4-8f6a-683841e9542f", "title": "Solingen , Germany stabbing : 2 detained in knife attack that killed 3 at festival ; Islamic State group claims responsibility", "date": "2024-08-25 02:00", "url": "https://abc7.com/solingen-germany-mass-stabbing-stabbings-news/15226427/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "German police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nSOLINGEN, Germany -- German police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before."}, {"id": "06a55769-d051-4682-b1ea-ffd4c4e87319", "title": "2 detained in deadly knife attack at German music festival : Police", "date": "2024-08-25 00:00", "url": "https://abc7news.com/2-detained-in-deadly-knife-attack-at-german-music-festival-police/15226648/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "2 detained in deadly knife attack at German music festival: PoliceGerman police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before.\nThree people were killed in the attack and eight others were injured -- four of whom are considered \"very seriously injured.\"\nISIS took credit for the attack on Saturday, according to Site Intelligence Group, an NGO that specializes in tracking jihadist media.\nLater in the day, police said they searched a refugee housing complex near the festival area based on a tip and arrested a second person in connection with the stabbing attack.\nThe police have not yet commented on the connection of this second person to the attack, and whether or not they could be the perpetrator."}, {"id": "b9f15da0-c100-4be8-b779-85c086184945", "title": "Solingen , Germany stabbing : 2 detained in knife attack that killed 3 at festival ; Islamic State group claims responsibility", "date": "2024-08-25 00:00", "url": "https://abc7news.com/solingen-germany-mass-stabbing-stabbings-news/15226427/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "German police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nSOLINGEN, Germany -- German police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before."}, {"id": "080ab5ab-550c-4155-9fc7-22d8953b883c", "title": "Germany deadly stabbing : Police make second arrest", "date": "2024-08-25 02:00", "url": "https://www.fijivillage.com/news/Germany-deadly-stabbing-Police-make-second-arrest-8fr45x/", "domain": "fijivillage.com", "domain_classification": "Unknown", "message": "Germany deadly stabbing: Police make second arrestGermany deadly stabbing: Police make second arrestSource : BBCGerman Police have arrested a second person as they investigate Friday's stabbing attack that killed three people and injured eight in the western city of Solingen.\nA man was detained yesterday in a building housing refugees close to the site of the attack in the city centre.\nEarlier yesterday, a 15-year-old boy was detained in connection with the stabbing that shocked Germany.\nA spokesperson for the Police in Germany's North Rhine-Westphalia state - where Solingen is located - said the second arrest was made late yesterday.\nThe attacker reportedly stabbed passers-by at random during a festival to celebrate 650 years since the industrial city of Solingen was founded."}, {"id": "2b18b459-cbf1-4732-8e2c-2577d672a40e", "title": "Solingen , Germany stabbing : 2 detained in knife attack that killed 3 at festival ; Islamic State group claims responsibility", "date": "2024-08-25 00:30", "url": "https://abc30.com/solingen-germany-mass-stabbing-stabbings-news/15226427/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "German police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nGerman police said they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival.\nSOLINGEN, Germany -- German police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before."}, {"id": "d0961020-27cc-4b8d-81e5-730ebea8857c", "title": "2 detained in deadly knife attack at German music festival : Police", "date": "2024-08-25 00:15", "url": "https://abc30.com/2-detained-in-deadly-knife-attack-at-german-music-festival-police/15226648/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "2 detained in deadly knife attack at German music festival: PoliceGerman police said Saturday they have detained two people, including a 15-year-old boy, in connection to the stabbing of several people at a music festival in Solingen the night before.\nThree people were killed in the attack and eight others were injured -- four of whom are considered \"very seriously injured.\"\nISIS took credit for the attack on Saturday, according to Site Intelligence Group, an NGO that specializes in tracking jihadist media.\nLater in the day, police said they searched a refugee housing complex near the festival area based on a tip and arrested a second person in connection with the stabbing attack.\nThe police have not yet commented on the connection of this second person to the attack, and whether or not they could be the perpetrator."}, {"id": "11d3c5ab-f93e-4b13-a236-5514d53d120a", "title": "Sciutto Grills John Spencer on Civilian Deaths in Gaza", "date": "2024-08-25 00:30", "url": "https://www.mediaite.com/tv/cnns-jim-sciutto-grills-west-points-john-spencer-on-defense-of-civilian-deaths-in-gaza-others-are-looking-at-the-same-data/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "CNN’s Jim Sciutto grilled John Spencer, the chair of Urban Warfare Studies at the Modern War Institute at West Point, as to why his assessment of the civilian death toll in Israeli military operations in Gaza is consistently different from that of other military analysts.\n“Wes Bryant, special operations with a joint terminal, he was a joint terminal attack controller during the U.S. war on terror,” Scuitto noted.\nSCIUTTO: John, in fairness, I’m quoting – I’m quoting to you someone who is quite aware of the law war.\nHe worked in special operations for the U.S. military in the joint terminal attack – as a joint terminal attack controller, making exactly those decisions.\nAnd he examined not the data about U.S. military interactions prior, but Israeli military activity in Gaza."}, {"id": "ff210f66-cf9d-4faf-b6a0-eeef9c3fb026", "title": "  A sick old man from Red Square who ... : What Ukraine President Zelenskyy said about Putin in I - Day speech", "date": "2024-08-25 03:30", "url": "https://timesofindia.indiatimes.com/world/europe/a-sick-old-man-from-red-square-who-what-ukraine-president-zelenskyy-said-about-putin-in-i-day-speech/articleshow/112773856.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Volodymyr Zelenskyy during the Ukraine 's 33rd Independence Day speech called Russian President Putin a 'sick old man' who threatens everyone of nuclear attack.\n\"A sick old man from Red Square who constantly threatens everyone with the red button will not dictate any of his red lines to us,\" Zelenskyy said in a video on the Telegram.Additionally, he announced a new Ukrainian \" drone missile \" called Palianytsia , which he claimed would bring the war back to Russia .\n\"Our enemy will ... know what the Ukrainian way for retaliation is.\n\"It will be very difficult for Russia, difficult to even pronounce what exactly has hit it,\" said Zelenskyy.Despite Russia's relentless attacks on Ukraine with missiles and drones since the invasion began in February 2022, Moscow has condemned Ukraine's drone strikes as acts of terrorism.\n\"We are touched to see how the PT-91 Twardy tanks, given by Poland (to Ukraine) more than one year ago, are defending today Ukraine on the battlefields, fighting in the Kursk region,\" he said."}, {"id": "909ffa2b-056c-4d4c-99c4-528bcb67879b", "title": "Taking a stand against the wiles of the enemy : An eyeball to eyeball confrontation", "date": "2024-08-25 03:30", "url": "https://www.thestandard.co.zw/religion-zone/article/200031407/taking-a-stand-against-the-wiles-of-the-enemy-an-eyeball-to-eyeball-confrontation", "domain": "thestandard.co.zw", "domain_classification": "Unknown", "message": "The word “wiles” is one of three key words you must know and understand when studying the subject of spiritual warfare.\nThe word wiles is taken from the Greek word methodos.\nThe word wiles (methodos) is often translated to carry the idea of something that is cunning, crafty, subtle, or full of trickery.\nThe word wiles (methodos) plainly means that the enemy travels on one road, one lane, or one avenue.\nFirst, the word “wiles” (methodos) explicitly tells us that the devil travels with a road or on a road."}, {"id": "7a7dcf88-73e7-432d-9095-68d7cac44096", "title": "Moscow and Kyiv Swap Prisoners of War as Ukraine Marks Independence Anniversary", "date": "2024-08-25 03:00", "url": "https://www.theyeshivaworld.com/news/general/2308408/moscow-and-kyiv-swap-prisoners-of-war-as-ukraine-marks-independence-anniversary.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Russia and Ukraine exchanged over 100 prisoners of war each on Saturday as Kyiv marked its third Independence Day since Moscow’s full-scale invasion.\nThere have also been isolated reports of abuse of Russian soldiers, mostly during capture or transit to internment sites.\nLast January, Russia and Ukraine exchanged hundreds of prisoners of war in the biggest single release.\nTwo people were killed in a Russian drone attack, and one further person in shelling, in the northeastern Sumy region.\nIndependence Day commemorationsUkraine marked its 33rd Independence Day Saturday as its war against Russia’s aggression reaches a 30-month milestone."}, {"id": "467a034f-2b18-4a11-9288-3ef785a7a768", "title": "Who are the two NASA astronauts stranded at the International Space Station ? ", "date": "2024-08-25 03:00", "url": "https://www.necn.com/news/national-international/who-are-the-two-nasa-astronauts-stranded-at-the-international-space-station/3317324/", "domain": "necn.com", "domain_classification": "Unknown", "message": "The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nThe six NASA astronauts aboard the International Space Station celebrated the beginning of the Paris Olympics with a weightless recreation of the torch relay and some of their favorite Olympic sports.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "e1ace392-d6b0-472c-bf2f-5cc5a887514e", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 03:00", "url": "https://www.stripes.com/theaters/us/2024-08-24/astronaut-nasa-navy-pilots-14967783.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Chris O’Meara/AP)CAPE CANAVERAL, Fla. — The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "c2f48708-ddc7-4d74-9c4a-2e5d245f6004", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 00:00", "url": "https://www.ksat.com/tech/2024/08/24/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Chris O'Meara, File)CAPE CANAVERAL, Fla. – The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "2549d750-eac9-4fbf-9d98-d4c0ea31ebd2", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 00:00", "url": "https://www.clickondetroit.com/tech/2024/08/24/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Chris O'Meara, File)CAPE CANAVERAL, Fla. – The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "1ee8e7e2-e0bc-4c56-8016-d5353fd7a48d", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 03:30", "url": "https://www.whec.com/national-world/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "whec.com", "domain_classification": "Unknown", "message": "CAPE CANAVERAL, Fla. (AP) — The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nHe joined the Navy, becoming a test pilot and racking up more than 8,000 hours of flying time and 663 aircraft carrier landings.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "bcbed956-e1f8-44cb-b141-5da873827eff", "title": "", "date": "2024-08-25 00:00", "url": "https://www.israelnationalnews.com/news/395115", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The longer-term effect would be to undermine the authority of international law in general and to enlarge the prospects of a continuous regional war.\nThis inherent illegality is deducible from the far-reaching criminalization of terrorism discoverable under binding international law.\nAs punishers of \"grave breaches\" under international law, all states are expected to search out and prosecute or extradite individual terrorist perpetrators.\nLOUIS RENÉ BERES, born in Zurich, received his Ph.D at Princeton and is the author of many books and articles dealing with terrorism, counter-terrorism and international law.\nProfessor Beres is the author of seven principal articles in the annual Oxford University Press Yearbook on International Law and Jurisprudence."}]