[{"id": "3969a8a1-1b5f-4102-8c5a-a7556a657a71", "title": "David Mamet on Israel , humor , and new films at Tel Aviv festival - Israel Culture", "date": "2024-08-19 00:15", "url": "https://www.jpost.com/israel-news/culture/article-815222", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Sadie, you’re a f***ing jinx!’” Mamet laughed and said he hopes he’s not our Sadie.\n“And the Jewish students say, ‘It’s OK, I don’t want to make waves.’ Well, of course they don’t want to make waves,” Mamet said.\nSubscribe to The Jerusalem Post Newsletter Subscribe NowHe said it was “absolutely absurd” that the majority of American Jews are liberal.\nThe screenwriter said that he was meeting with Israeli producers on this trip and hoped to get the movie made someday.\nSaid Mamet: “The right time to begin writing is when you feel like it."}, {"id": "6ee8cc9d-9a56-4e24-a4b5-97a58c64b24a", "title": "Open letter to VP Harris and running mate Walz - The Jerusalem Post", "date": "2024-08-19 04:45", "url": "https://www.jpost.com/opinion/article-815249", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Dear Vice President Harris and Gov.\nFourteen of the hostages are women, suffering unimaginable abuse by their captors as documented in an eloquent op-ed by Michal Herzog, wife of Israeli President Isaac Herzog.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris and her vice presidential running mate Minnesota Governor Tim Walz attend a campaign event, in Las Vegas, last weekend.\nThis week, too many will try to suggest that pro-Palestinian protest imagery out in the streets is somehow a reflection of the views of the Democratic party inside the building.\nThis year, the $1 million Genesis Prize was awarded to Israeli organizations and activists working to release and support hostages and their families."}, {"id": "1973a856-f292-44d2-b759-bc2f54a5827a", "title": "The Christian case for backing Israel", "date": "2024-08-19 14:30", "url": "https://www.christianpost.com/voices/the-christian-case-for-backing-israel.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home Opinion The Christian case for backing IsraelThe Bible vividly portrays Israel as a central theme in God's plan for humanity.\nBut what does it mean to say we support Israel in today’s geo-political climate?\nI agree with my colleague, Dr. Jeff Myers, president of Summit Ministries and author of Should Christians Support Israel?\nClearly, through the prophet Isaiah, God chose Israel to be a beacon of hope, truth, and divine revelation to the entire world.\nBy supporting Israel, we are obeying God's will and aligning ourselves with His promises, purposes, and plans for the world."}, {"id": "edb6b1c4-0036-4ea5-be41-0281214c212b", "title": "Kamala Harris Met Secretly With Radical , Antisemitic Dearborn , Michigan , Mayor", "date": "2024-08-19 02:00", "url": "https://www.breitbart.com/politics/2024/08/18/kamala-harris-met-secretly-with-radical-antisemitic-dearborn-michigan-mayor/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris secretly met last week with the radical, antisemitic mayor of Dearborn, Michigan, in an effort to court Muslim- and Arab-American voters.\n… During a campaign trip to Michigan last week, Harris met with Abdullah Hammoud, the 34-year-old mayor of Dearborn, a Detroit suburb that has the largest number of Arab Americans of any city in the United States.\nThe meeting was disclosed by a person who was not authorized to discuss it publicly and spoke on condition of anonymity.\nBut the news is Kamala Harris’s secret meeting with Dearborn Mayor Abdullah Hammoud.\nFailure… — Abdullah H. Hammoud (@AHammoudMI) October 8, 2023He also gave a radical, antisemitic speech at an extremist anti-Israel rally last November."}, {"id": "0d73624a-7378-4050-b83b-7488adfad245", "title": "Jewish NGOs to host sideline events at Democratic National Convention", "date": "2024-08-19 02:15", "url": "https://www.5tjt.com/jewish-ngos-to-host-sideline-events-at-democratic-national-convention/", "domain": "5tjt.com", "domain_classification": "Unknown", "message": "(August 18, 2024 / JNS)While presidential nominee Kamala Harris and running mate Tim Walz take hits from both right and left for their stances on Israel, the Democratic National Convention will feature a number of events tied to the American Jewish community.\nThe Jewish Democratic Council of America (JDCA), which is led by Halie Soifer, Harris’s former national security adviser, will hold a series of events on the DNC sidelines throughout the week.\nDoug Emhoff, Harris’s Jewish husband, is set to keynote on Tuesday.\nRepublican nominee Donald Trump recently denigrated Emhoff’s Jewishness, calling him a “crappy Jew,” while critiquing American Jews who vote Democratic.\nThe Republican Jewish Coalition has issued a “Praise Israel” challenge, saying it would donate 1,800 trees to the Jewish state in honor of anyone who would address the Democratic convention from the main stage and ask the crowd to cheer for Israel."}, {"id": "a388642e-8b9a-4b3c-80e2-9221424acae1", "title": "Democratic convention to push for Israel arms embargo Andrea Shalal", "date": "2024-08-19 04:30", "url": "https://www.ruthfullyyours.com/2024/08/18/democratic-convention-to-push-for-israel-arms-embargo-andrea-shalal/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "Democratic convention to push for Israel arms embargo Andrea Shalalhttps://www.aol.com/pro-palestinian-delegates-democratic-convention-195700854.htmlCHICAGO (Reuters) -Dozens of Muslim delegates and their allies, angry at U.S. support for Israel’s offensive in Gaza, are seeking changes in the Democratic platform and plan to press for an arms embargo this week, putting the party on guard for disruptions to high-profile speeches at its national convention in Chicago.\nNor does it mention any plans to curtail U.S. arms shipments to Israel.\nThe United States approved $20 billion in additional arms sales to Israel on Tuesday.\nHer national security adviser said on X this month that she does not support an arms embargo on Israel.\nThe Uncommitted National Movement, a separate effort pushing Democrats to change policy on Israel that won over 30 delegates in primary elections, also wants an arms embargo."}, {"id": "9b1522e4-afcc-48d6-9c44-a79614d6666e", "title": "Pro - Palestinian delegates to Democratic convention to push for Israel arms embargo", "date": "2024-08-19 04:30", "url": "https://www.ynetnews.com/article/r1mkzbeia", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "On Sunday night, a crowd of roughly 1,000 pro-Palestinian protesters marched through downtown Chicago, chanting \"Shut down the DNC.\"\nPro-Palestinian delegates say they deserve a bigger role in the writing of the party platform.\nThe United States approved $20 billion in additional arms sales to Israel on Tuesday.\nHer national security adviser said on X this month that she does not support an arms embargo on Israel.\nThe Uncommitted National Movement, a separate effort pushing Democrats to change policy on Israel that won over 30 delegates in primary elections, also wants an arms embargo."}, {"id": "cc2eaa7d-42cb-4eaf-8156-ddb4e0007a4e", "title": "Trio Animato :  The Mendelssohn Project , August 24 | River Citie Reader", "date": "2024-08-19 01:00", "url": "https://www.rcreader.com/music/trio-animato-mendelssohn-project-sound-conservatory-aug24", "domain": "rcreader.com", "domain_classification": "Unknown", "message": "Mendelssohn's grandfather was the renowned Jewish philosopher Moses Mendelssohn, but Felix was initially raised without religion until he was baptized aged seven into the Reformed Christian church.\nHe was recognized early as a musical prodigy, but his parents were cautious and did not seek to capitalize on his talent.\nHis sister Fanny Mendelssohn received a similar musical education and was a talented composer and pianist in her own right.\nPost campus of Long Island University in music education before moving on to study piano performance at the famed Juilliard School.\nTrio Animato's The Mendelssohn Project will be performed on August 24, admission to the 7 p.m. concert is $12-40, and more information and tickets and available by visiting SoundConservatory.com."}, {"id": "12adaef4-b18f-4d21-ab53-ebc79263d907", "title": "Pro - Palestinian delegates to Democratic convention to push for Israel arms embargo", "date": "2024-08-19 05:15", "url": "https://thesun.my/world/pro-palestinian-delegates-to-democratic-convention-to-push-for-israel-arms-embargo-AM12878228", "domain": "thesun.my", "domain_classification": "Unknown", "message": "Pro-Palestinian delegates say they deserve a bigger role in the writing of the party platform.\nNor does it mention any plans to curtail U.S. arms shipments to Israel.\nThe United States approved $20 billion in additional arms sales to Israel on Tuesday.\nHer national security adviser said on X this month that she does not support an arms embargo on Israel.\nThe Uncommitted National Movement, a separate effort pushing Democrats to change policy on Israel that won over 30 delegates in primary elections, also wants an arms embargo."}]