[{"id": "21eef466-3fab-4dd6-8a65-769922881b5e", "title": "Houthis Report 16 Dead In Biggest Joint US - UK Airstrikes Since Gaza War Began", "date": "2024-06-01 00:15", "url": "https://www.zerohedge.com/geopolitical/houthis-report-16-dead-biggest-joint-us-british-airstrikes-gaza-war-started", "message": "Early on Friday Yemen's Houthis announced what appears to be the biggest mass casualty attack by the Western coalition since Red Sea hostilities began in the wake of Oct.7.\nThe joint British-U.S. airstrikes happened Thursday, and killed at least 16 people and wounded 35 others, according to Houthis statement.\nIllustrative: US military file imageThe strikes primarily focused on the port city of Hodeida, and the Houthis say that all killed there were civilians.\nIt said all the dead and nearly all the wounded from the strikes came from there.\n\"The strikes were taken in self-defense in the face of an ongoing threat that the Houthis pose,\" British Prime Minister Rishi Sunak announced."}, {"id": "7e3fbebf-c172-48e8-935f-fee119e25946", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:15", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "fa22f670-2982-4738-acbe-314313820821", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:45", "url": "https://www.wjol.com/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "b1c51d67-9dbc-45ee-ac5c-5301270a00c4", "title": "Israel - Gaza live updates : Israeli hostage Noa Argamani heard from in new audio", "date": "2024-06-01 00:45", "url": "https://www.k101fm.net/syndicated-article/?id=1566998", "message": "All times Eastern:May 31, 1:22 PMHamas releases audio from Israeli hostage Noa ArgamaniHamas has released a video containing audio from hostage Noa Argamani with images of her drawings over the audio.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nThey are now awaiting a response from Hamas, according to an Egyptian security source who spoke with ABC News.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nThe airstrike in Rafah on Sunday also resulted in the deaths of at least 50 individuals, including civilians, according to Action Aid UK."}, {"id": "f721a812-fcc6-465d-9dfb-cd67955ab8e3", "title": "Four killed in Israeli strikes on Lebanon", "date": "2024-06-01 00:15", "url": "https://www.rte.ie/news/world/2024/0531/1452499-four-killed-lebanon/", "message": "Israeli strikes on south Lebanon killed four people including a paramedic and a woman, Hezbollah and affiliated rescuers said, with the Iran-backed group adding it had fired dozens of rockets in retaliation.\nThe operations room of the Hezbollah-affiliated Islamic Health Committee told AFP that \"an Israeli drone strike targeted an ambulance... One rescuer was martyred and another wounded\" in the border town of Naqura.\nThe Israeli military said in a statement that \"fighter jets struck a military structure\" in the Naqura area \"where a terrorist cell's activity was identified\".\n\"A terrorist\" in the Yarun area, elsewhere in south Lebanon, \"was also struck\", the statement said, adding that a drone from Lebanon was intercepted.\nNearly 450 people have been killed in Lebanon in more than seven months of cross-border violence\"20 health workers killed since 8 October\", he added."}, {"id": "8581c64d-bc4d-4ba1-a07a-7a173dbc089d", "title": "Tensions Escalate as Houthis Claim Missile Strike on USS Eisenhower Amidst US - UK Yemen Strikes", "date": "2024-06-01 04:30", "url": "https://trendydigests.com/2024/06/01/tensions-escalate-as-houthis-claim-missile-strike-on-uss-eisenhower-amidst-us-uk-yemen-strikes/", "message": "The Iranian-backed Houthi rebels in Yemen have asserted that they targeted the US Navy’s nuclear-powered supercarrier, the USS Dwight D. Eisenhower (CVN-69), with a missile attack in the Red Sea.\nAccording to Yahya Saree, the military spokesperson for the Houthis, the alleged strike was a retaliatory measure for the joint US and UK military operations in Yemen, which reportedly resulted in casualties including both combatants and civilians.\nThe Houthi claim of having launched a successful missile attack raises considerable concern, given the intensifying conflict and the strategic significance of the Red Sea as a vital shipping lane.\nThe Houthis’ claims, thus far unsubstantiated, reflect an ongoing narrative battle within the broader conflict in Yemen.\nRelevant articles:– Houthis Claim to Have Attacked U.S. Navy Aircraft Carrier, National Intererst, 05/31/2024– The Houthi’s wild claim to have struck a US aircraft carrier is pure fiction, Business Insider, 05/31/2024– Houthis claim to have launched missile attack on US aircraft carrier in wake of US-UK strikes on Yemen, The Independent, 05/31/2024– Houthis Claim Missile Attack On US Aircraft Carrier: What We Know, Newsweek, 05/31/2024Glad you enjoyed above story, be sure to follow TrendyDigests on Microsoft Start."}, {"id": "17cffca5-31f6-4be2-8bf0-b906d92a0237", "title": "Irish police commissioner will speak to senior officers after former IRA member said he was behind the death of Lord Mountbatten", "date": "2024-06-01 01:45", "url": "https://www.dailymail.co.uk/news/article-13482587/Irish-police-commissioner-speak-senior-officers-former-IRA-member-said-death-Lord-Mountbatten.html", "message": "Garda Commissioner Drew Harris has said he will speak to senior officers following claims by a former IRA member that he was behind the death of Lord Mountbatten.\nMr Harris said that he will now speak with colleagues at the National Bureau of Criminal Investigation (NBCI) about the next steps in the case and whether or not an official investigation should be launched.\nAsked if Hayes (pictured) can expect to be questioned by gardaí in the near future, Mr Harris added: 'As I said, we have to commence an investigation.'\nHayes told the MoS he was in Co. Sligo at the time of the Mountbatten bombing.\nHe added: 'I blew up Earl Mountbatten in Sligo, but I had a justification: he'd come to my country.'"}, {"id": "3434f071-e4a5-40b9-9faa-564b475eee5b", "title": "Man charged with murder over fatal stabbing of woman on Bournemouth beach", "date": "2024-06-01 00:15", "url": "https://www.independent.co.uk/news/uk/crime/bournemouth-beach-stabbing-charge-amie-gray-b2554807.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A man has been charged with murder after a woman was knifed to death in a double stabbing on a beach in Bournemouth.\nNasen Saadi, 20, was charged with murder and attempted murder on Friday over the stabbing of Amie Gray, 34, and another woman, Dorset Police said.\nMs Gray, from nearby Poole, was killed at Durley Chine Beach at 11.42pm last Friday.\nAmie Gray, from nearby Poole, was killed at Durley Chine Beach at 11.42pm last Friday ( Facebook )Police launched a murder investigation and arrested Saadi, from Croydon, on Wednesday."}, {"id": "b4bcb75e-9dfb-4663-bcca-2a2e1d4725b4", "title": "At Least Two Injured As Russian Army Attacks Odesa With Ballistic Missile", "date": "2024-06-01 01:00", "url": "https://menafn.com/1108282728/At-Least-Two-Injured-As-Russian-Army-Attacks-Odesa-With-Ballistic-Missile", "message": "(MENAFN- UkrinForm) On Friday evening, the Russian military attacked Odesa with a ballistic missile likely equipped with a cluster munition warhead.\n\"In the evening, the enemy attacked Odesa with a ballistic missile likely equipped with a cluster munition warhead,\" Oleh Kiper, the head of the Odesa regional military administration, posted on Telegram.\nIt is noted that Russian terrorists targeted the infrastructure.\nDeath toll from overnight missile attack on Kharkiv rises to six\"Two people suffered shrapnel wounds: A 28-year-old girl and a 37-year-old man.\nThey are receiving all necessary medical care,\" wrote Kiper."}, {"id": "1619b504-7cf9-4945-af87-b37f9bec86ae", "title": "World News | Houthis Attack US Carrier in Red Sea Following Deadly Strikes on Yemen", "date": "2024-06-01 02:15", "url": "https://www.latestly.com/agency-news/world-news-houthis-attack-us-carrier-in-red-sea-following-deadly-strikes-on-yemen-6004344.html", "message": "Sana'a [Yemen], June 1 (ANI): Yemen's Houthi rebels say that they have launched a missile strike on a United States aircraft carrier in the Red Sea in retaliation for recent deadly strikes by the US and UK in Yemen, Al Jazeera reported.\nThis marks the highest publicly acknowledged death toll from multiple rounds of strikes linked to the group's alleged assaults on shipping.\nThe campaign has forced shipping firms to seek alternative routes, impacting approximately 12 per cent of global trade that traverses the Red Sea.\nDespite retaliatory strikes by the US and UK aimed at degrading Houthi capabilities, the rebels have continued their assaults.\nIn their latest actions, they targeted a Greek-owned bulk carrier and other vessels in response to Israeli strikes on Gaza, Al Jazeera reported."}, {"id": "3f99957a-ad1a-47e9-8e3b-24f81a6300b6", "title": "Body of slain woman found in unusual Vallejo location", "date": "2024-06-01 03:45", "url": "http://www.sfchronicle.com/crime/article/body-slain-woman-found-unusual-vallejo-location-19489339.php", "message": "A building on Walnut Avenue on Mare Island, which was the oldest Navy base on the West Coast when it shut down in 1996.\nCHRIS STEWART/SFCThe body of a woman found on Mare Island has been ruled a homicide, Vallejo police said Friday.\nOn Monday around 11:30 p.m., Vallejo police responded to a report of an unresponsive person on the 500 block of Walnut Avenue.\nThe Solano County Coroner’s office declared the death a homicide on Friday, according to Vallejo police.\n“That is not a common location for a homicide, on the island,” said Vallejo police spokesperson Sgt."}, {"id": "974de47b-6ef8-4381-aad1-b3bc8796ff49", "title": "Former MMA Fighter Pleads Guilty to Fatally Stabbing Man in Atlantic City Hotel Room", "date": "2024-06-01 03:15", "url": "https://www.yahoo.com/news/former-mma-fighter-pleads-guilty-024721684.html", "message": "Former MMA Fighter Pleads Guilty to Fatally Stabbing Man in Atlantic City Hotel RoomAndrew Osborne is scheduled to be sentenced on Aug. 22 for the September 2022 crimeAtlantic County Prosecutor's Office Andrew Osborne's mugshotA former MMA fighter from Philadelphia has pleaded guilty to a 2022 Atlantic City stabbing death.\nAccording to the release, Osborne admitted that he stabbed Wilkinson to death inside Wilkinson’s hotel room.\nDetectives from the Atlantic County Prosecutor’s Office’s Major Crimes Unit, along with the Philadelphia Police Department, later located and arrested the assailant.\nThe Atlantic County Prosecutor’s Office adds that Osborne is scheduled to be sentenced on Aug. 22 before Judge Bernard E. DeLury.\nThe investigation was carried out by the Atlantic County Prosecutor’s Office’s Major Crimes Unit and the Atlantic City Police Department."}, {"id": "47d24c64-cdc4-4eb7-a77f-aeec856bc072", "title": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stance", "date": "2024-06-01 04:15", "url": "https://sentinelcolorado.com/uncategorized/berlin-lets-ukraine-use-german-weapons-against-targets-in-russia-after-the-us-also-eases-its-stance/", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)Firefighters put out a fire on an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)Police officers cover a dead body after the Russian missile attack hit an apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\n(AP Photo/Andrii Marienko)People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024."}, {"id": "5921ad3d-f539-4fa6-b8cc-3c8cc2a83e20", "title": "Barred from combat , women working as codebreakers , cartographers and coxswains helped D - Day succeed", "date": "2024-06-01 02:15", "url": "https://www.columbian.com/news/2024/may/31/barred-from-combat-women-working-as-codebreakers-cartographers-and-coxswains-helped-d-day-succeed/", "message": "LONDON (AP) — What did you do in the war, Granny?\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nThe history of D-Day is often told through the stories of the men who fought and died when the Allies stormed the beaches of northern France on June 6, 1944.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nOften overlooked, their contributions have come into sharper focus as the number of living D-Day veterans dwindles and the world prepares for the 80th anniversary of the landings."}, {"id": "37f2a091-57ae-4fe8-810c-44996a5828b7", "title": "Special Military Operation Creating The Future of Warfare", "date": "2024-06-01 03:15", "url": "https://sputnikglobe.com/20240601/like-wwi-ukraine-conflict-is-reshaping-war-for-the-21st-century-1118727144.html", "message": "https://sputnikglobe.com/20240601/like-wwi-ukraine-conflict-is-reshaping-war-for-the-21st-century-1118727144.htmlLike WWI, Ukraine Conflict Is Reshaping War For the 21st CenturyLike WWI, Ukraine Conflict Is Reshaping War For the 21st CenturySputnik InternationalThe conflict in Ukraine is reshaping warfare in the 21st century, and just like WWI, it will be the generals who can adapt who will find success.\nHaig ordered frontal assaults, and not even the kind that were typical (though largely unsuccessful) during the early stages of the Great War.\nWhat Somme and many other battles in WWI proved was that the old way of fighting had come and gone.\nUkraine lost dozens of expensive tanks and thousands of men capturing and then holding the village.\nThey’re much too arrogant,” to put a cope cage on an Abrams, he said.The innovations on the battlefield in the Ukraine war are undoubtedly going to shape the next war and the war after that."}, {"id": "80fd0372-1d7d-4ca5-a004-fe8058aa9126", "title": "Ukraine war : We have no Plan B if Ukraine falls , Estonian PM says", "date": "2024-06-01 00:15", "url": "https://www.bbc.com/news/articles/c722zxj0kyro", "message": "\"If every Nato country did this,\" says Estonia’s steely Prime Minister Kaja Kallas, \"Ukraine would win.\"\nWhat, I asked Prime Minister Kallas, is Estonia’s Plan B if Ukraine loses this war and Russia’s invasion ultimately succeeds?\n\"We have no Plan B for a Russian victory,\" she replies, \"because then we would stop focussing on Plan A\" - helping Ukraine push back the Russian invasion.\nIf Ukraine joins Nato, even without some territory, then that’s a victory because it will be placed under the Nato umbrella.\"\n'Denial is key to strategy'So just how vulnerable is Estonia to a future Russian invasion?"}, {"id": "9bc92f29-b369-4f94-8202-a8a1c825c3e0", "title": "Analysis - Biden tip - toes deeper into Ukraine conflict with arms decision", "date": "2024-06-01 00:15", "url": "https://www.fijitimes.com.fj/analysis-biden-tip-toes-deeper-into-ukraine-conflict-with-arms-decision/", "message": "Since Russia’s 2022 invasion of Ukraine, Biden’s administration had argued it was too risky to allow Ukraine to strike targets on Russia territory with U.S.-supplied weapons.\nBiden administration officials say the latest decision, which went into effect on Thursday, was narrowly tailored to the battle in the Kharkiv region.\nPhilip Ingram, a former British military intelligence officer, said Biden’s decision will reduce Kyiv’s need to draw troops away from critical battle fronts in the eastern Donbas region.\nBiden’s administration had been finalizing the decision since then.\n“I don’t think (the decision) is going to change the movement of the frontline that much, if at all."}, {"id": "aca00638-e609-4d6c-9990-1f671a7fd5fc", "title": "Professor Shines Light on Normandy Lost Paratroopers - UT Dallas Magazine | The University of Texas at Dallas", "date": "2024-06-01 00:30", "url": "https://magazine.utdallas.edu/2024/05/31/professor-shines-light-on-normandys-lost-paratroopers/", "message": "Rene E. Rabe, a paratrooper of the legendary 82nd Airborne Division during World War II.\nOfficers constantly promoted him because they understood that the paratroopers would follow him into extreme danger.\nA: Most paratroopers did not like to jump out of “perfectly good airplanes.” Many of them were petrified when they jumped.\nQ: Tell me about your personal connection (your dad) to World War II.\nWomen are the lead characters in The Lost Paratroopers."}, {"id": "74bf9f2d-0d1b-40d6-a1b8-5dcab2c95dd6", "title": "Ukraine war : We have no Plan B if Ukraine falls , Estonian PM says", "date": "2024-06-01 04:15", "url": "https://www.bbc.co.uk/news/articles/c722zxj0kyro", "message": "\"If every Nato country did this,\" says Estonia’s steely Prime Minister Kaja Kallas, \"Ukraine would win.\"\nWhat, I asked Prime Minister Kallas, is Estonia’s Plan B if Ukraine loses this war and Russia’s invasion ultimately succeeds?\n\"We have no Plan B for a Russian victory,\" she replies, \"because then we would stop focussing on Plan A\" - helping Ukraine push back the Russian invasion.\nVictory in Ukraine is not just about territory.\nIf Ukraine joins Nato, even without some territory, then that’s a victory because it will be placed under the Nato umbrella.\""}, {"id": "09c48c10-f776-46ba-a968-ddfbc4a29d3c", "title": "Teenage Mutant Ninja Turtles : Splintered Fate for Nintendo Switch - Sales , Wiki , Release Dates , Review , Cheats , Walkthrough", "date": "2024-06-01 00:15", "url": "https://www.vgchartz.com/game/234211/teenage-mutant-ninja-turtles-splintered-fate/", "message": "With April and Metalhead analysing recovered artifacts for clues, the Turtles battle to recover their father from the clutches of the Foot Clan.\nHowever, as the gang gets ever closer to Splinter’s otherworldly location, an even greater threat lingers in the shadows…In Splintered Fate, brace yourself for fast-paced, roguelike action where no two runs are the same.\nTake control of all four Turtles, each wielding unique powers, and team up with friends for bodacious co-op gameplay.\nExplore iconic NYC locations, upgrade your Turtle powers, and prepare to face off against formidable enemies.\nWith thrilling combat and endless challenges, Splintered Fate promises to keep you engaged in the FIGHT, ADAPT, REPEAT portal loop."}, {"id": "dadf927c-772f-474a-931b-d93b757d7e39", "title": "Russo - Ukraine War - 31 May 2024", "date": "2024-06-01 04:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-31.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nIt is highly likely that most Russian forces receive only limited training, and they are unable to carry out complex offensive operations.\nAccording to preliminary data, since the beginning of the day in this direction Russian forces has lost 64 occupiers and one tank.\nThe Defense Forces are taking measures to stabilize the situation and prevent the Russian forces from advancing.\nDefense forces inflict tangible losses to the occupiers, actively applying fire-threatening tools on the Russian forces' live force and equipment."}, {"id": "aa77119e-4867-4b21-9f3f-07f67d6df443", "title": "Operation Iron Swords", "date": "2024-06-01 04:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-31.htm", "message": "Operation Iron Swords - Day 238 - 31 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nThe fighters directed an Air Force aircraft that killed a number of terrorists who were operating near Israeli forces.\nThe Israeli army praised the engineering activity with the assistance of the Egyptian army.\nControl of the Philadelphia axis comes only weeks after Israeli forces took control of the Rafah border crossing with Egypt, on May 7.\nAs a member of the war council, Gantz helped manage the Israeli attack on Gaza before tensions emerged as the military operation proceeded."}, {"id": "a463e002-1942-40e3-99ab-dc744ad113e7", "title": "1066 and all what ? A quarter of adults dont know when the First World War or the Battle of Hastings was", "date": "2024-06-01 00:15", "url": "https://www.dailymail.co.uk/news/article-13482597/quarter-adults-dont-know-World-War-Battle-Hastings.html", "message": "This nation has been profoundly changed by the events of history including two world wars.\nYet a quarter of adults do not know when the First World War took place, a poll has revealed.\nAnd a small minority even believe that the victor in the Battle of Hastings was Robin Hood.\nThese questions were then put to 1,000 adults in research for online booking service Trainline.\nA quarter of the adults asked could not list the years in which the First World War took place."}, {"id": "53534c2b-95b3-49a2-bdda-74ac24865e26", "title": "The Best Android and iOS Games of 2024", "date": "2024-06-01 04:30", "url": "https://n4g.com/news/2602036/the-best-android-and-ios-games-of-2024", "message": "50°The Best Android and iOS Games of 20242024 has become filled with games, and now is the perfect time to play some classic and new.\nCheck out the Best Android Games of 2024!"}, {"id": "d4e14786-8899-48f8-a67c-0a500f679090", "title": "Ancient Egyptians Tried to Surgically Treat Cancer , Study Finds", "date": "2024-06-01 04:00", "url": "https://gizmodo.com.au/2024/06/ancient-egyptians-tried-to-surgically-treat-cancer-study-finds/", "message": "Scientists have discovered archaeological evidence that ancient Egyptians attempted to surgically remove cancerous lesions, pushing the practice back to over 4,000 years ago.\nSkull 236 in particular was littered with tinier lesions across the skull, probably an indication of advanced, metastasized cancer.\nIf the team’s discovery is genuine, it would be the first documented instance of surgical cancer treatment recorded in human history.\nMore research and data will be needed to verify this hunch, however, as well as to confirm and expand their findings on cancer in the ancient world, they note.\n“Our aim is to complete the biography of cancer from the very beginning of human history.”"}, {"id": "ba1556fe-73eb-48dd-8036-481407e7ab99", "title": "World Outlander Day : Five of the best Scottish moments from epic drama", "date": "2024-06-01 04:15", "url": "https://www.dailyrecord.co.uk/scotland-now/world-outlander-day-five-best-32923205", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the latest news on Jamie and Claire every week - sign up to our weekly Everything OutlanderSomething went wrong, please try again later.\nOn June 1 every year, fans across the world share their favourite moments, quotes, and clips from the historical epic.\nOne of the most tender moments is where Claire comes across her soulmate speaking in Gaelic to his sister Jenny's baby."}, {"id": "d49be34e-194d-4935-b82c-427d6914317b", "title": "Great North Battle 2024 Day 1 - NOW Toronto", "date": "2024-06-01 04:00", "url": "https://nowtoronto.com/event/great-north-battle-2024-day-1/", "message": "The Great North Battle returns for its 5th edition in Toronto!\nA true celebration of hip hop shining light on all of the elements with battles, showcases and workshops over 2 days.\nThen Beatbox Canada shall be hosting the seeding rounds/first battle rounds of both the solo/loopstation categories of our stacked international beatbox competition with judge and special guest showcases mixed in.\nOur partners in the world of battle rap are the premier battle league KOTD.\nThey will be hosting a 4 person on beat battle rap tournament with 4 hungry MCs all vying for title of champion."}, {"id": "b747ca94-86a8-4a9f-beed-2746023233fc", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 01:30", "url": "https://www.smh.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "500ccc73-728e-4518-b638-d431e2dea759", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 01:45", "url": "https://www.theage.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "c371ae6c-5716-4280-b53e-8230d157c207", "title": "Thompson continues farm bill push after successful committee vote", "date": "2024-06-01 00:30", "url": "https://www.beefmagazine.com/policy/thompson-continues-farm-bill-push-after-successful-committee-vote", "message": "In the wake of last Friday’s bipartisan vote to pass a new farm bill out of the House Agriculture Committee, Chairman Glenn “GT” Thompson (R-Penn.)\nOn Wednesday, Thompson jointly authored an op-ed in The Hill with House Ways and Means Committee Chairman Jason Smith (R-Mo.)\nWhile the Agriculture Committee oversees programs that promote agriculture to foreign buyers, Ways and Means holds general jurisdiction over broader trade legislation.\nThe GCSA promotes voluntary carbon credit markets to stimulate carbon sequestration on farms and provide certainty and predictability for participants.\n“High-integrity voluntary carbon markets offer a promising tool to create new revenue streams for producers and achieve greenhouse gas reductions from the agriculture and forest sectors,” said Secretary of Agriculture Tom Vilsack."}, {"id": "1fc20245-4093-4904-8f58-59cffdc28c16", "title": "Tom Madden New Book  Planetary Lifeguard : Blowing The Whistle On Climate Change  Available On Amazon", "date": "2024-06-01 01:45", "url": "https://menafn.com/1108282140/Tom-Maddens-New-Book-Planetary-Lifeguard-Blowing-The-Whistle-On-Climate-Change-Available-On-Amazon", "message": "(MENAFN- ForPressRelease) Boca Raton, Fla., May 31, 2024 -- Interested in more about the ongoing fight against climate change?\nAuthor and CEO Tom Madden's new Planetary Lifeguard tells how we can rescue our planet by staying fully informed, armed with knowledge!\nPlanetary Lifeguard: Blowing the Whistle on Climate Change looks at the havoc carbon emissions from fossil fuels are causing mother earth and what we must do to save her.\nMadden, a former Atlantic City, NJ lifeguard created a Planetary Lifeguard to lead us to victory over global warming.\nOther books written by Madden include Wordshine Man, SPIN MAN, King of the Condo, Is there enough Brady in Trump to win the InSUPERable Bowl?"}, {"id": "aa3fd0e2-e32a-4a1e-826a-30e769445eee", "title": "Israel - Hamas war latest : Biden says Hamas  no longer capable  of major attack , proposes complete ceasefire , three - phase plan", "date": "2024-06-01 02:15", "url": "https://www.watoday.com.au/world/middle-east/biden-says-hamas-no-longer-capable-of-major-attack-proposes-total-ceasefire-20240601-p5jifz.html", "message": "Biden’s remarks came as the Israeli military confirmed that its forces were now operating in central parts of Rafah in its expanding offensive in the southern Gaza city.\nBiden called it “a truly decisive moment”.\nHe added that Hamas said it wanted a ceasefire and that an Israeli-phased deal was an opportunity to prove “whether they really mean it”.\n“The people of Israel should know they can make this offer without any further risk to their security,” Biden said.\nLoading Israel launched its war in Gaza after Hamas’ October 7 attack in which militants stormed into southern Israel, killed some 1200 people – mostly civilians – and abducted about 250."}, {"id": "6d19ef41-e8d3-48a5-a324-529377e74a6f", "title": "Austal united states Wins $516 Million Contract to Construct Navy Ocean Surveillance Ship", "date": "2024-06-01 00:15", "url": "https://gcaptain.com/austal-usa-wins-516-million-contract-to-construct-navy-ocean-surveillance-ship/", "message": "May 31 (Reuters) – Austal Ltd has secured a $516 million contract to construct the lead ship of the United States Navy’s ocean surveillance program, T-AGOS 25, the Australian defence shipbuilder said in an exchange filing on Friday.\nThe contract, announced on May 19, was originally for $113.9 million for a detailed design of the Auxiliary General Ocean Surveillance Ship T-AGOS 25 Class for the United States Navy, with options to design and construct up to seven such ships.\nOn Friday, the United States Navy exercised its option to modify the contract to construct a ship, allowing Austal to buy the materials required to continue building the surveillance vessel.\nIf all options under the contract are exercised, the cumulative value of the order amounts to $3.20 billion, Austal added.\nT-AGOS ships, operated by the United States Military Sealift Command (MSC), support the antisubmarine warfare (ASW) mission of the commanders of the Atlantic and Pacific Fleets, the shipbuilder said in its statement."}]