[{"id": "22133db7-04d2-46bb-9df3-5e9c62e39de8", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 00:15", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000813.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously."}, {"id": "7ba2b918-1887-416b-af5f-250f1464173b", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 01:00", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000528.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously."}, {"id": "5c017525-3cb3-4157-afd6-c4859aeb271a", "title": "Plea for Return of Hostages Held by Hamas Will Add Somber Undertone to This Year Parade for Israel at New York", "date": "2024-06-01 00:30", "url": "https://www.nysun.com/article/plea-for-return-of-hostages-held-by-hamas-will-add-somber-undertone-to-this-years-parade-for-israel-at-new-york", "message": "Following the October 7 terrorist attack on Israel, the annual parade for Israel on Fifth Avenue will be less of a celebration and more of a show of solidarity, organizers say.\nNew York City’s parade for Israel, which has been held annually since 1964 and draws thousands of people to Manhattan’s Fifth Avenue in support of the Jewish state, will take a more somber tone this year.\nThe parade messaging will also prominently feature the words “Bring Them Home,” a plea to return the hostages taken by Hamas that has been heard and seen on posters around the world, New York Jewish Week reported.\nThe families of victims and hostages of the October 7 terrorist attack will be at Sunday’s parade, the event organizers say.\nIsraeli diplomat Ofir Akunis, a long-time parade attendee, will march this year for the first time as Consul General of Israel at New York."}, {"id": "f8eb6b0e-3c01-4bc6-b70c-84f496bd5a11", "title": "Grapevine May 31 , 2024 : Corruption in high places", "date": "2024-06-01 03:30", "url": "https://www.jpost.com/israel-news/article-804445", "message": "No one should be shocked by revelations of corruption in high places in Israel.\nAmong the MKs who were placed behind bars were Meir Kahane, Naomi Blumenthal, Omri Sharon, and Fania Kirschenbaum.\nYair Golan attends a conference at the Reichman University in Herzliya, on February 6, 2024.\nAmong his most recent is an honorary doctorate from the University of Haifa to which he has been a most generous benefactor.\nThe keynote speaker at Wednesday’s event will be Danny Adeno Abebe, the journalist and prize-winning author of From Africa to Zion, who is among the more widely known and more influential members of Israel’s Ethiopian community."}, {"id": "46c574d3-4caf-425a-ae86-390bd5877dcf", "title": "ANU airs documentary detailing plight of Sephardi crypto - Jews", "date": "2024-06-01 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-804339", "message": "Research for the film took the Milgroms and director Otero to locations in Cuba, Spain, Portugal, the Canary Islands, Cartagena, Colombia, Costa Rica, France, Miami, and Key West.\n“Having discovered my lineage dating back to pre-Inquisition Spain and Portugal, I felt compelled to travel back in time and confront my history head-on.\nShe has come across thousands of these little-known documents of Jewish life in Spain and Portugal prior to and during the Inquisition.\nPerry is founder of Reconectar, an organization set up to assist in connecting the descendants of Spanish and Portuguese Jewish communities to the mainstream Jewish world, both online and in person.\nWith his contacts in the Israeli government and the legal world, Perry has been able to help place the issue of Bnei Anusim on the global Jewish agenda."}]