[{"id": "bc734c36-38f5-457b-ba2e-38c5826d2c30", "title": "One Killed , 11 Wounded In Israeli Airstrikes On Lebanon", "date": "2024-08-20 02:15", "url": "https://menafn.com/1108577912/One-Killed-11-Wounded-In-Israeli-Airstrikes-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT/JERUSALEM, Aug 20 (NNN-NNA) – A member of Lebanese Hezbollah, was killed and 11 other people wounded yesterday, in Israeli in eastern and southern Lebanon, Lebanese military sources said.\nThe Israeli military confirmed in a statement that its aircraft hit Hussein Ali Hussein, identified by the Israeli military as a militant, in Deir Qanoun.\nHussein was a key member of Hezbollah's Rocket and Missile Unit in the area of Yarine in southern Lebanon, according to the Israeli military.\nThe injured were transported by ambulance to Tebnine Government Hospital in southern Lebanon,” said the sources.\nIn the Baalbek area of eastern Lebanon, six people were injured in an initial report, as a result of Israeli raids that targeted three Hezbollah sites, added the sources."}, {"id": "f4c7a1d1-ac2f-4abb-b591-b4c4f9ca8373", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394872", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "IAF fighter jets on Monday evening struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon.\nIn addition, an IAF aircraft eliminated the terrorist Hussein Ali Hussein in the area of Deir Qanoun in southern Lebanon.\nEarlier on Monday, IDF forces identified a terrorist cell operating from a Hezbollah military structure in the area of Tayibe in southern Lebanon.\nIAF fighter jets struck the structure in which the terrorists were operating.\nOvernight, Air Force fighter jets attacked Hezbollah military structures in the areas of Ayta al-Shaab, Beit Lif, and Houla in southern Lebanon."}, {"id": "35b7cda4-b8ad-4ed9-b23e-ddfd2339eb8d", "title": "Blinken says Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict boosting hopes of piece", "date": "2024-08-20 01:15", "url": "https://www.dailymail.co.uk/news/article-13759601/Blinken-says-Israel-prepared-compromise-Hamas-secure-deal-end-Gaza-conflict-boosting-hopes-piece.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict, the US Secretary of State indicated last night.\nMr Blinken said last night: 'In a very constructive meeting, prime minister Netanyahu confirmed to me that Israel supports the bridging proposal.\nFor his part, Mr Netanyahu said the talks with Mr Blinken had been 'positive' and 'conducted in a good spirit'.\nToday, Mr Blinken is expected to travel to Egypt for further talks to end the fighting.\nIsrael is also braced for more suicide bombings by Hamas following a suicide bombing in Tel Aviv on Sunday."}, {"id": "79336c95-e466-4018-a58b-5b0f16a2e574", "title": "Militias Signal De - Escalation with the U . S ., Return to Cosmetic Israel Strikes", "date": "2024-08-20 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/militias-signal-de-escalation-us-return-cosmetic-israel-strikes", "domain": "washingtoninstitute.org", "domain_classification": "Unknown", "message": "The self-styled Iraqi \"resistance\" has hinted at a desire to end the tit-for-tat sequence of strikes with the United States and return to cost-free counter-Israel operations.\nIn that event our response will not be stopped by restrictions\" (Figure 1).This message followed another round of U.S. strikes the day before against militias belonging to the self-styled muqawama (resistance) (Figure 2).\nIran blames Israel for the assassination of Ismail Haniyeh right under its nose and may soon respond with military attacks.\nThe Tansiqiya seems to be warning the United States not to use Iraqi airspace to strike Iran if said retaliation unfolds.\n(See Militia Spotlight's attack tracker for a database covering this and other attacks in Iraq and Syria.)"}, {"id": "11c3102b-94bf-4db3-bce6-da74f049d658", "title": "Israel strikes deep in east Lebanon", "date": "2024-08-20 00:30", "url": "https://tribune.com.pk/story/2489424/israel-strikes-deep-in-east-lebanon", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Israel struck Hezbollah weapons depots on Monday deep in Lebanon's east, a source close to the group told AFP, in a raid confirmed by the Israeli military.\nIt came after an Israeli soldier was killed in northern Israel, amid 10 months of cross-border clashes between Iran-backed Hezbollah and Israel.\n\"Israeli strikes in the (eastern) Bekaa region targeted Hezbollah weapons depots,\" said the source close to Iran-backed Hezbollah, requesting anonymity due to the sensitivity of the matter.\nEarlier on Monday, the Israeli military said a member of its Bedouin Trackers Unit \"fell during combat in northern Israel\".\nIsrael's military said its air force struck \"Hezbollah terrorists\" in the Hula area and \"Hezbollah military structures\" elsewhere in south Lebanon."}, {"id": "b804db79-b4d9-4dca-b9fc-14b303512b04", "title": "Blinken says Israel has agreed to US proposal to close remaining gaps on ceasefire deal and calls on Hamas to do the same", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/2024/08/19/blinken-says-israel-has-agreed-to-us-proposal-to-close-remaining-gaps-on-ceasefire-deal-and-calls-on-hamas-to-do-the-same/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Despite the claims of Netanyahu’s agreement to the bridging proposal, there are still significant challenges before a deal can actually be reached.\nNot only has Hamas not agreed to the proposal but negotiators are still working on specific details on how an agreement would be implemented.\n“It is time for everyone to get to yes, and to not look for any excuses to say no,” Blinken said.\nHamas said the latest proposal didn’t include a permanent ceasefire and introduced new conditions on the exchange of prisoners, among other issues.\nIn the evening, an Israeli airstrike in central Gaza killed seven members of the same family, medical officials said."}, {"id": "22fd7664-da6b-47cd-a31c-9183b9f7610f", "title": "Taylor Swift meets two young girls injured in Southport knife rampage", "date": "2024-08-20 00:00", "url": "https://www.dailymail.co.uk/news/article-13757901/taylor-swift-wembley-meet-southport-survivors.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Taylor Swift met two young girls at her Wembley gig who were injured in the Southport knife rampage.\nThe Shake It Off singer, 34, invited the two young girls backstage and posed for photos before one of her record breaking shows over the weekend.\nSwift reportedly reached out to the families of the Southport stabbing before she took to the stage at Wembley on Thursday with the gig said to be 'the hardest concert of her career' after the killings.\n'Taylor may not have spoken about Elsie Dot, Alice and Bebe on stage but she has reached out to their families,' an insider said.\nJust days later, Swift was then forced to cancel three gigs in Vienna after police uncovered a foiled ISIS terror plot."}, {"id": "56d51972-64db-4950-b155-ad5f3700646b", "title": "Harris Denounces IDF Attack on Hamas Command - and - Control Center", "date": "2024-08-20 02:15", "url": "https://www.frontpagemag.com/harris-denounces-idf-attack-on-hamas-command-and-control-center/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "On August 10, the IDF fired three precision missiles at one part of the Al-Tabeen school in Gaza that was being used as a command-and-control center by Hamas.\nIt claimed that several of the 19 Hamas combatants the IDF said it had killed at the school had, in fact, been killed weeks before at other locations.\nThese are the figures, remember, put out by Hamas, which has a long record of lying about civilian casualties.\nIs that, as Kamala Harris insists, “far too many” civilian casualties?\nSo it is wrong to describe the latest attack as causing a “disproportionate” number of civilian casualties."}, {"id": "d21c74df-5b27-4725-ab82-07f2c0270280", "title": "Taylor Swift Met With Survivors of the Southport Stabbings That Left 3 Girls Dead", "date": "2024-08-20 01:00", "url": "https://www.glamour.com/story/taylor-swift-met-with-survivors-of-the-southport-stabbings-that-killed-3-young-girls", "domain": "glamour.com", "domain_classification": "Unknown", "message": "Taylor Swift just made two fans’ dreams come true after they lived through a nightmare.\nOver the weekend, two young girls who survived the recent deadly stabbing at a Swift-themed yoga and dance class met with the 34-year-old pop star just before a London Eras Tour concert.\nThe rest of the Foster family also joined in for photos with Swift and her mom, Andrea.\nJust last month, three young girls were killed during a mass stabbing at the Swift-themed event in Southport, England, which took place on July 29.\nOne day later, Taylor Swift took to Instagram to address the heartbreaking crime."}, {"id": "74b31934-46ac-4df0-9840-90cbe5160985", "title": "Man , 64 , who is fighting for his life in hospital after triple Manchester stabbing is the husband of mother - of - four who died in same horrific incident", "date": "2024-08-20 02:00", "url": "https://www.dailymail.co.uk/news/article-13759683/Man-64-fighting-life-hospital-triple-Manchester-stabbing-husband-mother-four-died-horrific-incident.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A mother-of-four has been stabbed to death outside her suburban home while her Christian preacher husband and a 17-year-old girl were left critically-injured in the horrific incident.\nPolice arrested a 22-year-old man on suspicion of murder, who detectives said was ‘known’ to the victims.\nThe family worshipped at Blessed Baptist Temple church, based in nearby Levenshulme, where Mr Obinim is church leader and trustee.\nIt is just so shocking and upsetting.’Police including armed officers were deployed to the scene and the suspect was apprehended in the area.\nDetective Superintendent Toby Facey, of Greater Manchester Police, said: ‘Our thoughts remain with those affected and their loved ones."}, {"id": "003851f6-f800-4fdc-8639-a17dea011e1b", "title": "Israeli Bedouin soldier killed in Hezbollah drone barrage", "date": "2024-08-20 02:15", "url": "https://news.webindia123.com/news/Articles/World/20240820/4226734.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Warrant Officer Mahmood Amaria, 45, from the Bedouin town of Ibtin, was killed in Monday morning's drone attack, the IDF said.\nNearly 80,000 Israelis were forced to evacuate their homes near the Lebanon border when Hezbollah began launching rockets and drones in October.\nHezbollah leaders have said they will continue the attacks to prevent Israelis from returning to their homes.\nThe attacks have killed 26 civilians and 19 soldiers on the Israeli side.\nIsraeli officials have been calling for Hezbollah to be disarmed and removed from southern Lebanon in accordance with UN Security Council resolution 1701, which ended the 2006 Second Lebanon War."}, {"id": "fc9c4ecd-58e8-47e5-a173-55a7d72e4d50", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394865", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It was cleared for publication on Monday evening that Lieutenant Shahar Ben Nun, aged 21, from Petah Tikva, a commander in the Paratroopers Reconnaissance Unit, Paratroopers Brigade, fell during combat in the southern Gaza Strip.\nBen Nun was killed by a bomb dropped by an israeli aircraft as a result of a malfunction in the plane's navigation system.\nDue to the malfunction, the jet missed its intended target by nearly 300 meters and struck an apartment close to where a group of soldiers were stationed.\nBen Nun was killed in the blast, and six other soldiers were lightly to moderately wounded.\nThe first bomb struck its target, but the second bomb missed and caused the explosion in which Ben Nun was killed."}, {"id": "f22d7b22-6513-43ed-a17c-22c0ebdeefb6", "title": "Harbor Commissioners To Revisit Discussion on Fireworks Ban", "date": "2024-08-20 00:45", "url": "https://wildrivers.lostcoastoutpost.com/2024/aug/19/harbor-commissioners-revisit-discussion-fireworks/", "domain": "wildrivers.lostcoastoutpost.com", "domain_classification": "Unknown", "message": "Crescent City Harbor commissioners will discuss how to go about addressing the problem at their meeting Tuesday, though at least one, Board President Harry Adams, says all fireworks should be banned.\nAdams said he drove around Crescent City at about 5 a.m. July 5 and what he found disgusted him.\nThe Harbor District is considering an ordinance banning all fireworks at the port — something Adams is arguing for.\nThey’re both due in court on Friday, according to the Del Norte County Superior Court calendar.\nThe Harbor District Board of Commissioners will meet at 2 p.m. in the Harbor District office at 101 Citizens Dock Road."}, {"id": "bd6722e5-7935-4acc-b71b-0c2f8d114eee", "title": "Trump Says He Would Appoint Elon Musk To Cabinet If Elected", "date": "2024-08-20 00:30", "url": "https://www.yahoo.com/news/trump-says-appoint-elon-musk-235951798.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump Says He Would Appoint Elon Musk To Cabinet If ElectedFormer President Donald Trump plans to offer a job to his billionaire buddy Elon Musk if elected, Reuters reported on Monday.\nTrump said he would consider terminating it, and also be open to assigning a cabinet or advisory role to Musk, the Tesla Motors co-founder and CEO.\nHe’s a brilliant guy,” Trump said.\n“I think it would be great to just have a government efficiency commission that takes a look at these things and just ensures that taxpayer money...is spent in a good way,” Musk told Trump.\n“You’re the greatest cutter,” Trump told Musk during their conversation last week."}, {"id": "6adb27f3-6a99-4cc7-84ea-a9db085f3600", "title": "US authorizes potential sale to S . Korea of Apache attack helicopters", "date": "2024-08-20 02:00", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/205_380856.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The United States has approved a potential sale to Korea of Apache attack helicopters and related logistical and other elements to help improve the Asian ally's defense capabilities, a government agency said Monday.\nThe Defense Security Cooperation Agency (DSCA) under the Department of Defense announced that the State Department has made the decision on the potential government-to-government Foreign Military Sale (FMS) estimated to cost $3.5 billion.\nKorea has made a request to buy up to 36 AH-64E Apache attack helicopters, 76 T700-GE-701D engines, 456 AGM-114R2 hellfire missiles, 152 AGM-179A joint air-to-ground missiles and 40 AAR-57 common missile warning systems among others, according to the agency.\n\"The proposed sale will improve the Republic of Korea's capability to meet current and future threats by providing a credible force capable of deterring adversaries and participating in regional operations,\" it added.\nDSCA delivered the certification notifying Congress of the possible sale earlier in the day as the sale requires congressional endorsement."}, {"id": "27f13f39-2935-48c4-b7c0-de1673f0302c", "title": "Stabbed : Man stabs minor cousin to death | Bhubaneswar News", "date": "2024-08-20 01:00", "url": "https://timesofindia.indiatimes.com/city/bhubaneswar/man-stabs-minor-cousin-to-death/articleshow/112638160.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The girl was hospitalized but her life is not in danger, while her mother sustained minor injuries.\n22-year-old man stabbed to death after road rage in DelhiA 22-year-old man, Monu, was fatally stabbed by four men in Prasad Nagar, Delhi on August 15.\nUP man gets life for setting afire cousin who spurned himA fast-track court in Mainpuri sentenced a man to life imprisonment for murdering his 15-year-old cousin after she rejected his advances six years ago.\nThe girl identified her attacker before succumbing to her injuries, crucial in convicting Jitendra Kumar.\nBerhampur: A 13-year-old girl was stabbed to death by her cousin during a shradhh ceremony at the latter’s house in Jagannath Bihar under Bada Bazar police station limits here on Monday."}, {"id": "5369068e-a125-4a67-905a-e5d0a887c364", "title": "Napoleons Eagles 9 _ 5 file", "date": "2024-08-20 01:45", "url": "https://www.moddb.com/mods/napoleons-eagles/downloads/napoleons-eagles-9-5", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Follow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nFollow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nWe are proud to announce release of version 9.5 of the Napoleon's Eagles mode for NTW, also known as Historical Battles mod for NTW3.\nThe mod is compatible with the version 9.5+ of NTW3 mod by the Lordz Modding Collective.The NE mod deals with the historical engagements of the Napoleonic Era.\nNE mod aims at achieving a good balance between historical accuracy and immersive gameplay, with a strong emphasis on realistic representation of Napoleonic warfare on both strategic and tactical levels."}, {"id": "da39f165-cf4b-4a50-99ab-e612b21e34bf", "title": "US and South Korea hold joint air drills to counter North Korea threat", "date": "2024-08-20 04:30", "url": "https://www.aol.com/us-south-korea-hold-joint-025623133.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The drills are part of the annual Ulchi Freedom Shield exercises that are designed to boost the joint readiness of the South Korean and U.S. militaries against threats from North Korea, it said.\nAircraft on defensive patrol flights are being diverted to air combat scenarios under simulated drills involving mock enemy aircraft interdiction and cruise missile defence, it said.\nAircraft from two U.S. fighter wings based in South Korea are taking part, the air force said.\nThe United States stations 28,500 troops in the South for combined defence against nuclear-armed North Korea.\nNorth Korea routinely denounces the annual Ulchi Freedom Shield drills, which began on Monday and will run through to Aug. 29, for stoking tensions on the Korean peninsula, calling them rehearsals for a nuclear war."}, {"id": "3bb949d3-3bb6-4fcb-981f-8d74bee196f7", "title": "Russo - Ukraine War - 19 August 2024", "date": "2024-08-20 01:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-19.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, 629 kamikaze drones were recruited and carried out over 3,400 shelling at the positions of Ukrainian troops and settlements.\nIn the Kharkiv direction, Russian forces five times attacked the defensive borders of Ukrainian warriors near lipcív and vovčans вавka.\nIn the Vremívs вихkomu direction, Russian forces carried out five assault actions, in particular towards Vodânogo."}, {"id": "a2513b34-bc94-4703-b380-fa0151ea198a", "title": "Former CIA director makes stop in Peoria , speaks about international wars", "date": "2024-08-20 01:00", "url": "https://www.yahoo.com/news/former-cia-director-makes-stop-221306290.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — Leadership is important everywhere.\nThat’s the message of a special guest who spoke at a luncheon in East Peoria on Monday.\nHe mentions in his book why it is so important to be a good leader or have good leadership.\nHe also shared at the luncheon what is important about “strategic leadership.”“Now, strategic leadership is crucial in any endeavor,” he says.\n“CEO of Caterpillar is a strategic leader."}, {"id": "cbb0effd-8de6-4813-9a36-64b4da6bffaf", "title": "Democratic National Convention in 2024 reminiscent of Chicago DNC riots in 1968", "date": "2024-08-20 00:30", "url": "https://www.10news.com/politics/america-votes/democratic-national-convention-in-2024-reminiscent-of-chicago-dnc-riots-in-1968", "domain": "10news.com", "domain_classification": "Unknown", "message": "But when you look back at the Democratic National Convention in 1968, it takes you back to a time of national turmoil, political uncertainty and war.\n\"There was nothing like '68 where right on the floor of the convention you had, like, warring factions.\"\nPresident Johnson increased the number of American troops in Southeast Asia and by 1968, more than half a million troops were serving in Vietnam.\nThe Democratic Party did not look like it was in control of itself or could get control of anything,\" he said.\nThe anti-war movement and the protests at the DNC in 1968 introduced us to the Chicago Eight — they were the first to be indicted for conspiracy and crossing state lines to incite a riot."}, {"id": "1d3aa1dd-1e64-46b9-8f4b-38572d9e5332", "title": "Yoon calls for strengthening readiness against N . Korea  gray zone  provocations", "date": "2024-08-20 00:45", "url": "https://en.asiatoday.co.kr/view.php?key=20240820000924525", "domain": "en.asiatoday.co.kr", "domain_classification": "Unknown", "message": "1AsiaToday reporter Chun Hyun-binPresident Yoon Suk-yeol called for strengthening readiness against North Korea’s “gray zone” provocations, as South Korea and the United States kicked off their annual joint exercise on Monday.\n“Anti-state forces threatening the country’s liberal democracy are active everywhere in society,” he said.\nYoon stressed that internal forces threatening liberal democracy as anti-state forces, and ordered the establishment of a firm defense posture against the North.\n“We plan to significantly expand the South Korea-U.S. joint field training exercises,” he said.\n“Only a strong security posture can protect the safety of the people and liberal democracy.”"}, {"id": "69a91986-aa34-4b6c-bd77-902d29dce7bb", "title": "Sgt . Yuval Ben Yakov legacy : Addressing antisemitism and unity", "date": "2024-08-20 00:15", "url": "https://www.jpost.com/opinion/article-815375", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "On October 7, 2023, the first day of the war triggered by Hamas’s barbaric attack on Israel, my son, Sgt.\nYuval Ben Yakov (z”l), fell heroically defending our country.\nFor decades, I have professionally supported the development of vital connections between Israel and Jewish communities.\nThe dangers of social mediaSocial media, widely and almost unrestrictedly spreading xenophobic and antisemitic content, only accelerates this process.\nIn recent years, notable incidents rooted in antisemitism have been documented in the US, EU, and many other regions."}, {"id": "aad7b125-47f1-439b-abeb-41c27e99ca06", "title": "Reenactors and researchers recall San Antonio  first tragedy  ", "date": "2024-08-20 00:30", "url": "http://www.expressnews.com/news/texas/article/first-texas-revolution-1813-19659224.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "The ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe annual gathering commemorates the anniversary of the bloodiest battle in Texas history.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Atascosa County Historical Commission Chairman Martin Gonzales bows his head in prayer Saturday at the Battle of Medina Symposium in Leming.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Sons of the American Revolution in period costume fire a black-powder musket salute at Saturday’s annual Battle of Medina Symposium in Leming."}, {"id": "d38e0ec9-dfed-4bcb-9d9c-64cc933666d1", "title": "Navy Installs New MQ - 25 Ground Control Station Aboard USS George HW Bush Carrier", "date": "2024-08-20 00:00", "url": "https://executivegov.com/2024/08/navy-installs-new-mq-25-ground-control-station-aboard-uss-george-hw-bush-carrier/", "domain": "executivegov.com", "domain_classification": "Unknown", "message": "The U.S. Navy has completed installing a new control room for the MQ-25 Stingray onboard the USS George H.W.\nBush aircraft carrier.\nCalled the Unmanned Air Warfare Center, the ground control station—a.k.a.\nAir vehicle pilots will use the UAWC to control the Stingray’s airborne operations moving forward.\nAccording to Unmanned Carrier Aviation Program Manager Capt."}, {"id": "428c9ce1-d431-4870-84bc-8558285dc9d8", "title": "How Ukraine turned the war on its head with surprise attack on southern Russia", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/18/how-ukraine-turned-the-war-on-its-head-with-surprise-attack-on-southern-russia/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Ukrainian forces also used detailed knowledge of the geography to launch the attack, using forest belts for cover and roads for speed.\nKey to their success: air defenses and supporting artillery, as well as jamming to prevent the Russian military from communicating.\nMany of its residents were sent scrambling on hair-raising escapes, some cursing the Russian military for abandoning them.\nAt the same time, the Ukrainians trained their attention on Russian reinforcements, wiping out one convoy of 14 Russian military vehicles near Rylsk with a missile attack.\nIf they can set robust defensive positions … they can stay inside Russian territory for a long time,” he said."}, {"id": "374ee0f2-5f0a-4d39-bbdb-26d277092463", "title": "Call of Duty : Modern Warfare 3 Adds The Crow Crossover in Season 5 Reloaded", "date": "2024-08-20 00:00", "url": "https://comicbook.com/gaming/news/call-of-duty-mw3-the-crow-crossover-ps5-xbox-pc/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "With Call of Duty: Modern Warfare 3 and Warzone, players have seen everything from The Boys to Cheech and Chong make an appearance in the hit first-person shooter franchise.\nOn August 21st, the team is dropping Season 5 Reloaded, the mid-season patch that brings a ton of new content to Call of Duty: Modern Warfare 3, including a big, new crossover skin.\nThe Crow is the latest media property to get a crossover in Call of Duty.\nThe Ghost Punk Pro Pack features a punk rock version of the popular Call of Duty character, while the Playmaker Pack features an all-gold Operator to celebrate the Call of Duty League.\nCall of Duty: Modern Warfare 3 and Warzone are available now on PlayStation, Xbox, and PC platforms."}, {"id": "e695acdb-24fb-4a66-8667-92e0e8ca4d91", "title": "101st Airborne Division Conducts Medical Training Simulation during Historic Long - Range Air Assault Exercise - Clarksville Online", "date": "2024-08-20 00:30", "url": "https://www.clarksvilleonline.com/2024/08/19/101st-airborne-division-conducts-medical-training-simulation-during-historic-long-range-air-assault-exercise/", "domain": "clarksvilleonline.com", "domain_classification": "Unknown", "message": "Fort Johnson, LA – Soldiers from the 101st Airborne Division (Air Assault) executed a major training exercise on August 18th, 2024, showcasing their capabilities in a large-scale, long-range air assault (L2A2) operation at the Joint Regional Training Center (JRTC).\nIt marked a historic milestone for the division as it was the first rotation at JRTC for a Mobile Brigade Combat Team.\nThe training exercise was comprehensive, encompassing a medical training simulation where soldiers reacted to contact and treated casualties under realistic combat conditions.\nThe scenarios tested the division’s readiness to conduct large-scale, long-range air assault missions, a core capability for the 101st Airborne Division.\nKnown as the “Screaming Eagles,” the 101st Airborne Division has a storied history of executing airborne and air assault operations with precision and excellence."}, {"id": "ea0a2d64-8772-4f9a-ae49-c0f5b8ab652e", "title": "Catholic Teen from Brooklyn Identified 71 Years After MIA in Korean War", "date": "2024-08-20 03:00", "url": "https://thetablet.org/catholic-teen-from-brooklyn-identified-71-years-after-mia-in-korean-war/", "domain": "thetablet.org", "domain_classification": "Unknown", "message": "The image shows Raymond — a typical teen in post-World War II Brooklyn — wearing a white t-shirt under a dark cardigan.\nThe RCT moved north along the east side of the Chosin Reservoir, while the Marines set up along the west side.\nThe Battle of Chosin Reservoir had begun.\nUnbeknownst to MacArthur’s intelligence officers, the Chinese already controlled the rugged terrain overlooking the Chosin Reservoir when Raymond’s unit arrived.\nFive years later, he had the grim task of preventing a massacre of his men at the Chosin Reservoir, including an estimated 600 wounded."}, {"id": "a5139aff-e94a-49d1-a953-22b3a2f5421d", "title": "Lithuania starts construction of military base for German troops near Russian border", "date": "2024-08-20 02:00", "url": "https://www.yahoo.com/news/lithuania-starts-construction-military-german-003659249.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Lithuania on Aug. 19 began construction of a military base that will house up to 4,000 combat-ready German troops, with completion expected by the end of 2027.\nThis marks the first permanent foreign deployment for the German military since World War II.\nGermany made the commitment to station troops in Lithuania, a NATO and European Union member bordering Russia, in 2023.\nAdditionally, around 1,000 more German military personnel and civilian contractors will be stationed at other locations in Lithuania.\nTo support ongoing defense needs, including the construction of the base, Prime Minister Ingrida Simonyte's government has raised taxes for the coming years."}, {"id": "2882fb25-2172-40a8-a861-fbff1d10ecbf", "title": "Marvel vs . Capcom Fighting Collection : Arcade Classics Clash of Super Heroes trailer", "date": "2024-08-20 00:45", "url": "https://nintendoeverything.com/marvel-vs-capcom-fighting-collection-arcade-classics-clash-of-super-heroes-trailer/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "It’s time for another Marvel vs. Capcom Fighting Collection: Arcade Classics trailer, this time for Marvel vs. Capcom Clash of Super Heroes.\nLearn more about Marvel vs. Capcom Fighting Collection: Arcade Classics in the following overview:Dive into an action-packed lineup consisting of seven unique titles, including heavy hitters like X-Men Vs. Street Fighter, and Marvel vs. Capcom 2 New Age of Heroes.\nFor Capcom fans, fighting game enthusiasts, comic book and Super Hero aficionados, and everyone in between, Marvel vs. Capcom Fighting Collection: Arcade Classics offers a timeless celebration of a legacy fighting game series, delivering a diverse roster of iconic characters, enhanced features and competitive gameplay.\nSee the the Marvel vs. Capcom Fighting Collection: Arcade Classics trailer for Marvel vs. Capcom Clash of Super Heroes below.\nMarvel vs. Capcom Clash of Super Heroes TrailerMarvel vs. Capcom Fighting Collection: Arcade Classics launches on Switch in 2024."}, {"id": "945cc65a-3f6f-4750-8496-f3634672eded", "title": "Everything new in Delta Force : Hawk Ops Summer Carnival Update", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/everything-new-in-delta-force-hawk-ops-summer-carnival-update/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Delta Force: Hawk Ops‘ Summer Carnival update has finally dropped, and it brings a lot to the table.\nThanks to the Summer Carnival update, we can play a new mode in Havoc Warfare.\nNew EventsMandelBrick Showdown is the first event of the Summer Carnival update that started on August 16 and ends on August 22 at 23:59 (UTC+0).\nLimited-Time event: Weekend CarnivalFrom August 16 to August 19, Weekend Carnival had a higher MandelBricks drop rate.\nThe ones we’ve mentioned below will help you level up weapons faster and benefit the gameplay experience:250K Tekniq Alloys3x Premium Weapon EXP Coins200x Ahsarah Gold CoinsThat’s all for the Delta Force: Hawk Ops Summer Carnival update."}, {"id": "2e8ed779-3ce7-4f6a-8352-14fdfea5fb6c", "title": "US approves $3 . 5 billion sale of Apache helicopters to South Korea", "date": "2024-08-20 01:15", "url": "https://www.defensenews.com/pentagon/2024/08/19/us-approves-35-billion-sale-of-apache-helicopters-to-south-korea/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The U.S. State Department on Monday approved the sale of up to 36 AH-64E Apache helicopters, logistics and support to South Korea in a deal worth $3.5 billion.\nSouth Korea would also buy up to 76 GE T700 engines, two installed in each helicopter, plus four more spares.\nAlong with the helicopters, South Korea also wants to buy hundreds of missiles to arm them — including 456 Hellfire Missiles, 6 Captive Air Training Missiles and 152 Joint Air-to-Ground Missiles.\nThe primary vendors for the proposed sale to South Korea are Boeing and Lockheed Martin.\nSouth Korea previously purchased 36 AH-64E Apaches in 2013, an order that was completed in early 2017."}, {"id": "22ff5a51-4f6b-4914-b5a7-ee788ce5eb5a", "title": "Why WWE CM Punk Calling Himself A  Professional Wrestler  Pisses Drew McIntyre Off", "date": "2024-08-20 01:45", "url": "https://www.wrestlinginc.com/1646217/wwe-cm-punk-calling-professional-wrestler-pisses-drew-mcintyre-off/", "domain": "wrestlinginc.com", "domain_classification": "Unknown", "message": "Advertisement\"The thing that drives me most crazy is that he goes around masquerading, calling himself a professional wrestler.\nHe's no longer a professional wrestler.\nThere is nothing wrong with being an attraction, we need attractions, but don't f***ing say you're a professional wrestler if you're not a professional wrestler.\nI'm a professional wrestler.\"\nMcIntyre went off on Punk throughout the interview, saying Punk quit the company while McIntyre and the rest of the roster \"worked their a**** off 52 weeks a year.\""}, {"id": "c01cbc78-8fc5-45a7-851a-f1c0de2cb56a", "title": "Putin bluffing on retaliation threats , says Zelenskyy - as Ukraine takes more ground ... ", "date": "2024-08-20 01:00", "url": "https://www.heart.co.uk/news/uk-world/putin-bluffing-on-retaliation-threats-says-ze/", "domain": "heart.co.uk", "domain_classification": "Unknown", "message": "Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in KurskThe Kremlin's threats of retaliation are a bluff, Ukraine's president Volodymyr Zelenskyy has claimed, with his country's forces now said to be in control of 90 settlements in the Russian border region of Kursk.\nRussian troops have steadily advanced towards the city in recent weeks.\nRussian presidential aide Yuri Ushakov said Moscow was not ready to hold peace talks with Ukraine for now, given the attack on Kursk.\nMeanwhile, Ukraine has demanded a full withdrawal of Russian troops from its territory before it sits down for any talks.\n(c) Sky News 2024: Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in Kursk"}]