[{"id": "da772198-0048-4b08-92fd-7d9c39e42ba5", "title": "", "date": "2024-08-18 13:45", "url": "http://www.israelnationalnews.com/news/394777", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A Hezbollah official revealed new details about the assassination of the terrorist organization's most senior military commander and the head of its Strategic Unit, Fuad Shukr, last month, the Wall Street Journal reported.\nAccording to the source, on the day on which Shukr was eliminated, he received a phone call telling him to go up the five floors to his apartment in which he had stayed throughout the day.\nAs soon as Shukr entered his apartment, an Israeli airstrike blew up the apartment, killing him and other members of his family instantly.\nAccording to the report, the phone call to Shukr was made by someone who hacked Hezbollah's internal communication network.\nShukr was also responsible for the bombing of the US marine barracks in Beirut in 1983 in which 241 American servicemen were murdered."}, {"id": "c248bbed-0f7b-4ff5-ab29-faf972cca492", "title": "Israeli Strike In South Lebanon Kills 10 , Injures 5 , State News Agency Says", "date": "2024-08-18 10:00", "url": "https://menafn.com/1108572128/Israeli-Strike-In-South-Lebanon-Kills-10-Injures-5-State-News-Agency-Says", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The Israeli military said the airstrike targeted a weapons depot used by Hezbollah.\nThe Israeli strike came after ceasefire talks between Hamas and Israel in Doha paused on Friday with negotiators due to meet again next week.\nHezbollah later said in a statement that it had struck the Ayelet Hashahar Kibbutz in northern Israel in retaliation for the Nabatieh strike.\nTwo soldiers were wounded in a rocket attack from Lebanon, the Israeli military said, adding that a total of 55 rockets had been fired in latest strikes from Lebanon.\nAlso on Saturday, an Israeli drone targeted a motorcycle in the Qadmous area east of Tyre in south Lebanon, NNA reported, adding that one person was injured."}, {"id": "95d2cff2-72d1-4fb4-82a5-a4563acff1fc", "title": "WATCH : Israeli Drone Strike Eliminates Two Senior Hamas Operatives in Jenin", "date": "2024-08-18 04:45", "url": "https://www.theyeshivaworld.com/news/israel-news/2306317/watch-israeli-drone-strike-eliminates-two-senior-hamas-operatives-in-jenin.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "This evening, an Israeli drone strike in the West Bank city of Jenin killed two senior Hamas operatives, as confirmed by both the IDF and Shin Bet security agency.\nAbu Ara, identified as a key figure in multiple terror attacks and the production of explosive devices, and Dawasi, a senior member of Hamas’ local network in Jenin, were struck while traveling in a vehicle.\nHamas later confirmed the deaths, stating that Dawasi served as a commander in the group’s Jenin wing, while Abu Ara held a senior operational role.\nThe IDF and Shin Bet attribute several recent attacks to the two, including a deadly roadside bombing in Jenin on June 27, another bombing against Defense Ministry workers on July 23, and the recent terror shooting in the Jordan Valley.\nFootage of the strike has been released by the military."}, {"id": "e8f0b507-2bb1-4851-8507-c43aca561f60", "title": "Israeli strikes in Lebanon and Gaza leave 27 dead - World", "date": "2024-08-18 07:30", "url": "https://www.dawn.com/news/1853031/israeli-strikes-in-lebanon-and-gaza-leave-27-dead", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: At least 27 people, including two children, were killed in Israeli air strikes, with around 10 fatalities in Nabatieh, south Lebanon, and at least 17 in the Gaza town of Zawayda, according to health officials.\nThe Israeli military said the airstrike targeted a weapons depot used by Hezbollah fighters.\nThe Israeli strike came after ceasefire talks between Palestinian Islamist group Hamas and Israel in Doha paused on Friday with negotiators due to meet again next week.\nTwo soldiers were wounded in a rocket attack from Lebanon, the Israeli military said, adding that a total of 55 rockets had been fired in latest strikes from Lebanon.\nAlso on Saturday, an Israeli drone targeted a motorcycle in the Qadmous area east of Tyre in south Lebanon, NNA reported, adding that one person was injured."}, {"id": "7c1cb413-338a-495b-b5be-36606b854eba", "title": "How Israel killed Hezbollah commander Fuad Shukr via a phone call", "date": "2024-08-18 10:00", "url": "https://www.theweek.in/news/world/2024/08/18/how-israel-killed-hezbollah-commander-fuad-shukr-via-a-phone-call.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "On July 30, Top Hezbollah commander Fuad Shukr was on the second floor of a residential building in Beirut building when he got a phone call around 7 pm.\nThe unknown caller wanted him to go to the seventh floor of the building, according to a report.\nAn Israeli airstrike took Shukr along with his wife, two other women, and two children, said a Wall Street Journal report quoting a Hezbollah official.\nAfter his death, Iran and Hezbollah are probing the phone call which took him to the seventh floor, thereby making it easy for Israel to strike him.\nHours before his death, Shukr had spoken to Hezbollah leader Hassan Nasrallah, which Nasrallah himself said in his eulogy to Shukr."}, {"id": "128a46f7-2c1d-4370-b7d1-230dd2fe0c75", "title": "Israel : Israeli airstrike in Gaza kills 18 family members amid cease - fire talks", "date": "2024-08-18 06:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/israeli-airstrike-in-gaza-kills-18-family-members-amid-cease-fire-talks/articleshow/112600983.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "An Israeli airstrike in Gaza killed at least 18 people from the same family on Saturday.\nThey stated that attacks on militants in central Gaza were ongoing.In addition to the airstrike, another mass evacuation was ordered for parts of central Gaza.\nIsraeli military spokesperson Avichay Adraee, in a post on X, cited Palestinian rocket fire and advised Palestinians in and around the urban Maghazi refugee camp to evacuate.\n\"The suffering began from the day we left our homes,\" said Ahmad Omrani, one of those affected by the evacuation order.\nThe local health ministry confirmed that two bodies were taken to a government hospital."}, {"id": "8b9e0607-d950-4981-a3c1-3d8e3eb85c55", "title": "Ukraine updates : More advances in Kursk , says Kyiv – DW – 08 / 18 / 2024", "date": "2024-08-18 07:00", "url": "https://www.dw.com/en/ukraine-updates-more-advances-in-kursk-says-kyiv/live-69970805", "domain": "dw.com", "domain_classification": "International", "message": "08/18/2024 August 18, 2024 Troops deployed along entire Belarus-Ukraine border: LukashenkoBelarusian leader Alexander Lukashenko has said that his country has stationed troops along its entire border to Ukraine in response to what he claimed was Kyiv's deployment of 120,000 troops on its side.\nLukashenko, who is closely allied with Russian President Vladimir Putin, said on Sunday that the Belarusian-Ukrainian border was mined \"as never before\" and that Ukrainian troops would incur huge losses if they tried to cross it.\nBelarusian Defense Minister Viktor Khrenin on Friday said there was a high probability of an armed provocation from neighboring Ukraine.\nSince then, Belarus has aided Moscow in other ways as well, such as allowing Russian missile launchers to be stationed on its territory.\nBut so far, Belarusian troops appear not to have directly taken part in combat within Ukraine."}, {"id": "1f11514a-9829-48aa-8b77-6340c0864d88", "title": "Middle East updates : Blinken in Israel for Gaza deal talks – DW – 08 / 18 / 2024", "date": "2024-08-18 13:45", "url": "https://www.dw.com/en/middle-east-updates-blinken-in-israel-for-gaza-deal-talks/live-69972190", "domain": "dw.com", "domain_classification": "International", "message": "Skip next section 3 UN peacekeepers injured in blast near vehicle in southern Lebanon08/18/2024 August 18, 2024 3 UN peacekeepers injured in blast near vehicle in southern LebanonThree UN peacekeepers were injured after a blast near their vehicle in volatile southern Lebanon, the United Nations said.\n\"Earlier today, three peacekeepers on patrol were lightly injured when an explosion occurred near their clearly marked UN vehicle in the vicinity of Yarine, in south Lebanon,\" the United Nations Interim Force in Lebanon (UNIFIL) said in a statement.\n\"All peacekeepers in the patrol returned safely to their base.\nIsraeli forces and Hezbollah have been exchanging almost daily cross-border fire since Israel launched its offensive on Gaza.\nAn Israeli strike this weekend claimed 10 lives in southern Lebanon, in one of the deadliest incidents since October 7."}, {"id": "548e4a97-607a-44db-8d92-b82f203898e7", "title": "Israeli airstrike targeting Hamas vehicle in West Bank kills two terrorists", "date": "2024-08-18 06:45", "url": "https://www.indiatoday.in/world/story/israels-airstrike-west-bank-jenin-senior-hamas-ahmed-abu-ara-rafet-dawasi-gaza-attack-palestine-2583993-2024-08-18", "domain": "indiatoday.in", "domain_classification": "Unknown", "message": "Israel said it killed two senior Hamas terrorists in an airstrike on their car in Jenin in the occupied West Bank on Saturday, claiming they were involved in the killing of an Israeli.\nThe Israeli statement said the two terrorists were involved in planning a shooting attack last week in the West Bank's Jordan Valley where an Israeli man, Yonatan Deutsch, was killed.\nIsraeli authorities said then that Palestinian gunmen opened fire on a main road in the occupied West Bank on Aug. 11, killing one and wounding another.\nThe latest West Bank violence comes as a new round of talks in Doha aimed at ending 10 months of fighting in Gaza are due to resume next week.\nThe Gaza war and escalating West Bank violence threaten to spill into a wider regional conflict involving Iran and its proxies in the region, including Hezbollah in Lebanon and the Houthis in Yemen."}, {"id": "11572642-6a05-400f-b004-f9e9b1e92cfd", "title": "Israeli strike kills 7 members of same family with Blinken set to push for ceasefire and hostage deal", "date": "2024-08-18 12:15", "url": "https://www.yahoo.com/news/israeli-strike-kills-7-members-112025622.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli strike kills 7 members of same family with Blinken set to push for ceasefire and hostage dealSeven members of the same family were killed in an Israeli airstrike in central Gaza on Sunday, medical officials said, as Secretary of State Antony Blinken travels to Israel to push for a ceasefire and hostage deal.\nIn a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal.\nWe’re going to raise all of these issues directly,” they told the press traveling with Blinken."}, {"id": "17d8ae51-4292-4a34-b2db-fb5c6160dde6", "title": "Israeli strike kills 7 members of same family as Blinken travels to push for ceasefire deal", "date": "2024-08-18 12:15", "url": "https://edition.cnn.com/2024/08/18/europe/israel-strike-central-gaza-blinken-ceasefire-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Seven members of the same family were killed in an Israeli airstrike in central Gaza on Sunday, medical officials said, as Secretary of State Antony Blinken travels to Israel to push for a ceasefire and hostage deal.\nIn a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal.\nUS officials including President Joe Biden have expressed fresh optimism of finalizing a ceasefire agreement."}, {"id": "383fd9b8-e69d-45e2-96b7-76be94ef496e", "title": "Israeli strike kills 7 members of same family as Blinken travels to push for ceasefire deal", "date": "2024-08-18 13:15", "url": "https://www.cnn.com/2024/08/18/europe/israel-strike-central-gaza-blinken-ceasefire-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Seven members of the same family were killed in an Israeli airstrike in central Gaza on Sunday, medical officials said, as Secretary of State Antony Blinken travels to Israel to push for a ceasefire and hostage deal.\nIn a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal.\nUS officials including President Joe Biden have expressed fresh optimism of finalizing a ceasefire agreement."}, {"id": "9a6940ec-fb13-466c-b086-08f4b6ba2eba", "title": "Israeli strike kills 7 members of same family as Blinken travels to push for ceasefire deal", "date": "2024-08-18 14:00", "url": "https://us.cnn.com/2024/08/18/europe/israel-strike-central-gaza-blinken-ceasefire-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Seven members of the same family were killed in an Israeli airstrike in central Gaza on Sunday, medical officials said, as Secretary of State Antony Blinken travels to Israel to push for a ceasefire and hostage deal.\nIn a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal.\nUS officials including President Joe Biden have expressed fresh optimism of finalizing a ceasefire agreement."}, {"id": "9e9948e6-ead0-49dd-9d85-b884ff31c30a", "title": "", "date": "2024-08-18 07:15", "url": "https://www.israelnationalnews.com/news/394775", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The two terrorists eliminated in an airstrike in Jenin last night have both been identified as senior terrorists and partners in the shooting attack that killed Yehonatan Deutsch.\nMoreover, he served as a senior figure involved in the production of explosives for terror purposes.\nRafat Dowasi from Silat al-Harithiya is a senior figure in Hamas's military infrastructure in the Jenin area.\nIn the last week, the IDF and ISA have been working on intelligence in the Jenin area, following the shooting attack in the Jordan Valley in which Deutsch was murdered.\nAccording to assessments, the cell came from Jenin and managed to escape after the attack towards the northern Samaria area."}, {"id": "675604f4-a93d-4281-9578-189ecf996f80", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal - Boston News , Weather , Sports", "date": "2024-08-18 13:30", "url": "https://whdh.com/news/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "The U.S. and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism.\nBut Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled.\nHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "4684b3c1-eb37-4214-9635-5a2e0b796a2a", "title": "The 9 at 9 : Sunday", "date": "2024-08-18 09:45", "url": "https://www.thejournal.ie/9-at-9-sunday-186-6466016-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "The freeze, which was put in place as a cost-saving measure, was in effect from October 2023 to July 2024.\nTwo other men, aged in their 30s and 70s, were arrested and are currently being detained at a garda station.\nUkrainian forces said they thwarted a Russian missile attack on the capital Kyiv where air raid sirens sounded before dawn today.\nSimultaneous to the missile attack, drones were spotted heading to Kyiv.\nOpposition leader Maria Corina Machado, leader of the Vente Venezuela (Come Venezuela) party, led a ‘Protest for Truth’ in the capital yesterday."}, {"id": "5764f888-52e3-4beb-a61f-c75c085a543e", "title": "Israeli airstrike in West Bank kills two senior Hamas fighters", "date": "2024-08-18 08:15", "url": "https://myrepublica.nagariknetwork.com/news/israeli-airstrike-in-west-bank-kills-two-senior-hamas-fighters/", "domain": "myrepublica.nagariknetwork.com", "domain_classification": "Unknown", "message": "RAMALLAH, WEST BANK, Aug 17: Israel conducted an airstrike on Saturday in Jenin, located in the occupied West Bank, killing two senior Hamas fighters.\nHamas' Al-Qassam Brigades confirmed the deaths, mourning the loss of the two fighters targeted in the airstrike.\nThe Israeli military stated that the fighters were responsible for the attack on 11 August, where Palestinian gunmen opened fire on a main road in the occupied West Bank, killing Deutsch and wounding another individual.\nHamas indicated that this operation was in retaliation for an Israeli airstrike on a school in Gaza City, which had killed at least 90 displaced Palestinians.\nThe violence in the West Bank has escalated following the outbreak of war in Gaza between Israel and Hamas in October."}, {"id": "feea305a-2e81-444a-be82-a3f5bd313c33", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 13:15", "url": "https://dunyanews.tv/en/World/831591-israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-ce", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israel strikes Gaza as Blinken heads to region to try to help close cease-fire dealWorld World Israel strikes Gaza as Blinken heads to region to try to help close cease-fire dealIsrael strikes Gaza as Blinken heads to region to try to help close cease-fire dealFollow on Published On: Sun, 18 Aug 2024 17:16:58 PKTDEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 19 people overnight, including a woman and her six children, as U.S. Secretary of State Antony Blinken headed to the region on Sunday to try to seal a cease-fire deal after months of contentious negotiations.\nBut Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled.\nIn exchange, Israel would withdraw its forces from Gaza and release Palestinian prisoners.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "ea9c334a-bfe7-4d59-b25d-8a78777df05b", "title": "Israeli strike kills 7 members of same family with Blinken set to push for ceasefire and hostage deal", "date": "2024-08-18 13:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/08/18/israeli-strike-kills-7-members-of-same-family-with-blinken-set-to-push-for-ceasefire-and-hostage-deal/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "In a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nMediators have been stepping up efforts amid fears of Iranian retaliation for the assassination of a Hamas leader in Tehran.\nHe will meet Israeli Prime Minister Benjamin Netanyahu and other senior figures on Monday.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal."}, {"id": "62a2450e-0ec9-43fb-81c3-acccbf63bb5d", "title": "Kyiv repels Russian aerial attack , North Korean ballistic weapons used in strike , city authorities say", "date": "2024-08-18 07:30", "url": "https://www.yahoo.com/news/kyiv-repels-russian-aerial-attack-065849643.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kyiv repelled a Russian missile and drone attack in the early hours of Aug. 18, with city authorities saying North Korean ballistic weapons were used in the strike.\nPopko added that according to preliminary information, Russian forces \"most likely used KN-23, North Korean-made ballistic missiles.\"\nInformation released later by Ukraine's Air Force said one Russian and two ballistic missiles were used in the attack, as well as five cruise missiles and eight kamikaze drones.\nIt added that the two North Korean ballistic missiles, three cruise missiles and all eight kamikaze drones were intercepted by Ukraine's air defenses.\nRead also: How Russia broke through Ukraine’s air defense to strike Kyiv children’s hospitalWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "8c0f5874-f873-4f7d-8ea1-e7714fdaf211", "title": "Two Dead in Israeli Drone Strike on West Bank", "date": "2024-08-18 14:30", "url": "https://dailystar.com.lb/two-dead-israeli-drone-strike-west-bank/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Palestinian officials reported that two individuals were killed in an Israeli airstrike in the occupied West Bank on Saturday, with the Israeli military stating that the strike targeted a “terrorist cell” in the Jenin area.\n“There are dead people in the car,” one man shouted as a stretcher was brought forward.\nSince the unprecedented Hamas attack on Israel on October 7, violence in the West Bank, a Palestinian territory occupied by Israel since 1967 and geographically separated from Gaza, has intensified.\nSince October 7, at least 635 Palestinians have been killed in the West Bank by Israeli troops or settlers, according to an AFP tally based on official Palestinian figures.\nDuring the same period, at least 18 Israelis, including soldiers, have been killed in Palestinian attacks, according to Israeli official statistics."}, {"id": "99c3fd21-6c4f-4909-ae2e-0af94b163c8f", "title": "An Israeli airstrike kills 18 members of a family in Gaza as mediators hope for a cease - fire - WSVN 7News | Miami News , Weather , Sports", "date": "2024-08-18 05:00", "url": "https://wsvn.com/news/us-world/an-israeli-airstrike-kills-18-members-of-a-family-in-gaza-as-mediators-hope-for-a-cease-fire/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas after 10 months of war.\nAmong those killed was Sami Jawad al-Ejlah, a wholesaler who coordinated with the Israeli military to bring meat and fish to Gaza.\nThe Israeli military, which rarely comments on individual strikes, said it struck “terrorist infrastructure” in central Gaza where rockets had been fired toward Israel in recent weeks.\nAround 110 are believed to be in Gaza, though Israeli authorities believe around a third are dead.\nAn Israeli strike Saturday killed at least 10 Syrians, including a woman and her two children, Lebanon’s Health Ministry said."}, {"id": "a89179d7-42ef-4c6c-93ef-f5e328b233b3", "title": "Israel - Palestine war : Airstrike kills 18 people from one family in central Gaza", "date": "2024-08-18 01:45", "url": "https://www.smh.com.au/world/middle-east/israeli-airstrike-kills-18-people-from-one-family-in-gaza-20240818-p5k3a4.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "An Israel airstrike in Gaza killed at least 18 people – all from the same family – and another strike killed 10 people in Lebanon on Saturday, hours after mediators expressed optimism for an imminent ceasefire deal between Israel and Hamas after 10 months of war.\nAt least 18 Palestinians – all from the same family – were killed by fresh Israeli airstrikes in Gaza, according to authorities.\nCredit: APThe mediation efforts aim to secure the release of scores of Israeli hostages and stop the fighting that has devastated Gaza, where the death toll has surpassed 40,000 and a possible polio outbreak is feared.\nTalks are also meant to calm regional tensions that have threatened to explode into a wider war if Iran and Hezbollah militants in Lebanon attack Israel in retaliation for recent killings of militant leaders.\nSaturday’s airstrike in central Gaza hit a house and an adjacent warehouse sheltering displaced people at the entrance to the town of Zawaida, according to the al-Aqsa Martyrs Hospital in Deir al-Balah, where casualties were taken."}, {"id": "eb794beb-61f6-43f3-bd3c-4692a69c4c52", "title": "Israel - Palestine war : Airstrike kills 18 people from one family in central Gaza", "date": "2024-08-18 02:00", "url": "https://www.theage.com.au/world/middle-east/israeli-airstrike-kills-18-people-from-one-family-in-gaza-20240818-p5k3a4.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "An Israel airstrike in Gaza killed at least 18 people – all from the same family – and another strike killed 10 people in Lebanon on Saturday, hours after mediators expressed optimism for an imminent ceasefire deal between Israel and Hamas after 10 months of war.\nAt least 18 Palestinians – all from the same family – were killed by fresh Israeli airstrikes in Gaza, according to authorities.\nCredit: APThe mediation efforts aim to secure the release of scores of Israeli hostages and stop the fighting that has devastated Gaza, where the death toll has surpassed 40,000 and a possible polio outbreak is feared.\nTalks are also meant to calm regional tensions that have threatened to explode into a wider war if Iran and Hezbollah militants in Lebanon attack Israel in retaliation for recent killings of militant leaders.\nSaturday’s airstrike in central Gaza hit a house and an adjacent warehouse sheltering displaced people at the entrance to the town of Zawaida, according to the al-Aqsa Martyrs Hospital in Deir al-Balah, where casualties were taken."}, {"id": "ac95b6ee-545c-45ad-b0c6-2c347e3926d8", "title": "Israel - Palestine war : Airstrike kills 18 people from one family in central Gaza", "date": "2024-08-18 03:00", "url": "https://www.watoday.com.au/world/middle-east/israeli-airstrike-kills-18-people-from-one-family-in-gaza-20240818-p5k3a4.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "An Israel airstrike in Gaza killed at least 18 people – all from the same family – and another strike killed 10 people in Lebanon on Saturday, hours after mediators expressed optimism for an imminent ceasefire deal between Israel and Hamas after 10 months of war.\nAt least 18 Palestinians – all from the same family – were killed by fresh Israeli airstrikes in Gaza, according to authorities.\nCredit: APThe mediation efforts aim to secure the release of scores of Israeli hostages and stop the fighting that has devastated Gaza, where the death toll has surpassed 40,000 and a possible polio outbreak is feared.\nTalks are also meant to calm regional tensions that have threatened to explode into a wider war if Iran and Hezbollah militants in Lebanon attack Israel in retaliation for recent killings of militant leaders.\nSaturday’s airstrike in central Gaza hit a house and an adjacent warehouse sheltering displaced people at the entrance to the town of Zawaida, according to the al-Aqsa Martyrs Hospital in Deir al-Balah, where casualties were taken."}, {"id": "efd9d422-5558-463c-9397-6a0b439c752f", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 09:45", "url": "https://www.thehindu.com/news/international/russia-launches-third-ballistic-missile-attack-on-kyiv-this-month-ukraine-says/article68539253.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "\"According to preliminary information, the Russians again, for the third time in a row, most likely used North Korean ballistic missiles.\"\nMr. Popko added that Ukraine's air defence units also destroyed a number of drones launched by Russia.\nMr. Popko said there were no immediate reports of casualties or damage.\nReuters could not independently verify the type of missiles launched.\n“About two hours after the initial attack, Kyiv, its surrounding region and most of central and northeast Ukraine were under fresh raid alerts, with threats of more missiles heading towards the city,” Ukraine’s Air Force said."}, {"id": "c6ea3127-b389-46d5-ad2d-3ad64c52b749", "title": "How Israel Lured A  Ghost  To His Death On The 7th Floor – The Yeshiva World", "date": "2024-08-18 14:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2306364/how-israel-lured-a-ghost-to-his-death-on-the-7th-floor.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "On July 30, 2024, Israel killed Hezbollah commander Fuad Shukr in an airstrike on the seventh floor of a Beirut apartment building, not far from the site of the bombing he planned that killed 241 US Marines in 1983.\nAccording to a Wall Street Journal report, Shukr was a “ghost” – living an almost invisible life and rarely appearing in public.\nHe was so secretive that Lebanese media outlets reporting on his death initially published photos of the wrong person.\nShukr’s last day was spent at his office on the second floor of a residential apartment building in the neighborhood of Dahiyeh in southern Beirut.\nPer his secretive life, his residence was on the seventh floor of the same building, eliminating the need for him to leave his building to go to his office."}, {"id": "00e95a7f-62a5-4a18-83d5-acb78dd57c8d", "title": "Ukraine says it repelled Russian missile attack on capital", "date": "2024-08-18 06:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380757.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Ukrainian forces said they thwarted a Russian missile attack on the capital Kyiv where air raid sirens sounded before dawn on Sunday.\n\"This is the third ballistic missile attack on the capital in August with a clear interval of six days between each attack,\" the Kyiv City Military Administration posted on Telegram after the early morning barrage.\nSimultaneous to the missile attack, drones were spotted heading to Kyiv.\nLast weekend, a 35-year-old man and his four-year-old son were killed in an overnight Russian missile attack near Kyiv.\nUkraine claims to have seized more than 1,100 square kilometres of Russian territory in the biggest attack by a foreign army on Russian soil since World War II."}, {"id": "50fb4a3d-d875-4d10-833e-352e777e225d", "title": "At least 18 killed in Israeli airstrike on Gaza as more evacuations ordered", "date": "2024-08-18 02:45", "url": "https://www.cbsnews.com/news/israeli-airstrike-gaza-several-family-members-killed-more-evacuations-ordered/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for a possible cease-fire deal between Israel and Hamas following 10 months of war.\nAmong those killed was Sami Jawad al-Ejlah, a wholesaler who coordinated with the Israeli military to bring meat and fish to Gaza.\nMeanwhile, an Israeli strike Saturday in southern Lebanon killed at least 10 Syrians, including a woman and her two children, Lebanon's Health Ministry said.\nIsraeli military spokesperson Avichay Adraee in a post on X cited Palestinian rocket fire and said Palestinians in areas in and around the urban Maghazi refugee camp should leave.\nThe health ministry there said two bodies were taken to a government hospital."}, {"id": "21583f9c-e498-44b9-81a0-f799a94650de", "title": "Israeli strikes in Gaza and Lebanon kill at least 25 , officials say", "date": "2024-08-18 00:00", "url": "https://www.nzherald.co.nz/world/israeli-strikes-in-gaza-and-lebanon-kill-at-least-25-officials-say/JALUB4DTTRDYPGK5T5DU4ZKTNA/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "In southern Lebanon, a strike on what local officials said was a metal warehouse killed 10 people, including a Syrian woman and her two children, the health ministry said.\nThe death toll appeared to be the highest in a single attack in Lebanon since Hezbollah and Israel began trading fire after the October 7 Hamas-led attacks on southern Israel.\nThe deaths brought the toll on civilians in Lebanon to 125 since October, according to a Washington Post tally.\nIn Israel, 24 civilians have been killed in attacks by Hezbollah, Israeli officials said.\nA Hezbollah statement said it was the first time the area had been targeted."}, {"id": "d61e33d1-5996-4351-bded-a9171641ed46", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 10:30", "url": "https://www.ajc.com/news/nation-world/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/5MP6YNPH3NEV7AAPPHCGY6DMYE/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "809ab9fc-6536-444e-bcd3-383e0556aa27", "title": "  Modern WWIII is quite likely  warns counter - terror expert as Iran revenge  inevitable  - World News", "date": "2024-08-18 14:00", "url": "https://www.mirror.co.uk/news/world-news/modern-wwiii-quite-likely-warns-33487582", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "He believes a major revenge strike by Iran and its Hezbollah and Houthi proxies is “inevitable” and Israel’s response could be devastating.\nIt's been very quiet over the last couple of weeks, since Iran effectively announced that they’re going to carry out an attack.\nImage: Phil Harris) Phil Harris)“And I think an attack by Iran and maybe some of their proxies, like Hezbollah and the Houthis is almost an inevitability.\nIran has no choice, in its mind, to attack Israel in retaliation for the killing of Haniyeh.\nSo I think that in a modern context, we’re not going to see the same kind of war as World War Two, but a modern World War Three."}, {"id": "ee4b611c-1133-4c21-afab-adae4e24d3b3", "title": "Israeli Air Force Completes In - Flight Refueling Exercise In Apparent  Show of Force  to Iran", "date": "2024-08-18 12:45", "url": "https://theaviationist.com/2024/08/18/israeli-air-force-in-flight-refueling-show-of-force-to-iran/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "On Aug. 15, 2024, the Israeli Air Force carried out an air refueling exercise involving their 707 “Re’em” tankers and F-35I “Adir” and F-15C/D “Baz” fighters.\nAerial refueling is an operational capability required by the combat force, enabling it to remain airborne for long periods of time,” mentioned the social media posts made by the Israeli Air Force.\nIn apparent preparations for a potential strike in Iran, the Israeli Air Force yesterday conducted a long-range refueling exercise.\nUnlike standard external fuel tanks, the FAST packs can’t be jettisoned inflight, however they do not affect excessively the performance of the F-15.\nNotably, the Israeli Air Force has previously claimed their F-35s can reach Iran without refueling."}, {"id": "660233b3-4815-4423-80e2-b8e050279558", "title": "Russian missile sparks blaze in Ukraine as Kyiv troops push into Russia Kursk region", "date": "2024-08-18 10:00", "url": "https://www.nbcnews.com/news/world/russian-missile-sparks-blaze-ukraine-troops-russia-kursk-rcna167051", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Russia kept up its assault on Ukraine Saturday even as Ukrainian forces pushed into Russia’s Kursk border region.\nEvgeniy Maloletka / APOn Thursday, Ukrainian forces said they had seized the town of Sudzha, 6 miles from the border.\nRussian military bloggers said that the destruction of bridges would impede deliveries of supplies to Russian forces, but not cut them off completely.\n“No one expected that this kind of conflict was even possible in the Kursk region.\nUkrainian forces have also captured a number of Russian troops as they have moved across the region."}, {"id": "0c435ab6-6eb1-45e2-8ee5-3f77b1790ff9", "title": "Russia launches third missile attack on Kyiv in month", "date": "2024-08-18 05:15", "url": "https://tribune.com.pk/story/2488961/russia-launches-third-missile-attack-on-kyiv-in-month", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Ukrainian service personnel use a searchlight as they search for drones in the sky over the city during a Russian drone strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine August 16, 2024.\nPHOTO:REUTERSRussia launched on Sunday its third ballistic missile on Kyiv in August, with preliminary data showing that all the air weapons were destroyed on their approach to the city, the military administration of the Ukrainian capital said.\n\"This is already the third ballistic strike on the capital in August, with exact intervals of six days between each attack,\" Serhiy Popko, the head of the Kyiv military administration, said on the Telegram messaging app.\nPopko added that Ukraine's air defence units also destroyed a number of drones launched by Russia.\nAbout two hours after the initial attack, Kyiv, its surrounding region and most of central and northeast Ukraine were under fresh raid alerts, with threats of more missiles heading towards the city, Ukraine's air force said."}, {"id": "0fd8700a-f044-4a69-9c9d-6f6ed3d32a20", "title": "Ukraine : Russia launches third ballistic missile attack on Kyiv this month", "date": "2024-08-18 11:30", "url": "https://article.wn.com/view/2024/08/18/Ukraine_Russia_launches_third_ballistic_missile_attack_on_Ky/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Russia carried out on Sunday its third ballistic missile attack on Kyiv this month but preliminary data indicated most of the projectiles were shot down on approach, the military administration of the Ukrainian capital said.\n\"This is already the third ballistic strike on the capital in August, with exact intervals of... read full story\"This is already the third ballistic strike on the capital in August, with exact intervals of six days between each attack,\""}, {"id": "62ec3d54-9038-4718-9634-ddb94569cc53", "title": "Israeli strike kills at least 17 Palestinians in central Gaza , health officials say", "date": "2024-08-18 04:45", "url": "https://www.asiaone.com/world/israeli-strike-kills-least-17-palestinians-central-gaza-health-officials-say", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "CAIRO/GAZA — At least 17 Palestinians were killed and dozens wounded in an Israeli strike in the central Gaza town of Zawayda on Saturday (Aug 17), health officials said, as Israel issued new evacuation orders, citing Hamas rocket fire nearby.\nMost of the people killed in Zawayda were from the same family and they included eight children and four women, according to health officials in the Hamas-administered enclave.\nThe Israeli military said in response it had struck militant targets in an area from which rockets were fired at its troops.\nThe Israeli military said that since Friday its forces had killed dozens of militants, including some who had fired rockets from central and southern Gaza.\nIsrael's subsequent military campaign has killed more than 40,000 Palestinians, most of them civilians, according to Gaza health authorities."}, {"id": "9a3003ca-0dbd-4b99-95bc-7251e862217d", "title": "Kyiv Comes Under Ballistic Missile Attack Sunday Morning", "date": "2024-08-18 06:45", "url": "https://menafn.com/1108571741/Kyiv-Comes-Under-Ballistic-Missile-Attack-Sunday-Morning", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) For the third time in August, the Russians attacked Kyiv using ballistic missiles.\nThat's according to the Kyiv Regional Military Administration , Ukrinform reports.\n\"This morning, around 05:00, the enemy launched a ballistic missile attack on Kyiv.\nBesides the ballistic missiles, Russia also launched one-way attack UAVs also targeting Kyiv.\nAs Ukrinform reported earlier, a ballistic missile alert went off in Kyiv and a number of Ukrainian regions this morning."}, {"id": "27c1b278-27d8-4091-951e-5fdef7518aa3", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says By Reuters", "date": "2024-08-18 06:45", "url": "https://www.investing.com/news/world-news/russia-launches-third-ballistic-missile-attack-on-kyiv-this-month-ukraine-says-3576540", "domain": "investing.com", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Russia on Sunday carried out its third ballistic missile attack on Kyiv this month but preliminary data indicated most of the projectiles were shot down on approach, the military administration of the Ukrainian capital said.\nPopko said the Russians had most likely used North Korean-made ballistic missiles.\nHe said Russia launched eight missiles on Sunday morning, including three ballistic, three cruise and two guided aircraft missiles.\nHowever, Kyiv region governor Ruslan Kravchenko said two private houses were destroyed and 16 others were damaged by falling debris.\nRussia launched a full-scale invasion of Ukraine two-and-a-half years ago and now holds about 18 percent of its territory in the east and south."}, {"id": "1a1c1487-273a-44bd-8a07-5e58b8f89ee4", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 11:45", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire/article_3d49c856-b7dd-5871-be99-81ef34672f03.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "8c5c45f8-72ca-48e7-aad4-5a2b262a845b", "title": "Russians target Kyiv again this morning , launching cruise missiles in second attack", "date": "2024-08-18 06:45", "url": "https://www.yahoo.com/news/russians-target-kyiv-again-morning-045823018.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russians target Kyiv again this morning, launching cruise missiles in second attackRussian forces have launched yet another attack on Kyiv with cruise missiles at around 07:00, just two hours after attempting to deliver a ballistic missile strike.\nUkrainian air defence units have destroyed all the targets.\nSource: Serhii Popko, Head of Kyiv City Military AdministrationDetails: Early reports indicate that the Russians used Iskander-K-type missiles, which undertook long, complex manoeuvres across several Ukrainian oblasts before attempting to strike targets on the southern front.\nUkrainian air defence assets and personnel have shot down all the targets.\nQuote from Popko: \"We are grateful to the air defence personnel for their reliable protection."}, {"id": "861181c7-edc4-474e-a370-7077bd151c4a", "title": "Two Palestinians Killed In Israeli Attack In West Bank : Sources", "date": "2024-08-18 05:45", "url": "https://menafn.com/1108571753/Two-Palestinians-Killed-In-Israeli-Attack-In-West-Bank-Sources", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Ramallah Aug 18 (IANS) At least two Palestinians were killed and another in an Israeli drone strike on a vehicle in Jenin, northern West Bank, as per Palestinian and Israeli sources.\nThe statement identified one of the deceased as Raafat Dawasi, 28, while the identity of the second body remains unknown.\nWissam Bakar, Director of Jenin government hospital, told Xinhua that medical teams had difficulty identifying the bodies because they were delivered as charred remains.\nBakar added that one person sustained moderate injuries from shrapnel, and was transported to the hospital for treatment.\nSince October 7, 2023, the West Bank has witnessed escalating tension and armed confrontations in various cities, villages, and camps, leading to the deaths of more than 630 Palestinians, according to Palestine's health ministry."}, {"id": "87ec09fb-e6ab-40e7-951b-caa84771d796", "title": "British supplied robot dogs are being deployed with the Ukrainian forces to carry out spy missions and deliver medicine", "date": "2024-08-18 14:30", "url": "https://www.dailymail.co.uk/news/article-13754865/British-robot-dogs-deployed-Ukrainian-forces.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukrainian forces are deploying British-supplied robot dogs to carry out spy missions and deliver medicine to soldiers on the battlefield, it has emerged.\nThe BAD2 machines can travel at speeds of 9mph and can be mounted with over 7kg of ammunition, medical supplies and other front line essentials, reports say.\nThe unit is also altering their BAD2 machines to 'act as a kamikaze drone against vehicles or enemy soldiers'.\nThe robot dogs are manufactured by Brit Alliance, a UK security and risk management company providing military equipment to Ukrainian forces.\nIf confirmed, the Ukrainian strikes would further complicate Moscow's attempts to replenish its forces in Kursk and evacuate civilians."}, {"id": "cb200cfd-88d9-4aec-ad38-15bd3f346447", "title": "Missile attack on Kiev thwarted : Military", "date": "2024-08-18 13:30", "url": "http://www.uniindia.com/missile-attack-on-kiev-thwarted-military/world/news/3264870.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Missile attack on Kiev thwarted: MilitaryKiev, Aug 18 (UNI) Russia fired ballistic and cruise missiles at the Ukrainian capital early on Sunday but no casualty or damage was caused due to timely interception of the missiles, the Kiev City Military Administration said in a statement.\nAt about 5 am local time (0200 GMT), ballistic missiles were launched at Kiev, but they were intercepted on the city's outskirts, the statement said.\n\"This is already the third ballistic strike on the capital in August, with an exact interval of six days between each attack,\" it said.\nTwo hours later, the Russian forces fired cruise missiles against Kiev from the southern direction, but the missiles were destroyed by the air defence, the city military administration said.\nUNI XINHUA AT RC"}, {"id": "9dff033d-10ca-42cf-b4a4-8ccd06866135", "title": "Israeli strike kills 7 members of same family with Blinken set to push for ceasefire and hostage deal", "date": "2024-08-18 13:00", "url": "https://keyt.com/news/national-world/cnn-world/2024/08/18/israeli-strike-kills-7-members-of-same-family-with-blinken-set-to-push-for-ceasefire-and-hostage-deal/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "In a statement Sunday, the Israeli military said forces continue to operate in Khan Yunis and Dir al-Balah.\nPeace efforts accelerateSecretary of State Antony Blinken is set to arrive in Israel later on Sunday amid urgent efforts to finalize an elusive Gaza ceasefire and hostage deal.\nMediators have been stepping up efforts amid fears of Iranian retaliation for the assassination of a Hamas leader in Tehran.\nHe will meet Israeli Prime Minister Benjamin Netanyahu and other senior figures on Monday.\nThe senior administration official would not say how the US intends to pressure the Israeli government to take the deal."}, {"id": "c78ceb93-f8c3-40f5-8d36-971ed85ce8c4", "title": "Terror shook Finland five summers ago but one man bravery is what we should remember | World News", "date": "2024-08-18 05:30", "url": "https://metro.co.uk/2024/08/18/terror-shook-finland-five-summers-ago-one-mans-bravery-remember-21432330/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "She had come from Syria to Finland as a refugee and knew Bouanane from studying on the same Finnish language course.\nViolence in Finland Compared with international crime rates, Finland is regarded as a safe country, especially when it comes to random acts of violence.\nBut the militant group has never claimed responsibility for the Turku attack.\nOn the day of the attack Bouanane visited a mosque and recorded a video in which he spoke of the US-led air strikes against the Islamic State in Syria.\nHe had scribbled in his notes that he wanted to establish an Islamic state in Finland, Ilta-Sanomat reported."}, {"id": "8fd9a811-325f-4aff-958f-1d2c8ba68eb5", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 06:45", "url": "https://www.asiaone.com/world/russia-launches-third-ballistic-missile-attack-kyiv-month-ukraine-says", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "KYIV — Russia launched on Sunday (Aug 18) its third ballistic missile on Kyiv in August, with preliminary data showing that all the air weapons were destroyed on their approach to the city, the military administration of the Ukrainian capital said.\n\"According to preliminary information, the Russians again, for the third time in a row, most likely used North Korean ballistic missiles.\"\nPopko added that Ukraine's air defence units also destroyed a number of drones launched by Russia.\nReuters could not independently verify the type of missiles launched.\nAbout two hours after the initial attack, Kyiv, its surrounding region and most of central and northeast Ukraine were under fresh raid alerts, with threats of more missiles heading towards the city, Ukraine's air force said."}, {"id": "ea431145-3774-4a1a-9b42-0cde9f14a60c", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says - World", "date": "2024-08-18 09:30", "url": "https://www.brecorder.com/news/40318047/russia-launches-third-ballistic-missile-attack-on-kyiv-this-month-ukraine-says", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "KYIV: Russia launched on Sunday its third ballistic missile on Kyiv in August, with preliminary data showing that all the air weapons were destroyed on their approach to the city, the military administration of the Ukrainian capital said.\n“This is already the third ballistic strike on the capital in August, with exact intervals of six days between each attack,” Serhiy Popko, the head of the Kyiv military administration, said on the Telegram messaging app.\n“According to preliminary information, the Russians again, for the third time in a row, most likely used North Korean ballistic missiles.”Popko added that Ukraine’s air defence units also destroyed several drones launched by Russia.\nUkraine drone debris sparks diesel fire in Russia’s Rostov, regional governor saysReuters could not independently verify the type of missiles launched.\nAbout two hours after the initial attack, Kyiv, its surrounding region and most of central and northeast Ukraine were under fresh raid alerts, with threats of more missiles heading towards the city, Ukraine’s air force said."}, {"id": "c3df40a9-7511-4116-9942-e4bfb318d443", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 13:00", "url": "https://www.recorderonline.com/news/national_news/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire/article_cea6d14c-9ee1-5f47-974e-972e3cd39590.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "cee0154c-e3d4-48ff-89f6-58a02b22f71e", "title": "Israel Strikes Gaza As Blinken Heads To Region To Try To Help Close Cease - Fire Deal – 710am KURV", "date": "2024-08-18 14:00", "url": "https://www.kurv.com/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "kurv.com", "domain_classification": "Unknown", "message": "But Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled.\nIn exchange, Israel would withdraw its forces from Gaza and release Palestinian prisoners.\nHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "85c2781a-e614-4cc1-8baf-0f6a73db4338", "title": "Hamas Osama Hamdan storms out of CNN interview amid Oct . 7 questions", "date": "2024-08-18 11:30", "url": "https://www.jpost.com/israel-hamas-war/article-815165", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "I pressed senior Hamas official Osama Hamdan on whether Hamas accepts any responsibility for the loss of civilian life in Gaza, which residents have told CNN they believe it does.\nAccording to Al Jazeera, Hamdan attended university in Jordan before eventually joining Hamas in Iran in 1993.\nBecause, as you know, Hamas tunnels, Hamas military units are based under and around homes, mosques, and schools in Gaza.\nMy question is, does Hamas accept any responsibility for the deaths of its own people in Gaza?”“Do not accuse me.\nWhat about this?”Despite Hamdan’s claim that “there is no Hamas” in the West Bank, the terror group does have a considerable presence there."}, {"id": "fbac1578-9406-4c21-bb03-61d84956cefc", "title": "Eighteen members of same family killed in Israeli strike on Gaza", "date": "2024-08-18 10:00", "url": "https://www.theguardian.com/world/article/2024/aug/18/family-killed-israeli-strike-gaza", "domain": "theguardian.com", "domain_classification": "International", "message": "Among those killed was Sami Jawad al-Ejlah, a wholesaler who coordinated with the Israeli military to bring meat and fish to Gaza.\nThe Israeli military, which rarely comments on individual strikes, said it had struck “terrorist infrastructure” in central Gaza from where rockets had been fired toward Israel in recent weeks.\nView image in fullscreen Palestinians mourn relatives killed in an Israeli strike at al-Aqsa Martyrs hospital in Deir al-Balah.\nPhotograph: Majdi Fathi/NurPhoto/Rex/Shutterstock“Reports were received that as a result of the strike, civilians in an adjacent structure were killed.\nAbout 110 are believed to still be in Gaza, and Israeli authorities believe around a third are dead."}, {"id": "60f324b8-33e0-4862-adbe-055a54cae046", "title": "Iran and Israel : is all - out war inevitable ? ", "date": "2024-08-18 14:30", "url": "https://www.yahoo.com/news/iran-israel-war-inevitable-055000159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The political leader of Hamas, Ismail Haniyeh, was killed in a rocket strike in Tehran just hours after Israel assassinated Hezbollah commander Fuad Shukur in Beirut.\n| Credit: AFP via Getty ImagesSince Hamas invaded southern Israel on 7 October last year, the threat of a wider regional war has been \"ever-present\", said The Daily Telegraph.\nAnd Iran knows that Netanyahu has laid a trap for them with the recent assassinations.\nIran could 'call Israel's bluff'Iran, however, has vowed revenge, said Paul Wood in The Spectator.\nThe targeted assassinations were a \"showy\" gamble that has put Israel on the brink of disaster."}, {"id": "9ae1e145-2894-43e3-9fe9-cbd7cba08a24", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 04:45", "url": "https://www.yahoo.com/news/russia-launches-third-ballistic-missile-041831952.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia launches third ballistic missile attack on Kyiv this month, Ukraine saysKYIV (Reuters) -Russia on Sunday carried out its third ballistic missile attack on Kyiv this month but preliminary data indicated most of the projectiles were shot down on approach, the military administration of the Ukrainian capital said.\nPopko said the Russians had most likely used North Korean-made ballistic missiles.\nHe said Russia launched eight missiles on Sunday morning, including three ballistic, three cruise and two guided aircraft missiles.\nHowever, Kyiv region governor Ruslan Kravchenko said two private houses were destroyed and 16 others were damaged by falling debris.\nRussia launched a full-scale invasion of Ukraine two-and-a-half years ago and now holds about 18 percent of its territory in the east and south."}, {"id": "0b0913c0-6481-4b4e-98bd-9b1e642c7da1", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 05:15", "url": "https://economictimes.indiatimes.com/news/defence/russia-launches-third-ballistic-missile-attack-on-kyiv-this-month-ukraine-says/articleshow/112601304.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"This is already the third ballistic strike on the capital in August, with exact intervals of six days between each attack,\" Serhiy Popko, the head of the Kyiv military administration, said on the Telegram messaging app.\n\"According to preliminary information, the Russians again, for the third time in a row, most likely used North Korean ballistic missiles.\n\"Popko added that Ukraine's air defence units also destroyed a number of drones launched by Russia.The scope of the attack was not immediately clear.\nPopko said there were no immediate reports of casualties or damage.Reuters could not independently verify the type of missiles launched.\n(Reporting by Valentyn Ogirenko in Kyiv; Writing by Lidia Kelly in Melbourne; Editing by Jamie Freed)"}, {"id": "a46ab9a3-d4a3-4ff7-a5ff-20a085d4f7d3", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 05:30", "url": "https://www.thestar.com.my/news/world/2024/08/18/russia-launches-third-ballistic-missile-attack-on-kyiv-this-month-ukraine-says", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Russia on Sunday carried out its third ballistic missile attack on Kyiv this month but preliminary data indicated most of the projectiles were shot down on approach, the military administration of the Ukrainian capital said.\nPopko said the Russians had most likely used North Korean-made ballistic missiles.\nHe said Russia launched eight missiles on Sunday morning, including three ballistic, three cruise and two guided aircraft missiles.\nHowever, Kyiv region governor Ruslan Kravchenko said two private houses were destroyed and 16 others were damaged by falling debris.\nRussia launched a full-scale invasion of Ukraine two-and-a-half years ago and now holds about 18 percent of its territory in the east and south."}, {"id": "4286732a-380b-4a91-893c-cc5620d17025", "title": "Russia launches third ballistic missile attack on Kyiv this month , Ukraine says", "date": "2024-08-18 05:45", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Russia-launches-third-ballistic-missile-attack-on-Kyiv-this-month-Ukraine-says-47679284/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"This is already the third ballistic strike on the capital in August, with exact intervals of six days between each attack,\" Serhiy Popko, the head of the Kyiv military administration, said on the Telegram messaging app.\n\"According to preliminary information, the Russians again, for the third time in a row, most likely used North Korean ballistic missiles.\"\nPopko added that Ukraine's air defence units also destroyed a number of drones launched by Russia.\nReuters could not independently verify the type of missiles launched.\nAbout two hours after the initial attack, Kyiv, its surrounding region and most of central and northeast Ukraine were under fresh raid alerts, with threats of more missiles heading towards the city, Ukraine's air force said."}, {"id": "1dc3f434-095e-41fe-b774-6cfb0b6b4b9e", "title": "Ukraine strikes second bridge in Russia Kursk region", "date": "2024-08-18 13:15", "url": "https://www.rte.ie/news/ukraine/2024/0818/1465501-ukraine-russia-kursk/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Ukrainian forces have struck another bridge in Russia's Kursk region as they seek to disrupt Moscow's combat operations in the area, Ukraine's air force has said.\nRead the latest Ukraine headlinesThe United States and Seoul have accused North Korea of providing ammunition and missiles to Russia for its war in Ukraine.\nTwo and a half years after Russia's invasion of Ukraine, Kyiv's troops last week launched a major counter-offensive into the Kursk region, sending more than 120,000 people fleeing.\nNorth Korea has dramatically upgraded its ties with Russiain the past year with two summit meetings by their leaders who pledged closer co-operation in all areas.\nSouth Korea, Ukraine and the United States have accused North Korea of supplying artillery and missiles to Russia for use in its war against Ukraine."}, {"id": "92978a6a-13d0-490d-9c2e-27fde7e51479", "title": "Lebanon says 10 Syrians killed in Israeli strike on south", "date": "2024-08-18 03:15", "url": "https://www.philstar.com/world/2024/08/18/2378761/lebanon-says-10-syrians-killed-israeli-strike-south", "domain": "philstar.com", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon — The Lebanese health ministry said an Israeli air strike on the south on Saturday killed 10 Syrians, as the Israeli military reported hitting weapons stores of the Iran-backed Hezbollah movement.\nThe Israeli military said there were no reports of any casualties but the 55 rockets sparked \"multiple fires\".\nEarlier, the Israeli military said a \"projectile\" fired from Lebanon had wounded two soldiers, one of them severely, near Misgav Am, a kibbutz community close to the border.\nThe cross-border violence has killed 581 people in Lebanon, mostly Hezbollah fighters but including at least 128 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures."}, {"id": "b04cb81e-e8ec-4566-ae91-95b66130b72a", "title": "Israel strikes Gaza as Blinken heads to region to try to help close a cease - fire deal", "date": "2024-08-18 13:45", "url": "https://www.wdio.com/front-page/world-national/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-a-cease-fire-deal/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nThe U.S. and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism.\n(AP Photo/Abdel Kareem Hana) Photo: ASSOCIATED PRESS/Abdel Kareem HanaHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital."}, {"id": "220cc2eb-4464-4028-880c-a842a70db257", "title": "Israel strikes Gaza as Blinken heads to region to try to help close a cease - fire deal", "date": "2024-08-18 13:30", "url": "https://kdhnews.com/news/nation/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-a-cease/article_a8700583-1744-576c-a6c6-8446a0aff469.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "Thank you for reading!\nPlease purchase a subscription to read our premium content.\nIf you have a subscription, please log in or sign up for an account on our website to continue."}, {"id": "6cdb83c7-06e7-4255-a2c3-c9b92269b72a", "title": "Russia Ukraine war live : Kyiv  blows up  second bridge in Kursk as Putin hits back with missiles attack on capital", "date": "2024-08-18 08:45", "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-putin-live-news-kursk-rostov-b2597966.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "✕ Close Russia will be held accountable as Ukraine continue advance into Kursk, warns ZelenskyFor free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent.\nRead our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Ukraine’s armed forces says it has attacked a second bridge over the Seym river in Russia’s Kursk region, where another bridge was destroyed earlier this week.\nAir force commander Lieutenant General Mykola Oleshchuk wrote: “Minus one more bridge!\nThe warning by IAEA director general Rafael Grossi came after a drone strike hit the road surrounding the plant, landing close to the essential cooling water sprinkler ponds and the only remaining 750 kilovolt power line supplying the plant."}, {"id": "df1198b0-2bc6-4ce9-a3e0-b71c0a0717e2", "title": "Secretary of State Blinken heads to Middle East to help close Gaza cease - fire deal", "date": "2024-08-18 12:45", "url": "https://www.cbsnews.com/news/secretary-of-state-blinken-middle-east-gaza-cease-fire-deal-israel/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken is headed to the Middle East on Sunday to try to seal a cease-fire deal for Gaza after months of contentious negotiations between regional leaders.\nU.S. Secretary of State Antony Blinken boards his plane at Joint Base Andrews to depart to the Middle East, from Maryland, U.S., August 17, 2024.\nAn Israeli delegation is set to travel to Cairo on Sunday for further talks, and Blinken will meet with Netanyahu on Monday.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "6f13bbe7-c8eb-46e6-8790-68741fc9b6b9", "title": "Safety at Ukraine power plant  deteriorating  after drone strike threatens disaster at ... ", "date": "2024-08-18 02:45", "url": "https://www.lbc.co.uk/news/safety-ukraine-zaporizhzhia-power-plant-deteriorating-drone-strike/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Safety at Ukraine power plant 'deteriorating' after drone strike threatens disaster at Europe's largest nuclear facilitySafety at Ukraine’s Zaporizhzhia power plant 'deteriorating' after drone strike threatens disaster at Europe's largest nuclear facility.\nPicture: AlamyBy Christian OliverThe safety of Europe's largest nuclear facility is under threat after the United Nation's watchdog warned that the situation at Ukraine’s Zaporizhzhia power plant is “deteriorating” after a nearby drone strike.\nA Russian soldier standing in front of the Zaporizhzhia Nuclear Power Plant in Enerhodar, Zaporizhzhia Oblast.\nThe fire caused “considerable damage” but there was no significant threat to nuclear safety, the agency confirmed.\nRussian military bloggers said that the destruction of bridges would impede deliveries of supplies to Russian forces, but not cut them off completely."}, {"id": "39f6a928-a882-4d2b-bea5-666bcc680638", "title": "Israeli airstrike kills 18 members of a family in Gaza", "date": "2024-08-18 03:00", "url": "https://omaha.com/news/nation-world/government-politics/politics-middle-east-war-palestinians/article_14f3125a-7b62-56ea-a442-d794a5e47551.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip — An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday — hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas.\nOfficials from the United States, Egypt and Qatar ended two days of cease-fire talks and expressed hope that a deal could be reached in the 10-month-old war.\nAmong those killed was Sami Jawad al-Ejlah, a wholesaler who coordinated with the Israeli military to bring meat and fish to Gaza.\nThe Israeli military, which rarely comments on individual strikes, said it struck \"terrorist infrastructure\" in central Gaza where rockets were fired toward Israel in recent weeks.\nThe vast majority of Gaza's population was displaced, often multiple times, and about 84% of the territory was put under evacuation orders by the Israeli military, according to the United Nations."}, {"id": "c4992e8a-d8f9-4f60-af22-6e5acd3dc8fb", "title": "Israel kills 2 Hamas militants in West Bank airstrike", "date": "2024-08-18 05:30", "url": "http://www.huewire.com/israel-kills-2-hamas-militants-in-west-bank-airstrike/", "domain": "huewire.com", "domain_classification": "Unknown", "message": "RAMALLAH, West Bank — Israel said it killed two senior Hamas militants in an airstrike on their car in Jenin in the occupied West Bank on Saturday, claiming they were involved in the killing of an Israeli.\nIn a statement, Hamas’ Al-Qassam Brigades military wing said it was mourning the deaths of two fighters in an Israeli airstrike on their vehicle in Jenin.\nIsraeli authorities said at the time that Palestinian gunmen opened fire on a main road in the occupied West Bank, killing one and wounding another.\nViolence in the West Bank has escalated since the war in Gaza between Israel and Palestinian militant group Hamas broke out after the October 7 attack by Hamas that killed 1,200 people and captured about 250 hostages in Israel.\nThe latest West Bank violence comes as a new round of talks in Doha aimed at ending 10 months of fighting in Gaza are due to resume next week."}, {"id": "a62a78e8-ce01-4b90-8ae4-d64ccb0a755c", "title": "Antony Blinken to push for Gaza ceasefire ; Israel launches fresh strikes", "date": "2024-08-18 13:00", "url": "https://economictimes.indiatimes.com/news/defence/antony-blinken-to-push-for-gaza-ceasefire-israel-launches-fresh-strikes/articleshow/112608356.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "29839a37-a76a-4696-add7-dc994c1e1aa3", "title": "Three UN peacekeepers lightly injured in south Lebanon  explosion  ", "date": "2024-08-18 14:00", "url": "https://www.thehindu.com/news/international/three-un-peacekeepers-lightly-injured-in-south-lebanon-explosion/article68539639.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "The Iran-backed Hezbollah group has exchanged cross-border fire with the Israeli army in support of ally Hamas since the Palestinian militant group's October 7 attack on Israel sparked the Gaza war.\n\"Earlier today, three peacekeepers on patrol were lightly injured when an explosion occurred near their clearly marked UN vehicle in the vicinity of Yarine, in south Lebanon,\" the UN Interim Force in Lebanon (UNIFIL) said in a statement.\nA UNIFIL source said that the explosion that injured the peacekeepers was probably a nearby air strike, but \"not a direct hit\".\nThe cross-border violence has killed 582 people in Lebanon, mostly Hezbollah fighters but including at least 128 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures."}, {"id": "06e6e922-43d2-4133-8f12-971a49e6ff21", "title": "  Tyranny and turmoil  in Russian invasion , US defense secretary says", "date": "2024-08-18 01:00", "url": "https://www.navytimes.com/flashpoints/ukraine/2022/11/20/tyranny-and-turmoil-in-russian-invasion-us-defense-secretary-says/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "Austin made the remarks at the annual Halifax International Security Forum, which attracts defense and security officials from Western democracies.\n“Russia’s invasion offers a preview of a possible world of tyranny and turmoil that none of us would want to live in.\nU.S. Secretary of Defense Lloyd J. Austin III delivers remarks at the Halifax International Security Forum in Halifax on Saturday, Nov.19, 2022.\nWhile the source of the missile is under investigation, NATO officials have said they suspect it was fired from a Ukrainian missile battery.\nRussian officials have cast the conflict as a struggle against NATO — though Ukraine is not a NATO member even if it has been receiving aid from NATO member states."}, {"id": "f51f3182-1969-4ebe-ab16-2d140c9d8332", "title": "Israel deterrence is working against Iran Ayatollah Ali Khamenei", "date": "2024-08-18 03:15", "url": "https://www.jpost.com/opinion/article-814948", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The answer just might be “yes,” as revealed by a barely reported yet enormously dramatic statement from Iran’s new elected President Masoud Pezeshkian.\nThe message was becoming clear: Israel can strike Iran, Lebanon, and anywhere else.\nAFTER THE recent strike in Tehran, Iran vowed to perform its “duty” of “avenging [Haniyeh’s] blood,” including what appears to be a threat to intentionally target Israeli civilians.\nInstead, the Iranian president cited fears of Israeli retaliation.\nSpecifically, Pezeshkian cautioned that an Israeli retaliatory attack could cripple Iran’s economy, infrastructure, and even lead to the country’s collapse."}, {"id": "c29570c5-c676-43a3-9cad-7416146287cf", "title": "Belarus says Ukraine amassing troops at border amid incursion into Russia", "date": "2024-08-18 12:45", "url": "https://www.aljazeera.com/news/2024/8/18/belarus-says-ukraine-amassing-troops-at-border-amid-incursion-into-russia", "domain": "aljazeera.com", "domain_classification": "International", "message": "Fighting has escalated after Ukrainian troops smashed through the border into Russia’s Kursk region this month.\nZaporizhzhia nuclear power plantElsewhere, the United Nations nuclear watchdog warned that the safety situation at Ukraine’s Zaporizhzhia nuclear power plant is “deteriorating” following a drone strike nearby.\nOn Saturday, Russia accused Ukraine of dropping an explosive charge on a road near the occupied plant in southern Ukraine.\n“We’re not clear whether the drone was targeting the nuclear power plant itself,” said Al Jazeera’s Alex Gatapolous, reporting from Kyiv.\n“The attention on Zaporizhzhia seems to have come, whether coincidentally or not, as Ukrainian forces are only several dozen kilometres away from the Kursk nuclear power plant in Russia,” Gatapolous added."}, {"id": "5f79726a-1423-4ab6-bfb8-c6a162ff8a7e", "title": "Gardaí investigate whether brutal stab attack on two brothers in west Cork linked to land feud", "date": "2024-08-18 13:45", "url": "https://www.independent.ie/irish-news/crime/gardai-investigate-whether-brutal-stab-attack-on-two-brothers-in-west-cork-linked-to-land-feud/a477609359.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Dunmanway, West Cork, Ireland.\nTwo men aged in their '30's were stabbed just outside Dunmanway yesterday evening.\nTwo men in their '30's and '70's have been arrested and are currently in custody.\nLocals say the altercation happened on the road involving the grey car.\nGardai are currently examining the scene."}, {"id": "efc37932-94b2-4ccc-bf4f-670efbde1412", "title": "Ukraine War , Day 907 : Kyiv Repels Another Russian Missile and Drone Attack", "date": "2024-08-18 13:15", "url": "https://eaworldview.com/2024/08/ukraine-war-kyiv-repels-russia-attack/", "domain": "eaworldview.com", "domain_classification": "Unknown", "message": "ORIGINAL ENTRY: Ukraine’s capital Kyiv has repelled another Russian missile and drone attack.\nIt declared no damage or casualties from the UAVs or the ballistic missiles, “most likely” North Korean KN-23s.\nThe Ukraine Air Force later said that the attack consisted of one Russian and two North Korean missiles, five cruise missiles, and eight Iran-made kamikaze drones.\nThe two North Korean ballistic missiles, three cruise missiles, and all drones were intercepted.\nThe Russian ballistic missile and two other cruise missiles “did not reach their desired targets”."}, {"id": "b9d30ad1-ff14-4365-8d4e-64fb6805c777", "title": "Ukraine says it repelled Russian missile attack on capital", "date": "2024-08-18 09:00", "url": "https://www.channelnewsasia.com/world/ukraine-invasion-russian-missile-attack-kyiv-repelled-4553046", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "KYIV: Ukrainian forces said they thwarted a Russian missile attack on the capital Kyiv where air-raid sirens sounded before dawn on Sunday (Aug 18).\n\"This is the third ballistic missile attack on the capital in August with a clear interval of six days between each attack,\" the Kyiv City Military Administration posted on Telegram after the early morning barrage.\nSimultaneous to the missile attack, drones were spotted heading to Kyiv.\nLast weekend, a 35-year-old man and his four-year-old son were killed in an overnight Russian missile attack near Kyiv.\nTwo-and-a-half years after Russia's invasion of Ukraine, Kyiv's troops last week launched a major counteroffensive into the Kursk region, sending more than 120,000 people fleeing."}, {"id": "182169f3-c4f2-4b5b-9eb1-83e90d7649ae", "title": "Ukraine says it repelled Russian missile attack on Kyiv", "date": "2024-08-18 07:30", "url": "https://www.rte.ie/news/2024/0818/1465501-ukraine-russia/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Ukrainian forces have struck another bridge in Russia's Kursk region as they seek to disrupt Moscow's combat operations in the area, Ukraine's air force has said.\nRead the latest Ukraine headlinesThe United States and Seoul have accused North Korea of providing ammunition and missiles to Russia for its war in Ukraine.\nTwo and a half years after Russia's invasion of Ukraine, Kyiv's troops last week launched a major counter-offensive into the Kursk region, sending more than 120,000 people fleeing.\nNorth Korea has dramatically upgraded its ties with Russiain the past year with two summit meetings by their leaders who pledged closer co-operation in all areas.\nSouth Korea, Ukraine and the United States have accused North Korea of supplying artillery and missiles to Russia for use in its war against Ukraine."}, {"id": "91528ea2-1e1f-455e-81a8-b661fc60cb7d", "title": "Did Prince Harry secretly accuse Musk of fueling united kingdom riots ? ", "date": "2024-08-18 09:30", "url": "https://www.albawaba.com/node/did-prince-harry-secretly-accuse-musk-1581818", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Prince Harry is said to have launched a veiled attack on Elon Musk, X owner, in the wake of the riots in Southport, United Kingdom, the Daily Mail reported.\nAccording to the British newspaper, Prince Harry and his wife were on a four-day visit to Colombia when the British royal attacked Elon Musk and X in a hidden way over the unrest in the UK following the stabbing attack that killed 3 little girls.\nFor as long as people are allowed to spread lies, abuse, harass, then social cohesion as we know it has completely broken down,\" Prince Harry added.\nWithout confirmation, social media users falsely claimed that the suspect was an asylum seeker who arrived in the country last year.\nHowever, British media outlets confirmed citing officials that the suspect was born in Wales to Rwandan parents."}, {"id": "978d30cf-e13b-4ce3-a316-8eb968ee4a63", "title": "Blinken to arrive in Israel to push for Gaza ceasefire as Hamas dismisses optimism", "date": "2024-08-18 06:15", "url": "https://www.theguardian.com/world/article/2024/aug/18/blinken-to-arrive-in-israel-to-push-for-gaza-ceasefire-as-hamas-dismisses-optimism", "domain": "theguardian.com", "domain_classification": "International", "message": "View image in fullscreen A Palestinian man grieves for relatives killed by an Israeli strike, at the Aal-Aqsa Martyrs hospital in Deir el-Balah, central Gaza.\nPhotograph: Majdi Fathi/NurPhoto/REX/ShutterstockIn Israel, Blinken is expected to meet with Israeli prime minister Benjamin Netanyahu and other senior officials.\nIran has threatened to retaliate against Israel after the assassination of Hamas leader Ismail Haniyeh in Tehran on 31 July.\nIsrael’s negotiating team on Saturday expressed “cautious optimism” on the possibility of advancing a deal, according to a statement on Saturday from Netanyahu’s office.\nEven as hopes grew for a ceasefire, Israel continued its deadly assault on Gaza."}, {"id": "6b9729c8-c61d-474c-8082-bc0dc8d5d511", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 09:00", "url": "https://www.breakingnews.ie/world/almost-20-killed-in-overnight-strikes-on-gaza-as-ceasefire-hopes-raise-1662339.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quadruplets, local health officials said, as US secretary of state Antony Blinken heads to the region to try to seal a ceasefire deal after months of negotiations.\nAdvertisementHamas-led militants killed some 1,200 people, mostly civilians, in the October 7th attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nThe latest Israeli bombardment included a strike on a home in Deir al-Balah that killed a woman and her six children, according to Al-Aqsa Martyrs Hospital.\nAdvertisementAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital."}, {"id": "ed1c2efc-80fd-4a23-a996-82a86419330a", "title": "Israel Strikes Gaza As Blinken Heads To Region To Try To Help Close Cease - fire Deal", "date": "2024-08-18 13:45", "url": "https://easternmirrornagaland.com/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "easternmirrornagaland.com", "domain_classification": "Unknown", "message": "(Image: AP)Deir Al-Balah (Gaza Strip) — Israeli strikes across Gaza killed 19 people overnight, including a woman and her six children, as U.S. Secretary of State Antony Blinken headed to the region on Sunday to try to seal a cease-fire deal after months of contentious negotiations.\nBut Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled.\nAlso read: Gaza reports first polio case in 25 years amid conflict-battered health systemHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "f55679a8-3ac6-46b4-8d64-913971172c6f", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:30", "url": "https://www.yahoo.com/news/israel-strikes-gaza-blinken-heads-063310797.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Palestinian health ministry there said two bodies were taken to a government hospital; Hamas claimed the two men as commanders in its military wing.\n(AP Photo/Majdi Mohammed)DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was traveling to Cairo on Sunday for further talks, and Blinken will meet with Netanyahu on Monday morning."}, {"id": "af7fca93-1598-4ae3-a390-36dc2884abc7", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:30", "url": "https://abcnews.go.com/International/wireStory/israel-strikes-gaza-blinken-heads-region-close-cease-112925185", "domain": "abcnews.go.com", "domain_classification": "International", "message": "DEIR AL-BALAH, Gaza Strip -- Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nThe U.S. and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism.\nHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital."}, {"id": "285e515c-8ad5-4751-b912-44c0718891b8", "title": "Israel strikes Gaza as Blinken heads to region to try to help close ceasefire deal", "date": "2024-08-18 09:45", "url": "https://www.scmp.com/news/world/middle-east/article/3274930/israel-strikes-gaza-blinken-heads-region-try-help-close-ceasefire-deal", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The US and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism.\nIsraeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as US Secretary of State Antony Blinken headed to the region to try to seal a ceasefire deal after months of negotiations.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nMourners react next to the bodies of Palestinians killed by Israeli strikes in Gaza, at Al-Aqsa Martyrs Hospital in Deir Al-Balah in the central Gaza Strip, on Sunday.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital."}, {"id": "f52ba575-92da-4f31-97ea-4cbc739eaab4", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:30", "url": "https://www.ksat.com/news/world/2024/08/18/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "The Palestinian health ministry there said two bodies were taken to a government hospital; Hamas claimed the two men as commanders in its military wing.\n(AP Photo/Majdi Mohammed)DEIR EL-BALAH – Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was traveling to Cairo on Sunday for further talks, and Blinken will meet with Netanyahu on Monday morning."}, {"id": "5ce3bf96-62dd-4bc1-b761-c9352be3cee2", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:00", "url": "https://www.news4jax.com/news/world/2024/08/18/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "The Palestinian health ministry there said two bodies were taken to a government hospital; Hamas claimed the two men as commanders in its military wing.\n(AP Photo/Majdi Mohammed)DEIR EL-BALAH – Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was traveling to Cairo on Sunday for further talks, and Blinken will meet with Netanyahu on Monday morning."}, {"id": "de1d273e-d64a-4af6-a6c1-b6eb7dc60b0c", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:15", "url": "https://www.theweek.in/wire-updates/international/2024/08/18/fgn15-israel-gaza-strike.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Deir Al-Balah (Gaza Strip), Aug 18 (AP) Israeli strikes across Gaza killed 19 people overnight, including a woman and her six children, as U.S. Secretary of State Antony Blinken headed to the region on Sunday to try to seal a cease-fire deal after months of contentious negotiations.\nBut Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled.\nHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be inside Gaza, with Israeli authorities saying around a third are deceased.\nAnother strike in central Gaza killed four people, according to the Awda Hospital."}, {"id": "0b1aa60f-fb30-46af-8955-49145d196292", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 07:30", "url": "https://www.wfmz.com/news/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire/article_46b48678-56fd-58af-a94b-b186e29d6b85.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Flash flooding is already occurring.\nSome locations that may experience flash flooding include... Philadelphia, Bensalem, Yeadon, Hatboro, Folcroft, Ambler, Jenkintown, Narberth, East Lansdowne, Rockledge, Abington and Bryn Athyn.\nThis includes the following highways... Interstate 76 in Pennsylvania between mile markers 335 and 350.\nInterstate 95 in Pennsylvania between mile markers 10 and 17...and near mile marker 27.\nInterstate 676 in Pennsylvania between mile markers 0 and 1."}, {"id": "1b472ba3-465e-4825-8a93-580076ed6d80", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 08:30", "url": "https://www.thetelegraphandargus.co.uk/news/national/24525397.almost-20-killed-overnight-strikes-gaza-ceasefire-hopes-raise/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "Hamas-led militants killed some 1,200 people, mostly civilians, in the October 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was travelling to Cairo on Sunday for further talks, and Mr Blinken will meet Mr Netanyahu on Monday morning.\nIn Lebanon, three UN peacekeepers were lightly wounded when an explosion struck their vehicle near the southern village of Yarin."}, {"id": "078de888-8965-4da7-a073-66357fdaa331", "title": "Police arrest east Jerusalemite for inciting terrorism , Hamas support - Israel News", "date": "2024-08-18 11:30", "url": "https://www.jpost.com/israel-news/article-815189", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A 20-year-old woman from east Jerusalem was arrested by police in the Jerusalem District for suspicion of incitement and support for terrorism, specifically for Hamas, Israel Police reported on Sunday.\nAccording to the police, she called on Jerusalemites to carry out acts of revenge for Gaza and attack Israel on social media.\nThe investigation began after she posted inciting and pro-terrorism content on social media.\nShe wrote in a post on social media, \"Jerusalemites, strike deep into Israel, get blood vengeance for Gaza.\nPast experience has shown a direct link between incitement and support for terrorism and acts of terrorism."}, {"id": "48091029-c200-432d-872b-89fcdb1bb605", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 09:00", "url": "https://www.lancashiretelegraph.co.uk/news/national/24525397.almost-20-killed-overnight-strikes-gaza-ceasefire-hopes-raise/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Hamas-led militants killed some 1,200 people, mostly civilians, in the October 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was travelling to Cairo on Sunday for further talks, and Mr Blinken will meet Mr Netanyahu on Monday morning.\nIn Lebanon, three UN peacekeepers were lightly wounded when an explosion struck their vehicle near the southern village of Yarin."}, {"id": "561b2d70-f202-4baa-acdd-ec182551211b", "title": "Israeli strikes kill 19 in Gaza as Blinken heads to region to try to help close ceasefire deal", "date": "2024-08-18 13:00", "url": "https://www.theglobeandmail.com/world/article-israeli-strikes-kill-19-in-gaza-as-blinken-heads-to-region-to-try-to/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The children and their mother were killed in an Israeli airstrike on a house in the central town of Deir Al-Balah, health officials said.\nThere was no immediate comment from the Israeli military.\nAt Al-Aqsa Hospital in Deir Al-Balah, relatives gathered around the bodies of the mother and her six children, who were wrapped in white shrouds bearing their names.\nPeople are being pushed into narrow areas in Deir Al-Balah and Al-Mawasi, which have become pressure cookers,” Tamer Al-Burai, who lives in Deir Al-Balah with several relatives, told Reuters via a chat app.\nThe Deir Al-Balah municipality, estimating the current population in the city at 1 million, said the evacuation orders meant more people were crammed into a smaller space."}, {"id": "adb8348e-5590-491d-8c74-98f4348cadb6", "title": "Gaza airstrike kills at least 18 kin | The Arkansas Democrat - Gazette", "date": "2024-08-18 11:00", "url": "https://www.arkansasonline.com/news/2024/aug/18/gaza-airstrike-kills-at-least-18-kin/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip -- An Israeli airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas.\nThe mediation efforts aim to secure the release of scores of Israeli hostages and stop the fighting that has devastated Gaza.\nAmong those killed was Sami Jawad al-Ejlah, a wholesaler who coordinated with the Israeli military to bring meat and fish to Gaza.\nThe Israeli military, which rarely comments on individual strikes, said it struck \"terrorist infrastructure\" in central Gaza where rockets had been fired toward Israel in recent weeks.\nAbout 110 are believed to be in Gaza, though Israeli authorities believe about a third are dead."}, {"id": "bdc791fc-eaac-4940-888c-1d3c1fbadfef", "title": "Blinken to push for Gaza ceasefire ; Israel launches fresh strikes", "date": "2024-08-18 13:30", "url": "https://www.rappler.com/world/middle-east/israel-war-hamas-updates-august-18-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The children and their mother were killed in an Israeli airstrike on a house in the central town of Deir Al-Balah, health officials said.\nAt Al-Aqsa Hospital in Deir Al-Balah relatives gathered around the bodies of the mother and her six children, who were wrapped in white shrouds bearing their names.\nPeople are being pushed into narrow areas in Deir Al-Balah and Al-Mawasi, which have become pressure cookers,” Tamer Al-Burai, who lives in Deir Al-Balah with several relatives, told Reuters via a chat app.\nThe Deir Al-Balah municipality, estimating the current population in the city at 1 million, said the evacuation orders meant more people were crammed into a smaller space.\nBlinken tripIn Israel, Blinken is expected to meet with Israeli Prime Minister Benjamin Netanyahu and other senior officials."}, {"id": "caa30d17-c5bb-4272-a23b-2d554771cd48", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 08:15", "url": "https://www.yorkpress.co.uk/news/national/24525397.almost-20-killed-overnight-strikes-gaza-ceasefire-hopes-raise/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "Hamas-led militants killed some 1,200 people, mostly civilians, in the October 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was travelling to Cairo on Sunday for further talks, and Mr Blinken will meet Mr Netanyahu on Monday morning.\nIn Lebanon, three UN peacekeepers were lightly wounded when an explosion struck their vehicle near the southern village of Yarin."}, {"id": "562408a1-58a8-4c91-b7f4-356f31d816c3", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 09:00", "url": "https://www.theboltonnews.co.uk/news/national/24525397.almost-20-killed-overnight-strikes-gaza-ceasefire-hopes-raise/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "Hamas-led militants killed some 1,200 people, mostly civilians, in the October 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was travelling to Cairo on Sunday for further talks, and Mr Blinken will meet Mr Netanyahu on Monday morning.\nIn Lebanon, three UN peacekeepers were lightly wounded when an explosion struck their vehicle near the southern village of Yarin."}, {"id": "7e70861e-dc0c-4cab-b429-f34a994f6e5c", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 09:00", "url": "https://www.smdailyjournal.com/news/world/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire/article_0624c1ec-e1ec-51e7-953b-5050f5f42ade.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "95e65df6-f9ed-430a-ad7c-4656492c6d9c", "title": "Almost 20 killed in overnight strikes on Gaza as ceasefire hopes raise", "date": "2024-08-18 08:30", "url": "https://www.thenorthernecho.co.uk/news/national/24525397.almost-20-killed-overnight-strikes-gaza-ceasefire-hopes-raise/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Hamas-led militants killed some 1,200 people, mostly civilians, in the October 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital.\nAn Israeli delegation was travelling to Cairo on Sunday for further talks, and Mr Blinken will meet Mr Netanyahu on Monday morning.\nIn Lebanon, three UN peacekeepers were lightly wounded when an explosion struck their vehicle near the southern village of Yarin."}, {"id": "35bb1053-8417-4b77-93b5-d94f82f57191", "title": "Israeli strike kills at least 17 Palestinians in central Gaza , health officials say", "date": "2024-08-18 05:00", "url": "https://thesun.my/world/israeli-strike-kills-at-least-17-palestinians-in-central-gaza-health-officials-say-DM12875060", "domain": "thesun.my", "domain_classification": "Unknown", "message": "CAIRO: At least 17 Palestinians were killed and dozens wounded in an Israeli strike in the central Gaza town of Zawayda on Saturday, health officials said, as Israel issued new evacuation orders, citing Hamas rocket fire nearby.\nMost of the people killed in Zawayda were from the same family and they included eight children and four women, according to health officials in the Hamas-administered enclave.\nThe Israeli military said in response it had struck militant targets in an area from which rockets were fired at its troops.\nThe Israeli military said that since Friday its forces had killed dozens of militants, including some who had fired rockets from central and southern Gaza.\nIsrael’s subsequent military campaign has killed more than 40,000 Palestinians, most of them civilians, according to Gaza health authorities."}, {"id": "1edad028-8c29-470c-bd5c-d3d138eb2d1d", "title": "Israeli strike kills at least 17 Palestinians in central Gaza , health officials say", "date": "2024-08-18 06:00", "url": "https://kathmandupost.com/world/2024/08/18/israeli-strike-kills-at-least-17-palestinians-in-central-gaza-health-officials-say", "domain": "kathmandupost.com", "domain_classification": "Unknown", "message": "Israeli strike kills at least 17 Palestinians in central Gaza, health officials sayThe violence occurred before US Secretary of State Antony Blinken was expected to land in Israel on Sunday.\nPalestinians stand at the site of an Israeli airstrike on a shelter housing displaced people, amid the conflict between Israel and Hamas, in central Gaza Strip, August 17, 2024."}, {"id": "1ef466f9-3126-4e16-8f0b-a6e722b06e23", "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease - fire deal", "date": "2024-08-18 09:00", "url": "https://www.whec.com/national-world/israel-strikes-gaza-as-blinken-heads-to-region-to-try-to-help-close-cease-fire-deal/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 28 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken headed to the region to try to seal a cease-fire deal after months of negotiations.\nThe U.S. and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism.\n(AP Photo/Abdel Kareem Hana) Photo: ASSOCIATED PRESS/Abdel Kareem HanaHamas-led militants killed some 1,200 people, mostly civilians, in the Oct. 7 attack and abducted around 250.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nAnother two strikes in central Gaza killed nine people, according to Al-Awda Hospital."}, {"id": "58997f25-863e-44eb-a4af-3319264305f7", "title": "Ukrainian military compensate for Russia superiority in manpower and equipment by manoeuvring in Kursk Oblast – ISW", "date": "2024-08-18 07:45", "url": "https://www.yahoo.com/news/ukrainian-military-compensate-russias-superiority-052935011.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian military compensate for Russia's superiority in manpower and equipment by manoeuvring in Kursk Oblast – ISWUkraine's operation in Kursk Oblast illustrates how Ukrainian forces can use manoeuvre warfare to compensate for Russia's superiority in manpower and equipment.\nAt the start of the Ukrainian operation in Kursk Oblast, the Ukrainian forces struck largely unprepared, ill-equipped, and undermanned Russian defensive positions along the border.\nEven after Russian reinforcements were brought in, Ukraine continued to use manoeuvres to secure rapid gains in Kursk Oblast.\nUkraine's incursion into Kursk Oblast illustrates how Ukrainian forces can use manoeuvre warfare to offset Russian manpower and material advantages.\nUkrainian forces advanced within Chasiv Yar, and Russian forces recently marginally advanced near Kreminna, Pokrovsk, and Donetsk City."}, {"id": "805fe990-5cbc-48f6-9d60-3b8a109475a4", "title": "AFU Overcome Russia Superiority In Manpower And Equipment With Operation In Kursk Region", "date": "2024-08-18 13:00", "url": "https://menafn.com/1108572452/AFU-Overcome-Russias-Superiority-In-Manpower-And-Equipment-With-Operation-In-Kursk-Region-ISW", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The operation of the Ukrainian Defence Forces in the Kursk region illustrates how Ukrainians can use manoeuvre warfare to compensate for Russia's superiority in manpower and equipment.\nIt is noted that Ukraine's ability to achieve a quick manoeuvre in the Kursk region shows that Ukrainian forces have learnt the lessons of the past months of positional warfare.\nAs reported, the Defence Forces' offensive in the Kursk region of the Russian Federation began on 6 August 2024.\nSo far, the Armed Forces of Ukraine have taken control of more than a thousand square kilometres of Kursk region with dozens of settlements.\nAccording to the British newspaper The Independent, the Ukrainian Armed Forces could have capture about 2,000 Russian soldiers during the operation in the Kursk region."}, {"id": "34ec63ca-69ca-4d32-914d-1d444114317b", "title": "Editorial : Ukraine incursion may tip war into a stalemate , with Russia already on the back foot", "date": "2024-08-18 04:45", "url": "https://www.independent.ie/opinion/editorial/editorial-ukraines-incursion-may-tip-war-into-a-stalemate-with-russia-already-on-the-back-foot/a1105511557.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Aleader is a dealer in hope, Napoleon said, but the success of Ukraine’s lightning incursion into Russia so far is likely to have gone beyond even president Volody­myr Zelensky’s expectations.\nThe Kremlin has sought to present the biggest war in seven decades on continental Europe as a limited “special military operation”.\nBut the sight of so many thousands of people being put on the move within Russia does not fit such a reassuring scenario.\nA foothold in Russia would give Kyiv leverage in any such settlement talks.\nWhen you control the media and have the opposition muzzled, a stalemate might easily be presented as a win."}, {"id": "8d047c51-a29f-42c3-8229-a7a940a1fd09", "title": "Vietnam war : The Australians finding the bodies of fallen Vietnamese soldiers", "date": "2024-08-18 03:00", "url": "https://www.watoday.com.au/national/old-enemies-unite-the-australians-finding-the-bodies-of-vietnam-s-lost-soldiers-20240816-p5k2ym.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "The Australians held their position in the treeline overlooking a dried-up swamp, 40 kilometres north-east of what then was called Saigon, as the North Vietnamese charged.\nLuke Johnston at the mass grave he discovered in an old bomb crater at the site of the battle of Balmoral.\nJohn Bryant embraces the sisters of North Vietnamese soldier Nguyen Van Ha, who Bryant believes he may have killed in 1968.\nJohn Bryant salutes a casket holding the remains of North Vietnamese soldiers he fought at the Battle of Balmoral.\nAustralian veterans tried for more than a decade from the early part of this century to rediscover the spot, hoping to return the bodies of the North Vietnamese soldiers to their families for a proper burial."}, {"id": "8eb07814-f973-4e0c-8544-c0df4947ba94", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:45", "url": "https://www.edp24.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "2586a830-0e4b-48ff-96f9-af3e6e0c2f1d", "title": "Russia loses another 1 , 170 soldiers , seven tanks and 71 artillery systems", "date": "2024-08-18 07:45", "url": "https://www.yahoo.com/news/russia-loses-another-1-170-050854733.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 1,170 soldiers, seven tanks and 71 artillery systemsRussian troops lost 1,170 soldiers killed and wounded in the war of aggression against Ukraine over the past 24 hours, bringing the total number of personnel losses to 599,350.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 18 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:Approximately 599,350 (+1,170) military personnel;8,508 (+7) tanks;16,480 (+7) armoured combat vehicles;17,056 (+71) artillery systems;1,161 (+1) multiple-launch rocket systems;923 (+0) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;13,752 (+38) strategic and tactical UAVs;2,432 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,992 (+79) vehicles and tankers;2,846 (+2) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!"}, {"id": "81a03765-8b89-4997-a1ff-f7d85ce85eaf", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "271390b5-0b49-4ea4-b608-82c6be3e3a30", "title": "A Jaffa Cake Musical and The Gummy Bear Great War : Edinburgh fringe stages battles with bite | Edinburgh festival 2024", "date": "2024-08-18 13:30", "url": "https://www.theguardian.com/stage/article/2024/aug/18/a-jaffa-cake-musical-and-the-gummy-bears-great-war-edinburgh-fringe-stages-battles-with-bite", "domain": "theguardian.com", "domain_classification": "International", "message": "Gigglemug Theatre open A Jaffa Cake Musical (★★★☆☆) with tongue firmly in cheek.\nView image in fullscreen Alex Prescot, right, presides on keyboards as Sam Cochrane and Sabrina Messer do battle in court in A Jaffa Cake Musical.\nView image in fullscreen Existential … The Gummy Bears’ Great War.\nView image in fullscreen Dino drama … Valentina Fadda and Leonardo Tomasi in The Gummy Bears’ Great War.\nBatisfera’s production is deemed suitable for over-12s while A Jaffa Cake Musical is for over-eights; the audiences for both contain surprisingly few young people."}, {"id": "0adc6d91-12d2-4b80-bd57-168a3115d7dd", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:30", "url": "https://www.theboltonnews.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "d5be0814-066f-4db1-8278-62038bf5c608", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:15", "url": "https://www.bucksfreepress.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "e9bd9816-9091-486d-a9f0-1836e5200fe6", "title": "Alaseyori to fans : Pray For Me , evil forces trying to silence me", "date": "2024-08-18 07:45", "url": "https://tribuneonlineng.com/alaseyori-to-fans-pray-for-me-evil-forces-trying-to-silence-me/", "domain": "tribuneonlineng.com", "domain_classification": "Unknown", "message": "Nigerian gospel singer Adeyinka Alaseyori has sparked concern among her fans after revealing that she is facing intense spiritual battles.\nShe called for prayers from her followers, claiming that malicious forces are trying to silence her voice and bring her down by all means.\nAlaseyori, known for her soulful and energetic performances, opened up about the ongoing struggles she has been facing for months.\nWhile Alaseyori remains a prominent figure in the gospel music industry, her meteoric rise has not been without controversy.\n“I also want you to pray for yourselves too,” she urged, pointing out the ever-present spiritual battles that everyone faces."}, {"id": "13acd02a-0e8a-4323-a24f-1a7b76789c05", "title": "Chennai Firm Breakthrough : See - Through Armor for Tanks Nears European Export – Indian Defence Research Wing", "date": "2024-08-18 13:15", "url": "https://idrw.org/chennai-firms-breakthrough-see-through-armor-for-tanks-nears-european-export/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Chennai Firm’s Breakthrough: See-Through Armor for Tanks Nears European Export| BySOURCE: AFIBig Bang Boom Solutions, a Chennai-based technology firm, is on the cusp of a major breakthrough in defense technology.\nThe company is in advanced negotiations with a UK-based company for the export of its innovative ‘See-Through Armor’ (STA) system, designed to provide tank crews with a 360-degree view of their surroundings.\nThe STA system, also known as the 360 Active Battle Interface, is a revolutionary technology that utilizes multiple RGB and thermal cameras strategically placed around the armored vehicle.\nThis advanced setup offers tank crews a comprehensive, real-time view of their environment, including an 8x digital zoom capability, through a Heads-Up Display (HUD).\nA key advantage of the STA system is its distributed architecture, eliminating the vulnerabilities associated with single-mast-based systems."}, {"id": "e75c78d0-f4ad-4eed-8621-08f36981699d", "title": "Russians deploy soldiers from Aerospace Forces into Kursk Oblast – media", "date": "2024-08-18 10:45", "url": "https://www.yahoo.com/news/russians-deploy-soldiers-aerospace-forces-075445239.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Due to a manpower shortage, the Russian command has sent in soldiers from the Russian Aerospace Forces who were assigned to motorised rifle units to defend Kursk Oblast, according to a source cited by the Vazhnie Istorii media outlet.\nSource: Vazhnie Istorii (Important Stories) media outlet, founded by investigative journalists from Russia, citing open source dataQuote: \"The ‘aerospace infantry’ was deployed to defend Kursk Oblast.\nDue to the lack of personnel in the motorised rifle units, they took soldiers from the Russian Aerospace Forces units, including these from nuclear warning stations and squadrons of heavy bombers.\"\nDetails: According to reports, Russian Aerospace Forces (VKS) soldiers formed a motorised rifle regiment in May or June as a border cover group.\nFor example, 22-year-old Ilya Romanov vanished during the fighting near Korenevo, Kursk Oblast."}, {"id": "5568afb4-37a6-4062-a1df-41e45b948de3", "title": "James Duffy , the Gweedore man who won the Victoria Cross", "date": "2024-08-18 13:45", "url": "https://www.irishcentral.com/opinion/others/james-duffy-gweedore-victoria-cross", "domain": "irishcentral.com", "domain_classification": "Unknown", "message": "Irishmen had been awarded the Victoria Cross, awarded for valor in the presence of the enemy, since its creation in January 1856 by Queen Victoria.\n30 Irish VCs were awarded in the Crimean War, 59 Irish VCs in the Indian Mutiny, 46 Irish VCs in numerous other British Empire campaigns between 1857 and 1914, 37 Irish VCs in World War I, and eight Irish VCs in World War II.\nJames Duffy, a native of Gweedore in Donegal, became one of the Irish recipients of the VC, the highest level of gallantry available to a soldier serving in the British Army.\nIrishCentral History Love Irish history?\nJames Duffy was presented with his Victoria Cross by King George IV in the quadrangle of Buckingham Palace on the 25th of July 1918, and later returned home to Bonagee, Donegal where he was given a rousing reception."}, {"id": "fb291fff-3279-4160-94a6-6bc87f53167b", "title": "Special Forces exercise Robin Sage in Fayetteville area this month", "date": "2024-08-18 09:45", "url": "https://www.yahoo.com/news/special-forces-exercise-robin-sage-090408762.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aspiring Special Forces candidates will take the last step toward earning their Green Berets later this month during the quarterly exercise known as Robin Sage.\nUpon successful completion, the soldiers are assigned to one of the Army's Special Forces units.\nAndrew Craft, The Fayetteville ObserverWhat is Robin Sage?\nThe first exercise was held in Robbins in 1952 under various names before becoming Robin Sage in 1974, according to the Army.\nThis article originally appeared on The Fayetteville Observer: Special Forces exercise to span North Carolina counties this month"}, {"id": "3ea2383d-61ed-495c-bf77-98210148fe75", "title": "Russian Troops Eliminate Group of 16 Ukrainian Soldiers in Kursk Region", "date": "2024-08-18 09:00", "url": "https://sputnikglobe.com/20240818/russian-troops-eliminate-group-of-16-ukrainian-military-in-kursk-region---spokesperson-1119810407.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240818/russian-troops-eliminate-group-of-16-ukrainian-military-in-kursk-region---spokesperson-1119810407.htmlRussian Troops Eliminate Group of 16 Ukrainian Soldiers in Kursk RegionRussian Troops Eliminate Group of 16 Ukrainian Soldiers in Kursk RegionSputnik InternationalA group of 16 Ukrainian military personnel of a separate mechanized brigade has been destroyed near the village of Kremyanoe in Russia's Kursk Region, a spokesperson for the Russian law enforcement department told Sputnik on Sunday.\n2024-08-18T07:09+00002024-08-18T07:09+00002024-08-18T09:40+0000russia's special operation in ukrainerussiavladimir putinkurskukrainerussian defense ministryhigh mobility artillery rocket system (himars)https://cdn1.img.sputnikglobe.com/img/07e8/07/0a/1119326415_0:86:2622:1561_1920x0_80_0_0_6e84828a3955e0213e2dd81877e2391b.jpg\"A group of 16 soldiers from the 225th Separate Assault Battalion of the 115th Separate Mechanized Brigade of the Ukrainian Army was destroyed near the settlement of Kremyanoe in the Kursk region.\nThe enemy unit was destroyed by Russian troops in the forest,\" the spokesperson said.On August 6, Ukrainian forces crossed the border into Russia and launched an offensive in the Kursk Region.\nCommenting on the attack, Russian President Vladimir Putin said that Ukraine had carried out another large-scale provocation, firing indiscriminately at civilian targets.\nhttps://sputnikglobe.com/20240817/ukrainian-military-unit-surrenders-to-russian-armed-forces-in-the-kursk-region-1119802997.htmlrussiakurskukraineSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik Internationalukrainian military personnel, russian troops, russian troops eliminate"}, {"id": "6b450b44-e883-40ed-9eb0-e69162735aca", "title": "War 2 : Kiara Advani to Perform Intense  Commando Fight  in Hrithik Roshan - Led Film , Details Inside", "date": "2024-08-18 14:30", "url": "https://www.news18.com/movies/war-2-kiara-advani-to-perform-intense-commando-fight-in-hrithik-roshan-led-film-details-inside-9019341.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Kiara Advani is rapidly establishing herself as one of Bollywood’s most reliable stars, and her upcoming projects are only adding to her rising popularity.\nAmong the most anticipated is Ayan Mukerji’s ‘War 2’, where she will star alongside Hrithik Roshan and Jr NTR.\nFans are buzzing with excitement, especially after a recent report revealed that Kiara will be involved in an intense ‘commando fight’ sequence in the film.\nA source close to the project revealed to PinkVilla that Ayan Mukerji and producer Aditya Chopra have carefully crafted War 2’s script to stand out in the YRF Spy Universe.\nDirected by Ayan Mukerji, the film is slated for release on August 14, 2025, just in time for India’s Independence Day celebrations."}, {"id": "aec0817a-04ee-45f7-8082-e3054d0fc2f3", "title": "Family members of Michigan Civil War Veterans honor loved ones with Capitol flag procession", "date": "2024-08-18 05:00", "url": "https://www.wilx.com/2024/08/18/family-members-michigan-civil-war-veterans-honor-loved-ones-with-capitol-flag-procession/", "domain": "wilx.com", "domain_classification": "Unknown", "message": "LANSING, Mich. (WILX) -A special Michigan Civil War Battle flag Procession was held on Saturday, Aug. 17.\nThe flag procession was a way for people to honor and remember those from Michigan who lost their lives or fought in the Civil War.\nFamily members of those who fought in the war paraded 80 flags to the Michigan Capitol, where they returned them to their home lining inside the rotunda.\n“These flags are a tangible link to our past and to Michigan’s incredible contribution during the Civil War,” said Matt Vanacker, Director for the Save the Flags Project.\nLooking to hire people, or grow your business through advertising?"}, {"id": "f2fc4077-00aa-49fc-9bce-cd9876006146", "title": "Russia May Receive Iranian Analogue of HIMARS – Fath - 360", "date": "2024-08-18 07:00", "url": "https://www.kyivpost.com/post/37568", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The Kremlin has shown interest in Iranian ballistic missiles such as Fateh-110 and Zolfaghar as early as in 2022.\nThe Fath-360 is a tactical ballistic missile, which, unlike other ballistic missiles, has aa relatively short range.\nIn terms of concept, Ababil missiles are similar to the GMLRS guided missiles used in the HIMARS systems.\nBoth Iranian missiles are surface-to-surface weapons and are launched from ground-based launchers to strike ground targets.\nFath-360The Iranian Fath-360 ballistic missile, also known as the BM-120, is 5.1 meters long, 368 mm in diameter, and weighs 787 kg, of which 150 kg is the warhead."}, {"id": "ef16db36-a2c4-436c-b847-feb766c79717", "title": "ELDERBORN Windows , XONE , PS4 , Switch game", "date": "2024-08-18 05:00", "url": "https://www.indiedb.com/games/elderborn", "domain": "indiedb.com", "domain_classification": "Unknown", "message": "ELDERBORN is a soulslike, single-player, FPP, heavy-metal slasher with challenging, skill-based, melee-only combat.\nIt combines an old-school feel with the modern git good games culture to give you a barbaric adventure you'll never forget.\nGet ELDERBORN and immerse yourself in the action-filled, barbaric world waiting for those bold enough to answer the challenge.\nWhether you praise the sun or fear the old blood, ELDERBORN will make you feel right at home.\nWe had Arnold Schwarzenegger as Conan the Barbarian (and the mighty good Conan cartoon series), we had He-Man, we had Simon Bisley's Slaine comic books, we had... you get the picture."}, {"id": "2ee3568b-e272-4ebe-beba-bd5e8cbc5056", "title": "The Zionist policy of enrichment : Successes and failures", "date": "2024-08-18 03:15", "url": "https://www.jpost.com/opinion/article-815115", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "To take a recent example, after Putin’s invasion of Ukraine in 2022, the West instantly minimized trade with Russia to weaken its war effort.\nThe Zionist movement and Israel, however, from the start adopted the opposite approach, seeking to enhance Palestinian economic welfare.\nThis, what I call the policy of enrichment, represents the deepest, most powerful, and most enduring of Israeli approaches to its Palestinian foe.\nFounded on the assumption that Palestinian economic self-interest would push other concerns aside, enrichment hopes that gains in welfare will reconcile Palestinians to Jewish immigration and the creation of a Jewish homeland.\nThey must give up on managing their conflict and instead choose winning it."}, {"id": "6da9e8b2-875b-478d-ab48-01d8264b6d85", "title": "River Hunters - Blaze | TV Guide", "date": "2024-08-18 13:15", "url": "https://www.tvguide.co.uk/schedule/b9ce51cc-f946-5ec9-a678-94f7eefc39b8/river-hunters", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "River HuntersBlaze 7:00 PM to 8:00 PM Sunday 18 August Share Add toCalendar +Scotland and the Civil War Season 2 Episode 3 of 6River detectorist Beau Ouimette and presenter and keen swimmer Rick Edwards go in search of evidence of the clashing Scottish clans embroiled in the civil war that raged across the British Isles in the 17th century.\nFights erupted during this period between the Royalists supporting the King and the Covenanters wanting more power for church and state.\nStarting on the River Lochy, situated in the shadow of Ben Nevis, the pair hunt for evidence of the 1645 Battle of Inverlochy - a pivotal fight that saw the Royalist army launch a surprise attack against the ill-prepared CovenantersRiver Hunters airs on Blaze at 7:00 PM, Sunday 18 August .\nLearn more about River Hunters and other education/science/factual topics on our factual page"}, {"id": "38e02d69-61e3-4ae3-9cae-c6ef6e3f85d7", "title": "Opinion : Red Thin Line – How to Play Russia", "date": "2024-08-18 08:15", "url": "https://www.kyivpost.com/opinion/37483", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Many of these lines have been crossed, most recently in a spectacular manner with Ukrainian forces entering Russian territory in the Kursk region.\nThis unexpected incursion into Russian territory sent an important message to the Russian people.\nSeizing the NarrativeAfter Russia launched its full-scale invasion, there were attempts by Western politicians to seize control of the narrative.\nIt’s no secret that there is a significant qualitative gap between NATO forces and the Russian military.\nThe West should allow Ukraine to use all means necessary, including using the offensive weapons provided to it on Russian territory."}, {"id": "86901308-f4b2-4f24-864d-0ef05b894736", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:30", "url": "https://www.oxfordmail.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "1455920d-9b5e-4973-85b8-f3a6c06eab8b", "title": "5th Finnish volunteer fighter reported killed in Ukraine", "date": "2024-08-18 11:30", "url": "https://yle.fi/a/74-20105643", "domain": "yle.fi", "domain_classification": "Unknown", "message": "Ville Mykkänen, 26, a former Centre Party politician, died in early August, according to a war veterans' association.\nFinnish volunteer fighter Ville Mykkänen, 26, has been killed in action in Ukraine.\nHis death was reported on Saturday night by Sodan kokeneet, a Finnish mental health association supporting those who have experienced combat.\nMykkänen is the fifth Finnish volunteer fighter known to have died in Ukraine.\nOn 30 July, it reported the death of the fourth Finn known to have been killed in combat in Ukraine since Russia's 2022 invasion."}, {"id": "58ab2df2-6cd4-4100-a476-51a48097f3e9", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 13:30", "url": "https://abcnews.go.com/International/wireStory/ukrainian-troops-struck-2-key-bridges-russia-stay-112926311", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Ukraine has destroyed a key bridge in Russia's western Kursk region and struck a second one nearby, a dozen days into its stunning cross-border incursion, in an apparent attempt to sever Russian supply linesUkrainian troops have struck 2 key bridges in Russia's Kursk area.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "4db1f352-a9d4-4b7a-94fc-bf8244f15be3", "title": "RIGHT SPEAK : 98 C - Clashes in F - Line , Pokrovsk Sec Most Active , 20 Attacks Repelled , 15 Ongoing ; Toretsk , Pokrovsk Sec Remain Hottest ; Aug 17 : Latest F - Line Update ; UKR Kursk Reg Positions Strengthened , Stabilized Territory Expanded ; ...", "date": "2024-08-18 04:45", "url": "http://www.rightspeak.net/2024/08/98-c-clashes-in-f-line-pokrovsk-sec.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Aug 2024 (90) Jul 2024 (155) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "4257ff94-0a17-4c9d-a549-3c6b52281fec", "title": "In Chicago , security at the Democratic National Convention aims to avoid a repetition of the 1968 violence", "date": "2024-08-18 13:00", "url": "https://theconversation.com/in-chicago-security-at-the-democratic-national-convention-aims-to-avoid-a-repetition-of-the-1968-violence-236842", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "As Chicago hosts the 2024 Democratic National Convention, the eyes of the world will be on the city.\nIn the best-case scenario for the Democratic Party, the political convention will not be overtaken by divisive issues inside the convention hall or outside on the streets.\nThe 1968 conventionIn 1968, the presidential nomination was left wide open as incumbent President Lyndon B. Johnson chose not to seek a second term.\nFor example, in the lead-up to this year’s Democratic National Convention, Chicago’s policy on policing protest was revised.\nThose revisions will lead to improved response actions for any unrest on the streets during the 2024 Democratic National Convention in Chicago."}, {"id": "dd160656-46df-4af3-9851-a1b178947822", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 14:30", "url": "https://www.ipswichstar.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "c28b5627-3675-4f04-9d03-59feb9fd7b81", "title": "New Spider - Man Skin Coming to Fortnite Soon", "date": "2024-08-18 07:00", "url": "https://comicbook.com/gaming/news/new-spider-man-skin-fortnite/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "A new Marvel-themed season is underway in Fortnite, and Chapter 5 Season 4 – Absolute Doom has a lot of great things to offer players who are also Marvel fans.\nPer notable and historically reliable Fortnite leaker ShiinaBR, a new Spider-Man skin with the a high-tech suit taking inspiration from the original version of the Iron Spider suit will be hitting the Fortnite Shop next Friday, August 23rd.\nIn addition to the Iron Spider skin, the collaboration will also feature a skin, emote, pickaxe, guitar, and wrap, as was initally shared by another user, SpushFNBR.\nThe Iron Spider suit coming to Fortnite soon moves away from the Marvel Cinematic Universe for inspiration and instead embraces a visual a bit more familiar for the suit that's had multiple different versions since its initial debut in Amazing Spider-Man #529 (1999), where Tony Stark was first shown crafting the armor and gifting it to Peter Parker.\nAs mentioned, in the time since its initial debut the Iron Spider suit and title has been seen in many forms and worn by multiple different characters, from the MCU's Peter Parker portrayed by Tom Holland, to Mary Jane Watson putting on the armor in The Amazing Spider-Man #15 (2017), an Iron Spider suit in Insomniac's Marvel Spider-Man games, and more."}, {"id": "6b60273f-6082-4cd4-810a-a15ea5e75fd5", "title": "Irish neutrality will be the focus of Co Wexford summer school debate", "date": "2024-08-18 05:45", "url": "https://www.independent.ie/regionals/wexford/new-ross-news/irish-neutrality-will-be-the-focus-of-co-wexford-summer-school-debate/a1112057373.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "In a special session at the Kennedy Summer School in New Ross this August, a spotlight will be shone on the topic of ‘The NATO Divide: Perspectives on Ireland’s Neutrality and National Security’.\nSpeaking ahead of the event Dr Stacey Connaughton said: “We will have an in-depth conversation with US Air Force Major General Timothy Zadalis (Ret.)\nQuestions remain about the viability of the neutrality of Austria and Ireland within the European Union.\nJoining the panel discussion is Jim Roche who is PRO of the Irish Anti-War Movement and a founding member of the Irish Neutrality League.\nThe Kennedy Summer School and Festival is run in association with the Office of Public Works, Fáilte Ireland, New Ross District Council, Wexford County Council, Purdue University and Boston College."}, {"id": "3700b046-847d-4d46-b6a9-dad18fff0c9b", "title": "Are leaf blowers the latest front in the culture wars ? | Sheneman", "date": "2024-08-18 13:30", "url": "https://www.nj.com/coronavirus/2024/08/are-leaf-blowers-the-latest-front-in-the-culture-wars-sheneman.html", "domain": "nj.com", "domain_classification": "Unknown", "message": "The Blower Wars are heating up, not to be confused with The Boer War, which was a different event entirely.\nThe Blower Wars, a name I’m trying hard to make stick, is the battle over eardrums and lungs being fought where and whenever lawns are tended.\nGas-powered leaf blowers are, as you are well aware, hilariously loud and filthy.\nThese archaic two-stroke engines are good at two things, blowing leaves and ruining your peace and quiet.\nAn increasing number of towns and municipalities have banned or restricted these steampunk era landscaping devices, and landscapers aren’t too happy about it."}, {"id": "6e69551f-c78a-4894-a8c5-40542dd2563a", "title": "Russia War Casualty Toll In Ukraine Up By 1 , 170 In Past Day", "date": "2024-08-18 07:30", "url": "https://menafn.com/1108571799/Russias-War-Casualty-Toll-In-Ukraine-Up-By-1170-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Since the full-scale invasion of Ukraine, Russian forces are believed to have lost 599,350 personnel killed or wounded, including 1,170 in the past 24 hours.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nNo Russian warships spotted off Ukraine's coastsThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, Kyiv was targeted in yet another Russian ballistic attack Sunday morning.\nNo casualties were reported."}, {"id": "72028239-43e2-4c60-8d86-bc3602fcc8c4", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 13:45", "url": "https://www.stripes.com/theaters/europe/2024-08-18/ukraine-troops-two-bridges-14899954.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A strategically important bridge over the river Seym is destroyed by Ukrainian troops as they continue their incursion into the Kursk region, Russia, Friday, Aug. 16, 2024.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "608aef1b-3398-4823-b1e8-750493db8e1a", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 14:00", "url": "https://www.kob.com/news/us-and-world-news/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to-stay/", "domain": "kob.com", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIn this photo taken from video released by the Russian Defense Ministry on Sunday, Aug. 18, 2024, Russian soldiers fire Giatsint-S self-propelled gun towards Ukrainian positions at an undisclosed location in the Russian - Ukrainian border area in the Kursk region, Russia.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "60b9bc04-ccd3-4724-881d-e6cc4b746793", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay", "date": "2024-08-18 13:00", "url": "https://www.theweek.in/wire-updates/international/2024/08/18/fgn29-ukraine-russia-ld-bridges.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nHe said Ukrainian air defenses struck down all targets fired in both attacks on the city on Sunday morning."}, {"id": "3cfa61d9-b847-4e2c-a0bb-d7a8009317e1", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 14:00", "url": "https://www.clickorlando.com/news/world/2024/08/18/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to-stay/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "what is said to show the destruction of a key bridge in Russia's Kursk region.\nRecommended VideosLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "c5c51d8f-9bdf-4b14-908f-932cf73fdd02", "title": "Bradford film highlights British soldier graves in Malakand | Bradford Telegraph and Argus", "date": "2024-08-18 08:30", "url": "https://www.thetelegraphandargus.co.uk/news/24521308.bradford-film-highlights-british-soldiers-graves-malakand/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "But nestled among the wild shrubs are crosses and old gravestones, bearing the names of more than 100 British soldiers.\nAt least 2,000 Pakistani tribesmen and 233 British soldiers were killed in the conflict.\n“The relevance of this area to British history is very important, but most people don’t know anything about it.\n“The tribes people looking after this site are very poor Pakistani Pashtoons who, for 127 years, have respected those soldiers’ graves.\nThat shows respect and tolerance and it makes me very proud of them.”* Watch Forgotten British Soldiers Graveyard Pakistan at youtu.be/R_fnPo0SA-g?si=r6WhZSBlUY9twSsK"}, {"id": "c9723491-9e36-437f-ae2e-6a2115202b55", "title": "", "date": "2024-08-18 13:45", "url": "http://www.israelnationalnews.com/news/394788", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Though significant, connections between Palestinian Arab statehood and nuclear war remain generally ignored.\nFor Israel, the seemingly discrete perils of war with Iran and Palestinian Arab statehood are potentially intertwined and mutually reinforcing.\nFor the moment, there is no law-based Palestinian state (i.e., no Palestinian Arab satisfaction of authoritative requirements delineated at the Montevideo Convention of 1934).\nTo be sure, Iran’s leaders are unconcerned about Palestinian Arab well-being per se, but even a continuously faux commitment to Palestinian statehood would strengthen their overall power position.\nFor Israel, nuclear weapons, doctrine and strategy will remain essential to national survival."}, {"id": "5323a025-ed77-478f-a356-fad5844fead5", "title": "British Defence working  24 hours a day  to arm Ukraine for Russia push | World | News", "date": "2024-08-18 06:30", "url": "https://www.express.co.uk/news/world/1937386/britain-mod-arming-ukraine-russia-war", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Exhausted UK technicians in Germany have been ordered to \"keep the ammo flowing \" to support Ukraine's effort in Russia.\nAnd on Friday Russia's foreign ministry said Ukraine had used Western rockets to destroy a bridge over the Seym river in the Kursk region.\nBut London is also providing vital munitions, small arms and complex weapons systems for the effort, which has caught Moscow off-guard and boosted Kyiv’s leverage.\nA “rolling conveyor belt” of military convoys is said to be trundling its way from a British depot in Germany to Ukraine.\nThis accompanied anti-tank missiles, artillery guns, air defence systems, armoured fighting vehicles, anti-structure munitions, and three M270 long-range multiple launch rocket systems."}, {"id": "679e414e-0e4d-406e-921d-3836750ecae9", "title": "Russian attack on 18 August : Ukrainian forces destroy 2 ballistic missiles , 3 cruise missiles and 8 Shahed UAVs", "date": "2024-08-18 10:45", "url": "https://www.yahoo.com/news/russian-attack-18-august-ukrainian-063342122.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces launched 16 aerial targets on Ukraine on the night of 17-18 August.\nUkrainian air defence units have destroyed 13 of them: 2 ballistic missiles, 3 cruise missiles and 8 kamikaze drones.\nSource: Lieutenant General Mykola Oleshchuk, Commander of Ukraine's Air Force, on TelegramDetails: The Russians targeted Ukraine with ballistic missiles from Kursk and Voronezh oblasts, cruise missiles and air-to-ground missiles and Shahed-type loitering munitions from Russia's Kursk Oblast on the night of 17-18 August 2024.\nUkrainian air surveillance troops detected a total of 16 Russian aerial targets:- 1 Iskander-M ballistic missile;- 2 KN-23 ballistic missiles;- 2 Kh-59 air-to-ground missiles;- 3 cruise missiles (type to be specified);- 8 Shahed-131/136 loitering munitions.\nOleshchuk added that the missiles not accounted for in the statistics of those shot down did not reach their intended targets."}, {"id": "293eb698-d205-4d62-a7a7-e4bce8021e81", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 13:00", "url": "https://www.smdailyjournal.com/news/world/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to/article_1b0d7d6a-79a5-5c5e-a823-9e8042980751.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "11865513-caa3-44f4-8a6a-912b26d4e792", "title": "10 fantasy anime that every Lord of the Rings fan should watch | English Movie News", "date": "2024-08-18 08:00", "url": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/10-fantasy-anime-that-every-lord-of-the-rings-fan-should-watch/articleshow/112603455.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Luckily, the anime world offers a treasure trove of fantasy tales that echo the epic journeys and grand battles found in Middle-earth.\nAfter an untimely death, Kazuma Satou is reincarnated in a fantasy world where he’s joined by a quirky party of adventurers.\nLike The Lord of the Rings, this anime explores the themes of destiny, redemption, and the passage of time, all within a beautifully crafted fantasy world.\nThe series follows a group of adventurers as they battle dark forces threatening the land of Lodoss.\nThe series offers a contemplative look at what happens after the epic adventure ends, making it a unique and thought-provoking experience for fantasy fans."}, {"id": "9aae8809-f867-4012-9c4e-5a34533c82f9", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 12:45", "url": "https://isp.netscape.com/news/world/story/0001/20240818/43d6579c82c24ffc5cfabd99d07c66db", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Ukrainian troops have struck 2 key bridges in Russia's Kursk area.\nUkraine’s air force chief, Lt. Mykola Oleshchuk, on Friday released a video of a Ukrainian airstrike that split the bridge in two.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "70a46170-0307-45a8-89b7-ae01be3cccb2", "title": "Ukrainian forces target second key bridge in Russian incursion", "date": "2024-08-18 13:45", "url": "https://www.dorsetecho.co.uk/news/national/24525787.ukrainian-forces-target-second-key-bridge-russian-incursion/", "domain": "dorsetecho.co.uk", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Mr Oleshchuk and the Russian regional governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIf confirmed, the Ukrainian strikes would further complicate Moscow’s attempts to replenish its forces in Kursk and evacuate civilians.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "1dfc47a3-4386-4eca-9bc4-ef909d131262", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 14:00", "url": "https://www.whec.com/national-world/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to-stay/", "domain": "whec.com", "domain_classification": "Unknown", "message": "Less than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nIn this photo taken from video released by the Russian Defense Ministry on Sunday, Aug. 18, 2024, Russian soldiers fire Giatsint-S self-propelled gun towards Ukrainian positions at an undisclosed location in the Russian - Ukrainian border area in the Kursk region, Russia.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "430ad803-afa0-4623-adac-8f9ebd8cd806", "title": "What the papers say – August 18", "date": "2024-08-18 01:00", "url": "https://www.edp24.co.uk/news/national/24525375.papers-say---august-18/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "6c936391-b1d3-47dc-9aba-0b893cb4054f", "title": "What the papers say – August 18", "date": "2024-08-18 05:00", "url": "https://www.bournemouthecho.co.uk/news/national/24525375.papers-say---august-18/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "c8dddb92-f06b-410e-bffe-b9b56861f836", "title": "What the papers say – August 18", "date": "2024-08-18 01:45", "url": "https://www.theargus.co.uk/news/national/24525375.papers-say---august-18/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "007c3e4c-8e00-40c9-97fa-db133908c061", "title": "What the papers say – August 18", "date": "2024-08-18 01:00", "url": "https://www.echo-news.co.uk/news/national/24525375.papers-say---august-18/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "a5bf3005-8048-4e16-b195-0619fae6757f", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? ", "date": "2024-08-18 13:30", "url": "https://www.durangoherald.com/articles/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to-stay/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "Ukraine’s air force chief, Lt. Mykola Oleshchuk, on Friday released a video of a Ukrainian airstrike that split the bridge in two.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "d94f9bec-e492-4de9-b83f-289557575f78", "title": "What the papers say – August 18", "date": "2024-08-18 02:15", "url": "https://www.eadt.co.uk/news/national/24525375.papers-say---august-18/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "9448fea8-c0eb-4f38-aee9-e9625410dfff", "title": "What the papers say – August 18", "date": "2024-08-18 02:00", "url": "https://www.kentonline.co.uk/news/national/what-the-papers-say-august-18-125632/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "What the papers say – August 18 (PA)Domestic politics and Labour’s future plans feature heavily across Sunday’s newspaper front pages.\nThe Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "e86371d8-e606-49e4-a03b-5ff6cb25dce7", "title": "What the papers say – August 18", "date": "2024-08-18 01:00", "url": "https://www.ipswichstar.co.uk/news/national/24525375.papers-say---august-18/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "9ddf72ca-21ad-4f5c-8cc0-f851ad53e19f", "title": "What the papers say – August 18", "date": "2024-08-18 03:15", "url": "https://www.yorkpress.co.uk/news/national/24525375.papers-say---august-18/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "130834d0-b139-451c-bd3f-8b960801186c", "title": "What the papers say – August 18", "date": "2024-08-18 04:45", "url": "https://www.theboltonnews.co.uk/news/national/24525375.papers-say---august-18/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "833ed85c-05e7-4920-a8e4-3f49a5093314", "title": "Dricus Du Plessis Beat Israel Adesanya Physically and Mentally at UFC 305", "date": "2024-08-18 08:15", "url": "https://bleacherreport.com/articles/10132289-dricus-du-plessis-beat-israel-adesanya-physically-and-mentally-at-ufc-305", "domain": "bleacherreport.com", "domain_classification": "Unknown", "message": "Jeff Bottari/Zuffa LLCDricus Du Plessis is still the UFC middleweight champion, having beaten Israel Adesanya physically and mentally in one of the fiercest grudge matches in recent memory.\n\"I came here to die with this belt,\" Du Plessis told commentator Daniel Cormier shortly after Adesanya's tap-out.\nJeff Bottari/Zuffa LLC\"At this level, it's hard to get people down,\" Du Plessis said.\nAs for Du Plessis, there's still plenty of work to be done.\nAs far as Du Plessis is concerned, however, the opponent doesn't matter."}, {"id": "86dfc26b-3935-431e-abaf-3a64cf4d7665", "title": "US - based think - tank calls for establishing international administration in S Sudan", "date": "2024-08-18 05:15", "url": "https://www.radiotamazuj.org/en/news/article/us-based-think-tank-calls-for-establishing-international-administration-in-s-sudan", "domain": "radiotamazuj.org", "domain_classification": "Unknown", "message": "An American think-tank has published a report calling for an international transitional administration established by the United Nations and the African Union to be placed over South Sudan.\nThe report pointed out that the civil war left South Sudan on the cusp of full-scale genocide, with its sovereignty discredited by warring elites.\nShe explained that the proposed international transitional administration would not necessitate an investment costlier than what the United States is already spending—more than $2 billion since 2013 (and more than $11 billion since 2005).\nKnopf noted that similar efforts have previously succeeded in Bosnia and Herzegovina, Kosovo, East Timor, Cambodia, and Liberia.\nThe author emphasized that brokering such a transition will require committed diplomacy by the United States in close partnership with African governments."}, {"id": "66f28a53-440f-4716-a509-b8cc2c7ebc60", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? - LocalNews8 . com", "date": "2024-08-18 14:00", "url": "https://localnews8.com/news/2024/08/18/ukrainian-troops-have-struck-2-key-bridges-in-russia-could-it-mean-theyre-there-to-stay/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Ukraine’s air force chief, Lt. Mykola Oleshchuk, on Friday released a video of a Ukrainian airstrike that split the bridge in two.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "4339e90a-6e0f-4b1e-97dc-d844ed5fbbd0", "title": "Other voices : Kyiv hits back against Putin", "date": "2024-08-18 12:15", "url": "https://www.twincities.com/2024/08/18/other-voices-kyiv-hits-back-against-putin/", "domain": "twincities.com", "domain_classification": "Unknown", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone."}, {"id": "a872d78f-4f8e-4502-9301-52efa4c0cbaa", "title": "Phone taps , sabotage and an assassination plot : Is Germany in Cold War 2 . 0 ? ", "date": "2024-08-18 01:00", "url": "https://www.bbc.com/news/articles/clyn8vk4g42o", "domain": "bbc.com", "domain_classification": "International", "message": "Phone taps, sabotage and an assassination plot: Is Germany in Cold War 2.0?\nAs a hot war rages between Russia and Ukraine, there are fears that Europe has slipped into a new Cold War.\n“In some way, we’re in the early Cold War – the Fifties and Sixties, so a much rawer time.” But what does a rekindled Cold War look like for Europe’s biggest economy and a country that was once itself cut in half by the Iron Curtain?\nSo as Cold War comparisons hover over European security, the politics of that period has also renewed itself in Germany in a stark and unexpected way.\nRoman Chop/Global Images Ukraine Ukraine has reportedly used German-built Marder fighting vehicles like this on Russian territory"}, {"id": "797b8e5a-c5fc-4b1e-b3d5-a17a9c258191", "title": "FARK . com : Fark Video Player ( 13361302 ) I say Whippet . Whippet good", "date": "2024-08-18 05:30", "url": "https://www.fark.com/vidplayer/13361302", "domain": "fark.com", "domain_classification": "Unknown", "message": "If you can read this, either the style sheet didn't load or you have an older browser that doesn't support style sheets.\nMainDiscussionSportsBusinessSTEMEntertainmentFandomD'awwwFoodPoliticsWhippet - Fast and Furious 1918 | Tank Chats ReloadedWas the British Medium Mk A Whippet the World's first proper tank?\nAble to do 8mph, but incredibly difficult to drive, Whippet was far faster than the British Heavy Tanks of WW1.\nUsing their speed, Whippets were able to operate behind the enemy front line to destroy enemy formations and create chaos.\n09:36 | The Tank Corps' Surprise11:41 | Proving Its Worth16:25 | Armoured Warfare RevolutionisedThis video features archive footage courtesy of British Pathé."}, {"id": "e2c0f6cc-9810-446b-9ef6-946da5a02a05", "title": "Vietnam War Veteran receives Purple Heart and service medals decades after retirement from service", "date": "2024-08-18 02:00", "url": "https://www.swoknews.com/news/vietnam-war-veteran-receives-purple-heart-and-service-medals-decades-after-retirement-from-service/article_88799e93-fa0c-5311-9cfd-dd4b8f9bb905.html", "domain": "swoknews.com", "domain_classification": "Unknown", "message": "Current Print Subscribers will be prompted to either login to their current site user account or to create a new one.\nA confirmation email will be sent when a new user account is created, which must be confirmed within three days in order to provide uninterrupted online access through your Print Subscription.\nOnce the email address is confirmed please provide your Account Number to activate your Print Subscription Service."}, {"id": "1c253455-e76d-46ed-8f3a-e98bd6601897", "title": "With Harris at helm , Democrats meet with new hope and some old worries", "date": "2024-08-18 12:30", "url": "https://www.marketscreener.com/news/latest/With-Harris-at-helm-Democrats-meet-with-new-hope-and-some-old-worries-47679439/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"This has been an historic transformation,\" said Joseph Foster, a 71-year-old former Democratic Party chairman in the Philadelphia suburbs who remains active in the party.\nWith less than 80 days to go to Election Day, the party is hoping to ride that wave of enthusiasm to victory.\nThat would make Harris, the first Black person and person of Asian descent to serve as vice president, the nation's first female president.\nHarris' historic personal story is \"lovely and fine, but it's the issues that are going to ultimately decide this election.\nBiden endorsed Harris and she quickly won the party's support."}, {"id": "9bfd5fb5-f19c-4de6-ab95-516dce668447", "title": "With Harris at helm , Democrats meet with new hope and some old worries", "date": "2024-08-18 13:45", "url": "https://www.businesstimes.com.sg/international/harris-helm-democrats-meet-new-hope-and-some-old-worries", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "IN THE five weeks since US President Joe Biden abandoned his flailing re-election bid, the Democratic Party’s fortunes have changed dramatically, and this week the change will be on full display.\nHistoric transformation“This has been a historic transformation,” said Joseph Foster, a 71-year-old former Democratic Party chairman in the Philadelphia suburbs who remains active in the party.\nHarris’ historic personal story is “lovely and fine, but it’s the issues that are going to ultimately decide this election.\nThe jump in enthusiasm among independents went from 34 per cent in June to 53 per cent in the latest poll.\n“It’s a coin flip,” she said of the race between Harris and Trump."}, {"id": "ebaba6a9-0cde-451b-b704-62432cc8af6f", "title": "What the papers say – August 18", "date": "2024-08-18 03:15", "url": "https://jerseyeveningpost.com/morenews/uknews/2024/08/18/what-the-papers-say-august-18-7/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Domestic politics and Labour’s future plans feature heavily across Sunday’s newspaper front pages.\nThe Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "e11cc6a0-72ad-4c7c-833e-ff21ffb7f95d", "title": "With Harris at helm , Democrats meet with new hope and some old worries", "date": "2024-08-18 10:45", "url": "https://gazette.com/news/us-world/with-harris-at-helm-democrats-meet-with-new-hope-and-some-old-worries/article_c1d7f236-1ede-57fe-a23d-127fc2221e81.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "\"This has been an historic transformation,\" said Joseph Foster, a 71-year-old former Democratic Party chairman in the Philadelphia suburbs who remains active in the party.\nWith less than 80 days to go to Election Day, the party is hoping to ride that wave of enthusiasm to victory.\nThat would make Harris, the first Black person and person of Asian descent to serve as vice president, the nation's first female president.\nHarris' historic personal story is \"lovely and fine, but it's the issues that are going to ultimately decide this election.\nBiden endorsed Harris and she quickly won the party's support."}, {"id": "6929befa-f377-4032-bda3-c5686f20a9e7", "title": "What the papers say – August 18", "date": "2024-08-18 05:00", "url": "https://www.eveningnews24.co.uk/news/national/24525375.papers-say---august-18/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "The Mail on Sunday reports the Prime Minister’s dealings with unions over pay rises could cost the Government up to £14 billion.\nThe Sunday Express reports Chancellor Rachel Reeves “buried” a report detailing the consequences of culling fuel payments for some pensioners.\nWork and Pensions Secretary Liz Kendall says Labour will end the “blame culture” surrounding people out of work, according to The Observer.\nOBSERVER: It’s time to end blame culture over benefits bill : minister #TomorrowsPapersToday pic.twitter.com/TRhVAasdrO — Neil Henderson (@hendopolis) August 17, 2024The Sunday Telegraph says extreme misogyny could be treated like terrorism under new Government plans.\nThe Sunday Mirror alleges Premier League star Kyle Walker is ready for a court battle with his former mistress Lauryn Goodman over harassment."}, {"id": "9ef2e8ba-6f29-42d7-94bf-fcd32bf8aed5", "title": "Ukrainian troops have struck 2 key bridges in Russia . Could it mean theyre there to stay ? | iNFOnews", "date": "2024-08-18 14:00", "url": "https://infotel.ca/newsitem/eu-russia-ukraine-war/cp1412256646", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Ukrainian troops have struck 2 key bridges in Russia's Kursk area.\nwhat is said to show the destruction of a key bridge in Russia's Kursk region.\nLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional governor, Alexei Smirnov.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic.\nUkraine has repeatedly alleged that Russia plans to stage an attack and blame Ukrainian forces."}, {"id": "4a032f22-c34f-4866-bd64-35e8049d808a", "title": "America Is the World Only Aircraft Carrier  Superpower  ", "date": "2024-08-18 05:30", "url": "https://nationalinterest.org/blog/buzz/america-worlds-only-aircraft-carrier-superpower-208903", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "-Notably, the first U.S. carrier was USS Langley, commissioned in 1922, while USS Enterprise became the first nuclear-powered carrier in 1961.\nU.S. Navy Dominates with Over a Third of the World’s Aircraft CarriersIncluding amphibious assault ships (LHA), there are now 47 active aircraft carriers in the world, operated by fourteen navies.\nThe First Aircraft CarrierConverted from the collier USS Jupiter, USS Langley (CV-1, later AV-3) became the U.S. Navy's first aircraft carrier when she was commissioned in March 1922.\nDuring the Second World War, 155 aircraft carriers were constructed, including 122 escort carriers.\nFirst Nuclear CarrierCommissioned at Newport News, Virginia on November 25, 1961, USS Enterprise (CVN-65) became the first nuclear-powered aircraft carrier to enter service."}, {"id": "04b689fd-7373-4e72-af9b-d9dc1e26b10a", "title": "Khamenei Ups the Ante , Says Iran Has to Strike Israel or Face a Bigger Foe ( Not the U . S .) ", "date": "2024-08-18 02:45", "url": "https://pjmedia.com/robert-spencer/2024/08/17/khamenei-ups-the-ante-says-iran-has-to-strike-israel-or-face-a-bigger-foe-not-the-us-n4931738", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "Is Iran going to strike hard at Israel, or not?\nJust hours after Haniyeh was killed, Iran’s Supreme Leader, the Ayatollah Khamenei, ordered what the New York Post called “a direct strike” on Israel.\nHe is now even claiming that Allah will be angry if Iran doesn’t hit Israel.\nMeanwhile, the Biden-Harris regime has worked to betray Israel in numerous other ways.\nIt’s much more likely that they will see the Biden-Harris regime as weak and contemptible and press forward more aggressively than ever."}, {"id": "3b0af794-2922-448b-a374-20b9c42df3ff", "title": "Trump Spends Rally Whining About Biden Exit , Harri Magazine Cover", "date": "2024-08-18 03:15", "url": "https://www.rollingstone.com/politics/politics-news/trump-rally-biden-harris-time-magazine-pennsylvania-dnc-1235082447/", "domain": "rollingstone.com", "domain_classification": "Unknown", "message": "During Saturday’s rally, he still called Biden “crooked,” but he also went off teleprompter to claim that Biden “hates [Harris].\nI'm a better looking person than Kamala.\npic.twitter.com/OdNA3mdtxj — Acyn (@Acyn) August 17, 2024Beyond his direct attacks on Harris, he also claimed that the “country is going to die” should he not be reelected.\npic.twitter.com/P19MGhs1x6 — Acyn (@Acyn) August 17, 2024It was his seventh visit to the battleground state this year, and his second in Pennsylvania since he was shot and wounded in Butler.\nTrump and Harris will also face-off in the state during their first debate on Sept. 10 in Philadelphia."}, {"id": "6dc4e87c-81b3-4161-8a65-0a42f2e768c2", "title": "This M * A * S * H Episode Proved That Sitcoms Can Break Our Hearts", "date": "2024-08-18 08:30", "url": "https://filmschoolrejects.com/mash-episodes-sometimes-you-hear-the-bullet/", "domain": "filmschoolrejects.com", "domain_classification": "Unknown", "message": "This time she’s revisiting an early M*A*S*H episode that showed just how much the classic sitcom was willing to blend comedy with deeply felt drama.\nDespite its rebellious spirit, early M*A*S*H aimed to amuse above all else — until, suddenly, it didn’t.\nWe don’t know much about Tommy, but what we do know reveals that he’s as gleefully counter-cultural as his best pal.\nM*A*S*H is full of gay jokes, but in a move that’s surprising for its time, they’re often more winking than homophobic.\n“Do you?”“Sometimes You Hear The Bullet” is the first of countless emotional gut checks M*A*S*H would deliver over the years."}, {"id": "38301394-69eb-49b5-bd89-68f60862232f", "title": "Firefighters continue to battle five wildfires in Turkey", "date": "2024-08-18 13:15", "url": "https://www.euronews.com/my-europe/2024/08/18/firefighters-continue-to-battle-hundreds-of-wildfires-in-turkey", "domain": "euronews.com", "domain_classification": "Unknown", "message": "By Euronews with APPortugal has also sent a special task force to Madeira to help fight a fire burning on the island since Wednesday.\nADVERTISEMENTFirefighters in Turkey were continued to battle five blazes burning for a fourth day on Sunday in several areas across the country’s west.\nFirefighters extinguished on Friday a blaze in Canakkale province that threatened World War I memorials and graves at the Gallipoli battle site.\nImages of the site in northwest Turkey showed soot-blackened gravestones in a scorched garden looking out over the Aegean Sea.\nPortugal fighting blaze on Madeira islandLisbon is sending a special force of 80 firefighters to the Autonomous Region of Madeira to fight a fire that has been raging for three consecutive days."}, {"id": "2867da0d-cb62-49a4-97fa-5424d6aed6f3", "title": "Multiple generations of Mainers explore and fight through fantasy worlds", "date": "2024-08-18 09:00", "url": "https://www.pressherald.com/2024/08/18/multiple-generations-of-mainers-explore-and-fight-through-fantasy-worlds/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Thad Bailey, playing a feathery half-raptor half-human mutant, rushed to a gray two-story tower made of plywood.\nFrom the second story, Bailey had the perfect vantage point to aim a small brown Nerf pistol at the intruders.\nStaffers, or non-playing characters, jump into roles multiple times at a gathering to help move the story along.\nConnor, who grew up playing at both Maine venues, said that games at MASI involve more exploration because the property is so vast.\nNoah Hersom, one of the founders of Burgundar, said that playing at MASI motivated him to acquire the Burgundar property."}, {"id": "c5756e71-ffcd-4409-a050-70c0f6c5e4c7", "title": "Shooter twice opens fire at Joint Base San Antonio - Lackland – NBC4 Washington", "date": "2024-08-18 03:15", "url": "https://www.nbcwashington.com/news/national-international/shooter-twice-opens-fire-joint-base-san-antonio-lackland/3696588/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“After this incident, the security personnel added more armed guards as a precaution.”We're making it easier for you to find stories that matter with our newsletter The 4Front.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "71e09391-6785-46b0-947d-bc6c0705bd46", "title": "Shooter twice opens fire at Joint Base San Antonio - Lackland – NBC 7 San Diego", "date": "2024-08-18 06:45", "url": "https://www.nbcsandiego.com/news/national-international/shooter-twice-opens-fire-joint-base-san-antonio-lackland/3600073/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“After this incident, the security personnel added more armed guards as a precaution.”Get top local stories in San Diego delivered to you every morning.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "7181ff3e-719f-4391-8ee7-a3b034191c00", "title": "Airman deployed to  undisclosed location  dies in non - combat incident", "date": "2024-08-18 09:45", "url": "https://www.marinecorpstimes.com/news/your-air-force/2024/08/17/airman-deployed-to-undisclosed-location-dies-in-non-combat-incident/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "An airman deployed to the U.S. Central Command area of operations died Thursday in a non-combat incident, Air Force officials confirmed.\n“Tristen was a force for good within the 27 SOLRS and beyond,” Air Force Maj. Brent Escay, 27th SOLRS commander, said in a release.\nHe’d been serving as a material management specialist with the 27th SOLRS since 2019.\nHis family and friends remain in our thoughts and prayers.”Wright had previously deployed in support of Operations Resolute Support and Inherent Resolve, according to an Air Force release.\nHis awards include the U.S. Air and Space Force Commendation Medal, the U.S. Air Force Achievement Medal with two oak leaf clusters and “C” devices, the Global War on Terrorism Medal, the Air Force Good Conduct Medal with one oak leaf cluster and the National Defense Service Medal."}, {"id": "c6136de0-0a17-4ba3-ad1e-dde44b192c6f", "title": "Shooter twice opens fire at Joint Base San Antonio - Lackland – NBC Bay Area", "date": "2024-08-18 05:45", "url": "https://www.nbcbayarea.com/news/national-international/shooter-twice-opens-fire-joint-base-san-antonio-lackland/3628212/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“After this incident, the security personnel added more armed guards as a precaution.”A vehicle later stopped near the same entrance shortly after 4:30 a.m., Moscoso said.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "35099231-a7c6-40d2-8e3e-f90e465cf768", "title": "Shooter twice opens fire at Joint Base San Antonio - Lackland – NBC Connecticut", "date": "2024-08-18 03:00", "url": "https://www.nbcconnecticut.com/news/national-international/shooter-twice-opens-fire-joint-base-san-antonio-lackland/3365337/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“After this incident, the security personnel added more armed guards as a precaution.”Get top local stories in Connecticut delivered to you every morning.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "723e45ab-539c-4529-8ba1-e93188530329", "title": "Multiple generations of Mainers explore and fight through fantasy worlds", "date": "2024-08-18 09:45", "url": "https://www.centralmaine.com/2024/08/18/multiple-generations-of-mainers-explore-and-fight-through-fantasy-worlds/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "Thad Bailey, playing a feathery half-raptor half-human mutant, rushed to a gray two-story tower made of plywood.\nFrom the second story, Bailey had the perfect vantage point to aim a small brown Nerf pistol at the intruders.\nStaffers, or non-playing characters, jump into roles multiple times at a gathering to help move the story along.\nConnor, who grew up playing at both Maine venues, said that games at MASI involve more exploration because the property is so vast.\nNoah Hersom, one of the founders of Burgundar, said that playing at MASI motivated him to acquire the Burgundar property."}, {"id": "45a8b944-224d-41d9-8826-d27d25ea7748", "title": "Shooter twice opens fire at Joint Base San Antonio - Lackland – NBC 6 South Florida", "date": "2024-08-18 05:45", "url": "https://www.nbcmiami.com/news/national-international/shooter-twice-opens-fire-joint-base-san-antonio-lackland/3394792/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“After this incident, the security personnel added more armed guards as a precaution.”The Hurricane season is on.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "07bc644a-b346-47a6-aace-b9a855aaad2c", "title": "Shootings reported at Joint Base San Antonio - Lackland", "date": "2024-08-18 02:15", "url": "https://www.newschannel5.com/us-news/military/shootings-reported-at-joint-base-san-antonio-lackland-between-guards-and-passing-vehicle", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“It was an off-base shooting from a passing vehicle that fired shots towards the gate, prompting our security forces to respond,” base spokesperson Stefanie Antosh said in a statement.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "4bcc14c5-bdd3-406e-8919-d049465a5778", "title": "Ukraine says struck second key bridge in Russia Kursk region", "date": "2024-08-18 13:00", "url": "https://www.thehindu.com/news/international/ukrainian-troops-have-struck-2-key-bridges-in-russias-kursk-region/article68539585.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Ukraine has destroyed a key bridge in Russia's Kursk region and struck a second one nearby, less than two weeks into its stunning cross-border incursion, disrupting Russian supply routes and possibly signaling that its troops are planning to dig in.\nAlso Read: ​Persisting brutality: On Russia and the Ukraine warLess than two days later, Ukrainian troops hit a second bridge in Russia, according to Oleshchuk and the Russian regional Governor, Alexei Smirnov.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "874cde09-e106-4ac4-9b27-d44a59865a2e", "title": "Shootings reported at Joint Base San Antonio - Lackland", "date": "2024-08-18 01:00", "url": "https://www.10news.com/us-news/military/shootings-reported-at-joint-base-san-antonio-lackland-between-guards-and-passing-vehicle", "domain": "10news.com", "domain_classification": "Unknown", "message": "U.S. Air Force security guards exchanged gunfire with someone who twice opened fire on an entrance to Joint Base San Antonio-Lackland early Saturday, according to a spokesperson for the base.\n“It was an off-base shooting from a passing vehicle that fired shots towards the gate, prompting our security forces to respond,” base spokesperson Stefanie Antosh said in a statement.\n“For a second time, shots were fired at the Air Force security personnel, however, with the additional security personnel present, multiple Air Force personnel returned fire toward the suspect vehicle,” Moscoso said.\nIn addition to Lackland, Joint Base San Antonio includes Randolph Air Force Base and the Army's Fort Sam Houston and the Camp Bulllis training camp.\nIt includes the 37th Training Wing; 149th Fighter Wing; 59th Medical Wing; the Air Force Intelligence, Surveillance and Reconnaissance Agency; 24th Air Force Wing, 67th Network Warfare Wing; the Cryptologic Systems Group; the National Security Agency; and 70 associated units."}, {"id": "c243a4c2-fbff-4974-8a6b-caadd7939094", "title": "Benedict Cumberbatch and Olivia Colman as battling couple in new film | Films | Entertainment", "date": "2024-08-18 13:00", "url": "https://www.express.co.uk/entertainment/films/1937515/benedict-cumberbatch-olivia-colman-war-of-the-roses", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "It's no mystery who Benedict Cumberbatch is Sher-locking lips with.\nThe actor kisses Oscar winner Olivia Colman while filming their new project The Roses, in which they play a warring husband and wife in a very British remake of Hollywood classic The War of the Roses.\nShooting is currently taking place in Devon, with Sherlock star Benedict, 48, and The Crown star Olivia, 50, playing doomed couple Theo and Ivy Rose - complete with sharp thorns.\nSearchlight Pictures, which is making the movie, said: \"Life seems easy for the picture-perfect couple - successful careers, great kids, an enviable sex life.\n\"But underneath the façade of the perfect family is a tinderbox of competition and resentments that's ignited when Theo's professional dreams come crashing down.\""}, {"id": "8ffde423-5501-4c0a-a204-b9e66b8b74dc", "title": "Ukraine strikes 2 bridges in Russia Kursk region , disrupting supply routes", "date": "2024-08-18 12:45", "url": "https://www.scmp.com/news/world/russia-central-asia/article/3274941/ukraine-strikes-two-bridges-russias-kursk-region-disrupting-supply-routes", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Ukraine has destroyed a key bridge in Russia’s Kursk region and struck a second one nearby, less than two weeks into its stunning cross-border incursion, disrupting Russian supply routes and possibly signalling that its troops are planning to dig in.\nAs of Sunday morning, there were no official reports on where exactly the second bridge attack took place.\nRussian Telegram channels claimed that a second bridge over the Seim, in the village of Zvannoe, had been struck.\nA satellite image shows a bridge collapsed over the Seym river in the Glushkovo district, following a Ukrainian strike in the Kursk region, Russia, on August 17, 2024.\nThe Ukrainians drove deep into the Kursk region in several directions, facing little resistance and sowing chaos and panic."}, {"id": "a1777101-a996-46c1-bcd5-9de643672b12", "title": "Review :  Paris  44  offers cinematic account of liberation | Things To Do", "date": "2024-08-18 12:45", "url": "https://www.toronto.com/things-to-do/books/new-book-offers-an-enthralling-cinematic-account-of-the-liberation-of-paris-during-the-second/article_87f00493-32b4-5c5e-9e54-f16dac931ffa.html", "domain": "toronto.com", "domain_classification": "Unknown", "message": "Meanwhile, during the German occupation, Hemingway was holed up in Cuba, finishing his Spanish Civil War novel \"For Whom the Bell Tolls,\" while his wife, intrepid war correspondent Martha Gellhorn, was covering the war from the front.\nOn Bastille Day, July 14, about 150,000 Parisians of all ages, wearing patriotic red, white and blue, filled the streets singing \"La Marseillaise.\"\nLiberated by itself …”The 2nd Armoured Division, led by Leclerc, accompanied by an all-female ambulance unit, was “entirely equipped by the Americans” and charged with liberating Paris.\nThe first of its troops to enter the city were mostly Spanish republicans, refugees from the civil war.\nAs Bishop so affectingly observes, if you walk around a Paris neighbourhood these days, there’s “always a ghost at your shoulder” lighting the way."}, {"id": "4de019ea-fd58-4e48-abfd-b74005eda967", "title": "UK may include fight against misogyny in anti - extremism strategy", "date": "2024-08-18 11:00", "url": "https://www.dailyexcelsior.com/uk-may-include-fight-against-misogyny-in-anti-extremism-strategy/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "LONDON, Aug 18: The UK authorities will review the strategy to combat extremism in order to combat misogyny and may equate its most radical forms with terrorism, The Telegraph newspaper reported.\nAccording to the publication, UK Home Secretary Yvette Cooper ordered a review of the strategy to combat extremism in order to urgently fill the gaps in the Government’s position.\nThe initiative is connected with concerns that opinion leaders who hold misogynistic views allegedly promote such ideas among teenage boys online.\nIt is noted that if the initiative is approved, teachers will probably be required to report students suspected of extreme misogyny to the Prevent program for monitoring and preventing the radicalization of citizens.\nThe newspaper said that the review would be completed in the fall and would form the basis of a new strategy for countering extremism, which the Home Office planned to present early next year."}, {"id": "b24da3cc-714c-494a-ab51-1bfe39516d7a", "title": "Man ends up paying just $14 for $14 , 000 Cartier earrings after brand website made a major blunder", "date": "2024-08-18 07:45", "url": "https://marketrealist.com:443/how-did-a-customer-buy-cartier-earrings-for-just-14/", "domain": "marketrealist.com", "domain_classification": "Unknown", "message": "Man ends up paying just $14 for $14,000 Cartier earrings after brand website made a major blunderThe man came across the treasure scrolling on the internet while using the bathroomGetting a 99% discount from a luxury jeweler like Cartier is something that people can only dream of.\nEarlier this year, Mexican Rogelio Villarreal bagged two Cartier earrings for a miraculous total of $28.\nIn a post on X, Villarreal shared the story of how he got the earrings so cheap.\nThere he noticed that 18-carat rose-gold Clash de Cartier earrings were on sale for just 237 Mexican Pesos or $13.91.\nThe earrings finally arrived on April 26, and Villarreal shared a nice picture of the boxes on X."}, {"id": "a8bcb974-cb31-48dc-95b8-104bca10ea85", "title": "Trump Spends Rally Whining About Biden Exit , Harri Magazine Cover", "date": "2024-08-18 01:15", "url": "https://www.yahoo.com/news/trump-spends-rally-whining-biden-003018550.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "During Saturday’s rally, he still called Biden “crooked,” but he also went off teleprompter to claim that Biden “hates [Harris].\nSo he said he went back to look at the story, and wildly concluded: “I say that I am much better looking than her… I’m a better looking person than Kamala.”Trump: I am much better looking than her.\nI'm a better looking person than Kamala.\npic.twitter.com/OdNA3mdtxj — Acyn (@Acyn) August 17, 2024Beyond his direct attacks on Harris, he also claimed that the “country is going to die” should he not be reelected.\nTrump and Harris will also face-off in the state during their first debate on Sept. 10 in Philadelphia."}, {"id": "cb2e916a-768b-47eb-a1b4-5233ca7b1d90", "title": "Democratic National Convention : Thousands of activists expected in Chicago for democratic convention to call for Gaza ceasefire", "date": "2024-08-18 05:00", "url": "https://timesofindia.indiatimes.com/world/us/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/articleshow/112600938.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "\"The people with power are going to be there,\" said Liz Rathburn, a University of Illinois Chicago student organizer.\n\"People inside the United Center are the people who are going to be deciding our foreign policy in one way or another.\n\"We're going forward, full speed ahead,\" he said.The city has designated a park about a block from United Center for a speakers' stage.\n\"Pro-Palestinian protesters in Chicago have been highly visible, shutting down roads to the airport and staging sit-ins at congressional offices.\nThe 74-year-old now lives in Alabama but plans to come to Chicago to protest the war in Gaza."}, {"id": "7046c1ce-0af0-4e54-8df2-9eec759f9b1e", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 07:15", "url": "https://abcnews.go.com/US/wireStory/thousands-activists-expected-chicago-democratic-convention-call-gaza-112924515", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Thousands of activists are expected to converge in Chicago for the Democratic National Convention, hoping to call attention to abortion rights, economic justice and the war in GazaThousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefireCHICAGO -- Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nActivists sued the city earlier this year, saying restrictions over where they can demonstrate violate their constitutional rights.\nThe convention will draw an estimated 50,000 people to the nation's third-largest city, including delegates, activists and journalists.\nThe 74-year-old now lives in Alabama but plans to come to Chicago to protest the war in Gaza."}, {"id": "fbd7a045-d89f-4e89-939c-00fef9ffffc2", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 07:30", "url": "https://www.ksat.com/news/politics/2024/08/18/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Teresa Crawford)CHICAGO – Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "c42f50c6-fe0a-4368-b4dd-c90360bbaf42", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 07:45", "url": "https://www.clickondetroit.com/news/politics/2024/08/18/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Teresa Crawford)CHICAGO – Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "e3914b52-f7de-43ea-bcb1-e94b54b4b58f", "title": "Nova film We Will Dance Again premiers at National Library - Israel Culture", "date": "2024-08-18 02:00", "url": "https://www.jpost.com/israel-news/culture/article-814848", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The National Library of Israel (NLI) opened its new building a few weeks after October 7 and has continued to operate throughout the conflict, so it’s fitting that it will present the ninth edition of the Docu.Text Festival, the Documentary Film Festival at the NLI, beginning on August 18.\nMore than 360 festivalgoers and staff were killed at the music and dance festival, about one in nine of those attending, and more than 40 were taken hostage, several of whom remain in Hamas captivity.\nThis film, which will be shown on television in Israel in late September on Hot 8, which is one of its producers, will also be widely shown internationally.\nIN ADDITION to dealing with the war, the festival features many films on different aspects of literature, history, and religion, from Israel and around the world.\nCertain films in the festival will be especially appropriate to see at the National Library."}, {"id": "11ad7802-0000-4cec-838e-539c9c56ff57", "title": "Russia reluctant to admit  the enemy is at the gate , treats incursion as natural disaster", "date": "2024-08-18 07:15", "url": "https://www.scmp.com/news/world/russia-central-asia/article/3274918/russia-reluctant-admit-enemy-gate-treats-incursion-natural-disaster", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The Kremlin’s attempt to convey a sense of normality over the Ukrainian incursion is being replicated in state media.\nThe main topic wasn’t Ukraine ’s shock seizure of territory in Russia’s Kursk border region.\nPutin said they would discuss “new technical solutions adopted during the special military operation,” Russia’s euphemism for its war in Ukraine, in a brief televised excerpt.\nAuthorities have also declared a state of emergency in the neighbouring Belgorod region, where officials report mounting cross-border attacks from Ukraine.\nWar-displaced people visit a church in Kursk on August 16, following Ukraine’s incursion into Russia’s Western Kursk region."}, {"id": "fd749319-3d69-430e-85a6-c198f5d2df8e", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 07:00", "url": "https://www.news4jax.com/news/politics/2024/08/18/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "(AP Photo/Teresa Crawford)CHICAGO – Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "514e3b7a-26ca-4108-895d-0a1fe9b44c45", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire – Winnipeg Free Press", "date": "2024-08-18 04:45", "url": "https://www.winnipegfreepress.com/world/2024/08/17/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "CHICAGO (AP) — Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "44557142-b217-4289-b090-52c0fbb88cb7", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 05:30", "url": "https://www.ajc.com/news/nation-world/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/NMA7JW6TXFAJVH6KB2UTA4SRIY/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "dcb049b5-6d96-451f-865c-ff8da53b1cde", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 04:45", "url": "https://www.clickorlando.com/news/politics/2024/08/18/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(AP Photo/Teresa Crawford)CHICAGO – Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "81174b0d-5bb2-47c4-b847-9dae58f447ed", "title": "Dont call yourself a war veteran unless you went to war : Patrick McLaughlin", "date": "2024-08-18 09:45", "url": "https://www.cleveland.com/opinion/2024/08/dont-call-yourself-a-war-veteran-unless-you-went-to-war-patrick-mclaughlin.html", "domain": "cleveland.com", "domain_classification": "Unknown", "message": "CLEVELAND -- I am willing to wager that the Harris campaign did not have a single military veteran involved in the vetting of vice-presidential running mates.\nAny veteran would have easily spotted, upon due diligence, the red flags that are now landmines in the national political hurly-burly.\nThe authors exposed many men who claimed to be Vietnam veterans but never served in the military.\nAlso exposed were many veterans, some who served in Vietnam and some who did not, who claimed falsely of being awarded high-level combat decorations.\nBut that is a part of the legacy of Vietnam, thousands of draft-aged men seeking deferments from military service only to embellish their record years later by claiming to be Vietnam veterans."}, {"id": "1941b770-4d50-41d9-9691-88b7e5437ee7", "title": "Scientists make game - changing discovery after examining newfound ability in tree species :  This could allow us to breed super - carbon capturing cultivars  ", "date": "2024-08-18 11:45", "url": "https://www.yahoo.com/news/scientists-game-changing-discovery-examining-093000260.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Scientists from Jagiellonian University and the University of Cambridge found a new type of wood that offers a viable solution for carbon sequestration.\nAccording to the researchers, tulip tree branches have the ability to capture and store carbon efficiently, providing a way to combat carbon pollution.\nUnlike their hardwood relatives, tulip tree branches have larger microfibrils — long fibers that sit along the cell wall.\nBy studying different trees and their carbon storage capabilities, scientists are helping combat rising global temperatures and extreme weather events.\n\"This could allow us to breed super-carbon capturing cultivars of other, more frequently planted, forestry trees,\" Łyczakowski told Interesting Engineering."}, {"id": "69582d78-fd3a-4c4b-ac07-6d2a34b486b1", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 11:00", "url": "https://www.dailyexcelsior.com/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "Chicago, Aug 18:Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "528c09b2-85db-4191-ac8d-c9fdefeef827", "title": "Ukraine strikes another bridge in Russia Kursk region", "date": "2024-08-18 09:45", "url": "https://article.wn.com/view/2024/08/18/Ukraine_strikes_another_bridge_in_Russias_Kursk_region/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Ukrainian forces have struck another bridge in Russia's Kursk region as they seek to disrupt Moscow's combat operations in the area, Ukraine's air... read full story\"Minus one more bridge.\nThe Air Force aviation continues to deprive the enemy of logistical capabilities with precision air strikes,\""}, {"id": "82874c50-77d5-4310-9b53-cd2a8938dbbc", "title": "Ukraine Says Struck Another Bridge in Russia Kursk Region", "date": "2024-08-18 10:00", "url": "https://www.themoscowtimes.com/2024/08/18/ukraine-says-struck-another-bridge-in-russias-kursk-region-a86059", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "\"Minus one more bridge,\" Ukrainian Air Force Commander Mykola Oleshchuk said on Telegram, publishing an aerial video of a blast tearing through a bridge near the Russian town of Zvannoye.\nUkraine said Sunday it had struck a second key bridge in the Kursk region, seeking to disrupt Moscow's supply routes as Kyiv's unprecedented incursion on Russian soil stretched through its second week.\n⚡️ Ukrainian Air Force Commander Mykola Oleshchuk released a video of an airstrike on a bridge in Russia’s Kursk region.\nRussian forces have been inching towards Pokrovsk for months, taking a string of tiny villages as they seek to reach the outskirts of the city.\n\"In the southeast of the Rostov region, air defenses repelled a drone attack."}, {"id": "dd5fa7a7-5c1e-423b-ab53-cc62cab3381e", "title": "Tolkkinen : Western Minnesota votes against Christian nationalism", "date": "2024-08-18 13:30", "url": "https://www.startribune.com/tolkkinen-western-minnesota-votes-against-christian-nationalism/601119154", "domain": "startribune.com", "domain_classification": "Unknown", "message": "His campaign and subsequent loss, in such a conservative district, in my mind is a further sign of the waning appeal of the Christian right.\nHis need to seek political power to spread his Christian message seems a tacit admission to the failings of the conservative evangelical church.\nIt has lost on two major political fronts, in the Supreme Court approval of same-sex marriage, and in its key galvanizing cause, abortion, as voters in conservative states pass pro-choice measures.\nEven overturning Roe v. Wade has proved a tepid victory, as the number of abortions has risen since then."}, {"id": "3c315919-6106-43a5-b523-b0e6a52f2f42", "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire", "date": "2024-08-18 05:30", "url": "https://www.wsls.com/news/politics/2024/08/18/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "(AP Photo/Teresa Crawford)CHICAGO – Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.\nDemonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority.\nLater, the city agreed to allow demonstrations at a park and a march route closer to the United Center.\nSecurity will be tight, with street closures around the convention center.\nTo combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center."}, {"id": "713b20d6-3969-4e5b-9320-b8d466bd5a35", "title": "Kate and William  enjoy Nerf battle  with George , Charlotte and Louis during fun family day", "date": "2024-08-18 10:45", "url": "https://www.ok.co.uk/royal/kate-william-enjoy-nerf-battle-33486852", "domain": "ok.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up to our free email to get all the latest royal news and picturesSomething went wrong, please try again later.\nDuring what was described as a \"wholesome family day out,\" little Prince Louis was reportedly heard excitedly shouting: \"Nerf or nothing, let's do this!\"\nIt's reported that the Wales family attended The Gone Wild Festival alongside pals last weekend, specifically requesting an energetic, \"high-intensity, non-stop game of Nerf fun\", reports the Express."}, {"id": "25b509da-0881-46e1-a7bf-19ac78b551a5", "title": "No damage and casualties reported in morning missile and drone attack on Kyiv", "date": "2024-08-18 06:45", "url": "https://www.yahoo.com/news/no-damage-casualties-reported-morning-034530759.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "No damage or casualties reported in morning missile and drone attack on KyivThe Russians attacked Kyiv simultaneously with North Korean-made ballistic missiles and attack drones on the morning of 18 August.\nSource: Serhii Popko, Head of Kyiv Military Administration on TelegramQuote: \"This morning, at about 05:00, the enemy used ballistic weapons to launch a missile attack on Kyiv.\nThis is the third ballistic missile attack on the capital in August, with a clear interval of 6 days between the attacks!\nThe preliminary data shows that the ballistic missiles were shot down on approach to the capital.\"\nDetails: Popko also said that almost simultaneously with the ballistic missiles, several Russian attack UAVs were flying towards Kyiv."}, {"id": "b44200c0-a8c2-455a-a978-893e9e71cd74", "title": "X shuts Brazil operations over  censorship  orders : Musk – DW – 08 / 18 / 2024", "date": "2024-08-18 03:15", "url": "https://www.dw.com/en/x-shuts-brazil-operations-over-censorship-orders-musk/a-69970697", "domain": "dw.com", "domain_classification": "International", "message": "A feud between X owner Elon Musk and a Brazilian top court judge has culminated in the platform shutting down its local operations for the staff’s \"safety.\"\nIn April, Moraes had ordered an investigation into Musk, accusing him of \"criminal instrumentalization\" of the platform.\n\"Alexandre de Moraes threatened our legal representative in Brazil with arrest if we do not comply with his censorship orders.\nThe post said X's numerous appeals went unheard at the court while the public was not informed of the orders.\nThe decision to close down local operations was taken to protect the safety of the staff, it said."}, {"id": "a3ed659e-3dc0-4c56-ab46-7172d4fba5e7", "title": "UFC Judge is removed from picking UFC 305 co - main event midway through event after turning in scandalous scorecard", "date": "2024-08-18 09:45", "url": "https://bloodyelbow.com/2024/08/18/ufc-judge-is-removed-from-picking-ufc-305-co-main-event-midway-through-event-after-turning-in-scandalous-scorecard/", "domain": "bloodyelbow.com", "domain_classification": "Unknown", "message": "One judges’ scorecard on last night’s UFC pay-per-view was so outlandish that it cost him his assignment for the co-main event.\nThe call was in direct opposition to the other two judges who had it in favour of Rozenstruik.\nAnd within minutes he had been removed from his assignment for the night’s co-main event between Steve Erceg and Kai Kara-France.\nJudge Howie Booth taken off his assignment at UFC 305Instantly, a decision was made behind the scenes to remove Booth from his position, where he had been assigned to the night’s co-main event.\nBooth’s dismissal was then announced on the broadcast by Jon Anik, who confirmed he was off the co-main event."}, {"id": "dae58752-816c-4752-885e-fcee7d805571", "title": "Courtauld Gallery set to reopen after fire at historic Somerset House", "date": "2024-08-18 05:15", "url": "https://news.sky.com/story/courtauld-gallery-set-to-reopen-after-fire-at-historic-somerset-house-13198979", "domain": "news.sky.com", "domain_classification": "International", "message": "Part of the Somerset House complex is open to the public today despite a fire which damaged the roof of the central London arts venue on Saturday.\nA statement from Somerset House said: \"The safety and well-being of artists, visitors and staff is paramount.\"\nAdvertisementThe neoclassical building was reconstructed nearly 250 years ago after the original Somerset House was demolished after becoming neglected.\nThe original palace was built in 1547 by Edward Seymour, Duke of Somerset, who was later executed at the Tower of London.\nBe the first to get Breaking News Install the Sky News app for free\"I am very pleased that there are no casualties and hope that Somerset House can reopen to visitors as soon as possible.\""}, {"id": "e1df9cd8-7f54-44dc-874d-031a781be50a", "title": "Greg Locke plans to move church amid community noise complaints", "date": "2024-08-18 13:15", "url": "https://www.christianpost.com:443/news/greg-locke-plans-to-move-church-amid-community-noise-complaints.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home News Greg Locke plans to move church amid longstanding community noise complaintsPastor Greg Locke has announced plans to relocate his Global Vision Bible Church in Tennessee following persistent community complaints and legal challenges over noise and zoning violations.\nThe move comes as Locke’s church faces multiple lawsuits, including one from Wilson County alleging that the church has failed to comply with local zoning and stormwater regulations.\nThe lawsuit filed by Wilson County in March 2023 stated that there had been a four-year history of zoning disputes with the church, including unpermitted construction activities and continuous noise complaints from nearby residents.\nAs his national prominence increased, so did attendance at Global Vision Bible Church, attracting visitors from various states on Sundays.\nAt the time, Facebook accused Locke of “promoting a crime.”"}, {"id": "8fffcdc1-f044-4275-b95a-29701751cd02", "title": "Allen Johnson : I have to wonder : What does Donald Trump think of Lawrence Joel ? ", "date": "2024-08-18 14:30", "url": "https://greensboro.com/opinion/column/allen-johnson-i-have-to-wonder-what-does-donald-trump-think-of-lawrence-joel/article_d85f9798-5cd1-11ef-9cd3-e7466a0e0efa.html", "domain": "greensboro.com", "domain_classification": "Unknown", "message": "While on a patrol in Vietnam on Nov. 8, 1965, Joel’s battalion was ambushed by Viet Cong at Bien Hoa.\nAnd yet, like a John Wayne character in a John Ford movie, Joel ignored orders to stay put for his own safety.\nAs a fellow soldier, Spec 4 Randy Eickhoff, provided covering fire, Joel limped on an improvised crutch to tend to ailing comrades.\nShe gets it and she’s a healthy, beautiful woman.”What Trump possibly could have been thinking only he knows.\nIf there were a medal of honor for sheer gall, guess who would be the winner, hands down?"}]