[{"id": "12b80af4-a4e6-43ae-8859-702d64d0f9a1", "title": "Billboard campaign targets Central Bucks , Philadelphia teachers , accusing them of antisemitism", "date": "2024-06-13 20:30", "url": "https://www.inquirer.com/education/central-bucks-philadelphia-teachers-antisemitism-accuracy-in-media-campaign-20240613.html", "domain": "inquirer.com", "domain_classification": "Unknown", "message": "Central Bucks West High School was the site this week of an activist group’s mobile billboard targeting a Spanish teacher accused of antisemitism.\nThe trucks deployed in Philadelphia and Doylestown this week listed web domain names with each teacher’s name; on Wednesday, they routed to the same website, which noted that the U.S. Department of Education is investigating allegations of antisemitism in both the Philadelphia and Central Bucks districts.\nShapiro that reads: “Antisemitism is embedded into Philly and Bucks County schools.\nIn a message to the community Wednesday, Scanlon said Central Bucks did “not condone hate speech of any kind,” referring to a previous statement condemning antisemitism and Islamophobia.\nAbdelwahab’s social media presence has been a source of controversy for months in the district; he runs a business, AragApparel, that sells keffiyah-inspired durags and posts frequently on an associated social media account in opposition to Israel."}, {"id": "e516d56c-4f5d-424e-8b2c-23f8cf5c7b4c", "title": "What Jewish Life Looks Like for Teens From Iceland to Beijing , Where the Jewish Communities Are Small and Antisemitism Is High", "date": "2024-06-13 20:15", "url": "https://www.jewishexponent.com/what-jewish-life-looks-like-for-teens-from-iceland-to-beijing-where-the-jewish-communities-are-small-and-antisemitism-is-high/", "domain": "jewishexponent.com", "domain_classification": "Unknown", "message": "Burgos said meeting Jewish teens from around the world helped him appreciate how different Jewish life looks in each country.\nThe lack of Jewish community in Montenegro has made Kovacevic appreciate the opportunity to attend BBYO events even more.\nOutside the Jewish community, Yang said he has not faced antisemitism in Beijing — though he said he was aware of a stabbing outside the Israeli embassy in October that arrived at a time of high alarm.\n“Only three of my friends came with me in our Jewish community, but many people in Moldova have Jewish roots.”Sinkariova said leaders from the local Jewish community have come to present at school, teaching students about Jewish life and the contributions Jews have made in society.\nIn the days immediately following Russia’s invasion, many Ukrainian Jewish evacuees took refuge in Moldova’s synagogues and Jewish community centers."}, {"id": "a565ddb4-b0cb-4d64-95aa-9e1cfcd7a91b", "title": "9 Asian American Jews speak", "date": "2024-06-13 17:45", "url": "https://forward.com/opinion/466221/asian-american-jews-atlanta-hate-crimes-speak/", "domain": "forward.com", "domain_classification": "Unknown", "message": "In partnership with Rabbi Mira Rivera of Romemu in New York, N.Y., we’ve asked nine Asian American Jewish leaders to share their experiences in this painful time, as well as thoughts on how American Jews can and should offer support to the Asian American community.\nThe Jewish community must stand tall and proud in solidarity with Asian American communities everywhere, and with meaningful recognition of those in our own community who are both Asian and Jewish.\nThe identities, voices and work of Asian Jews must be elevated to more than just a footnote.\nThere are incredible stories out there shared by Asian American Jews, such as through LUNAR: The Jewish-Asian Film Project.\nTo share your own experiences as an Asian American Jew, contact interim opinion editor Talya Zax at [email protected] or opinion intern Zachariah Sippy at [email protected]."}, {"id": "55c9149f-6bba-4bf2-b3de-eee79c7e1f5c", "title": "Columbia Administrators Fire Off Hostile and Dismissive Text Messages , Vomit Emojis During Alumni Reunion Panel on Jewish Life", "date": "2024-06-13 05:45", "url": "https://freebeacon.com/campus/columbia-administrators-fire-off-hostile-and-dismissive-text-messages-vomit-emojis-during-alumni-reunion-panel-on-jewish-life/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "Photos of text messages sent during panel captured by attendee provide a glimpse into administration's attitude toward the plight of Jewish students on campusOn Friday, May 31, alumni descended on Columbia University's Manhattan campus to celebrate their class reunions.\nIn addition to eating and drinking, the festivities included several panel discussions featuring professors and administrators.\nThe administrators expressed skepticism that Jewish students had experienced targeting or discrimination.\nThe messages are not time-stamped, so it is not always clear to what comments from the panel the participants are referring.\nAmong the comments Chang-Kim offered to Kromm and Patashnick: \"This panel is really making the administration look like jokers.\""}, {"id": "dc3e6ffa-c71a-4d73-8ef8-239f9bba53ce", "title": "NY Dem challenging Bowman shares dozens of donors with Republican who sought Santo seat", "date": "2024-06-13 11:30", "url": "https://gothamist.com/news/ny-dem-challenging-bowman-shares-dozens-of-donors-with-republican-who-sought-santos-seat", "domain": "gothamist.com", "domain_classification": "Unknown", "message": "What does a Long Island Republican who ran to replace George Santos have in common with a Westchester Democrat in a solidly blue congressional district?\nThe district Latimer is running in is heavily Democratic and will almost certainly be decided by the June 25 primary.\nThe Latimer campaign declined to comment on the record, though a spokesperson noted he endorsed Suozzi in the Long Island race.\nThe median household income is much higher in the Long Island district that Pilip sought to represent.\nMeanwhile, the district Latimer is vying to represent has a reliably blue electoral track record."}, {"id": "d4b697f3-b7d8-440f-ba41-01f58e76a149", "title": "Speakers , venue pull out of prominent activist group pro - Christian nationalist conference", "date": "2024-06-13 21:45", "url": "https://www.ksat.com/news/texas/2024/06/13/speakers-venue-pull-out-of-prominent-activist-groups-pro-christian-nationalist-conference/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Recommended VideosMultiple speakers and a venue have pulled out of a prominent Texas activist group’s July conference after The Texas Tribune reported on its plans to amplify white nationalist figures and rhetoric.\nIn an email to supporters on Thursday, True Texas Project founder Julie McCarty said that the venue “went back on their agreement” to host the event.\nFormerly known as the NE Tarrant Tea Party, True Texas Project was crucial in the rise of Texas’ ultraconservative movement throughout the 2010s.\n“You’re not going to demographically replace a once proud, strong people without getting blow-back,\" responded her husband, Fred McCarty, who is also a True Texas Project leader.\nKevin Stitt will take the stage at The Texas Tribune Festival, Sept. 5–7 in downtown Austin."}, {"id": "0e6a3638-c31c-45ae-a88a-1bb6656e3ca9", "title": "Speakers , venue pull out of prominent activist group pro - Christian nationalist conference", "date": "2024-06-13 21:30", "url": "https://www.click2houston.com/news/texas/2024/06/13/speakers-venue-pull-out-of-prominent-activist-groups-pro-christian-nationalist-conference/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "Recommended VideosMultiple speakers and a venue have pulled out of a prominent Texas activist group’s July conference after The Texas Tribune reported on its plans to amplify white nationalist figures and rhetoric.\nIn an email to supporters on Thursday, True Texas Project founder Julie McCarty said that the venue “went back on their agreement” to host the event.\nFormerly known as the NE Tarrant Tea Party, True Texas Project was crucial in the rise of Texas’ ultraconservative movement throughout the 2010s.\n“You’re not going to demographically replace a once proud, strong people without getting blow-back,\" responded her husband, Fred McCarty, who is also a True Texas Project leader.\nKevin Stitt will take the stage at The Texas Tribune Festival, Sept. 5–7 in downtown Austin."}, {"id": "014c7f2c-18d9-4f99-9c35-b1babd3db978", "title": "Holocaust survivor :  You have to be hopeful  ", "date": "2024-06-13 10:15", "url": "https://cdapress.com/news/2024/jun/13/holocaust-survivor-you-have-to-be-hopeful/", "domain": "cdapress.com", "domain_classification": "Unknown", "message": "As a young woman growing up in Holland, she survived the Holocaust and went up against the Nazis in the 1940s during World War II.\nThe luncheon was held at the Best Western Plus Coeur d'Alene Inn on what would have been the 95th birthday of Anne Frank.\nAnne Frank died at the age of 15.\nNoble and Zellman, members of Temple Beth Shalom, are the founders of the annual remembrance of the Holocaust at Temple Beth Shalom.\nShe described Anne Frank as happy and smart."}]