[{"id": "921986cb-838a-47e2-a377-bc39cddfe004", "title": "Israeli Strike Kills 1 , Wounds Many East Of Lebanon Tyre - Report", "date": "2024-06-14 06:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-israeli-strike-kills-1-wounds-many-east-of-lebanon-s-tyre-report", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Initial reports indicated that an Israeli airstrike targeted a residential building between the towns of Jannata and Deir Qanoun En Nahr in southern Lebanon, according to Lebanon’s official National News Agency.\nAl Arabiya sources suggest that the building allegedly targeted by the Israel Defense Forces (IDF) in Jannata was rented by Hezbollah.\nAccording to the Lebanese news outlet An-Nahar, several drones were seen above the building during the missile attack.\nThe strike came shortly after Hezbollah claimed launching rockets and weaponized drones at several Israeli military sites in a coordinated attack on the country's north earlier on Thursday.\nHostilities on the Israel-Lebanon border have intensified after the Israeli military on Tuesday carried out a strike in the same district, killing a senior Hezbollah commander."}, {"id": "813622f3-a5b8-4706-93f9-9382b89262a2", "title": "Hezbollah launches massive strikes on Israeli military positions in solidarity with Gaza", "date": "2024-06-14 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240613-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah launches massive strikes on Israeli military positions in solidarity with GazaIran Press TVThursday, 13 June 2024 3:08 PMThe Lebanese Hezbollah resistance forces conducted a series of strikes against Israeli military positions in the northern side of the 1948 occupied territories in response to the ongoing Israeli onslaught against Palestinians in the Gaza Strip.\nThe military media bureau of Hezbollah also published video footages of the Lebanese resistance fighters' earlier attacks on the Israeli al-Raheb and Ramia outposts as well as the Zarit barracks.\nIt also published scenes of retaliatory operations against Meron Air Base and the headquarters of the Northern Command of the Israeli military in the northern part of the occupied lands.\nAccording to the source, Hezbollah struck over 10 military targets, including intelligence targets related to the assassinations of its officials.\nThe Israeli military reported that some 40 rockets crossed the border, many of which were allegedly intercepted by the so-called Iron Dome missile systems, but others impacted, causing at least 15 fires."}, {"id": "6648dd87-bea6-49e7-8579-e12e633a5989", "title": "Suspected Houthi missile strikes ship in Gulf of Aden", "date": "2024-06-14 12:45", "url": "https://www.naharnet.com/stories/en/305888-suspected-houthi-missile-strikes-ship-in-gulf-of-aden", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A suspected attack Thursday by Yemen's Houthi rebels saw a missile strike a ship in the Gulf of Aden, authorities said, the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said, without elaborating.\nThe private security firm Ambrey said a merchant vessel made a radio distress call saying it had been struck by a missile.\nIt added the ship was \"aligned with the Houthi target profile,\" without elaborating.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday."}, {"id": "320c613f-fca6-4299-adca-6301bc47aacd", "title": "Two Lebanese Women Martyred , Dozens Injured in Israeli Air on South Lebanon", "date": "2024-06-14 09:15", "url": "https://english.almanar.com.lb/2131582", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Two Lebanese women lost their lives and 14 people were wounded in an Israeli air strike on a building in Jennata, South Lebanon.\nThe attack sparked fears of retaliation from Hezbollah, with Israeli media warning of unpredictable responses.\nAs rescue teams search for survivors under the rubble, tensions escalate as Hezbollah carried out a significant counterattack in response to the ongoing assaults on Lebanese towns and civilians by the Israeli occupation.\nThe Resistance launched a joint missile and drone attack, targeting multiple Israeli occupation military sites and barracks in a 30-minute operation.\nIsraeli media reported the attack involved 150 rockets, drones, and anti-tank missiles, marking the largest assault since October 7."}, {"id": "7f410664-0432-40ab-98f5-bc6e3845010d", "title": "Hezbollah Launches 215 Rockets , Several Missiles And Drones At Israel After Death Of Sr . Hezbollah Commander", "date": "2024-06-14 15:00", "url": "https://www.oann.com/newsroom/hezbollah-launches-215-rockets-several-missiles-and-drones-at-israel-after-death-of-sr-hezbollah-commander/", "domain": "oann.com", "domain_classification": "Unknown", "message": "A firefighter responds to a fire break out after a Hezbollah rocket attack on Northern Israel on June 13, 2024 in Golan Heights.\nThe attacks targeted several locations in northern Israel, including Rosh Pina, Safed, and Tiberias, where rockets were fired.\nThe attacks did not result in any casualties, although many rocket strikes prompted fires in northern Israel.\nAbdullah was the “most senior” Hezbollah commander whom the IDF reported to have killed during the conflict.\nAccording to Hezbollah, Israel has killed 342 of its members during the current clashes, which have mainly taken place in Lebanon but have also occurred in Syria."}, {"id": "618fd12c-4996-4c71-94fc-9ffc9c112c30", "title": "The Latest | Hezbollah says its intensified attacks show Israel that all - out war would be costly", "date": "2024-06-14 17:15", "url": "https://abcnews.go.com/International/wireStory/latest-hezbollah-intensified-attacks-show-israel-war-costly-111128025", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Two U.S. officials say the American-built aid pier off Gaza's coast will be detached and moved for a second time due to rough seasThe Latest | US-built aid pier will be removed from Gaza coast again due to weather, officials sayThe U.S.-built aid pier will be detached from Gaza’s coast for a second time due to rough seas, two U.S. officials said Friday, raising further questions about the viability of the sea route.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nCurrently:— US-built pier in Gaza is facing its latest challenge — whether the UN will keep delivering the aid— Israelis and Palestinians are hopeful but cautious over the latest cease-fire plan.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.\nThe cease-fire proposal announced by Biden includes those provisions, but Hamas has expressed wariness whether Israel will implement the terms."}, {"id": "45e61885-4643-4e0d-b2a6-48857fe7610c", "title": "Hezbollah fires new barrage at Israel , which vows to hit back", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818434-Hezbollah-fires-new-barrage-at-Israel,-which-vows-to-hit-back", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah fires new barrage at Israel, which vows to hit backWorld World Hezbollah fires new barrage at Israel, which vows to hit backHezbollah group said it had fired waves of rockets and drones at the Israeli army on Thursday.\nThe major attack comes after months of near-daily cross-border fire between the group and the Israeli military since Hezbollah ally Hamas's October 7 attack on Israel triggered the Gaza war.\nThe Israeli army said during the afternoon that about \"40 projectiles were launched toward the Galilee and Golan Heights area\", adding most were intercepted, while some ignited fires.\nThe Israeli army confirmed it carried out the strike that \"eliminated\" Abdallah on Tuesday, describing him as \"one of Hezbollah's most senior commanders in southern Lebanon\".\nA Lebanese military source said he was the \"most important\" Hezbollah commander to have been killed since the start of the war."}, {"id": "d9908460-f4d9-402c-9c27-a86f3507b60f", "title": "Hizbollah Rains Rockets On Israel After Strike Kills Commander", "date": "2024-06-14 04:45", "url": "https://menafn.com/1108331324/Hizbollah-Rains-Rockets-On-Israel-After-Strike-Kills-Commander", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Hizbollah has traded near-daily cross-border fire with Israeli forces since its Palestinian ally Hamas attacked southern Israel on October 7, triggering war in the Gaza Strip.\nThe exchanges have escalated in recent weeks, with Hizbollah stepping up its use of drones to attack Israeli military positions and Israel hitting back with targeted strikes against the fighters.\nThe Israeli forces on Wednesday confirmed it had“eliminated” Taleb Sami Abdallah in a strike the day before on a Hizbollah command centre in southern Lebanon.\nOn Tuesday, Hizbollah said it fired about 50 rockets at Israeli positions in the annexed Golan Heights.\nTens of thousands of people have been displaced on both sides of the border since the violence erupted the day after the Hamas attack on southern Israel."}, {"id": "f91a3aba-800f-4900-a117-3644a13bf58e", "title": "The Latest | Hezbollah says its intensified attacks show Israel that all - out war would be costly", "date": "2024-06-14 17:30", "url": "https://www.local10.com/news/2024/06/14/the-latest-hezbollah-says-its-intensified-attacks-show-israel-that-all-out-war-would-be-costly/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Israel launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nCurrently:— US-built pier in Gaza is facing its latest challenge — whether the UN will keep delivering the aid— Israelis and Palestinians are hopeful but cautious over the latest cease-fire plan.\nUS-built aid pier will be removed from Gaza coast again due to weather, officials sayWASHINGTON — The U.S.-built aid pier will be detached from Gaza’s coast for a second time due to rough seas, two U.S. officials said Friday, raising further questions about the viability of the sea route.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.\nThe cease-fire proposal announced by Biden includes those provisions, but Hamas has expressed wariness whether Israel will implement the terms."}, {"id": "12fa88a9-adbe-4da7-9a30-9b892cca33a8", "title": "Israeli strike kills two people , wounds seven in southern Lebanon", "date": "2024-06-14 12:45", "url": "https://www.yahoo.com/news/israeli-strike-kills-two-people-115824645.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Marwan Naamani/dpaAt least two people were killed and seven others wounded in an Israeli airstrike overnight that hit a house in southern Lebanon, security sources and state media reported on Friday.\nThey added that flying shrapnel from the strike on the targeted Hezbollah base hit and damaged an adjacent residential building, killing the two women.\nMeanwhile, Israeli reportedly shelled some Lebanese villages in southern Lebanon causing fires in some fields.\nThe escalation on the Lebanese-Israel border has raised fears of an all-out war by Israel on Lebanon to halt Hezbollah attacks.\nMarwan Naamani/dpaA view of rubble of destroyed houses caused by Israeli air raids are seen in the Lebanese southern village of Naqura."}, {"id": "f3a35b75-ee00-4324-998a-1a6721892d7c", "title": "The Latest | Hezbollah says its intensified attacks show Israel that all - out war would be costly", "date": "2024-06-14 16:00", "url": "https://www.ksat.com/news/2024/06/14/the-latest-hezbollah-says-its-intensified-attacks-show-israel-that-all-out-war-would-be-costly/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Israel launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nCurrently:— US-built pier in Gaza is facing its latest challenge — whether the UN will keep delivering the aid— Israelis and Palestinians are hopeful but cautious over the latest cease-fire plan.\nUS-built aid pier will be removed from Gaza coast again due to weather, officials sayWASHINGTON — The U.S.-built aid pier will be detached from Gaza’s coast for a second time due to rough seas, two U.S. officials said Friday, raising further questions about the viability of the sea route.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.\nThe cease-fire proposal announced by Biden includes those provisions, but Hamas has expressed wariness whether Israel will implement the terms."}, {"id": "1ddfb1c5-fd08-41fa-a5e9-041577f9a1ad", "title": "Explosion Heard In Kyiv During Air Alert", "date": "2024-06-14 12:30", "url": "https://charter97.org/en/news/2024/6/14/598886/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Explosion Heard In Kyiv During Air Alert 14.06.2024, 7:468,608The cause could be an aeroballistic Kinzhal missile.\nPresumably the air defence forces shot down a high-speed target in Kyiv region.\nWe remind you, about 6:00 a second air alert was announced in Kyiv throughout Ukraine because of the takeoff of a MiG-31 fighter jet.\nLater in the Air forces reported about the high-speed target, which moved in the direction of Kyiv region.\nAround 3:00, a large-scale air alert was declared in Ukraine due to the launch of cruise missiles from enemy bombers."}, {"id": "5974ae43-8d0e-4d77-9534-bf3e7a720065", "title": "Man arrested in connection with three stabbings throughout Charlotte", "date": "2024-06-14 01:30", "url": "https://www.wsoctv.com/news/local/cmpd-arrests-suspect-accused-stabbing-woman-she-left-work/BCHDJ7F4WNGEPCVCMMINDRHVYQ/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e20e6924-33ec-4d62-af5a-ee5ba0ae61e6", "title": "Hezbollah claims biggest attack on Israel since outbreak of Gaza conflict - Xinhua", "date": "2024-06-14 08:30", "url": "https://english.news.cn/20240613/f195ee24eb9a4c59b20511b318dd55c4/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024.\nTuesday's attack hit a house in Jouaiya, killing Abu Talib and three of his companions.\nA Lebanese military source told Xinhua that the Lebanese Army's observation posts on Thursday monitored the launch of about 150 surface-to-surface missiles and about 20 drones from Lebanon towards northern Israel.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah towards Israel in solidarity with Hamas's attack on Israel the day before.\n(Photo by Taher Abu Hamdan/Xinhua)A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024."}, {"id": "0ec5ecce-8a5f-4da1-bf95-03dcfb320bbb", "title": "Gaza : 30 Palestinians killed , 105 injured by Israeli bombings last 24hrs - The Muslim News", "date": "2024-06-14 02:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-30-palestinians-killed-105-injured-by-israeli-bombings-last-24hrs/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): At least 30 people were killed and 105 others were injured in Israeli indiscriminate bombings in Gaza Strip in the last 24 hours, according to the Health Ministry.\nThe Israeli artillery fired shells at Palestinian homes northwest of the Nuseirat camp and Al-Mughraqa area in the central Gaza Strip.\nWAFA correspondent reported that Israeli warplanes targeted a house in the Nafeq Street area of Gaza City with two missiles.\nAn Israeli airstrike on a residential apartment in Gaza City killed seven Palestinians and injured others, including children and women, on Thursday, according to Gaza’s Civil Defense Agency.\nWitnesses also told Anadolu that Israeli artillery continues to shell areas and homes in the Al-Zaytoun neighborhood in southeast of Gaza City."}, {"id": "027866bb-b9d2-4cfd-a5e5-5de60d89f199", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818432-Huthi-missile-attack-severely-injures-sailor-on-cargo-ship:-US-military", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Huthi missile attack severely injures sailor on cargo ship: US militaryWorld World Huthi missile attack severely injures sailor on cargo ship: US militaryTwo cruise missiles launched by Huthi rebels struck a bulk cargo carrier in the Gulf of Aden.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nOn Wednesday, the Huthis struck the Tutor, a Liberian-flagged bulk carrier, southwest of Hodeida.\nCENTCOM later said the Tutor had been struck by a Huthi \"unmanned surface vessel\" that \"caused severe flooding and damage to the engine room\"."}, {"id": "e11970fc-68db-4279-88d2-8b6dc5aff9f4", "title": "Hezbollah shells Kiryat Shmona , Kfar Szold in response to Janata strike", "date": "2024-06-14 12:30", "url": "https://www.naharnet.com/stories/en/305912-hezbollah-shells-kiryat-shmona-kfar-szold-in-response-to-janata-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah attacked Friday Kiryat Shmona and Kfar Szold with dozens of rockets, in response to an overnight strike that killed 2 women and injured several civilians in south Lebanon.\nHezbollah said in a statement it has targeted the two Israeli settlements with Katyusha and Falaq rockets, in response to the strike on Janata that killed and injured civilians.\nThe group later targeted buildings used by Israeli soldiers in Metula in north Israel, also in retaliation to the Janata strike.\nHezbollah vowed to \"increase the intensity, strength, quantity and quality\" of its attacks, after an Israeli strike killed one of its senior commanders.\nIsraeli authorities say at least 15 Israeli soldiers and 11 civilians have been killed."}, {"id": "1571484f-9784-481d-a3ec-67270b3a419d", "title": "Houthi missile strikes set ship ablaze , injure one crew , US military says", "date": "2024-06-14 04:30", "url": "https://interaksyon.philstar.com/politics-issues/2024/06/14/277392/houthi-missile-strikes-set-ship-ablaze-injure-one-crew-us-military-says/", "domain": "interaksyon.philstar.com", "domain_classification": "Unknown", "message": "The Iran-allied Mouths have launched dozens of attacks on international shipping in the Red Sea region since November in solidarity with the Palestinians in the war between Israel and Hamas.\nThree missiles struck the Verbena on Thursday, sparking a fire and damaging the ship, the United Kingdom Maritime Trade Operations (UKMTO) agency said.\nA day earlier, Yemen’s Houthi militants took responsibility for small watercraft and missile attacks that left the Tutor, a Greek-owned cargo ship, taking in water and in need of rescue near Yemen’s Red Sea port of Hodeidah.\nThe Houthi campaign in the Red Sea region has disrupted global shipping, cascading delays and costs through supply chains.\nUKMTO said the master of one of those reported an explosion near the vessel that did not cause any damage or injury."}, {"id": "de383073-f790-49fd-a3bb-5166fd0abbfd", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:15", "url": "https://www.echo-news.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "8de815d6-a354-40fb-8584-04c9e0c45c66", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:15", "url": "https://www.ipswichstar.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "08ee7775-03be-45cf-a1de-f381cd2d353b", "title": "Press TVs news headlines", "date": "2024-06-14 13:00", "url": "http://www.presstv.ir/Detail/2024/06/14/727438/Press-TV-s-news-headlines", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The regime’s fresh attacks on Gaza City took the lives of at least 19 Palestinians, including women and children.\nThe regime says 33 of its soldiers have been wounded in clashes in Gaza in the past 48 hours.\nThe Israeli attack took place in the town of Janata early on Friday.\nThe group has time and again warned that if Israel keeps crossing the red lines by targeting Lebanese civilians, it will pay the price of its action with blood.\nIn a message on the occasion of the annual Hajj rituals, Ayatollah Seyyed Ali Khamenei said the complex rituals instill intimidation and trepidation among the enemies and ill-wishers."}, {"id": "27082bd7-2e7e-46e4-8940-54b03ad035bb", "title": "Ukraine Presumed Air Base Targeted by Russian Combined Missile and Drone Attack", "date": "2024-06-14 07:30", "url": "https://www.kyivpost.com/post/34262", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The primary target of the strike was Starokostyantyniv in the Khmelnytsky region, which is widely thought to be home to a vast Ukrainian air base.\nThe assault began at approximately 22:40 with the attack by Iranian-made Shahed combat drones, followed by the launch of cruise missiles, and concluded at 04:43.\nFor the first time since a Russian Tu-22M3 was shot down, the strategic bomber was employed within reach of Ukraine’s air defense systems.\nJust over an hour later, at 06:00, Starokostyantyniv was attacked using a Kh-47M2 Kinzhal hypersonic missile.\nAdvertisementUkraine's Air Force successfully intercepted five out of 7 missiles and 14 out of 17 drones during the assault, with air defenses reacting in the Khmelnytsky, Kyiv, Dnipropetrovsk, Zaporizhia, Mylolaiv, Kharkiv and Odesa regions."}, {"id": "1baf4e32-e354-4b99-9459-316dab31cbc6", "title": "Ukraine fighting  intense  battles in Donetsk region", "date": "2024-06-14 14:45", "url": "https://www.rte.ie/news/ukraine/2024/0614/1454769-ukraine-war/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Ukraine said on Friday that Russian forces had concentrated their firepower on the Pokrovsk front in the eastern Donetsk region, where overnight strikes wounded at least six people.\n\"The Pokrovsk front... is the most intense in terms of enemy attacks,\" the Ukrainian military said in a briefing.\nRussia said it had downed 87 Ukrainian drones, of which 70 had targeted the southern Rostov region that houses the headquarters of its military operation against Ukraine.\nThe attacks sparked power cuts in several areas of the Rostov region, its governor Vasily Golubev said on social media.\nKyiv meanwhile said Ukrainian air defence systems had downed 24 out of 31 Russian drones and missiles fired overnight."}, {"id": "76ceafa8-7ed3-4956-a06f-76bb1353ec9a", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:00", "url": "https://www.oxfordmail.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "6ed57496-6558-42b6-b0b4-4a8de67b2400", "title": "Unmuzzled : In new book , retired Marine Corps Gen . Frank McKenzie airs frustrations with Biden , Trump , and the Pentagon", "date": "2024-06-14 14:45", "url": "https://www.washingtonexaminer.com/premium/3041285/unmuzzled-in-new-book-retired-marine-corps-gen-frank-mckenzie-airs-frustrations-with-biden-trump-and-the-pentagon/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "I’ve led well, and I’ve led poorly,” McKenzie writes, taking a stab at humility while spending most of the book recounting how he got most everything right.\nThe Soleimani strike was also a McKenzie initiative, although the idea had been bandied about for years, beginning when McKenzie was a three-star working in the Pentagon.\nWould it spur the crowd to attempt to overrun the embassy?” McKenzie writes.\nHe well knew that we were loath to hit targets with noncombatants likely to be killed or wounded,” McKenzie writes.\n“I do not believe it was a foregone conclusion that holding at 2,500 would have inevitably resulted in higher U.S. casualties and required the introduction of additional forces,” McKenzie concludes."}, {"id": "f02ac3ec-4831-46df-99de-3bee3e22a9b4", "title": "Hezbollah changes tactics and reveals new strengths to force Gaza ceasefire", "date": "2024-06-14 18:15", "url": "https://www.middleeasteye.net/news/hezbollah-methods-reveals-strengths-gaza-ceasefire", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "Israel's assassination of a top Hezbollah field commander on Tuesday has raised, once again, concerns over a wider Israeli war in Lebanon after months of clashes.\nThese developments are just the latest in escalating hostilities, which have seen increasingly ferocious and sophisticated Hezbollah attacks on Israel.\nSaad agrees, adding that the ongoing Gaza ceasefire negotiations may have encouraged Hezbollah to apply more pressure.\n\"Hezbollah has tied closing down this front to ending the war on Gaza,\" she said.\nSimilarly, Israeli attacks on southern Lebanon have burned large swathes of land, with Israel even seen using a medieval trebuchet to launch incendiaries."}, {"id": "01ad5597-9035-457c-97a9-4bcb22a94a09", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:30", "url": "https://abcnews.go.com/Business/wireStory/missile-strike-yemens-houthi-rebels-sets-cargo-ship-111114121", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Earlier Thursday, the British military's United Kingdom Maritime Trade Operations center said a vessel had been attacked and had caught fire.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen’s capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "398bb6f6-b0b7-40f7-a562-1792491742e1", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.lancashiretelegraph.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "e2d99c95-6eb1-4deb-b8a9-173c073df366", "title": "Hezbollah says it attacked 9 Israeli military sites with rockets and drones", "date": "2024-06-14 00:00", "url": "https://www.scmp.com/news/world/middle-east/article/3266548/hezbollah-says-it-attacked-9-israeli-military-sites-rockets-and-drones", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Asked about the incident, the Israeli military said it was looking into it.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander .\nHezbollah said it had launched rockets and weaponised drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon’s southern border for the second consecutive day.\nHezbollah said in a statement earlier that it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nState broadcaster Kan broadcast footage of numerous mid-air interceptions of rockets above Israeli towns, including in Safed, some 12km (7.5 miles) from the border."}, {"id": "c591d167-8ada-4c85-b427-b9ac02ba5d00", "title": "Children , Nurse Reportedly Killed As Israel Launches Fresh Attack On Lebanon Amid Fight With Hezbollah", "date": "2024-06-14 14:30", "url": "https://saharareporters.com/2024/06/14/children-nurse-reportedly-killed-israel-launches-fresh-attack-lebanon-amid-fight", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "The Israel Defense Forces have launched another attack on Southern Lebanon as their fight with a militant group based in the country, Hezbollah intensifies.\nThe Israel military said its warplanes bombed infrastructure used by Hezbollah in several locations in southern Lebanon, according to AP News.\n“Israel killed Sally Skayki, a young Lebanese nurse, in South Lebanon tonight while she was sleeping,” Sarah said.\nCowards.”Tweet URLHoward Beckett wrote: “These are scenes from Jannata in southern Lebanon 🇱🇧 after an attack by Israel 🇮🇱.\nAccording to Jerusalem Post, there was no such news in Israeli media, but warnings in Arab media caused tremendous alarm in Lebanon."}, {"id": "c5a57bcb-f779-4711-a792-d22326a425ab", "title": "A missile strike from Yemen  Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/14/fgn9-yemen-houthi--rebels-cargo.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Jun 14 (AP) Yemen's Houthi rebels launched two anti-ship cruise missiles and struck a commercial ship Thursday in the Gulf of Aden off Yemen, setting it on fire and severely wounding one civilian mariner, authorities said.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen's capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "bc209daa-90f9-4f63-9ced-be1f713454b7", "title": "Israel preparing for possible ground assault as air strikes devastate Gaza", "date": "2024-06-14 17:15", "url": "http://www.myanmarmuslim.net/news/20240615152d599793.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Lt Col Richard Hecht, an Israeli military spokesman, told reporters on Thursday that forces “are preparing for a ground manoeuvre if decided”, but that the political leadership has not yet ordered one.\nIn Gaza, Palestinians fleeing air strikes could be seen running through the streets, carrying their belongings and looking for a safe place.\nSmoke rises following an Israeli air strike in Gaza City (Fatima Shbair/AP)Israel’s increasingly destructive air strikes in Gaza have flattened entire city blocks and left unknown numbers of bodies beneath debris.\nThe only crossing point between Egypt and Gaza was shut down on Tuesday following nearby Israeli air strikes.\nIsrael says roughly 1,500 Hamas militants were killed inside Israel, and that hundreds of the dead inside Gaza are Hamas members."}, {"id": "bda617bc-e0ce-44d0-9725-5ce4feaa64dc", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 17:00", "url": "https://www.newsday.com/news/nation/us-navy-yemen-houthis-israel-war-u11569", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Eric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe Arleigh Burke-class guided missile destroyer USS Laboon sails in the Red Sea on Wednesday, June 12, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said."}, {"id": "0a6b9c86-9bbd-47c0-85d8-d7b7b6c7100f", "title": "Wakeley church terrorist attack : Alleged Wakeley church terror stabber faces new charges", "date": "2024-06-14 03:30", "url": "https://www.9news.com.au/national/alleged-wakeley-church-terror-stabber-faces-new-charges/f623106b-629a-4955-bcb5-a100806141af", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Investigators will comb through thousands of videos and images on the phone of a 16-year-old boy accused of stabbing a bishop during a live-streamed sermon.\nFresh charges have been levelled against a 16-year-old boy accused of stabbing a bishop.\nThe teen is behind bars, accused of stabbing Assyrian bishop Mar Mari Emmanuel and priest Isaac Royel during a live-streamed service at Christ the Good Shepherd Church on April 15.\nThe fresh intent to murder charge relates to Bishop Emmanuel, while the intent to cause grievous bodily harm charge relates to Father Royel.\nThe stabbing, which investigators say was religiously motivated, left Bishop Emmanuel seriously injured before the teenager was subdued."}, {"id": "0ddba7c2-d69d-40b0-a25f-d33f45932261", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://ktok.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "ktok.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "da2cf9df-7e55-4eef-8e94-67553f92b51d", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://jetradio1400.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/?pname=www.jetradio1400.com&sc=dnsredirect", "domain": "jetradio1400.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "c6204509-038a-4c73-a8fe-9efd7068a8af", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:45", "url": "https://970kfbx.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "c9e1b3bf-7cc7-4622-b4be-aaa4561edfda", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://talkradio1080.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "talkradio1080.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "a9633fe6-236d-4554-9cd9-fc98778afd57", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://newsradio1470.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradio1470.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "a89bfe5c-edc0-4318-9491-c90e445fd9c1", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building | NewsRadio WKCY", "date": "2024-06-14 00:30", "url": "https://newsradiowkcy.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "8bf56964-8ff6-48b8-8b34-2040a9ffdfda", "title": "Houthi missile strike on cargo ship severely injures sailor", "date": "2024-06-14 09:00", "url": "https://www.thenationalnews.com/news/mena/2024/06/14/houthi-missile-strike-on-cargo-ship-severely-injures-sailor/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "A sailor was severely wounded after a cargo ship in the Gulf of Aden was hit by two cruise missiles fired by Yemen's Houthi rebels on Thursday.\nAircraft from USS Philippine Sea missile cruiser evacuated the injured sailor to another ship for treatment, it said.\nHouthi rebels in Yemen have pledged to disrupt all shipping destined for Israel through the Red Sea and the Suez Canal.\nCentcom said the Houthis had launched two ballistic missiles in the Red Sea that caused “no injuries or significant damage”.\nCentcom also said it destroyed an unmanned Houthi boat and two patrol vessels in the Red Sea, as well as one drone."}, {"id": "51972488-8f99-4464-8823-e99a86135039", "title": "Hezbollah shells Kiryat Shmona and Kfar Szold in response to Janata strike", "date": "2024-06-14 13:15", "url": "https://dailystar.com.lb/hezbollah-shells-kiryat-shmona-kfar-szold/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Hezbollah launched a barrage of rockets at Kiryat Shmona and Kfar Szold on Friday, in retaliation for an overnight Israeli strike that killed two women and injured several civilians in southern Lebanon.\nHezbollah stated it targeted the Israeli settlements with Katyusha and Falaq rockets in response to the strike on Janata that resulted in civilian casualties.\nThe group also attacked buildings used by Israeli soldiers in Metula, north Israel, as further retaliation.\nHezbollah has vowed to “increase the intensity, strength, quantity, and quality” of its attacks following the Israeli strike that killed one of its senior commanders.\nIsraeli authorities report that at least 15 Israeli soldiers and 11 civilians have been killed."}, {"id": "a15bee03-47de-43ff-bd33-74cb620d0591", "title": "Middle East crisis : As border clashes intensify , Hezbollah fires rockets into northern Israel again", "date": "2024-06-14 04:30", "url": "https://thelabradorian.ca/middle-east-crisis-as-border-clashes-intensify-hezbollah-fires-rockets-into-northern-israel-again/", "domain": "thelabradorian.ca", "domain_classification": "Unknown", "message": "But al-Manar, the group’s broadcaster, reported at one point that more than 100 people had been shot in a coordinated attack targeting several Israeli military installations.\nIsrael’s military said in the afternoon that Hezbollah had fired more than 40 rockets across the border, but the barrage continued into the evening.\nOn Wednesday, Israel fired more than 200 rockets at Israel, according to the military, but they did little damage.\nThe Israeli military said Thursday that its warplanes struck “Hezbollah military structures” in Lebanese border villages overnight.\nSome residents said they had never seen the leaflets, while others said they were confused by the numbering system the Israeli military uses to define “humanitarian zones”."}, {"id": "4ea5cd81-27e9-4aaf-995b-bc4a4b6c4a9e", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 12:30", "url": "https://economictimes.indiatimes.com/news/defence/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/articleshow/110999612.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\n\"This is the most sustained combat that the US Navy has seen since World War II - easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nIf you let it fester, the Houthis are going to get to be a much more capable, competent, experienced force.\n\"Asked if the Navy believed Iran picks targets for the Houthis, Miguez would only say there was \"collaboration\" between Tehran and the rebels.\n\"Officers acknowledge some grumbling among their crew, wondering why the Navy doesn't strike harder against the Houthis."}, {"id": "d5fed644-6b4c-4e2f-9fd1-aab2be3ed605", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 17:00", "url": "https://www.startribune.com/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/600373498/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said."}, {"id": "82070926-31db-4168-a785-f7234525b9cc", "title": "US Navy Faces Its Most Intense Combat Since World War II Against Yemen Iran - Backed Houthi Rebels", "date": "2024-06-14 13:45", "url": "https://www.military.com/daily-news/2024/06/14/us-navy-faces-its-most-intense-combat-world-war-ii-against-yemens-iran-backed-houthi-rebels.html", "domain": "military.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "d8f3175a-fb44-4bdd-9d7b-24e9d07f7e6e", "title": "US Navy faces its most intense combat since World War II against Yemen Houthi rebels", "date": "2024-06-14 13:00", "url": "https://www.stltoday.com/news/nation-world/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemen-s-houthi/article_2baad968-2a40-11ef-95ab-eb3ede52a9e8.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "56bc8db1-6b99-43f0-82d9-873ff4aaec4a", "title": "U . S . Navy faces most intense combat since WWII against Yemen Iran - backed Houthi rebels – The Virginian - Pilot", "date": "2024-06-14 13:00", "url": "https://www.pilotonline.com/2024/06/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "pilotonline.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThe Navy saw periods of combat during the “Tanker Wars” of the 1980s in the Persian Gulf, but that largely involved ships hitting mines.\nThe White House hasn’t discussed the Houthi campaign at the same level as negotiations over the Israel-Hamas war."}, {"id": "96622110-a36c-40e6-9b88-ed8349f4a5ce", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "814b5bce-bdd8-4d62-9c2a-d0e07caa86f4", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "566aa383-699e-4073-b9ad-a15d3a83b5ff", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:45", "url": "https://www.hawkesburygazette.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "9ecfe021-96c1-4905-b908-3a2d70f28957", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 01:00", "url": "https://www.batemansbaypost.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "9b6fad31-f5f4-4933-a681-e7d67de74815", "title": "UN Smears Israel With Jihad Propaganda on Shavuot", "date": "2024-06-14 11:30", "url": "https://pjmedia.com/catherinesalgado/2024/06/13/un-smears-israel-with-jihad-propaganda-on-shavuot-n4929878", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "With its usual impeccable timing, the terrorist-tied UN released its latest report using jihadi propaganda to accuse Israel during the Jewish feast of Shavuot.\nThe UN announced its latest report insanely trying to draw a moral equivalence between Hamas and Israel.\nAlmost three-fourths of Palestinians still support Hamas and its Oct. 7 actions, and a Hamas leader vowed to repeat its atrocities “again and again” until Israel is obliterated.\nAt these UNRWA schools, Palestinian children are indoctrinated to be terrorists and to see the genocide of Jews as a glorious thing.\nIsrael rejects the abhorrent and immoral accusations leveled against the [Israel Defense Forces],” the post added."}, {"id": "6e5f3c8b-aa49-46c2-8f58-a97914547353", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels | News , Sports , Jobs", "date": "2024-06-14 15:30", "url": "https://www.heraldextra.com/top-headlines/2024/jun/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "heraldextra.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "f397c160-d4e3-4034-ad7e-d9a9dd98a9c4", "title": "U . S . Navy faces most intense combat since WWII against Yemen Iran - backed Houthi rebels – Daily Press", "date": "2024-06-14 14:15", "url": "https://www.dailypress.com/2024/06/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "dailypress.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThe Navy saw periods of combat during the “Tanker Wars” of the 1980s in the Persian Gulf, but that largely involved ships hitting mines.\nThe White House hasn’t discussed the Houthi campaign at the same level as negotiations over the Israel-Hamas war."}, {"id": "1ecb7c38-f4e2-4e00-8877-d2a7d5a5e75a", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 17:30", "url": "https://www.smdailyjournal.com/news/world/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed/article_0b1c9d4f-c854-59f4-b1fb-42aba5923e3b.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "268849c3-f07c-4ea4-9e43-935f26a533a3", "title": "Lebanon Hezbollah reveals more of its arms in risky escalation with Israel", "date": "2024-06-14 05:15", "url": "https://www.scmp.com/news/world/middle-east/article/3266577/lebanons-hezbollah-reveals-more-its-arms-risky-escalation-israel", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Hezbollah rockets have set off wildfires in northern Israel.\nHezbollah began trading fire with Israel on October 8, a day after its Palestinian ally Hamas attacked southern Israel, sparking the Gaza war.\nHezbollah says it will cease fire only when the Gaza war stops.\nPhoto: ReutersPrior to this conflict, Israel and Hezbollah had avoided a major clash since a month-long war in 2006, deterred since then by mutual threats of catastrophic destruction.\nThe aftermath of an Israeli air strike in the southern Lebanese town of Wadi Jilo."}, {"id": "9a9a85b9-fc99-4930-9e3b-8a6e94f0b4d9", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:30", "url": "https://www.belfasttelegraph.co.uk/news/world-news/hezbollah-warns-its-intensified-attacks-show-israel-all-out-war-would-be-costly/a1231391538.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "Cross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael’s war against Hamas in Gaza has killed more than 37,100 people, according to Gaza’s Health Ministry, which does not distinguish between combatants and civilians in its count.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "b09c677f-6c8c-45c3-a9d5-b4228d4242ca", "title": "Palestinian relative of Gazan casualties slams pro - Palestinian activists", "date": "2024-06-14 17:15", "url": "https://www.jpost.com/israel-hamas-war/article-806263", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Alkhatib wrote of flying to Egypt to help his brother’s family escape the war and of an Israeli airstrike wounding many of his paternal uncles and cousins.\nI must despise all Israelis and consider them my sworn enemies,” Alkhatib wrote.\n“Despite my deep frustration and resentment with the Israeli government’s action and the ongoing war in Gaza, I don’t.\nIf anything, I’m more critical of some pro-Palestinian activists, many of whom are making things worse, putting the people they claim to defend in increasing danger.\nThe activists claimed that Hamas’s terrorism had been “exaggerated, or outright invented” and told him to focus on pro-Palestinian matters."}, {"id": "bf6792c8-2e59-4b69-bcde-5a25239f4bc0", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 17:00", "url": "https://www.columbian.com/news/2024/jun/14/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nThe Houthis say the attacks are aimed at stopping the war in Gaza and supporting the Palestinians, though it comes as they try to strengthen their position in Yemen.\nAll signs suggest the warfare will intensify — putting U.S. sailors, their allies and commercial vessels at more risk."}, {"id": "8450b64d-1a1f-45e6-9844-6ae17e59c953", "title": "US Navy faces its most intense combat since World War II against Houthis", "date": "2024-06-14 12:45", "url": "https://www.naharnet.com/stories/en/305931-us-navy-faces-its-most-intense-combat-since-world-war-ii-against-houthis", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\n\"This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\nA stalemated warOfficers acknowledge some grumbling among their crew, wondering why the Navy doesn't strike harder against the Houthis.\nMeanwhile, the Houthi attacks continue to depress shipping through the region."}, {"id": "d2cf99e1-d3fe-4031-a35f-22cd44ccf01e", "title": "Officials ban some fireworks in unincorporated portions of Santa Fe County", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/officials-ban-fireworks-unincorporated-portions-220128554.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SANTA FE, N.M. (KRQE) – The Board of County Commissioners has banned the sale and use of certain types of fireworks within unincorporated portions of Santa Fe County for at least the next 30 days.\nThe resolution does not ban all types of fireworks.\nOn wildlands within Santa Fe County, all fireworks are banned, the resolution notes.\nThe county says the following types of fireworks are NOT banned by the resolution.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "4d86a813-0a0e-46e0-9a50-976c1be311ec", "title": "Huthi missile attack severely injures sailor on cargo ship US military", "date": "2024-06-14 07:30", "url": "https://www.philstar.com/world/2024/06/14/2362846/huthi-missile-attack-severely-injures-sailor-cargo-ship-us-military", "domain": "philstar.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates — Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "f8487e76-c866-4344-b715-33821a9456d4", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 18:15", "url": "https://www.breakingnews.ie/world/hezbollah-warns-its-intensified-attacks-show-israel-all-out-war-would-be-costly-1638433.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Lebanese militant group Hezbollah says its intensified attacks along Israel’s northern border this week demonstrate to Israeli leaders that an all-out war would be costly, senior official Sheikh Ali Daamoush said in a sermon during Friday prayers.\nAdvertisementCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael’s war against Hamas in Gaza has killed more than 37,100 people, according to Gaza’s Health Ministry, which does not distinguish between combatants and civilians in its count.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "71828d01-2baf-42f5-91aa-87c0dfa4a250", "title": "Biden urges  dont be consumed by rage  as he tells Israel  youre not alone  ", "date": "2024-06-14 17:15", "url": "http://www.myanmarmuslim.net/news/20240615397d599548.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Mr Netanyahu said the president’s visit was “deeply, deeply moving” and said Mr Biden had rightly drawn a clear line between the “forces of civilisation and the forces of barbarism”.\nMr Biden was expected to speak to Mr Abbas by telephone as he returned to Washington, but his presence in Israel prompted fresh outrage.\nIn Amman, a sign hoisted by one protester labelled Mr Biden and Mr Netanyahu war criminals.\n“The vast majority of Palestinians are not Hamas,” Mr Biden stressed.\n“Based on what I’ve seen, it appears as though it was done by the other team, not you,” Mr Biden told Mr Netanyahu."}, {"id": "ce560d24-4d39-43c7-897c-b1b7c4fa4fa4", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 18:15", "url": "https://www.dumbartonreporter.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "dumbartonreporter.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "79996143-45e2-4934-a975-ebdb05595d24", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 18:15", "url": "https://www.somersetcountygazette.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "somersetcountygazette.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "a74467a5-0390-4872-9a9b-ee238d782f9c", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 18:15", "url": "https://www.clydebankpost.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "clydebankpost.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "0cc47446-75c6-4a00-8dbe-bcdf926e82c2", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 18:30", "url": "https://www.runcornandwidnesworld.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "runcornandwidnesworld.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "7a3efbc6-b886-402d-be24-4aafc0edf14c", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:00", "url": "https://www.leaderlive.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "leaderlive.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "f5e5c9e4-8167-4160-9cfd-97f858c69e17", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:15", "url": "https://www.sloughobserver.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "sloughobserver.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "b48d464a-d6c2-4774-9d75-ae8f64ed20f3", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:15", "url": "https://www.cotswoldjournal.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "cotswoldjournal.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "447423a6-abff-4f41-b9e1-9182eb389c6d", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:15", "url": "https://www.keighleynews.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "keighleynews.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "9e27e261-2802-4e1f-b818-9bbd42ea8c8e", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:30", "url": "https://www.stroudnewsandjournal.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "stroudnewsandjournal.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "21867a75-4dca-49a8-921f-088fee2fa320", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:30", "url": "https://www.burytimes.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "burytimes.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "c36b024b-76f4-41d1-a227-c6edbc52c65d", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:30", "url": "https://www.braintreeandwithamtimes.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "braintreeandwithamtimes.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "849cfc5f-a5f1-4c87-8b3b-8d8a2b85ce45", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 19:30", "url": "https://www.malverngazette.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "malverngazette.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "d545ab8b-3dda-4dda-b6bb-ee832ed022db", "title": "IRA bombing survivor receives honorary fellowship for work with terror victims | united kingdom | News", "date": "2024-06-14 12:45", "url": "https://www.express.co.uk/news/uk/1911220/ira-bombing-survivor-receives-honorary-fellowship-terrorism-victim-advocacy", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Head of the Docklands victims campaign group Jonathan Ganesh was awarded an honorary fellowship by the University of Sunderland (Dominic Lipinski/PA)Jonathan Ganesh, a survivor of the 1996 IRA Docklands bombing, has been honoured with an honorary fellowship by the University of Sunderland.\nThe bomb attack left Mr Ganesh seriously injured, claiming two lives and wounding another 42.\nFollowing the attack, he became a powerful voice for terrorism victims, heading up the Docklands Victims Association and training as a psychotherapist.\nThe prestigious award was presented to him by University Chancellor Leanne Cahill.\nHe added that although he's accepting it, the honour is on behalf of all those they've helped and everyone contributing to the charity's work and accomplishments."}, {"id": "cd6df1df-3b04-46b8-b592-8e8346b791ee", "title": "Ukrainian military says it downed seven of 14 missiles , all drones in Russian attack", "date": "2024-06-14 12:30", "url": "https://www.theglobeandmail.com/world/article-ukrainian-military-says-it-downed-seven-of-14-missiles-all-drones-in/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The Ukrainian military said on Friday its forces downed seven of 14 missiles and all 17 drones launched by Russia in overnight attacks in the west of the country.\nRussian forces targeted critical infrastructure and military objects during the raid, air force spokesperson Illia Yevlash said on national television.\nThe Ukrainian military destroyed 11 aerial targets over the western region of Khmelnytskyi, according to the governor.\nAir defence shot down seven of 10 Kh-101/Kh-555 cruise missiles, the Ukrainian military said.\nRussia also launched three Iskander-M ballistic missiles, targeting Zaporizhzhia region, and one Kinzhal air-launched ballistic missile in its attack, according to Yevlash."}, {"id": "c87b1517-0f34-4e98-88cc-37d8cbae039d", "title": "Child stabbed in Finland , police suspect man with far - right sympathies", "date": "2024-06-14 15:30", "url": "https://www.swissinfo.ch/eng/child-stabbed-in-finland%2c-police-suspect-man-with-far-right-sympathies/80679192", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Child stabbed in Finland, police suspect man with far-right sympathies1 minuteHELSINKI (Reuters) – A man with far-right sympathies is suspected of carrying out a stabbing attack in which a 12-year-old child was seriously wounded at a shopping centre in the northern Finnish city of Oulu, police said on Friday.\nThey know, however, that the suspect has a background in extreme right activities,” the NBI said.\n“Far-right violence is a genuine threat in Finland,” Orpo said in a post on social media X.\n“There is no room for extremism of any kind in this country.”The 12-year-old child was in a stable condition after being seriously wounded in the attack, police said.\nThe suspect, who was born in 1990, was believed to have stabbed the child several times from behind before being stopped by a security guard, the NBI said."}, {"id": "c3a8c03c-53df-4a77-a55f-8d785b857f14", "title": "Hezbollah Fires Largest Drone Volley , Over 100 Rockets On 9 IDF Bases , Israeli Jets Bomb Lebanon", "date": "2024-06-14 10:00", "url": "https://article.wn.com/view/2024/06/14/Hezbollah_Fires_Largest_Drone_Volley_Over_100_Rockets_On_9_I/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The Iran-backed Hezbollah said it had launched rockets and weaponised drones at over 10 Israeli military sites in a coordinated attack on June 13, PressTV reported.\nThe Lebanese group said it fired around 30... read full story"}, {"id": "8f379dec-6127-43e2-8786-c27975d75c2c", "title": "Ukraine Strikes on Crimea Air Defenses Could End Military Role : ISW", "date": "2024-06-14 16:15", "url": "https://www.businessinsider.com/ukraine-strikes-russia-crimea-air-defenses-end-military-role-experts-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewUkraine's sustained attacks against Russia's air defenses could make occupied Crimea untenable as a military staging ground, war analysts said.\nUkraine has repeatedly hit Russia's air defenses in Crimea over the last few months, with attacks intensifying this week.\nAdvertisementAccording to reports, one Russian S-400 \"Triumf\" and two S-300 air-defense missile systems were targeted overnight on Sunday into Monday, with suggestions that Ukraine used US-supplied Army Tactical Missile Systems, known as ATACMS.\nAdvertisementForbes reached a similar conclusion on Wednesday, saying Russia's S-400 missile systems can't defend nearby Russian troops or even themselves.\nAdvertisementBut despite Ukraine's recent successes, its campaign of long-range air strikes won't be the silver bullet that ends Russia's occupation of Crimea, military experts told BI."}, {"id": "48c206f9-b167-4507-a435-ffd9b6829cc0", "title": "Why Israel - Hezbollah tensions risk boiling over now", "date": "2024-06-14 13:45", "url": "https://www.yahoo.com/news/why-israel-hezbollah-tensions-risk-120936159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Since then, the two sides have traded fire sporadically, but tensions boiled over in 2006 when Israel went to war in southern Lebanon again after Hezbollah kidnapped two Israeli soldiers.\nMore than 1,000 Lebanese were killed in that conflict, mostly civilians, as well as 49 Israeli civilians and 121 soldiers.\nThe military capability of the Lebanese group has grown since 2006, when it relied largely on inaccurate Soviet-era Katyusha rockets.\nHezbollah has fired 35 kilometers into Israel, while Israel has targeted areas of Lebanon more than 120 kilometers north.\nMore houses were evacuated this week in the Galilee region in northern Israel after a fire broke following rocket attacks from Lebanon, Israeli police said."}, {"id": "81224a02-4d8c-4c25-b96a-2c0fb6abff33", "title": "Two Men Arrested in Connection with Fatal Stabbing in Costa Mesa", "date": "2024-06-14 06:15", "url": "https://mynewsla.com/crime/2024/06/13/two-men-arrested-in-connection-with-fatal-stabbing-in-costa-mesa/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men from Costa Mesa suspected in a fatal stabbing in the city that police said they believed was gang-related were behind bars Thursday.\nIsrael Antonio Valencia, 25, and Christopher Mathew Pena, 18, were arrested Wednesday, according to Roxi Fyad of the Costa Mesa Police Department.\nThey are accused in the killing of a 22-year-old man, Fyad said.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive."}, {"id": "f3dd3502-30ce-4b50-9193-5a738cf62357", "title": "Huthi missile attack injures sailor - Manila Standard", "date": "2024-06-14 12:30", "url": "https://manilastandard.net/news/314459508/huthi-missile-attack-injures-sailor.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -DUBAI – Two cruise missiles launched by Yemen’s Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena — a Palauan-flagged, Ukrainian-owned, Polish-operated ship — “reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,” the US Central Command said in a statement.\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March.\nCENTCOM said at the time that the Tutor had been hit by a Huthi “unmanned surface vessel” that “caused severe flooding and damage to the engine room”."}, {"id": "b0911da1-5159-4832-b970-2aa9e1ad834b", "title": "US Submarine Makes Routine Stop in Cuba As Russia Holds Drills", "date": "2024-06-14 13:30", "url": "https://www.theepochtimes.com/world/us-submarine-makes-routine-stop-in-cuba-as-russia-holds-drills-5668596", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "A U.S. military official said that the Russian warships visiting Cuba on military exercises ‘don’t pose a threat to the United States’.\nA nuclear-powered U.S. submarine arrived in Guantanamo Bay, Cuba, as part of what officials said was previously planned visit, a day after a fleet of Russian warships arrived at the island as part of their military drills in the region.\nThe USS Helena, a fast attack submarine, arrived at the naval base for “a routine port visit as it transits the U.S. Southern Command geographic area of responsibility,” the U.S. Southern Command said on X.\nThe U.S. Defense Department has downplayed the Russian warships’ visit to Cuba, and Pentagon spokeswoman Sabrina Singh said it is consistent with “routine naval visits that we’ve seen under different administrations.”“We’ve been tracking the Russians’ plans for this.\nThe Cuban Foreign Ministry has previously said the four Russian ships would not carry nuclear weapons during their visit to the Caribbean from June 12 to June 17."}, {"id": "55163800-07fa-4dd9-815e-54a0d2847e7c", "title": "Houthi missile attack severely injures sailor on cargo ship : U . S . military", "date": "2024-06-14 06:00", "url": "https://www.thehindu.com/news/international/houthi-missile-attack-severely-injures-sailor-on-cargo-ship-us-military/article68288033.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Two cruise missiles launched by Yemen's Houthi rebels struck a bulk cargo carrier in the Gulf of Aden on June 13, severely injuring a sailor who was evacuated by American forces, the U.S. military said.\nOne civilian mariner was severely injured during the attack,\" the U.S. Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nJune 13 U.S. Central Command UpdateIn the past 24 hours, U.S. Central Command (USCENTCOM) forces successfully destroyed one air defense sensor in a Houthi controlled area of Yemen.\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "be4613f3-85da-40c0-89fc-fecc569c3f62", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 05:30", "url": "https://www.bssnews.net/news/195119", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DUBAI, June 14, 2024 (AFP) - Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "76477a06-fbfb-4f49-91e8-efb2ea28337e", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 10:45", "url": "https://greatbendpost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "greatbendpost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "cd7f95ba-2d23-4d47-a4dd-f81991b9daba", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 10:45", "url": "https://salinapost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "salinapost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "0eef9e20-3f46-4e2b-8015-393b3119c198", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 14:30", "url": "https://hayspost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "hayspost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "339bce1f-1c7c-41c8-b9a7-b396740ba639", "title": "U . S . Report : Rebel missile strike sets ship on fire in Gulf of Aden", "date": "2024-06-14 12:45", "url": "https://jcpost.com/posts/beb2c9c7-e0fb-427c-a5a8-f7b4da3a8fcb", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "The Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month.\nAlso Thursday, the Washington-based National Democratic Institute said three of its staff were detained by the Houthis earlier this month."}, {"id": "7657f566-5bf9-4f94-bd7d-8bc309977f3e", "title": "Israel Defense Forces Latest News & Photos , about Topic - Business Insider India", "date": "2024-06-14 19:30", "url": "https://www.businessinsider.in/topic/israel-defense-forces", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "US forces shot down over 75 Iranian missiles and drones in its biggest air-defense battle of the Middle East crisisUS warships and aircraft destroyed dozens of the Iranian munitions that were fired at Israel, an Am…"}, {"id": "a9c92aec-71cc-47f0-8a1c-75f721c6c64d", "title": "White Supremacist Indicted For Planning Mass Shooting At Bad Bunny Concert  To Incite A Race War  ", "date": "2024-06-14 15:15", "url": "https://www.stereogum.com/2268036/white-supremacist-indicted-for-planning-mass-shooting-at-bad-bunny-concert-to-incite-a-race-war/news/", "domain": "stereogum.com", "domain_classification": "Unknown", "message": "According to authorities, Prieto was planning to stage a mass shooting at a a Bad Bunny concert in Atlanta, hoping to start a race war ahead of this year’s presidential election.\nLast October, an informant told the FBI that 58-year-old Prieto had plans to incite a race war.\nAccording to the informant, Prieto planned to carry out his attack at one of two Bad Bunny concerts at Atlanta’s State Farm Arena last month.\nThe FBI arrested Prieto on the New Mexico Interstate on May 14, the date of the first Bad Bunny show.\nPrieto apparently admitted to selling an AR-15 to an undercover agent, telling the agent that the gun would be good to use in such an attack."}, {"id": "8b7ddf9d-1c26-443d-91a2-19c14c8dcec8", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 03:15", "url": "http://usa.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "c565bb3e-b0ba-4f88-a824-74087e8524ef", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 02:00", "url": "http://europe.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "547829b5-7f3f-44eb-b2a4-d98c06a31a2f", "title": "Brighton neo - Nazi teenager who planned synagogue suicide bombing jailed", "date": "2024-06-14 16:15", "url": "https://www.aol.co.uk/news/brighton-neo-nazi-teenager-planned-155004050.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Mason Reynolds had detailed diagrams of the synagogue in Hove, East Sussex, on his phone.\nPhotograph: ROCU/PAA teenager with neo-Nazi views who made plans to carry out a suicide bombing at a synagogue because he wanted “to make Jews afraid again” has been jailed for eight years.\nMason Reynolds had carried out a “very significant amount of planning” for a terrorist attack at the synagogue in Hove, East Sussex, the sentencing judge said.\nReynolds, 19, who lived with his parents in Brighton as he hatched the plan, admitted holding neo-Nazi beliefs but claimed he didn’t really plan to carry out the bombing.\nNick Price, the head of the Crown Prosecution Service counter-terrorism and special crime division, said: “Mason Reynolds sought to spread hate and encourage acts of terrorism."}, {"id": "be36b909-e442-4cc4-83b0-4ee6a3ae8c40", "title": "Russian attack sub discovered just 200 miles from US East Coast is given safe harbor during Hurricane Sandy", "date": "2024-06-14 05:00", "url": "https://engineeringevil.com/2012/11/06/russian-attack-sub-discovered-just-200-miles-from-us-east-coast-is-given-safe-harbor-during-hurricane-sandy/", "domain": "engineeringevil.com", "domain_classification": "Unknown", "message": "Officials said the submarine was probably conducting anti-submarine warfare efforts against U.S. ballistic and cruise missile submarines at Kings Bay, Georgia.\nThe submarine did not sail near Kings Bay or threaten a U.S. aircraft carrier group conducting exercises near it in the eastern Atlantic.\nThere are two guided missile submarines and six nuclear missile submarines docked at Kings Bay Naval Submarine Base.\nThose American vessels are a known target of Russian attack subs.\nFlexing their muscle: Officials say Russian sub patrols have increased in recent yearsHowever, the Russian sub was considered safe enough that it was given a safe harbor in Jacksonville, Florida’s commercial port during Hurricane Sandy, within listening range of Kings Bay."}, {"id": "a4cb7a9a-8ecf-4a8f-9d8c-3c89fbfceb6c", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas - Xinhua", "date": "2024-06-14 16:15", "url": "https://english.news.cn/20240614/7d854f10b4684f3f93f29bae80b91677/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage."}, {"id": "3d5bac15-3616-49e5-ba71-243eb4bc2feb", "title": "الوكالة الوطنية للإعلام - Islamic Resistance launches rocket attack in response to Israeli strikes", "date": "2024-06-14 11:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/701605/islamic-resistance-launches-rocket-attack-in-respo", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - In a statement issued on Friday, the Islamic Resistance in Lebanon announced, \"In support of our steadfast Palestinian people in the Gaza Strip and to back their courageous and honorable resistance, and in response to the Israeli assaults on the resilient southern villages and the safe homes, including the recent attack on the town of Janata which resulted in the martyrdom and injury of civilians, the fighters of the Islamic Resistance launched dozens of Katyusha and Falaq rockets on Friday, June 14, 2024, targeting the settlements of Kiryat Shmona and Kfar Szold.\"\n===============R.H."}, {"id": "272ba8fb-d2b5-4f5a-a940-ee3938a986b3", "title": "الوكالة الوطنية للإعلام - Islamic Resistance launches rocket attack in response to Israeli strikes", "date": "2024-06-14 11:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/701608/islamic-resistance-launches-rocket-attack-in-respo", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - In a statement issued on Friday, the Islamic Resistance in Lebanon announced, \"In support of our steadfast Palestinian people in the Gaza Strip and to back their courageous and honorable resistance, and in response to the Israeli assaults on the resilient southern villages and the safe homes, including the recent attack on the town of Janata which resulted in the martyrdom and injury of civilians, the fighters of the Islamic Resistance launched dozens of Katyusha and Falaq rockets on Friday, June 14, 2024, targeting the settlements of Kiryat Shmona and Kfar Szold.\"\n===============R.H."}, {"id": "2dd4b177-3aec-4d8f-9a6e-0bb0c53c6a9d", "title": "Man accused of planning mass shooting to start  race war  arrested in New Mexico", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/man-accused-planning-mass-shooting-220550403.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NEW MEXICO (KRQE) – An Arizona man who is accused of planning a mass shooting in an attempt to start a “race war” was arrested in New Mexico, according to federal authorities.\nCourt documents noted that Prieto reportedly planned to carry out the attack along with the two undercover government individuals.\nPrieto was arrested by law enforcement on May 14 while he was driving east from Arizona through New Mexico along Interstate 40, the U.S. Attorney’s Office in Arizona said.\nOfficials did not specify what law enforcement agency arrested Prieto, but said law enforcement found Prieto was in possession of seven guns, ammo, and was taken into federal custody.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "130e0852-2797-4acb-81cb-22f3bdd3efdf", "title": "Yemen Houthi rebels launch 2 cruise missles and hit ship in Gulf of Aden , sparking blaze , US says", "date": "2024-06-14 00:45", "url": "https://www.ivpressonline.com/news/world/yemens-houthi-rebels-launch-2-cruise-missles-and-hit-ship-in-gulf-of-aden-sparking/article_de3fa657-9317-59d3-b5e8-2de2ac045abd.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "5f196a07-ddab-45de-aa55-bc94cc58305b", "title": "Tensions flare on Israeli - Lebanese border after senior Hezbollah commander death – Ya Libnan", "date": "2024-06-14 14:30", "url": "https://yalibnan.com/2024/06/14/tensions-flare-on-israeli-lebanese-border-after-senior-hezbollah-commanders-death/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Lebanon’s Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group’s October 7 attack on southern Israel.\n© Jalaa Marey, AFPTensions flared on the Israeli-Lebanese border Friday amid intensified fighting between Hezhollah and Israel after the Iran-backed militant group vowed to avenge the death of a senior commander.\nTensions are flaring by the Israel-Lebanese border after the Iran-backed militant group Hezbollah vowed to avenge the death of a senior commander.\nTensions are flaring by the Israel-Lebanese border after the Iran-backed militant group Hezbollah vowed to avenge the death of a senior commander.\nTaleb el Abdullah, the senior Hezbollah commandeer who was killed by Israeli strike"}, {"id": "c4e6960b-ca8f-4ae3-a975-a77b11489e5d", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.ludlowadvertiser.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "ludlowadvertiser.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "69bc1fb8-3a1f-4ca7-8407-86315d607c62", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.barryanddistrictnews.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "barryanddistrictnews.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "6b3c0bbd-84b2-416f-b785-42935ef6ac4f", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.islingtongazette.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "islingtongazette.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "2497fffe-8812-4d9f-bf1c-ea71e252140e", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.watfordobserver.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "watfordobserver.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "12d3322e-9592-4c08-9186-b9df604f40a0", "title": "Hezbollah warns its intensified attacks show Israel all - out war would be costly", "date": "2024-06-14 16:15", "url": "https://www.royston-crow.co.uk/news/national/24389022.hezbollah-warns-intensified-attacks-show-israel-all-out-war-costly/", "domain": "royston-crow.co.uk", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah militants launched dozens of rockets on Friday in a third day of retaliation for the killing of senior commander Taleb Sami Abdullah, 55.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nLater on Friday it emerged that Israel will not join a trilateral effort to stem fighting with Hezbollah proposed by France’s president, Israel’s defense minister said Friday.\nHe said France, the US and Israel had agreed to work jointly towards quelling tensions between Hezbollah and Israel, who have exchanged cross-border fire nearly every day since the war in Gaza began.\nIsrael launched the war after Hamas’s October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "b139c30f-ed23-47dc-bb00-958d5525d76a", "title": "  Our souls are still there : Palestinians evacuated from Gaza to Qatar long for home - Doha News", "date": "2024-06-14 13:15", "url": "https://dohanews.co/our-souls-are-still-there-palestinians-evacuated-from-gaza-to-qatar-long-for-home/", "domain": "dohanews.co", "domain_classification": "Unknown", "message": "Source: Doha NewsLed by Amir Sheikh Tamim bin Hamad Al-Thani, the initiative aims to sponsor 3,000 orphans and provide medical care for 1,500 injured Palestinians from Gaza.\nSource: Doha NewsThe child, who is severely traumatised and can barely talk, has been receiving treatment at Sidra Medicine.\nWafaa Abu Samaan, 27, holds an image of her state during the final days of her pregnancy.\nSource: Doha NewsAbu Samaan was forced to flee the northern Gaza Strip in a wheelchair, pushed by her brother.\nWe kill you because you keep having children’,” Abu Samaan recalled."}, {"id": "bbe5519c-b8dc-4a31-9463-5726c4009322", "title": "Man Indicted For Planning Shooting At Bad Bunny Concert", "date": "2024-06-14 05:30", "url": "https://uproxx.com/music/man-indicted-allegedly-planning-shooting-bad-bunny-concert/", "domain": "uproxx.com", "domain_classification": "Unknown", "message": "An Arizona man has been indicted in Atlanta after planning to carry out a mass shooting a Bad Bunny concert, according to a report from NBC.\nMark Adams Prieto was indicted earlier this week after his arrest last month for the alleged plot.\nPrieto was reportedly charged with Possession of an Unregistered Firearm, Firearms Trafficking, and Transfer of a Firearm for Use in a Hate Crime.\nPrieto evidently planned the attack for after Super Tuesday, after the presidential candidates were set, the source revealed.\nLaw enforcement has since executed a search warrant at Prieto’s home and recovered more firearms, including an unregistered short-barreled rifle."}, {"id": "9f84f73c-8c59-4ef1-b189-d2366af76a54", "title": "Russian warships reach Cuba ahead of military exercises", "date": "2024-06-14 00:00", "url": "https://www.dailymail.co.uk/news/article-13528593/Russian-warships-reach-Cuba-ahead-military-exercises-just-two-weeks-Biden-approved-Ukraine-using-weapons-inside-Russia-ominous-echo-Cold-War.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Russian warships reached Cuba this week ahead of planned military exercises in echos of the cold-war missile crisis.\nThe fleet, made up of a frigate, a nuclear-powered submarine, an oil tanker and a rescue tug, crossed into Havana Bay after drills in the Atlantic Ocean.\nUS officials expect the ships to remain in the region through the summer and possibly also stop in Venezuela.\nRussia is a longtime ally of Venezuela and Cuba, and its warships and aircraft have periodically made forays into the Caribbean.\nAlthough the fleet includes a nuclear-powered submarine, a senior US administration official said that the intelligence community has determined no vessel is carrying nuclear weapons."}, {"id": "95e4e1c0-1c88-457a-942c-3bf4450f4b7c", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:00", "url": "https://kdhnews.com/news/world/a-missile-strike-from-yemens-houthi-rebels-sets-a-cargo-ship-on-fire-in-gulf/article_0397a67f-e472-5b70-85b9-989a5e9bbdbe.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "It would free up time for the mayor, City Council, city manager and city staff.\nIt would give council members more time to study an issue before it is discussed.\nCouncil meetings are already too long.\nCutting the number of meetings means reducing residents’ input.\nThe proposal has some merit, but it could require marathon council sessions."}, {"id": "bb1a5556-187f-4323-ac6a-121b060ed77f", "title": "Woman survives knife attack after man goes on stabbing spree in Charlotte", "date": "2024-06-14 13:15", "url": "https://www.witn.com/2024/06/14/woman-survives-knife-attack-after-man-goes-stabbing-spree-charlotte/", "domain": "witn.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - A horrific series of knife attacks in Charlotte over a 24-hour period sent three people to the hospital, and the suspect behind bars.\nOn her way to the vehicle, she spotted a man sitting at a bus stop bench and gave it little thought.\n“That’s when the knife injured my hand.”The suspect started stabbing her wildly, and without cause or reason.\nBefore police could arrest Maitland, the suspect in the woman’s case, he allegedly committed two more stabbing attacks.\n“I’m just thankful because it could have been a lot worse.”Related: CMPD: Man arrested after stabbing 60-year-old woman, 2 others across Charlotte areaWatch continuous news coverage here:Copyright 2024 WBTV."}, {"id": "374e1a99-ceb1-4392-a8cb-e577b4e25885", "title": "Two women killed in Israeli strike on Janata", "date": "2024-06-14 07:45", "url": "https://www.naharnet.com:443/stories/en/305909-two-women-killed-in-israeli-strike-on-janata", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two civilians were killed and at least seven others injured in an Israeli nighttime strike on southern Lebanon, the country's national news agency reported on Friday.\nEnemy warplanes launched a raid targeting a three-story house in the town of Janata in the Tyre district, killing a woman, Sally Skaiki, and injuring seven other civilians, the agency said.\nSally Skaiki was a medical auxiliary in the Amal-affiliated al-Risala scout association.\nAnother woman, Dalal Ezzeddine later died of her wounds, local media said.\nThe escalation comes as some Israeli leaders have threatened all-out war to silence Hezbollah’s rocket fire, and as the militant group seeks to pressure Israel during the cease-fire negotiations in support of its ally Hamas."}, {"id": "5d33b737-33c0-4475-a5fc-ebce9b003667", "title": "Two women killed in Israeli strike on Janata", "date": "2024-06-14 12:30", "url": "https://www.naharnet.com/stories/en/305909-two-women-killed-in-israeli-strike-on-janata", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two civilians were killed and at least seven others injured in an Israeli nighttime strike on southern Lebanon, the country's national news agency reported on Friday.\nEnemy warplanes launched a raid targeting a three-story house in the town of Janata in the Tyre district, killing a woman, Sally Skaiki, and injuring seven other civilians, the agency said.\nSally Skaiki was a medical auxiliary in the Amal-affiliated al-Risala scout association.\nAnother woman, Dalal Ezzeddine later died of her wounds, local media said.\nThe escalation comes as some Israeli leaders have threatened all-out war to silence Hezbollah’s rocket fire, and as the militant group seeks to pressure Israel during the cease-fire negotiations in support of its ally Hamas."}, {"id": "06bf5cef-f6a9-4b8b-82c3-c61d3fc7aeff", "title": "Woman survives knife attack after man goes on stabbing spree in Charlotte", "date": "2024-06-14 13:00", "url": "https://www.wbtv.com/2024/06/14/woman-survives-knife-attack-after-man-goes-stabbing-spree-charlotte/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - A horrific series of knife attacks in Charlotte over a 24-hour period sent three people to the hospital, and the suspect behind bars.\nOn her way to the vehicle, she spotted a man sitting at a bus stop bench and gave it little thought.\n“That’s when the knife injured my hand.”The suspect started stabbing her wildly, and without cause or reason.\nBefore police could arrest Maitland, the suspect in the woman’s case, he allegedly committed two more stabbing attacks.\n“I’m just thankful because it could have been a lot worse.”Related: CMPD: Man arrested after stabbing 60-year-old woman, 2 others across Charlotte areaWatch continuous news coverage here:Copyright 2024 WBTV."}, {"id": "41a61256-f47d-44a8-b537-878a1160f066", "title": "Media avoid word  Christian  in Nashville shooting headlines", "date": "2024-06-14 14:30", "url": "https://www.christianpost.com/news/media-avoid-word-christian-in-nashville-school-shooting-headlines.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home News After warning of religious ‘attacks' on trans people, media avoid 'Christian' or 'transgender' in Nashville shooting headlinesDespite the loss of six lives at a Christian elementary school, not one of the nation’s biggest newspapers used the words “Christian” in their headlines for the mass shooting in Nashville earlier this week.\nThe shooter, later identified as Audrey Hale, 28, of Nashville, was a former student at the school and self-identified as trans, according to Metropolitan Nashville Police Chief John Drake.\nGet Our Latest News for FREE Subscribe to get daily/weekly email with the top stories (plus special offers!)\nJesus Christ is the only answer for them, and the Christian who knows that will never be their enemy.”The media response to the attack comes as federal government officials have yet to declare the Covenant School shooting as a hate crime.\nWhen asked by a reporter Tuesday whether he believed Christians were targeted in the Nashville shooting, President Joe Biden smiled and said, “I have no idea.”EWTN’s @owentjensen asked President Biden about whether Christians were targeted in the Nashville mass shooting, tonight on the South Lawn, upon his return from North Carolina."}, {"id": "365cfae2-65e0-458f-9efd-3dbc1db8adca", "title": "Russia , Ukraine exchange drone , missile attacks", "date": "2024-06-14 08:45", "url": "https://punchng.com/russia-ukraine-exchange-drone-missile-attacks/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Kyiv and Moscow staged dozens of drone and missile attacks overnight, officials said Friday, leaving several wounded in Ukraine and damaging a fuel reservoir site in a Russian border region.\nRussia said it had downed 87 Ukrainian drones, of which 70 had targeted the southern Rostov region that houses the headquarters of its military operation against Kyiv.\nThe attacks sparked power cuts in several areas of the Rostov region, its governor Vasily Golubev said on social media.\nIn Voronezh, which borders Ukraine, a fuel reservoir was slightly damaged by falling debris, its regional governor Aleksander Gusev said.\nKyiv meanwhile said Ukrainian air defence systems had downed 24 out of 31 Russian drones and missiles fired overnight."}, {"id": "f295e9a2-57db-4498-9837-d06295416a3a", "title": "US attack sub , Canada navy patrol ship arrive in Cuba on heels of Russian warships", "date": "2024-06-14 14:00", "url": "https://www.yahoo.com/news/us-attack-sub-canada-navy-132901979.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US attack sub, Canada navy patrol ship arrive in Cuba on heels of Russian warshipsHAVANA (Reuters) - A Canadian navy patrol ship sailed into Havana early on Friday, just hours after the United States announced a fast-attack submarine had docked at its Guantanamo naval base on Cuba, both vessels on the heels of Russian warships that arrived on the island earlier this week.\nHowever, both the U.S. and Cuba have said the Russian warships pose no threat to the region.\nRussia has also characterized the arrival of its warships in allied Cuba as routine.\nMoscow, which has maintained ties with Havana, has questioned the apparent nervousness of the West over the warships this week.\nThe Russian warships are expected to remain in Havana harbor until June 17."}, {"id": "14ad39c4-46ea-4f17-8690-eca366ff63b3", "title": "US attack sub , Canada navy patrol ship arrive in Cuba on heels of Russian warships", "date": "2024-06-14 15:00", "url": "https://www.aol.com/us-attack-sub-canada-navy-132901466.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "However, both the U.S. and Cuba have said the Russian warships pose no threat to the region.\nRussia has also characterized the arrival of its warships in allied Cuba as routine.\nCanada`s Margaret Brooke patrol vessel began maneuvers early on Friday to enter Havana harbor, part of what the Canadian Joint Operations Command called \"a port visit...in recognition of the long-standing bilateral relationship between Canada and Cuba.\"\nMoscow, which has maintained ties with Havana, has questioned the apparent nervousness of the West over the warships this week.\nThe Russian warships are expected to remain in Havana harbor until June 17."}, {"id": "e771a559-bfdf-4ede-9732-44f4df1d8143", "title": "Six years after U . S . mass shooting , demolition starts on Parkland school building", "date": "2024-06-14 19:15", "url": "https://www.unionleader.com/news/national/six-years-after-u-s-mass-shooting-demolition-starts-on-parkland-school-building/article_b969ae53-d2f9-5a2e-ad33-d2f3f5e45b1a.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "17c1c08a-a766-42d4-a094-f2e1f18329be", "title": "U . S . attack sub , Canadian navy patrol ship arrive in Cuba on heels of Russian warships", "date": "2024-06-14 14:15", "url": "https://www.theglobeandmail.com/world/article-us-attack-sub-canadian-navy-patrol-ship-arrive-in-cuba-on-heels-of/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Canadian navy patrol boat HMCS Margaret Brooke enters the Havana’s bay, Cuba, on June 14.Alexandre Meneghini/ReutersA Canadian navy patrol ship sailed into Havana early on Friday, just hours after the United States announced a fast-attack submarine had docked at its Guantanamo naval base on Cuba, both vessels on the heels of Russian warships that arrived on the island earlier this week.\nHowever, both the U.S. and Cuba have said the Russian warships pose no threat to the region.\nRussia has also characterized the arrival of its warships in allied Cuba as routine.\nMoscow, which has maintained ties with Havana, has questioned the apparent nervousness of the West over the warships this week.\n“Why do only signals related only to our army and navy reach the West?”The Russian warships are expected to remain in Havana harbor until June 17."}, {"id": "85af970a-ed23-43c0-b240-b964349fe462", "title": "Bad Bunny Concert Targeted for Would - Be Race War Mass Shooting , Feds Say", "date": "2024-06-14 14:30", "url": "https://www.tmz.com/2024/06/14/bad-bunny-concert-targeted-race-war-mass-shooting-federal-indictment/", "domain": "tmz.com", "domain_classification": "Unknown", "message": "An Arizona man allegedly tried to spark a race war ahead of the 2024 election by carrying out a mass shooting at a Bad Bunny concert ... so claim the feds, who stopped it.\nThe feds claim Prieto recruited the informant and FBI agent to help him launch his attack, thinking they were in lockstep with his racist views on Blacks, Jews and Muslims.\nThe feds specified in the court docs that Prieto wanted to trigger a \"race war prior to the 2024 United States Presidential Election.\"\nPrieto is alleged to have said he picked the Bad Bunny concert because of the high concentration of Black people that'd be in attendance.\nThe feds say they finally took down Prieto on May 14 -- the day of the Bad Bunny show at State Farm Arena – by pulling over the suspect as he drove through New Mexico."}, {"id": "3fe9e939-9afe-483f-bb6f-ac790b03717a", "title": "High debt levels causing  pressure beneath the surface  of household balance sheets , says BMO economist", "date": "2024-06-14 12:30", "url": "https://www.theglobeandmail.com/investing/markets/inside-the-market/article-high-debt-levels-causing-pressure-beneath-the-surface-of-household/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Daily roundup of resedarch and analysis from The Globe and Mail’s market strategist Scott BarlowBMO senior economist sees “pressure below the surface” of Canadian household balance sheets,“Canada’s household mortgage debt service ratio dipped in Q1, to a still-high 8.1% on a seasonally-adjusted basis.\nThat’s just down from the highest levels since at least 1990 set in prior quarters.\nBelow the surface, however, conditions continue to deteriorate as households are diverting more of their mortgage payments to interest, and less to principal.\nHe published his monthly review on Thursday,“Risky Business [global insurance] continue to be the highest ranked theme overall.\n***Diversion: “Just in time for Father’s Day: A list of what’s considered “dad rock” today” – A Journal of Musical Things"}, {"id": "a81835d1-5905-436f-a280-3ce2d72eeee3", "title": "Boy in Australia accused of terrorist act faces new charges of stabbing bishop", "date": "2024-06-14 13:00", "url": "https://www.scmp.com/news/asia/australasia/article/3266644/boy-australia-accused-terrorist-act-faces-new-charges-stabbing-bishop", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The earlier charge of committing a terrorist act carries a possible life sentence, while the new charges carry maximum sentences of 25 years each.\nA 16-year-old boy accused of committing a terrorist act by stabbing a bishop in a Sydney church in April faces two additional charges, a court was told on Friday.\nA prosecutor told the Parramatta Children’s Court on Friday that the boy had also been charged with wounding with intent to murder Bishop Mar Mari Emmanuel and wounding with intent to cause grievous bodily harm a priest, Reverand Isaac Royel.\n02:06 ‘You are my son’: stabbed Sydney bishop Mar Mari Emmanuel forgives teenage attacker ‘You are my son’: stabbed Sydney bishop Mar Mari Emmanuel forgives teenage attackerThe stabbing sparked a riot outside the Christ The Good Shepherd Church and a major investigation involving police and Australia’s main domestic spy agency.\nThey have been charged with an array of offences, including conspiring to engage in or planning a terrorist act."}, {"id": "42419aa7-4827-459d-9d02-6e8914ee6e26", "title": "Satellite images show Putin warships just miles away from US shores", "date": "2024-06-14 10:00", "url": "https://metro.co.uk/2024/06/14/satellite-images-show-putins-warships-just-miles-away-us-shores-21032589/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "A satellite image showing Russian vessels in Havana, Cuba (Picture: via Reuters)Satellite images show Russian warships moored in Cuba, around 100 miles from Florida.\nThe arrival of Putin’s vessels so close US shores has widely been seen as a show of force from the leader, as tensions rise over the Ukraine war.\nThe US, meanwhile, said there was no evidence of Russia transferring any missiles to Cuba, but added it would remain vigilant.\nThe warships, which were not carrying nuclear weapons, will remain in Havana until June 17, before moving onto Venezuela.\nTourists pass by Putin’s moored warships (Picture: Reuters)Crew members work on the nuclear-powered cruise missile submarine Kazan (Picture: Reuters)‘So we don’t see any reason (for the west) to worry in this case,’ he said."}, {"id": "d3dfbb14-7dff-4889-a3a7-fa1c20a07e49", "title": "Winnipeg man charged with second - degree murder in fatal stabbing - Winnipeg", "date": "2024-06-14 19:00", "url": "https://globalnews.ca/news/10567485/winnipeg-kennedy-street-homicide-arrest/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailWinnipeg police have made an arrest in a fatal downtown stabbing.\nMatthew Gerald Tomack Pelletier, 36, has been charged with second-degree murder in connection with the death of Ricky Mancheese, 49, police said.\n1:01 Winnipeg police identify 49-year-old man as homicide victimMancheese was found in the 400 block of Kennedy Street just before noon on Tuesday and was taken to hospital in critical condition, where he later died.\nStory continues below advertisementPolice said they were able to quickly identify a suspect and arrested Pelletier the next day.\nAnyone with information is asked to call the homicide unit at 204-986-6508 or Crime Stoppers at 204-786-TIPS (8477)."}, {"id": "4a4952fb-9c1b-4a16-9e10-204e0b1fdcaa", "title": "Lebanon Hezbollah reveals more of its arms in risky escalation – Ya Libnan", "date": "2024-06-14 14:30", "url": "https://yalibnan.com/2024/06/14/lebanons-hezbollah-reveals-more-of-its-arms-in-risky-escalation/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "MORE ‘SURPRISES’Hezbollah began trading fire with Israel on Oct. 8, a day after its Palestinian ally Hamas attacked southern Israel, sparking the Gaza war.\nHezbollah says it will cease fire only when the Gaza war stops.\nIsraeli strikes have killed more than 300 Hezbollah fighters and around 80 civilians in Lebanon, according to Reuters tallies.\nPrior to this conflict, Israel and Hezbollah had avoided a major clash since a month-long war in 2006, deterred since then by mutual threats of catastrophic destruction.\nRESTORING LOST DETERRENCEThe United States, which deems Hezbollah a terrorist group, has led diplomatic efforts to de-escalate the conflict."}, {"id": "c6fcf2b7-7e79-4675-8a54-eb200495292c", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 13:30", "url": "https://www.telegraphherald.com/ap/international/article_641d1e11-eceb-5b13-bead-0a964b553eb6.html", "domain": "telegraphherald.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "1cb44926-0151-4094-951d-e73fececa354", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels", "date": "2024-06-14 13:30", "url": "https://www.wdio.com/front-page/world-national/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer USS Laboon during a deployment in the Red Sea on Wednesday, June 12, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said."}, {"id": "5cd3805a-3172-45d7-92b2-d8d688d3eeb9", "title": "DRDO to Showcases Indigenous Defense Might at Eurosatory 2024 – Indian Defence Research Wing", "date": "2024-06-14 13:15", "url": "https://idrw.org/drdo-to-showcases-indigenous-defense-might-at-eurosatory-2024/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "DRDO to Showcases Indigenous Defense Might at Eurosatory 2024| BySOURCE: AFIIndia’s premier defense research agency, the Defence Research and Development Organisation (DRDO), is making a strong impression at the ongoing Eurosatory 2024, a leading global defense and security exhibition held in Paris, France.\nDRDO’s presence at Eurosatory is centered around its cutting-edge weapon systems and platforms designed to address contemporary battlefield requirements.\nLCA Mk1A Tejas: The latest iteration of India’s indigenously developed Light Combat Aircraft boasts significant advancements over its predecessor.\nArjun MBT Mk-1A: This indigenously developed Main Battle Tank strengthens India’s self-reliance in armored fighting vehicles.\nThis ship-launched, heavy-weight, electrically propelled anti-submarine torpedo is designed to effectively target quiet submarines in various water depths."}, {"id": "ece30658-9f56-4b5f-8a44-a694c2ea2f2f", "title": "Police chief finds tools to combat PTSD in veterans , officers during trip to Israel", "date": "2024-06-14 00:00", "url": "https://wlos.com/news/local/waynesville-police-chief-israel-trip-combatting-ptsd-veterans-officers-tools", "domain": "wlos.com", "domain_classification": "Unknown", "message": "It’s not connected to the ongoing war with Hamas, but rather to gain knowledge to benefit both military veterans and even police officers here.\nHe recently wrapped up a 10-day trip as a coach for Heroes to Heroes, which helps combat veterans heal from the traumas of war and often the moral injuries they carry with them.\nAdams says that spirituality can help veterans combat suicidal thoughts and reintegrate into communities with support and planning“A lot of them struggle ...I think they're averaging now still around 22 a day take their lives.\nThe mission of Heroes to Heroes has extended from veterans to law enforcement officers who put their lives on the line too.\nAdams is carrying back from Israel tools his officers can use including listening to unique stories, mental health awareness and physical fitness."}, {"id": "98c66a0a-2be2-4e74-bc7e-7bb371e10da9", "title": "Politico : Lukashenka Secretly Supplies Weapons To Azerbaijan In Conflict With Armenia", "date": "2024-06-14 12:30", "url": "https://charter97.org/en/news/2024/6/14/598893/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Politico: Lukashenka Secretly Supplies Weapons To Azerbaijan In Conflict With Armenia 19 14.06.2024, 8:3614,882The newspaper has obtained documented evidence.\nBelarus was supplying modern weapons to Azerbaijan in its conflict with Armenia, despite the fact that both countries - Armenia and Belarus - are members of the CSTO and are formally allies.\nPolitico has obtained documents confirming the facts of arms deliveries.\nSecret documents obtained by Politico prove that Belarus was actively assisting Azerbaijan's armed forces between 2018 and 2022, when tensions with Armenia were at their peak.\nThe offered services included \"modernisation of outdated artillery equipment and supply of new equipment used for electronic warfare and drone systems\"."}, {"id": "3438afc8-cab0-4b25-93a3-e4e5272e2675", "title": "The Israeli hostage rescue and Christian just war theory", "date": "2024-06-14 09:45", "url": "https://www.christiantoday.com/article/the.israeli.hostage.rescue.and.christian.just.war.theory/141828.htm", "domain": "christiantoday.com", "domain_classification": "Unknown", "message": "Those who have welcomed the raid have done so because it resulted in the release of the four Israeli hostages.\nIt was an act by the Israeli military duly authorised by the Israeli government.\nBlaming the Israelis is like blaming the Allied forces rather than the Germans for the 35,000 civilian casualties in the Normandy landings in 1944.\nThere would have been zero civilian casualties if the Germans had not started the war in the first place.\nSimilarly, there would have been zero civilian casualties in Nuseirat had Hamas not attacked Israel on 7 October."}, {"id": "ea3e8824-02c2-433b-9fcf-c1cf6c46c828", "title": "How To Complete Beastly Battle Of Wits In Shin Megami Tensei V", "date": "2024-06-14 19:15", "url": "https://kotaku.com/shin-megami-tensei-v-vengeance-nozuchi-tips-1851540294", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "A prime example of this occurs when you meet the Nozuchi in a corner of West Shinbashi, who presents you with the “Beastly Battle of Wits” quest.\nTo complete this quest, you’ll have to solve three “riddles” the Nozuchi presents to you.\nAdvertisementBefore we dissect each phase of the Beastly Battle of Wits, know that some combat is involved to complete this quest.\nSo, if you look for a hill in the Shiba region where Kodama lurk, you should find the Sangaku Beads.\nAdvertisementAfter you resolve the battle, the Nozuchi will reflect on its ways and bring the Beastly Battle of Wits to an end for good."}, {"id": "d871757f-94ec-4055-9f5f-a4e3258727d5", "title": "Russia - Ukraine war reveals critical SHORTAGE of 155mm artillery shells across the United States – NaturalNews . com", "date": "2024-06-14 19:00", "url": "https://www.naturalnews.com/2024-06-14-russia-ukraine-war-reveals-shortage-artillery-shells.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "Russia-Ukraine war reveals critical SHORTAGE of 155mm artillery shells across the United StatesModern warfare is still waged with traditional weaponry like bullets and artillery shells, but the U.S is facing challenges in producing enough of the latter.\nHowever, there's a critical shortage of these shells, revealing the neglect of munitions production infrastructure since the end of the Cold War.\nFoundries making artillery shells being overhauledBloomberg News zoomed in on the Scranton Army Ammunition Plant (SCAAP) located in the Keystone State.\nWatch this report about Russia outproducing the West when it comes to drones and artillery shells.\nMore related stories:NATO’s ammo shortage worsens due to skyrocketing prices and Ukrainian troops’ overconsumption of artillery shells."}, {"id": "8746046d-addb-479a-bfdf-23313ae5d50c", "title": "Major events in the Russian invasion of Ukraine", "date": "2024-06-14 05:30", "url": "https://uk.news.yahoo.com/major-events-russian-invasion-ukraine-050627865.html", "domain": "uk.news.yahoo.com", "domain_classification": "Unknown", "message": "(Reuters) - Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nMay 20, 2022: Russian forces capture Mariupol in southeastern Ukraine after a three-month siege, during which Kyiv estimates more than 20,000 civilians were killed.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "0953fab7-0413-4aab-8e8d-244f76657b93", "title": "The Third World War 1989 mod for Civilization III : Conquests", "date": "2024-06-14 04:45", "url": "https://www.moddb.com/mods/the-third-world-war-1989", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Nearly ten years after its original release, The Third World War 1989 scenario for Civilization III has been re-uploaded and is at your fingertips.\nThe game is now capable of running with the CXE patch, which allows new modding options never before available to Civ 3.\nPrimarily, this means that the number of starting units has been severely cut down, with emphasis on reducing battalion-sized forces and reserves.\nOverhauled combat - While the map may look the same, every aspect of land, sea, and air warfare has been updated.\nThe game is still capable of being run normally without CXE, but a large number of changes are now available."}, {"id": "f8db621f-ffbe-494d-a45c-5c6834c2f91f", "title": "Marine training shifts may ad tech , change officer assignments", "date": "2024-06-14 00:00", "url": "https://www.marinecorpstimes.com/news/your-marine-corps/2024/06/13/marine-training-shifts-may-ad-tech-change-officer-assignments/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "“These initiatives collectively aim to equip the Marine Corps with the most modern, lethal, and capable Marines conceivable,” Iiams said.\nThe communication training battalion at Training Command is assessing how to combine critical skillsets from three communications job fields, 062X, 063X and 067X.\nAlso in the tech vein, the service will have deployed live, virtual, constructed training simulators to Marine Corps Air Ground Combat Center, Twentynine Palms, California, Camp Pendleton, California and Marine Corps Bases Hawaii and Okinawa, Japan, before October.\nAt the same time, each Marine expeditionary force and the Marine air-ground task force training command will receive one battalion-capable Marine Corps Tactical Instrumentation System by summer.\nThe training command is preparing to field electromagnetic spectrum simulators at Twentynine Palms, California, that can replicate adversary electronic warfare capabilities in training."}, {"id": "a8c020dd-3795-4f73-be4e-10a19a313ecf", "title": "Europe Bloodiest Conflict : Ukraine Struggle Against Russia", "date": "2024-06-14 06:00", "url": "https://www.devdiscourse.com/article/law-order/2982442-europes-bloodiest-conflict-ukraines-struggle-against-russia", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nFeb-April, 2022: Advancing Russian forces are halted at the outskirts of Kyiv after meeting stiffer-than-expected resistance.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "fefaf63e-4905-4fa7-8684-ecad332ed975", "title": "Indian Army inducts indigenous Nagastra - 1 kamikaze drones from Solar Industries", "date": "2024-06-14 17:15", "url": "https://news.webindia123.com/news/Articles/World/20240614/4205745.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Indian Army has inducted indigenous Loiter Munition, Nagastra-1, developed by Nagpur-baser Solar Industries.\nThe Indian Army has placed an order with Economics Explosives Ltd (EEL), a subsidiary of Solar Industries, for the supply of 480 Loiter Munitions under an emergency purchase agreement, signaling the readiness of Indigenous defence capabilities, Defence Industry officials said.\nEquipped with day and night surveillance cameras and a 1-kilogram High Explosive Fragmenting Warhead, the Loiter Munition stands ready to combat soft-skin targets effectively.\nThe rise in drone-related incidents along India's Northern borders underscores the urgent need for indigenous capabilities in utilising drones and UAVs for combat applications.\nSolar Industries has taken proactive steps to address this need by developing weaponized drones capable of neutralizing various targets, whether through gravity drop bombs, guided missiles, or drones in a kamikaze mode, as exemplified by the Nagastra-1 Loiter Munition."}, {"id": "d38e4d31-f7ae-4e86-ab5b-5b9b8c2764a7", "title": "We must support IDF soldiers , bot mentally and physically", "date": "2024-06-14 07:00", "url": "https://www.jpost.com/opinion/article-806160", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The tragic story of Eliran Mizrahi has haunted the country for the last week.\nHowever, inexplicably, he received a Tzav 8 (emergency call-up order) from the IDF last week to return to Gaza two days later.\nInstead, at the beginning of the week, Mizrahi took his own life.\nThe decision was made after consultations with Defense Minister Yoav Gallant and IDF Chief of Staff Lt.-Col. Herzi Halevi.\nMay the lesson from his tragic story resonate with the IDF and those who send our sons and daughters to war."}, {"id": "50edbd15-cbc7-46a1-88ba-9f6439491a1d", "title": "The American public must rethink its relationship with the military", "date": "2024-06-14 00:00", "url": "https://www.michigandaily.com/opinion/columns/the-american-public-must-rethink-its-relationship-with-the-military/", "domain": "michigandaily.com", "domain_classification": "Unknown", "message": "The military budget is one aspect that needs this closer look.\nRegardless of who the American public feels may be the aggressor, prioritizing a diplomatic when possible approach avoids breeding contempt in foreign areas.\nMoreover, lowering our military budget doesn’t necessarily mean creating a power vacuum that a new country would fill.\nReworking our relationship with military contractors will allow us to reduce our spending without affecting our military capabilities.\nMoreover, reducing our defense spending and avoiding unwinnable wars not only preserves American lives, but also spares countless lives abroad."}, {"id": "de1dc039-3eb3-46ee-873a-2b7c24c68100", "title": "US Navy faces its most intense combat since World War II against Yemen Iran - backed Houthi rebels | News , Sports , Jobs", "date": "2024-06-14 18:30", "url": "https://www.tribtoday.com/news/latest-news/2024/06/us-navy-faces-its-most-intense-combat-since-world-war-ii-against-yemens-iran-backed-houthi-rebels/", "domain": "tribtoday.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world’s waterways.\nBut instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.\nThe U.S.-led campaign against the Houthi rebels, overshadowed by the Israel-Hamas war in the Gaza Strip, has turned into the most intense running sea battle the Navy has faced since World War II, its leaders and experts told The Associated Press.\nEric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\n“This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,” said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute."}, {"id": "3496cae4-67bf-4aad-9c38-68bf14201169", "title": "Here are the best games we played and saw at Summer Game Fest 2024", "date": "2024-06-14 19:15", "url": "https://mobilesyrup.com/2024/06/14/summer-game-fest-2024-best-games-astro-bot-metaphor-refantazio-star-wars-outlaws/", "domain": "mobilesyrup.com", "domain_classification": "Unknown", "message": "Thankfully, I was able to attend Summer Game Fest, the Xbox Games Showcase and Ubisoft Forward to check out dozens of games, both in the presentations themselves and in media-only previews.\nZeroPlatform: PlayStation 5, Xbox Series X/S, PCRelease date: October 10th, 2024One game that really tugged at my nostalgic heartstrings was Dragon Ball: Sparking!\n-Andrew MohanHarmonium: The MusicalPlatforms: Netflix Games (Android and iOS), Xbox Series X/S (plus Xbox Game Pass)Release date: TBAHarmonium The Musical is a really unique puzzle-solving narrative-adventure game with charming Pixar-esque animation.\nThough I was initially skeptical, I’m now more excited to re-experience one of the best Sonic games in history along with some new side content.\n-Brad ShankarWhat were your favourite games that you saw during Summer Game Fest?"}, {"id": "73d1952a-d46e-4663-9d92-bd8eca53f6b2", "title": "Erased : WWII Heroes of Colour - National Geographic Channel HD", "date": "2024-06-14 12:30", "url": "https://www.tvguide.co.uk/schedule/5e6f3fa9-af55-5975-8418-0cab4b1003f2/erased-wwii-heroes-of-colour", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Erased: WWII Heroes of ColourNational Geographic Channel HD 6:00 PM to 7:00 PM Friday 14 June Share Add toCalendar +Battle of the Bulge Season 1 Episode 4 of 4 S Subtitles Audio DescriptionThe untold story of the Black Panthers, an elite African American tank battalion, who fought in the bloodiest American battle of the Second World WarErased: WWII Heroes of Colour airs on National Geographic Channel HD at 6:00 PM, Friday 14 June .\n(Subtitles, audio description.)\nLearn more about Erased: WWII Heroes of Colour and other education/science/factual topics on our factual page"}, {"id": "a9bd2885-a808-45b6-9cd7-d699a091e658", "title": "Alexander Gardner : The Civil War Photographer", "date": "2024-06-14 16:15", "url": "https://www.theepochtimes.com/bright/alexander-gardner-the-civil-wars-photographer-5667526", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "During the Great Exhibition of 1851 in London, Alexander Gardner (1821–1882) saw the work of photographer Mathew Brady.\nCapturing the War Gardner became the official photographer for the Army of the Potomac with an honorary rank of captain.\nTwo days after the battle, Gardner arrived at the battlefield with his camera equipment and portable darkroom.\nThis photo was taken by Alexander Gardner not long after the Civil War’s first battle in Antietam, Md.\nWhen considering his work, specifically that of the Civil War, Gardner accurately described it, stating , “It is designed to speak for itself."}, {"id": "2c3b8616-8c8d-43cb-be65-c17527518254", "title": "Ukrainian and Russian leaders assess resources as war heads into second winter", "date": "2024-06-14 17:15", "url": "http://www.myanmarmuslim.net/news/20240615323e599622.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukraine President Volodymyr Zelensky said he has spoken by phone with US President Joe Biden about Washington’s future support for Kyiv.\nThe contact came as Russian President Vladimir Putin visited a military base near the Ukrainian border, as the warring countries laid plans for combat operations over winter and the coming year.\nAlmost 20 months of war have sapped both sides’ military resources.\nWestern help has been crucial for Ukraine’s war effort.\nThat will help stretch Russia’s manpower resources which are already under strain, according to the Institute for the Study of War, a Washington think tank."}, {"id": "57875076-9a10-4cdc-aa5c-cf452b15b384", "title": "G7 leaders tackle the issue of migration on the second day of summit in Italy", "date": "2024-06-14 09:30", "url": "https://www.irishexaminer.com/world/arid-41416108.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Leaders of the G7 are turning their attention to migration on the second day of their summit on Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.\nShe has also spearheaded the “Mattei Plan” for Africa, a continentwide strategy to increase economic opportunities at home and so discourage migration to Europe.\nUS President Joe Biden introduced new policies to curb migration after a bill he tried to get through Congress failed to pass.\nTackling migration “is a common challenge,” European Council president Charles Michel said after arriving at the summit.\nPope Francis will also become the first pontiff to address a G7 summit when he delivers a speech on artificial intelligence on Friday."}, {"id": "f845d39a-e3b7-4932-a47f-ffa6ae7a0418", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 14:00", "url": "https://us.cnn.com/2024/06/14/middleeast/israel-catapult-trebuchet-lebanon-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "38d31ce5-ce4d-4d95-95fc-dd091a8d4313", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 11:00", "url": "https://edition.cnn.com/2024/06/14/middleeast/israel-catapult-trebuchet-lebanon-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "53daca0f-90e7-4647-9e96-1b758a1b113a", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:00", "url": "https://saudigazette.com.sa/article/643588/World/Mena/Israeli-troops-catapult-fireball-into-Lebanon-using-weapon-rarely-used-since-16th-century", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "BEIRUT — Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "73650ddc-f7f8-4809-ad61-7d72c3703780", "title": "Russian warships off the Florida coast | LETTER | Letters", "date": "2024-06-14 05:00", "url": "https://www.reviewjournal.com/opinion/letters/letter-russian-warships-off-the-florida-coast-3068878/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "It’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nIt’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nWe should be worried that ships potentially carrying hypersonic missiles and subs possibly carrying atomic warheads are so close.\nThis is the second time we’ve come close to nuclear war, both times during Democratic presidencies.\nI hope cooler heads prevail, but for the media to downplay this because it’s the candidate of their choice who is putting us in harm’s way is a disgrace."}, {"id": "a2f28191-21ff-417c-b093-5109c8066949", "title": "South Korea fires warning shots as North Korean soldiers briefly cross border", "date": "2024-06-14 10:00", "url": "http://www.myanmarmuslim.net/news/20240614411f599579.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea’s military said on Tuesday.\nThose North Korean soldiers carrying construction tools — some of them armed — immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nBut South Korean media reports said that about 20-30 North Korean soldiers had entered South Korean territory about 50 metres (165 feet) after they likely lost their way.\nThe reports said most North Korean soldiers carried pickaxes and other construction tools.\nSouth Korea said North Korea has installed its own border loudspeakers in response but has not turned them on yet."}, {"id": "3584c2c6-a160-4768-86f2-74bf9915bc95", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 16:15", "url": "https://krdo.com/news/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "The trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "50988e70-dce5-406a-a40e-e7b69f04da77", "title": "Samurai Warriors 4 DX Game Review", "date": "2024-06-14 18:00", "url": "https://www.animenewsnetwork.com/review/game/pc/steam/samurai-warriors-4-dx/.211628", "domain": "animenewsnetwork.com", "domain_classification": "Unknown", "message": "Samurai Warriors 4 DX is a great Warriors title through and through, and a surprise port dropped out of the blue for us to enjoy.\nLet's specifically talk Samurai Warriors 4 DX .\nThis was followed by a suite of additional releases, including Samurai Warriors 4-2 the following year with added content, Samurai Warriors 4 Empires with its macro-level focus, and eventually Samurai Warriors 4 DX in 2019.\nSamurai Warriors 4 DX follows famed leaders like Oda Nobunaga, Takeda Shingen, and Tokugawa Ieyasu.\nAt the time of writing, Samurai Warriors 4 DX retails for $50 or your regional equivalent."}, {"id": "29f5ef24-87f9-4cf9-ad5f-5606ce4e72d6", "title": "House of the Dragon : What to Expect in Future Seasons", "date": "2024-06-14 19:15", "url": "https://www.vulture.com/article/house-of-the-dragon-future-seasons-book-storyline.html", "domain": "vulture.com", "domain_classification": "Unknown", "message": "All that said, here’s an overview of what to expect in coming seasons of House of the Dragon.\nThe Dance Kicks off With Some Child MurderSeason one of House of the Dragon ends with Aemond killing Lucerys while he attempts to flee Storm’s End in the rain.\nPrincess Rhaenys and her dragon Meleys come to the rescue, but King Aegon and his dragon Sunfyre and Prince Aemond on Vhagar, the largest living dragon, are there to meet her.\nShe and her son Aegon III arrive at Dragonstone only to discover that King Aegon II is there waiting for them.\nKing Aegon’s dragon is dying, but he gives Sunfyre one last meal: With her son watching, Aegon feeds Queen Rhaenyra to his dragon."}, {"id": "5e4bdf0d-c4bf-4350-9b4a-421760bb7915", "title": "Politico : Belarus supplied arms to Azerbaijan in  betrayal  to Armenia", "date": "2024-06-14 14:45", "url": "https://www.yahoo.com/news/politico-belarus-supplied-arms-azerbaijan-134513224.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Belarus delivered advanced weapons to Azerbaijan for years, despite being in a Russia-led security alliance with Armenia, Politico reported on June 13, citing a cache of leaked documents.\nArmenia's Prime Minister Nikol Pashinyan announced on June 12 that Armenia was to withdraw from the Collective Security Treaty Organization (CSTO), a military alliance made up of Russia, Armenia, Belarus, Kazakhstan, Tajikistan, and Kyrgyzstan.\n\"We will leave,\" Pashinyan told the Armenian parliament, accusing the CSTO of plotting \"against us with Azerbaijan,\" which seized the region of Nagorno-Karabakh in 2023.\nAccording to Politico, a cache of letters, diplomatic notes, bills of sale, and export passports show that Belarus supplied \"advanced military hardware to Azerbaijan between 2018 and 2022.\"\nThe move is likely regarded as a \"bitter betrayal\" by Armenia as the supplies gave Baku the \"upper hand\" in its conflict with Yerevan, Politico said."}, {"id": "78afb1fa-ce68-4deb-8d25-f8a031dbe2fe", "title": "NATO to build three large bases to supply weapons to Ukraine , Orban says", "date": "2024-06-14 09:00", "url": "https://tass.com/world/1803245", "domain": "tass.com", "domain_classification": "Unknown", "message": "The North Atlantic Alliance is planning to establish three large military bases in ally countries in order to coordinate weapons supplies to Ukraine, Hungarian Prime Minister Viktor Orban said.\nAccording to the Hungarian premier, the bloc seeks \"to help Ukraine by establishing the so-called NATO’s Ukraine mission.\"\n\"This means that NATO will coordinate weapons supplies to Ukraine,\" Orban told a morning talk show on Radio Kossuth.\nOrban expressed concern that should these bases be built in Poland, Romania, Slovakia and other Ukrainian neighbors they will \"become military targets.\"\n\"Obviously, colossal pressure is being put on us from the [other] 31 NATO member countries to sway us from the position of peace to the side of war,\" Orban continued."}, {"id": "3f8c9b38-403f-4fc3-b7c8-bf4374335ced", "title": "How to get Civil War on 4K Blu - ray and DVD", "date": "2024-06-14 00:45", "url": "https://www.digitalspy.com/movies/a61101394/civil-war-4k-blu-ray-dvd/", "domain": "digitalspy.com", "domain_classification": "Unknown", "message": "The critically acclaimed film Civil War is coming soon to home video.\nWhile Civil War has already had its digital release on streaming services, the film will be getting its physical release next month.\nYou can opt for the standard Blu-ray release of Civil War, available for pre-order now for for £14.99 or £16.99 on .\nThe film concludes with a haunting and violent climax — one that's unlikely to leave your thoughts for some time after seeing Civil War.\nCivil War is now streaming on all major digital retailers in the UK."}, {"id": "0a49ffae-6fcc-4b6f-abe0-0c60915055f1", "title": "My Hero Academia Season 7 Episode 7 : Will Deku Be Able To Return To Get Past Toga ? Release Date And More", "date": "2024-06-14 16:00", "url": "https://www.pinkvilla.com/entertainment/anime/my-hero-academia-season-7-episode-7-will-deku-be-able-to-return-to-get-past-toga-release-date-and-more-1316913", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "My Hero Academia Season 7 Episode 7: Release date and where to streamMy Hero Academia Season 7 Episode 7 is set to premiere on Saturday, June 15, 2024, at 5:30 pm JST, as confirmed by the anime’s website.\nFor Japanese viewers, My Hero Academia Season 7 Episode 6 will air on local networks like Nippon TV and its affiliated channels.\nExpected plot of My Hero Academia Season 7 Episode 7My Hero Academia Season 7 Episode 7 will be titled Inflation, and fans can anticipate a continuation of the battle between Bakugo, Mirko, and their team against Shigaraki.\nAdvertisementMy Hero Academia Season 7 Episode 6 recapMy Hero Academia Season 7 Episode 6 is titled Division and opens with a flashback to All Might's visit to the students' dorm to discuss the strategy for the second final battle.\nFor more details on the final battle against All For One in My Hero Academia Season 7, keep an eye on Pinkvilla."}, {"id": "292d140f-6a86-4b7a-b246-cf04debf3abd", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century - LocalNews8 . com", "date": "2024-06-14 14:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "The trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "d6747f39-4085-4dc4-8b47-319c7f301de5", "title": "SYRIA - UN UN : Syrian Kurdish militias conscripted more than 200 child soldiers in 2023", "date": "2024-06-14 10:45", "url": "https://www.asianews.it/news-en/UN:-Syrian-Kurdish-militias-conscripted-more-than-200-child-soldiers-in-2023-60946.html", "domain": "asianews.it", "domain_classification": "Unknown", "message": "This is according to the latest UN report 'Children and Armed Conflict' soon to be published.\nViolations and abuses at an \"alarming\" level throughout the country, violations of child rights.\nDamascus (AsiaNews) - The Syrian Kurdish militias of the People's Protection Units (YPG) forcibly recruited hundreds of child soldiers into their ranks in 2023.\nAs for child soldiers, the ascertained number of those enlisted in the armed ranks in 2023 is 231.\nThe UN chief called for the unconditional and immediate release of all children from recruitment and forced detention, for which Kurdish militias have been largely responsible during the ongoing 13-year Syrian conflict."}, {"id": "48c0169c-3ef1-4417-863a-912f144631f3", "title": "Final Fantasy 14 Yoshi - P shoots down speculation he remaking FF9 - and that hed morph the turn - based JRPG into an action game , thank you very much", "date": "2024-06-14 16:15", "url": "https://www.gamesradar.com/games/final-fantasy/final-fantasy-14s-yoshi-p-shoots-down-speculation-hes-remaking-ff9-and-that-hed-morph-the-turn-based-jrpg-into-an-action-game-thank-you-very-much/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "No, Naoki Yoshida and the Final Fantasy 14 gang aren't working on the long-rumored Final Fantasy 9 remake, and even if he was, he wouldn't change the turn-based battle system.\nThe long-gestating rumors of an alleged Final Fantasy 9 remake have been doing the rounds once again over the past few days.\nSo no, this isn't confirmation that Final Fantasy 9's long-rumored remake is actually in development.\nThe Final Fantasy 9 director adds that he reckons he knows where the speculation has originated from.\nIf there is a Final Fantasy 9 remake in development, maybe it won't be a PS5 exclusive like Final Fantasy 7 Rebirth."}, {"id": "6421eeba-a724-4b96-9c4b-f2f7fc322a26", "title": " [ Recruiting Indian Citizens In Russian Army ] Mother Of Commission Agent Approaches Kerala High Court Seeking Protection From CBI Probe", "date": "2024-06-14 10:30", "url": "https://www.livelaw.in/high-court/kerala-high-court/kerala-high-court-recruiting-indian-citizens-russian-army-mother-commission-agent-approaches-seeking-protection-from-cbi-investigation-260511", "domain": "livelaw.in", "domain_classification": "Unknown", "message": "A 65-year-old mother has invoked the writ jurisdiction of the Kerala High Court seeking protection from the probe of the CBI alleging that her son was involved in trafficking Indian nationals to Russia.\nIt is alleged that traffickers seize the passports of Indian nationals on reaching Russia and they are given training in combat roles and provided with the uniform of the Russian army.\nIt is further alleged that the traffickers deploy Indian nationals at war front bases in the Russia-Ukraine war zone.\nMedia has reported that two Indian nationals recruited by the Russian army were killed in an ongoing war between Ukraine and Russia.\nAdvocate Naveen Radhakrishnan, Counsel for the petitioner stated her son was innocent and that she has no knowledge about his whereabouts."}, {"id": "53693abd-ea44-443d-b0a0-07bf2b26a666", "title": "Pentagon ran secret anti - vax campaign to undermine China during pandemic", "date": "2024-06-14 16:45", "url": "https://www.aol.com/pentagon-ran-secret-anti-vax-161018430.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The Pentagon campaign preyed on those fears.\nChina’s efforts to gain geopolitical clout from the pandemic gave Braga justification to launch the propaganda campaign that Reuters uncovered, sources said.\nThe Pentagon campaign sought to intensify fears about injecting a pig derivative.\nBut the Post report did not reveal that the program evolved into the anti-vax propaganda campaign uncovered by Reuters.\nA Reuters investigation: Pentagon ran secret anti-vax campaign to undermine China during pandemic https://www.reuters.com/investigates/special-report/usa-covid-propaganda/This article originally appeared on USA TODAY: Pentagon ran secret anti-vax campaign to undermine China"}, {"id": "a15adf3c-bc93-4a27-a98c-048652ecd322", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:30", "url": "https://ktvz.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Israeli troops have used a medieval-style catapult to toss fireballs across the border into Lebanon, as fighting ramps up between Israel and the Iran-backed Islamist group Hezbollah.\nThe trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN."}, {"id": "3d0e3a70-c131-4deb-bda7-e236eb90ab04", "title": "Battle Lines : Israel hostage rescue , Far - right gains in EU election", "date": "2024-06-14 10:45", "url": "https://www.telegraph.co.uk/world-news/2024/06/13/battle-lines-israel-hostage-rescue-far-right-gains-in-eu/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "e356353a-c9ed-40f2-9eac-119543507f8f", "title": "Ukraine older recruits await help from younger fighters", "date": "2024-06-14 14:15", "url": "https://www.thestar.com.my/news/world/2024/06/14/ukraine039s-older-recruits-await-help-from-younger-fighters", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "DONETSK REGION, Ukraine (Reuters) - Huddling in the dark with his automatic rifle, 50-year-old Ukrainian soldier \"Bell\" said he wished more of his younger compatriots would join the fight against Russia's invasion.\nFacing a bigger and better equipped enemy, Ukrainian forces are heavily reliant on older soldiers like him to defend the country against relentless Russian assaults.\nUkraine is under pressure to call up more troops as the 27-month-old war grinds on and fewer volunteers line up than in the first months of the war.\nSome Ukrainian officials have estimated the average age of the Ukrainian soldier is more than 40-years-old.\nThe brigade's chief sergeant, call sign Deputy, said many of the men currently training are over 50 years-old but that they are more motivated than younger troops."}, {"id": "246538d9-b1d7-4347-ad4e-01c92912c03c", "title": "Yars Rising stretches its ties to the Atari classic , but somehow kind of works", "date": "2024-06-14 13:30", "url": "https://www.destructoid.com/yars-rising-stretches-its-ties-to-the-atari-classic-but-somehow-kind-of-works/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Yars Rising was recently announced as a follow-up of sorts to Atari 2600 classic Yars’ Revenge.\nRather than taking the form of a Zorlon Cannon-blasting shooter, Yars Rising is a hacking-centric Metroidvania with a demo now live during Steam Next Fest.\nYars Rising is also chock full of fully-voiced dialogue exchanges, so if you’re into that there’s plenty of it in this short jaunt.\nThus, the jury is out on whether or not the stealth portion of Yars Rising will be a thorn in the side of those who aren’t fond of sneaking missions.\nI may not be wild about what I’ve played of Yars Rising, but I’m curious."}, {"id": "6de59039-5c86-4a59-a5f7-0f8a6e045ba5", "title": "More than 5 , 000 items stolen during Franco regime catalogued by Spanish government", "date": "2024-06-14 14:45", "url": "https://www.euronews.com/culture/2024/06/14/more-than-5000-items-stolen-during-franco-regime-catalogued-by-spanish-government", "domain": "euronews.com", "domain_classification": "Unknown", "message": "A list of over 5,000 art items seized by the Franco regime have been published by the Spanish government so they can be returned to their original owners’ ancestors.\nMany items were also lost in the chaos of the conflict or given as a gift to Franco’s government by his supporters.\nThe Spanish Ministry of Culture has published the list of objects online as part of the government’s effort to bring “justice, reparation and dignity” to the victims of the conflict.\n\"The first step was to inventory and if no one asks for it, we'll see what we do.\nEach piece has its story and we want to do everything with maximum legal certainty,\" Culture Minister Ernest Urtasun said."}, {"id": "2df32c9b-6e25-491a-a78e-f91a17d65ee6", "title": "The story of the flags raised on Iwo Jima | News , Sports , Jobs", "date": "2024-06-14 08:45", "url": "https://www.ironmountaindailynews.com/opinion/2024/06/the-story-of-the-flags-raised-on-iwo-jima/", "domain": "ironmountaindailynews.com", "domain_classification": "Unknown", "message": "The time and place: Let’s turn back the hands of time to Feb. 23, 1945, (World War II) to Iwo Jima and Mount Suribachi.\nThe considerably larger flag could be seen from the countryside by the Marines and naval ships surrounding Iwo Jima.\nThe fighting with the Japanese soldiers spanned another 31 brutal, cruel days.\nThey were marked with hand-to-hand combat, suicide charges by the Japanese soldiers and fighting in the caves where they were entrenched.\nIt was the raising of the flag (the colors) on Mount Suribachi that gave them hope."}, {"id": "e82434e3-dafe-467b-9310-a6535c100903", "title": "Israeli troops catapult fireball into Lebanon using weapon rarely used since 16th century", "date": "2024-06-14 13:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/06/14/israeli-troops-catapult-fireball-into-lebanon-using-weapon-rarely-used-since-16th-century/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "The trebuchet, a rotating arm with a sling attached to launch a projectile, has rarely been used since the 16th century.\nThe Israel Defense Forces (IDF) said the catapult was “a local initiative” and had not “come into widespread use,” Israeli public broadcaster and CNN affiliate Kan reported Thursday.\nKan said the trebuchet was probably used to burn shrubbery, making it easier for Israeli forces to identify militants attempting to reach the border.\nMore than 53,000 Israelis have been evacuated from the north since hostilities began in October, the IDF told CNN.\nIn Lebanon, more than 94,000 people have been displaced from the border area, according to the country’s health ministry."}, {"id": "220569a9-0793-46b1-b203-20950089176d", "title": "Dr . Francis Boyle : COVID Injections Meet The Criteria For Biological Weapons Of Mass Destruction", "date": "2024-06-14 00:30", "url": "https://www.shtfplan.com/headline-news/dr-francis-boyle-covid-injections-meet-the-criteria-for-biological-weapons-of-mass-destruction", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "“It is my expert opinion that [the COVID injections] meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons [Convention],” his affidavit states.\nDr. Boyle is considered one of the world’s leading legal experts on biological weapons and he drafted the US Biological Weapons and Antiterrorism Act (“the Act”), which was passed into law in 1989 to implement the Biological Weapons Convention to criminalize the development, production, and possession of biological weapons.\nIn his affidavit for Dr. Sansone’s case, Dr. Boyle stated that COVID injections violate the Act.\nHe asserted that “covid-19 injections,” “covid-19 nanoparticle injections,” and “mRNA nanoparticle injections” are biological weapons and weapons of mass destruction which violate Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat.\nIt is my expert opinion that ‘COVID-19 nanoparticle injections’ or ‘mRNA nanoparticle injections’ or ‘COVID-19 injections’ meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat."}, {"id": "54e5ad6e-db72-4734-9921-b3a8f7ab4601", "title": "RIGHT SPEAK : Fighting Most Tense in Kurakhove , Pokrovsk , Kramatorsk Axes ; UKR Stabilizes Kharkiv Front ; UKR Repels RU Arm - Attacks Near Chasiv Yar ; UKR Recapture Key Positions in Vovchansk ; UKR Decimates RU Radars , Air Defenses in Belgorod O...", "date": "2024-06-14 04:45", "url": "http://www.rightspeak.net/2024/06/fighting-most-tense-in-kurakhove.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (70) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "f434928f-55a8-40f1-9255-9c84d3699ce9", "title": "Hitler was  hypnotic in a very dangerous way  as a public speaker , says Farage", "date": "2024-06-14 12:30", "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-hitler-putin-general-election-b2562594.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theView from Westminster email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Nigel Farage has said Adolf Hitler was “hypnotic in a very dangerous way” as a public speaker and spoke again of his admiration for Vladimir Putin as a “political operator”.\nThe Reform leader tried to dismiss the concerns on Monday, saying that “every party will suffer” controversy triggered by its candidates in a snap election.\nAt the BBC phone-in Mr Farage was also asked about the ongoing conflict in Ukraine.\nMr Farage said: “This war has been going on for years, it is likely to go on for many, many more years."}, {"id": "c28bdc66-2634-43c7-ae35-7f902b76837a", "title": "Elden Ring best competitor is on sale at Best Buy for a 20 % discount", "date": "2024-06-14 16:45", "url": "https://www.windowscentral.com/gaming/dont-let-the-elden-ring-dlc-stop-you-from-purchasing-one-of-the-best-xbox-soulslikes-now-on-sale-at-best-buy", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "Best Buy is a currently having a three-day sale event, selling PC hardware, video games and much more sought-after items at great discounts.\n🔍Our review: Review: Lies of P is one of the best Soulslikes outside FromSoftware | Windows Central🤔Why Best Buy?\nBest Buy is a well-renowned retailer praised for its superb customer service, lenient return windows, in-store pick-ups, speedy shipping times, and more.\nIf you own a Best Buy Membership you will obtain many benefits when shopping there even if it doesn't net you exclusive discount deals.\nIf you wish to learn more about its perks, pay a visit to our guide on My Best Buy memberships."}, {"id": "9ed6b280-9fa1-4b1b-a9e9-d06befa8f269", "title": "The new cancer in society - Trinidad and Tobago Newsday", "date": "2024-06-14 10:45", "url": "https://newsday.co.tt/2024/06/13/the-new-cancer-in-society/", "domain": "newsday.co.tt", "domain_classification": "Unknown", "message": "The new cancer in society- Photo courtesy PixabayTHE EDITOR: As in the case of Osmond Baboolal, we've all seen the tragic consequences of young people witnessing horrific events.\nHis younger sister, however, overcame the tragedy and became a lawyer with the help of family and support from non-governmental organisations.\nJust as the internal conflict between the wolves can unite or divide, family support and open communication are vital for healing.\nAs a society we must recognise the long-term effects of violence and create safe spaces for young people to express their fears and feelings.\nWhile we fight to win the battle within, we have to be aware of the overall effects our choice will have on our family, nation, society and local communities."}, {"id": "9921a66c-21c8-48ef-ad70-5236a7fe3162", "title": "Distinguished Historian Randall Woods to Speak on John Quincy Adams", "date": "2024-06-14 06:45", "url": "https://news.uark.edu/articles/70576/distinguished-historian-randall-woods-to-speak-on-john-quincy-adams", "domain": "news.uark.edu", "domain_classification": "Unknown", "message": "Distinguished Historian Randall Woods to Speak on John Quincy AdamsPhoto SubmittedOn Friday, June 28, the Fayetteville Public Library will host a talk with Randall Woods, the John A. Cooper Distinguished Professor of History at the U of A, to mark the release of his newest book, John Quincy Adams: A Man for the Whole People.\nJames M. McPherson, Pulitzer Prize winning author of Battle Cry of Freedom: The Civil War Era, notes that John Quincy Adams \"served his country for more than a half century as diplomat, senator, secretary of state, president, public intellectual and in a unique post-presidential career as gadfly of the slave power in Congress.\"\nHe says that \"Randall Woods skillfully interweaves the narrative of these events with intimate accounts of Adams' personal and family life in a warmly human manner.\"\nWoods will take questions and be available to sign books following the discussion.\nWoods has taught at the U of A since 1971, and his book on Adams follows on the heels of his award-winning biographies LBJ: Architect of American Ambition and Fulbright: A Biography."}, {"id": "c52decca-b194-4c18-a16a-4c98f043eebb", "title": "New on DVD :  American Fiction  is sharp critique", "date": "2024-06-14 17:00", "url": "https://www.columbian.com/news/2024/jun/14/new-on-dvd-american-fiction-is-sharp-critique/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "The winner of this year’s Oscar for best adapted screenplay tops the DVD releases for the week of June 18.\n“American Fiction”: An African American writer (Jeffrey Wright) struggles in the publishing industry and ends up writing a book about Black stereotypes under a pen name that becomes a hit.\n“Former journalist and Emmy winning TV writer Cord Jefferson’s directorial debut ‘American Fiction’ is a social satire that wields a deceptively sharp shiv, not a cleaving broadsword, as it surgically slices through the many hypocrisies of the culture industry at large,” writes Tribune News Service critic Katie Walsh in her review.\n“In adapting Percival Everett’s 2001 novel ‘Erasure,’ Jefferson assigns himself and his film the double-edged task of both critiquing popular representations of African American life, while simultaneously serving a representation that is otherwise lacking.\nIt’s a lot to juggle, but he pulls it off, thanks to a wildly talented cast, and plenty of good humor.”Also new on DVD“Nowhere Special”: A 30-something father with a terminal diagnosis tries to find the ideal family for his young son in this heart-wrenching drama."}, {"id": "d9d3c9ca-4dc5-4139-a73a-f917768fa1fa", "title": "Zimbabwe Has 8 , 000 Doses of Cabotegravir Anti - HIV Drug", "date": "2024-06-14 06:45", "url": "https://allafrica.com/stories/202406140105.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Zimbabwe has 8,000 doses of injectable pre-exposure prophylaxis drug, cabotegravir, for use in the ongoing pilot programme to establish its efficacy in preventing HIV as the country pulls all the stops to completely eradicate all new infections of the virus by 2030.\n\"We are doing a pilot programme to test the drug's efficacy especially looking at things like the side effects that it causes.\nWe have about 8000 doses of CAB-LA that we are using and this pilot programme that involves about 1000 people.\"\nDr Mugurungi noted that the new pre-exposure prophylaxis drug, if successful and approved, will be handy in the battle against taming new HIV infections.\nClose Sign up for free AllAfrica Newsletters Get the latest in African news delivered straight to your inbox Top Headlines AIDS Zimbabwe By submitting above, you agree to our privacy policy."}, {"id": "01a692e3-1857-4d3a-85db-8b637fb5412e", "title": "Baltic Sea states concerned about Russian threat to the region , call for stronger sanctions", "date": "2024-06-14 14:45", "url": "https://www.euractiv.com/section/defence-and-security/news/baltic-sea-states-concerned-about-russian-threat-to-the-region-call-for-stronger-sanctions/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Stronger sanctions are needed to reign in the growing Russian threat in the Baltics, Baltic Sea states’ foreign ministers said on Friday (14 June), voicing concern about Russian hybrid threats and the unmarked oil tankers deployed to circumvent sanctions.\nThe Baltic Sea region has become a focal point for Russian hybrid warfare and its deployment of a ‘shadow fleet’ of unmarked tankers, suspected of being used to avoid the G7’s price cap on Russian oil.\nThe Council of the Baltic Sea States (CBSS) foreign ministers – including the Nordics, Baltics, Germany, and Poland – vowed to support efforts to tackle this through NATO and the EU.\nMinisters also voiced concern about the growing threat from Russian hybrid attacks in the region.\n“Given this complex security situation, we have to do everything we can in order to ensure that our societies are better protected, in particular, in the Baltic Sea area,” she added."}, {"id": "187ead8d-8289-4733-ad82-1817ba299564", "title": "What Can a Boosting Service Offer You ? ", "date": "2024-06-14 13:15", "url": "https://qcostarica.com/what-can-a-boosting-service-offer-you/", "domain": "qcostarica.com", "domain_classification": "Unknown", "message": "Boosting services provide players with professional assistance across a wide range of in-game activities.\nIn this article, we will explore the various benefits and possibilities that boosting services offer, shedding light on how they can elevate your gaming experience.\n- Advertisement -Overview of Key Boost Services AvailableThese boosting services cater to a wide range of player needs, ensuring that you can enjoy your favorite games to the fullest without the usual grind.\nWorld of Warcraft (WoW)In World of Warcraft, boosting services cater to a wide array of in-game needs.\nWide Range of ServicesBoosthive offers an extensive array of boosting services tailored to meet the diverse needs of gamers."}, {"id": "1ced58c5-8b59-4599-8e9f-6dfa5fb26afd", "title": "Field set for Pasco school board , superintendent races", "date": "2024-06-14 19:00", "url": "https://www.yahoo.com/news/field-set-pasco-school-board-180000226.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pasco County voters will have two choices for one seat in a School Board race that will be decided in August.\nIn District 4, which includes much of central Pasco west of U.S. 41, incumbent Alison Crumbley will face Florida Virtual School social studies teacher Jessica Wright.\nEven though the seats are split into geographic districts, all voters in the county select each board member.\nIn the race to replace retiring superintendent Kurt Browning, two Republicans will meet in the August primary.\nEntering primary season, Legg has more than $188,000 in his campaign account, while Mandarin has less than $2,000."}, {"id": "8bb5514f-fbc3-432c-8bbc-c0bbcc62af8b", "title": "Belarus Delivered Advanced Weapons to Azerbaijan During Artsakh War , Leaked Documents Reveal", "date": "2024-06-14 14:00", "url": "https://horizonweekly.ca/en/belarus-delivered-advanced-weapons-to-azerbaijan-during-artsakh-war-leaked-documents-reveal/", "domain": "horizonweekly.ca", "domain_classification": "Unknown", "message": "Belarus delivered advanced weapons to Azerbaijan during the 2020 Artsakh War in a secret pact that defies the mandate of the Russia-led Collective Security Treaty Organization, recently leaked document reviewed by Politico have revealed.\nThe prime minister’s statement was swiftly followed by an announcement by Armenia’s foreign ministry that Yerevan was recalling its ambassador in Minsk.\nBelarus followed suit by recalling its ambassador to Yerevan.\nEduard Arakelyan, a military analyst at Yerevan’s Regional Center for Democracy and Security, verified to Politico that the leaked documents pertained to hardware used by Azerbaijan in recent wars, both in Artsakh and against Armenia itself.\n“This equipment was used with devastating effect against Armenian troops and was provided by a country that is supposed to be an ally of Armenia,” he told Politico."}, {"id": "a83cce7b-0c56-466d-b0b8-f563f368246f", "title": "The Feds Are Itching to J6 Us Again By J . B . Shurk", "date": "2024-06-14 10:45", "url": "https://www.ruthfullyyours.com/2024/06/14/the-feds-are-itching-to-j6-us-again-by-j-b-shurk/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "The Feds Are Itching to J6 Us Again By J.B. Shurkhttps://www.americanthinker.com/articles/2024/06/the_feds_are_itching_to_j6_us_again.htmlAfter New York’s sham “justice” system procured a ridiculous felony conviction against President Trump, a lot of leftist commentators predicted that his supporters would erupt in violent mayhem.\nBiden’s campaign has been desperate for an explosive J6 or Charlottesville incident to use to slander Trump’s voters as violent extremists.\nIt is difficult to paint ordinary Trump voters as “dangerous” when ordinary Biden voters are threatening Jews, toppling statues, and burning down buildings.\nSo that the Establishment Class can laughably pretend President Trump (while still in office, no less) engaged in a bloody war against the United States.\nNonetheless, the Democrat Deep State has treated them as expendable pawns in its all-out war against President Trump."}, {"id": "c5069dfc-f301-41c3-bc73-0c6547f6d9ba", "title": "Sudan Army Kills Senior RSF Commander Amid Ongoing Conflict", "date": "2024-06-14 14:00", "url": "https://www.devdiscourse.com/article/law-order/2983012-sudans-army-kills-senior-rsf-commander-amid-ongoing-conflict", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Sudan's army said on Friday it had killed Ali Yagoub Gibril, a senior commander for the paramilitary Rapid Support Forces (RSF) who was under U.S. sanctions, during a battle in the besieged north Darfur city of al-Fashir.\nGibril was a leading commander for the RSF in al-Fashir, the last major city in the Darfur region of Sudan that the paramilitary force does not control.\nThe RSF has been besieging al-Fashir, a city of 1.8 million people, for weeks and top U.N. officials have warned that the worsening conflict there could trigger widespread intercommunal violence.\nWar between the army and the RSF erupted over conditions for a transition to democracy in mid-April last year in the capital Khartoum, soon spreading to other parts of the country.\nThe conflict has led to the world's largest displacement crisis, renewed ethnic violencein Darfur blamed on the RSF and its allies, and a sharp increase in extreme hunger."}, {"id": "5ae4a520-cae8-4acc-8277-e411462a8bb0", "title": "Get America adversaries out of our schools - Washington Examiner", "date": "2024-06-14 17:15", "url": "https://www.washingtonexaminer.com/restoring-america/courage-strength-optimism/3044489/get-america-adversaries-out-schools/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "This ought to be a no-brainer: Let’s stop adversaries such as the Chinese Communist Party from gaining a foothold in America’s schools.\nIt should raise major red flags, then, that according to a report published last summer from Parents Defending Education, more than $18 million from China’s government has made its way into America’s schools over the past decade.\nIn northern Virginia, Thomas Jefferson High School for Science and Technology, one of the nation’s top high schools, received $3.6 million from the Chinese government and businesses associated with the CCP.\nThe CCP was so successful in extracting information from TJHS school officials that they were able to establish 20 “Thomas Schools” across China with the information they stole from one of America’s most elite high schools.\nThe committee also considered Rep. Aaron Bean’s (R-FL) Transparency in Reporting of Adversarial Contributions to Education Act, or TRACE Act, which would deliver urgent transparency to parents so they are able to know whether their children’s schools are accepting foreign funding from America’s adversaries."}, {"id": "e68a9de5-b71a-46c9-b9ee-286b27949349", "title": "The doom - mongers need to stop the  Munich  analogies", "date": "2024-06-14 17:15", "url": "https://www.stcatharinesstandard.ca/opinion/contributors/the-doom-mongers-need-to-stop-their-munich-analogies/article_da8654cb-8843-566e-ae04-edb052b766fe.html", "domain": "stcatharinesstandard.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "3f60fd2b-459c-4667-ad5a-2478e73694fe", "title": "A Juneteenth organizer erases whites from the Civil War victory against slavery", "date": "2024-06-14 18:30", "url": "https://www.americanthinker.com/blog/2024/06/a_juneteenth_organizer_erases_whites_from_the_civil_war_s_victory_against_slavery.html", "domain": "americanthinker.com", "domain_classification": "Unknown", "message": "By the end of the Civil War, 2,128,948 men had passed through the Union Army in the fight against slavery, with slightly fewer than 22,000 being regulars.\nAnd, significantly, those soldiers were white:Most of the Union Army was made up of young white men born in North America.\nMost of the Union soldiers were under 30.\nThese white men paid a high price for this moral victory.\nIn four years, almost 600,000 Union soldiers were killed, wounded, captured, or missing."}, {"id": "6804ea5d-d4d5-4016-8872-32e46f5f2519", "title": "Australia arms export comes under scrutiny . Is Canberra  complicit  in Israel - Gaza war ? ", "date": "2024-06-14 01:30", "url": "https://www.scmp.com/week-asia/politics/article/3266529/australias-arms-export-comes-under-scrutiny-canberra-complicit-israel-gaza-war", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "There are also existing permits that allowed Australian manufacturers to supply weapons parts for the manufacture of F-35 jets.\nAustralia’s export of weapons to Israel amid the Israel-Gaza war has sparked controversy, with recent senate hearings confirming Canberra has issued new permits for military equipment exports to Israel since the start of the crisis.\nFor months, researchers, humanitarian groups, war protesters and Australia’s third-largest political party, the Australian Greens, have sought clarity over Australia’s exports of weapons and parts to Israel.\nIn older permits, Australia also sent “dual use technology” parts to Israel, but they were not military equipment, Marles added.\nThe Arms Trade Treaty, which regulates the international trade of arms, also makes clear that parts and components of weapons are also considered weapons."}, {"id": "0b8da759-8246-4aed-8110-67100383a5f7", "title": "What to do in Billings this weekend Indiana Jones Lavina", "date": "2024-06-14 16:30", "url": "https://billingsgazette.com/life-entertainment/local/events/what-to-do-in-billings-this-weekend-indiana-jones-lavina/article_797b5c84-0c6f-11ee-a030-875645b08f8f.html", "domain": "billingsgazette.com", "domain_classification": "Unknown", "message": "And since it's Pride Week in Billings, it only makes sense to end the week on Thursday at 7 p.m. with \"But I'm a Cheerleader.\"\nForward Montana and the Black Heritage Foundation of Billings are presenting a free showing of \"Rustin\" at Art House.\nCountry rocker Rob Leines is at the Pub Station on Friday at 8 p.m. $15 tickets at thepubstation.com.\nIf you like outlaw country, you'll want to see Erin Viancourt at the Pub Station on Sunday, June 16 at 8 p.m. $15 tickets are at thepubstation.com.\nOne more big country show this week with Emily Nenni at the Pub Station on Wednesday, June 19 at 8 p.m. $17 tickets are at thepubstation.com."}, {"id": "a4b5b581-0d7c-4958-8584-2b5208d1afe4", "title": "Video - Jake Paul Faces Off With Sean OMalley After Accepting Offer To  Save  UFC 303", "date": "2024-06-14 03:15", "url": "https://www.lowkickmma.com/jake-paul-sean-omalley-face-off-rubi-rose/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Jake Paul and Sean O’Malley are ready to step and save UFC 303.\nEmanating from T-Mobile Arena on June 29, the International Fight Week finale was expected to be headlined by the long-awaited return of former two-division titleholder Conor McGregor.\nAfter exchanging words on social media, ‘The Problem Child’ and reigning bantamweight world champion ‘Sugar’ Sean O’Malley went face-to-face, giving fans a little taste of the UFC vs. PFL clash they hope to bring to ‘Sin City’ later this month.\nAdding insult to injury, the UFC 303 co-main event is now in need of replacing.\nCarlos Ulberg agreed to step in and take Rountree’s spot, but it now sounds like the fight needs yet another replacement."}, {"id": "1bb6150b-bd70-4600-a6be-9bc5a67bf6bc", "title": "Under threat : the battlefield where Scotland won its nationhood", "date": "2024-06-14 18:00", "url": "https://www.yahoo.com/news/under-threat-battlefield-where-scotland-171149319.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This was a place where history was written with every Scottish stab at an English body.\nThe Battle of Stirling Bridge was fought during the First War of Scottish Independence - Getty ImagesTwo events changed the game.\nBut, at time of writing, the site is protected with diligence, and is ably managed by the National Trust for Scotland (NTS).\nThe National Trust for Scotland has been vocal in its opposition to the racecourse proposal – declaring that “Bannockburn is much more than just a battlefield”.\nEssentialsTickets to the Battle of Bannockburn Visitors Centre and Battlefield Experience cost £8.50 for adults."}, {"id": "8b935fa1-31a9-4537-bf2a-023fc2276909", "title": "CFF , Atlas Elektronik partner for indigenous sonar project – Indian Defence Research Wing", "date": "2024-06-14 13:15", "url": "https://idrw.org/cff-atlas-elektronik-partner-for-indigenous-sonar-project/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "CFF, Atlas Elektronik partner for indigenous sonar project| BySOURCE: ANIAn Indian engineering firm and a division of a German defence major Thyssenkrupp Marine Systems have partnered to supply 12 indigenous low-frequency variable depth sonar systems for an indigenous project, according to an official statement.\nAtlas Elektronik GmbH has partnered with CFF Fluid Control Ltd for the supply of 12 indigenous low-frequency variable depth sonar systems.\n“The technology for the system is already proven in Indian waters, in the Active Towed Array Sonars supplied by Atlas Elektronik to the Indian Navy.\nThe partnership between CFF and Atlas Elektronik will build on this base in enhancing the operational effectiveness of the Indian Navy’s front-line platforms,” it said.\nThe systems will be produced in India by CFF in furtherance of the Indian government’s goal of self-reliance, it said."}, {"id": "75b1a4c9-2d42-4789-98e2-53900cfe1d28", "title": "Clorox Sponsors Initiatives To Advance Social Justice", "date": "2024-06-14 18:15", "url": "https://menafn.com/1108329774/Clorox-Sponsors-Initiatives-To-Advance-Social-Justice", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- 3BL) Over the last decade, Clorox has supported the nonprofit Equal Justice Works as it seeks to advance equal justice by promoting a lifelong commitment to public service in the community.\nOne of the ways we've done that is by funding 12 EJW fellowships through The Clorox Company Foundation.\nIt's been an impactful and engaging partnership over the years with these fellows, who are recent law school graduates.\nBefore law school, Sam worked at a holistic youth defenders office in New Orleans and as a therapist in North Carolina.\nWe're looking forward to seeing all that Jocelyn and Sam will be able to accomplish in the next year."}, {"id": "0f390314-b0b9-4176-a8ca-3a406784f34b", "title": "Op - ed : How did pilot Bessie Coleman become a queen ? ", "date": "2024-06-14 13:00", "url": "https://www.chicagotribune.com/2024/06/14/opinion-bessie-coleman-aviation/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "I had always wanted to fly a plane, yet I had never found Coleman in any textbook in college, nor graduate school.\nAs a woman, Coleman had moved to Chicago from Waxahachie, Texas.\nIn France, she had to find an alternative flight school after her first Paris school shuttered its doors to women.\nTo give context to the cultural landscape in which Coleman earned her historic license in France (in French), women had just earned the right to vote in the U.S.\nMore than anyone I have ever met, Bessie Coleman truly earned a pair of wings."}, {"id": "f2abf310-ef3b-4757-b47b-e6ec2c1ad2c7", "title": "Avowed developer admits combat didnt  look great  but has been hard at work on improving it", "date": "2024-06-14 10:00", "url": "https://www.techradar.com/gaming/consoles-pc/avowed-developer-admits-combat-didnt-look-great-but-has-been-hard-at-work-on-improving-it", "domain": "techradar.com", "domain_classification": "Unknown", "message": "Obsidian Entertainment, the developer behind the upcoming role-playing game Avowed is working on improving the upcoming role-playing game's combat based on player feedback from January's Xbox Developer Direct.\nAt the time of that presentation, the game's combat was criticized for appearing a little listless in its combat.\n\"When the player feedback is like, 'Oh, this doesn't look great,' you're like, okay, we need to prioritize that polish, like, immediately.\n\"We really heavily focused on the hit reactions on the creatures and started to really frame-by-frame focus.\nGet daily insight, inspiration and deals in your inbox Sign up for breaking news, reviews, opinion, top tech deals, and more."}, {"id": "3e9b9716-9633-440e-9559-9165b032547e", "title": "Navy adopting  startup approach  to fielding new technology in Europe and Africa", "date": "2024-06-14 14:15", "url": "https://www.stripes.com/branches/navy/2024-06-14/drones-russia-navy-nato-14166646.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The U.S. Navy in Europe is working with allies on setting common operations standards for drones and emerging technology.\nIn November, the service established Task Force 66 at its base in Naples.\nThe task force was integrated into the fleet last month.\nThat response is an example of how the task force will offer feedback to industry to spur quick, cost-effective solutions, he said.\nThe lessons the task force learns may apply well beyond Europe and Africa, as the team coordinates with other fleets and the Navy’s Disruptive Capabilities Office."}, {"id": "bb34aaec-07a7-440d-98fc-26cd2c0ad6ca", "title": "Here are 10 gems you might have missed from Summer Game Fest 2024", "date": "2024-06-14 19:15", "url": "https://mobilesyrup.com/2024/06/14/summer-game-fest-2024-hidden-gems/", "domain": "mobilesyrup.com", "domain_classification": "Unknown", "message": "If you can believe it, there were over 700 games featured during all of the miscellaneous Summer Game Fest showcases.\nWith that in mind, we wanted to round up some of the games that caught our eye, given that we were on the ground in Los Angeles for Summer Game Fest, the Xbox Games Showcase, Ubisoft Forward and more.\nBounty StarPlatforms: PS4, PS5, Xbox One, Xbox Series X/S, PCRelease date: TBA 2024Bounty Star mixes mechs with the Western genre to deliver something pretty unique.\nFlockPlatforms: PS4, PS5, Xbox One, Xbox Series X/S, PCRelease date: July 16th, 2024Hollow Pond’s Flock was perhaps the most refreshingly laidback and serene game I played at SGF.\nWhat are your favourite games that you saw at Summer Game Fest?"}, {"id": "5e0befcd-d45a-4b31-be69-b7cddb5025a7", "title": "European populists back Putin as they roll out their anti - Ukraine positions", "date": "2024-06-14 15:00", "url": "https://theconversation.com/european-populists-back-putin-as-they-roll-out-their-anti-ukraine-positions-232301", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "This adds up to a significant parliamentary far-right power base, and one which will have more influence over Europe’s position on the Ukraine war.\nRead more: EU parliament election sees shaken centre hold – but far right now has chances to show its strengthExploiting the European far right offers numerous benefits to Putin.\nNew world orderRussia’s fight against the world order in place since the end of the cold war resonates with far-right parties.\nBut there are splits in the far right — one of the most divided political groups in Europe .\nThe role that these far-right parties play in the upcoming years will have serious implications for European democracy and stability."}, {"id": "b978d731-bf48-4fda-9025-4d9113cb2ef5", "title": "Gaza war : with both Sides playing Politics , dont expect a Ceasefire any time Soon", "date": "2024-06-14 06:30", "url": "https://www.juancole.com/2024/06/playing-politics-ceasefire.html", "domain": "juancole.com", "domain_classification": "Unknown", "message": "China supported the resolution, but doubted whether there had been notable developments since the previous ceasefire motion.\nProminent among these are how the war goes from here, the Israeli political environment and the extent of pressure on Israel from the Washington for a ceasefire.\nThere were more violations against children in Gaza, the West Bank and Israel than anywhere else in the world last year, the report says.\nThere has been a similar response to a further UN report accusing Israel as well as Hamas of war crimes.\nOn the Palestinian side, there are certainly some differences between the Hamas military leadership in Gaza and the overall political leadership in Qatar."}, {"id": "cee11667-dccb-4c61-8390-8c2dbc164eec", "title": "Map reveals Red Arrow flypast route and times for Trooping the Colour", "date": "2024-06-14 17:00", "url": "https://metro.co.uk/2024/06/14/map-reveals-red-arrow-flypast-route-times-trooping-colour-21016103/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "The Red Arrows will be in the skies for the King’s ‘second’ brithday celebrations (Picture: Metro.co.uk)The RAF’s acrobatic Red Arrows planes are set to put on a major display to mark King Charles III’s Trooping the Colour.\nHere’s everything you need to know about the times and route of the flypast.\nWhat is the Red Arrows flypast route and times?\nAround 12.30pm in Lincolnshire’s RAF Waddington, the planes will take off and head towards East Anglia, before turning towards Ipswich and Colchester.\nFor those hoping to see the planes, we’ve compiled a map of the direct route they will take."}, {"id": "022c3fc2-ec2e-4c8b-9c9d-6da832edcd29", "title": "Father of American hostage held by Hamas talks about efforts to free his son", "date": "2024-06-14 05:00", "url": "https://www.news4jax.com/news/local/2024/06/14/father-of-american-hostage-held-by-hamas-talks-about-efforts-to-free-his-son/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "The father of an American man talked to News4JAX about his son’s experience as a hostage taken by Hamas terrorists during the October attack.\nIt’s been eight months since 35-year-old Sagui Dekel Chen, a father of three, was kidnapped.\nHis father, Jonathan Dekel-Chen said 40 of the 79 people kidnapped from his Kibbutz were released in the first hostage deal in late November.\n“They saw my son and many other people from our Kibbutz who were taken hostage.\nLast week, four hostages were rescued during an Israeli military operation that, according to Hamas, killed more than 200 Palestinians."}, {"id": "3f57d933-169f-4517-92e3-4c282d29481b", "title": "UN Chief Guterres warns of heightened risk of NUCLEAR CONFLICT amid geopolitical tensions – NaturalNews . com", "date": "2024-06-14 09:45", "url": "https://www.naturalnews.com/2024-06-13-un-chief-warns-high-risk-nuclear-conflict.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "UN Chief Guterres warns of heightened risk of NUCLEAR CONFLICT amid geopolitical tensionsUnited Nations Secretary-General Antonio Guterres recently issued a stern warning as technological advances and escalating geopolitical tensions that risk the outbreak of a nuclear conflict endanger the world at a level not seen since the Soviet Union collapsed in 1991.\nHowever, they \"are not brandishing [nuclear weapons],\" Russian President Vladimir Putin told an audience at the St. Petersburg International Economic Forum on June 7.\nHe reiterated that Russia would only consider using nuclear weapons if its sovereignty or territorial integrity were under threat.\nTactical nuclear weapons include air bombs, warheads for short-range missiles and artillery munitions and are meant for use on a battlefield.\nU.S. accused of taking out Russian nuclear missile early warning system in latest escalation."}, {"id": "540ce3fc-45c9-44c6-b9ff-d66afeea0dd4", "title": "ARTS AND HUMANITIES : Beaufort memorializes African American hero", "date": "2024-06-14 13:15", "url": "https://www.postandcourier.com/aikenstandard/aikenstandard/lifestyle/arts-and-humanities-beaufort-memorializes-african-american-hero/article_c167557a-2799-11ef-a8c3-8f9abb9b548b.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "JACKSON — The Savannah River Ecology Lab’s Outreach Coordinator Sean Poppy presented a variety of animals — from salamanders and skinks, to frogs, snakes and a turkey vulture — to eager viewers at the Jackson library on Wednesday.\nRead moreSavannah River Ecology Lab showcases native amphibians, reptiles and birds at Jackson library"}, {"id": "451789af-58e1-4a3c-8866-a9723158f7ca", "title": "Battles rage in Rafah as Biden blames Hamas for truce delay", "date": "2024-06-14 03:30", "url": "https://dunyanews.tv/en/World/818435-Battles-rage-in-Rafah-as-Biden-blames-Hamas-for-truce-delay", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Battles rage in Rafah as Biden blames Hamas for truce delayWorld World Battles rage in Rafah as Biden blames Hamas for truce delayUS President Joe Biden called Hamas the \"biggest hang-up\" to another truce.\nIn Italy at a G7 summit, Biden called Hamas \"the biggest hang-up so far\" to a deal on a Gaza truce and hostage release.\nThe plan for the first Gaza truce since a week-long pause in November includes a six-week ceasefire, a hostage-prisoner exchange and Gaza reconstruction.\nFallout from the Gaza war is regularly felt on the Israeli-Lebanon frontier, where deadly cross-border exchanges have escalated.\nThe Israeli military said most launches had been intercepted while others ignited fires."}, {"id": "4b3c6011-5dde-4bad-a9c9-b04e2a017bfa", "title": "Lee  Once Were Warrior Tamahori wraps trilogy with The Convert", "date": "2024-06-14 00:45", "url": "https://www.brisbanetimes.com.au/culture/movies/lee-once-were-warriors-tamahori-wraps-trilogy-with-the-convert-20240607-p5jk6d.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Got it Normal text size Larger text size Very large text size Thirty years after breaking through with his debut feature Once Were Warriors, Lee Tamahori has made The Convert, a film that completes a trilogy he always intended to make – without knowing exactly what it would be about.\nWarriors catapulted him into Hollywood, a step that, then aged in his mid-40s, he was more than ready to take.\nAs it happens, he has effectively made a trilogy in reverse, with three films about the state of Maori culture at different points in New Zealand’s history since European settlement.\nThere’s quite a complex history.” Tioreore Ngatai-Melbourne as Rangimai in Lee Tamahori’s movie The Convert.\nLee Tamahori on the set of The Convert with leading man Guy Pearce."}, {"id": "62471b59-435e-4f6a-aed1-4fcecbae2b38", "title": "European Populists Back Putin As They Roll Out Their Anti - Ukraine Positions", "date": "2024-06-14 14:00", "url": "https://menafn.com/1108332558/European-Populists-Back-Putin-As-They-Roll-Out-Their-Anti-Ukraine-Positions", "domain": "menafn.com", "domain_classification": "Unknown", "message": "As well as increasing opposition to Russian sanctions, far-right MEPs have demonstrated a pro-Russia voting record.\nRead more: EU parliament election sees shaken centre hold – but far right now has chances to show its strengthExploiting the European far right offers numerous benefits to Putin.\nNew world orderRussia's fight against the world order in place since the end of the cold war resonates with far-right parties.\nBut there are splits in the far right - one of the most divided political groups in Europe .\nThe role that these far-right parties play in the upcoming years will have serious implications for European democracy and stability."}, {"id": "2bc7177e-67f1-420f-9e07-212e6fd26bf0", "title": "HBO New House of the Dragon Season Moves Way Too Slowly : Review", "date": "2024-06-14 11:00", "url": "https://www.bnnbloomberg.ca/hbo-s-new-house-of-the-dragon-season-moves-way-too-slowly-review-1.2085288", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- The first season of House of the Dragon moved extremely fast—arguably, too fast.\nNow that the battle for the Iron Throne among members of House Targaryen has reached the meat of its story, things drag(on) along at an almost glacial pace.\nAfter Game of Thrones ended in 2019, HBO scrambled to find a way to mine George R.R.\nThe network settled on House of the Dragon, based on Martin’s history text Fire & Blood.\nSet about two centuries before the events of Thrones, House of the Dragon centers on two warring branches of the same family, the dragon-riding Targaryens."}, {"id": "f6bca460-b7ac-41c6-8d5e-452fe041ddc5", "title": "Star - spangled banner still waves boldly as always , Flag Day reminds Americans", "date": "2024-06-14 10:45", "url": "https://www.yahoo.com/news/star-spangled-banner-still-waves-094506455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "File Photo by Bill Greenblatt/UPIJune 13 (UPI) -- Today is Flag Day, and while Americans typically don't get the day off, it's still a holiday worth celebrating.\nPresident Harry Truman in 1949 signed into law a bill making Flag Day a day of \"national observance.\"\nFlag Code, the American flag should always fly freely and never touch anything beneath it.\nNotable for our times, U.S. code also forbids the flying of the flag upside down except as a sign of distress.\nAlito, however, claimed his wife flew the flag upside down over a dispute she had with a neighbor."}, {"id": "4de7ed7e-be0f-4bc0-bde9-f3f6271a4a90", "title": "Kelowna firefighters douse brush blaze along McCurdy Road - Okanagan", "date": "2024-06-14 18:30", "url": "https://globalnews.ca/news/10567304/kelowna-brush-fire-mccurdy-road/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "See more sharing optionsSend this page to someone via emailShare this item on TwitterShare this item via WhatsAppShare this item on FacebookFire crews were called out to battle a brush fire along McCurdy Road in Kelowna on Friday morning.\nBreaking news from Canada and around the world sent to your email, as it happens.\nThe fire was called in by a pedestrian, with emergency crews quickly arriving on scene.\nGlobal News is on scene and this story will be updated."}, {"id": "8d5c82ae-2bcc-46d8-a336-7a3ff0d8687f", "title": "Russia prisons close as so many convicts die fighting in Ukraine | Daily Star", "date": "2024-06-14 11:00", "url": "https://www.dailystar.co.uk/news/world-news/putin-close-russian-prisons-ukraine-33028610", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nAn estimated 150,000 Russian prisoners, including murderers, rapists, robbers and gangsters, were forcibly recruited into the military to serve on the frontline.\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters."}, {"id": "738d8c07-758b-4669-9e4f-7247a51a2f86", "title": "5 spine - chilling body horror anime to watch now | English Movie News", "date": "2024-06-14 12:30", "url": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/5-spine-chilling-body-horror-anime-to-watch-now/articleshow/110996922.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Made in AbyssBody horror anime can evoke a mix of revulsion and fascination, making it a unique sub-genre for horror enthusiasts .\nHere are five exceptional body horror anime series that are a must-watch for anyone seeking a thrilling experience.The horror genre in anime doesn't always rely on supernatural elements; sometimes, the terror comes from within the human body itself.\nWith so many options, it can be challenging to find the truly outstanding body horror anime.\nThis 24-episode series is filled with spine-chilling body transformations, from heads splitting open to reveal hidden teeth and eyes.\nCreated by renowned horror mangaka Junji Ito, this series delves into body horror and eldritch horror, presenting some of the most unsettling transformations imaginable."}, {"id": "b56e5373-b279-45cb-b907-6a3ae387dcb4", "title": "Meet the American who stitched the Stars & Stripes , Betsy Ross", "date": "2024-06-14 08:45", "url": "https://www.foxnews.com/lifestyle/meet-american-who-stitched-stars-stripes-betsy-ross-reputed-wartime-seductress", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Flagmaker Betsy Ross is embraced as one of the most popular figures of the American Revolution.\nThe real story of Betsy Ross is even greater than the highly plausible account of America’s first flagmaker.\nNeither Betsy Ross story — America’s first flagmaker or Washington’s secret-ally seductress — is proven in the eyes of historians.\nHer version, the 13 stars in a circle, is still known as the Betsy Ross Flag.\nHe credits historian Joseph Tustin for naming Betsy Ross the possible seductress."}, {"id": "1b0eb258-8430-4b5e-906c-d89d1dad555f", "title": "Belarus Weekly : Warsaw establishes commission to investigate Russian , Belarusian influence", "date": "2024-06-14 18:30", "url": "https://www.yahoo.com/news/belarus-weekly-warsaw-establishes-commission-170122406.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Belarus joins in the second stage of Russian nuclear drills, simulating the combat use of tactical nuclear warheads, with the aim of undermining Western support for Ukraine.\nPoland establishes a special commission to investigate Russian and Belarusian influence over the past 20 years and examine national security threats amid rising tensions.\nThe Belarusian Border Committee pledged to cooperate with Polish investigators provided they receive \"substantial background data and the necessary information about the incident.\"\nThe Russian nuclear weapons allegedly located in Belarus cannot be used without Moscow's authorization.\nPoland to investigate Russian, Belarusian influenceA special government commission set up to investigate Russian and Belarusian influence in Poland has started its work, Polish Prime Minister Donald Tusk said at a press conference on June 5."}, {"id": "54ae02c4-f630-4823-a134-b4bb581bcca3", "title": "G7 summit in Italy : PM Modi holds bilateral talks with Zelenskyy , Macron and Sunak", "date": "2024-06-14 14:15", "url": "https://www.theweek.in/news/world/2024/06/14/g7-summit-in-italy-pm-modi-holds-bilateral-talks-with-zelenskyy-macron-and-sunak.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "On the sidelines of the G7 summit in Italy's Apulia region, Prime Minister Narendra Modi on Friday held talks with Ukrainian President Volodymyr Zelenskyy, French President Emmanuel Macron and UK Prime Minister Rishi Sunak.\nAlso, PM Modi discussed ways to strengthen the strategic partnership including defence, nuclear, and space with Macron.\nPM @narendramodi met President @EmmanuelMacron of France on the sidelines of the 50th G7 Summit in Apulia, Italy,\" said Jaiswal.\nPM @narendramodi and French President @EmmanuelMacron held a bilateral meeting in Italy on the sidelines of the G7 Summit.\nOn the final day of the G7 summit, the members vowed to tackle the \"unfair\" business practices by China that are undermining their workers and industries."}, {"id": "790bd25b-6a9b-420c-a4d9-d4e5d2b596f3", "title": "The best announcements from Summer Game Fest 2024", "date": "2024-06-14 08:45", "url": "https://www.stuff.tv/features/the-best-announcements-from-summer-game-fest-2024/", "domain": "stuff.tv", "domain_classification": "Unknown", "message": "PlayStation had its own State of Play the week before while Nintendo has still yet to confirm its own summer Direct.\nTo save you a good many hours, we’ve put together the most exciting trailers and announcements that came from the past week of Summer Game Fest 2024, from the big blockbusters to the indie darlings.\nRelease: 2025CairnPlayIf last year’s indie game Jusant conveyed the calm of climbing, then Cairn seems to want to really focus on the other end of the extreme.\nRelease: TBAEverything elseWith just so many streams happening during Summer Game Fest, it’s simply too much to go for more honourable mentions.\nBut if you want to watch them in full for yourself then simply follow the links below:– Summer Game Fest Live, Day of the Devs and Devolver Direct– Wholesome Direct Indie Showcase– Xbox Games Showcase, Call of Duty: Black Ops 6 Direct– Future Games Show: Summer Games Showcase– The PC Gaming Show– Ubisoft ForwardAlan Wen About Stuff contributor Areas of expertise gaming"}, {"id": "1e075dc3-6844-4bbb-98a0-de9572d3e5da", "title": "New Video Reveals Glimpse Of The Manta Ray Underwater Drone Propulsion System", "date": "2024-06-14 00:30", "url": "https://theaviationist.com/2024/06/13/manta-ray-rear-section/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "The subsequent segment shows the Manta Ray UUV in action, either being deployed into water or already submerged, showcasing its operational capabilities in an aquatic environment.\nThe Manta Ray prototype underwent extensive full-scale testing off the coast of Southern California in February and March 2024.\nThe Manta Ray ProgramThe Manta Ray‘s development is part of a DARPA initiative to advance critical technologies for future unmanned underwater vehicle (UUV) designs.\nThe data collected by Manta Ray will enhance decision-making for joint forces, providing a strategic advantage in missions.\nEach contractor is responsible for creating unique vehicles to showcase specific capabilities within the Manta Ray program."}, {"id": "58883088-1a55-44aa-95d4-2c71eb7cf7c5", "title": "World News in Brief : Ukraine attacks continue , education in Africa , Albinism update", "date": "2024-06-14 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240613-unnews07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "World News in Brief: Ukraine attacks continue, education in Africa, Albinism update13 June 2024 - The UN humanitarian coordinator for Ukraine Denise Brown on Thursday said she was 'appalled' by the scale of Russia's overnight attack on Kryviy Rih City in the Dnipro Region.\n\"Strikes on Ukrainian cities by the Armed Forces of the Russian Federation continue to bring devastating human loss,\" said Ms. Brown.\nKillings continue\"I continue to receive cases of attacks and killings, often perpetuated against the most vulnerable in our societies - our children,\" Ms. Miti-Drummond said.\nSome reports also show that children with albinism face abandonment and rejection by their families in China and other Asian countries.\nWith regard to health challenges, persons with albinism still struggle to access a simple bottle of life-saving sunscreen - an unaffordable luxury in some regions, according to the UN independent expert."}, {"id": "3dfb68cd-e27b-4627-94c8-2e7a393b149e", "title": "Germany Uniper wins $14 billion arbitration ruling against Gazprom – Euractiv", "date": "2024-06-14 09:15", "url": "https://www.euractiv.com/section/energy-environment/news/germanys-uniper-wins-14-billion-arbitration-ruling-against-gazprom/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "German utility Uniper has won a multi-billion euro arbitration against former long-time supplier Gazprom, it said on Wednesday (12 June), allowing it to tear up dormant gas supply contracts and potentially setting a precedent for similar cases.\nSources told Reuters last month that the arbitration tribunal could allow Uniper to terminate the 250 terawatt hours in dormant Russian gas contracts, some of which run until the middle of the next decade.\nWith the right of termination that we received in the arbitration ruling, we are ending the contracts with Gazprom Export,” Uniper CEO Michael Lewis said in a statement.\nThe German government is also taking part in the discussions between the European Commission and those countries that are still dependent on Russian gas, Economy Minister Robert Habeck said on Tuesday.\n“I am personally very involved in it,” Habeck said, adding that the talks aim to ensure secure gas supply for southeastern Europe without filling Russia’s coffers."}, {"id": "eac074dc-1d30-4427-8f09-40858c43dd7c", "title": "Okaloosa County honors women military sacrifices in 2nd Women Veterans Day ceremony", "date": "2024-06-14 17:30", "url": "https://www.yahoo.com/news/okaloosa-county-honors-womens-military-162658263.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "OKALOOSA ISLAND — About 300 people gathered at the Destin-Fort Walton Beach Convention Center on Wednesday to honor female veterans in Okaloosa County's second annual Women Veterans Day ceremony.\nWomen Veterans Day is held annually on June 12 and recognizes the passage of the Women Armed Service Integration Act, which President Harry Truman signed into law in 1948.\nThe first observance of Women Veterans Day was one year ago and grew from previous initiatives by Commissioner Carolyn Ketchel to honor female veterans over the years.\nIn addition to his achievements, Fornell was a key member in creating the eight Women Veterans Monuments scattered throughout the park.\nThis article originally appeared on Northwest Florida Daily News: 'If you can see it, you can be it': Okaloosa honors female veterans"}, {"id": "fc5d4978-9b6f-4e62-9bc0-dbc317b06131", "title": "Mark Alexander : Profile of Valor : Forgotten Hero ? ", "date": "2024-06-14 09:30", "url": "https://patriotpost.us/alexander/107653-profile-of-valor-forgotten-hero-2024-06-14", "domain": "patriotpost.us", "domain_classification": "Unknown", "message": "Woody Woodson was a Philadelphia native.\nThe first Medal of Honor to a black recipient was awarded for his valorous actions during the War Between the States.\nCPL Waverly “Woody” Woodson Jr.: Your example of valor — a humble American Patriot defending Liberty for all above and beyond the call of duty, and in disregard for the peril to your own life — is eternal.\n“Greater love has no one than this, to lay down one’s life for his friends.” (John 15:13)(Read more Profiles of Valor here.)\nSemper Vigilans Fortis Paratus et FidelisPro Deo et Libertate — 1776Follow Mark Alexander on X/Twitter."}, {"id": "53e66279-940a-4892-86b9-35e74b619818", "title": "Slipknot Clown , New Guy and Eloy Casagrande Describe Love of Masks and Demons in Promotional Collaboration with Atlu Shin Megami Tensei V : Vengeance™", "date": "2024-06-14 03:30", "url": "https://www.animenewsnetwork.com/press-release/2024-06-13/slipknot-clown-new-guy-and-eloy-casagrande-describe-love-of-masks-and-demons-in-promotional-/.211923", "domain": "animenewsnetwork.com", "domain_classification": "Unknown", "message": "SlipknotSlipknotSlipknotSlipknotSlipknotPlayStationNintendoAtlusATLUSATLUSATLUSATLUSATLUSAtlusSEGASEGASEGASEGASEGAATLUSSEGASegatoday announced the second and final promotional video for the upcoming RPG Shin Megami Tensei V: Vengeance, which features the iconic heavy metal band.\nThey further share their unique perspective on masks, the iconography of the demons of Shin Megami Tensei V: Vengeance, and how the band's own masks affect their creative process.The Shin Megami Tensei V: Vengeance masks featured in the video will be available for three lucky fans in the Shin Megami Tensei V: Vengeance xDemon Mask Sweepstakes (one mask per winner).\nSign up to the Godhood Guild HERE.Originally released in 2021 for theSwitch, Shin Megami Tensei V opens with the protagonist awakening buried and unconscious after stumbling across a grisly murder scene.\nThe Shin Megami Tensei™ series has a rich history in the gaming space and celebrated its 30th anniversary in 2023.The latest title in the series, Shin Megami Tensei V: Vengeance allows players to enjoy the story of Shin Megami Tensei V in its entirety, with a new story path that was not told in the original release.\nIts globally beloved franchises include Sonic the Hedgehog™, Like a Dragon™,™, Super Monkey Ball™, and Phantasy Star Online™, along with' Persona and Shin Megami Tensei series."}, {"id": "4dd98658-e7a6-47a3-aae6-e235713669b1", "title": "Anti - money laundering report rates Nigeria high", "date": "2024-06-14 06:30", "url": "https://punchng.com/anti-money-laundering-report-rates-nigeria-high/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "An inter-governmental action group against money laundering in West Africa, says Nigeria recorded significant achievements in its war against money laundering and terrorism financing in 2023.\nGIABA said this in its 2023 annual report unveiled for ambassadors of member states, technical and financial partners on Thursday in Dakar, Senegal.\nAccording to the report, Nigeria made progress in addressing the technical compliance identified in GIABA’s Mutual Evaluation Report in relation to various recommendations made to the country.\n“Nigeria demonstrated that it has mechanisms for international cooperation and procedures to respond to international requests for information on NPOs suspected of terrorist financing or involved in other forms of support for terrorists.\n“Nigeria demonstrated that it has a system for maintaining statistics on its Anti-money Laundering and Combating the Financing of Terrorism system,” the report said."}, {"id": "12eeb191-333b-4e2c-a7ba-90e832a535b3", "title": "Pope Francis calls at G7 for ban on  lethal autonomous weapons  ", "date": "2024-06-14 15:00", "url": "https://economictimes.indiatimes.com/news/defence/pope-francis-calls-at-g7-for-ban-on-lethal-autonomous-weapons/articleshow/111002825.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "06b8555b-ea13-43b8-a311-3bc265f6a80e", "title": "G7 leaders tackle the issue of migration on the second day of summit in Italy", "date": "2024-06-14 06:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/14/g7-leaders-tackle-the-issue-of-migration-on-the-second-day-of-summit-in-italy/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Leaders of the G7 are turning their attention to migration on the second day of their summit on Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.\nMigration is of particular interest to summit host Italy, which lies on one of the major routes into the European Union for people fleeing war and poverty in Africa, the Middle East and Asia.\nUS President Joe Biden introduced new policies to curb migration after a bill he tried to get through Congress failed to pass.\nTackling migration “is a common challenge,” European Council president Charles Michel said after arriving at the summit.\nPope Francis will also become the first pontiff to address a G7 summit when he delivers a speech on artificial intelligence on Friday."}, {"id": "e6443af4-cd22-4742-a98b-6f9b4b239987", "title": "Pope Francis calls at G7 for ban on  lethal autonomous weapons  ", "date": "2024-06-14 14:45", "url": "https://www.thehindu.com/news/international/pope-calls-at-g7-for-ban-on-lethal-autonomous-weapons/article68289846.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Pope Francis called on June 14 for a ban on “lethal autonomous weapons”, when he addressed the G7 leaders’ summit in Italy on the perils of artificial intelligence.\n“In light of the tragedy that is armed conflict, it is urgent to reconsider the development and use of devices like the so-called ‘lethal autonomous weapons’ and ultimately ban their use,” the Pope said.\n“This starts from an effective and concrete commitment to introduce ever greater and proper human control.\nAt a strategic level, AI will produce models of battlefields and propose how to respond to attacks, maybe even including the use of nuclear weapons.\n“We need to ensure and safeguard a space for proper human control over the choices made by artificial intelligence programs: human dignity itself depends on it,” Pope Francis said."}, {"id": "af0a3f6c-42d1-432c-a9a7-fc6d9e95dd16", "title": "Last of the Summer Wine - GOLD", "date": "2024-06-14 05:45", "url": "https://www.tvguide.co.uk/schedule/cd6c5659-bb66-5b3c-8cc1-2ec0f1a37b25/last-of-the-summer-wine", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Last of the Summer WineGOLD 11:20 AM to 12:00 PM Friday 14 June Share Add toCalendar +The General's Greatest Battle Season 25 Episode 2 of 11 S SubtitlesChaos abounds at an annual parade held to celebrate a famous battle.\nThe lifelike effigy of the old General has been spruced up and Nora Batty prepares to sit on a float playing the part of his wife.\nNorman Wisdom makes a cameo appearanceLast of the Summer Wine airs on GOLD at 11:20 AM, Friday 14 June .\n(Subtitles.)\nLearn more about Last of the Summer Wine and other movie/drama on our drama pageTopics Movie ➝ Drama Sitcom"}, {"id": "55988c79-bf38-4583-a2a9-4c85bff99e65", "title": "Kinver folk club unlocks the power of traditional songs", "date": "2024-06-14 11:30", "url": "https://www.expressandstar.com/your-world/2024/06/14/kinver-folk-club-unlocks-the-power-of-traditional-songs/", "domain": "expressandstar.com", "domain_classification": "Unknown", "message": "Traditional songs are musical threads woven into the fabric of our common culture and hold deep value.\nThe club in Kinver celebrates these songs, sung by our forbears over the generations and perpetuated today to be preserved for future generations.\nClub Leader, Roger Tyler, explains: “I like to think that at least some of the songs I sing were sung by my forbears over many generations.\nThe bottom line is that we love to sing these songs together and when the voices blend in chorus, the result is magic!\nWe meet at the Kinver Constitutional Club, High Street Kinver on the first Tuesday of each month at 19.30pm."}, {"id": "4c8d111c-11aa-4b0a-9509-764a00ef9659", "title": "Why Biden Gaza Cease - Fire Gambit Is Likely to Fail", "date": "2024-06-14 19:15", "url": "https://foreignpolicy.com/2024/06/14/biden-gaza-israel-ceasefire-deal-diplomacy/", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "From a negotiator’s perspective, he was only half right; success more often than not depends on showing up at the right time.\nTwo of those clocks belong to Israeli Prime Minister Benjamin Netanyahu and Hamas leader Yahya Sinwar; they are set for delay and obfuscation.\nThe third rests on the fireplace mantle in the Oval Office; it runs fast, gears meshed with urgent political exigencies.\nMore likely, Netanyahu will play for time, hoping that Hamas’s response to the cease-fire proposal is a deal-breaker.\nRight now, Netanyahu and Sinwar have created a strategic cul-de-sac for the administration."}, {"id": "ecf32bf9-2c79-449c-ba17-0091cc42e542", "title": "Pride Chicago 2024 : World Gay Boxing Championship pushes for equality in sports world , especially during Pride month , man says", "date": "2024-06-14 17:15", "url": "https://abc7ny.com/post/pride-chicago-2024-world-gay-boxing-championship-pushes/14945484/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "During 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nDuring 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nDuring 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nThe World Gay Boxing Championship is being held in Chicago.\nThe World Gay Boxing Championship will be held on Thursday, June 20."}, {"id": "e48c2de9-4f02-4f47-8d7c-6f75405d3a1c", "title": "One Piece Chapter 1117 Spoilers OUT : Zoro Vs Nusjuro Begins As Broadcast Is Cut Off ; Discover More Here", "date": "2024-06-14 19:30", "url": "https://www.pinkvilla.com/entertainment/anime/one-piece-chapter-1117-spoilers-out-zoro-vs-nusjuro-begins-as-broadcast-is-cut-off-discover-more-here-1316971", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "The One Piece Chapter 1117 spoilers have been released recently, so keep reading for a sneak peek into the upcoming chapter.\nALSO READ: One Piece Chapter 1117 Brief Spoilers Out: Blackbeard To Make An Appearance As Vegapunk’s Message EndsOne Piece Chapter 1117 spoilersAccording to the One Piece Chapter 1117 spoilers, Chapter 1117 will be titled “Mo.” The chapter opens with the cover story, ‘Ogre Child Yamato's Golden Harvest Surrogate Pilgrimage, Vol.\nHe contacts Tashigi via Den Den Mushi, learning she is at the Marine hospital.\nThis setup suggests that Smoker has significant plans or concerns related to the ongoing events in the One Piece Chapter 1117 spoilers.\nThe One Piece Chapter 1117 spoilers then shift to Elbaf’s ship, where a fierce battle takes place between new giants and Marines."}, {"id": "ddbc0ad1-01a6-4817-9f77-78ad976d95ba", "title": "Highly decorated Army colonel comes out as gay in obituary", "date": "2024-06-14 00:45", "url": "https://www.yahoo.com/news/highly-decorated-army-colonel-comes-232513209.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Highly decorated Army colonel comes out as gay in obituaryJune 13 (UPI) -- After living a life of secrecy, a decorated Vietnam veteran came out as gay in his obituary.\n\"I was gay all my life: through grade school, through high school, through college, through life.\"\nDespite keeping his sexuality hidden from most of the world, Ryan said in the obituary that he had a 25-year relationship with the \"love of my life\" Paul Cavagnaro.\nDays after his obituary was published, about 150 people wrote messages of support for the late Ryan.\nA life of service that continues with his final wishes to share his truth so others may learn of love.\""}, {"id": "b1109d20-b8e3-4a32-94e7-c45b64edb5c6", "title": "Pride Chicago 2024 : World Gay Boxing Championship pushes for equality in sports world , especially during Pride month , man says", "date": "2024-06-14 16:15", "url": "https://abc30.com/post/pride-chicago-2024-world-gay-boxing-championship-pushes/14945484/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "During 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nDuring 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nDuring 2024 Pride month in Chicago, one man says the World Gay Boxing Championship pushes for equality in the sports world.\nThe World Gay Boxing Championship is being held in Chicago.\nThe World Gay Boxing Championship will be held on Thursday, June 20."}, {"id": "24012fb3-b322-4a07-9e8e-b04f45c1be86", "title": "My Hero Academia Chapter 426 : Release Date , Where To Read , Expected Plot And More", "date": "2024-06-14 14:15", "url": "https://www.pinkvilla.com/entertainment/anime/my-hero-academia-chapter-426-release-date-where-to-read-expected-plot-and-more-1316879", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Fans wonder now what My Hero Academia Chapter 426 could have in store for them.\nMy Hero Academia Chapter 426: release date and where to readAs announced on MANGAPlus, My Hero Academia Chapter 426 is set to hit shelves on Monday, July 1, 2024, at 12 am JST.\nReaders can read My Hero Academia Chapter 426 on the official MANGAPlus platform, which will be available for free upon release.\nExpected plot of My Hero Academia Chapter 426In My Hero Academia Chapter 426, fans can expect a deeper dive into Endeavor's current activities, as more about the status of Toya Todoroki (Dabi) post-war is revealed.\nAdvertisementMy Hero Academia Chapter 425 recapTitled Unseasonable, My Hero Academia Chapter 425 shifts to June as the third-year students of U.A."}, {"id": "2d375133-ae42-4c12-bfa1-a53a37fe2963", "title": "Nigeria : GIABA Lists Improvements , Weaknesses in Nigeria War Against Money Laundering", "date": "2024-06-14 11:00", "url": "https://allafrica.com/stories/202406140395.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Despite the progress made in the country, the new GIABA report, lists weaknesses in Nigeria's anti-money laundering measures.\nGIABA, the inter-governmental action group against money laundering in West Africa, says Nigeria recorded significant achievements in its war against money laundering and terrorism financing in 2023.\nGIABA said this in its 2023 annual report unveiled for ambassadors of member states and technical and financial partners on Thursday in Dakar, Senegal.\nAccording to the report, Nigeria made progress in addressing the technical compliance identified in GIABA's Mutual Evaluation Report (MER) in relation to various recommendations made to the country.\nWeaknesses in Nigeria's anti-money laundering measuresDespite the progress made in the country, the report, said the requirements for application of simplified due diligence measures were not consistent with the country's assessment of money laundering and terrorist financing risks."}, {"id": "09a5daa7-3fd0-424e-8cdd-6b784ce161db", "title": "G - 7 Pledge to Step Up Action on Russia Oil Fleet , Energy , Metals", "date": "2024-06-14 09:00", "url": "https://www.bnnbloomberg.ca/g-7-pledge-to-step-up-action-on-russia-oil-fleet-energy-metals-1.2085211", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- Group of Seven leaders meeting in Italy this week will pledge to tighten enforcement of their price cap on Russian oil, choke the Kremlin’s future energy projects and reduce Moscow’s revenues from metals, according to a statement seen by Bloomberg.\n“We will continue to apply significant pressure on Russian revenues from energy and other commodities,” the statement, which is expected to be published on Friday, says.\nThe G-7 price cap on Russian crude oil and petroleum products bans western shipowners, insurers and intermediaries from providing vessels and services for cargoes priced above the thresholds.\nG-7 leaders will also pledge to do more to impede the “development of future energy projects and disrupting access to the goods and services on which those projects rely,” and will continue to reduce Russia’s revenues from metals.\nThe G-7 were joined in Italy by the leaders of Argentina, Brazil, Turkey, the United Arab Emirates, Ukraine and the Pope."}, {"id": "aa396338-043d-4c6a-ab78-08980557bd3a", "title": "Independent launches long - shot bid for Washington 3rd Congressional District", "date": "2024-06-14 17:00", "url": "https://www.columbian.com/news/2024/jun/14/independent-launches-long-shot-bid-for-washingtons-3rd-congressional-district/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "John Saulie-Rohman wants to shake up the race for Washington’s 3rd Congressional District.\nAn independent candidate from Camas, Saulie-Rohman, 43, thinks that Rep. Marie Gluesenkamp Perez, D-Skamania, and Republicans Joe Kent of Yacolt and Leslie Lewallen of Camas should address issues he believes are being sidelined, such as the war in Gaza and political corruption.\n“Lobbying and special interests inject billions of dollars to steer legislative policies in their favor to the detriment of the American people.\nHis priorities include addressing economic challenges, improving education, investing in the Columbia River, revitalizing Washington’s forests and protecting reproductive rights.\nHe also wants to separate commercial and investment banking and lower health care costs."}]