[{"id": "b9ee3316-bd66-4c68-8a0a-19562dd366b7", "title": "Antisemitic incidents in united kingdom shatter prior records , numbering nearly 2 , 000 in six months", "date": "2024-08-12 08:45", "url": "https://ejpress.org/antisemitic-incidents-in-uk-shatter-prior-records-numbering-nearly-2000-in-six-months/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "By JNSThe number of antisemitic incidents in the United Kingdom from January to June of this year shattered previous records with nearly 2,000 incidents recorded, including more than 120 assaults, according to the CST, Community Security Trust.\nThe report recorded that while there were 964 incidents of antisemitism recorded in the first six months of 2023, this year that number has more than doubled to 1,978.\nThe previous high number of antisemitic incidents over a six-month period was 1,371, recorded in 2021.\n“As documented in CST’s Antisemitic Incidents Report 2023, there was an instant increase in antisemitic incident levels in the UK following Hamas’ attack on Israel, before Israel had coordinated any large-scale military response in Gaza,” the CST report stated.\nAccording to the report, “anti-Jewish discourse” accounted for more than 1,000 of all incidents."}, {"id": "3887066a-483e-4f3d-9457-61a2412d7d6f", "title": "Jewish man attacker charged with hate crime - The Jerusalem Post", "date": "2024-08-12 06:00", "url": "https://www.jpost.com/diaspora/article-814325", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A man has been charged with a hate crime after allegedly stabbing a Jewish man near the Chabad Hasidic movement’s headquarters in Brooklyn in the early hours of Saturday morning.\nSumpter has been charged with eight felonies, including assault as a hate crime, for the incident, according to an arrest report.\nIn July, there were 30 antisemitic incidents reported to police, three times higher than the 10 incidents reported during the same month last year.\nJews have been targeted in reported hate crimes more than all other groups combined almost every month in the past year.\nIn another incident, in April, a man was charged with a number of hate crimes after aiming his car at Orthodox Jews in Brooklyn."}, {"id": "01eb951f-3e23-420c-83a4-259949c4cd4e", "title": "Walzing With Hamas | Frontpage Mag", "date": "2024-08-12 04:45", "url": "https://www.frontpagemag.com/walzing-with-hamas/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Walz’s stolen valor scandal isn’t going away anytime soon, and another one looms in its wake: Walz has repeatedly associated with Muslim leaders with known ties to Hamas and other jihad groups.\nEven worse, CAIR officials have refused to denounce Hamas and Hizballah as terrorist groups.\nCAIR is an unindicted co-conspirator in a Hamas terror funding case — so named by the Justice Department.\nSeveral former CAIR officials have been convicted of various crimes related to jihad terror.\n“Islamophobia” is a smear propaganda term designed to intimidate people into thinking it is wrong and “bigoted” to oppose jihad terror and Sharia oppression."}]