[{"id": "c96fd079-b995-4a1e-843c-f269184aea72", "title": "The looming choice for Diaspora Jews", "date": "2024-06-14 08:15", "url": "https://www.jwire.com.au/the-looming-choice-for-diaspora-jews/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home Featured Articles / The looming choice for Diaspora Jews – J-WireThe looming choice for Diaspora JewsRead on for articleIs it time for the Jews of Britain, Europe and America to leave?\nOf course, it’s time for Diaspora Jews to leave, they say.\nDiaspora Jews tend to hold their noses at anything on “the right” because they associate “the right” with antisemitism.\nBut most Diaspora Jews refused to see it.\nOf course, Diaspora Jews can reasonably point out that, at present, Israel is hardly a safe haven."}, {"id": "e3991b42-6b9c-48d2-9190-ca359560ecd6", "title": "UCLA commencement goes on amid campus tension over protests , violence and policing", "date": "2024-06-14 10:45", "url": "https://www.yahoo.com/news/ucla-commencement-goes-amid-campus-100008283.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "UCLA is one of seven University of California campuses — from Davis to San Diego — celebrating commencement over the next few days.\nRoughly 70 events for undergraduate and graduate programs will span the UCLA campus through Monday.\nCollege commencements altered amid Gaza war protestsDuring a commencement season when protests have become the norm, UCLA officials said they are prepared for disruptions.\n\"For students, commencement is a powerful event — it's the culmination of years of hard work.\nFor the first time, all major commencement events will require guests to bring either clear bags or no bags."}, {"id": "17a0d313-f187-41e3-8fda-562e09520643", "title": "Pullman City Council to further discuss proposed Israel - Hamas war ceasefire resolution", "date": "2024-06-14 08:45", "url": "https://dailyevergreen.com/178728/news/pullman-city-council-to-further-discuss-proposed-ceasefire-resolution/", "domain": "dailyevergreen.com", "domain_classification": "Unknown", "message": "Eight Pullman residents, including several WSU students, spoke during the public comment section of Tuesday’s City Council meeting to address a proposed resolution calling for a ceasefire of the Israel-Hamas war.\n“I live here in this community, and when I read the resolution that seemed submitted, it left me out,” Jessica said.\nHowever, Councilwoman Carla de Lira said Pullman would join over 100 other local municipalities that have passed a ceasefire resolution.\nThe council will revisit the resolution and hold further public comment during their next meeting 7 p.m. June 25 at Pullman City Hall, located at 190 SE Crestview St Building A.\nIf passed, Pullman would join other Washington cities such as Seattle and Olympia in adopting a ceasefire resolution within city government."}, {"id": "300d018f-e181-464a-b626-db5cce712cbe", "title": "Speakers , venue pull out of prominent activist group pro - Christian nationalist conference", "date": "2024-06-14 12:45", "url": "https://www.keranews.org/texas-news/2024-06-14/speakers-venue-pull-out-of-prominent-activist-groups-pro-christian-nationalist-conference", "domain": "keranews.org", "domain_classification": "Unknown", "message": "Multiple speakers and a venue have pulled out of a prominent Texas activist group’s July conference after The Texas Tribune reportedon its plans to amplify white nationalist figures and rhetoric.\n“I categorically reject white replacement theory and never write or speak about it.\nIn an email to supporters on Thursday, True Texas Project founder Julie McCarty said that the venue “went back on their agreement” to host the event.\nFormerly known as the NE Tarrant Tea Party, True Texas Project was crucial in the rise of Texas’ ultraconservative movement throughout the 2010s.\n“You’re not going to demographically replace a once proud, strong people without getting blow-back,\" responded her husband, Fred McCarty, who is also a True Texas Project leader."}]