[{"id": "af07636d-536f-4281-8ec1-8709bbc08f87", "title": "Antisemitism Report : Anti - Jewish hate goes from bad to worse in 2023", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-799850", "message": "“October 7 helped spread a fire that was already out of control,” the report stated.\nAustralia in particular recorded 622 antisemitic incidents in October and November 2023, in comparison to 79 during the same period in 2022.\n“Israel does not have a meaningful strategic plan for combating antisemitism that is based on the needs of Jewish communities.\nFighting antisemitism is failingTHE IMPOSSIBILITY of reliably tracking antisemitic incidents in Russia at present was discussed in the report as well.\n“Two years ago, this report stated that the fight against antisemitism was failing."}, {"id": "bf3d4b77-6134-41f6-8a95-131f5c38e81e", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war – Winnipeg Free Press", "date": "2024-05-06 15:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/faith/2024/05/06/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war", "message": "The October attack unleashed a war that has led to a high number of Palestinian deaths, fueling pro-Palestinian protests that have swept U.S. campuses.\nMany Jewish students have felt intimidated by protests, which have at times included antisemitic tropes and calls for anti-Jewish violence.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz."}, {"id": "1e07cbc3-0d27-4dfc-8a45-a5bdb43529c8", "title": "Two dichotomies", "date": "2024-05-06 05:00", "url": "https://www.jwire.com.au/two-dichotomies/", "message": "I am unaware of any Islamophobic gathering advocating “Israel will be free (of Arabs) from the river to the sea” or promoting killing of Muslims.\nEvery event involving Australian Jews has been peacefully advocating Hamas return the kidnapped civilian hostages.\nAt none of these has there been statements, placards or anything else advocating harm or hatred of Muslims or any other group.\n2 On Friday, May 3, Prime Minister Anthony Albanese was reported holding a “round-table discussion with the country’s leading rabbis”.\nI was tearful hearing the recording of Rev Cantor Deutsch singing El Maleh Rachamim at Sunday night’s impressive Yom Hashoah commemoration."}, {"id": "2d5c1b6f-7510-444d-b1de-47262c2b5a9c", "title": "Many gather for Holocaust Remembrance Day at newly restored Atlanta monument", "date": "2024-05-06 00:15", "url": "https://www.wsbradio.com/news/local/many-gather-holocaust-remembrance-day-newly-restored-atlanta-monument/WUXPNYNSNZEHRFWL2TM2SP2DTY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "25bbf9e9-528c-4a24-89fb-6eb49272570b", "title": "Pro - Palestine , pro - Israel demonstrations held in Rhinebeck after restaurant owner faces backlash", "date": "2024-05-05 22:15", "url": "https://www.dailyfreeman.com/2024/05/05/pro-palestine-pro-israel-demonstrations-held-in-rhinebeck-after-restaurant-owner-faces-backlash/", "message": "Gasoline prices mixed in the Mid-Hudson Valley, over a quarter higher than a month ago, slightly higher than last year"}, {"id": "89fe352d-7dea-4510-aaf4-30d470fb097f", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 16:30", "url": "https://www.oxfordmail.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "85378fb0-0c19-4550-a911-4c82a362408e", "title": "At U . of C . encampment , Jewish organizers explain significance of their anti - Zionist Shabbat service", "date": "2024-05-05 23:00", "url": "https://www.yahoo.com/news/u-c-encampment-jewish-organizers-222300552.html", "message": "But in interviews with a half-dozen or more Jewish students and affiliated faculty members within the pro-Palestine encampment at the U. of C., none of them said they felt anything resembling antisemitism within the camp.\nAccording to messages with a Jewish organizer at DePaul’s encampment, a similar Shabbat service was held within the encampment on their campus.\nAt Shabbat time, she entered the encampment to pray with the students and organizers.\nEncampment organizers are, for the most part, supportive of the demands of the Boycott, Divestment, Sanctions movement, but many matzo brands, including Manischewitz, produce some of their goods in Israel.\nFor the most part, the organizers in the encampment wish things were different with their families; but that won’t stop them from protesting."}, {"id": "aaa3b2b5-c341-492d-9b70-10b0a8b2cb53", "title": "Holocaust scholar coming to Tulsa says antisemitism persists", "date": "2024-05-05 10:00", "url": "https://tulsaworld.com/news/local/holocaust-scholar-danny-m-cohen/article_937bd5e0-0639-11ef-ac8f-b7feb1131214.html", "message": "“We’ve done a really excellent job of collecting testimonies,” said Danny M. Cohen, a Chicago-based Holocaust scholar, educator and writer.\nThe grandson of a Holocaust survivor, Cohen has dedicated his career to Holocaust studies and human rights advocacy.\nOr we might call it ‘inherited trauma.’”Many have even compared Oct. 7 to the Holocaust, Cohen added.\nWe want the Palestinian people to be able to work toward self-determination.”“My stance is, I’m on the side to end suffering,” Cohen added.\nAdmission: Free, registration required Presented by: Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah and Temple Israel To register or for more information: Go to jewishtulsa.org/yomhashoah2024."}, {"id": "5be4c96a-d78a-469c-a763-8b7adbf10243", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 20:30", "url": "https://www.thisisoxfordshire.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "f6b27810-e068-4f7e-927e-774c73f99569", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 21:15", "url": "https://www.smh.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "396f4efb-556f-48d9-845d-ee52f8b1556b", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 20:30", "url": "https://www.watoday.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "f9183a29-5c9e-4d5a-96da-220e941e5d64", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 19:15", "url": "https://www.brisbanetimes.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "ebf5f802-78dc-4f50-8a9b-092e7bef3bcb", "title": "Hope of Israel Congregation in Roanoke educates during annual Holocaust Remembrance service", "date": "2024-05-06 04:00", "url": "https://www.wsls.com/news/local/2024/05/06/hope-of-israel-congregation-in-roanoke-educates-during-annual-holocaust-remembrance-service/", "message": "ROANOKE, Va. – Dozens gathered at the Hope of Israel Congregation for their annual holocaust remembrance event.\nIt was an event that was held two weeks after Passover to remember and reflect on the horror of the Holocaust.\nIn the flicker of candlelight, heavy hearts gathered at Hope of Israel Congregation in Roanoke to honor the roughly 6 million people killed during the Holocaust.\nYou’ll see people of all ages here, and it’s important for us to never forget,” Maynard Keller, Elder at Hope of Israel Congregation, said.\nSamuel Cox, a Holocaust historian, shared stories of Holocaust survivors he has spoken with over the years."}, {"id": "722401fe-be43-4950-81ca-ab6ec3e37ef8", "title": "In lead - up to Yom HaShoah , Oporto Jewish community teaches the evolution of Antisemitism to schoolchildren", "date": "2024-05-05 00:30", "url": "https://ejpress.org/in-lead-up-to-yom-hashoah-oporto-jewish-community-teaches-the-evolution-of-antisemitism-to-schoolchildren/", "message": "800 Portuguese schoolchildren visited the Holocaust Museum of Oporto on Friday to learn about the Holocaust and the evolution of Antisemitism throughout the centuries that led to the annihilation of Six Million Jews and continues today.\n“In this museum, we press the importance of having the children and teenagers asking how it was possible for this unspeakable tragedy to take place,” said Gabriel Senderowicz, the President of the Oporto Jewish community that built and runs the museum.\nIt focuses on the general public, especially youths and schoolchildren, and invests in education, professional training for educators, promoting exhibitions, and supporting research.\nDavid Garrett, a jurist who is a board member of the Jewish community of Oporto, highlighted that “a genocide can be national or local and kill millions, thousands or even dozens of people.\nCredit: Jewish Community of Oporto"}, {"id": "635b2f75-f9f4-4bf1-a84a-a0ef9c8c4d22", "title": "  Like family : three women – two Palestinian , one Jewish – find peace amid campus chaos | California", "date": "2024-05-05 12:45", "url": "https://www.theguardian.com/us-news/ng-interactive/2024/may/05/palestinian-jewish-students-campus-protests", "message": "Ginsborg is Jewish, and Omer and Abdallah are first-generation Palestinian American.\nThousands of miles from Gaza, Ginsborg, Omer and Abdallah met after classes on Tuesday afternoon, reminiscing about student-led events from the past week.\nBut opinions differ among Jewish students across the nation, with many students experiencing a palpable sense of unease at their schools.\nBeing Jewish on campus over the last seven months has been “incredibly hard,” they said.\n“He always said, ‘I grew up with a Jewish family on my left side and a Christian family on my right side,’” she said."}, {"id": "3adea807-0502-4883-9fa6-1fc9fda18b38", "title": "The Jewish Vote is up for Grabs , and it May Decide the Election | The Jewish Press - JewishPress . com | Caroline B . Glick | 27 Nisan 5784 – Sunday , May 5 , 2024", "date": "2024-05-05 01:30", "url": "https://www.jewishpress.com/indepth/opinions/the-jewish-vote-is-up-for-grabs-and-it-may-decide-the-election/2024/05/05/", "message": "And second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nBut anecdotal evidence is piling up that the Jewish vote is in contention like it hasn’t been in more than 40 years.\nMoreover, American Jewish voters may well turn out to be the demographic that determines the outcome of the 2024 presidential election.\nIn 1976, Jimmy Carter won 71% of the Jewish vote in his race against incumbent Gerald Ford.\nIndependent candidate John Anderson won 15% of the Jewish vote, and Ronald Reagan won 39% of the Jewish vote—and the presidency."}, {"id": "8efa2bbd-b454-4a32-9e3d-4737b30c8156", "title": "Many gather for Holocaust Remembrance Day at newly restored Atlanta monument", "date": "2024-05-05 19:30", "url": "https://www.wsbtv.com/news/local/atlanta/many-gather-holocaust-remembrance-day-newly-restored-atlanta-monument/BNHNF3GEHZBEVFDGAJSJFRMVEY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "97f37922-cb4b-413d-9d5b-598256d29de2", "title": "Jailed students , a canceled commencement , angry parents : USC Carol Folt takes on critics", "date": "2024-05-06 04:45", "url": "https://arrobajuarez.com/2024/05/06/jailed-students-a-canceled-commencement-angry-parents-uscs-carol-folt-takes-on-critics/", "message": "To dozens of Japanese American ex-students unjustly incarcerated during World War II, then later denied reentry to the university, Folt awarded honorary degrees.\n(Genaro Molina / Los Angeles Times)Citing unspecified safety threats, Folt rescinded pro-Palestinian valedictorian Asna Tabassum’s speaking slot in USC’s main commencement ceremony.\nLast week, Folt canceled the “main stage” commencement ceremony altogether, depriving students and their families of a treasured ritual.\nIn balancing campus safety and the right to protest with concerns about antisemitism and anti-Muslim hatred, Folt was bound to take criticism from all directions.\nProtesters are detained by LAPD officers at the USC campus on April 24."}, {"id": "71588844-c641-4bff-85ec-c550487c6e98", "title": "Who is paying for the American campus protests ? ", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389407", "message": "A closer look into the organizational structure of these mob actions reveals a complex web of student groups, NGOs, nonprofits and even foreign governments.\nAs of 2019, Qatar regularly spends $405 million a year to finance activities at six American universities with branches in Doha.\nIn 2020, American author and translator Raymond Ibrahim published a report showing that Qatar had invested $5.6 billion in 81 American universities since 2007, including Harvard, Yale, Cornell and Stanford.\nOne was a desire to spread Islamic thought into the West and inculcate the American student body in Islamic theology, proselytizing being a core tenant of Wahabi Islam.\nThe Qatari government has openly denied any connection to the student protests on American campuses."}, {"id": "a2e1409d-f38e-4340-897b-f3bb4e2feb5b", "title": "Beyond bullets and bombs : Lessons of faith , pragmatism , and survival from the vilna g", "date": "2024-05-04 23:45", "url": "https://www.ynetnews.com/article/rj78izvfc", "message": "The diaries of Zelig Kalmanovich, a prominent Jewish scholar in the Vilna Ghetto, offer a glimpse into the agonizing choices faced by individuals trapped within Nazi tyranny.\n3 View gallery Jews in the Vilna Ghetto ( Photo: The Association of Jews from Vilna and Vicinity in Israel )Vilna was once a vibrant center of Jewish life and learning.\nVilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\nHe championed the ghetto's schools, synagogues, and libraries, viewing them as battlegrounds for the preservation of Jewish identity and a continuation of Jewish history.\nThe perspective of the long Jewish history is essential in analyzing the current events."}, {"id": "b9ba6ee1-5a40-409d-815c-cb513f6f5adf", "title": "Stewart Weiss on Holocaust Remembrance Day amid student protests", "date": "2024-05-05 02:00", "url": "https://www.jpost.com/opinion/article-799536", "message": "The week(s) ahead offer both tears and cheers as they lead us once again into the modern “Yom” holidays: Yom Hashoah, Yom Hazikaron, and Yom Ha’atzmaut (and later, Yom Yerushalayim).\nDangerous times: Antisemitism and anti-Israel protestsWe live in a dangerous world at a dangerous time, with equal parts ignorance and evil surrounding us.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City on Tuesday.\nTragically, there is no shortage of un-Jewish Jews who have joined together with the antisemitic mob, helping to add credence to their crusade.\nThis, he said, was an attempt of the prisoners to gain a false sense of empowerment by “joining” with their persecutors."}, {"id": "dbf22900-6051-4b61-9fc8-c77af5f034da", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-mark-history-differently-after-horrors-oct-109936441", "message": "KIBBUTZ MEFALSIM, Israel -- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "a0c83c6b-52e2-4a0a-9204-a781649faba0", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 07:15", "url": "https://www.clickondetroit.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "00e186d2-73f1-44d9-ac5c-bbbf906c544e", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7 – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "ba273d42-db1e-403f-9cf3-496c13af14b4", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "https://www.clickorlando.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "160d3251-2941-4b1e-998e-893f6b861b8c", "title": "Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-06 06:15", "url": "https://www.theday.com/nation/20240506/holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Mefalsim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "1c9874a4-68c3-4bcd-ac04-0fd409aa47bf", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:45", "url": "https://www.smdailyjournal.com/news/world/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_4eac6fac-948d-5499-9d91-85d89390f604.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "7d91fd59-ba80-4774-a82d-a9436cdc389c", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:00", "url": "https://www.newsday.com/news/nation/Israel-Poland-Holocaust-Gaza-march-Auschwitz-h48121", "message": "KIBBUTZ MEFALSIM, Israel — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nHamas militants poured over the border from Gaza and attacked towns, army bases and a music festival in southern Israel."}, {"id": "f9222e95-101c-4611-b614-1a7db4ae8b84", "title": "A Holocaust Survivor Will Mark That History Differently after the Horrors of Oct . 7", "date": "2024-05-05 08:45", "url": "https://www.newsmax.com/world/globaltalk/israel-poland-holocaust-gaza-march-auschwitz/2024/05/05/id/1163510/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "1a97dd77-35aa-41a8-91c8-f543777de9fd", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:45", "url": "https://www.kob.com/news/us-and-world-news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "35381782-ac1e-4f5e-9689-a78cbcbbdd94", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wfmz.com/news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_e8f14bc4-6d3a-595d-af45-a5281e1aec28.html", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "fdb30dee-64b2-40bb-b959-bca177ec28cf", "title": "Holocaust Survivor Finds Solace in Retelling Story in Wake of Recent Tragedy", "date": "2024-05-05 07:00", "url": "https://www.devdiscourse.com/article/law-order/2927949-holocaust-survivor-finds-solace-in-retelling-story-in-wake-of-recent-tragedy", "message": "When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year's Holocaust Remembrance Day, which begins Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nTzamir, whose kibbutz fended off Hamas attackers Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates 132,000 Holocaust survivors live in Israel."}, {"id": "dfe2b533-1e7a-49e0-b1b8-5c2c0a0aa9fc", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wsls.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "d4a224cf-e0e7-48e5-a561-815b9e5d83fe", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 11:30", "url": "https://isp.netscape.com/news/world/story/0001/20240505/492eab9a3b95de64602ccdec863f1b37", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "4c90ae80-84fe-489c-98f3-0bb7ba03b133", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protesters.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees."}, {"id": "e16b3cff-c62e-4bb4-bd73-40dc4b3c7ed4", "title": "San Diego Jewish leaders host Holocaust commemoration in La Jolla", "date": "2024-05-06 04:15", "url": "https://www.nbcsandiego.com/news/local/holocaust-commemoration-la-jolla-san-diego/3507128/", "message": "The Jewish Federation of San Diego and the Lawrence Family Jewish Community Center hosted their annual Holocaust commemoration in La Jolla on Sunday.\n“It’s important that we tell the stories and that we remember the Holocaust,” Heidi Gantwerk, president and CEO of the Jewish Federation of San Diego, said.\nGet San Diego local news, weather forecasts, sports and lifestyle stories to your inbox.\nSign up for NBC San Diego newsletters.\nLocal leaders are continuing their effort to combat antisemitism and Holocaust denial, according to event organizers."}, {"id": "07b78006-5853-47c5-91d5-982d928c4292", "title": "Dueling Israeli - Palestinian protesters clash at UCLA", "date": "2024-05-05 01:45", "url": "https://sundial.csun.edu/181482/news/dueling-israeli-palestinian-protesters-clash-at-ucla/", "message": "Pro-Palestinian protesters had just days earlier constructed an encampment a few hundred yards away.\nOther elements of the crowd were more aggressive and agitating, including some who repeatedly attempted to engage pro-Palestinian protesters in dialogue despite continually getting no response.\nNumerous protesters played drums and banged buckets throughout the hourslong event, as the hundreds of pro-Palestinian protesters were led in chant by supporters with megaphones.\nRoughly two dozen pro-Palestinian protesters were asked for their perspective on the Israeli-Palestinian conflict and the day’s protests at UCLA.\n“[But] at least over here, there’s some sharing of ideas.”No pro-Palestinian protesters wished to express their views publically."}, {"id": "92df1966-293d-49d8-a1f7-1aab87e53a03", "title": "How did Jews celebrate Passover during a war ? - opinion", "date": "2024-05-04 22:45", "url": "https://www.jpost.com/opinion/article-799791", "message": "This tranquil setting was the location of a dance/music event billed as a festival of “Friends, Love, and Infinite Freedom,” Nova was attended by more than 3,500 young Israelis.\nThe kibbutz is populated by young, idealistic Jews who wish to work the holy soil.\nOn October 7, despite a ceasefire between Hamas and Israel being in place, it was attacked by the Palestinian hordes.\nThese displaced Israelis are among the forgotten in Israel as the war enters its eighth month.\nI can’t imagine any other country at war demonstrating more humanitarian concern than Israel.”Our celebration of Passover in Israel reinforced an important age-old lesson for our family."}, {"id": "b4165057-a4e3-48ed-883d-5e44d15edb6c", "title": "Progressive Charlestown : College administrators are falling into a tried and true trap laid by the right", "date": "2024-05-04 16:00", "url": "https://www.progressive-charlestown.com/2024/05/college-administrators-are-falling-into.html", "message": "If you were looking for the Charlestown Democratic Town Committee website and ended up here, try thisGot news tips, gossip, suggestions, complaints?E-mail us: progressivecharlestown@gmail.com We strive to avoid errors in our articles.\nOur correction policy can be found here"}, {"id": "94aa5c97-4a5e-41e7-8c93-7b9de5a68050", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:30", "url": "https://www.pilotonline.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "f9105ef0-94c7-40a9-93b2-1a591e826854", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:15", "url": "https://www.dailypress.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "27feb6ee-d6c7-4ca0-b0e0-a9a2bb49cdde", "title": "Reflections on the German state silencing of the Berlin Palestine Congress – Mondoweiss", "date": "2024-05-04 18:15", "url": "https://mondoweiss.net/2024/05/reflections-on-the-german-states-silencing-of-the-berlin-palestine-congress/", "message": "I was inside the Palestine Congress in Berlin two weeks ago, and what took place can only be described as a travesty of justice and an example of the creeping resurgence of fascism in the German state.\nFor weeks, the German media had written about the Congress, or what they described as a gathering where “antisemites plan hate summit.” Weeks leading up to the Congress, Berlin politicians have said they will do everything in their power to stop the gathering from taking place.\nIt was a complete profile filled with my articles, work as a journalist, and social media posts to depict me as an antisemite and supporter of terrorism.\nZaid Abdulnasser, although not a part of the Congress program, received a notice in the mail from the State Immigration Office in Berlin.\nOthers are not only getting fired and receiving notices that they are being investigated by the authorities, but are facing collective punishment by the German state."}, {"id": "866a7344-d630-4352-9618-61c41d330e59", "title": "Here where things stand one week since Penn ordered the Gaza Solidarity Encampment to disband", "date": "2024-05-04 19:00", "url": "https://www.thedp.com/article/2024/05/penn-gaza-solidarity-encampment-day-eight", "message": "The videos, which together are nearly six minutes long, were filmed by a Jewish student walking near the encampment.\nAt one point, the Jewish student asked an encampment participant if they were a student.\nThe DP could not confirm whether DPS has reached out to the student or whether the encampment participant was a student.\nThe DP could not independently corroborate Yakoby's allegation that encampment members have used slurs towards Jewish students.\nHe called on Penn’s leadership to keep students safe and said that Penn has not requested help from state police to disband the encampment."}, {"id": "54355569-8f5c-4fd6-94f4-f9039647f694", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://toronto.citynews.ca/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "c76e6d46-7fb7-4d34-b2f1-2630a8d2eac6", "title": "The Enemy Is Among Us ? – The Greanville Post", "date": "2024-05-06 04:00", "url": "https://www.greanvillepost.com/2024/05/05/the-enemy-is-among-us/", "message": "Governor Ron DeSantis of Florida has vowed that any student who speaks up or demonstrates against Israel will be expelled from college.\nBritain has Conservative Friends of Israel and Labour Friends of Israel which together constitute a majority in Parliament.\nThe threat to seize the soldiers and officials of the Middle East’s only democracy and the world’s only Jewish state is outrageous.\nBlinken then rolled over completely when confronted by the power of the Jewish state with a State Department spokesperson saying the units “have effectively remediated these violations,” whatever that is supposed to mean.\nNot likely, as the mainstream party choices Biden and Trump will do whatever the Jewish state demands."}, {"id": "4a7dd532-3b77-4b35-9b50-1378b8399307", "title": "Tech becomes teaching tool on Israel Holocaust remembrance day", "date": "2024-05-05 17:45", "url": "https://nocamels.com/2024/05/tech-becomes-teaching-tool-on-israels-holocaust-remembrance-day/", "message": "In Israel, Holocaust Remembrance Day for 2024 begins at sundown on May 5.\nThe first evening sees memorial services being held across the country, with a central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem.\nFlags are flown at half mast in Israel to mark Holocaust Remembrance Day (Joel Goldberg/Wikimedia Commons)The following morning is punctuated by a siren at 10am, which wails throughout Israel for two minutes in memory of the victims.\nAnd according to Zikaron BaSalon, the event is attended annually by around 2 million people across the country.\n“But this year was particularly painful – none of the Holocaust survivors we met even imagined that the horrific memories of the Holocaust would resurface, and this time in their own home.”"}, {"id": "cf9eb930-0429-4fbe-9a26-068673505e30", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 10:00", "url": "https://www.thesunchronicle.com/news/nation_world/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_7619e88e-2c44-5dc7-89b7-b3e2ccbd76ca.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "ba3596f3-6b81-4bc5-86de-97619d0305f2", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://www.mymotherlode.com/news/world/3352547/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7.html", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7 View PhotoKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "dc88b699-202f-4875-b570-e8d884bf2ac6", "title": "Holocaust Remembrance Week Complicated By the Israel War with Hamas and a Growing Anti - Semitic Problem | Newstalk Florida", "date": "2024-05-06 05:45", "url": "https://www.newstalkflorida.com/featured/holocaust-remembrance-week-complicated-by-the-israel-war-with-hamas-and-a-growing-anti-semitic-problem/", "message": "Eighty-five years ago marked the beginning of World War II; the Holocaust had already commenced prior to this, and the implementation of the Nazi’s Final Solution plan took place in 1942.\nIn 2023, the world experienced an alarming surge in anti-Semitism, a phenomenon unparalleled since the conclusion of World War II.\nLet’s delve into the key findings from the report:Incident Surge: In 2023, ADL tabulated 8,873 antisemitic incidents across the United States.\nBetween October 7 and the end of 2023, ADL documented , surpassing the total for the entire year of 2022.\nExcluding these incidents, ADL tabulated 7,523 incidents, a 103% increase from 2022."}, {"id": "01748612-6156-4386-a813-5e0805ae3204", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "http://www.middletownpress.com/news/world/article/a-holocaust-survivor-will-mark-that-history-19440012.php", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/APKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians."}, {"id": "017c81c1-5c32-46bd-89ff-3b013e282606", "title": "Child survivor , U . S . senator speak at Holocaust Remembrance Day event", "date": "2024-05-06 15:00", "url": "https://www.gpb.org/news/2024/05/06/child-survivor-us-senator-speak-at-holocaust-remembrance-day-event", "message": "About 500 people, including U.S. Sen. Jon Ossoff, Deputy Consul General of Israel Anna Shteingart, a handful of state and local politicians, and dozens of Jewish community leaders gathered at Greenwood Cemetery in Southwest Atlanta today to mark Yom HaShoah, Holocaust Remembrance Day.\nThe 59th annual ceremony was also a rededication of the Memorial to the Six Million, which has recently undergone a complete renovation led by Landmark Preservation with help from the Atlanta Preservation Center.\nChild survivor address antisemitismGeorge Rishfeld, a child survivor of the Holocaust, was a toddler when his parents handed him over to the Fronckvics, a Catholic family with whom Rishfeld lived for three years.\nThey saw me as a human being and not as a Jew.” Both of his parents also survived the war.\nWe need to challenge hateful statements and occurrences strongly and immediately.” — George Rishfeld, Holocaust survivorThis story comes to GPB through a reporting partnership with Rough Draft Atlanta."}, {"id": "a80d5bce-4fa5-4b73-a117-8035170cb257", "title": "The past three days at GW Gaza solidarity encampment", "date": "2024-05-05 02:30", "url": "https://georgetownvoice.com/2024/05/04/the-past-three-days-at-gws-gaza-solidarity-encampment/", "message": "Over a week ago, a coalition of students from universities across D.C., including Georgetown, George Washington University (GW), and American University, established a Gaza solidarity encampment at University Yard (U-Yard) on GW’s campus.\nWhile the encampment has brought together students, academics, and community members from across D.C., it has also garnered national attention.\nUntil complete liberation, the students are for justice in Palestine.” While others listened to speakers who described messages they had received from people in Gaza thanking students for protesting at the GW encampment.\n“The only thing I can do is to be there with them in spirit by supporting GW and Georgetown students for here.”No Georgetown students spoke at the counter-protest, and it’s unclear if any were present at the demonstration.\nBased on a post on DMV SJP’s Instagram, demonstrators projected a photo of President Joe Biden onto the American flag for several hours, with the words ‘genocide Joe’ written underneath."}, {"id": "bd5631ec-05f1-4232-87dc-af0eafe4118a", "title": "Jewish poet , paratrooper Hannah Senesh honoured in Budapest", "date": "2024-05-05 10:30", "url": "https://www.jwire.com.au/jewish-poet-paratrooper-hannah-senesh-honoured-in-budapest/", "message": "Browse > Home News / Jewish poet, paratrooper Hannah Senesh honoured in Budapest – J-WireJewish poet, paratrooper Hannah Senesh honoured in BudapestRead on for articleHannah Senesh (Szenes) was honoured on Friday in a ceremony at her birthplace in Budapest, Hungary.\nThe Jewish paratrooper and poet was executed at age 23 “not far from here,” Revital Yakin, deputy CEO of March of the Living, said during the event.\nSenesh (1921-44), who was captured after parachuting into Yugoslavia during World War II to rescue Hungarian Jews, endured “severe torture,” Yakin said.\nAnd here, there are more of those than anywhere else.”“How relevant and accurate Hannah Senesh’s letter is even for our days,” said Yakin.\n“May her memory be blessed.”Rakefet Senesh Shkiler, Senesh’s great-grandniece, was one of the poet’s family members who attended the event and laid a wreath in her honor."}, {"id": "49419ac0-2db9-4b46-9d30-a6be3d060a02", "title": "  Actions Have Consequences : Dartmouth Jewish Studies Professor Arrested at Pro - Palestinian Protest – JONATHAN TURLEY", "date": "2024-05-04 20:45", "url": "https://jonathanturley.org/2024/05/04/actions-have-consequences-dartmouth-jewish-studies-professor-arrested-at-pro-palestinian-protest/comment-page-2/", "message": "I was standing with a line of women faculty in the their 60s to 80s trying to protect our students.\nDespite pleading guilty to criminal assault, she was not fired and received overwhelming support from the students and faculty.\nAt Hunter College in New York, Professor Shellyne Rodríguez was shown trashing a pro-life display of students.\nMoreover, Jewish students and faculty at schools like Columbia and UCLA were prevented from gaining access to areas on the campuses.\n“Actions have consequences” for students and faculty alike."}, {"id": "a4d55a22-59ee-4a32-8d54-942c72fb06f3", "title": "The legacy of Holocaust survivor whose home was destroyed on Oct . 7", "date": "2024-05-05 21:45", "url": "https://www.jpost.com/israel-hamas-war/article-799983", "message": "In the venerable \"Kupa\" synagogue in Krakow, Smil Sacagiu, an 87-year-old Holocaust survivor, and his son Mendi participated in a poignant ceremony, marking both remembrance and resilience.\nThe ceremony saw the Sacagius inscribing a Sefer Torah, a ritual laden with emotion and significance.\nFifty-five Holocaust survivors, living testaments to resilience and courage, will gather from all corners of the globe.\n\"We have Holocaust survivors here whose grandchildren are hostages in hell,\" he added, underscoring the ongoing threats to Jewish people.\n\"The Jewish spirit is at the heart of the march tomorrow,\" Taieb declared, rallying the community."}, {"id": "bfcae953-e13f-47dd-a412-340d8244145f", "title": "Dont be silent about the Antisemitism", "date": "2024-05-05 00:30", "url": "https://www.israelnationalnews.com/news/389404", "message": "The Fateful ConversationThis week's Torah portion, Acharei Mos, relates (for the second time, after the first time in Shmini) the tragic episode of the premature death of Aaron's two sons, Nadav and Avihu.\nSaid Nadav to Avihu, 'When will these two old men die, and you and I will lead the generation?'\nIt reads like this[3]:\"When Job heard about the death of the two sons of Aaron, he was seized by tremendous fear.\nSaid Nadav to Avihu, 'When will these two old men die, and you and I will lead the generation?'\nNo Time for SilenceIn the face of despicable anti-Semitism, coming from so many academics and their foolish students —all good people who remain silent, become accomplices to the crime."}, {"id": "d2a2fabd-d0c7-4066-8b3a-d3489be097bc", "title": "Transcript : Queen Rania al Abdullah of Jordan on  Face the Nation , May 5 , 2024", "date": "2024-05-05 12:15", "url": "https://www.cbsnews.com/news/queen-rania-al-abdullah-jordan-face-the-nation-05-025-2024/", "message": "The following is a transcript of an interview with Queen Rania al Abdullah of Jordan that aired on May 5, 2024.\nMARGARET BRENNAN: Jordan has two field hospitals inside of Gaza, Jordan is helping to get aid into the Strip.\nAt the same time, they're- they're denying that the starvation is intentional.\nQUEEN RANIA: First of all, I think it's important to point out that law and order are paramount for everybody.\nAnd, you know, when- when Israelis are telling us, you know, \"They're dying because Hamas is using them as human shields.\""}, {"id": "62aacc62-92db-4b6b-9266-3b0d686a1de7", "title": "Pursuit Church Announces Interfaith March for Israel at University of Southern California", "date": "2024-05-06 07:15", "url": "https://markets.businessinsider.com/news/stocks/pursuit-church-announces-interfaith-march-for-israel-at-university-of-southern-california-1033329841", "message": "United for IsraelLOS ANGELES, CA / ACCESSWIRE / May 5, 2024 / The Pursuit NW, under the leadership of Pastor Russell Johnson, is proud to announce its continued commitment to advocating for Israel with the upcoming \"United for Israel\" rally at the University of Southern California on Wednesday, May 8, 2024, at 5:30 PM.\nPastor Johnson emphasizes the rally's focus on essential issues, including Israel's right to self-defense, the immediate release of all remaining hostages, and the restoration of lasting peace in the region.\nDrawing from past successes, such as the impactful Seattle march convened shortly after the October 7th attacks on Israel, Pastor Johnson brings a wealth of experience and passion to this latest initiative.\nBased in Washington State, The Pursuit operates as a non-denominational church across multiple campuses, including Seattle, Kirkland, Snohomish, and an online presence.\nContact:Pursuit NW ChurchEmma LaMarche | emma.l@thepursuitnw.comMedia Intake Coordinator | 425-205-7428contact@thepursuitnw.comSOURCE: Pursuit NWView the original press release on newswire.com."}]