[{"id": "14c40464-2da8-4fa8-a185-f210f85c861b", "title": "Antisemitism Report : Anti - Jewish hate goes from bad to worse in 2023", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-799850", "message": "“October 7 helped spread a fire that was already out of control,” the report stated.\nAustralia in particular recorded 622 antisemitic incidents in October and November 2023, in comparison to 79 during the same period in 2022.\n“Israel does not have a meaningful strategic plan for combating antisemitism that is based on the needs of Jewish communities.\nFighting antisemitism is failingTHE IMPOSSIBILITY of reliably tracking antisemitic incidents in Russia at present was discussed in the report as well.\n“Two years ago, this report stated that the fight against antisemitism was failing."}, {"id": "f88a9179-1769-46bb-aab6-888c03cf33af", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-04 04:15", "url": "https://www.pressherald.com/2024/05/03/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests-2/", "message": "As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "498ad6ea-8b81-4de5-aa37-4038647a95c2", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 16:30", "url": "https://www.oxfordmail.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "483a138c-cff2-4463-8461-3dc84d67fe87", "title": "Many gather for Holocaust Remembrance Day at newly restored Atlanta monument", "date": "2024-05-06 00:15", "url": "https://www.wsbradio.com/news/local/many-gather-holocaust-remembrance-day-newly-restored-atlanta-monument/WUXPNYNSNZEHRFWL2TM2SP2DTY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "d16b59a6-409c-411e-bfae-957b6dce9c55", "title": "Louisa County suspends funding to PVCC over alleged  antisemitic  film screening", "date": "2024-05-04 13:15", "url": "https://dailyprogress.com/news/local/education/louisa-county-suspends-funding-to-pvcc-over-alleged-antisemitic-film-screening/article_6a271bf4-07f2-11ef-9479-1ffc71a6b6cd.html", "message": "The Louisa County Board of Supervisors found this to be “antisemitic” and unanimously passed a resolution Monday night suspending all of the locality’s funding to the community college, which comes to just under $6,000.\nThough the resolution cites the film as the grounds for its decision, the board’s chairman, Duane Adams, said he was unaware of any film or film screening when The Daily Progress first reached out.\n“I don’t think there was anything to do with a film screening,” Adams told The Daily Progress by phone.\nHowever, the decision could be reversed following “an in-person explanation by PVCC of the college’s stance on discrimination and antisemitism” to the Louisa County board of supervisors.\nThe total amount of funds from the localities, including Louisa County, reached $58,653 in 2022, which is over 10% of the school’s annual revenue."}, {"id": "32d25835-6dfd-4f2a-bd85-e670317546f6", "title": "Pro - Palestine , pro - Israel demonstrations held in Rhinebeck after restaurant owner faces backlash", "date": "2024-05-05 22:15", "url": "https://www.dailyfreeman.com/2024/05/05/pro-palestine-pro-israel-demonstrations-held-in-rhinebeck-after-restaurant-owner-faces-backlash/", "message": "Click to share on Facebook (Opens in new window)"}, {"id": "d8230a2d-608f-456f-8d39-0c4d13129807", "title": "At U . of C . encampment , Jewish organizers explain significance of their anti - Zionist Shabbat service", "date": "2024-05-05 23:00", "url": "https://www.yahoo.com/news/u-c-encampment-jewish-organizers-222300552.html", "message": "But in interviews with a half-dozen or more Jewish students and affiliated faculty members within the pro-Palestine encampment at the U. of C., none of them said they felt anything resembling antisemitism within the camp.\nAccording to messages with a Jewish organizer at DePaul’s encampment, a similar Shabbat service was held within the encampment on their campus.\nAt Shabbat time, she entered the encampment to pray with the students and organizers.\nEncampment organizers are, for the most part, supportive of the demands of the Boycott, Divestment, Sanctions movement, but many matzo brands, including Manischewitz, produce some of their goods in Israel.\nFor the most part, the organizers in the encampment wish things were different with their families; but that won’t stop them from protesting."}, {"id": "3711ba37-8c73-4557-817d-46eb9d69e7d8", "title": "Jewish students react to antisemitic vandalism on campus , President Perez responds", "date": "2024-05-04 05:45", "url": "https://theorion.com/100194/news/jewish-students-react-to-antisemitic-vandalism-on-campus-president-perez-responds/", "message": "“ “Let me state unequivocally—this cowardly and vile hatred has absolutely no place at Chico State.” — Chico State President Steve PerezChico State President Steve Perez sent an email to the campus community on Friday condemning recent acts of hate-based, antisemitic vandalism on campus.\nIn the email, Perez wrote that he was “angry and deeply upset” upon receiving multiple reports of graffiti and vandalism.\n“Reports included antisemitic messages in a bathroom, on light posts, and in stairwells on campus,” Perez said in the email.\nAmar also recognizes the activism on other campuses, and said she feels grateful that Chico State is not that extreme.\nChico Hillel shares their appreciation for Perez who checked in on Jewish students at a previous meeting and extended kindness and support to them, Collins said."}, {"id": "ad426e21-8a37-48da-b117-af085465f22f", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 20:30", "url": "https://www.thisisoxfordshire.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "937d75a1-6411-4157-8fbd-9c02adba1a73", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 21:15", "url": "https://www.smh.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "b92895d4-69c6-4fd5-8c72-c06bd1d22ffa", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 20:30", "url": "https://www.watoday.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "e3c025b4-1638-4468-91be-380c07c782f7", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 19:15", "url": "https://www.brisbanetimes.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "c2534646-43a7-47c1-8921-c0724671259f", "title": "Holocaust scholar coming to Tulsa says antisemitism persists", "date": "2024-05-05 10:00", "url": "https://tulsaworld.com/news/local/holocaust-scholar-danny-m-cohen/article_937bd5e0-0639-11ef-ac8f-b7feb1131214.html", "message": "“We’ve done a really excellent job of collecting testimonies,” said Danny M. Cohen, a Chicago-based Holocaust scholar, educator and writer.\nThe grandson of a Holocaust survivor, Cohen has dedicated his career to Holocaust studies and human rights advocacy.\nOr we might call it ‘inherited trauma.’”Many have even compared Oct. 7 to the Holocaust, Cohen added.\nWe want the Palestinian people to be able to work toward self-determination.”“My stance is, I’m on the side to end suffering,” Cohen added.\nAdmission: Free, registration required Presented by: Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah and Temple Israel To register or for more information: Go to jewishtulsa.org/yomhashoah2024."}, {"id": "e5fe0ae1-ae3a-49f8-9cf9-e567729cdaec", "title": "Yom Hashoah amid Israel - Hamas war : Commemorating October 7 significanc - Israel News", "date": "2024-05-04 04:30", "url": "https://www.jpost.com/israel-news/article-799772", "message": "(JTA) - Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nMarch of the Living with survivorsA Holocaust survivor and family member light the torch during a ceremony held at the Yad Vashem Holocaust Memorial Museum in Jerusalem, as Israel marks annual Holocaust Remembrance Day.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers."}, {"id": "eb093aab-2379-4f6d-8cff-225fc03434ac", "title": "Glick : Jewish Vote Up for Grabs , It May Decide the Election", "date": "2024-05-04 12:30", "url": "https://www.newsmax.com/world/globaltalk/michigan-tlaib-trump/2024/05/04/id/1163471/", "message": "Noting that he is someone \"who is finely attuned to American Jewish sentiment,\" Hirsch told Democratic elected officials: \"Do not take American Jews for granted.\"\nFirst, most American Jews see themselves first and foremost as Democrats or liberals, not as Jews.\nAnd second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nThe Muslim vote, on the other hand, is always in contention.\nAnd, of course, they also insisted that Trump’s advantage in most of the Michigan presidential polls owes to the Muslim vote."}, {"id": "064e59fa-37a7-4e13-9c8c-226bb4f04858", "title": "In lead - up to Yom HaShoah , Oporto Jewish community teaches the evolution of Antisemitism to schoolchildren", "date": "2024-05-05 00:30", "url": "https://ejpress.org/in-lead-up-to-yom-hashoah-oporto-jewish-community-teaches-the-evolution-of-antisemitism-to-schoolchildren/", "message": "800 Portuguese schoolchildren visited the Holocaust Museum of Oporto on Friday to learn about the Holocaust and the evolution of Antisemitism throughout the centuries that led to the annihilation of Six Million Jews and continues today.\n“In this museum, we press the importance of having the children and teenagers asking how it was possible for this unspeakable tragedy to take place,” said Gabriel Senderowicz, the President of the Oporto Jewish community that built and runs the museum.\nIt focuses on the general public, especially youths and schoolchildren, and invests in education, professional training for educators, promoting exhibitions, and supporting research.\nDavid Garrett, a jurist who is a board member of the Jewish community of Oporto, highlighted that “a genocide can be national or local and kill millions, thousands or even dozens of people.\nCredit: Jewish Community of Oporto"}, {"id": "101d1f4f-1060-498c-850d-cb67272fb49a", "title": "  Like family : three women – two Palestinian , one Jewish – find peace amid campus chaos | California", "date": "2024-05-05 12:45", "url": "https://www.theguardian.com/us-news/ng-interactive/2024/may/05/palestinian-jewish-students-campus-protests", "message": "Ginsborg is Jewish, and Omer and Abdallah are first-generation Palestinian American.\nThousands of miles from Gaza, Ginsborg, Omer and Abdallah met after classes on Tuesday afternoon, reminiscing about student-led events from the past week.\nBut opinions differ among Jewish students across the nation, with many students experiencing a palpable sense of unease at their schools.\nBeing Jewish on campus over the last seven months has been “incredibly hard,” they said.\n“He always said, ‘I grew up with a Jewish family on my left side and a Christian family on my right side,’” she said."}, {"id": "3d13b2f9-9fb6-46a0-8add-9b4dd20faef1", "title": "The Jewish Vote is up for Grabs , and it May Decide the Election | The Jewish Press - JewishPress . com | Caroline B . Glick | 27 Nisan 5784 – Sunday , May 5 , 2024", "date": "2024-05-05 01:30", "url": "https://www.jewishpress.com/indepth/opinions/the-jewish-vote-is-up-for-grabs-and-it-may-decide-the-election/2024/05/05/", "message": "And second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nBut anecdotal evidence is piling up that the Jewish vote is in contention like it hasn’t been in more than 40 years.\nMoreover, American Jewish voters may well turn out to be the demographic that determines the outcome of the 2024 presidential election.\nIn 1976, Jimmy Carter won 71% of the Jewish vote in his race against incumbent Gerald Ford.\nIndependent candidate John Anderson won 15% of the Jewish vote, and Ronald Reagan won 39% of the Jewish vote—and the presidency."}, {"id": "a4145804-7890-44d1-9d4b-25cfc4ddd8d0", "title": "Rutgers forces Jewish BBQ off campus , gives into anti - Israel encampment demands", "date": "2024-05-04 14:15", "url": "https://nypost.com/2024/05/04/us-news/rutgers-forces-jewish-bbq-off-campus-gives-into-anti-israel-encampments-demands/", "message": "Rutgers University refused to let a Jewish group hold a pro-Israel barbecue on the campus’ Vorhees Mall, despite allowing pro-terror protesters to camp there for days, emails obtained by The Post claim.\nRutgers ChabadThe encampments finally ended after administrators caved into protester demands, including blanket amnesty for demonstrators.\nDespite being forced off campus in the middle of finals, about 100 to 150 people turned out for the barbecue.\n“They can try to intimidate us but we’re not afraid to be pro-Israel on campus,” said Students Supporting Israel co-president Michael Batushansky.\n3 Kelly Shapiro, co-founder of Students Supporting Israel, which organized the barbecue, called the university’s response a clear “antisemitic double standard.” Rutgers Chabad“Our pride won’t be squashed,” added Vaynberg."}, {"id": "1a3fc7ed-5a32-4023-bfc0-faa20c3869ee", "title": "Many gather for Holocaust Remembrance Day at newly restored Atlanta monument", "date": "2024-05-05 19:30", "url": "https://www.wsbtv.com/news/local/atlanta/many-gather-holocaust-remembrance-day-newly-restored-atlanta-monument/BNHNF3GEHZBEVFDGAJSJFRMVEY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "b3d8d95a-d116-450e-befd-8c494b17ef7e", "title": "Who is paying for the American campus protests ? ", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389407", "message": "A closer look into the organizational structure of these mob actions reveals a complex web of student groups, NGOs, nonprofits and even foreign governments.\nAs of 2019, Qatar regularly spends $405 million a year to finance activities at six American universities with branches in Doha.\nIn 2020, American author and translator Raymond Ibrahim published a report showing that Qatar had invested $5.6 billion in 81 American universities since 2007, including Harvard, Yale, Cornell and Stanford.\nOne was a desire to spread Islamic thought into the West and inculcate the American student body in Islamic theology, proselytizing being a core tenant of Wahabi Islam.\nThe Qatari government has openly denied any connection to the student protests on American campuses."}, {"id": "2505bcb8-da30-4876-88b3-1fca602678e4", "title": "Beyond bullets and bombs : Lessons of faith , pragmatism , and survival from the vilna g", "date": "2024-05-04 23:45", "url": "https://www.ynetnews.com/article/rj78izvfc", "message": "The diaries of Zelig Kalmanovich, a prominent Jewish scholar in the Vilna Ghetto, offer a glimpse into the agonizing choices faced by individuals trapped within Nazi tyranny.\n3 View gallery Jews in the Vilna Ghetto ( Photo: The Association of Jews from Vilna and Vicinity in Israel )Vilna was once a vibrant center of Jewish life and learning.\nVilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\nHe championed the ghetto's schools, synagogues, and libraries, viewing them as battlegrounds for the preservation of Jewish identity and a continuation of Jewish history.\nThe perspective of the long Jewish history is essential in analyzing the current events."}, {"id": "bb81a4a6-df26-49e2-bc78-33abbb992dd9", "title": "Stewart Weiss on Holocaust Remembrance Day amid student protests", "date": "2024-05-05 02:00", "url": "https://www.jpost.com/opinion/article-799536", "message": "The week(s) ahead offer both tears and cheers as they lead us once again into the modern “Yom” holidays: Yom Hashoah, Yom Hazikaron, and Yom Ha’atzmaut (and later, Yom Yerushalayim).\nDangerous times: Antisemitism and anti-Israel protestsWe live in a dangerous world at a dangerous time, with equal parts ignorance and evil surrounding us.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City on Tuesday.\nTragically, there is no shortage of un-Jewish Jews who have joined together with the antisemitic mob, helping to add credence to their crusade.\nThis, he said, was an attempt of the prisoners to gain a false sense of empowerment by “joining” with their persecutors."}, {"id": "4e6d6ea2-482f-4141-bec2-f900b0b91218", "title": "Biden says  order must prevail  during campus protests over the war in Gaza | News , Sports , Jobs", "date": "2024-05-04 05:30", "url": "https://www.weirtondailytimes.com/news/local-news/2024/05/biden-says-order-must-prevail-during-campus-protests-over-the-war-in-gaza/", "message": "As college campuses convulsed with anger over the Vietnam War in 1968, Biden was in law school at Syracuse University.\n“You know, that’s not me.”The White House has also maintained its focus on combating antisemitism.\n“What’s happening on college campuses right now is wrong.”Johnson visited Columbia University with other members of his caucus last week.\n“The radical extremists and far-left agitators are terrorizing college campuses, as you possibly noticed,” Trump said.\nThey saw that it wasn’t based in reality.”Apart from condemning antisemitism, the White House has been reluctant to directly engage on the issue."}, {"id": "d1e0910d-9100-441b-ba82-ba2d581e0370", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-mark-history-differently-after-horrors-oct-109936441", "message": "KIBBUTZ MEFALSIM, Israel -- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "ea226ae8-b789-42da-ac9e-b9ae6dfb0a80", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 07:15", "url": "https://www.clickondetroit.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "beae4601-46ca-4d3e-abe4-6bb8edb194e1", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7 – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "5192fa2a-0470-43a9-a3a5-063138bb7bff", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "https://www.clickorlando.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "dfd48b83-a3de-4b24-90d2-5356df767efa", "title": "The Sources of Anti - Semitic Conduct", "date": "2024-05-05 13:15", "url": "https://freebeacon.com/culture/the-sources-of-anti-semitic-conduct/", "message": "All this makes reading Stone’s book a particularly painful experience.\nYet at the same time, Stone’s descriptions of anti-Semitism of the past sound eerily similar to anti-Semitism manifest today in spheres regarding which the author seems unconcerned.\nWhy, for Stone, is the history of the Holocaust \"unfinished\"?\nIt features a man holding a sign featuring both an Israeli and Palestinian flag, a sign emblazoned with two words: \"Final Solution.\"\nIt is my hope that in a post-October 7 world, Dan Stone can see these dangers too."}, {"id": "3f2f4263-0685-431b-b251-eb1b11e996ad", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:45", "url": "https://www.smdailyjournal.com/news/world/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_4eac6fac-948d-5499-9d91-85d89390f604.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "a6e18914-0c89-48e2-8078-348de29106a1", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:00", "url": "https://www.newsday.com/news/nation/Israel-Poland-Holocaust-Gaza-march-Auschwitz-h48121", "message": "KIBBUTZ MEFALSIM, Israel — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nHamas militants poured over the border from Gaza and attacked towns, army bases and a music festival in southern Israel."}, {"id": "2fd90c0b-c1b5-4919-8e8f-f11a30d60af7", "title": "A Holocaust Survivor Will Mark That History Differently after the Horrors of Oct . 7", "date": "2024-05-05 08:45", "url": "https://www.newsmax.com/world/globaltalk/israel-poland-holocaust-gaza-march-auschwitz/2024/05/05/id/1163510/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "810cea86-8b15-43ba-8065-cdeaf18da00a", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:45", "url": "https://www.kob.com/news/us-and-world-news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "f35ecac0-90df-4fed-95f5-aa5b22966686", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wfmz.com/news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_e8f14bc4-6d3a-595d-af45-a5281e1aec28.html", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in the garden of her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\n(AP Photo/Maya Alleruzzo)"}, {"id": "2c6b5010-8f5c-4ec7-8043-cb014f855200", "title": "Holocaust Survivor Finds Solace in Retelling Story in Wake of Recent Tragedy", "date": "2024-05-05 07:00", "url": "https://www.devdiscourse.com/article/law-order/2927949-holocaust-survivor-finds-solace-in-retelling-story-in-wake-of-recent-tragedy", "message": "When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year's Holocaust Remembrance Day, which begins Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nTzamir, whose kibbutz fended off Hamas attackers Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates 132,000 Holocaust survivors live in Israel."}, {"id": "e57343c9-aa54-4e00-a291-97b0631d6a27", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wsls.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "73be2e25-0132-475c-89ce-a1ae798e22a5", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 11:30", "url": "https://isp.netscape.com/news/world/story/0001/20240505/492eab9a3b95de64602ccdec863f1b37", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "15f6f73c-e8b4-4578-b897-1e38a71c554e", "title": "  Theyre sending a message : harsh police tactics questioned amid US campus protest crackdowns | US campus protests", "date": "2024-05-04 15:30", "url": "https://www.theguardian.com/us-news/article/2024/may/04/police-tactics-us-campus-protest-crackdowns", "message": "More than 1,400 people have been arrested across the US during a week of intense police crackdowns on a sprawling campus movement of pro-Palestine student demonstrations.\n“They’re sending a message to American students,” she said.\nA police officer fired a gun as police cleared one campus building, which the department later said was an accidental discharge.\nAt student protests where there were no counter-demonstrators, the analysis found, “police have intervened against pro-Palestine demonstrations more than four times as often as pro-Israel demonstrations”.\nBefore officers in heavy body armor arrived at Dartmouth, the nascent student Palestine solidarity protest was “100% peaceful” and “remarkably diverse”, Orleck said."}, {"id": "bfad109c-6213-4a4b-959a-6ca1e73d3f8d", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protesters.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees."}, {"id": "1ee2c998-2144-477e-8a10-8ff39fad5239", "title": "How did Jews celebrate Passover during a war ? - opinion", "date": "2024-05-04 22:45", "url": "https://www.jpost.com/opinion/article-799791", "message": "This tranquil setting was the location of a dance/music event billed as a festival of “Friends, Love, and Infinite Freedom,” Nova was attended by more than 3,500 young Israelis.\nThe kibbutz is populated by young, idealistic Jews who wish to work the holy soil.\nOn October 7, despite a ceasefire between Hamas and Israel being in place, it was attacked by the Palestinian hordes.\nThese displaced Israelis are among the forgotten in Israel as the war enters its eighth month.\nI can’t imagine any other country at war demonstrating more humanitarian concern than Israel.”Our celebration of Passover in Israel reinforced an important age-old lesson for our family."}, {"id": "74bcddcc-285d-4d5a-921e-42569cbc8ce5", "title": "Progressive Charlestown : College administrators are falling into a tried and true trap laid by the right", "date": "2024-05-04 16:00", "url": "https://www.progressive-charlestown.com/2024/05/college-administrators-are-falling-into.html", "message": "If you were looking for the Charlestown Democratic Town Committee website and ended up here, try thisGot news tips, gossip, suggestions, complaints?E-mail us: progressivecharlestown@gmail.com We strive to avoid errors in our articles.\nOur correction policy can be found here"}, {"id": "d9a7443d-0076-4d7a-bb4d-50c1c95bee29", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:30", "url": "https://www.pilotonline.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "4242e404-aae7-483e-80fb-18ef83a8c7fe", "title": "College protests at Emerson mean criticism for school president", "date": "2024-05-04 12:15", "url": "https://www.bostonglobe.com/2024/05/04/metro/emerson-college-boston-president-protests-critcism/", "message": "“It was a terrible, horrible, no good, very bad day for President Bernhardt,” said Russell Newman, professor and president of the full-time faculty union.\nEmerson students locked arms in protest at the entrance to alley near the tent encampment on April 24.\nTwelve Emerson students were arrested while protesting outside the event against tuition increases and the college’s “silence on the ongoing genocide in Gaza,” according to an Instagram post from Emerson Students for Justice in Palestine.\n“However, we must also emphasize that we cannot prevent the enforcement of Boston city ordinances or Massachusetts state law.”Police arrested pro-Palestinian demonstrators at Emerson College on April 25.\nAn Emerson College student cried during a meeting to call on the school’s president, Jay Bernhardt, to resign on April 26."}, {"id": "74eaa4cc-5c90-4d69-be04-28a024308b33", "title": "Dueling Israeli - Palestinian protesters clash at UCLA", "date": "2024-05-05 01:45", "url": "https://sundial.csun.edu/181482/news/dueling-israeli-palestinian-protesters-clash-at-ucla/", "message": "Pro-Palestinian protesters had just days earlier constructed an encampment a few hundred yards away.\nOther elements of the crowd were more aggressive and agitating, including some who repeatedly attempted to engage pro-Palestinian protesters in dialogue despite continually getting no response.\nNumerous protesters played drums and banged buckets throughout the hourslong event, as the hundreds of pro-Palestinian protesters were led in chant by supporters with megaphones.\nRoughly two dozen pro-Palestinian protesters were asked for their perspective on the Israeli-Palestinian conflict and the day’s protests at UCLA.\n“[But] at least over here, there’s some sharing of ideas.”No pro-Palestinian protesters wished to express their views publically."}, {"id": "6edd397c-51e6-49e3-bbc5-e55bca676609", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:15", "url": "https://www.dailypress.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "0c83953e-c2ee-4f64-b54d-16a9dc06d82a", "title": "Reflections on the German state silencing of the Berlin Palestine Congress – Mondoweiss", "date": "2024-05-04 18:15", "url": "https://mondoweiss.net/2024/05/reflections-on-the-german-states-silencing-of-the-berlin-palestine-congress/", "message": "I was inside the Palestine Congress in Berlin two weeks ago, and what took place can only be described as a travesty of justice and an example of the creeping resurgence of fascism in the German state.\nFor weeks, the German media had written about the Congress, or what they described as a gathering where “antisemites plan hate summit.” Weeks leading up to the Congress, Berlin politicians have said they will do everything in their power to stop the gathering from taking place.\nIt was a complete profile filled with my articles, work as a journalist, and social media posts to depict me as an antisemite and supporter of terrorism.\nZaid Abdulnasser, although not a part of the Congress program, received a notice in the mail from the State Immigration Office in Berlin.\nOthers are not only getting fired and receiving notices that they are being investigated by the authorities, but are facing collective punishment by the German state."}, {"id": "34a9cbad-5865-4df3-b0fb-a272227dfafb", "title": "Here where things stand one week since Penn ordered the Gaza Solidarity Encampment to disband", "date": "2024-05-04 19:00", "url": "https://www.thedp.com/article/2024/05/penn-gaza-solidarity-encampment-day-eight", "message": "The videos, which together are nearly six minutes long, were filmed by a Jewish student walking near the encampment.\nAt one point, the Jewish student asked an encampment participant if they were a student.\nThe DP could not confirm whether DPS has reached out to the student or whether the encampment participant was a student.\nThe DP could not independently corroborate Yakoby's allegation that encampment members have used slurs towards Jewish students.\nHe called on Penn’s leadership to keep students safe and said that Penn has not requested help from state police to disband the encampment."}, {"id": "b1fdfa32-5ebf-4860-a79e-e2fe5fa9f5e5", "title": "Live updates : Pro - Palestinian college protests against Israel - Hamas war at Portland State , UCLA , Columbia campuses", "date": "2024-05-04 05:30", "url": "https://www.cnn.com/business/live-news/university-protests-pro-palestinian-israel-05-04-24/", "message": "The University of Mississippi has opened a student conduct investigation after actions of “hostility and racist overtones” were portrayed during a demonstration on campus.\nJaylin R. Smith, 24, confirmed to CNN she is the woman seen in the video.\nThe video viewed by CNN shows a large group of counterprotesters yelling at Smith as she walks toward them while holding her phone.\nSmith is heard in the video saying, “I’m not so peaceful” repeatedly as police usher her away from the counterprotesters.\nCNN has been unable to identify any of the counterprotesters seen in the video."}, {"id": "7b7b3274-c579-4a32-ae9e-a533c29480a2", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://toronto.citynews.ca/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "f836d840-4aaa-43fc-b14e-0e96c1a805ae", "title": "Tech becomes teaching tool on Israel Holocaust remembrance day", "date": "2024-05-05 17:45", "url": "https://nocamels.com/2024/05/tech-becomes-teaching-tool-on-israels-holocaust-remembrance-day/", "message": "In Israel, Holocaust Remembrance Day for 2024 begins at sundown on May 5.\nThe first evening sees memorial services being held across the country, with a central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem.\nFlags are flown at half mast in Israel to mark Holocaust Remembrance Day (Joel Goldberg/Wikimedia Commons)The following morning is punctuated by a siren at 10am, which wails throughout Israel for two minutes in memory of the victims.\nAnd according to Zikaron BaSalon, the event is attended annually by around 2 million people across the country.\n“But this year was particularly painful – none of the Holocaust survivors we met even imagined that the horrific memories of the Holocaust would resurface, and this time in their own home.”"}, {"id": "5e786430-8adc-4970-9cae-5b8e447334f8", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://www.mymotherlode.com/news/world/3352547/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7.html", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7 View PhotoKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "00c65fef-4427-41b1-8dab-2ff9449374ce", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 10:00", "url": "https://www.thesunchronicle.com/news/nation_world/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_7619e88e-2c44-5dc7-89b7-b3e2ccbd76ca.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "09d86f49-6f62-4685-9812-e856d2c31337", "title": "  Actions Have Consequences : Dartmouth Jewish Studies Professor Arrested at Pro - Palestinian Protest – JONATHAN TURLEY", "date": "2024-05-04 20:45", "url": "https://jonathanturley.org/2024/05/04/actions-have-consequences-dartmouth-jewish-studies-professor-arrested-at-pro-palestinian-protest/comment-page-2/", "message": "I was standing with a line of women faculty in the their 60s to 80s trying to protect our students.\nDespite pleading guilty to criminal assault, she was not fired and received overwhelming support from the students and faculty.\nAt Hunter College in New York, Professor Shellyne Rodríguez was shown trashing a pro-life display of students.\nMoreover, Jewish students and faculty at schools like Columbia and UCLA were prevented from gaining access to areas on the campuses.\n“Actions have consequences” for students and faculty alike."}, {"id": "a6435150-057a-409c-9c56-0db6785c9aab", "title": "The past three days at GW Gaza solidarity encampment", "date": "2024-05-05 02:30", "url": "https://georgetownvoice.com/2024/05/04/the-past-three-days-at-gws-gaza-solidarity-encampment/", "message": "Over a week ago, a coalition of students from universities across D.C., including Georgetown, George Washington University (GW), and American University, established a Gaza solidarity encampment at University Yard (U-Yard) on GW’s campus.\nWhile the encampment has brought together students, academics, and community members from across D.C., it has also garnered national attention.\nUntil complete liberation, the students are for justice in Palestine.” While others listened to speakers who described messages they had received from people in Gaza thanking students for protesting at the GW encampment.\n“The only thing I can do is to be there with them in spirit by supporting GW and Georgetown students for here.”No Georgetown students spoke at the counter-protest, and it’s unclear if any were present at the demonstration.\nBased on a post on DMV SJP’s Instagram, demonstrators projected a photo of President Joe Biden onto the American flag for several hours, with the words ‘genocide Joe’ written underneath."}, {"id": "fbde8943-cb5d-4c62-b3aa-094fa039b2aa", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "http://www.middletownpress.com/news/world/article/a-holocaust-survivor-will-mark-that-history-19440012.php", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/APKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians."}, {"id": "4aa4f660-e3bc-49f5-8730-2d94fba82fce", "title": "Jewish poet , paratrooper Hannah Senesh honoured in Budapest", "date": "2024-05-05 10:30", "url": "https://www.jwire.com.au/jewish-poet-paratrooper-hannah-senesh-honoured-in-budapest/", "message": "Browse > Home News / Jewish poet, paratrooper Hannah Senesh honoured in Budapest – J-WireJewish poet, paratrooper Hannah Senesh honoured in BudapestRead on for articleHannah Senesh (Szenes) was honoured on Friday in a ceremony at her birthplace in Budapest, Hungary.\nThe Jewish paratrooper and poet was executed at age 23 “not far from here,” Revital Yakin, deputy CEO of March of the Living, said during the event.\nSenesh (1921-44), who was captured after parachuting into Yugoslavia during World War II to rescue Hungarian Jews, endured “severe torture,” Yakin said.\nAnd here, there are more of those than anywhere else.”“How relevant and accurate Hannah Senesh’s letter is even for our days,” said Yakin.\n“May her memory be blessed.”Rakefet Senesh Shkiler, Senesh’s great-grandniece, was one of the poet’s family members who attended the event and laid a wreath in her honor."}, {"id": "058cfada-cffa-4c55-b983-8ff39ad15b98", "title": "The legacy of Holocaust survivor whose home was destroyed on Oct . 7", "date": "2024-05-05 21:45", "url": "https://www.jpost.com/israel-hamas-war/article-799983", "message": "In the venerable \"Kupa\" synagogue in Krakow, Smil Sacagiu, an 87-year-old Holocaust survivor, and his son Mendi participated in a poignant ceremony, marking both remembrance and resilience.\nMendi, torn between protecting his own family and his aging father, found himself in a harrowing position on October 7.\nFifty-five Holocaust survivors, living testaments to resilience and courage, will gather from all corners of the globe.\n\"We have Holocaust survivors here whose grandchildren are hostages in hell,\" he added, underscoring the ongoing threats to Jewish people.\n\"The Jewish spirit is at the heart of the march tomorrow,\" Taieb declared, rallying the community."}, {"id": "11a820e7-3cca-48fe-8d86-01d54a703731", "title": "Demonstrations , threats and hatred : Malmö is not waiting for us", "date": "2024-05-04 19:15", "url": "https://www.ynetnews.com/magazine/article/r1i6oenmc", "message": "All it wanted was to host the Eurovision Song Contest again, for the seventh time - and for the third time in the city of Malmö.\nThousands of Muslims living in Malmö participated in these violent celebrations and in anti-Israel demonstrations that have been taking place in Malmö since then.\nThey are demonstrating against Israel and the war in general and are calling specifically for the removal of Israel from the Eurovision Song Contest.\nDelegations of fearIsrael has already participated twice in the Eurovision Song Contest in Malmö.\nDr. Persson believes that the intensity of the protests will depend on where the Israeli song will be ranked."}, {"id": "e9687cf2-9088-4ba1-afea-08cedb58cbc0", "title": "Transcript : Queen Rania al Abdullah of Jordan on  Face the Nation , May 5 , 2024", "date": "2024-05-05 12:15", "url": "https://www.cbsnews.com/news/queen-rania-al-abdullah-jordan-face-the-nation-05-025-2024/", "message": "The following is a transcript of an interview with Queen Rania al Abdullah of Jordan that aired on May 5, 2024.\nMARGARET BRENNAN: Jordan has two field hospitals inside of Gaza, Jordan is helping to get aid into the Strip.\nAt the same time, they're- they're denying that the starvation is intentional.\nQUEEN RANIA: First of all, I think it's important to point out that law and order are paramount for everybody.\nAnd, you know, when- when Israelis are telling us, you know, \"They're dying because Hamas is using them as human shields.\""}, {"id": "e27dcb2c-0a89-47fd-a270-41de1947ebd6", "title": "Dont be silent about the Antisemitism", "date": "2024-05-05 00:30", "url": "https://www.israelnationalnews.com/news/389404", "message": "The Fateful ConversationThis week's Torah portion, Acharei Mos, relates (for the second time, after the first time in Shmini) the tragic episode of the premature death of Aaron's two sons, Nadav and Avihu.\nSaid Nadav to Avihu, 'When will these two old men die, and you and I will lead the generation?'\nIt reads like this[3]:\"When Job heard about the death of the two sons of Aaron, he was seized by tremendous fear.\nSaid Nadav to Avihu, 'When will these two old men die, and you and I will lead the generation?'\nNo Time for SilenceIn the face of despicable anti-Semitism, coming from so many academics and their foolish students —all good people who remain silent, become accomplices to the crime."}, {"id": "150c39c5-3c5e-4b6d-8ffc-1c89a70a424f", "title": "Protesters take over Columbia University Hamilton Hal ... ", "date": "2024-05-04 06:45", "url": "https://accesswdun.com/article/2024/4/1240797", "message": "Posts on an Instagram page for protest organizers shortly after midnight urged people to protect the encampment and join them at Hamilton Hall.\nHamilton Hall is an academic building that opened in 1907 and is named after Alexander Hamilton, who attended King's College, Columbia's original name.\nDozens of people were arrested Monday during protests at universities in Texas, Utah, Virginia and New Jersey, while Columbia said hours before the takeover of Hamilton Hall that it had started suspending students.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nAnd at Princeton University, students were arrested after briefly occupying a building that houses its graduate school."}, {"id": "99449d03-b40f-44b3-995f-efaca964e785", "title": "A visual history of campus protests in the US", "date": "2024-05-04 09:30", "url": "https://kvia.com/news/us-world/stacker-news/2024/05/04/a-visual-history-of-campus-protests-in-the-us/", "message": "Howard Ruffner // Getty ImagesA visual history of campus protests in the USNational Guardsmen in gas masks with rifles drive back Kent State University students.\nCampus protests trace back at least a century to Fisk University, where protests in the 1920s against then-campus President Fayette McKenzie served as a precursor to the Civil Rights Movement.\nCollege protests have long drawn attention to issues of racial and gender equity, at times advancing or pushing back against legislation.\nIn 1968, Howard University students took over an administrative building to demand drastic changes at the storied historically Black university.\nIn 2017, about 200 Emerson College students walked out of class to protest the administration’s inadequate response to racism on campus."}, {"id": "719ac2b6-08fa-457c-9f0b-dade69febb02", "title": "This Independence Day , we cry for the independence taken from hostages", "date": "2024-05-05 07:00", "url": "https://www.jpost.com/opinion/article-799819", "message": "The list of the annual torch-lighters for Israel’s Independence Day ceremony—conducted on the eve of Independence Day as Remembrance Day for the Fallen of Israel’s Wars and Victims of Terrorism comes to a close—was released to the public this past Thursday, and it makes most hearts in the country swell with pride.\nCarrying the torchesThe first torch, the security forces torch, will be lit by IDF Captain Shavit Ben Moshe, Police Commissioner Amir Cohen, a Shin Bet fighter, and a Mossad intelligence officer.\nAs we head closer and closer to Independence Day, which is merely a little over a week away, we take on two actions.\nThis is the everlasting balancing beam that the Jewish people have tread; we celebrate and mourn collectively; and, in the case of Remembrance Day and Independence Day, back-to-back.\nYou will be free, and we will celebrate your independence just as we celebrate the independence of the State of Israel."}]