[{"id": "4b061eeb-1b3f-4083-96c1-f4ac9f40b757", "title": "Hezbollah confirms a top commander was killed in Israeli strike in Beirut", "date": "2024-08-01 04:00", "url": "https://www.wfmz.com/news/hezbollah-confirms-a-top-commander-was-killed-in-israeli-strike-in-beirut/article_a800557e-e212-5b96-bc00-11b8b47c7d1b.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Weather AlertBulletin: ...HEAT ADVISORY REMAINS IN EFFECT FROM 10 AM THURSDAY TO 8 PM EDT FRIDAY... * WHAT...Heat index values ranging from 95 to 100 degrees expected.\nIn Pennsylvania, Berks, Lehigh, Northampton, and Upper Bucks Counties.\nDrink plenty of fluids, stay in an air-conditioned room, stay out of the sun, and check up on relatives and neighbors.\nTo reduce risk during outdoor work, the Occupational Safety and Health Administration recommends scheduling frequent rest breaks in shaded or air conditioned environments.\n&&Info:Type: Heat Advisorystart_time_local: 2024-08-01T10:00:00-04:00end_time_local: 2024-08-02T20:00:00-04:00county_name:state: PAheadline: Heat Advisory from THU 10:00 AM EDT until FRI 8:00 PM EDTcounty_fips:category: Meturl:urgency: Expectedseverity: Moderatecertainty: Likelygeographicname: Upper Bucks Countystate_name: Pennsylvania"}, {"id": "ee56afbd-bfc3-483e-b65d-4d8ac3ba618f", "title": "Bomb Smuggled Into Iran Guesthouse Months Ago Killed Hamas Leader", "date": "2024-08-01 18:00", "url": "https://www.yahoo.com/news/bomb-smuggled-iran-guesthouse-months-173612531.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Mourners for Ismail Haniyeh, a top political leader of Hamas, at his funeral in Tehran, Iran on Thursday, Aug. 1, 2024.\nThe bomb had been hidden approximately two months ago in the guesthouse, according to five of the Middle Eastern officials.\nIranian officials and Hamas said Wednesday that Israel was responsible for the assassination, an assessment also reached by several U.S. officials who requested anonymity.\nThe deadly blast early Wednesday shattered windows and collapsed a portion of the wall of the compound, photographs showed and the Iranian officials said.\nThe leader of the Palestinian Islamic Jihad, Ziyad al-Nakhalah, was staying next door, two of the Iranian officials said."}, {"id": "74b1ec6f-1a11-417b-8808-895829aa5697", "title": "A Double - Barreled Blow to Iran Axis", "date": "2024-08-01 07:45", "url": "https://www.yahoo.com/news/double-barreled-blow-iran-axis-064100067.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel—Just before sundown on Tuesday, an Israeli strike killed senior Hezbollah military chief Fuad Shukr in the Lebanese terror group’s stronghold in southern Beirut.\nHours later, an explosion of unknown origin killed Haniyeh, Hamas’ Qatar-based leader in exile who was visiting Tehran for the inauguration of Iranian President Masoud Pezeshkian.\n“The supreme leader feels like this is a personal insult, an act of defiance against him.”Though Israel is likely behind the strike, its methods remain a mystery.\nIn 2020, Israel’s Mossad intelligence agency carried out an elaborate hit against Iran’s top nuclear scientist using a remote-control operated machine gun.\n“What we have learned over the last few months is not to underestimate Iran’s willingness to cross previous, imagined red lines in its own escalation."}, {"id": "07783611-f132-4138-ad49-f45203482b35", "title": "Israel confirms death of Hamas military wing leader Deif - Xinhua", "date": "2024-08-01 13:15", "url": "https://english.news.cn/20240801/66c7b11bc35746378631ab572961868c/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "\"Following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike,\" Israel's military said in a press statement.\nIsrael's military said that Deif was killed by a warplane bombing in Khan Yunis.\nIsrael also said that Rafa'a Salameh, the commander of Hamas's Khan Yunis Brigade, was killed in the bombing.\nDeif, 58, head of Hamas's armed wing, the al-Qassam Brigades, had survived at least seven previous assassination attempts by Israel.\nRanked number two in Hamas in Gaza, Deif commanded Hamas's operations during the ongoing conflict, issuing directives to senior members of its military wing, according to the Israeli military."}, {"id": "376d7327-445b-4666-be0a-7d3ee202cd24", "title": "After 300 days of  Operation al - Aqsa Flood : Nasrallah declares  new phase  of war , vows  inevitable  response to Israeli attack on Beirut – Mondoweiss", "date": "2024-08-01 17:15", "url": "https://mondoweiss.net/2024/08/after-300-days-of-operation-al-aqsa-flood-nasrallah-declares-new-phase-of-war-vows-inevitable-response-to-israeli-attack-on-beirut/", "domain": "mondoweiss.net", "domain_classification": "Unknown", "message": "690 Israeli soldiers have been recognized as killed, and 4096 as wounded by the Israeli army since October 7.\nSpeaker of Iranian parliament says Israel made “strategic mistake” by killing Haniyeh; Iranian Supreme Leader Khamenei and Iranian Revolutionary Guard pledge revenge.\nMarking 300 days of war, Israeli opposition leader Yair Lapid says “all the government can offer is one war after the other.”Israeli protesters block main highway in Tel Aviv demanding ceasefire and prisoners’ exchange deal.\nPalestinians observe general strike in all West Bank cities on Wednesday in mourning over Haniyeh assassination, take part in several marches.\nOne Israeli wounded in stabbing and shooting attack in Hebron in southern West Bank, Wednesday."}, {"id": "2a9f3a5f-79a1-455b-82be-d96410c411df", "title": "How will Hamas and Hezbollah avenge death of key players ? ", "date": "2024-08-01 00:15", "url": "https://www.thetimes.com/world/israel-hamas-war/article/how-will-hamas-hezbollah-avenge-death-f8blmdx3q", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "In less than 12 hours Israel assassinated two leaders of Iran’s “axis of resistance” in different capital cities.\nOn Tuesday evening, an airstrike on a building in Beirut killed Fuad Shukr, Hezbollah’s military commander and the second most powerful man in the Lebanese militant group.\nHours later, a bomb fired from the air struck a house in Tehran where Ismail Haniyeh, the political leader of Hamas, was staying after he attended the inauguration of the new Iranian president.\nThe attack sent shockwaves throughout the Middle East.\nFuad Shukr was killed in an airstrike on a building in south Beirut on Tuesday evening AFPHere are four scenarios for how the crisis could play out:Hezbollah overwhelms Israeli defences with a massive attack on Tel Aviv and other Israeli citiesHezbollah’s leader, Hassan Nasrallah, previously vowed that an Israeli attack on the"}, {"id": "87c5cb9a-2119-4938-b6d0-b60da415f5e1", "title": "IDF airstrike kills Al Jazeera journalist , cameraman", "date": "2024-08-01 02:30", "url": "https://www.yahoo.com/news/idf-airstrike-kills-al-jazeera-013144077.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Photo by Hossam Azzam/UPIJuly 31 (UPI) -- Israel Defense Forces allegedly targeted a reporter and cameraman working for Al Jazeera west of Gaza City on Wednesday.\nMourners and colleagues surround the body of Al-Jazeera Arabic journalist Ismail Al-Ghoul, killed along with his cameraman Rami Al-Refee in an Israeli airstrike Tuesday.\nPhoto by Hossam Azzam/UPIThe pair had contacted the Al Jazeera news desk about 15 minutes prior to the missile strike that killed them, according to Al Jazeera.\n\"Israel must explain why two more Al Jazeera journalists have been killed in what appears to be a direct strike.\"\nThe IDF on June 9 rescued three hostages who were held at the home of a Gaza journalist who previously contributed to Al Jazeera."}, {"id": "ea34ae35-abb4-49dd-b77d-509a064aa378", "title": "Iran supreme leader prays over the coffin of Hamas leader Haniyeh", "date": "2024-08-01 13:15", "url": "https://www.mirror.co.uk/news/world-news/irans-supreme-leader-prays-over-33372824", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Iran's supreme leader Ayatollah Ali Khamenei prayed over Haniyeh’s coffin at Tehran University while Iran’s new President Masoud Pezeshkian stood next to himIran's supreme leader prayed over the coffin of Hamas leader Ismail Haniyeh after his assassination raised fears of an all-out war.\nAyatollah Ali Khamenei was pictured next to Haniyeh’s coffin and his bodyguard at Tehran University while Iran’s new President Masoud Pezeshkian stood next to him.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nIran supports Hamas, as well as Hezbollah and other Palestinian militant groups fighting Israel in Gaza.\nImage: Getty Images) Getty Images)Bitter regional rivals, Israel and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April."}, {"id": "672eb745-4332-4b03-afd0-9babef08980f", "title": "Was Hamas chief Haniyeh killed by bomb smuggled into guest house ? ", "date": "2024-08-01 17:45", "url": "https://gulfnews.com/world/mena/was-hamas-chief-haniyeh-killed-by-bomb-smuggled-into-guest-house-1.103694697", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Dubai: Amid speculation about how Israel managed to target Hamas leader Ismail Haniyeh in Tehran, the New York Times (NYT) reported that he was killed by a bomb smuggled into the guesthouse where he was staying a few months earlier.\nIt shook the building, shattered windows, and partially collapsed an exterior wall.\nThe report noted that the bomb had been hidden in the guesthouse approximately two months ago, quoting five Middle Eastern officials.\nThe bomb was detonated remotely once it was confirmed that Haniyeh was inside his room at the guesthouse.\nHaniyeh, who had led Hamas’s political office in Qatar, had stayed at the guesthouse several times when visiting Tehran, according to the Middle Eastern officials."}, {"id": "debdc4f4-8f14-4727-9ee6-c4b31917b46c", "title": "Israel says Hamas military wing chief killed in airstrike last month", "date": "2024-08-01 13:30", "url": "https://www.yahoo.com/news/israel-says-hamas-military-wing-115752598.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military said Thursday that Mohammed Deif, the head of Hamas’s military wing, was killed last month in an airstrike.\nThe military official was also thought to have escaped or survived multiple assassination attempts and had not been seen in public in years.\nThe announcement from the Israeli military comes nearly two weeks after Israel launched a strike in southern Gaza, targeting Deif and Hamas’s top Gaza official, Yahya Sinwar.\nAt the time, Israeli forces did not confirm whether the July 13 strike killed either official.\nIsrael has not claimed responsibility, though Prime Minister Benjamin Netanyahu gave defiant remarks following the news, saying the Israeli military is achieving its war aims."}, {"id": "49f023f2-f408-4115-aefc-4b39148b7773", "title": "Commander Fuad Shukr killing signifies greatest loss for Hezbollah", "date": "2024-08-01 17:30", "url": "https://www.jpost.com/israel-hamas-war/article-812931", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Fuad Shukr, the top Hezbollah commander killed by Israel on Tuesday, was a founding member of the Iran-backed terror group who helped oversee its expansion from a shadowy Lebanese civil war militia to a major force in the Middle East.\nHezbollah leader Sayyed Hassan Nasrallah is due to speak at his funeral on Thursday.\nRetaliatory strikeIsrael killed Shukr, 61, in retaliation for a July 27 rocket attack that killed 12 children and teenagers in a Druze village in the Golan Heights on Saturday.\nHis roles included acting as military adviser to Hezbollah leader Sayyed Hassan Nasrallah.\nThe Israeli military said Shukr was responsible for the majority of Hezbollah's most advanced weaponry, including precision-guided missiles, cruise missiles, anti-ship missiles, long-range rockets, and drones."}, {"id": "1ba192c5-5ef1-4fd6-9789-1e13bf7f9132", "title": "Missile or drone killed militant in Tehran bedroom", "date": "2024-08-01 00:15", "url": "https://www.thetimes.com/world/israel-hamas-war/article/israel-weapons-ismail-haniyeh-killed-militant-explained-8fzqfs73r", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "In the past 15 years it has featured drone strikes, sticky car bombs, syringes of poison wielded by Mossad agents dressed in tennis gear, and robot machineguns.\nIsmail Haniyeh’s killing was unannounced on the Israeli side — some killings are admitted immediately, like the strike on the Hezbollah leader Fuad Shukr on Tuesday night; some not.\nIran’s only clue as to the method used on this occasion was that the residence where he was staying in Tehran was hit by a “projectile”.\nA Hamas official said it took out the window and wall of Haniyeh’s room, killing him and his bodyguard.\nIf that is correct, the most likely method was a missile fired from a"}, {"id": "fb2f8b87-8208-4d52-a92e-148c04753fa0", "title": "Hezbollah confirms a top commander was killed in Israeli strike in Beirut", "date": "2024-08-01 04:00", "url": "https://santamariatimes.com/ap/international/hezbollah-confirms-a-top-commander-was-killed-in-israeli-strike-in-beirut/article_68a0d584-59e5-56ac-9964-37b19e3bc17d.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "6685ce9b-4f30-471e-abb0-e8e5d2df89f2", "title": "Al Jazeera journalists Ismail Al - Ghoul and Rami Al - Rifi killed in reported Israeli airstrike in Gaza , network says", "date": "2024-08-01 00:00", "url": "https://edition.cnn.com/2024/07/31/middleeast/al-jazeera-journalists-killed-airstrike-gaza-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Ismail Al-Ghoul and his cameraman, Rami Al-Rifi, who lived in the besieged enclave, were killed in an airstrike on their car in the al Shati refugee camp, according to the Qatar-based network.\nAl-Ghoul was wearing a press flak vest when he was killed, according to his colleague.\nIsrael must stop killing journalists.”Khader Al-Za’anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul’s bloodied flak jacket.\n“Our colleague Ismail was wearing this blood-stained vest,” fellow Al Jazeera journalist Yousef Al Saudi said, as he removed the “PRESS” sign from the jacket."}, {"id": "32701664-70d2-4dc4-b554-a22d58e01472", "title": "Iranian advisor among victims of Israeli assassination op . against Hezbollah cmdr . ", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iranian advisor among victims of Israeli assassination op.\nIran Press TVWednesday, 31 July 2024 9:18 PMAn Iranian military advisor has been named among the victims of a recent Israeli assassination operation against Lebanon's capital Beirut that claimed the life of a senior commander of the Lebanese resistance movement Hezbollah.\nAccording to Lebanon's' health ministry, two children were also among the victims of the operation that wounded another 74 people.\nAlso on Wednesday, another assassination operation claimed the lives of the Palestinian resistance movement Hamas' Political Bureau Chief Ismail Haniyeh and one of his bodyguards in Tehran.\nThe Palestinian resistance leader was in the Iranian capital to attend the inauguration ceremony of Iranian President Masoud Pezeshkian."}, {"id": "b06f0ebd-2f94-4aa0-a32a-b04eccb3cfcd", "title": "Hamas military operations chief killed in July airstrike , Israel says", "date": "2024-08-01 11:15", "url": "https://www.euronews.com/2024/08/01/hamas-military-operations-chief-killed-in-july-airstrike-israel-says", "domain": "euronews.com", "domain_classification": "Unknown", "message": "By Euronews with APThe leader of Hamas' military operations Mohammed Deif was killed by an Israeli-targeted airstrike in Gaza in July, the IDF confirmed on Thursday.\nADVERTISEMENTThe leader of Hamas' al-Qassam Brigades, Mohammed Deif, was killed by an Israeli-targeted airstrike in Gaza in July, the IDF confirmed on Thursday.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas' top political leader, Ismail Haniyeh.\nAlong with Deif and Haniyeh, Israel has vowed to eliminate Hamas' top leader in Gaza, Yahya Sinwar, but he has so far remained elusive.\nDeif was one of the founders of Hamas’ military wing, the al-Qassam Brigades, in the 1990s and led the unit for decades."}, {"id": "5ce1a0ae-4430-438b-984b-1a365f045c6e", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war - Boston News , Weather , Sports", "date": "2024-08-01 00:15", "url": "https://whdh.com/news/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Hamas’ top political leader was killed Wednesday by a predawn airstrike in the Iranian capital, Iran and the militant group said, blaming Israel for a shock assassination that risked escalating into an all-out regional war.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nThe strike also killed three women and two children, according to the Lebanese Health Ministry.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said."}, {"id": "a2d46df8-ec9f-4ecd-9700-2e21068bb8c3", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 09:30", "url": "https://www.wsls.com/news/world/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "(AP Photo/Jehad Alshrafi, File)JERUSALEM – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nRecommended VideosThere was no immediate comment on the Israeli claim by Hamas, which had previously said Deif survived the strike in Gaza.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "ea29f287-c894-4827-80aa-41cd2b8c02cd", "title": "Dead or alive ? What has happened to Hamas targets on Benjamin Netanyahu hit list as terrorist group leader Ismail Haniyeh is assassinated in  Israeli  airstrike", "date": "2024-08-01 00:00", "url": "https://www.dailymail.co.uk/news/article-13695481/Dead-alive-happened-Hamas-targets-Benjamin-Netanyahus-hit-list-terrorist-groups-leader-Ismail-Haniyeh-assassinated-Israeli-airstrike.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Iran's supreme leader has vowed to inflict ‘severe punishment’ on Israel after the political head of Hamas was assassinated in Tehran early yesterday.\nExperts say he was the fourth hit on an Israeli ‘kill list’ of Hamas leaders drawn up after October 7, with only two still alive.\nIsmail Haniyeh, 62, was killed with a guided missile ‘launched from within Iran’ in a 2am attack that risks sparking an all-out regional war.\nFour dead two alive on Israel's hit-listHamas leader Ismail Haniyeh, 62, was killed with a guided missile ‘launched from within Iran’ in a 2am attack early Wednesday.\nExperts say he was the fourth hit on an Israeli ‘kill list’ of Hamas leaders drawn up after October 7, with only two still alive."}, {"id": "b4390df4-251e-4a0e-b921-c093f1a2e84e", "title": "Hezbollah issues first statement on Israeli attack on Beirut", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-irna18.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah issues first statement on Israeli attack on BeirutIRNA - Islamic Republic News AgencyJul 31, 2024Tehran, IRNA -- The Lebanese resistance movement Hezbollah has issued a first statement about an Israeli attack in southern Beirut that targeted a senior commander of the group.\nHezbollah confirmed in the statement issued on Wednesday that senior commander of the group Fuad Shoukr (Hajj Mohsen) had been present in the building that was hit by the Israeli airstrike late on Tuesday.\nIt said, however, that search teams were working on the site of the attack to determine the fate of Shoukr.\n\"We are still waiting for the results of the search efforts to know the fate of the senior and dear commander as well as other citizens,\" said the group.\nThe Israeli regime claimed on Tuesday that it had carried out \"a targeted strike\" against a Hezbollah commander that it accused of being behind a rocket explosion in Majdal Shams, in the Israeli-occupied Golan Heights, over the weekend."}, {"id": "98f6c6c5-ee7f-4d18-ab15-1f415f354b6a", "title": "Israel Kills Gaza Journalists Who Covered Dire Conditions During Hospital Raid", "date": "2024-08-01 01:15", "url": "https://www.yahoo.com/news/israel-kills-gaza-journalists-covered-004049221.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A funeral ceremony is held Wednesday for Palestinian journalists Ismail al-Ghoul and Rami al-Rifi, who were killed in an Israeli attack west of Gaza City.\nFootage also shows Gaza Civil Defense workers recovering the journalists’ remains from the car, collecting pieces of their shredded bodies in plastic bags.\nThe men were taken to al-Ahli Arab Hospital, where journalists and loved ones gathered to mourn before their shrouded bodies that still donned tattered, bloodied press jackets, according to Al Jazeera.\nSpecifically, Israeli forces have killedmultiple Al Jazeera journalists since Oct. 7, according to the media outlet.\nIsraeli officials have long voiced their opposition to the Qatar-based network, bombing its Gaza office and banning its journalists from reporting in Israel."}, {"id": "926b5138-3632-4442-960e-39cc0a28b2fd", "title": "Hamas military wing chief Mohammed Deif died in Gaza strike , Israel says", "date": "2024-08-01 11:15", "url": "https://www.breakingnews.ie/israel-hamas/hamas-military-wing-chief-mohammed-deif-died-in-gaza-strike-israel-says-1656765.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "The Israeli military said on Thursday that it has confirmed that the head of Hamas’s military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement comes a day after an apparent Israeli strike in the Iranian capital killed Hamas’s top political leader.\nHamas has said Mr Deif survived the July attack in Gaza and did not immediately comment on the military’s announcement of confirmation.\nIsrael targeted Mr Deif in a July 13 strike that hit a compound on the outskirts of the southern Gaza city of Khan Younis.\nAdvertisementMr Deif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and led the unit for decades."}, {"id": "c14fc840-1cbb-402b-acee-a7b5f9d1fac4", "title": "Deaths of Hamas , Hezbollah Leaders Heighten Tensions in Middle East", "date": "2024-08-01 00:00", "url": "https://www.theepochtimes.com/world/death-of-hamas-hezbollah-leaders-heightens-tensions-in-middle-east-5697505", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Israel has taken responsibility for killing Hezbollah’s Fuad Shukr in Beirut, but not for a precise missile strike killing Hamas’s Ismail Haniyeh in Tehran.\nA Hezbollah missile struck a soccer field in a Druze village in the Golan Heights on July 27, killing 12 children and teens, while wounding more than 40 others.\nHamas and Hezbollah are both client groups of Iran, which has substantially armed and trained both.\nIran might coordinate an attack with Hezbollah and with Yemen’s Houthi rebels, also Iranian clients, he said.\nSperling noted that Iran’s April missile attack, retaliation for an Israeli strike against a high-ranking Iranian in Damascus, was in some ways restrained."}, {"id": "96f462ac-17f6-48e5-b132-d89054387980", "title": "MARK ALMOND : The world stands on the brink of a major war", "date": "2024-08-01 03:15", "url": "https://www.dailymail.co.uk/debate/article-13695107/MARK-ALMOND-world-stands-brink-major-war-terrifyingly-theres-no-one-escalate-it.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Today, the world stands on the brink of major war.\nThese two surgical killings mark a major escalation of Israel’s twin conflicts with its neighbours — Lebanon to the north and the Palestinians to the south.\nYesterday’s air strike — ­presumably masterminded by Israel’s intelligence service Mossad from Jerusalem — took place at 2am in Tehran.\nBut it is Iran’s proxy forces throughout the rest of the Middle East that make international conflict so terrifyingly plausible.\nThe danger for Netanyahu and Israel is that the country could be dragged into a bigger, wider war on many fronts."}, {"id": "4786fce9-a727-43b5-84a4-678c5de6dc08", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 01:00", "url": "https://www.gjsentinel.com/news/world/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out/article_96885ff6-9e6f-5055-87a0-b35d46074c57.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "This picture released on Wednesday, July 31, 2024, by Hezbollah media relations office, shows Fouad Shukur, a Hezbollah top commander who was killed by an Israeli airstrike that hit a building on Tuesday, July 30, 2024, in a southern suburb of Beirut, Lebanon.\nThe Hezbollah commander who the Israeli military says it was killed in an airstrike Tuesday had been blamed by Israel for a deadly weekend rocket attack and was accused by the U.S. of orchestrating the 1983 bombing in Beirut that killed 241 American servicemen."}, {"id": "0e979d02-7577-4cfa-9304-b0d1e72bada6", "title": "Muhammad Deif , a top Hamas commander , is dead , says Israel", "date": "2024-08-01 18:00", "url": "https://www.businesstimes.com.sg/international/muhammad-deif-top-hamas-commander-dead-says-israel", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "The Israeli military said on Thursday (aug 1) that it had killed Muhammad Deif, the elusive commander of Hamas’ military wing who has long been one of the country’s most wanted militants.\n“Following an intelligence assessment, it can be confirmed that Muhammad Deif was eliminated in the strike,” the Israeli military statement said, without offering any more specific evidence that he was dead.\nDeif, who survived several previous Israeli assassination attempts, has been the No 2 Hamas leader inside Gaza.\nHe is the highest-ranking Hamas figure inside Gaza that Israel says it has killed since Oct 7.\nAnalysts credit him with transforming Hamas’ military wing, the Qassam Brigades, into a powerful and well-organised fighting force with tens of thousands in its ranks."}, {"id": "7d0ed84a-88cc-4e86-b504-41f8c0ba9076", "title": "Israel says it killed Muhammad Deif , main planner of October 7 attack", "date": "2024-08-01 17:30", "url": "https://www.voanews.com/a/israel-says-it-killed-muhammad-deif-main-planner-of-october-7-attack/7726128.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Israel said Thursday it killed Hamas military chief Muhammad Deif, believed to be the main planner of the shock October 7 Hamas attack on Israel, in the southern Gaza city of Khan Younis in mid-July.\nIsrael had targeted him in an attack that killed at least 90 people, but Deif’s fate was unknown.\nGallant said the July operation “was conducted precisely and professionally” by the Israel Defense Forces and the Israel Security Agency.\nHours later, Ismail Haniyeh, Hamas’ political leader, was assassinated in Tehran.\nHaniyeh’s death comes nearly 10 months after Iran-backed Hamas launched the terror attack on southern Israel, killing 1,200 people and taking about 250 hostages."}, {"id": "cdb0d692-baf1-4d5d-a354-be8158f03caa", "title": "U . S . Strikes Iraqi Base Used by Iran - Backed Militia Amid Rising Tensions", "date": "2024-08-01 02:00", "url": "https://www.breitbart.com/middle-east/2024/07/31/u-s-strikes-iraqi-base-used-by-iran-backed-militia-amid-rising-tensions/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "U.S. officials on Tuesday said American forces struck a base near Baghdad, Iraq, used by the Popular Mobilization Forces (PMF), the Iran-backed Shiite militias that have launched numerous terrorist attacks on American forces since the beginning of the Gaza war.\nIraqi sources said the strike killed four PMF members and wounded four others.\nThe PMF and Iraq’s leading Iran-backed militant organization, Kata’ib Hezbollah, were curiously subdued in their response to the strike.\nThe last U.S. action against Iraqi militias took place in February, but the militias launched rockets and a drone at U.S. forces in July.\nThe American defensive strike against Iraqi militias came just hours after an Israeli airstrike killed Fuad Shukr, a commander of Iran-backed Hezbollah forces in Lebanon."}, {"id": "d6a3513a-b22b-4d95-be09-061100f2aca6", "title": "U . S . Strikes Iraqi Base Used by Iran - Backed Militia Amid Rising Tensions", "date": "2024-08-01 00:00", "url": "https://www.breitbart.com/national-security/2024/07/31/u-s-strikes-iraqi-base-used-by-iran-backed-militia-amid-rising-tensions/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "U.S. officials on Tuesday said American forces struck a base near Baghdad, Iraq, used by the Popular Mobilization Forces (PMF), the Iran-backed Shiite militias that have launched numerous terrorist attacks on American forces since the beginning of the Gaza war.\nIraqi sources said the strike killed four PMF members and wounded four others.\nThe PMF and Iraq’s leading Iran-backed militant organization, Kata’ib Hezbollah, were curiously subdued in their response to the strike.\nThe last U.S. action against Iraqi militias took place in February, but the militias launched rockets and a drone at U.S. forces in July.\nThe American defensive strike against Iraqi militias came just hours after an Israeli airstrike killed Fuad Shukr, a commander of Iran-backed Hezbollah forces in Lebanon."}, {"id": "9caf299b-e3ec-445a-a60d-ff640ae9227b", "title": "After Hamas leader killed , still unclear if Israel notified US about strikes", "date": "2024-08-01 00:15", "url": "https://www.newschannel5.com/world/israel-at-war/after-hamas-leader-killed-still-unclear-if-israel-gave-us-advanced-notification-of-strikes", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "Hamas leader Ismail Haniyeh was killed in an airstrike in the early morning hours on Wednesday in Iran's capital city of Tehran.\nIsrael is being blamed for the strike — even though there was no immediate comment on the strike from Israel — which has sparked fears of a larger escalation of conflict in the region.\nRELATED STORY | Hamas leader Ismail Haniyeh is killed in Iran by an alleged Israeli strike, threatening escalationJaffer said that while there is a different operational leader, Haniyeh was a \"very significant figure\" influencing strategy and other overarching aspects of operations for Hamas.\nJaffer said it's still unclear if Israel notified U.S. military and government authorities about any planned strikes.\nHe says dozens of rocket strikes over the \"last weeks and months\" are likely part of why Israel apparently ramped up its recent retaliatory responses."}, {"id": "4992e39d-db70-4b7b-b5f3-42fcf33834f2", "title": "Iran vows to retaliate after Hamas leader assassinated in Tehran", "date": "2024-08-01 00:45", "url": "https://www.reviewjournal.com/news/nation-and-world/iran-vows-to-retaliate-after-hamas-leader-assassinated-in-tehran-3105564/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Iran’s supreme leader vowed revenge against Israel after Hamas top political leader Ismail Haniyeh was killed Wednesday in a predawn airstrike in the Iranian capital.\nIn this photo released by the office of the Iranian supreme leader, Hamas chief Ismail Haniyeh, right, and the leader of the Palestinian Islamic Jihad group Ziad Nakhaleh sit in a meeting with Supreme Leader Ayatollah Ali Khamenei, in Tehran, Iran, Tuesday, July 30, 2024.\n(AP Photo/Vahid Salemi)Hamas chief Ismail Haniyeh arrives at the Iranian parliament to attend the swearing-in ceremony of newly-elected President Masoud Pezeshkian, in Tehran, Iran, Tuesday, July 30, 2024.\n(AP Photo/Vahid Salemi)BEIRUT — Iran’s supreme leader vowed revenge against Israel after Hamas top political leader Ismail Haniyeh was killed Wednesday in a predawn airstrike in the Iranian capital.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates."}, {"id": "89a93509-0093-4435-94d2-7850a414bb26", "title": "World War 3 Alert ! Iran Says That It Will Conduct  Special Operations  To Take Revenge On Israel", "date": "2024-08-01 00:00", "url": "http://theeconomiccollapseblog.com/world-war-3-alert-iran-says-that-it-will-conduct-special-operations-to-take-revenge-on-israel/", "domain": "theeconomiccollapseblog.com", "domain_classification": "Unknown", "message": "As you will see below, the Iranians are vowing that they will take revenge on Israel.\nSo what will Iran’s revenge look like?\nThe last time Iran directly attacked Israel, it was a carefully crafted assault that was orchestrated not to cause too much damage.\nOfficials referenced the “humiliating security failure” and that Iran must once against show “strength against the risk of escalation” in exacting revenge on Israel.\nFor years, I have been relentlessly warning that there would be a major war in the Middle East that would involve Israel and Iran fighting one another directly."}, {"id": "46d6a0c4-ed3c-41f5-9eb7-899345da0352", "title": "Hama Ismail Haniyeh assassinated by Israel strike : Iran", "date": "2024-08-01 00:45", "url": "https://www.ctvnews.ca/world/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war-1.6983898", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Most dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nBitter regional rivals, Israel and Iran risked plunging into war earlier this year when Israel hit Iran's embassy in Damascus in April.\nHe did not mention the Haniyeh killing, and a U.S.-provided summary of his call with Austin did not mention it.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said."}, {"id": "40ad2eb4-a679-4e00-8765-e65db0ec24d1", "title": "Israel - Hamas war latest : Hamas leader Ismail Haniyeh was assassinated in Tehran , Iran says", "date": "2024-08-01 06:15", "url": "https://www.britannica.com/news/1259976/dc43918f348578f5f04ad702cfec647a", "domain": "britannica.com", "domain_classification": "Unknown", "message": "July 31, 2024, 11:50 PM ETBy The Associated PressHamas leader Ismail Haniyeh was assassinated in Tehran, Iran’s paramilitary Revolutionary Guard said early Wednesday.\nIran blames Israel for the killings of Hamas’ political chief, Ismail Haniyeh, in Iran and of a top Hezbollah commander in Lebanon.\nConcerns about cease-fire negotiations have soared in the hours after the killing of Hamas’ top political leader, Ismail Haniyeh.\nThere was no immediate reaction to the reports of Hamas leader Ismail Haniyeh's assassination from the White House.\nHamas leader Ismail Haniyeh was assassinated in Tehran, Iran saysTEHRAN, Iran — Hamas leader Ismail Haniyeh was assassinated in Tehran, Iran’s paramilitary Revolutionary Guard said early Wednesday."}, {"id": "37a5ac8f-7318-45dd-b02c-46bbe7dcadd3", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 00:15", "url": "https://www.wfmz.com/news/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out/article_c8f28873-570f-5483-8f50-007313b91fd8.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Weather AlertBulletin: ...HEAT ADVISORY REMAINS IN EFFECT FROM 10 AM THURSDAY TO 8 PM EDT FRIDAY... * WHAT...Heat index values up to 100 expected.\nIn Pennsylvania, Berks, Lehigh, Northampton, and Upper Bucks Counties.\nDrink plenty of fluids, stay in an air-conditioned room, stay out of the sun, and check up on relatives and neighbors.\nTo reduce risk during outdoor work, the Occupational Safety and Health Administration recommends scheduling frequent rest breaks in shaded or air conditioned environments.\n&&Info:Type: Heat Advisorystart_time_local: 2024-08-01T10:00:00-04:00end_time_local: 2024-08-02T20:00:00-04:00county_name:state: PAheadline: Heat Advisory from THU 10:00 AM EDT until FRI 8:00 PM EDTcounty_fips:category: Meturl:urgency: Expectedseverity: Moderatecertainty: Likelygeographicname: Upper Bucks Countystate_name: Pennsylvania"}, {"id": "03021873-c658-4249-8e3a-863b8cb58dc7", "title": "Thousands at Hamas leader funeral as Tehran vows retaliation", "date": "2024-08-01 11:30", "url": "https://www.thetimes.com/world/israel-hamas-war/article/thousands-at-hamas-leaders-funeral-as-tehran-vows-retaliation-8rbqc9cc5", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "Thousands have turned out for the funeral of Ismail Haniyeh, Hamas’s slain leader, as processions began in the Iranian capital with funeral prayers led by Ayatollah Ali Khamenei, the country’s supreme leader.\nHaniyeh was killed in an apparent Israeli strike as he visited Tehran, leaving the region now braced for war.\nAt Tehran University, mourners carrying his picture gathered before Ayatollah Khamenei as he prayed over Haniyeh’s coffin, standing next to the newly inaugurated president, Masoud Pezeshkian.\nThe funeral prayers for the two men were led by Ayatollah Ali Khamenei IRANIAN LEADER PRESS OFFICE/GETTY IMAGESState television later showed the coffin of the former Hamas leader and his bodyguard — who Iran said also died in the airstrike — placed on a truck and paraded down a street toward Azadi Square.\nHuge crowds were shown throwing flowers as the procession moved through the"}, {"id": "e6dd20aa-7ba8-45ba-89c4-06b90fbd2f00", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error - LocalNews8 . com", "date": "2024-08-01 10:15", "url": "https://localnews8.com/news/national-world/ap-national/2024/07/31/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Associated PressBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“They can also hit Israeli or Jewish targets globally.”Trita Parsi, executive vice president of the Quincy Institute for Responsible Statecraft, said he expects Iran’s response to be another direct hit on Israel.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "992d10c1-5ae4-4e05-98de-8ecb4b02f281", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 03:00", "url": "https://isp.netscape.com/news/world/story/0001/20240801/30968a7acb31cd8b259de9650014b779", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Hamas' top political leader is killed in Iran in strike that risks triggering all-out regional warBEIRUT (AP) — Hamas' top political leader was killed Wednesday by a predawn airstrike in the Iranian capital, Iran and the militant group said, blaming Israel for a shock assassination that risked escalating into an all-out regional war.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nThe strike also killed three women and two children, according to the Lebanese Health Ministry.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said."}, {"id": "0f7805f2-8777-42d5-a7ca-51f89ef4c5f0", "title": "Leader dead after Iran strike , Hamas confirms | The Arkansas Democrat - Gazette", "date": "2024-08-01 11:00", "url": "https://www.arkansasonline.com/news/2024/aug/01/leader-dead-after-iran-strike-hamas-confirms/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Most dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nHe did not mention the Haniyeh killing, and a U.S.-provided summary of his call with Austin did not mention it.\nHours later, the strike hit a residence Haniyeh uses in Tehran, killing him, Hamas said.\nHamas chief Ismail Haniyeh arrives at the Iranian parliament to attend the swearing-in ceremony of newly-elected President Masoud Pezeshkian, in Tehran, Iran, Tuesday, July 30, 2024.\nHaniyeh, Hamas' political chief in exile, was killed in an airstrike in the Iranian capital early Wednesday."}, {"id": "0c9f9261-6e69-4ef8-a434-182bb35bfb44", "title": "Benjamin Netanyahu , Joe Biden to hold phone call as Iran , Hamas vow revenge over key assassinations", "date": "2024-08-01 17:15", "url": "https://www.livemint.com/news/world/benjamin-netanyahu-joe-biden-to-hold-phone-call-as-iran-hamas-vow-revenge-over-key-assassinations-11722530554861.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu and US President Joe Biden will hold a phone call on Thursday.\nNetanyahu and Biden may hold a conversation amid escalating tension between Iran and Israel.\nIran and Palestinian militant group Hamas vowed to avenge the killing of Hamas political chief Ismail Haniyeh.\nIt is expected that Iran or its allies will retaliate for the killing of senior leaders of Hezbollah and Hamas this week.\nAlso Read | Israel claims killing Hezbollah leader accused of 1983 Beirut bombing\"The resistance cannot but respond."}, {"id": "1316c92e-ece8-4a52-a51b-6ea21a260766", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 19:00", "url": "https://whmp.com/news/030030-hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/", "domain": "whmp.com", "domain_classification": "Unknown", "message": "Israel had pledged to kill Ismail Haniyeh and other Hamas leaders over the group’s Oct. 7 attack on southern Israel that sparked the war in Gaza.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nIsrael carried out a rare strike Tuesday evening in the Lebanese capital that it said killed a top Hezbollah commander allegedly behind the rocket strike.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nHours later, the strike hit a residence Haniyeh uses in Tehran, killing him, Hamas said."}, {"id": "28af2418-0c63-434d-bbd1-7a146b31a40b", "title": "HAMAS MEDIA : CBS Patta Mourns Death of Top Hamas Boss", "date": "2024-08-01 08:30", "url": "https://newsbusters.org/blogs/nb/jorge-bonilla/2024/08/01/hamas-media-cbss-patta-mourns-death-top-hamas-boss", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "This is one of the extremely rare times when a media outlet insists on telling both sides of a story.\nWatch as correspondent Debora Patta closes out her report on the aftermath of the assassination of Hamas leader Ismail Haniyeh with pro-Hamas reactions:CBS EVENING NEWS 7/31/24 6:37 PM DEBORA PATTA: In the israeli-occupied West Bank, the assassination was met with shock and disbelief.\nPeople have been chanting \"West Bank for Hamas.\"\nNORAH O’DONNELL: Debora Patta.\nPatta’s reporting took her, as it often does, to the West Bank."}, {"id": "05db8017-4584-41cb-9bf2-aac213479981", "title": "HAMAS MEDIA : CBS Patta Mourns Death of Top Hamas Boss", "date": "2024-08-01 06:30", "url": "https://www.newsbusters.org/blogs/nb/jorge-bonilla/2024/08/01/hamas-media-cbss-patta-mourns-death-top-hamas-boss", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "This is one of the extremely rare times when a media outlet insists on telling both sides of a story.\nWatch as correspondent Debora Patta closes out her report on the aftermath of the assassination of Hamas leader Ismail Haniyeh with pro-Hamas reactions:CBS EVENING NEWS 7/31/24 6:37 PM DEBORA PATTA: In the israeli-occupied West Bank, the assassination was met with shock and disbelief.\nPeople have been chanting \"West Bank for Hamas.\"\nNORAH O’DONNELL: Debora Patta.\nPatta’s reporting took her, as it often does, to the West Bank."}, {"id": "24689e44-9aea-4c1e-957f-f466df45d270", "title": "Iranian advisor among victims of Israeli assassination op . against Hezbollah cmdr . ", "date": "2024-08-01 00:30", "url": "https://www.presstv.ir/Detail/2024/07/31/730453/Iran-military-advisor-killed-Israeli-assassination-Hezbollah-commander-Shukr-Beirut", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "An Iranian military advisor has been named among the victims of a recent Israeli assassination operation against Lebanon’s capital Beirut that claimed the life of a senior commander of the Lebanese resistance movement Hezbollah.\nThe advisor, identified as Milad Bidi, was martyred on Tuesday, when the attack targeted the building accommodating the Hezbollah commander Fuad Shukr, Fars News Agency reported on Wednesday.\nAccording to Lebanon’s’ health ministry, two children were also among the victims of the operation that wounded another 74 people.\nAlso on Wednesday, another assassination operation claimed the lives of the Palestinian resistance movement Hamas’ Political Bureau Chief Ismail Haniyeh and one of his bodyguards in Tehran.\nThe Palestinian resistance leader was in the Iranian capital to attend the inauguration ceremony of Iranian President Masoud Pezeshkian."}, {"id": "62a4de31-5468-499e-9114-777c27de023b", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 06:30", "url": "https://abcnews.go.com/International/wireStory/iran-hezbollah-calibrating-response-israeli-strikes-leaves-room-112465558", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Two back-to-back strikes in Beirut and Tehran targeted high-ranking figures in Hezbollah and Hamas and have been attributed to IsraelFor Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for errorBEIRUT -- Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“They can also hit Israeli or Jewish targets globally.”Trita Parsi, executive vice president of the Quincy Institute for Responsible Statecraft, said he expects Iran’s response to be another direct hit on Israel.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "80bb8830-77fb-472c-981b-ccc395672356", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 06:15", "url": "https://www.clickondetroit.com/news/world/2024/08/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "in Tehran, Iran, Wednesday, July 31, 2024.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\n(AP Photo/Vahid Salemi)BEIRUT – Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "bd53d385-02a5-4a88-863b-9e973472fc77", "title": "Thousands attend mourning ceremony for Hamas leader Haniyeh in Tehran", "date": "2024-08-01 08:45", "url": "https://www.yahoo.com/news/thousands-attend-mourning-ceremony-hamas-073745561.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hamas chief Ismaeil Haniyeh meets Iran's new President Masoud Pezeshkian (Not Pictured) in Tehran.\nIn a statement, Hamas added that Haniyeh was killed after he had attended the inauguration ceremony of the new Iranian president, Masoud Pezeshkian in the Iranian capital.\n-/Iranian Presidency/dpaThousands of people were participating in the state-organized mourning ceremony in the Iranian capital Tehran for the killed leader of the Palestinian Islamist Hamas movement, Ismail Haniyeh.\nThe entire political elite of Iran, including Supreme Leader Ayatollah Ali Khamenei and new President Masoud Pezeshkian, were also present.\nThe Iranian government declared three days of national mourning after the targeted killing of the high-ranking Hamas leader in Tehran."}, {"id": "677c97cd-c50b-441f-9f93-9d0ea8b22d78", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 05:45", "url": "https://www.news4jax.com/news/world/2024/08/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "in Tehran, Iran, Wednesday, July 31, 2024.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\n(AP Photo/Vahid Salemi)BEIRUT – Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "4df1d567-9c43-41f5-9690-e52d010d08fb", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 10:00", "url": "https://www.thespec.com/news/world/middle-east/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/article_15091af8-778f-519c-8fb0-41b0b9bd065e.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "540cb471-e606-4c3d-aa0f-c3a1d0f19372", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike - Boston News , Weather , Sports", "date": "2024-08-01 09:30", "url": "https://whdh.com/news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nIsrael targeted Deif in a July 13 strike that hit a compound on the outskirts of the southern Gaza city of Khan Younis, but there had been no immediate confirmation Deif was killed.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nIn a statement Thursday, the Israeli military said that “following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike.”One of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nThis material may not be published, broadcast, rewritten, or redistributed.)"}, {"id": "14cfef5c-9009-4a1c-ba6e-fe6bfb93c89e", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 06:45", "url": "https://www.clickorlando.com/news/world/2024/08/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "in Tehran, Iran, Wednesday, July 31, 2024.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\n(AP Photo/Vahid Salemi)BEIRUT – Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "4e8bb5d4-c719-4371-9a60-3e4d8f636c25", "title": "Profile : Ismail Haniyeh , Hamas leader who pushed Zionist entity to brink of extinction", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-presstv19.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Profile: Ismail Haniyeh, Hamas leader who pushed Zionist entity to brink of extinctionIran Press TVWednesday, 31 July 2024 6:26 AMBy Press TV Website StaffIsmail Haniyeh, the head of the political bureau of the Palestinian resistance movement Hamas, was killed in a cowardly attack by the Israeli regime in Tehran in the wee hours of Wednesday morning.\nHamas, in its statement, vowed to avenge the cowardly assassination of its leader, who it stated \"passed as a result of a treacherous Zionist raid\" in the Iranian capital.\nHe is the second high-profile Hamas leader to be assassinated by the Israeli regime since Operation Al-Aqsa Storm on October 7, 2023, after Salah al-Arouri's assassination in southern Beirut on January 2.\nHaniyeh also served as the Hamas leader in the besieged Gaza Strip between 2006 and 2017, after which he was replaced by Yahya Sinwar, a high-ranking Hamas military commander.\nOn November 1, 2023, Haniyeh denounced the Israeli regime for committing \"barbaric massacres against unarmed civilians\" after a dastardly attack on the Jabalia refugee camp."}, {"id": "8eb5a272-4a8b-4ae0-b176-0f0e4241d91d", "title": "UN holds emergency meeting after Hamas leader killed in Iran", "date": "2024-08-01 00:30", "url": "https://www.9news.com.au/world/israel-iran-hamas-head-killed-in-airstrike-war-fears-un-security-council-meets/9ec1cf89-5717-45fb-bf59-0e1a0984015f", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Iranian workers install a huge banner on a wall showing a portrait of Hamas leader Ismail Haniyeh.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nHe did not mention the Haniyeh killing, and a US-provided summary of his call with Austin did not mention it.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said."}, {"id": "679c052d-763d-4fcd-92c8-2a44d57f86ee", "title": "Israeli military confirms death of Hamas military leader Mohammed Deif in July strike in Gaza", "date": "2024-08-01 13:30", "url": "https://thefrontierpost.com/israeli-military-confirms-death-of-hamas-military-leader-mohammed-deif-in-july-strike-in-gaza/", "domain": "thefrontierpost.com", "domain_classification": "Unknown", "message": "GAZA (AP): The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nAlong with Deif and Haniyeh, Israel has vowed to eliminate Hamas’ top leader in Gaza, Yehya Sinwar, but he has so far remained elusive.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades."}, {"id": "0f35012c-2b87-4d03-945b-83d548f4dff3", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 09:30", "url": "https://www.pentictonherald.ca/news/world_news/article_ff2dfee4-19a6-5d65-8688-1c16a2fd8882.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "5d7364b5-cb49-451d-a198-2a29460e4b5e", "title": "Al Jazeera journalists killed in reported Israeli airstrike in Gaza , network says", "date": "2024-08-01 18:00", "url": "https://www.abc57.com/news/al-jazeera-journalists-killed-in-reported-israeli-airstrike-in-gaza-network-says", "domain": "abc57.com", "domain_classification": "Unknown", "message": "Al Jazeera journalists killed in reported Israeli airstrike in Gaza, network saysObtained by CNN via CNN NewsourceBy Abeer Salman, Kareem Khadder, Hira Humayun, Sana Noor Haq and Tim Lister(CNN) — Two Al Jazeera correspondents were killed in a reported Israeli airstrike in Al-Shati refugee camp, northern Gaza, on Wednesday, according to the news network, sparking condemnation from advocacy groups and highlighting the dangers for local reporters covering the war.\nThe teenager had been riding his orange bicycle to deliver food for an elderly resident in the local neighborhood, before he was killed, according to Saudi-backed broadcaster Al-Arabiya.\nIsrael must stop killing journalists.”Khader Al-Za’anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul’s bloodied flak jacket.\n“Our colleague Ismail was wearing this blood-stained vest,” fellow Al Jazeera journalist Yousef Al Saudi said, as he removed the “PRESS” sign from the jacket."}, {"id": "10ab37f5-decb-4ff5-a075-4ebfc11851b3", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 10:15", "url": "https://www.mymotherlode.com/news/middle-east/3400855/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Israel says it has confirmed that chief of Hamas’ military wing was killed in a July strike in GazaIsrael says it has confirmed that chief of Hamas’ military wing was killed in a July strike in Gaza View PhotoJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nThere was no immediate comment on the Israeli claim by Hamas, which had previously said Deif survived the strike in Gaza.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "6017ca33-cfe5-4a72-adf9-cd72396deddc", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 09:30", "url": "https://lethbridgeherald.com/news/world-news/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strikeBy Melanie Lidman, The Associated Press on August 1, 2024.\nJERUSALEM (AP) – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades."}, {"id": "190c6359-0f5f-4596-b8e4-598783d72b9c", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 07:45", "url": "https://isp.netscape.com/news/world/story/0001/20240801/262194a2d70273207ed1d1a5cb9ab09b", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "For Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for errorBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“I think Hezbollah has been hit much harder, much more where it hurts” than Iran, he said.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "0cf7ccf7-4963-46fb-9722-a7554ba216e5", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 09:30", "url": "https://www.newwestrecord.ca/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297569", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "197eb05b-1d14-4f83-ba72-9a62017d2748", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-01 06:30", "url": "https://www.newsday.com/news/nation/israel-lebanon-iran-hamas-hezbollah-haniyeh-a62235", "domain": "newsday.com", "domain_classification": "Unknown", "message": "BEIRUT — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "e56ee77c-1246-4ddb-b458-2f0d9422e13e", "title": "One Mystery Solved About Hamas Leader Killing", "date": "2024-08-01 18:30", "url": "https://www.newser.com/story/353812/one-mystery-solved-about-hamas-leaders-killing.html", "domain": "newser.com", "domain_classification": "Unknown", "message": "When leading Hamas figure Ismail Haniyeh was assassinated in Iran this week, one question that lingered was how his killers managed to pull it off.\nNow, both the New York Times and CNN report they have the answer: Somebody smuggled a bomb weeks ago into the Tehran guesthouse where he'd be staying, and it was detonated remotely after he arrived.\nThe stories are based on accounts from officials of various nations, including the US, who were briefed on the operation after it took place."}, {"id": "6d3b1d26-3036-40ab-af98-2874025c6597", "title": "Hamas military wing head was killed in July strike , Israel says  - National", "date": "2024-08-01 12:45", "url": "https://globalnews.ca/news/10674778/hamas-mohammed-deif-killed-israel-strike/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement comes a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s.\n4:41 Iran, Hezbollah, Houthis vow to retaliate against Israel after Hamas leader killed in TehranHe remained a mysterious, underground figure in Gaza."}, {"id": "c20fc8d1-bbe6-43e2-81a8-077f8c793dec", "title": "Hezbollah confirms commander killed in Israeli strike", "date": "2024-08-01 09:15", "url": "https://www.canberratimes.com.au/story/8716010/hezbollah-confirms-commander-killed-in-israeli-strike/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The two sides have exchanged near-daily strikes for the past 10 months against the backdrop of the war in Gaza, but they have previously kept the conflict at a low level that was unlikely to escalate into full-on war."}, {"id": "6babf626-e8dd-49ad-8c97-51dc4ae06352", "title": "Body of top Hezbollah commander Shukr killed by Israel found in Beirut , sources say", "date": "2024-08-01 06:45", "url": "https://dunyanews.tv/en/World/827873-body-of-top-hezbollah-commander-shukr-killed-by-israel-found-in-beirut", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Body of top Hezbollah commander Shukr killed by Israel found in Beirut, sources sayWorld World Body of top Hezbollah commander Shukr killed by Israel found in Beirut, sources sayThe body of Hezbollah commander Fuad Shukr was recovered from the rubble of a building in Beirut.\nThe recovery came almost 24 hours after Israel confirmed that it had targeted Shukr in an airstrike on the Lebanese capital.\nReuters also quoted two unnamed security sources confirming that the body of the senior Hezbollah commander had been found in the rubble almost 24 hours after Israel said it had targeted Shukr in Tuesday’s strike.\nEarlier Wednesday, Hezbollah confirmed that Shukr was inside the targeted building, but said his fate was still unknown.\nThe Israeli army has described Shukr as Hezbollah's \"most senior military commander\" and \"right-hand man\" to the group's chief Hassan Nasrallah."}, {"id": "54ed5a21-dbc9-4594-af5c-424e882270cd", "title": "Israel on edge , preparing for possible combined Hezbollah - Iran strike", "date": "2024-08-01 08:15", "url": "https://www.ynetnews.com/article/b1hf5f00yc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The IDF is preparing for a range of responses from Hezbollah and the Iranian Revolutionary Guards following the killings ofHamas political bureau chief Ismail Haniyehandtop Hezbollah commander Fuad Shukr"}, {"id": "74af657b-406a-4a13-9fda-b7620b9ca2e3", "title": "Mohammed Deif , Hamas military leader who eluded Israel for decades , is claimed to be dead", "date": "2024-08-01 11:00", "url": "https://www.yahoo.com/news/mohammed-deif-hamas-military-leader-103616068.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel's claim.\nOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation."}, {"id": "deaea0e0-925c-47ae-962b-5a0335c06c0b", "title": "Mohammed Deif , Hamas military leader who eluded Israel for decades , is claimed to be dead", "date": "2024-08-01 15:00", "url": "https://www.clickondetroit.com/news/world/2024/08/01/mohammed-deif-hamas-military-leader-who-eluded-israel-for-decades-is-claimed-to-be-dead/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Israel said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel's claim.\nRecommended VideosOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation."}, {"id": "6177f1fe-8dfd-4cde-9ac3-e802d8cd0309", "title": "US strikes Iraqi group about to launch drones on Israel", "date": "2024-08-01 00:15", "url": "https://www.thetimes.com/world/israel-hamas-war/article/us-strikes-iraqi-group-drones-israel-ng9q959df", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "American forces launched an airstrike on Tuesday targeting an Iraqi militia that was about to launch attack drones on Israel.\nThe attack on the base of the Iraqi Shia movement Hashd ash-Shabi (Popular Mobilisation Units) was the first US strike in Iraq for six months and followed a series of attacks on American units in the region.\nAccording to Middle Eastern intelligence sources, it was carried out based on intelligence that the movement was about to launch drones from the base towards American bases and Israel.\nAt least five militants were reportedly killed in the attack, including a member of the Yemeni Houthi organisation that has been launching rockets and drones at Israel since the war in Gaza began.\nAn Iranian officer and drone specialist"}, {"id": "93b95aab-3a7b-42bc-bb8a-8490a36a88b8", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 15:30", "url": "https://wjla.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "wjla.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "303ae0c7-0248-4f27-a98f-0241eee9de25", "title": "High stakes for Iran and Hezbollah as they weigh next move", "date": "2024-08-01 12:45", "url": "https://www.bostonglobe.com/2024/08/01/world/iran-hezbollah-calibrating-response-israeli-strikes-leaves-no-room-error/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Analysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\nIn order to reestablish deterrence after Tuesday’s strike, Ali said, “Hezbollah would need to respond beyond its now-limited geographical scope of operations.\n“I think Hezbollah has been hit much harder, much more where it hurts” than Iran, he said."}, {"id": "5e8db000-0d62-4c7b-8ac2-ede0ecfb2522", "title": "Israel strikes back : Hamas leader assassinated in Iran", "date": "2024-08-01 00:45", "url": "https://www.worldtribune.com/israel-strikes-back-hamas-leader-assassinated-in-iran/", "domain": "worldtribune.com", "domain_classification": "Unknown", "message": "Military analysts say Hizbullah’s firing of an Iranian-made rocket from Lebanon gives Israel three legitimate targets for retaliation: Hizbullah, Lebanon and Iran.\nIsrael apparently took aim at two of those targets in the last days of July, Geostrategy-Direct.com reported on Tuesday.\nGen. Amir Ali Hajizadeh, the Commander of the Islamic Revolutionary Guard Corps (IRGC) Aerospace Forces, was assassinated near the Syrian capital Damascus.\nHajizadeh, a key figure in the Iranian military hierarchy, was reportedly the senior commander behind the Iranian ballistic and cruise missile attacks against Israel in April.\nIran’s supreme leader Ayatollah Ali Khamenei has vowed “harsh punishment” against Israel, and has declared three days of national mourning."}, {"id": "1aa6a6b7-5994-4da4-ad97-a7e782d1d186", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 13:15", "url": "https://katv.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "katv.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "ae9d8692-06fd-4d3d-8464-6282c1c4f97a", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 11:15", "url": "https://turnto10.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "1d7566e8-6700-48f9-b304-9cc82d3c36f1", "title": "IDF confirms death of Hamas military chief Mohammed Deif in July airstrike", "date": "2024-08-01 12:45", "url": "https://www.ynetnews.com/article/bjsm9potr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Aerial footage of strike on Hamas military chief Mohammed Deif ( Video: IDF Spokesperson’s Unit )The IDF confirmed on Thursday that Hamas military chief Mohammed Deif was killed in an Israeli airstrike last month.\n\"The IDF announces that on July 13, 2024, IDF fighter jets struck in the area of Khan Yunis, and following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike,\" the military said in a statement.\n4 View gallery Mohammed Deif; air force strike on Khan Younis compound in July ( Photo: IDF )\"Following precise IDF and ISA intelligence, IAF fighter jets conducted a precise, targeted strike on a compound in which Mohammed Deif and Rafa'a Salameh, the Commander of Hamas' Khan Yunis Brigade, were located.\nThe military waited for intelligence confirming the death of the second-in-command of Hamas.\nDuring his detention, he worked to establish the al-Qassam Brigades, now Hamas' military wing, aiming to kidnap Israeli soldiers."}, {"id": "b9c0cd6c-da4b-4f64-8cd2-cb7de2c7d0c8", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 11:15", "url": "https://newschannel20.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "newschannel20.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "9a06d752-0359-4cb5-87d6-93bde33e8461", "title": "One - eyed Hamas commander and architect of October 7 atrocities has been  eliminated , Israel confirms in latest blow to terror group after leader was blown up in Iran", "date": "2024-08-01 09:15", "url": "https://www.dailymail.co.uk/news/article-13697249/One-eyed-Hamas-commander-architect-October-7-atrocities-eliminated-Israel-confirms-latest-blow-terror-group-leader-blown-Iran.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Hamas commander Mohammed Deif has been assassinated in an airstrike, the Israeli military revealed today, a day after group leader Ismail Haniyeh was killed in Iran.\nThe one-eyed Hamas commander was allegedly killed on July 13, confirmed Thursday after Hamas' political chief was killed by an 'airborne projectile' in Tehran.\nIsrael believes that Deif, the head of Hamas's military, and Yahya Sinwar, the top Hamas leader in Gaza, were the chief architects of the October 7 attack.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\n'During the war, he commanded Hamas's terrorist activity in the Gaza Strip by issuing commands and instructions to senior members of Hamas's military wing,' it added."}, {"id": "4d684840-f60e-4237-a395-539d8f8b9ead", "title": "Hamas leader funeral draws crowds in Iran", "date": "2024-08-01 08:30", "url": "https://saudigazette.com.sa/article/644590/World/Mena/Hamas-leaders-funeral-draws-crowds-in-Iran", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "TEHRAN — Thousands have turned out for the funeral procession in Iran of the Hamas political chief, Ismail Haniyeh, who was killed in a strike in Tehran on Wednesday.\nIran's Supreme Leader, Ayatollah Ali Khamenei, is leading the prayers before the Hamas leader is buried in Qatar.\nA senior Hamas official told the BBC the killing took place in the same building where Haniyeh had stayed during previous visits to Iran.\nKhalil Al-Hayya, a senior Hamas official, told a news conference that a missile hit Haniyeh \"directly\", citing witnesses who were with him.\nHours before Haniyeh was targeted, Israel said it had killed senior Hezbollah leader Fuad Shukr in Beirut."}, {"id": "13ab509b-f9cd-487d-987a-fea8b6006e11", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 12:45", "url": "https://fox17.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "85b57e23-e232-49a8-b482-6d41a2bf7a14", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 15:00", "url": "https://kval.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "kval.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "3cc1e296-dd64-48d0-a583-b537a0771e16", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 11:15", "url": "https://www.coastreporter.net/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297569", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "fa84f2e5-cf15-4a9e-8be1-ab9782a7084a", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 11:45", "url": "https://www.tricitynews.com/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297569", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "28afdc78-19f7-4bd9-b275-0e0401559b6d", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 11:30", "url": "https://www.airdriecityview.com/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297567", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nThere was no immediate comment on the Israeli claim by Hamas, which had previously said Deif survived the strike in Gaza.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "5c9c413c-c70f-42b4-94c6-2d4afab24dc6", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297569", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s."}, {"id": "dc0ae613-32a6-4c42-9358-f0669c7db09a", "title": "US claims it made  defensive  attack in Iraq", "date": "2024-08-01 14:15", "url": "https://menafn.com/1108506047/US-claims-it-made-defensive-attack-in-Iraq", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) On Tuesday, the United States military executed an on fighters within Iraq, characterized as a defensive measure to thwart an imminent threat posed by drones targeting United States and allied troops.\nThe United States Department of Defense clarified the rationale behind the airstrike, stating it was a response to recent activities indicating an impending drone attack deemed hazardous to United States and Coalition Forces.\nEmphasizing the right to self-defense, United States authorities underscored their commitment to taking necessary actions to safeguard their personnel and interests in the region.\nTensions have surged in Iraq following resumed rocket assaults by the Islamic Resistance in Iraq, an umbrella group comprising Iran-backed militias, targeting United States military installations in Iraq and eastern Syria.\nThe airstrike in Iraq coincides with heightened regional instability exacerbated by recent Israeli military actions."}, {"id": "c78986e1-2cd0-4700-8d13-cbc517984bd2", "title": "Israel Is Sending Iran a Message", "date": "2024-08-01 01:00", "url": "https://news.yahoo.com/news/israel-sending-iran-message-194028173.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "The killing of Hamas’ leader, Ismail Haniyeh, is another matter.\n(Haniyeh lives mainly in Doha, the capital of Qatar, which would be diplomatically awkward for Israel to attack, but he has visited Iran in the past, to no peril.)\nIsrael sent a similar message in April after Iran fired 300 missiles and drones against Israel (almost all of which either crashed along the way or were shot down).\nArguably killing Hamas’ top military commander without doing much other damage is an act of restraint with a shock effect.\nAnd whichever way the winds of war blow, how will Israel respond—and what will the United States do, and encourage or discourage Israel from doing, next?"}, {"id": "ff08cebb-062e-4432-8898-d2763234a1f0", "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike", "date": "2024-08-01 11:00", "url": "https://medicinehatnews.com/news/world-news/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strikeBy Melanie Lidman, The Associated Press on August 1, 2024.\nHamas immediately rejected the claim that Mohammed Deif was in the area.\n(AP Photo/Jehad Alshrafi)Share this story:JERUSALEM (AP) – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades."}, {"id": "d1ec4896-5df9-42c6-a725-55adffd5f3a2", "title": "Hamas leader assassination sheds light on a long history of alleged Israeli attacks in Iran", "date": "2024-08-01 17:30", "url": "https://www.yahoo.com/news/hamas-leaders-assassination-sheds-light-171243020.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "And the latest accusation, that Israel is behind the assassination of Hamas leader Ismail Haniyeh in Tehran, only expands that list.\nMost have been aimed at the country’s nuclear program.\nIran says the nuclear program is for peaceful purposes.\nIn the past four years, Iran said Israel attacked multiple nuclear sites deep in central Iran.\n‘An exquisite intelligence capability’Haniyeh's brazen assassination in Tehran this week, just hours after Iran’s President Masoud Pezeshkian’s swearing-in ceremony, had little to do with Iran's nuclear program."}, {"id": "542b410f-709a-41e3-9af5-fd94100c3a76", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 13:15", "url": "https://cnycentral.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "cnycentral.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "2f93137c-cda8-4627-b5d7-693fb21122e1", "title": "  Like Osama Bin Laden , people like that cannot live : Israeli envoy prediction turns true on Hama military leader Deif", "date": "2024-08-01 17:15", "url": "https://news.webindia123.com/news/Articles/World/20240801/4221008.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Israel's Ambassador to India, Naor Gilon prophecy about one of the masterminds of Hamas' October 7 attack - head of Hamas' military wing, Mohammed Deif came true on Thursday.\nThe Israeli army released a video on August 1 of an airstrike in Gaza that killed the head of Hamas' military wing, Mohammed Deif, last month in the southern Gaza Strip on July 13.\nThe Israeli army released a video on August 1 of an airstrike in Gaza that killed the head of Hamas' military wing, Mohammed Deif, last month.\nThe Israel Defence Forces (IDF) on Thursday announced that Hamas military wing commander Mohammed Deif had been killed in an airstrike in the southern Gaza Strip on July 13.\nIn a post on X, IDF stated, \"We can now confirm: Mohammed Deif was eliminated.\""}, {"id": "ca57da12-b1dd-47b6-adc9-0cd54fdae9a8", "title": "Iran holds funeral for slain Hamas leader as fears of widening war spread", "date": "2024-08-01 08:45", "url": "https://www.yahoo.com/news/iran-holds-funeral-slain-hamas-072242099.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iran's spiritual leader Ayatollah Ali Khamenei leads funeral prayers for Hamas political chief Ismail Haniyeh at the University of Tehran, Tehran, Iran, on Thursday.\nPhoto courtesy of the Office of Iran's spiritual leader Ayatollah Ali Khamenei/ReleaseAug. 1 (UPI) -- Iran's spiritual leader Ayatollah Ali Khamenei led the funeral prayers for slain Hamas political chief Ismail Haniyeh on Thursday amid soaring fears of war escalating in the Middle East.\nThe assassination of Haniyeh came a day after Israel killed Hezbollah commander Fuad Shukr in an airstrike in Beirut, the capital of Lebanon.\nOn Wednesday, Prime Minister Benjamin Netanyahu said in a speech that they are fighting a war \"against Iran's axis of evil.\"\nAccording to the Palestinian Ministry of Health, nearly 39,500 Palestinians have been killed and another 91,000 wounded in the war."}, {"id": "8974eebd-2a8e-4af0-a845-98a810ef0906", "title": "HUR Provides Answers Over Olenya Drone Attack", "date": "2024-08-01 06:15", "url": "https://www.kyivpost.com/post/36690", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "He put the delay to Ukraine’s declaration down to the HUR wanting to verify all details relating to the event but did not confirm (or deny) any HUR involvement.\nThis is when it was originally thought the attack had occurred and they said that there was no evidence of an explosive attack.\nHe also claimed that no air alarm sounded at the airfield during the attack which prevented any defensive action being taken.\nIn particular, the 9th department of the HUR: accuracy at a distance of almost 1,800 kilometers from our border.\nThe president added: “…each destroyed Russian airbase, each destroyed Russian military aircraft – whether on the ground or in the air – means saving Ukrainian lives."}, {"id": "d009fd27-1664-455e-8104-72bd080524ca", "title": "Report : Iran Khamenei Orders Direct Strike on Israel", "date": "2024-08-01 01:15", "url": "https://www.breitbart.com/middle-east/2024/07/31/report-irans-khamenei-orders-direct-strike-on-israel/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Iran’s so-called “Supreme Leader” has called for a direct attack on Israel in response to an Israeli airstrike on Tehran, Iran’s capital city, that killed Hamas political leader Ismail Haniyeh on Wednesday.\nThe New York Times reported:Iran’s supreme leader, Ayatollah Ali Khamenei, has issued an order for Iran to strike Israel directly, in retaliation for the killing in Tehran of Hamas’s leader, Ismail Haniyeh, according to three Iranian officials briefed on the order.\nMr. Khamenei gave the order at an emergency meeting of Iran’s Supreme National Security Council on Wednesday morning, shortly after Iran announced that Mr. Haniyeh had been killed, said the three Iranian officials, including two members of the Revolutionary Guards.\nMany countries have urged their citizens to leave Lebanon, and some U.S. carriers have canceled flights to Israel, in anticipation of a possible war between Israel and Hezbollah, Iran’s terrorist proxy in Lebanon.\nIsrael killed Hezbollah’s second-in-command in an airstrike on Beirut on Tuesday."}, {"id": "fce80c28-82b1-47b3-8469-dbb137146933", "title": "Stunned by Hamas Leader Killing In Tehran , Iran And Allies Weigh Response", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-rferl03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Stunned by Hamas Leader's Killing In Tehran, Iran And Allies Weigh ResponseBy Kian Sharifi and Hannah Kaviani July 31, 2024The assassination of Ismail Haniyeh, the political leader of the EU- and U.S.-designated Palestinian terrorist group Hamas, in Tehran has sent shock waves across the region, once against raising the specter of all-out war between Iran and its archfoe, Israel.\nHaniyeh was killed early on July 31 in an affluent neighborhood of Tehran, soon after attending the inauguration of President Masud Pezeshkian in parliament.\nAnalysts say Haniyeh's assassination is a major hit to the already tarnished reputation of Iran's security apparatus and will prompt Tehran to retaliate, though that response is unlikely to come directly from the Islamic republic.\nHe added that Haniyeh's killing \"severely embarrasses the Islamic republic and sends it a strong message that none of its officials and allies are safe.\"\n\"Iran needs to manage tensions,\" he told Radio Farda."}, {"id": "41de759e-1124-4a90-b605-d68c59012cf3", "title": "Israel claims killing of Hamas military leader Mohammed Deif in Gaza airstrike", "date": "2024-08-01 13:30", "url": "https://bakersfieldnow.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation."}, {"id": "562ced2b-914c-4e82-8cf5-eb50103b1123", "title": "Iran supreme leader prays over the coffin of Hamas leader Haniyeh , whose killing risks a wider war", "date": "2024-08-01 06:30", "url": "https://abcnews.go.com/International/wireStory/irans-supreme-leader-prays-coffin-hamas-leader-haniyeh-112465960", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Hezbollah leader says war with Israel has entered 'new phase' after killings of top militant figuresBEIRUT -- Hezbollah’s leader warned Thursday that the conflict with Israel has entered a “new phase,” as he addressed mourners at the funeral of a commander from the group who was killed by an Israeli airstrike this week in Beirut.\nMeanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments."}, {"id": "3dd8f903-d548-4f00-9f8b-9a700e88624c", "title": "Ismail Haniyeh Assassination : Did WhatsApp Aid The Killing Of Hamas Leader ? Theories Emerge As Tensions Rise In Middle East", "date": "2024-08-01 08:45", "url": "https://www.freepressjournal.in/business/ismail-haniyeh-assassination-did-whatsapp-aid-the-killing-of-hamas-leader-theories-emerge-as-tensions-rise-in-middle-east", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "Haniyeh was located in Tehran, the city of his primary backers, the Iranian state and the ruling Ayatollahs.\nHaniyeh was located in Tehran, the city of his primary backers, the Iranian state and the ruling Ayatollahs.\nJewish billionaire Yan Borysovych Koum has been linked to the assassination of Hamas leader Ismail Haniyeh.\nUsing his company WhatsApp, Israeli intelligence installed spyware on Hamas leader Ismail Haniyeh phone via a WhatsApp message.\nThe user said, \"Using his company WhatsApp, Israeli intelligence installed spyware on Hamas leader Ismail Haniyeh phone via a WhatsApp message.\""}, {"id": "93c0dae3-52a2-4644-8717-057719413f1d", "title": "Press release on the killing of Hamas political bureau chief Ismail Haniyeh", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-russia-mfa02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press release on the killing of Hamas political bureau chief Ismail Haniyeh31 July 2024 11:251453-31-07-2024Moscow strongly condemns the killing of Ismail Haniyeh, who headed the political bureau within Hamas, a Palestinian movement.\nIt is worth noting that this attack took place while the Hamas leader was visiting Iran.\nHe travelled there at an official invitation to take part in the inauguration ceremony of President-elect of the Islamic Republic of Iran, Masoud Pezeshkian.\nIt is obvious that those who organised this political assassination understood that these actions were fraught with dangerous consequences for the entire region.\nThere is no doubt that Ismail Haniyeh's killing will have an extremely negative impact on the indirect contacts between Hamas and Israel, which offered a framework for achieving a ceasefire in the Gaza Strip on mutually acceptable terms."}, {"id": "a125dbf5-622f-4b8b-9d4c-2f12bfcdf715", "title": "Hamas leader funeral draws crowds in Iran", "date": "2024-08-01 08:30", "url": "https://www.the-star.co.ke/news/world/2024-08-01-hamas-leaders-funeral-draws-crowds-in-iran/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "Thousands have turned out for the funeral procession in Iran of the Hamas political chief, Ismail Haniyeh, who was killed in a strike in Tehran on Wednesday.\nIran's Supreme Leader, Ayatollah Ali Khamenei, is leading the prayers before the Hamas leader is buried in Qatar.\nA senior Hamas official told the BBC the killing took place in the same building where Haniyeh had stayed during previous visits to Iran.\nKhalil Al-Hayya, a senior Hamas official, told a news conference that a missile hit Haniyeh \"directly\", citing witnesses who were with him.\nHours before Haniyeh was targeted, Israel said it had killed senior Hezbollah leader Fuad Shukr in Beirut."}, {"id": "65a6ea3b-5aa0-4efa-a0af-0a5184ce46e9", "title": "Killing of Hamas chief in Iran stirs fears of retaliation , regional conflict", "date": "2024-08-01 08:45", "url": "https://www.timeslive.co.za/news/world/2024-08-01-killing-of-hamas-chief-in-iran-stirs-fears-of-retaliation-regional-conflict/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "9b4fab0f-8943-4f85-a7c2-19750dcba00d", "title": "Two strikes on militant leaders risk inflaming a Middle East on edge", "date": "2024-08-01 06:15", "url": "https://www.britannica.com/news/1259976/5d3ec9b048ef77b6b8196c6c08755dbd", "domain": "britannica.com", "domain_classification": "Unknown", "message": "Intense diplomatic efforts are also underway to ease tensions between Israel and Hezbollah after months of cross-border fighting.\nHezbollah has said that it will halt its fire on Israel if a Gaza cease-fire is reached.\n“The events in Tehran and Beirut push the entire Middle East to a devastating regional war,” said one Western diplomat.\nIsrael hasn’t taken responsibility for the strike, though it vowed to kill all of Hamas' leaders over the Oct. 7 attacks.\nHe noted that Israel has a long history of assassinating leaders of Palestinian groups, but those strikes have little impact as the leaders are quickly replaced."}, {"id": "70ad00e9-29ee-4d91-a266-b6a30203171a", "title": "Death of Hamas military leader confirmed , Israel says", "date": "2024-08-01 11:15", "url": "https://www.canberratimes.com.au/story/8716035/death-of-hamas-military-leader-confirmed-israel-says/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "At the same time, international diplomats were trying to avert an escalation into all-out regional war after the assassination in Tehran of Hamas' Ismail Haniyeh, Israel's killing of a top Hezbollah commander in a Beirut strike and now Israel's announcement of Deif's death."}, {"id": "2f0d8655-1f71-4114-9f45-9cd2422eaa03", "title": "Global Outrage Over Killing Of Hamas Leader : Palestine , Turkey , Russia , Iran , and China Condemn Assassination - Novinite . com", "date": "2024-08-01 00:30", "url": "https://www.novinite.com/view_news.php?id=227484", "domain": "novinite.com", "domain_classification": "Unknown", "message": "Palestinian President Mahmoud Abbas has strongly condemned the assassination of Hamas leader Ismail Haniyeh in Tehran, according to Reuters.\nThe Iranian Islamic Revolutionary Guard Corps confirmed Haniyeh’s death, noting that his bodyguard was also killed.\nTurkey has also condemned Haniyeh’s assassination, accusing Israeli Prime Minister Benjamin Netanyahu of showing no intent for peace.\nThe Turkish Foreign Ministry warned that this attack could escalate conflict in Gaza and urged international action to prevent further violence.\nChinese Foreign Ministry spokesman Lin Jian condemned the killing and warned that it could lead to greater regional instability."}, {"id": "5781e09a-8e5f-42ba-8c9c-a3f4e68dea99", "title": "Hamas Political Leader Assassinated in Capital of Iran While Visiting Swearing in Ceremony For New Iranian President", "date": "2024-08-01 01:15", "url": "https://thesource.com/2024/07/31/hamas-political-leader-assassinated-in-capital-of-iran-while-visiting-ceremony-of-new-iranian-president/", "domain": "thesource.com", "domain_classification": "Unknown", "message": "Hamas Political Leader Assassinated in Capital of Iran While Visiting Swearing in Ceremony For New Iranian PresidentHamas Political Leader Assassinated in Capital of Iran While Visiting Swearing in Ceremony For New Iranian PresidentIn international news, Hamas political leader Ismail Haniyeh was assassinated in Tehran early Wednesday morning.\nAdvertisementOf course, Hamas accused Israel of orchestrating the “treacherous Zionist raid,” while Iran’s Revolutionary Guards confirmed Haniyeh’s death and announced an investigation.\nHe was visiting the swearing in of Iran’s new president and he gets assassinated.\nNaturally, Hamas warned that Haniyeh’s death would escalate the conflict, with Iran declaring three days of national mourning and blaming the US for supporting Israel.\nIran’s Supreme Leader, Ali Khamenei, vowed harsh retaliation, framing the event as an attack on Iran itself."}, {"id": "7bbb5c61-c77b-4173-b87f-f6d16b58900f", "title": "Hamas leader funeral draws crowds in Iran", "date": "2024-08-01 09:30", "url": "https://www.qatar-tribune.com/article/134237/latest-news/hamas-leaders-funeral-draws-crowds-in-iran", "domain": "qatar-tribune.com", "domain_classification": "Unknown", "message": "TEHRAN: Thousands have turned out for the funeral procession in Iran of the Hamas political chief, Ismail Haniyeh, who was killed in a strike in Tehran on Wednesday.\nIran's Supreme Leader, Ayatollah Ali Khamenei, is leading the prayers before the Hamas leader is buried in Qatar.\nSince the attack, Israel has vowed to destroy Hamas.\nA senior Hamas official told the BBC the killing took place in the same building where Haniyeh had stayed during previous visits to Iran.\nKhalil Al-Hayya, a senior Hamas official, told a news conference that a missile hit Haniyeh \"directly\", citing witnesses who were with him."}, {"id": "1f1eb04d-1bdf-4873-aeee-ccba04837b71", "title": "Hamas leader assassination sheds light on a long history of alleged Israeli attacks in Iran – Winnipeg Free Press", "date": "2024-08-01 17:45", "url": "https://www.winnipegfreepress.com/breakingnews/2024/08/01/hamas-leaders-assassination-sheds-light-on-a-long-history-of-alleged-israeli-attacks-in-iran", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "And the latest accusation, that Israel is behind the assassination of Hamas leader Ismail Haniyeh in Tehran, only expands that list.\nMost have been aimed at the country’s nuclear program.\nIran says the nuclear program is for peaceful purposes.\nIn the past four years, Iran said Israel attacked multiple nuclear sites deep in central Iran.\n‘An exquisite intelligence capability’Haniyeh’s brazen assassination in Tehran this week, just hours after Iran’s President Masoud Pezeshkian’s swearing-in ceremony, had little to do with Iran’s nuclear program."}, {"id": "fc754e65-cd0b-4cf9-8412-9dfbe66e4d95", "title": "Exclusive -- Trump Campaign : Kamala Harris Will Not  Hunt Down Bloodthirsty Terrorists  ", "date": "2024-08-01 18:30", "url": "https://www.breitbart.com/politics/2024/08/01/exclusive-trump-campaign-kamala-harris-will-not-hunt-down-bloodthirsty-terrorists/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Former President Donald Trump’s campaign told Breitbart News exclusively on Thursday that Trump, unlike Vice President Kamala Harris, will “hunt down bloodthirsty terrorists” like those Israel targeted earlier this week.\nThe statement came in the aftermath of successful Israeli airstrikes on Iran-backed terrorists: Fuad Shukr, a.k.a.\nKamala Harris has yet to acknowledge Israel for taking out one of Hamas’ top leaders after their heinous strike that killed 12 innocent Israeli children.\nOnly President Trump will restore peace through strength, end the war in Ukraine, make Iran broke again, and hunt down blood-thirsty terrorists who seek to prey on innocent Israelis and Americans.\nI wouldn’t run, I wouldn’t run – I wouldn’t have to run."}, {"id": "b9d54d5e-8dc2-4eed-b841-a5e5de314358", "title": "Two days , two Hamas leaders assassinated : are ceasefire hopes in tatters ? ", "date": "2024-08-01 17:30", "url": "https://www.naval-technology.com/features/two-days-two-hamas-leaders-assassinated-are-ceasefire-hopes-in-tatters/", "domain": "naval-technology.com", "domain_classification": "Unknown", "message": "Iranians hold portraits of late Hamas political leader Ismail Haniyeh during his funeral procession in Tehran, today (1 August).\nQatar and other countries accused Israel of killing Hamas’ negotiator to deliberately sabotage ceasefire talks.\nIsrael’s latest killing spree has eliminated several Hamas and Hezbollah leaders responsible for conflagrating the Gaza conflict – and shattered any last hope of a ceasefire in the process.\nWar with Iran, Hezbollah and Hamas has become a political lifeline for Netanyahu, whose popularity is at an all-time low.\nAll eyes now turn to Iran’s imminent retaliation, and whether Tehran enlists Hezbollah, Hamas or the Houthi militia in Yemen to fire on Israel from multiple fronts."}, {"id": "dc2fa57a-b671-4e2c-80e9-a2b3469fd8c4", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 00:15", "url": "https://www.ajc.com/news/nation-world/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/SA63TNJESVHX7PYDAHG4KZQHVM/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "77f15e40-8f36-49fc-af75-251e642d4540", "title": "Almost quietly , attacks on US forces in West Asia have resumed", "date": "2024-08-01 11:00", "url": "https://www.firstpost.com/world/almost-quietly-attacks-on-us-forces-in-west-asia-have-resumed-13799674.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Late Tuesday, US forces carried out an airstrike south of Baghdad, aimed at thwarting an attempted militant assault on a US base in Babil Province.\nA US Central Command spokesperson was quoted as saying that based on recent attacks in Iraq and Syria, it was assessed that the OWAUAS posed a threat to US and Coalition Forces.\nThis retaliatory action led to a temporary cessation of hostilities, but the recent uptick in attacks suggests a return to unrest.\nAs long as US forces remain in the region, these attacks are expected to continue.\nThe resumption of these attacks serves as a stark reminder of the enduring instability and the persistent threats faced by US and Coalition forces in the region."}, {"id": "53a02442-bf3c-4102-a214-53ed98c77e91", "title": "Ukraine receives first F - 16 jets , officials say", "date": "2024-08-01 08:15", "url": "https://www.ariananews.af/ukraine-receives-first-f-16-jets-officials-say/", "domain": "ariananews.af", "domain_classification": "Unknown", "message": "Israel’s military said it had targeted militants operating there and that it had taken steps to reduce the risk to civilians.\nNow her daughter had been wounded in the strike and taken to hospital, she said.\nThe people sheltering in Khadija school are all wounded people, they are innocent and this should not happen to them,” she said.\nAbout 1,200 people were killed and 250 were taken hostage in the Oct. 7 attack, according to Israeli tallies.\nA local milita30 dead in Gaza school airstrikent group claimed the attack and said the person who was killed in the Israeli drone strike was a member, read the report."}, {"id": "3c35a074-82d1-4297-acbb-44a67d8e66a5", "title": "Hama top political leader is killed in Iran in strike that risks triggering all - out regional war", "date": "2024-08-01 04:15", "url": "https://www.620ckrm.com/2024/07/31/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/", "domain": "620ckrm.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Hamas’ top political leader was killed Wednesday by a predawn airstrike in the Iranian capital, Iran and the militant group said, blaming Israel for a shock assassination that risked escalating into an all-out regional war.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nIsrael carried out a rare strike Tuesday evening in the Lebanese capital that it said killed a top Hezbollah commander allegedly behind the rocket strike.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said."}, {"id": "77685ece-a002-441d-ad1e-ee5c86a1877f", "title": "MK Haskel to Arutz Sheva :  Israel shouldnt have waited for disaster to defend the north  ", "date": "2024-08-01 02:30", "url": "http://www.israelnationalnews.com/news/393908", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "She added, \"The scope and devastation of what these two people have done in this world, I don't think many people really understand how much the world really is a better place now.\nInnocent children, 12 innocent children, who just wanted to play soccer in the spirit and atmosphere of what is happening with the Olympics.\n\"We shouldn't have waited for a disaster like that.\nWe shouldn't have waited for a disaster to defend the north.\nWe shouldn't have waited for a disaster to defend our citizens, our people."}, {"id": "6325afa7-8dc6-4ea8-87e0-16dd0d0ce3f2", "title": "United , Delta suspend flights to Israel as Middle East tensions rise", "date": "2024-08-01 01:00", "url": "https://www.foxbusiness.com/politics/united-delta-suspend-flights-israel-middle-east-tensions-rise", "domain": "foxbusiness.com", "domain_classification": "Unknown", "message": "United Airlines and Delta Air Lines both suspended flights to Israel on Wednesday, halting planned flights to Tel Aviv amid rising tensions in the Middle East.\n\"Beginning with this evening’s flight from Newark Liberty to Tel Aviv, we are suspending for security reasons our daily Tel Aviv service as we evaluate our next steps,\" United told FOX Business in a statement.\n\"We continue to closely monitor the situation and will make decisions on resuming service with a focus on the safety of our customers and crews.\"\nShukr was the Hezbollah commander who was behind a drone strike that killed 12 children and teens on a soccer field in Israel over the weekend.\nGET FOX BUSINESS ON THE GO BY CLICKING HEREWhile Israel did not immediately comment, it usually does not make public statements on assassinations carried out by its Mossad intelligence agency."}, {"id": "6fb18e99-21ad-4241-96a6-114bba3dd9b3", "title": "What countries has Israel attacked since October 7 ? ", "date": "2024-08-01 13:30", "url": "https://www.aljazeera.com/news/2024/8/1/what-countries-has-israel-attacked-since-october-7", "domain": "aljazeera.com", "domain_classification": "International", "message": "Since October 7, Israel has been responsible for more than 17,000 attacks in the Middle East.\nSince October 7, Israel has been responsible for more than 17,000 attacks in the Middle East.\nWhere has Israel attacked in the Middle East?\nIsrael conducted 6,544 number of attacks on Lebanon (38 percent), followed by Syria with 144 incidents recorded.\nThe Israeli air strikes were the first known direct attack by Israel against the Houthis since the start of the war on Gaza."}, {"id": "7149faae-ebd6-41a7-9cea-b8998c4b7f93", "title": "How was Hamas leader killed ? The attack on Ismail Haniyeh mapped", "date": "2024-08-01 00:15", "url": "https://www.thetimes.com/world/israel-hamas-war/article/how-hamas-leader-killed-attack-unfolded-fcpdfsjmp", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "It was a night that may have pushed the Gaza conflict to all-out Middle East war.\nIsmail Haniyeh, the Hamas leader, was killed in a strike in Iran, six hours after a series of Israeli missiles hit an apartment block in Beirut, burying Fuad Shukr, a senior Hezbollah commander, and several civilians in rubble.\nShukr and Haniyeh are respectively the most senior Hezbollah and Hamas figures killed since the October 7 massacre.\nNetanyahu says Israel will exact heavy price for revenge attacksNegotiations between Israel and Hamas to broker a ceasefire in Gaza have been left in disarray.\nOn Saturday, 12 children were killed in Majdal Shams in the Israeli-occupied Golan Heights when a rocket hit a football"}, {"id": "e6c5d32f-fccc-4b6c-9b16-bee217e22996", "title": "A deadly Houthi attack on Tel Aviv is forcing Israel to rethink its drone defenses", "date": "2024-08-01 00:00", "url": "https://www.yahoo.com/news/deadly-houthi-attack-tel-aviv-230102197.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sensors picked up the unidentified aircraft but air defense crews failed to try to identify it.\nThe Houthis' unprecedented July 19 drone attack against Tel Aviv from Yemen caught Israelis by surprise, piercing the country's battle-tested defenses and exposing vulnerabilities that the Yemen-based rebels were ready and willing to exploit.\n\"This confirms that technology alone, even for one of the most advanced air defense systems in the world, is not enough to provide effective protection,\" Borsari said.\n\"Firstly, the advanced Houthi drone was launched for the first time, following an atypical flight path that likely caught the Israelis off guard,\" Khoueiry told BI.\n\"This means integrating low-tier air defense capabilities at scale, combining different types of effectors with an eye on cost-effectiveness,\" Borsari said."}, {"id": "c4851a09-4e9b-4492-8ad7-e2007bfe31eb", "title": "A deadly Houthi attack on Tel Aviv is forcing Israel to rethink its drone defenses", "date": "2024-08-01 00:00", "url": "https://www.yahoo.com/news/deadly-houthi-attack-tel-aviv-230102463.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sensors picked up the unidentified aircraft but air defense crews failed to try to identify it.\nThe Houthis' unprecedented July 19 drone attack against Tel Aviv from Yemen caught Israelis by surprise, piercing the country's battle-tested defenses and exposing vulnerabilities that the Yemen-based rebels were ready and willing to exploit.\n\"This confirms that technology alone, even for one of the most advanced air defense systems in the world, is not enough to provide effective protection,\" Borsari said.\n\"Firstly, the advanced Houthi drone was launched for the first time, following an atypical flight path that likely caught the Israelis off guard,\" Khoueiry told BI.\n\"This means integrating low-tier air defense capabilities at scale, combining different types of effectors with an eye on cost-effectiveness,\" Borsari said."}, {"id": "9f5bd474-2d02-47e0-853b-dbdf4058fd05", "title": "assassinated | What Did You Say ? ", "date": "2024-08-01 01:00", "url": "https://whatdidyousay.org/tag/assassinated/", "domain": "whatdidyousay.org", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken, at an event in Singapore, sidestepped a question on Haniyeh’s killing, saying a cease-fire deal in Gaza was key to avoiding wider regional escalation.\nQatar, which has been brokering talks aimed at halting the fighting in Gaza along with Egypt, condemned Haniyeh’s killing as a dangerous escalation of the conflict.\nIn Israel, the mood was buoyant as Israelis welcomed what they saw as a major achievement in the war against Hamas.\nResidents in besieged Gaza feared Haniyeh’s death would prolong the fighting that has devastated the enclave.\nThat assault by Hamas-led fighters killed about 1,200 people in southern Israeli communities and some 250 people were taken to Gaza as hostages, Israeli tallies say."}, {"id": "fc0cb27d-f5c7-40a1-96eb-ababb1ad94b1", "title": "ismail haniyeh | What Did You Say ? ", "date": "2024-08-01 01:00", "url": "https://whatdidyousay.org/tag/ismail-haniyeh/", "domain": "whatdidyousay.org", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken, at an event in Singapore, sidestepped a question on Haniyeh’s killing, saying a cease-fire deal in Gaza was key to avoiding wider regional escalation.\nQatar, which has been brokering talks aimed at halting the fighting in Gaza along with Egypt, condemned Haniyeh’s killing as a dangerous escalation of the conflict.\nIn Israel, the mood was buoyant as Israelis welcomed what they saw as a major achievement in the war against Hamas.\nResidents in besieged Gaza feared Haniyeh’s death would prolong the fighting that has devastated the enclave.\nThat assault by Hamas-led fighters killed about 1,200 people in southern Israeli communities and some 250 people were taken to Gaza as hostages, Israeli tallies say."}, {"id": "b883867c-4724-4c18-b2f3-70e0bc288b59", "title": "Iran Orders Direct Strike on Israel", "date": "2024-08-01 01:00", "url": "https://whatdidyousay.org/2024/07/31/iran-orders-direct-strike-on-israel/", "domain": "whatdidyousay.org", "domain_classification": "Unknown", "message": "Wednesday, 31 July 2024 04:22 PM EDTRead more at https://www.newsmax.com/world/globaltalk/iran-ismail-haniyeh-assassinated/2024/07/31/id/1174622/Iran Supreme Leader Ayatollah Ali Khamenei, has ordered Iran to strike Israel directly in retaliation for the killing in Tehran of Hamas leader Ismail Haniyeh, sources told The New York Times.\nThe latest events appear to set back chances of any imminent cease-fire agreement in the nearly 10-month-old war in Gaza between Israel and the Iran-backed Hamas.\nPalestinian President Mahmoud Abbas condemned the killing and Palestinian factions in the Israeli-occupied West Bank called for a strike and mass demonstrations.\nIn Israel, the mood was buoyant as Israelis welcomed what they saw as a major achievement in the war against Hamas.\nRead more: Iran Orders Direct Strike on Israel | Newsmax.com"}, {"id": "00064408-0692-4b88-970c-4653d7d6057e", "title": "Trump touts foreign policy record as overseas conflicts drag on", "date": "2024-08-01 01:45", "url": "https://highlandcountypress.com/news/trump-touts-foreign-policy-record-overseas-conflicts-drag", "domain": "highlandcountypress.com", "domain_classification": "Unknown", "message": "By Casey HarperThe Center SquareFormer President Donald Trump touted his foreign policy record Wednesday on the heels of an Israeli airstrike that unsettled the region and raised questions about a possible response from Iran.\n“Russia never invaded Ukraine under Trump!” the former president said on TruthSocial in all capital letters on Wednesday.\n“Iran never invaded Israel under trump!\n!”Trump’s comments come after Israel said it killed a top Hamas leader, Fuad Shukr, in a strike in Beirut, Lebanon.\nAnother top Hamas leader, Ismail Haniyeh, was reportedly assassinated in the capital of Iran by Israel as well."}, {"id": "3c276bdd-7085-4c33-9efd-fb0e7a614b1e", "title": "Russians strike Kharkiv Oblast railway station , injuring conductor – photos", "date": "2024-08-01 10:15", "url": "https://www.yahoo.com/news/russians-strike-kharkiv-oblast-railway-073858510.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians launched a missile strike on one of the railway stations in Kharkiv Oblast on the night of 31 July-1 August.\nA conductor sustained shrapnel wounds to the head as a result of the attack.\nSource: Ukrzaliznytsia (Ukrainian Railways)Quote: \"A missile strike was carried out on one of the railway stations in Kharkiv Oblast during the night.\nA conductor sustained shrapnel wounds to the head as a result of the attack.\nPhoto: UkrzaliznytsiaBackground:Russian forces attacked the village of Novoosynove in the Kupiansk district of Kharkiv Oblast and the city of Izium during the night, killing a man and injuring a 58-year-old woman."}, {"id": "8dad7c02-ffb0-4400-8df3-3ce0218ffa36", "title": "Iran vows revenge after Hamas leader Ismail Haniyeh killed", "date": "2024-08-01 00:30", "url": "https://www.bbc.co.uk/news/articles/c6p2ydk7er1o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "A senior Hamas official told the BBC the killing took place in the same building where Haniyeh had stayed during previous visits to Iran.\nKhalil Al-Hayya, a senior Hamas official, told a news conference that a missile hit Haniyeh \"directly\", citing witnesses who were with him.\nThe group's leadership has been left in \"a state of shock\", top Hamas officials have told the BBC.\nHours before Haniyeh was targeted, Israel said it had killed senior Hezbollah leader Fuad Shukr in Beirut.\nIsrael believes he was responsible for a rocket attack that killed 12 people in the Israeli-occupied Golan Heights on Saturday."}, {"id": "4b7b5d12-dcce-4efa-925e-dd7b0a42051c", "title": "MACAU DAILY TIMES 澳門每日時報Hamas leader Haniyeh killed in Iran by an alleged Israeli strike", "date": "2024-08-01 01:30", "url": "https://macaudailytimes.com.mo/hamas-leader-haniyeh-killed-in-iran-by-an-alleged-israeli-strike.html", "domain": "macaudailytimes.com.mo", "domain_classification": "Unknown", "message": "Most explosively, the strike in Tehran could push Iran and Israel into direct conflict if Iran retaliates.\nTuesday evening, Israel carried out a rare strike in the Lebanese capital that it said killed a top Hezbollah commander allegedly behind the rocket strike.\nHours later, the strike hit a residence Haniyeh uses in Tehran, killing him, Hamas said in a statement.\nThe top Hamas leader in Gaza is Yehya Sinwar, who masterminded the Oct. 7 attack.\nIn April, an Israeli airstrike in Gaza killed three of Haniyeh’s sons and four of his grandchildren."}, {"id": "f93b6cf6-61de-4006-83b0-410785b49d15", "title": "What to know about the escalating conflict and Israel - Hamas cease - fire talks after 2 assassinations", "date": "2024-08-01 15:00", "url": "https://wtop.com/national/2024/08/what-to-know-about-the-escalating-conflict-and-israel-hamas-cease-fire-talks-after-2-assassinations/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "Iran supports Hamas, as well as Hezbollah and other Palestinian militant groups fighting Israel in Gaza.\nBlinken did not mention Israel, Iran or Hamas by name in his comments.\nIsrael’s 10-month war against Hamas in Gaza has killed more than 39,000 Palestinians in the seaside enclave, according to Gaza Health Ministry numbers.\nBut he added a warning: “We will harm with great force whoever harms us.”Gaza cease-fire talks in questionConcern about the cease-fire talks have soared in the wake of Haniyeh’s killing.\nBlinken said Americans weren’t aware of or involved in the Haniyeh attack."}, {"id": "b22d98fe-dc84-407e-8e53-31485477ecf5", "title": "Iran supreme leader prays over the coffin of Hamas leader Haniyeh , whose killing risks a wider war", "date": "2024-08-01 06:30", "url": "https://www.newsday.com/news/nation/iran-hamas-israel-haniyeh-funeral-n96035", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments."}, {"id": "d7062a34-6d82-470d-b848-9c4cbc4a0d06", "title": "Israel Confirms Death of Hamas Terror Chief Mohammed Deif , Oct . 7 Mastermind", "date": "2024-08-01 17:30", "url": "https://www.algemeiner.com/2024/08/01/israel-confirms-death-hamas-terror-chief-mohammed-deif-oct-7-mastermind/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Deif is believed to have been one of the masterminds of Hamas’ Oct. 7 attack on southern Israel which triggered the Gaza war.\nIran and Hamas have blamed Haniyeh’s killing on Israel, which has neither denied nor confirmed a role in the assassination.\nSTRING OF DEATHSOn Thursday, Hamas official Sami Abu Zuhri said Haniyeh’s death would not weaken the group’s fighters in Gaza.\nIsraeli Defense Minister Yoav Gallant said Deif’s death was a milestone in Israel‘s goal of destroying Hamas’ military wing, known as Al-Qassam Brigades.\nIsrael responded with a military campaign aimed at freeing the hostages and dismantling Hamas’ military and governing capabilities in Gaza."}, {"id": "e86076ce-8767-4b27-af3f-28ac2596d1f3", "title": "Istanbul rally denounces Hamas chief Haniyeh assassination", "date": "2024-08-01 08:30", "url": "https://www.dailysabah.com/politics/istanbul-rally-denounces-hamas-chief-haniyehs-assassination/news", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Thousands of protestors took to the streets of Istanbul late on Wednesday to denounce the killing of Palestinian resistance group Hamas’ leader Ismail Haniyeh.\nThe demonstrators held posters with Haniyeh's photos and banners reading, \"Martyr Haniyeh, Jerusalem is our cause and your path is our path.\"\nThough Israel has remained silent about Haniyeh's death, Prime Minister Benjamin Netanyahu has hinted at Tel Aviv's involvement in his assassination.\nHaniyeh, normally based in Qatar, had been the face of Hamas's international diplomacy as Israel has waged war on Gaza.\nEarlier on Wednesday, President Recep Tayyip Erdoğan condemned the assassination in Tehran and said the killing would not break Palestinians' will."}, {"id": "80c29ad4-24df-4b6c-9491-22c197705aee", "title": "Hamas leader killed ,  Iran vow of vengeance - News Today", "date": "2024-08-01 06:30", "url": "https://newstodaynet.com/2024/08/01/hamas-leader-killed-irans-vow-of-vengeance/", "domain": "newstodaynet.com", "domain_classification": "Unknown", "message": "The simultaneous assassinations have amplified fears of a broader regional conflict, drawing sharp condemnations and promises of retaliation from various parties.\nDespite ongoing diplomatic efforts led by the U.S. to prevent the Gaza conflict from escalating, the recent violence poses significant challenges to these efforts.\nDespite his exile, Haniyeh remained influential in Hamas’s political and diplomatic efforts, and his death is expected to have significant ramifications for the group and the broader conflict.\nLebanon’s Foreign Minister Abdallah Bou Habib expressed concerns over the breach of what was perceived as red lines in the ongoing conflict.\nAs the situation evolves, the international community remains on high alert, with global diplomatic efforts intensifying to manage the fallout and prevent further escalation of the conflict."}, {"id": "b08cbe1a-50ac-4569-b39a-8c137c93badb", "title": "Israel says it has confirmed that chief of Hama military wing was killed in a July strike in Gaza", "date": "2024-08-01 15:45", "url": "https://www.yakimaherald.com/news/nation_and_world/world/israel-says-it-has-confirmed-that-chief-of-hamas-military-wing-was-killed-in-a/article_4051af29-323a-570b-97a5-8d2b0b9391d7.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Israel says it has confirmed that chief of Hamas' military wing was killed in a July strike in GazaThe Israeli military says it has confirmed that the head of Hamas’ military wing was killed in an airstrike in Gaza in July"}, {"id": "bd9a1263-d6fd-4874-98cd-493352a047a1", "title": "Hamas Leader Assassination In Tehran Fuels Fear Of Gaza War Spreading", "date": "2024-08-01 01:45", "url": "http://www.bigcountry995.com/story/66aaac7219d3db6628a65bda/hamas-leaders-assassination-in-tehran-fuels-fear-of-gaza-war-spreading", "domain": "bigcountry995.com", "domain_classification": "Unknown", "message": "Both blamed Israel for the strike that killed Haniyeh, and Iran's foreign ministry said the U.S. bore responsibility for the killing as Israel's biggest ally.\nHaniyeh hadn't been in Gaza in years and spent most of his time in Qatar, where Hamas has its primary political office outside of Gaza.\nSome of Hamas' most senior leaders are still believed to be in Gaza and remain on Israel's wanted list.\nTopping that list is Yahya Sinwar, Hamas' top leader in the Gaza Strip, who masterminded the Oct. 7 attack.\nIn April, an Israeli airstrike in Gaza killed three of Haniyeh's sons and four of his grandchildren."}, {"id": "4d42a28d-ef5a-425e-a498-1c854fe6f08b", "title": "New tech will make tomorrow wars more dangerous to troops , Army says", "date": "2024-08-01 17:15", "url": "https://www.defenseone.com/threats/2024/08/new-tech-will-make-tomorrows-wars-more-dangerous-troops-army-says/398495/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "The Army may need to rethink its traditional emphasis on maneuver warfare in the face of new weapons and other technology that will make tomorrow’s wars “increasingly lethal,” the service’s Training and Doctrine Command says in a new report.\nThese changes to the battlefield “may require a reassessment of our approach to maneuver, fires, and protection,” the report added.\nThe Army has long emphasized maneuver warfare, in which lightning attacks are used to disorient and ultimately shatter enemy formations.\nManeuver warfare stands in contrast to positional warfare, where artillery and other forms of fires are used to push an enemy out.\n“Russia is gaining combat lessons and proving that simply outlasting an enemy is a potentially valid military option,” according to the report."}, {"id": "8e85af10-1568-4831-afc1-d842fe5869ae", "title": "Silent Swarm Exercise Accelerates Navy Path To Distributed Electronic Warfare Future", "date": "2024-08-01 03:30", "url": "https://www.yahoo.com/news/silent-swarm-exercise-accelerates-navy-002644391.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Dubbed Silent Swarm 2024, the event was designed to test early-stage electronic spectrum technology offerings from industry.\nSilent Swarm 2024 is the third iteration of the exercise, with the first taking place in 2022.\nUSNThe 2024 iteration of Silent Swarm also builds on the findings from the previous two iterations of the event.\n“[Silent Swarm]… started as a small, unmanned table top exercise in December of 2021, focusing on kinetic warfare,” Gamberg noted previously.\nSwarms of these kinds of drones, armed with various electronic warfare technologies, would be critical in a potential future conflict in the Pacific, likely involving China."}, {"id": "b03a63b0-d5f8-471c-bfdd-26f4ea54c1f6", "title": "Italy signs €1 . 5 billion contract for two new FREMM frigates", "date": "2024-08-01 00:45", "url": "https://www.defensenews.com/global/europe/2024/07/31/italy-signs-15-billion-contract-for-two-new-fremm-frigates/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "Italy has signed a €1.5 billion contract with local defense champions Fincantieri and Leonardo for two new, upgraded FREMM frigates.\nDubbed FREMM EVO, the platforms will offer enhanced capabilities for defeating drone attacks and operating sub-sea, surface and aerial unmanned systems, among other improvements, the firms said.\n”The evolution of the FREMM capitalizes on a project that has proven, over the years, its full compliance with the requirements of the Italian Navy and has gained widespread international consensus,” said Italian Navy Chief Adm. Enrico Credendino.\nThe two new EVO vessels will offer the anti-submarine warfare capabilities of earlier Italian FREMM versions and a series of upgrades to the ship’s cyber warfare capabilities, its air conditioning and electrical distribution system.\nSome of the technology upgrades are being adopted from Italy’s PPA navy vessels."}, {"id": "143a1a0e-060b-4cf6-8a78-a77ca0fea745", "title": "Guam missile defense office awaits funds to build layered architecture", "date": "2024-08-01 00:45", "url": "https://www.defensenews.com/pentagon/2024/07/31/guam-missile-defense-office-awaits-funds-to-build-layered-architecture/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Pentagon’s joint program office for the missile defense of Guam is waiting on fiscal 2024 funding to be reprogrammed from elsewhere in the budget to help pay for its efforts to build an architecture to defend the key U.S. territory in the Pacific.\nKey decisions remain on which agency or services will own and control what equipment as part of the architecture.\nThe Missile Defense Agency and the Army sought a combined $1.5 billion in the FY24 budget to begin preparing the island by moving assets into place and integrating capabilities.\nI don’t have any magic resource dust to put [the Lower Tier Air and Missile Defense Systems] to the left two years or [the Integrated Battle Command System],” he told Defense News at the event.\nThe Army is planning to incorporate its legacy Patriot air and missile defense system as well as its in-development Lower Tier Air and Missile Defense Sensor that will replace Patriot’s radar."}, {"id": "df4f910b-b392-47b9-bab2-2fbb54e618df", "title": "VA clinic in KCK to be named after Captain Elwin  Al  Shopteese", "date": "2024-08-01 01:15", "url": "https://www.yahoo.com/news/va-clinic-kck-named-captain-221224077.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "KANSAS CITY, Mo.\n— President Biden signed a law into legislation yesterday to name the VA outpatient clinic in Kansas City, Kan. after Captian Elwin “Al” Shopteese.\nAfter the war, Shopteese returned to Kansas, attending Haskell University in 1946 before continuing his service in the Korean War.\n“Captain Shopteese’s legacy of service to our country and the Native American community will be forever honored and preserved for all who come through the doors of the Captain Elwin Shopteese VA Clinic,” said Sen. Moran.\nFor the latest news, weather, sports, and streaming video, head to FOX 4 Kansas City WDAF-TV | News, Weather, Sports."}, {"id": "0712529a-ce40-4a73-b808-620be710e5d3", "title": "Why Ukraine May Not Use New F - 16s in Frontline Attacks", "date": "2024-08-01 15:00", "url": "https://www.businessinsider.com/ukraine-may-not-use-f16s-for-frontline-offensives-it-wanted-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Officials later confirmed to the Associated Press that some F-16s were indeed in Ukraine.\nAdvertisementThis means Ukraine may not use its F-16s for the frontline offensives it would prefer, according to military experts and Ukraine's top general.\nPeter Layton, a fellow at the Griffith Asia Institute who served in Australia's air force, said Ukraine would have to be cautious.\nHe said its small number of aircraft and few pilots would mean Ukraine has to prioritize avoiding losses, so it can fly the F-16s as long as possible.\nUkraine also faces challenges when it comes to logistics around the F-16s."}, {"id": "2f596125-e8f1-4373-8dbe-81950e01dd74", "title": "Wounded Knee Medals of Honor come under scrutiny as massacre is revisited", "date": "2024-08-01 04:45", "url": "https://www.yahoo.com/news/wounded-knee-medals-honor-come-040241709.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "There’s a case to be made that there was no honor present at Wounded Knee that day.\nThat’s why we need this review.”Aftermath of the Wounded Knee Massacre, South Dakota.\nThe Seventh Cavalry arrived at Wounded Knee Creek and sought to disarm the Lakota.\nMedal of Honor that would have been similar to those award to soldiers at Wounded Knee.\nUltimately, nobody can view actions at Wounded Knee as something to be proud of."}, {"id": "a7f6fa4f-a3e3-4056-a6a5-29f0ff0bf1b4", "title": "AI - powered computer inventor Alan Turing to answer questions at Bletchley Park", "date": "2024-08-01 01:15", "url": "https://www.thenews.com.pk/latest/1215447-ai-powered-computer-inventor-alan-turing-to-answer-questions-at-bletchley-park", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "A close-up view shows part of an artwork of Alan Turing.\n— Reuters/fileAlan Turing, father of artificial intelligence (AI), will soon rise as an animated figure at Bletchley Park near Milton Keynes home of Britain’s Second World War code breakers, BBC reported.\nThe current trustee of the Bletchley Park Trust and the nephew of Alan Turing, Sir Dermot Turing said: “The principle behind machine learning can be found in work that Alan Turing did in Bletchley Park during the Second World War referring to the machine solutions to code-breaking issues.\nOf course, many people come to Bletchley Park to be closer to what Alan Turing did, and this will be rather amusing.\"\nCurrently, Bletchley Park is working with a UK-based Artificial Intelligence firm, known as 1956 Individuals to develop this display which is expected to be completed in several months."}, {"id": "7f62dba5-8ebd-424f-8934-92f1fc1f891b", "title": "Air Commodore Suraj Shankar : Air commodore Suraj Shankar assumes command of ATS Belagavi | Hubballi News", "date": "2024-08-01 03:15", "url": "https://timesofindia.indiatimes.com/city/hubballi/air-commodore-suraj-shankar-assumes-command-of-ats-belagavi/articleshow/112180640.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "S-400 air defence system 'shot down' almost entire 'enemy' package in exercise; major success for IAFThe Indian Air Force's recent exercise demonstrated the success of the Sudarshan S-400 air defence missile system, which 'shot down' 80% of simulated enemy aircraft and forced others to abort their missions.\nWith three squadrons already inducted and two more expected by 2026, this system is seen as a game changer in air defence capabilities.\nBelagavi: Air commodore Suraj Shankar took over the command of Airmen Training School (ATS) Belagavi from Air commodore S Sridhar here on Wednesday.\nSuraj Shankar was commissioned in the flying branch of the Indian Air Force (IAF) on June 29, 1996.\nThe Air officer was also part of the Indian Aviation Contingent operating at Congo as part of the UN Peacekeeping Forces in 2004."}, {"id": "49c67a69-e8e9-4630-ae1f-84edb69f2c7d", "title": "Hamas Leader Ismail Haniyeh Killed in Iran By  Airborne  Object – Hollywood Life", "date": "2024-08-01 00:00", "url": "https://hollywoodlife.com/2024/07/31/hamas-leader-ismail-haniyeh-killed/", "domain": "hollywoodlife.com", "domain_classification": "Unknown", "message": "Image Credit: AFP via Getty ImagesThe ongoing war between Israel and Hamas has hit another extreme with the death of Hamas’ top political leader Ismail Haniyeh.\nIn addition to the recent incident, Israeli Prime Minister Benjamin Netanyahu addressed his nation and spoke on the current war.\n“Three weeks ago, we attacked the military chief of Hamas, Mohammad Deif.\nTwo weeks ago, we attacked the Houthis, in one of the farthest attacks the Air Force has carried out.\nThe Israel-Hamas war began back in October 2023 following Ocotober 7th, the deadliest attack on Israel since the Holocaust."}, {"id": "1fdbbf07-5911-4228-9061-ca68db1f1132", "title": "Second F - 35C Squadron at Miramar Reaches Milestone for Carrier Deployment", "date": "2024-08-01 02:15", "url": "https://timesofsandiego.com/military/2024/07/31/second-f-35c-squadron-at-miramar-reaches-milestone-for-carrier-deployment/", "domain": "timesofsandiego.com", "domain_classification": "Unknown", "message": "F-35C stealth jets on the flight line at Miramar.\nMarine Corps photoMarine Fighter Attack Squadron 311 on Wednesday became the second squadron at Miramar certified to fly the F-35C Lightning II, the carrier version of the new stealth jet.\nMaj. Gen. James Wellons, commander of the 3rd Marine Air Wing, announced the squadron’s initial operational capability.\nThe F-35C is the only long-range stealth fighter designed and built explicitly for Navy carrier operations.\nThe stealth jet’s multirole capabilities enable Marine Corps aviation to adapt to a wide range of mission requirements, including air-to-air combat, air-to-ground strikes, reconnaissance and electronic warfare"}, {"id": "48d98112-e697-44b9-b70b-e1a237cf6576", "title": "Romancing SaGa 2 : Revenge of the Seven classes , battle , systems , The Dragon Lair details", "date": "2024-08-01 17:30", "url": "https://nintendoeverything.com/romancing-saga-2-revenge-of-the-seven-details-character-classes-battle-systems-the-dragon-lair/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Square Enix is back with new Romancing SaGa 2: Revenge of the Seven details covering the character classes, battle, systems, and The Dragon Lair, which is a free-form scenario.\nAs the Master Dragon, he leads the Dragon Lair and is responsible for the protection of the people of Nibel.\nOnce longer United Attack chains are unlocked, they can be used in battle by repeatedly building up the Overdrive gauge.\nOnce a United Attack has been launched during an encounter, the next United Attack used within the same encounter will include more retinue members.\nThe decision you make will greatly affect your relationship with the Dragon Lair."}, {"id": "909d157f-90e8-412d-9d03-73f95ac4a543", "title": "BattleBots - ITV4 | TV Guide", "date": "2024-08-01 05:45", "url": "https://www.tvguide.co.uk/schedule/a5890e77-960b-5f7a-b067-50ad80ea9847/battlebots", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "BattleBotsITV4 11:25 AM to 12:25 PM Thursday 1 August Share Add toCalendar +Who's Through, and Who's Blue?\nSeason 5 Episode 32 of 40 S SubtitlesUS robot combat series where contestants control their armoured and technologically advanced automatons through a remote control and battle other robots to win the competition.\nWill second seed Bloodsport continue its winning run towards the Giant Nut in the dramatic conclusion of the Round of 32, and can fourth series runner-up Witch Doctor fend off the powerful sting of Skorpios?\nBattleBots airs on ITV4 at 11:25 AM, Thursday 1 August .\nLearn more about BattleBots and other show/game show on our entertainment page"}, {"id": "c4734d0a-b724-4bdf-8e09-e8fb0799b45c", "title": "What Was The First Aircraft Carrier With The Game - Changing Full Flat Landing Deck ? ", "date": "2024-08-01 18:00", "url": "https://www.slashgear.com/1630940/first-aircraft-carrier-flat-landing-deck-change-naval-aviation/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "Although his name would be overshadowed by the success of the Wright Brothers, Eugene B. Ely performed the first aircraft launch off a seafaring vessel in November 1910.\nEly used a wooden platform constructed over the United States' Birmingham cruiser to develop the basis of the aircraft carrier.\nHowever, at the time, the cruiser wasn't capable of transporting the very aircraft it would launch into battle.\nThe crude wooden platform also proved insufficient for a perfect takeoff or landing, and Ely's efforts were far from smooth.\nEight years after Ely's first launch off a ship-based platform, the British Royal Navy overhauled the HMS Argus into the first vessel designed with a full-length, flat flight deck."}, {"id": "dae975d0-43e6-4a3d-ab22-93246ee64f2c", "title": "Warsaw to come to standstill in memory of WWII uprising", "date": "2024-08-01 07:45", "url": "https://www.rte.ie/news/europe/2024/0801/1462885-warsaw-uprising-1944/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Young Polish insurgents during the Warsaw UprisingThis year's anniversary may also be the last big commemoration to involve surviving veterans.\n\"The Warsaw Uprising is the central pillar of political history for successive Polish governments,\" Adam Leszczyński, a Polish historian and sociologist, said.\nBarricades divided territory held by Polish and German forces, and Warsaw turned into a death zone of ferocious street-by-street and house-to-house fighting.\nThe same district is home to the Warsaw Uprising Museum, which tells the story of the uprising.\nGerman President Frank-Walter Steinmeier (L) and Polish President Andrzej Duda (R) sit amongWarsaw Uprising veterans at a ceremony yesterday in Warsaw\"The Warsaw insurgents were like Luke Skywalker and his comrades."}, {"id": "af727bfc-c532-4ac5-9692-d4db6106806c", "title": "First round of US - made F - 16s land in Ukraine as war with Russia rages on", "date": "2024-08-01 17:30", "url": "https://www.yahoo.com/news/first-round-us-made-f-145325084.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "First round of US-made F-16s land in Ukraine as war with Russia rages onThe long-awaited arrival of U.S.-made F-16s have allegedly landed in Ukraine, officials said Wednesday, a move that will help Kyiv revive its air capabilities in its war against Russia.\nLithuanian Foreign Minister Gabrielius Landsbergis, an ardent supporter of Kyiv, took to X to confirm the delivery and said, \"F-16s in Ukraine.\nZelenskyy has long emphasized the important role F-16s would serve in bolstering Ukraine’s air defenses as Russia continues to pummel the country with drone and missile strikes.\nWreckage and debris outside a damaged shopping center in the Podilskyi district of Kyiv from Russian air strikes in Kyiv, Ukraine, 21 March 2022.\nOriginal article source: First round of US-made F-16s land in Ukraine as war with Russia rages on"}, {"id": "d273e640-b590-46ce-9977-1e228eb429ab", "title": "Israel targeted killing of Hamas leader Ismail Haniyeh", "date": "2024-08-01 01:00", "url": "https://www.jpost.com/opinion/article-812743", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "TAKING OUT Haniyeh was also important since it was directed against a senior Hamas leader and not specifically at Hezbollah, which may reduce Iran’s justification for launching a major attack.\nThe operation to assassinate Haniyeh was a fitting reversal of his successful psychological warfare against Israel.\nEven though he was a Sunni leader of Hamas, Haniyeh had become a well-known representative of the Iranian Shi’ite regime.\nMobilized and directed by Tehran, Hamas had used “hybrid warfare” – traditional terror actions combined with popular mobilization of the public.\nHaniyeh’s interest was in saving the Hamas regime, keeping it in the cockpit, and also “blowing up” the negotiations between Israel and Hamas by intensifying Hamas’s demands."}, {"id": "bcd5c7d6-2526-465d-ab9a-b609fc462dc6", "title": "Woman wins her very own  Who Do You Think You Are ? experience and discovers her great - grandfather was a Bristol war hero", "date": "2024-08-01 12:45", "url": "https://www.bristolpost.co.uk/news/bristol-news/woman-wins-very-who-you-9452354", "domain": "bristolpost.co.uk", "domain_classification": "Unknown", "message": "A woman who won a ‘Who Do You Think You Are?’-style experience discovered her great-grandfather was a Bristolian hero in both world wars.\nOver 700,000 British soldiers suffered limb wounds during the First World War, and over 41,000 soldiers underwent amputations.\nAt the hospital, he met a woman called Lucy, and they fell in love, married, and Lucy is Laura’s great-grandmother.\nThey returned to Bristol and raised a family - they had seven children, five of whom survived infancy, including Laura’s grandfather Robert.\n“Our collection of billions of records and historical newspapers, and connected tree network, have been key to solving Laura’s family mystery, and bringing Eli’s unique story to light,” she added."}, {"id": "afc376f2-fe5d-4fc1-834d-1744594a379d", "title": "Israel sends message to Iran with Hamas leader Ismail Haniyeh assassination : No haven for terrorists", "date": "2024-08-01 03:00", "url": "https://nypost.com/2024/07/31/opinion/israel-sends-message-to-iran-with-hamas-leader-ismail-haniyehs-assassination-no-haven-for-terrorists/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The early Wednesday morning assassination in Tehran of Hamas’ Politburo head Ismail Haniyeh, attributed to Israel, reportedly caused a panic in the senior ranks of the Iranian regime.\nHaniyeh, who was based in Doha, Qatar, was in Iran to attend the inauguration of Iran’s new president, Masoud Pezeshkia.\nHaniyeh’s assassination is rife with implications for the ongoing war between Israel and Hamas in Gaza and for the broader regional war that Iran is fighting against Israel directly and through its terror proxies.\nIt is a major battlefield in the regional war that Iran is leading against Israel through its proxies and directly.\nIran on noticeEvery Iranian official engaged in the war against Israel now knows he has a target on his forehead."}, {"id": "cf4f346f-dc44-485e-a461-48a9f569c800", "title": "Luigi Mansion 2 HD Debuts in 2nd on the Canadian Charts , Elden Ring Takes 1st", "date": "2024-08-01 08:45", "url": "https://www.vgchartz.com/article/461893/canada-monthly-june-2024/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Luigi's Mansion 2 HD Debuts in 2nd on the Canadian Charts, Elden Ring Takes 1st - Sales/ 655 Viewsby, posted 13 hours agoLuigi's Mansion 2 HD has debuted in second place on the Canadian charts for June 2024, according to data from Circana (formerly The NPD Group) reported by the Entertainment Software Association of Canada (ESA).\nThe one other new release in the top 10 was Shin Megami Tensei V: Vengeance, which debuted in fourth place.\nElden Ring shot up five spots to first place due to the release of the Shadow of the Erdtree expansion.\nHogwarts Legacy was up four spots to third place, while EA Sports FC 24 re-entered the top 10 in fifth place.\nHelldivers 2 dropped five spots to eighth place, Sea of Thieves fell four spots to ninth place, and Ghost of Tsushima fell from second to 10th place."}, {"id": "19d8a955-6bfd-41b3-8e3e-6e51dd2f9136", "title": "From the Archives : A DMZ Wish Rain , rain stay away", "date": "2024-08-01 10:45", "url": "https://www.stripes.com/history/2024-08-01/archives-a-dmz-wish-14677841.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A platoon leader with the 1st Republic of Korea Division looks through a set of binoculars toward North Korea from his position in the Demilitarized Zone.\nWith the 1ST ROK DIV., Korea — Farmers in the Republic of Korea may pray for rain, but ROK soldiers manning the Demilitarized Zone here dread the annual summer deluge as a season of mud.\nSoldiers of the 1st Republic of Korea Division keep their machine gun ready for any threats against their outpost on the Demilitarized Zone.\nThe 1st ROK Div.\nsoldiers stand a 24-hour watch and can look into north Korea at Heartbreak Ridge, scene of some of the bitterest fighting in the Korean War."}, {"id": "217e9b1a-ae4e-49eb-a3d5-0047465507c2", "title": "Estonia introduces mandatory customs control for everyone crossing Russian border", "date": "2024-08-01 16:00", "url": "https://www.eurointegration.com.ua/eng/news/2024/08/1/7191314/", "domain": "eurointegration.com.ua", "domain_classification": "Unknown", "message": "Estonia will impose customs control upon all travellers crossing the border with Russia starting from 8 August to combat sanctions evasion.\nOn Thursday, Margus Tsahkna, Minister of Foreign Affairs of Estonia, announced that in a week, customs control would be mandatory for all travellers crossing the Estonian-Russian border.\n\"From 8 August, Estonia will implement full customs control on the border with Russia to better ensure that we do not feed Russia’s war machine and help the aggressor evade sanctions,\" he said.\nFrom August 8th #Estonia will implement full customs control on the border with Russia to better ensure that we do not feed Russia’s war machine & help the aggressor evade sanctions.\nThe government predicts that general control, instead of selective control, will increase border crossing times."}, {"id": "54db0c75-2f95-49a0-ab9d-5322c6c93c67", "title": "A slight curve helps rocks make the biggest splash", "date": "2024-08-01 16:30", "url": "https://www.newscientist.com/article/2442410-a-slight-curve-helps-rocks-make-the-biggest-splash/", "domain": "newscientist.com", "domain_classification": "Unknown", "message": "Researchers were surprised to find that a very slightly curved object produces a more dramatic splash than a perfectly flat oneFlat rocks may not deliver the most dramatic splash Julian Brooks/AlamyWhen you want to find a rock that will make the biggest possible splash, you might do well looking for one that is ever so slightly curved.\nThis will produce the largest impact force when it hits water, according to a finding that overturns a long-held belief in physics.\nThe discovery was made by Jesse Belden at the Naval Undersea Warfare Center in Rhode Island and his colleagues, who set out to examine the idea that a flat object produces the greatest impact on water."}, {"id": "d6fe245e-9628-454b-8dfb-19d3172d27ae", "title": "Shawano community gathers to celebrate World War II veteran 100th birthday", "date": "2024-08-01 17:30", "url": "https://fox11online.com/community/shawano-community-gathers-to-celebrate-world-war-ii-veterans-100th-birthday-ralph-maas-philippines-okinawa-lighthouse-bar-david-cullen", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "SHAWANO, Wis. (WLUK) -- A World War II combat veteran joined a very elite club Wednesday.\nRalph Maas celebrated his centennial birthday with his loved ones and members of the Shawano community.\nWord of his birthday party spread on a simple sign at the Lighthouse Bar.\nDuring World War II, Maas fought for the liberation of the Philippines and the conquest of Okinawa, Japan.\nRalph plans to stop by Green Bay Packers training camp to show the players some of his tricks."}, {"id": "79c4ab0e-9f6c-40e0-94b3-100c380e40c8", "title": "WW2 - Battles for Europe - U y", "date": "2024-08-01 04:15", "url": "https://www.tvguide.co.uk/schedule/02fafb06-21ed-5c47-a7da-35597b0687b5/ww2-battles-for-europe", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "WW2 - Battles for EuropeU&Yesterday 10:00 AM to 11:00 AM Thursday 1 August Share Add toCalendar +Battle of the Bulge Season 1 Episode 7 of 8 S SubtitlesHitler's launch of his great counter-offensive against the unsuspecting Allies in the Ardennes.\nThis was the Nazis' last gamble in the West to turn the tide of the warWW2 - Battles for Europe airs on U&Yesterday at 10:00 AM, Thursday 1 August .\n(Subtitles.)\nLearn more about WW2 - Battles for Europe and other education/science/factual topics on our factual page"}, {"id": "8dce6226-8ae3-428b-b19e-9e0788e5ecb8", "title": "Global focus shift , from NATO summit to Trump shooting", "date": "2024-08-01 00:45", "url": "https://www.dailysabah.com/opinion/op-ed/global-focus-shift-from-nato-summit-to-trump-shooting", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Before the last NATO summit could be thoroughly discussed among international relations experts, news of an assassination attempt on presidential candidate Donald Trump in the U.S. stunned the world.\nMeanwhile, the NATO summit held before the assassination was equally dramatic.\nAssessing 'bridge'A major point of contention at the NATO summit was the ongoing war in Ukraine.\nThey argue that structural changes, such as the new NATO Security Assistance and Training for Ukraine (NSATU) center, will not suffice.\nThis has resonated globally and highlights NATO's strategic shift toward China following its previous focus on Russia."}, {"id": "4852de70-ad54-4cd8-8d2f-62224258120c", "title": "Our Chayalim Need Our Support Encouragement and Strength ! ", "date": "2024-08-01 19:00", "url": "https://www.theyeshivaworld.com/news/promotions/2301818/our-chayalim-need-our-support-encouragement-and-strength.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "*With the recent assassination of 2 Hamas and Hezbollah leaders, the battle is intensifying on all fronts* .\n*Our Chayalim need our support, encouragement and strength!\n* 💪🏻Lehachayot is sponsoring a massive BBQ to raise morale in the north among our soldiers.\nPartner with us in bringing strength, support and happiness to Israel’s warriors.\n* 🙏Donate nowThe volunteers of the “Lehachayot” organization at a briefing before entering a large base in the north"}, {"id": "16d80f8e-3b44-459a-bc79-00a9a8fb8c30", "title": "Our Town : Ely history is well preserved but there are still some mysteries", "date": "2024-08-01 00:15", "url": "https://www.kcrg.com/2024/07/31/our-town-elys-history-is-well-preserved-there-are-still-some-mysteries/", "domain": "kcrg.com", "domain_classification": "Unknown", "message": "ELY, Iowa (KCRG) - Ely, Iowa is named after John Ely, a railroad executive.\n“As far as written records go, official records, we don’t know who was here first: Rogers Grove, Hoosiers Grove, Facklers Grove,” said historian Ed Vavra.\n“I think we have an outsized role for the size of our post in our community.”But its history is worth noting.\n“Ely’s an awfully big town to not have a veterans memorial so I’m glad to be having one in,” said Smith.\n“So one of the things that’s important to me and a lot of people in town is preserving that and sharing it.”Copyright 2024 KCRG."}, {"id": "5704f3e3-cabf-4d3a-b783-925158deb754", "title": "Age - old conflict | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-01 08:00", "url": "https://www.arkansasonline.com/news/2024/aug/01/age-old-conflict/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "All three Abrahamic religions--Judaism, Christianity, and Islam--consider the Holy Land of Israel, and especially Jerusalem, central to faith.\nBy the 1930s, the Jewish and Palestinian populations in the Holy Land began experiencing conflict.\nThe Holy Land presents conflicting moral imperatives.\nOn the other hand, for almost two millennia Palestinians were the majority in the Holy Land.\nThe Reverend Barkley Thompson, an Episcopal priest in Little Rock, serves as the president of the North American Committee for St. George's College, Jerusalem, the Anglican Center in the Holy Land."}, {"id": "6edd24b9-13ac-4e38-b2da-5ba597dbd7a9", "title": "A deadly Houthi attack on Tel Aviv is forcing Israel to rethink its drone defenses", "date": "2024-08-01 06:30", "url": "https://www.businessinsider.in/international/news/a-deadly-houthi-attack-on-tel-aviv-is-forcing-israel-to-rethink-its-drone-defenses/articleshow/112181105.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Sensors picked up the unidentified aircraft but air defense crews failed to try to identify it.\nThe Houthis' unprecedented July 19 drone attack against Tel Aviv from Yemen caught Israelis by surprise, piercing the country's battle-tested defenses and exposing vulnerabilities that the Yemen-based rebels were ready and willing to exploit.\n\"This confirms that technology alone, even for one of the most advanced air defense systems in the world, is not enough to provide effective protection,\" Borsari said.\n'A more cunning approach'Following the deadly attack, the Israeli military promptly increased air patrols to protect Israeli airspace.\n\"This means integrating low-tier air defense capabilities at scale, combining different types of effectors with an eye on cost-effectiveness,\" Borsari said."}, {"id": "2ad90b9c-c5f0-4047-bcb7-c7a4e10c3acc", "title": "Army , police bust terrorist hideout in J & K Rajouri | India News", "date": "2024-08-01 05:00", "url": "https://timesofindia.indiatimes.com/india/army-police-bust-terrorist-hideout-in-jks-rajouri/articleshow/112182273.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: Indian Army along with Jammu and Kashmir Police busted a terrorist hideout in Jammu and Kashmir's Kalakote region of Rajouri district.\nThe search operation began late Wednesday night in response to reports of suspicious activity, according to PTI.The officials said that the operation led to the recovery of an AK-47 rifle, several rounds of ammunition and magazines.The operation was carried out by the Rashtriya Rifles Unit of the Indian Army, in collaboration with local law enforcement and CRPF at Gulabgarh.Security sources had reported earlier this week that over 60 foreign terrorists, skilled in jungle warfare, are operating in small groups across the Jammu region.\nThese groups are equipped with advanced technology such as iridium satellite phones and thermal imaging, and are armed with sophisticated weapons including the American M4 carbine."}, {"id": "76394da0-8c57-49cb-b93e-c43bbef3251f", "title": "  We are at a crossroad for democracy and free society  ", "date": "2024-08-01 08:15", "url": "https://www.thejc.com/news/israel/we-are-at-a-crossroad-for-democracy-and-free-society-k3twsero", "domain": "thejc.com", "domain_classification": "Unknown", "message": "“They need to be fighting the unconventional war we are faced with and recognise it as our shared struggle,” she added.\nThe title of Cotler-Wunsh’s talk reveals much about her work: Writing on the Wall: Antisemitism as a National Security Threat, not just to Jews & Israel.\nIt’s not enough to legislate or make a commitment to combat antisemitism, somebody has to be following up.\n“We know that there is an increase in antisemitism, in university campuses, on social media platforms, on the streets.\n“We are at a crossroad for democracy and free society generally."}, {"id": "ad459e05-8d46-49fe-9e7c-af8d34ec5807", "title": "Michael Oren joins emergency squad to protect from Hezbollah - Israel News", "date": "2024-08-01 00:30", "url": "https://www.jpost.com/israel-news/article-812821", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "At the culmination of a tense week at the northern border, former Israeli ambassador to the US and former deputy minister in the Prime Minister's Office Michael Oren volunteered for the Kfar Blum emergency squad.\nOn normal days I contribute through advocacy and diplomacy and today I am qualified as a member of the alert class at the northern border, for all that that implies.\"\nTHEN-MK Michael Oren attends a parliamentary committee meeting in 2017.\nMichael Oren's combat experienceIn the coming days, Oren, who served in the paratroopers' brigade during the First Lebanon War, will take a full part of Kfar Blum's emergency squad, which includes guarding the static guard posts, mounted patrols, and integration into the dawn standby of the emergency squad.\nIn addition, also, as the former ambassador of Israel, Oren is active in everything related to the rising war on the northern border and the many difficulties experienced by the refugees from the north."}, {"id": "3e5b8bc9-68b2-4c20-84b9-a82fae5b2004", "title": "Apex Legends : Shockwave aims for  Revival  with new E - District map", "date": "2024-08-01 18:15", "url": "https://www.shacknews.com/article/140777/apex-legends-shockwave-season-22-preview", "domain": "shacknews.com", "domain_classification": "Unknown", "message": "The developer has outlined some exciting ways to do that as part of the reveal for Season 22, titled Apex Legends: Shockwave.\nApex Legends: Shockwave will keep the battle royale fun going more than ever before.\nSource: Electronic ArtsLook for various features in Apex Legends: Shockwave to roll out throughout the course of Season 22.\nApex Legends: Shockwave will kick off on Tuesday, August 6.\nTo reflect on the past five years of Apex Legends, travel back to earlier this year and check out our interview."}, {"id": "64f973f2-cba6-4964-9a34-0ccea35e87fa", "title": "South Korean Army forces stage maritime infiltration exercise", "date": "2024-08-01 10:00", "url": "https://www.prokerala.com/news/articles/a1552262.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Seoul, Aug 1 : South Korean army operations troops on Thursday wrapped up an exercise around an island off the west coast designed to strengthen their maritime infiltration capabilities, officials said.\nThe exercise, which began July 22, took place around Anmyeon Island, 123 kilometers southwest of Seoul, involving some 150 personnel under the Army Special Warfare Command and about 20 pieces of equipment, such as special operations boats, Yonhap news agency reported.\nDuring the drills, the troops trained on infiltrating coastlines aboard the inflatable boats and eliminating threats in target areas, according to the army.\nThe exercise also mobilized coastal defense personnel from the 32nd Infantry Division to serve as troops defending against the infiltrating special forces, it said.\nThe army said the exercise served to strengthen the operational capabilities of special forces and coastal defense personnel, adding that it plans to improve training methods to enhance troop readiness."}, {"id": "c031d1ba-109c-436c-99bc-82b3f56ea0f2", "title": "10 Games That Are Glorified Movies", "date": "2024-08-01 08:30", "url": "https://listverse.com/2024/08/01/10-games-that-are-glorified-movies/", "domain": "listverse.com", "domain_classification": "Unknown", "message": "WhatsApp Pin Share Email 0 SharesA core appeal of video games is their interactivity.\nRecent years have given way to an unsettling trend: games trying to be movies.\nThe design strives to blur the line between games and television, but intent can only get you far.\nThat pattern undermines the game’s selling point, making it just another horror flick filled with stupid victims.\nThis murder mystery also stumbles in its attempts to marry gameplay and cutscenes, but at least has genuine branching paths."}, {"id": "f396dc65-50c3-4d5d-8ca4-ca7567ca36ff", "title": "ROK consul general says  thank you  to NH veterans", "date": "2024-08-01 02:15", "url": "https://www.unionleader.com/news/military/rok-consul-general-says-thank-you-to-nh-veterans/article_b6d622da-4d14-11ef-8dfd-ef4b06db1957.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "6181760d-d88e-49c1-ab59-4e3f5cd94f29", "title": "Nasrallah threatens :  A new stage in the war with Israel has begun  ", "date": "2024-08-01 17:30", "url": "https://www.israelnationalnews.com/news/393976", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Hezbollah Secretary General Hassan Nasrallah reacted on Thursday for the first time to the elimination of his top military commander Fuad Shukr.\nWe are in an open battle on all fronts, and it is entering a new stage,\" Nasrallah threatened.\nYou crossed red lines with your aggression.\n\"The Israelis know what red lines they crossed.\nThis is aggression, not a military elimination.\""}, {"id": "c027b661-7d89-4a2e-9fec-634011a358c8", "title": "Pentagon considers stripping 20 Medal of Honor recipients amid probe into Wounded Knee Massacre in which soldiers slaughtered Native American women and children", "date": "2024-08-01 06:45", "url": "https://www.dailymail.co.uk/news/article-13696541/Pentagon-panel-review-Medals-Wounded-Knee-massacre.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The Pentagon has launched a review that could see 20 Medals of Honor awarded to soldiers in the Wounded Knee Massacre rescinded.\nMedals of Honor were given to 20 soldiers from the 7th Cavalry regiment for their actions on Pine Ridge Indian Reservation near Wounded Knee Creek.\nCongress apologized in 1990 to the descendants of those killed at Wounded Knee but did not revoke the medals despite then deeming it a massacre.\n'There's a case to be made that there was no honor present at Wounded Knee that day.\nIn a private letter, he wrote: 'I have never heard of a more brutal, cold-blooded massacre than that at Wounded Knee.'"}, {"id": "f9a0aef3-60fc-4b31-ab76-e9537ff08ae3", "title": "What Going On at the USS KIDD Veterans Museum | Sponsored : USS Kidd Veterans Museum", "date": "2024-08-01 02:15", "url": "https://www.theadvocate.com/sponsored/baton_rouge/uss_kidd_veterans_museum/what-s-going-on-at-the-uss-kidd-veterans-museum/article_9d25c3e6-49f3-11ef-b593-b3000bffe8e3.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "You have permission to edit this article."}, {"id": "17ca10db-67b9-47b2-ab17-6b0d63933afa", "title": "Defense Ministry to purchase Ukrainian - made unmanned ground vehicles", "date": "2024-08-01 18:00", "url": "https://www.yahoo.com/news/defense-ministry-purchase-ukrainian-made-171439256.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's Defense Procurement Agency (DPA) has signed an agreement with a domestic manufacturer to purchase ground-based kamikaze drones, the Defense Ministry announced on Aug. 1.\nThroughout Russia’s full-scale invasion, Ukraine and Russia have heavily invested in drone technology, revolutionizing warfare.\n\"(Ground-based kamikaze drones) are an important component of our defense strategy, as they can effectively perform tasks to defeat the enemy,\" Deputy Defense Minister Dmytro Klimenkov said.\nAccording to the ministry, the DPA also signed an agreement for the supply of ammunition.\nKyiv has the production capacity to produce more than 3 million drones a year, but requires financing from foreign partners, Deputy Strategic Industries Minister Hanna Hvozdiar said."}, {"id": "29a7c1be-03e5-4660-bf35-4353536856ec", "title": "First group of US - made F - 16 jets arrive in Ukraine , officials say", "date": "2024-08-01 17:15", "url": "https://www.militarytimes.com/global/2024/08/01/first-group-of-us-made-f-16-jets-arrive-in-ukraine-officials-say/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "BERLIN – Ukraine has received its first collection of F-16 combat jets, Lithuania’s foreign minister and several officials confirmed on Wednesday.\n“F-16s in Ukraine.\nThe Associated Press and Reuters cited unnamed U.S. and Ukrainian officials who confirmed the delivery of the first jets.\nPublicly, Ukraine and its supporters are keeping tight-lipped; a top advisor to Ukrainian President Volodymyr Zelenskyy said he would neither confirm nor deny that Ukraine has received F-16s, NPR reported on Thursday.\nU.S. President Joe Biden gave the go-ahead in August 2023 for F-16s to be sent to Ukraine, though the U.S. will not be providing any fighter jets directly."}, {"id": "6adda429-f3d7-4061-b82d-9840e30baab5", "title": "Brad Pitt and Angelina Jolie bitter  war of the rosé  legal wrangle over Chateau Miraval is due back in court today after major new twist in the ongoing dispute", "date": "2024-08-01 10:00", "url": "https://www.dailymail.co.uk/news/article-13697237/brad-pitt-angelina-jolie-war-chateau-miraval-court-major-twist.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Brad Pitt and Angelina Jolie's bitter legal battle over Chateau Miraval is due back in court today after Jolie's side filed a new motion in court.\nJolie's former company Nouvel LLC - a subsidiary of Shefler's Tenute del Mondo B.V. - filed a motion to compel Campari America LLC to produce an agreement about wine distribution with Chateau Miraval.\nDaughter Shiloh is embroiled in her own legal battle, as she is trying to drop Pitt from her last name of Jolie-Pitt.\nPitt says in his complaint that the transaction to Russian oligarch Shefler harms the brand of Chateau Miraval after the Russian invasion of Ukraine in 2022.\nRecent documents filed on behalf of Pitt in objection to Jolie's latest request list the pieces of evidence she would obtain."}, {"id": "78c30f31-ff0b-453d-bf05-81bba750b631", "title": "The Two Times a Year I Fly My Flag", "date": "2024-08-01 13:15", "url": "https://ricochet.com/1679242/the-two-times-a-year-i-fly-my-flag/", "domain": "ricochet.com", "domain_classification": "Unknown", "message": "Actually, I fly my flag more than two times a year.\nTwo times a year I do fly my flag for Poland.\nI fly it for Polish Jews on April 19th for the Jewish Ghetto Uprising in Warsaw, and then again on August 1st for the Polish Home Army, Warsaw Uprising.\nIt occurred in the summer of 1944, and it was led by the Polish resistance Home Army (Polish: Armia Krajowa).\nToday is August 1st, and it is the 80th anniversary of the Warsaw Uprising and my flag will be out for Poland."}, {"id": "723ccd84-e45b-424f-ab86-5ffba3994596", "title": "IDF soldiers :  We want to carry out assignments , but also to see home again  ", "date": "2024-08-01 08:45", "url": "http://www.israelnationalnews.com/news/393909", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "As the war approaches its tenth month, IDF soldiers continue to report serious flaws in the equipment they are being issued.\nOther soldiers have circulated images of visibly worn or damaged protective gear they have been issued for their assignments, claiming that the IDF is endangering them by sending them to operational assignments in such gear.\nThe IDF has insisted that all soldiers have been issued sufficient equipment for their assignments.\nSome things are being done that border on criminal or endanger the forces.”An open letter circulated by combat soldiers claimed that this too was the failing of the IDF leadership.\nThe IDF was not prepared to equip these reserve soldiers."}, {"id": "04a6b19e-81d2-4938-a66d-5e115d17dd9c", "title": "IDF soldiers :  We want to carry out assignments , but also to see home again  ", "date": "2024-08-01 07:45", "url": "https://www.israelnationalnews.com/news/393909", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "As the war approaches its tenth month, IDF soldiers continue to report serious flaws in the equipment they are being issued.\nOther soldiers have circulated images of visibly worn or damaged protective gear they have been issued for their assignments, claiming that the IDF is endangering them by sending them to operational assignments in such gear.\nThe IDF has insisted that all soldiers have been issued sufficient equipment for their assignments.\nSome things are being done that border on criminal or endanger the forces.”An open letter circulated by combat soldiers claimed that this too was the failing of the IDF leadership.\nThe IDF was not prepared to equip these reserve soldiers."}, {"id": "c71ac127-be17-4000-a773-43857c7f78f7", "title": "Russia vs Ukraine : the biggest war of the fake news era", "date": "2024-08-01 04:45", "url": "https://www.euractiv.com/section/global-europe/news/russia-vs-ukraine-the-biggest-war-of-the-fake-news-era/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Disinformation and propaganda, long mainstays of war, have been digitally supercharged in the battle for Ukraine, the biggest conflict the world has seen since the advent of smartphones and social media.\nMoscow has accused Ukraine and the West of unleashing a sophisticated information war against Russia, using the West’s major media, public relations and technology assets to sow false and biased narratives about Russia and the war.\nKovalenko said that at present, the most significant sources of online Russian disinformation were TikTok in Ukraine and Telegram in Europe.\n“This activity is notably very tactical,” said John Hultquist, chief analyst at U.S. cybersecurity firm Mandiant, referring to Russian disinformation campaigns in Ukraine.\nOsavul, a Ukrainian disinformation tracking company, showed Reuters its data for this campaign, which it called “black winter”."}, {"id": "d82e95c3-f8e9-4385-9742-26e37e2c4943", "title": "F - 16s have arrived to help Ukraine fight Russia . Here what to know about their possible impact", "date": "2024-08-01 07:30", "url": "https://www.yahoo.com/news/f-16s-arrived-help-ukraine-065131320.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "F-16s have arrived to help Ukraine fight Russia.\nHere’s what to know about their possible impactUkrainian President Volodymyr Zelenskyy, left, and Denmark's Prime Minister Mette Frederiksen sit in a F-16 fighter jet at Skrydstrup Airbase, in Vojens, Denmark, Sunday, Aug. 20, 2023.\nWestern countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.\nHere's what to know:What can F-16s bring to the Ukrainian war effort?\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes."}, {"id": "33ee52ac-8788-49a4-b046-904dc7f45cec", "title": "F - 16s have arrived to help Ukraine fight Russia . Here what to know about their possible impact", "date": "2024-08-01 12:45", "url": "https://www.dailyherald.com/20240801/nation-and-world-politics/f-16s-have-arrived-to-help-ukraine-fight-russia-heres-what-to-know-about-their-possible-impact/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.\nHere's what to know:What can F-16s bring to the Ukrainian war effort?\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes."}, {"id": "90ac5947-ca79-4697-9e02-fe0b03c991bd", "title": "First long - awaited F - 16 fighter jet supplied by West flying in Ukraine skies - World News", "date": "2024-08-01 08:45", "url": "https://www.mirror.co.uk/news/world-news/first-long-awaited-f-16-33371918", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "On Wednesday Kyiv received the first batch of fourth-generation US-made war planes following two years of delay, according to an Odesa war news outlet.\nUkraine hopes that the F-16s - long demanded by Volodymyr Zelensky - will strengthen his defences despite their small number.\n\"Western partners delivered the planes, as agreed, at the end of July,” said Oleksiy Sukhoi, a military columnist for Dumska.\nIt is unclear if the F-16s can be immediately used in the war or whether further training is involved inside Ukraine.\nThe U.S., under President Joe Biden, has been the most important supporter of Ukraine’s more than two-year battle against invading Russian forces."}, {"id": "d9dbce83-f1be-4329-b455-1ac70afe082d", "title": "SteamWorld Heist 2 Review | GamesRadar+", "date": "2024-08-01 15:00", "url": "https://www.gamesradar.com/games/strategy/steamworld-heist-2-review/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "SteamWorld Heist 2 sits firmly in the center of the Venn diagram of XCOM players and hat fanciers.\nBlending styles(Image credit: Thunderful)Fast Facts Release date: August 8, 2024Platform(s): PC, PS5, PS4, Switch, Xbox Series X, Xbox OneDeveloper: Thunderful DevelopmentPublisher: Thunderful PublishingWhile SteamWorld Heist 2 is sillier than the po-faced sci-fi of XCOM and Phoenix Point, its mechanics are no less serious.\nEvery enemy in SteamWorld Heist 2, from the lowliest petty officer to the fleet admiral, goes into battle wearing headwear befitting their rank.\nOne weakness of this generous class system, however, is how comparatively stingy SteamWorld Heist 2 is in awarding experience points.\nThe systems underneath keep SteamWorld Heist 2 engaging, as do the bonus objectives that push you to take risks within a mission."}, {"id": "7d065215-cbb3-412c-bbd0-38295ceaf645", "title": "Hezbollah chief says response against Israel  inevitable  ", "date": "2024-08-01 18:30", "url": "https://www.al-monitor.com/originals/2024/08/hezbollah-chief-says-response-against-israel-inevitable", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Hezbollah chief Hassan Nasrallah warned Thursday that the group was bound to respond to Israel's killing of its top military commander, saying his death and that of the Hamas leader \"crossed\" red lines.\n\"The enemy, and those who are behind the enemy, must await our inevitable response,\" he said in a speech broadcast at the funeral of Hezbollah military commander Fuad Shukr.\nNasrallah warned the group will deliver \"a real response, not a symbolic\" one.\nIt also blamed him for carrying out a weekend rocket attack on the Israeli-annexed Golan Heights that killed 12 children, which Hezbollah denies.\n\"What happened in the suburb was an aggression, not just an assassination,\" Nasrallah said, insisting Israel targeted \"a civilian building, not a military base\" and \"killed civilians\"."}, {"id": "febcbe7d-cc11-4d10-8648-93cc0a1212f5", "title": "Federal judge says New Jersey ban on AR - 15 rifles is unconstitutional", "date": "2024-08-01 15:00", "url": "https://www.cnn.com/2024/08/01/politics/federal-judge-says-new-jerseys-ban-on-ar-15-rifles-is-unconstitutional/", "domain": "cnn.com", "domain_classification": "International", "message": "Trenton, New Jersey AP —New Jersey’s ban on the AR-15 rifle is unconstitutional, but the state’s cap on magazines over 10 rounds passes constitutional muster, a federal judge said Tuesday.\n“Bans on so-called ‘assault weapons’ are immoral and unconstitutional.\nHe added: “We look forward to pressing our arguments on appeal.”Several challenges to state assault weapons bans have cited the Bruen decision.\nA gun rights group has challenged Connecticut’s landmark 2013 gun control law, passed after the Sandy Hook Elementary School shooting, that bans assault weapons, including certain AR-15-style rifles and large capacity magazines.\nThe state’s assault weapons ban dates to 1990 and includes various other weapons, but Sheridan focused on the Colt AR-15, citing the plaintiffs’ concentration on that weapon in their court filings, and the law specifying that make of the rifle."}, {"id": "2ef9ea93-c5ee-4cf5-86a2-39617361b9e0", "title": "Report Finds US Military Lacks Ability To Defeat China , Suggests Cold War Style Defense Spending", "date": "2024-08-01 03:15", "url": "https://www.zerohedge.com/political/report-finds-us-military-lacks-ability-defeat-china-suggests-cold-war-style-defense", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Eric Edelman, who serves as vice chair for the commission, told the Senate Armed Services Committee on Tuesday that China’s communist regime was outpacing the United States in military development.\nHe said that fact could increase the likelihood of a conflict between the two powers and the likelihood of the United States losing.\n“There is potential for a near-term war and a potential that we might lose such a conflict,” Mr. Edelman said.\n“If these trends continue, the PLA will be a peer, if not superior, military competitor of the United States across domains, a situation the United States has not faced since the height of the Cold War,” the report reads.\nIn order to achieve this, the report calls for increasing taxes to expand U.S. defense spending to Cold War levels, which it suggests fell between 4.9 and 16.9 percent of GDP."}, {"id": "d5f9223b-fb16-4feb-ad98-5e0a4dc813ed", "title": "Bangladesh bans  militant and terrorist  party following violent protests", "date": "2024-08-01 12:45", "url": "https://www.scmp.com/news/asia/south-asia/article/3272840/bangladesh-bans-militant-and-terrorist-party-following-violent-protests", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "In 2013, the High Court disqualified the party from elections, saying that its constitution violated the national constitution by opposing secularism.\nTen years later, the Supreme Court in 2023 upheld the High Court decision, sealing off the long legal battle and barring the party from taking part in elections or using party symbols.\n“We strongly condemn and protest the illegal, unauthorised, and unconstitutional decision … to ban Bangladesh Jamaat-e-Islami.\nOne political party or alliance cannot make decisions about another political party,” Rahman said.\nIf a trend of banning one party by another party or alliance begins, it will lead to chaos and the collapse of state order,” he said."}, {"id": "500e9966-f72c-4b70-af09-1ba57a526316", "title": "Federal judge says New Jersey ban on AR - 15 rifles is unconstitutional", "date": "2024-08-01 03:15", "url": "https://www.pennlive.com/nation-world/2024/08/federal-judge-says-new-jerseys-ban-on-ar-15-rifles-is-unconstitutional.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "By Mike Catalini, The Associated PressTRENTON, N.J. — New Jersey’s ban on the AR-15 rifle is unconstitutional, but the state’s cap on magazines over 10 rounds passes constitutional muster, a federal judge said Tuesday.\n“Bans on so-called ‘assault weapons’ are immoral and unconstitutional.\nHe added: “We look forward to pressing our arguments on appeal.”Several challenges to state assault weapons bans have cited the Bruen decision.\nA gun rights group has challenged Connecticut’s landmark 2013 gun control law, passed after the Sandy Hook Elementary School shooting, that bans assault weapons, including certain AR-15-style rifles and large capacity magazines.\nThe state’s assault weapons ban dates to 1990 and includes various other weapons, but Sheridan focused on the Colt AR-15, citing the plaintiffs’ concentration on that weapon in their court filings, and the law specifying that make of the rifle."}, {"id": "fe910513-6faa-4e99-9baa-7203a58886d6", "title": "F - 16s have arrived to help Ukraine fight Russia . Here what to know about their possible impact", "date": "2024-08-01 13:15", "url": "https://economictimes.indiatimes.com/news/defence/f-16s-have-arrived-to-help-ukraine-fight-russia-heres-what-to-know-about-their-possible-impact/articleshow/112198553.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "They might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nThat prompted a harsh response from Putin, who warned that any Western air base hosting the Ukrainian fighter jets would be a \"legitimate target\" for the Kremlin's forces.U.S.\n\"With the acquisition of F-16 aircraft, we will be able to solve a number of problems that are currently hurting Ukraine.\n\"We are talking about receiving F-16 aircraft, in my opinion, this will significantly help Ukraine to cope with the Russian aggression that is taking place now.\""}, {"id": "782af40f-a147-4835-8dbf-9a8f5c3a97e1", "title": "Lt Gen Sadhna Saxena Nair : Breaking Barriers in Military Medicine", "date": "2024-08-01 08:30", "url": "https://www.devdiscourse.com/article/entertainment/3037996-lt-gen-sadhna-saxena-nair-breaking-barriers-in-military-medicine", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Lt Gen Sadhna Saxena Nair set a historical milestone on Thursday as she became the first woman to be appointed Director General of Medical Services (Army).\nGraduating with distinction from the Armed Forces Medical College, Pune, Lt Gen Nair entered the Army Medical Corps in December 1985.\nLt Gen Nair holds multiple qualifications, including a post-graduate degree in family medicine, diplomas in maternal and child health, healthcare management, and advanced training in medical informatics from AIIMS, New Delhi.\nHer training extends to chemical, biological, radiological, and nuclear warfare in collaboration with the Israeli Defence Forces, and medical ethics with the Swiss Armed Forces.\nAdditionally, she has served as the first woman Principal Medical Officer of both the Western Air Command and the Training Command of the Indian Air Force."}, {"id": "73312c7e-9db1-4426-80b7-8e1d501ff3c4", "title": "Russia vs Ukraine : The biggest war of the fake news era", "date": "2024-08-01 02:45", "url": "https://www.asiaone.com/world/russia-vs-ukraine-biggest-war-fake-news-era", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Disinformation and propaganda, long mainstays of war, have been digitally supercharged in the battle for Ukraine, the biggest conflict the world has seen since the advent of smartphones and social media.\nThe Ukrainian security official acknowledged his country used online campaigns in an attempt to boost anti-war sentiment among Russia's population.\nThey controlled a collective three million social media accounts with an estimated audience reach of 12 million people.\nKovalenko said at present, the most significant sources of online Russian disinformation are TikTok in Ukraine and Telegram in Europe.\nOsavul, a Ukrainian disinformation tracking company, showed Reuters its data for this campaign, which it called \"black winter\"."}, {"id": "7b78e487-d008-4e70-9447-892c5f6e84af", "title": "Sins of a Solar Empire II will launch on Steam on August 15 with new features", "date": "2024-08-01 17:15", "url": "https://www.neowin.net/news/sins-of-a-solar-empire-ii-will-launch-on-steam-on-august-15-with-new-features/", "domain": "neowin.net", "domain_classification": "Unknown", "message": "Here’s how it worksIn May, developer Ironclad Games and publisher Stardock announced that its space strategy game sequel, Sins of a Solar Empire II, would make its debut on Valve's Steam service later this summer.\nToday, it was revealed that the actual launch date for the game on Steam will be two weeks from today, on Thursday, August 15.\nThe game has been available on the Epic Games Store as an Early Access title since October 2022.\nThere will also be a Sins of a Solar Empire II - Premium Edition that will be priced at a discount of $79.99 for August 15.\nIn addition to the base game, it will add its digital soundtrack and its first Content Pass post-launch."}, {"id": "49d164af-a07a-472a-91c9-0fb1c44bb19b", "title": "Who was Hamas political leader Ismail Haniyeh ? ", "date": "2024-08-01 00:30", "url": "https://gazette.com/news/wex/who-was-hamas-political-leader-ismail-haniyeh/article_ac523b9e-1f17-5960-8c79-752bf9a712de.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Hamas’s top political leader, Ismail Haniyeh, was killed in Iran on Wednesday, Iran and the Palestinian militant group said.\nHere’s what to know about Hamas’s political chief.\nHamas leadershipIn 1997, Haniyeh became the assistant to Hamas co-founder Ahmed Yassin.\nHe led Hamas in Gaza until 2017, when he was elected to lead Hamas’s political bureau.\nHaniyeh traveled internationally as the public face of Hamas and worked to negotiate a ceasefire in Gaza."}, {"id": "043896d6-3fdd-4e08-8241-31ae9c49c53c", "title": "What to know about the F - 16s in Ukraine to help fight Russia – NBC4 Washington", "date": "2024-08-01 10:15", "url": "https://www.nbcwashington.com/news/national-international/f-16s-arrived-to-help-ukraine-fight-russia/3681205/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington confirmed to The Associated Press.\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes.\nHow will Ukraine protect the F-16s?"}, {"id": "af0de947-6919-48dd-a825-29fd517c3140", "title": "F - 16s Have Arrived To Help Ukraine Fight Russia . Here What To Know About Their Possible Impact – The Yeshiva World", "date": "2024-08-01 19:00", "url": "https://www.theyeshivaworld.com/news/general/2301803/f-16s-have-arrived-to-help-ukraine-fight-russia-heres-what-to-know-about-their-possible-impact.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes.\nHow will Ukraine protect the F-16s?"}, {"id": "64dd2cc1-602e-4a9f-ad6b-4826bb6b9035", "title": "What to know about the F - 16s in Ukraine to help fight Russia – NBC Los Angeles", "date": "2024-08-01 08:15", "url": "https://www.nbclosangeles.com/news/national-international/f-16s-arrived-to-help-ukraine-fight-russia/3475248/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington confirmed to The Associated Press.\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes.\nHow will Ukraine protect the F-16s?"}, {"id": "14192828-6e90-4557-b63a-d909236a8768", "title": "German president asks Warsaw Uprising veterans for  forgiveness  ", "date": "2024-08-01 00:15", "url": "https://www.digitaljournal.com/world/german-president-asks-warsaw-uprising-veterans-for-forgiveness/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Steinmeier spoke of the German government's plans to establish a memorial in Berlin to the Polish victims of the Nazis - Copyright AFP Sergei GAPONGerman President Frank-Walter Steinmeier on Wednesday met with Warsaw Uprising veterans and asked for their “forgiveness” during a visit to Poland on the eve of the revolt’s 80th anniversary.\nThe armed insurgency against occupying Nazi German forces broke out on August 1, 1944 and lasted for two months before it was crushed.\nAccording to the Warsaw Rising Museum established to commemorate the insurrection, only around 400 former fighters are still alive.\nDuring his Warsaw visit, Steinmeier spoke of the German government’s plans to establish a memorial in Berlin to the Polish victims of the Nazis.\nRussian President Vladimir Putin “is seeking to destroy Ukraine and he is threatening us all”, Steinmeier said, vowing to continue support for Ukraine and its people."}, {"id": "efde3704-f81e-4dd1-951b-42ab401c8795", "title": "ADA - 01B ADLER by Megalith ( Addon Aircraft ) - Ace Combat 7 : Skies Unknown", "date": "2024-08-01 03:00", "url": "https://www.moddb.com/games/ace-combat-7/addons/ada-01b-adler-addon-aircraft", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Thank you so much for your great efforts on the Ace Combat community, you will never be forgotten.\nThis mod contains 2 modules (Of course, not compatible with Multiplayer):ADA-01BMPBMMGP4AGMThis module contains a loadout similar to the infinity variant.\nADA-01ASDBMMGPMSTMThis module contains my own theorical take on the supposed A variant of Adler, explained in the Aces at War book.\nCherry & ElectronicOldMen#8207 = Weaponry help, thank you OldMen for finding the perfect weapon to make the A Variant MGP possible!\nThe standalone pak is supposed to work by itself, so the base & module mods aren't needed."}, {"id": "1382a16a-8c9c-4681-b8f4-10b0510a427c", "title": "A Deadly Houthi Attack on Tel Aviv Is Forcing Israel to Rethink Its Drone Defenses", "date": "2024-08-01 00:15", "url": "https://www.businessinsider.com/deadly-houthi-attack-tel-aviv-forces-israel-rethink-drone-defenses-2024-7", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewThe Houthis' unprecedented July 19 drone attack against Tel Aviv from Yemen caught Israelis by surprise, piercing the country's battle-tested defenses and exposing vulnerabilities that the Yemen-based rebels were ready and willing to exploit.\n\"This confirms that technology alone, even for one of the most advanced air defense systems in the world, is not enough to provide effective protection,\" Borsari said.\n\"Firstly, the advanced Houthi drone was launched for the first time, following an atypical flight path that likely caught the Israelis off guard,\" Khoueiry told BI.\nHouthi Media Center via Getty Images'A more cunning approach'Following the deadly attack, the Israeli military promptly increased air patrols to protect Israeli airspace.\n\"This means integrating low-tier air defense capabilities at scale, combining different types of effectors with an eye on cost-effectiveness,\" Borsari said."}, {"id": "94b8de0b-0b78-4422-8257-d4379b381fe6", "title": "Netanyahu demands Hama unconditional surrender for Gaza peace", "date": "2024-08-01 03:15", "url": "https://www.jpost.com/opinion/article-812766", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "‘Victory.” Prime Minister Benjamin Netanyahu used the word 10 times in his speech to a joint session of Congress last week.\n“The war in Gaza could end tomorrow if Hamas surrenders, disarms, and returns all the hostages.\nIn his discussion of the need for “total victory” and for a program of deradicalization for Gaza, Netanyahu failed to point out the critical causal relationship between the two concepts.\nImmoral because ending a war against an evil enemy before achieving total victory denies the opportunity for positive societal change that only utter defeat can bring.\nThat future depends on total victory."}, {"id": "f2c03df0-8313-417d-aa78-3eec3d6bdea4", "title": "Moshe Rabbeinu ultimate  mesirut nefesh  ", "date": "2024-08-01 08:45", "url": "http://www.israelnationalnews.com/news/393951", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "He therefore said to Moshe :’Take vengeance for Bnei Israel against the Midianires; afterwards you will be gathered unto your people’.\n‘It was therefore not possible for Bnei Israel to enter the Land, while these harmful forces prevailed there, lest they be influenced by them.\n‘Only when these transgressors were vanquished, could Bnei Israel be permitted to enter the Land.\n‘Edom and Egypt ‘only’ sought to kill Bnei Israel by the sword, and we are therefore commanded not to hate them, should they convert.\n‘Therefore, it was necessary for Moshe to now atone, by zealotry for Hashem, against the Midianites, for causing Bnei Israel to sin."}, {"id": "3926e6c3-e0e8-41f1-ad21-8c490fab9045", "title": "Moshe Rabbeinu ultimate  mesirut nefesh  ", "date": "2024-08-01 07:45", "url": "https://www.israelnationalnews.com/news/393951", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "He therefore said to Moshe :’Take vengeance for Bnei Israel against the Midianires; afterwards you will be gathered unto your people’.\n‘It was therefore not possible for Bnei Israel to enter the Land, while these harmful forces prevailed there, lest they be influenced by them.\n‘Only when these transgressors were vanquished, could Bnei Israel be permitted to enter the Land.\n‘Edom and Egypt ‘only’ sought to kill Bnei Israel by the sword, and we are therefore commanded not to hate them, should they convert.\n‘Therefore, it was necessary for Moshe to now atone, by zealotry for Hashem, against the Midianites, for causing Bnei Israel to sin."}, {"id": "001fa1a3-f75e-4260-98e7-bb9f80706f73", "title": "F - 16s have arrived to help Ukraine fight Russia . Here what to know about their possible impact", "date": "2024-08-01 07:45", "url": "https://isp.netscape.com/news/world/story/0001/20240801/224d96ff2ad4f416d3969676a55876e2", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "F-16s have arrived to help Ukraine fight Russia.\nWestern countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.\nHere's what to know:What can F-16s bring to the Ukrainian war effort?\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes."}, {"id": "05dbafa5-d9ad-4e08-9a99-4e4806f23b88", "title": "Cranbrook , the world , and the infernal August of 1914", "date": "2024-08-01 19:00", "url": "https://www.cranbrooktownsman.com/home/cranbrook-the-world-and-the-infernal-august-of-1914-7461391", "domain": "cranbrooktownsman.com", "domain_classification": "Unknown", "message": "“The World Convulsed” was the headline stretching across the front page of the Cranbrook Herald, on Thursday, August 6, 1914Cranbrook's first contingent of recruits, on the steps of the Cranbrook Court House, August, 1914.\n(Cranbrook Historical Archives 1976-063-004)1 / 1 Cranbrook's first contingent of recruits, on the steps of the Cranbrook Court House, August, 1914.\n(Cranbrook Historical Archives 1976-063-004) Advertisement“The World Convulsed” was the banner headline stretching across the top of the front page of the Cranbrook Herald, on Thursday, August 6, 1914.\n* * *In 1914, the Cranbrook Herald, along with its rival the Cranbrook Prospector, was going through difficult times, made even more so by the advent of the war.\nThe front page of the August 13, 1914, Cranbrook Herald also included this letter to the editor, from A.E."}, {"id": "9a22a6c9-8dc1-4d7c-8bb6-e425c4a39b42", "title": "F - 16 Viper - Ukraine Multi - Role combat [ BCV ] aircraft", "date": "2024-08-01 00:45", "url": "https://www.globalsecurity.org/military/world/ukraine/ua-f-16.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Ukraine - F-16 Multi-Role Combat [BCV] aircraftThe first delivery of F-16 fighter jets from NATO allies arrived in Ukraine 31 July 2024, according to people familiar with the matter.\nPart of the Western F-16 aircraft , which Ukraine will receive from the allies, will be located at foreign air bases.\nDenmark, Norway, the Netherlands and Belgium plan to send more than 60 American-made F-16 aircraft to Kyiv this summer.\nThe Netherlands will make at least 18 F-16 fighter aircraft available to Ukraine.\nIgnat said that as part of assistance with fighter jets, Ukraine is initially expecting the delivery of 24 Western-style aircraft."}, {"id": "4e07e3b4-0df6-4cff-9023-5e2434531868", "title": "New Jersey ban on AR - 15 rifles  unconstitutional  judge says – NBC New York", "date": "2024-08-01 05:45", "url": "https://www.nbcnewyork.com/news/national-international/new-jerseys-ban-on-ar-15-rifles-is-unconstitutional-federal-judge-says/5656036/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "New Jersey's ban on the AR-15 rifle is unconstitutional, but the state's cap on magazines over 10 rounds passes constitutional muster, a federal judge said Tuesday.\n\"Bans on so-called ‘assault weapons’ are immoral and unconstitutional.\nHe added: \"We look forward to pressing our arguments on appeal.”Several challenges to state assault weapons bans have cited the Bruen decision.\nThe state’s assault weapons ban dates to 1990 and includes various other weapons, but Sheridan focused on the Colt AR-15, citing the plaintiffs’ concentration on that weapon in their court filings, and the law specifying that make of the rifle.\nThe Supreme Court ruled 8-1 on Friday to uphold a federal law that bans people under domestic violence restraining orders from owning guns."}, {"id": "2495e77e-c598-4976-ae0c-982dd25ebccf", "title": "Will Diljit Dosanjh join the Border 2 team ? Here is what we know | Hindi Movie News", "date": "2024-08-01 08:45", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/will-diljit-dosanjh-join-the-border-2-team-here-is-what-we-know/articleshow/112190198.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Diljit Dosanjh's personal life under spotlight: Claims of marriage and fatherhood surfaceBorder 2 seems to be getting bigger by the day.\nAfter Sunny Deol, now the buzz is that Diljit Dosanjh is likely to join the team.A source close to the production told us, \"The makers are in talks with the actor and we will know soon.\nOn the occasion, Sunny Deol delighted all by taking to his social media to announce the cult classic's sequel.\nAnnouncing the same, he wrote, \"Ek fauji apne 27 saal purane waade ko pura karne, aa raha hai phirse.\nThe battle of Longewala was fought not just by our Indian army but also by the Navy and the Air Force, and the story of 'Border 2 will recap events from the perspectives of all three wings of the Indian Armed Forces.\""}, {"id": "9aa839b4-f834-4893-855f-f89bbe8a85ad", "title": "HSBC boss exits on a high after his Hong Kong bet pays off , says ALEX BRUMMER", "date": "2024-08-01 00:30", "url": "https://www.dailymail.co.uk/money/comment/article-13694705/HSBC-boss-exits-high-Hong-Kong-bet-pays-says-ALEX-BRUMMER.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Noel Quinn’s stewardship of Britain’s biggest bank, HSBC, has been remark-ably brief.\nAs Quinn noted when presenting his last set of results as chief executive, the bank has prospered in the region for 158 years.\nAsia focus: Noel Quinn opted to double down on HSBC's historic Hong Kong base in spite of Beijing’s crackdown on political and economic freedoms in the territoryQuinn has narrowed his bank’s mandate by concentrating on Hong Kong, China and Britain.\nThe bonanza that HSBC and other banks have received from higher interest rates is starting to dissipate.\nIn spite of an exodus of entrepreneurs from Hong Kong and other financial centres, HSBC continues to harvest new retail accounts in its backyard."}, {"id": "f928b0f2-8161-4be3-b557-b286a6fdb064", "title": "Iranians mourn Hamas leader Haniyeh assassination", "date": "2024-08-01 08:45", "url": "https://www.yahoo.com/news/iranians-mourn-hamas-leader-haniyehs-082811952.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iran, its proxies will meet to discuss retaliation against Israel, say sourcesBy Parisa Hafezi, Ahmed Rasheed and Laila BassamDUBAI (Reuters) -Top Iranian officials will meet the representatives of Iran's regional allies from Lebanon, Iraq and Yemen on Thursday to discuss potential retaliation against Israel after the killing of the Hamas leader in Tehran, five sources told Reuters.\nAnother Iranian official said Supreme leader Ayatollah Ali Khamenei and senior members of Iran's elite Revolutionary Guards will attend.\nIran and Hamas have accused Israel of carrying out the strike that killed Haniyeh hours after he attended the inauguration of Iran's new president in Tehran on Wednesday.\nVowing to retaliate, Iran said the U.S. bore responsibility because of its support for Israel.\n\"All fronts of the resistance will take revenge for Haniyeh's blood,\" Ali Akbar Ahmadian, the secretary of Iran's Supreme National Security Council, told Iran's semi-official Mehr news agency."}, {"id": "9a5c18e9-1115-4845-b2c0-216ef17ae946", "title": "Naval chief says rising cost spurred amphib production pause", "date": "2024-08-01 00:45", "url": "https://www.defensenews.com/naval/2023/03/15/naval-chief-says-rising-cost-cost-spurred-amphib-production-pause/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "WASHINGTON — The U.S. Navy says the rising cost of the San Antonio-class amphibious warship program is justifying the service’s decision to indefinitely pause the program.\nChief of Naval Operations Adm. Mike Gilday said Wednesday the production line at HII’s Ingalls Shipbuilding in Mississippi is running behind and the price tag is rising.\n“The cost of that ship has gone from $1.47 billion, to the second ship at $1.5 [billion].\nGen. David Berger told reporters the Flight I San Antonio ship cost $2 billion.\nShe has covered military news since 2009, with a focus on U.S. Navy and Marine Corps operations, acquisition programs and budgets."}, {"id": "a90ec3c2-ac97-4873-b1ed-4a6723f4b48e", "title": "Serious doubts whether there are real prospects for peace and security in the world today", "date": "2024-08-01 06:30", "url": "https://www.stabroeknews.com/2024/08/01/opinion/letters/serious-doubts-whether-there-are-real-prospects-for-peace-and-security-in-the-world-today/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "Dear Editor,According to the Russian authorities, one of the reasons why the war was launched against Ukraine was because of ‘the rise of fascism in Ukraine’.\nThat view is reinforced by the rise of extreme right wing, ultra-nationalist and pro-fascist political forces principally in the industrialized nations.\nGiven the maximalist objectives all around, it is almost impossible in current circumstances to reach a lasting and mutually acceptable peace arrangement.\nSome of these forces, while not in government, either remain a major political force or are gaining ground electorally.\nThus the serious doubts in the political, diplomatic and military circles whether there are real prospects for peace and security in the world today in the light of the emergence of a geographic spread of pro-democracy forces versus the emergence of pro-fascist, militaristic and ultra-right political forces who appear to be gaining ascendance in the world today."}, {"id": "d9357850-1ac0-4e59-ba49-ac2fd93296a2", "title": "AEW Dynamite Live Coverage 7 / 31 - CMLL World Women Title Eliminator Match , Darby Allin Vs . Adam Page & More", "date": "2024-08-01 00:15", "url": "https://www.wrestlinginc.com/1633361/aew-dynamite-july-31-cmll-world-womens-title-eliminator-match-darby-allin-adam-page-more/", "domain": "wrestlinginc.com", "domain_classification": "Unknown", "message": "Danielson says he set out to do two things in AEW when he arrived: kick people's head's in and become AEW World Champion.\nHe says now is his time rather than Danielson, and says unlike Danielson, he was successful in winning the AEW World Championship like he said he would.\nHe questions if Danielson's body can handle being AEW World Champion, then promises to Danielson that he is the most dangerous man in AEW and will walk out of All In holding his title.\nHe says when he's done with Danielson, Danielson won't be able to walk.\nHe says he will never wrestle again if he doesn't win the AEW World Championship at All In, then ups the stakes on August 25 and throws out the challenge of Title vs. Career."}, {"id": "25eabbcb-e8d1-408a-b22a-88823b91d441", "title": "Powell puts September rate cut on table after Fed leaves borrowing costs unchanged", "date": "2024-08-01 01:00", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_379752.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Powell's remarks at his press conference following the end of the Fed's latest two-day policy meeting appeared as an affirmation of a coming pivot in September that was partly reflected in the central bank's new policy statement.\n\"Listening to him speak, it's clear they're all locked and loaded for September rate cut and they're going to maintain their optionality,\" said Mark Malek, chief investment officer at SiebertNXT.\nBut he added that as Fed officials have been gaining confidence that price pressures are moderating, \"the economy is moving closer to the point where it will be appropriate to reduce our policy rate.\"\nThe Fed did not commit in its statement to a rate cut in September, and repeated that policymakers still need \"greater confidence that inflation is moving sustainably toward 2 percent\" before lowering borrowing costs.\nThe new policy statement was approved unanimously."}, {"id": "9cd78b62-f020-40c3-860b-9758319b8fde", "title": "German President Asks Warsaw Uprising Veterans for  Forgiveness  ", "date": "2024-08-01 15:30", "url": "https://www.kyivpost.com/post/36708", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "German President Frank-Walter Steinmeier on Wednesday met with Warsaw Uprising veterans and asked for their \"forgiveness\" during a visit to Poland on the eve of the revolt's 80th anniversary.\nThe armed insurgency against occupying Nazi German forces broke out on August 1, 1944 and lasted for two months before it was crushed.\nI ask, here and now, for forgiveness,\" Steinmeier said addressing the veterans gathered at the Warsaw square that saw one of the uprising's first battles.\nDuring his Warsaw visit, Steinmeier spoke of the German government's plans to establish a memorial in Berlin to the Polish victims of the Nazis.\nRussian President Vladimir Putin \"is seeking to destroy Ukraine and he is threatening us all\", Steinmeier said, vowing to continue support for Ukraine and its people."}, {"id": "dd82e376-66ab-4819-b02e-07c259279145", "title": "Lt Gen Sadhna Saxena Nair makes history as first woman director general of Indian Army medical services | Pragativadi | Odisha News , Breaking News Odisha , Latest Odisha News", "date": "2024-08-01 06:30", "url": "https://pragativadi.com/lt-gen-sadhna-saxena-nair-makes-history-as-first-woman-director-general-of-indian-armys-medical-services/", "domain": "pragativadi.com", "domain_classification": "Unknown", "message": "New Delhi: Lieutenant General Sadhna Saxena Nair on Thursday took over as the Director General Medical Services (Army), becoming the first woman to be appointed to the top position, the army announced.\nShe was earlier the first woman doctor to be appointed Director General Hospital Services (Armed Forces).\nShe graduated from the Armed Forces Medical College, Pune with a distinguished academic record and was commissioned into the Army Medical Corps in December 1985, the army statement said.\nShe trained in CBRN (chemical, biological, radiological and nuclear) warfare with the Israeli Defence Forces and in military medical ethics with the Swiss Armed Forces, the statement added.\nTo be sure, military doctors can be posted from one service to another and don the rank the service."}, {"id": "0c88dd01-4355-4aa5-9380-943d59fc93cd", "title": "With Hezbollah And Hamas Assassinations , Netanyahu Shows Willingness To Risk Regional War For Political Survival", "date": "2024-08-01 10:00", "url": "https://menafn.com/1108503524/With-Hezbollah-And-Hamas-Assassinations-Netanyahu-Shows-Willingness-To-Risk-Regional-War-For-Political-Survival", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Palestinians in the occupied West Bank mourn the death of militant Hamas political leader Ismail Haniyeh on July 31, 2024.\nMosab Shawer/AFP via Getty Images)Palestinians in the occupied West Bank mourn the death of militant Hamas political leader Ismail Haniyeh on July 31, 2024.\nAs a scholar of Lebanon and Israel , I have followed the recent events in the region with growing concern.\nThe killings likely also make the war of attrition between Israel and Hezbollah more volatile and riskier.\nHis decision to authorize the assassinations in Beirut and Iran should be understood in the context of his fight for his political survival."}, {"id": "67281a5b-8fe3-47f8-992a-1706cb6cc11d", "title": "Hezbollah chief says war with Israel in  new phase , vows  real response  to Shukr killing", "date": "2024-08-01 18:00", "url": "https://www.al-monitor.com/originals/2024/08/hezbollah-chief-says-war-israel-new-phase-vows-real-response-shukrs-killing", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "BEIRUT — Hezbollah chief Hassan Nasrallah vowed an imminent response Thursday to the killing of one of the group’s commanders in an Israeli strike earlier this week.\nNasrallah, visibly angry in the speech, said the conflict with Israel has entered a new phase.\n\"We are looking for a real response, not an official response as promoted, but a very considerate response,\" Nasrallah added.\nIsrael accused Hezbollah of carrying out the attack, which the group immediately denied.\nThe region has been on edge since the Majdal Shams attack and the Israeli strikes, fearing a wider regional war."}, {"id": "4a826b0e-115e-487a-ab8e-97dfeb274bee", "title": "Ismail Haniyeh , Hama international face , was marked for death by Israel over the Oct . 7 attack", "date": "2024-08-01 01:00", "url": "https://www.gjsentinel.com/news/world/ismail-haniyeh-hamas-international-face-was-marked-for-death-by-israel-over-the-oct-7/article_5ecd3bfc-25a4-5299-9a06-c5c4c47c70b4.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "In this photo released by the Iranian Presidency Office, President Masoud Pezeshkian, right, shakes hands with Hamas chief Ismail Haniyeh at the start of their meeting at the President's office in Tehran, Iran, Tuesday, July 30, 2024."}, {"id": "bd4ba05d-fbc2-4c2c-ac3e-6703d068378b", "title": "The foreign heroes of the Warsaw Uprising : How British pilot , Irish nurse and Nigerian musician fought with Polish insurgents against the Nazis 80 years ago - but rebellion failed and left 180 , 000 civilians dead", "date": "2024-08-01 07:30", "url": "https://www.dailymail.co.uk/news/article-13684983/Warsaw-Uprising-British-Nigerian-Polish-Nazis.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The Warsaw Uprising, which broke out exactly 80 years ago today, was the largest and most savage insurgency against Nazi occupation ever seen.\nOne of them was Birmingham RAF pilot John Ward, who had been shot down over France and then imprisoned in a prisoner of war camp in occupied Poland.\nThe couple joined the Polish resistance movement known as the Home Army (AK)After escaping from the POW camp he was in, Ward joined the Polish resistance movement known as the Home Army (AK).\nAround 18,000 insurgents were killed another 25,000 were injured in the Warsaw Uprising.\nFemale members of the Polish resistance seen during the Warsaw Uprising of 1944."}, {"id": "becd8834-a091-4c35-ba8d-b08e96b52acf", "title": "Russia Launches Third Stage of Non - Strategic Nuclear Forces Drills", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/07/russia-240731-sputnik03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia Launches Third Stage of Non-Strategic Nuclear Forces DrillsSputnik News20240731MOSCOW (Sputnik) - Russia has launched the third stage of the non-strategic nuclear forces drills, the Defense Ministry said on Wednesday.\n\"In accordance with the decision of the President of the Russian Federation, the third stage of the strategic nuclear forces exercise has begun.\nDuring the exercise, the issues of training units of the Russian armed forces for the combat use of non-strategic nuclear weapons will be worked out,\" the statement read.\nThe drills are aimed at maintaining the readiness of the use of non-strategic nuclear weapons for combat missions, the ministry said.\n\"The current stage of the exercise is aimed at maintaining the readiness of personnel and equipment of units of combat use of non-strategic nuclear weapons of Russia to perform combat missions,\" the stateemnt read."}, {"id": "9790f8c8-bda6-47b9-a7f6-071379e87dc3", "title": "Media literacy training prepares Mindanao youth groups to fight disinformation", "date": "2024-08-01 08:15", "url": "https://www.rappler.com/philippines/mindanao/media-literacy-training-prepares-youth-groups-fight-disinformation/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "A group of young people from across Mindanao undergo a media and information literacy training from July 28 to July 31, 2024.\nParticipants busy themselves during a workshop organized as part of a media and information literacy training in Cagayan de Oro on Wednesday, July 31, 2024.\nDuring the workshops, the young media literacy advocates delved into various aspects of the Philippine media landscape.\nThey learned how to identify and combat disinformation, strategies for maintaining digital hygiene, and effective ways to disseminate their knowledge as media literacy trainers or social media content creators.\nMedia and information literacy training participants shows their certificates of completion after a four-day training in Cagayan de Oro."}, {"id": "5bcd1107-b304-47c5-8de0-1f321f4cee45", "title": "ESCTT chair : Invest more in culture , communities to combat crime - Trinidad and Tobago Newsday", "date": "2024-08-01 10:30", "url": "https://newsday.co.tt/2024/08/01/esctt-chair-invest-more-in-culture-communities-to-combat-crime/", "domain": "newsday.co.tt", "domain_classification": "Unknown", "message": "ESCTT chair: Invest more in culture, communities to combat crimeDrummers of the Malick Folk Performing Company perform during Rhythms and Voices Africa at the Lidj Yasu Omowale Village at the Queen’s Park Savannah, Port of Spain on July 30.\nProblems like white supremacy persisted despite emancipation, Wadada added.\n“We know crime takes place at all levels in our society.”However, Afro-descended people always had to fight, she said.\nBut it is not always for the well-being of the communities, in that deep, true and sincere way,” she said.\nWadada recommended that more of the country’s resources be invested in culture and communities."}, {"id": "d7440339-7778-483f-81af-a48c512fe359", "title": "Families Of Victims Disappointed As U . S . Reaches Plea Deals With  9 / 11 Mastermind , 2 Others", "date": "2024-08-01 04:00", "url": "https://www.oann.com/newsroom/families-of-victims-disappointed-as-u-s-reaches-plea-deals-with-9-11-mastermind-2-others/", "domain": "oann.com", "domain_classification": "Unknown", "message": "A fiery blasts rocks the World Trade Center after being hit by two planes September 11, 2001 in New York City.\nAccording to reports, the men pleaded guilty in exchange for life sentences, rather than their originally intended death sentences.\nNeedless to say, families of the victims were not pleased about the news of the plea deal.\nHe then went on to play a massive part in planning the attack, as he had trained some of the plane hijackers.\nAdditionally, Al Hawsawi contributed to the terrorist attack by helping the hijackers with their “finances and travel arrangements.”They are set to be sentenced in Guantánamo Bay on August, 5th."}, {"id": "4bad1eb4-b4ab-4c51-b80a-3c739a373587", "title": "Hamas Leader Ismail Haniyeh Killed in Iran By  Airborne  Object – Hollywood Life", "date": "2024-08-01 12:45", "url": "https://clichemag.com/celebrity-news/hamas-leader-ismail-haniyeh-killed-in-iran-by-airborne-object-hollywood-life/", "domain": "clichemag.com", "domain_classification": "Unknown", "message": "Image Credit: AFP via Getty ImagesThe ongoing war between Israel and Hamas has hit another extreme with the death of Hamas’ top political leader Ismail Haniyeh.\nWhile he was in his room, it was reported by IRNA that an “airborne guided projectile” was shot into the room where he was staying.\nIn addition to the recent incident, Israeli Prime Minister Benjamin Netanyahu addressed his nation and spoke on the current war.\nTwo weeks ago, we attacked the Houthis, in one of the farthest attacks the Air Force has carried out.\nThe Israel-Hamas war began back in October 2023 following Ocotober 7th, the deadliest attack on Israel since the Holocaust."}, {"id": "848084b7-8b9d-4307-9ddb-75402813602a", "title": "Price cuts may recharge Aussie electric vehicle market", "date": "2024-08-01 08:15", "url": "https://www.bendigoadvertiser.com.au/story/8715942/price-cuts-may-recharge-aussie-electric-vehicle-market/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "The price cuts come as electric vehicle growth slows in Australia, with sales of new EVs up by 16.5 per cent in the first six months of the year and representing almost eight per cent of all new car sales."}, {"id": "328f8691-298e-4aba-8b5d-676adce97cb1", "title": "New on Disney+ Hostar in August :  Only Murders in the Building  Season 4 ,  Star Wars : Young Jedi Adventure ,  Kingdom of the Planet of the Apes  ", "date": "2024-08-01 08:45", "url": "https://www.thehindu.com/entertainment/movies/new-on-disney-hostar-in-august-only-murders-in-the-building-season-4-star-wars-young-jedi-adventures-kingdom-of-the-planet-of-the-apes/article68472128.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "STAR WARS TITLESStar Wars: Young Jedi Adventures (Season 2) (August 14) (English)The young Jedi take on new missions across the galaxy as they try to stop the rise of the pirates!\nThe emigration fleet, Macross Frontier, traverses the Milky Way on a mission to find a new planet to colonize.\nCaught in the conflict between Graham, the Whale Poachers, and the Galactic Patrol, Basara is determined to have his song heard.\n(August 16) (Japanese)While experimenting with Song Energy, Basara hears a sudden bellow coming from somewhere far off in the distance.\nOnly Murders in the Building (Season 4) (August 27) (English)In season four, our amateur podcasting trio wrestles with the shocking events at the end of season three surrounding Charles’ stunt double & friend Sazz Pataki."}, {"id": "cc180c5e-8938-4c56-9040-754421802231", "title": "Gold scales 2 - week high as Fed nods to likely Sept rate cut", "date": "2024-08-01 03:00", "url": "https://www.marketscreener.com/news/latest/Gold-scales-2-week-high-as-Fed-nods-to-likely-Sept-rate-cut-47523868/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Spot gold was steady at $2,448.38 per ounce, as of 0217 GMT, after hitting its highest level since July 18 earlier in the session.\nPrices were just about $35 shy of the record high of $2483.60 scaled on July 17.\n\"Gold bulls couldn't resist the urge to buy more gold after the Fed effectively signalled the beginning of its rate-cut cycle.\n\"If the data comes in much hotter than expected, that could dent gold as we head towards the weekend,\" Simpson added.\nSpot silver fell 0.3% to $28.94 per ounce, platinum lost 0.3% to $973.65 and palladium was flat at $925.16."}, {"id": "388b8a5f-26b4-4cba-a404-e8213b692d7b", "title": "Iran Praises Genocidal Hamas Chief for Furthering  Extinction  of Israel , Vows Revenge", "date": "2024-08-01 00:00", "url": "https://www.breitbart.com/national-security/2024/07/31/iran-praises-genocidal-hamas-chief-furthering-extinction-of-israel-vows-revenge/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hamas is a Sunni jihadist terror organization headquartered in Gaza which relies heavily on Iranian funding for its survival.\nIranian leaders enthusiastically support Hamas’s goal of destroying the state of Israel and eradicating Jews from the Middle East.\nThe State Department recently estimated that Iran invests $100 million in Hamas and other Palestinian terrorist organizations a year.\nIran’s Islamic Revolutionary Guard Corps (IRGC), a U.S.-designated terrorist organization, confirmed on Wednesday that the residence housing Haniyeh was hit by a “projectile,” killing the Hamas leader.\nIranian dictator Khamenei, who had personally met with Haniyeh hours before his death, vowed revenge in a statement on Wednesday, again accusing Israel, with American help, of eliminating the Hamas terror chief."}, {"id": "148cb53f-3704-48e6-8bee-b00b38519951", "title": "Organizing for Victory ... or Self - Deterrence ? ", "date": "2024-08-01 09:00", "url": "https://www.intereconomics.eu/contents/year/2024/number/4/article/organizing-for-victory-or-self-deterrence.html", "domain": "intereconomics.eu", "domain_classification": "Unknown", "message": "Russia has thousands of nuclear warheads, and it clearly does not care about how many innocent people are killed, including its own.\nBut the question is why and under what circumstances would it actually use a nuclear weapon.\nI believe it is extremely unlikely and we should stop giving in to Russian nuclear blackmail.\nThere are no positive outcomes for Russia if it uses a nuclear weapon.\nIn short, Russia does not actually need to use a nuclear weapon to exploit the fear of the West."}, {"id": "9baf5580-035b-4719-84fc-7863fa4f8da4", "title": "HBO responds to House of the Dragon season 2 finale leak - and confirms how it happened", "date": "2024-08-01 08:30", "url": "https://www.hellomagazine.com/film/710325/hbo-responds-to-house-of-the-dragon-season-2-finale-leak-and-confirms-how-it-happened/", "domain": "hellomagazine.com", "domain_classification": "Unknown", "message": "Fans certainly had a divided reaction when House of the Dragon's season two finale leaked on social media earlier this week.\nWATCH: The House of the Dragon season 2 finale trailerHBO has finally responded to the leak of around 30 minutes of footage from season two, episode eight.\nIn a statement, they told Deadline: \"We are aware that clips from the House of the Dragon season finale have surfaced across social media platforms.\nAnother person added: \"HOTD Season 2 finale leaked and people are just posting it without warning.\n© HBO Hugh the Hammer claims Vermithor in House of the DragonA third person added: \"The season finale of #HouseOfTheDragon is titled, 'The Queen Who Never Was.'"}, {"id": "77d93f01-7c4a-4c58-b302-fc2e613bb302", "title": "Biden Prods Congress to Act to Curb Fentanyl From Mexico as Trump Paints Harris as Weak on Border", "date": "2024-08-01 04:15", "url": "https://www.theyeshivaworld.com/news/general/2301591/biden-prods-congress-to-act-to-curb-fentanyl-from-mexico-as-trump-paints-harris-as-weak-on-border.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "President Joe Biden is prodding Congress to help him do more to combat the scourge of fentanyl before he leaves office.\nThe White House on Wednesday announced a series of proposals from Biden aimed at curbing the ongoing drug epidemic.\n“Still, far too many of our fellow Americans continue to lose loved ones to fentanyl,” Biden said in a statement.\nDangerously liberal.”Border crossings hit record highs during the Biden administration but have dropped more recently.\nHouse Republicans passed a symbolic resolution last week criticizing Harris’ work on the border on behalf of the Biden administration."}, {"id": "930aff46-cecf-4971-861f-1021d712e0f3", "title": "F - 16s have arrived to help Ukraine fight Russia . Here what to know about their possible impact . ", "date": "2024-08-01 07:45", "url": "https://www.bostonglobe.com/2024/08/01/world/f-16s-have-arrived-help-ukraine-fight-russia-heres-what-know-about-their-possible-impact/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington confirmed to The Associated Press.\nThey might also get long-range air-to-air missiles that would threaten Russian bombers and fighter jets.\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine.\nAdvertisementUkraine has said it might keep some of the fighter jets at foreign bases to protect them from Russian strikes.\nHow will Ukraine protect the F-16s?"}, {"id": "a88a54a9-57bf-4b1b-8f9a-3ed487aae6d5", "title": "How to get Barebone Kills in CoD MW3 explained", "date": "2024-08-01 15:15", "url": "https://www.radiotimes.com/technology/gaming/cod-mw3-barebone-kills/", "domain": "radiotimes.com", "domain_classification": "Unknown", "message": "With the release of CoD: MW3 Season 5, there are loads of new cosmetics, guns and items to unlock so you will want to earn as much XP as possible.\nMore like thisBut enough of all that, let’s get to those Barebone Kills.\nWhat are Barebone Kills in CoD MW3?\nBarebone Kills in CoD MW3 are kills you achieve using a weapon that has no attachments.\nHow to easily get Barebone Kills in CoD MW3 explainedYou can easily get Barebone Kills in CoD MW3 by playing in Hardcore playlists and the Small Map Mosh Pit."}, {"id": "85f2d249-8082-4ee5-b125-4f73f826d6fd", "title": "Pentagon reaches plea deals for 9 / 11 attack plotters – NBC Los Angeles", "date": "2024-08-01 02:30", "url": "https://www.nbclosangeles.com/news/national-international/guantanamo-inmate-accused-of-being-main-plotter-of-9-11-attacks-to-plead-guilty/3474865/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Three Guantanamo detainees accused of plotting the September 11, 2001, terror attacks have reached plea agreements with the military, the Pentagon announced Wednesday.\nPentagon officials declined to immediately release the terms of the plea bargain.\nHe allegedly received approval from al-Qaida leader Osama bin Laden, whom U.S. forces killed in 2011, to craft what became the 9/11 hijackings and killings.\nShe urged the Biden administration to close the Guantanamo Bay detention center, which holds people taken into custody in the so-called war on terror.\nStrada said many families have just wanted to see the men admit guilt."}, {"id": "c1377da5-7002-4850-897f-ccbe89d51b67", "title": "Bangladesh bans Jamaat - e - Islami party following violent protests that left more than 200 dead", "date": "2024-08-01 13:15", "url": "https://www.deccanchronicle.com/world/bangladesh-bans-jamaat-e-islami-party-following-violent-protests-that-left-more-than-200-dead-1813681", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "The chief of Jamaat-e-Islami on Thursday rejected the decision in a statement, calling it anti-constitutional, and denied it was behind the recent violence.\nHe accused the government of seeking to cover up its own misdeeds by banning Bangladesh Jamaat-e-Islami and Bangladesh Islami Chhatrashibir.\nShe said that the government was set to ban the party for its involvement in the recent violence involving the quota reform movement.\nFollowing recent violence, more than 10,000 people including opposiiton figures have been arrested across the country.\nMirza Fakhrul Islam Alamgir, secretary-general of Zia's party, on Tuesday said that the decision to ban Jamaat-e-Islami is a tactic of Hasina's administration to divert attention from the current political situation following recent violence."}, {"id": "9905dd50-28e0-436e-9952-6e6b703e622b", "title": "Pentagon reaches plea deals for 9 / 11 attack plotters – NBC 7 San Diego", "date": "2024-08-01 01:45", "url": "https://www.nbcsandiego.com/news/national-international/guantanamo-inmate-accused-of-being-main-plotter-of-9-11-attacks-to-plead-guilty/3583216/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Three Guantanamo detainees accused of plotting the September 11, 2001, terror attacks have reached plea agreements with the military, the Pentagon announced Wednesday.\nPentagon officials declined to immediately release the terms of the plea bargain.\nHe allegedly received approval from al-Qaida leader Osama bin Laden, whom U.S. forces killed in 2011, to craft what became the 9/11 hijackings and killings.\nShe urged the Biden administration to close the Guantanamo Bay detention center, which holds people taken into custody in the so-called war on terror.\nStrada said many families have just wanted to see the men admit guilt."}, {"id": "3347fdb2-3165-4af7-b671-8738928384f5", "title": "Iran holds funeral for Ismail Haniyeh", "date": "2024-08-01 18:00", "url": "https://www.taipeitimes.com/News/world/archives/2024/08/02/2003821675", "domain": "taipeitimes.com", "domain_classification": "Unknown", "message": "Two men hold posters of assassinated Hamas leader Ismail Haniyeh during his funeral procession in Tehran yesterday.\nPhoto: West Asia News Agency via Reuters“Rest in peace, Abu al-Abed Ismail Haniyeh.\nIran and the Palestinian militant group have accused Israel of carrying out the strike that killed Haniyeh hours after he attended the inauguration of Iran’s new president in Tehran on Wednesday.\nIts bureau chief in Gaza, Wael al-Dahdouh, was wounded in an Israeli strike in December last year that killed the network’s cameraman.\nHis eldest son was the al-Jazeera staff journalist killed in January when a strike targeted a car in Rafah."}, {"id": "43e03259-d23f-4b1e-81e1-9ea70717fc2d", "title": "Bangladesh bans Jamaat - e - Islami party following violent protests that left more than 200 dead", "date": "2024-08-01 15:00", "url": "https://www.clickondetroit.com/news/world/2024/08/01/bangladesh-bans-jamaat-e-islami-party-following-violent-protests-that-left-more-than-200-dead/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Rajib Dhar)DHAKA – Bangladesh on Thursday banned the Jamaat-e-Islami party, its student wing and other associate bodies as “militant and terrorist\" organizations as part of a nationwide crackdown following weeks of violent protests that left more than 200 people dead and thousands injured.\nThe chief of Jamaat-e-Islami on Thursday rejected the decision in a statement, calling it anti-constitutional, and denied it was behind the recent violence.\nHe accused the government of seeking to cover up its own misdeeds by banning Bangladesh Jamaat-e-Islami and Bangladesh Islami Chhatrashibir.\nShe said that the government was set to ban the party for its involvement in the recent violence involving the quota reform movement.\nFollowing recent violence, more than 10,000 people including opposiiton figures have been arrested across the country."}, {"id": "6060afbb-dd69-4630-9169-7c073df1f1c8", "title": "Gold scales two - week high as Fed nods to likely September rate cut", "date": "2024-08-01 04:30", "url": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/gold-scales-two-week-high-fed-nods-likely-september-rate-cut", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "GOLD prices climbed to a two-week high on Thursday (Aug 1) as US Federal Reserve chair Jerome Powell opened the door to cutting interest rates as early as September.\nSpot gold was steady at US$2,448.38 per ounce, as at 0217 GMT, after hitting its highest level since Jul 18 earlier in the session.\n“Gold bulls couldn’t resist the urge to buy more gold after the Fed effectively signalled the beginning of its rate-cut cycle.\n“If the data comes in much hotter than expected, that could dent gold as we head towards the weekend,” Simpson added.\nSEE ALSO Gold prices set for monthly gain; traders eye Fed verdictGeopolitics is increasingly more supportive for gold in the medium and long term, said Nicky Shiels, head of metals strategy at MKS PAMP."}, {"id": "b3967d9b-6d8b-49c4-9b3a-001c389dae87", "title": "Will Türkiye  invade  Israel ? ", "date": "2024-08-01 05:45", "url": "https://www.dailysabah.com/opinion/op-ed/will-turkiye-invade-israel", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Though Türkiye did not “enter” Karabakh, it openly supported Azerbaijan’s operations to take back the said territory illegally occupied by Armenians.\nIsraeli officials, in turn, accused Türkiye of the “genocide” of Kurds and supporting Hamas, considered a liberation movement by Türkiye and those opposing Israel’s war crimes but labeled a bunch of terrorists by Tel Aviv.\nThese developments show that a mere sentence implying intervention is enough to irk Israel and bring us to another interpretation of Erdoğan’s remarks.\nIndeed, Erdoğan said in the same speech that Türkiye needs to be strong so that Israel would not dare to do again what it already did in Palestine.\nTensions between Israel and Lebanon proved it right and if the conflict goes beyond that, Türkiye will be among the most affected countries."}, {"id": "4ea61835-26a3-4dad-823f-c7d68bf073db", "title": "12 Crucial Tips To Survive In Kunitsu - Gami : Path of the Goddess", "date": "2024-08-01 17:30", "url": "https://www.kotaku.com.au/2024/08/12-crucial-tips-to-survive-in-kunitsu-gami-path-of-the-goddess/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "Kunitsu-Gami: Path of the Goddess is half tower-defense, half action game all about assisting a maiden to purge malicious defilement from a mountain.\nRead More: Kunitsu-Gami: Path of the Goddess: The Kotaku ReviewThere are many in-game tutorials covering the basics, but the addition of new mechanics can feel quite imposing.\nThese tips will help you efficiently prepare to take on the Seethe: the enemies of Kunitsu-Gami: Path of the Goddess.\nBut Kunitsu-Gami: Path of the Goddess is not a game you typically want to do that with.\nKunitsu-Gami: Path of the Goddess is a challenging game, but taking advantage of its many mechanics to find the right strategies is the key to venturing further down the mountain."}, {"id": "cf0af3f8-4bf7-409c-8f5e-d18e4c45b5f3", "title": "Worthplaying |  Dead Age II  Comes To PS5 And Xbox Series X|S Next Week", "date": "2024-08-01 02:30", "url": "https://worthplaying.com/article/2024/7/31/news/142980-dead-age-ii-comes-to-ps5-and-xbox-series-xs-next-week-screens-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "Building on the strengths of the original Dead Age, players can expect improvements across the board to the mechanics that drew thousands of players to the franchise.\nDeveloper Silent Dreams and publisher Headup announced the upcoming release of Dead Age 2 for consoles.\nHome, Sweet Home (Base): Dead Age II introduces the Advanced Base Management System.\nDead Age II introduces the Advanced Base Management System.\nCurrently available for PC (Steam and GOG), Dead Age II is coming to Xbox Series X|S and PS5 on August 8, 2024."}, {"id": "c54213c1-b2df-4410-b4be-1d9d0a614bdc", "title": "Gildan proxy fight that plunged company into turmoil cost nearly US$77 - million", "date": "2024-08-01 17:30", "url": "https://www.theglobeandmail.com/business/article-gildan-proxy-fight-that-plunged-company-into-turmoil-cost-nearly-us77/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Gildan’s former directors ousted Mr. Chamandy in December over what they said was his refusal to comply with a succession plan to which he had agreed.\nA rebellion swelled up soon after, with nine dissident investors holding an estimated 35 per cent of Gildan’s stock calling for Mr. Chamandy to be reinstated.\nThe battle came to a sudden conclusion when Gildan’s entire board of directors and former CEO Vince Tyra, hired to replace Mr. Chamandy, quit.\nA new board now oversees Gildan and includes seven directors nominated by Browning West in addition to Mr. Chamandy.\n“It was a confrontation of two visions for the future of the company,” Mr. Dauphin said."}, {"id": "f8759ddb-fe6e-4e3c-aca4-1ca88725f269", "title": "Katy Perry Rumored  American Idol  Replacement Finally Revealed And It A Former Winner", "date": "2024-08-01 17:15", "url": "https://decider.com/2024/08/01/katy-perrys-american-idol-replacement-revealed-former-winner/", "domain": "decider.com", "domain_classification": "Unknown", "message": "With Katy Perry set to exit American Idol after seven seasons on the show, her replacement has finally been announced.\nWith Underwood’s return, this season marks the first time an Idol winner has served as an official judge on the show.\nUnderwood will be replacing Perry, who announced earlier this year that she was leaving the show to focus on her own music.\n“I think this probably will be my last show, my last season for Idol,” she revealed on Jimmy Kimmel Live in February.\nA premiere date for American Idol Season 23 has not yet been announced but it is expected to air in spring 2025."}, {"id": "ef704c44-b2a6-44cc-ad2b-fb75b5b2adfc", "title": "The Best New Movies and TV Streaming in August 2024", "date": "2024-08-01 15:00", "url": "https://gizmodo.com/best-new-movies-tv-streaming-august-2024-netflix-hulu-2000480920", "domain": "gizmodo.com", "domain_classification": "Unknown", "message": "As always, we’re including the best new films and TV coming to Netflix, Hulu, Prime Video, Disney+, and Max—as well as Paramount+, Shudder, and Peacock, including several new releases.\nThe DeliveranceWhat’s coming to Prime Video in August 2024What’s available on Prime on August 1?\nThe Lord of the Rings: The Rings of Power S2 (2024)What’s coming to Hulu in August 2004?\nKingdom of the Planet of the Apes (2024)What’s available on Hulu on August 3?\nThe Official DC Podcast (2024)What’s coming to Paramount+ in August 2024?"}, {"id": "a6b4569b-a5b1-42f6-afd9-85e98134ce15", "title": "US Army chief wants three multidomain task force units in the Pacific", "date": "2024-08-01 00:45", "url": "https://www.defensenews.com/smr/defending-the-pacific/2023/03/15/us-army-chief-wants-three-multidomain-task-force-units-in-the-pacific/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "WASHINGTON — The U.S. Army chief would like to see three multidomain task force units in the Pacific region, he said Wednesday at the McAleese & Associates conference.\nWe have one in Europe and then one probably in a contingency-type place where it can go wherever it needs.\nThe service’s first MDTF was experimental, but since then the Army has operationalized its existing units and determined it will grow at least four more.\nIndo-Pacific Command theater exercises helped inform the Army’s Multi-Domain Operations warfighting concept, which has now evolved into doctrine.\nThe Army then established another MDTF in Europe in 2021, and another last year in Hawaii."}, {"id": "27aedc10-412e-4fb6-afb8-2d536ad87697", "title": "Khalid Sheikh Mohammed , Accused as the Main Plotter of 9 / 11 Attacks , Agrees to Plead Guilty", "date": "2024-08-01 01:00", "url": "https://www.military.com/daily-news/2024/07/31/khalid-sheikh-mohammed-accused-main-plotter-of-9-11-attacks-agrees-plead-guilty.html", "domain": "military.com", "domain_classification": "Unknown", "message": "WASHINGTON — Khalid Sheikh Mohammed, accused as the mastermind of al-Qaida’s Sept. 11, 2001, attacks on the United States, has agreed to plead guilty, the Defense Department said Wednesday.\nThe development points to a long-delayed resolution in an attack that killed thousands and altered the course of the United States and much of the Middle East.\nMohammed and two accomplices, Walid Bin Attash and Mustafa al-Hawsawi, are expected to enter the pleas at the military commission at Guantanamo Bay, Cuba, as soon as next week.\nMohammed was subjected to waterboarding 183 times while in CIA custody before coming to Guantanamo, and targeted by other forms of torture and coercive questioning.\nDaphne Eviatar, a director at the Amnesty International USA rights group, said Wednesday she welcomed news of some accountability in the attacks."}, {"id": "bcd800fa-6215-40d9-a295-6ce320958a2d", "title": "Firefighter passes out while responding to Battle Creek fire", "date": "2024-08-01 02:15", "url": "https://www.fox17online.com/news/local-news/kzoo-bc/calhoun/firefighter-passes-out-while-responding-to-battle-creek-fire", "domain": "fox17online.com", "domain_classification": "Unknown", "message": "BATTLE CREEK, Mich. — A firefighter was hurt while responding to a house fire in Battle Creek Tuesday evening.\nThe fire broke out in the 200 block of Hunter Street before 5:15 p.m., according to the Battle Creek Fire Department (BCFD).\nWe’re told crews found heavy smoke billowing from the rear and the edge of the roof.\nBCFD says one of their firefighters lost consciousness while inside the home.\nThe firefighter who lost consciousness was hospitalized and later released."}, {"id": "0b143171-2525-48a3-954e-d9081025fbc9", "title": "US , Chinese commands in Pacific arent talking , says Indo - Pacific boss", "date": "2024-08-01 00:45", "url": "https://www.defensenews.com/global/2023/03/16/us-chinese-commands-in-pacific-arent-talking-says-indo-pacific-boss/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "MELBOURNE, Australia — The head of U.S. Indo-Pacific Command says he has not had contact with his Chinese counterparts, despite a previous agreement between the U.S. defense secretary and the Chinese defense minister.\n“I’ve not received a ‘no.’ I’ve not received a ‘wait, could we adjust?’ I’ve just received no answer.”“We have continued to ask because I do think it is important.\nBut it’s concerning to me I don’t have the ability to talk to someone, should there be a reason to talk,” he added.\nSo the normal, sort of many channels that you have to quickly diffuse something — they’re gone.\nThey’re not gone, but they’re suspended right now,” he added."}, {"id": "b4de899e-9c7b-4576-91e3-6dffdc15409e", "title": "First F - 16  flies over Ukraine  as Western fighter jets FINALLY arrive", "date": "2024-08-01 08:15", "url": "https://www.dailymail.co.uk/news/article-13696885/First-F-16-flies-Ukraine-Western-fighter-jets-FINALLY-arrive-aid-Zelenskys-war-Putin.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The first Western fighter jets have reportedly taken flight over the skies of Ukraine after months of delays that have hamstrung Kyiv's war effort and left its cities susceptible to constant aerial barrages from Russian attackers.\nThe West has hesitantly moved toward providing the jets, after previous concerns that arming Ukraine with advanced weaponry would further escalate the war with Russia.\nNorway has also said that it would donate six F-16 fighter jets to Ukraine.\nThe roughly nine-month training in the US and Europe for Ukrainian pilots amounted to a crash course compared with the usual three-year course for Western pilots in what Miron calls 'a very complex piece of machinery.'\nQuality airfields are also a must as the F-16 air intake is close to the tarmac and runs the danger of sucking debris and dirt into the engine."}, {"id": "32e5577a-76dd-4c45-996d-5694c3a9d36d", "title": "Khalid Sheikh Mohammed , accused as the main plotter of 9 / 11 attacks , agrees to plead guilty", "date": "2024-08-01 00:30", "url": "https://www.clickorlando.com/news/politics/2024/07/31/guantanamo-inmate-accused-of-being-main-plotter-of-911-attacks-to-plead-guilty/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The man accused of being the main plotter in al-Qaeda's Sept. 11, 2001 attacks has agreed to plead guilty, The Defense Department said Wednesday.\n(AP Photo, FILE)WASHINGTON – Khalid Sheikh Mohammed, accused as the mastermind of al-Qaida’s Sept. 11, 2001, attacks on the United States, has agreed to plead guilty, the Defense Department said Wednesday.\nThe U.S. agreement with the men comes more than 16 years after their prosecution began for al-Qaida's attack.\nMohammed was subjected to waterboarding 183 times while in CIA custody before coming to Guantanamo, along with other torture and coercive questioning.\nDaphne Eviatar, a director at the Amnesty International USA rights group, said Wednesday she welcomed news of some accountability in the attacks."}, {"id": "b6cb3243-e60b-4bc5-bd6c-6003135c27db", "title": "Battle Creek firefighter hospitalized after passing out during house fire", "date": "2024-08-01 06:30", "url": "https://wwmt.com/news/local/battle-creek-firefighter-hospitalized-passing-out-during-house-fire-hunter-street-mckinley-avenue-rescue-victims-tuesday-property-damage", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "A firefighter from the Battle Creek Fire Department (BCFD) was hospitalized after responding to a structure fire Tuesday evening, according to BCFD.\nCrews were dispatched to a residence on Hunter Street near McKinley Avenue North just after 5 p.m. for a report of a fire with people possibly trapped inside, authorities said.\nCrime:Mayday was called and the unconscious firefighter was removed from the building while crews continued to extinguish the fire.\nThe firefighter regained consciousness once outside and was then taken to Battle Creek Bronson Hospital; BCFD said they are now home and doing well.\nCrews did not find anyone inside the residence and were able to put of the fire, authorities said."}, {"id": "e0692f3f-86a7-4863-a509-0aaf04e09b8b", "title": "Wildfires rage in Balkans and Greece", "date": "2024-08-01 03:30", "url": "https://global.chinadaily.com.cn/a/202408/01/WS66aaebc0a3104e74fddb7f3d.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "ANTONIO BRONIC/REUTERSFierce wildfires, propelled by strong winds, ravaged areas of Greece and the Balkans on Tuesday, destroying forests and homes and forcing the evacuation of an Albanian resort town, local officials reported.\nThe area has experienced higher-than-normal temperatures and arid conditions throughout the previous month, establishing perfect circumstances for the outbreak of wildfires, according to scientists.\nIn recent years, Greece has experienced an increase in wildfire occurrences during progressively hotter and drier summers, a trend that scientists attribute to climate change.\nThe country has been grappling with hundreds of wildfires since May, coinciding with its record-breaking hottest June and longest-ever heatwave.\nEurope is experiencing the most rapid warming of any continent globally, with Greece among nations most severely impacted by the consequences of anthropogenic climate change, reported Euronews."}, {"id": "493aa717-32bd-4d39-be27-e8340471ec88", "title": "Ukraine receives first F - 16 fighters | The Arkansas Democrat - Gazette", "date": "2024-08-01 11:00", "url": "https://www.arkansasonline.com/news/2024/aug/01/ukraine-receives-first-f-16-fighters/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "A Ukrainian lawmaker also confirmed Ukraine had received a small number of F-16 fighter jets.\nUkraine needs at least 130 F-16 fighter jets to neutralize Russian air power, Ukrainian officials say.\nThe Russian drones are being shot down by Ukraine's Soviet-era aircraft, according to Anatolii Khrapchynskyi, an aviation expert in Kyiv.\nThe mobilization push has so far not significantly bolstered Ukraine's forces on the battlefield, those people say.\nThe medic spoke on condition of anonymity to avoid giving information to Russian forces."}, {"id": "0ab261ab-acde-440f-aeb1-abc7de0a19cb", "title": "William Calley , who led the My Lai massacre that shamed US military in Vietnam , has died", "date": "2024-08-01 08:45", "url": "https://nypost.com/2024/08/01/us-news/william-calley-who-led-the-my-lai-massacre-that-shamed-us-military-in-vietnam-has-died/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "11 Most victims of the My Lai Massacre were women, children (including babies), and elderly people.\n11 US soldiers involved in the My Lai massacre.\nPictures From History/Universal Images Group via Getty Images11 A picture shows some of the alleged survivors of the My Lai massacre.\n11 Visitors offer flowers at a war memorial dedicated to the victims of the My Lai massacre in the village of Son.\n“There is not a day that goes by that I do not feel remorse for what happened that day in My Lai,” Calley said."}, {"id": "c12ae299-9966-478b-8245-b89bf60273a5", "title": "Iran , its proxies will meet to discuss retaliation against Israel , say sources", "date": "2024-08-01 13:45", "url": "https://dunyanews.tv/en/World/827966-iran-its-proxies-will-meet-to-discuss-retaliation-against-israel-say", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Iran, its proxies will meet to discuss retaliation against Israel, say sourcesWorld World Iran, its proxies will meet to discuss retaliation against Israel, say sourcesThe region faces a risk of widened conflict following the assassination of Ismail HaniyehFollow on Updated On: Thu, 01 Aug 2024 17:00:51 PKTDUBAI (Reuters) - Top Iranian officials will meet the representatives of Iran's regional allies from Lebanon, Iraq and Yemen on Thursday to discuss potential retaliation against Israel after the killing of the Hamas leader in Tehran, five sources told Reuters.\nAnother Iranian official said Supreme leader Ayatollah Ali Khamenei and senior members of Iran's elite Revolutionary Guards will attend.\nIran and Hamas have accused Israel of carrying out the strike that killed Haniyeh hours after he attended the inauguration of Iran's new president in Tehran on Wednesday.\nVowing to retaliate, Iran said the US bore responsibility because of its support for Israel.\n\"All fronts of the resistance will take revenge for Haniyeh's blood,\" Ali Akbar Ahmadian, the secretary of Iran's Supreme National Security Council, told Iran's semi-official Mehr news agency."}, {"id": "f472b8b0-e85c-41da-acaf-8b6746affa86", "title": "Myanmar rebel group vows to protect China interests", "date": "2024-08-01 11:15", "url": "https://www.globalsecurity.org/wmd/library/news/myanmar/2024/myanmar-240731-rfa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Myanmar rebel group vows to protect China's interestsThe force said it would speak with allied insurgent groups to ensure protection of Chinese citizens and businesses.\nBy RFA Burmese 2024.07.31 -- A member of a Myanmar rebel alliance fighting military rule has promised to protect Chinese interests in northern Myanmar.\nThe Myanmar National Democratic Alliance Army, or MNDAA, pledged to protect Chinese nationals and investments as the battle for a major Shan state town intensified, the group announced on Tuesday.\nSince July 22, when the latest ceasefire collapsed, fighting over Lashio, the main city in northern Shan state, has surged.\n\"China's interests in northern Shan state are to keep its trade routes convenient and smooth and to maintain stability on the border region."}, {"id": "1984d2bf-2760-4f34-bd3a-1bc38f83824b", "title": "Khalid Sheikh Mohammed , accused as the main plotter of 9 / 11 attacks , agrees to plead guilty", "date": "2024-08-01 00:15", "url": "https://www.wsls.com/news/politics/2024/07/31/guantanamo-inmate-accused-of-being-main-plotter-of-911-attacks-to-plead-guilty/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "The man accused of being the main plotter in al-Qaeda's Sept. 11, 2001 attacks has agreed to plead guilty, The Defense Department said Wednesday.\n(AP Photo, FILE)WASHINGTON – Khalid Sheikh Mohammed, accused as the mastermind of al-Qaida’s Sept. 11, 2001, attacks on the United States, has agreed to plead guilty, the Defense Department said Wednesday.\nThe U.S. agreement with the men comes more than 16 years after their prosecution began for al-Qaida's attack.\nMohammed was subjected to waterboarding 183 times while in CIA custody before coming to Guantanamo, along with other torture and coercive questioning.\nDaphne Eviatar, a director at the Amnesty International USA rights group, said Wednesday she welcomed news of some accountability in the attacks."}, {"id": "5ad21cb9-ea44-4a06-a1e6-29dc5d9da07b", "title": "Countdown to martial law : Opening the floodgates west of the mountains", "date": "2024-08-01 09:30", "url": "https://www.westernadvocate.com.au/story/8714240/countdown-to-martial-law-opening-the-floodgates-west-of-the-mountains/", "domain": "westernadvocate.com.au", "domain_classification": "Unknown", "message": "August 14 will mark the 200-year anniversary of the declaration of martial law west of the Blue Mountains.\nGovernor Brisbane declared martial law in 1824 in an attempt to put an end to the warfare that had erupted around Bathurst that year.\nIn this series of articles, Dr Stephen Gapps, historian and author of Gudyarra - The First Wiradyuri War of Resistance, the Bathurst War 1822-1824, looks at the key events that led to military intervention at Bathurst."}, {"id": "17cb19a0-bc59-429e-8c33-71723f21206c", "title": "UAV - 45 Malebolge for CFA - 44 by Megalith ( Weapon Swap ) addon - Ace Combat 7 : Skies Unknown", "date": "2024-08-01 03:00", "url": "https://www.moddb.com/games/ace-combat-7/addons/uav-45-malebolge-weapon-swap", "domain": "moddb.com", "domain_classification": "Unknown", "message": "The infamous drones that Pasternark used on his CFA-44, *not compatible with addon mods by PPDT conflict(Uploaded with permission from Megalith)*Original Description by Megalith :A weapon swap that replaces CFA's ECM weapon to the UAV-45 Malebolge.\nDESCRIPTIONThis mod is based on Kotobukiya's CFA-44 model, that includes a pylon storing the iconic UAV-45 Malebolge in triplets of 4, appearing in Ace Combat 6.\nIt has 12 lock launch, uses machine-guns to hit down enemy targets, and contains a unique HUD icon.\nASG Osea: Skin 01, 04, 05, 06Skin 01, 04, 05, 06 Sea Flanker: Skin 02Skin 02 Strigon Red: Skin 07Skin 07 Prototype Malebolge: Skin 03, 08CREDITSBig thanks to:RythusOmega: AC6 mesh and texturing of ASG, Sea Flanker and Prototype Malebolge.\nMachinicle: References of the model pylon & position of UAVs."}]