[{"id": "4f2a0642-f645-4c1b-8dcf-4454e44902a4", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\""}, {"id": "a3d6788b-daff-495b-a485-e55d73e94e40", "title": "Nato chief chides members as Ukraine allies say slow arms deliveries have helped Russia", "date": "2024-04-29 22:15", "url": "https://www.scmp.com/news/world/europe/article/3260842/nato-chief-chides-members-ukraines-allies-say-slow-arms-deliveries-have-helped-russia", "message": "Outgunned, Ukraine’s troops have struggled to fend off Russian advances on the battlefield.\n“Serious delays in support have meant serious consequences on the battlefield” for Ukraine, Nato Secretary General Jens Stoltenberg told a news conference in Kyiv with Ukrainian President Volodymyr Zelensky.\nDrawn-out Ukrainian efforts to mobilise more troops, and the belated building of battlefield fortifications, are other factors undermining Ukraine’s war effort, military analysts say.\nThe Russian military is in a better position at the moment.\n“Russian forces remain unlikely to achieve a deeper operationally significant penetration in the area in the near term,” the Institute for the Study of War said in an assessment Sunday."}, {"id": "eeed5cdf-b57d-4b84-b231-58c4b3828529", "title": "Iran Claims Coalition of Ten Countries Helped Israel Block Missile Barrage", "date": "2024-04-30 02:30", "url": "https://www.breitbart.com/middle-east/2024/04/29/iran-claims-coalition-of-ten-countries-helped-israel-block-missile-barrage/", "message": "According to the Israel Defense Forces (IDF), “99 percent” of all objects fired at Israel were intercepted, including all drones and cruise missiles.\nSharif reportedly accused ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n“Operation True Promise was not a military exercise but the scene of a real operation,” Sharif said, using the official Iranian term for the inept bombing.\nWhile those partnerships are well-known, several reports indicated that multiple Muslim countries within the Middle East also intercepted Iranian missiles.\nPressTV did not specify what information Sharif was using to accuse ten unnamed countries of supporting Israel."}, {"id": "cd1e65b2-d3c2-4d01-b446-1a6e8277e395", "title": "Iran Claims Coalition of Ten Countries Helped Israel Block Missile Barrage", "date": "2024-04-29 23:00", "url": "https://www.breitbart.com/national-security/2024/04/29/iran-claims-coalition-of-ten-countries-helped-israel-block-missile-barrage/", "message": "According to the Israel Defense Forces (IDF), “99 percent” of all objects fired at Israel were intercepted, including all drones and cruise missiles.\nSharif reportedly accused ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n“Operation True Promise was not a military exercise but the scene of a real operation,” Sharif said, using the official Iranian term for the inept bombing.\nWhile those partnerships are well-known, several reports indicated that multiple Muslim countries within the Middle East also intercepted Iranian missiles.\nPressTV did not specify what information Sharif was using to accuse ten unnamed countries of supporting Israel."}, {"id": "275c0246-a79b-471d-b217-5f46e1fd0a20", "title": "India is drawing lessons from Ukraine to counter China military might", "date": "2024-04-30 06:15", "url": "https://www.businessinsider.in/international/news/india-is-drawing-lessons-from-ukraine-to-counter-chinas-military-might/articleshow/109704444.cms", "message": "India is trying to modernize its military of 1.5 million people with lessons from Ukraine.\nAdvertisementAs India boosts defense spending amid tensions with China and Pakistan, it is closely studying the Ukraine conflict for clues to the future of warfare and how to thwart its neighbors.\nSome lessons that Indian experts have already drawn: India needs lots of artillery, drones and cyberwarfare capabilities.\nDrones have become the stars and workhorses of the air war, with both sides deploying — and losing — drones in the hundreds of thousands.\nThere are lessons here for Indian airpower, according to Arjun Subramaniam, a retired Indian Air Force air vice marshal who helped write the ORF report."}, {"id": "c4c0ef97-9502-49c5-ad36-6269487420f8", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon."}, {"id": "271738fc-abdb-47e7-b0c2-c5822d53a51f", "title": "Richard D . Fisher On Taiwan : Surviving The Next Four Years", "date": "2024-04-28 17:15", "url": "https://www.taipeitimes.com/News/editorials/archives/2024/04/29/2003817089", "message": "Richard D. Fisher On Taiwan: Surviving The Next Four YearsFor the incoming Administration of President-elect William Lai (賴清德), successfully deterring a Chinese Communist Party (CCP) attack or invasion of democratic Taiwan over his four-year term would be a clear victory.\nBut it could also be a curse, because during those four years the CCP’s People’s Liberation Army (PLA) will grow far stronger.\nAs such, increased vigilance in Washington and Taipei will be needed to ensure that already multiplying CCP threat trends don’t overwhelm Taiwan, the United States, and their democratic allies.\nFirst it is necessary to acknowledge that short of actual shooting, the CCP is at war with the United States, Taiwan, and most other democracies.\nRichard D. Fisher, Jr. is a senior fellow with the International Assessment and Strategy Center."}, {"id": "b72ca78f-1e9e-4fef-95b2-6de8c810b7aa", "title": "Israel Strikes Hamas Rocket Launchers , Tunnel Shafts , Hezbollah Infrastructure | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 22 Nisan 5784 – Tuesday , April 30 , 2024", "date": "2024-04-30 09:00", "url": "https://www.jewishpress.com/news/israel/idf/israel-strikes-hamas-rocket-launchers-tunnel-shafts-hezbollah-infrastructure/2024/04/30/", "message": "Photo Credit: IDFIsraeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post and Hamas terror infrastructure in northern and central Gaza, the Israel Defense Forces said on Tuesday morning.\nShortly afterward, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon."}, {"id": "a7cfef72-5b99-41f4-80ac-f932f6aed1af", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones."}, {"id": "8d51c683-f1b6-4b7f-94d9-37184b2713d6", "title": "Abducted Senior Judge Released In Northwestern Pakistan", "date": "2024-04-29 09:30", "url": "https://www.rferl.org/a/pakistan-kidnapped-judge-released-marwat-taliban/32924821.html", "message": "The Georgian Dream staged a large counterdemonstration outside the parliament building in support of the bill on April 29, ferrying in people from all over the country.\nWATCH: Thousands of Georgians demonstrated in rival pro- and anti-government rallies as parliament resumed discussions of the so-called \"foreign agents\" bill.\nAnother former prime minister, Irakli Gharibashvili, currently the chairman of Georgian Dream, and other party leaders say the legislation is intended to increase transparency in the country’s political environment.\nIn a statement announcing the fresh protest, some 20 NGOs accused Ivanishvili and Georgian Dream that \"by adopting the Russian law, they are planning repression against the people...election-rigging, censorship, and a Soviet-style totalitarian regime.\"\nGeorgian Dream introduced the legislation last year but was forced to withdraw it following mass protests."}, {"id": "13b79d6e-51dd-4577-9731-6b4ca9c248a8", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike."}, {"id": "47f7ada9-2d9c-4065-8e0b-4e87dc5f9a79", "title": "Sydney church stabbing : Teen alleged terrorism texts , claims he wanted to  kill non believers  ", "date": "2024-04-30 10:30", "url": "https://www.nzherald.co.nz/world/sydney-church-stabbing-teens-alleged-terrorism-texts-claims-he-wanted-to-kill-non-believers/OUECF7DEZNDHHKQVO2BCBQEPDU/", "message": "A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences following the Sydney church stabbing allegedly sent text messages declaring he was “going to kill non-believers” before the attack was carried out by an alleged associate.\nHis alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers."}, {"id": "dfcdd740-0625-4229-aaa5-7fe044e72d1c", "title": "Israel - Hamas : Biden speaks with Netanyahu as Mideast tensions in U . S . mount", "date": "2024-04-29 05:30", "url": "https://www.cnbc.com/2024/04/29/israel-hamas-biden-speaks-with-netanyahu-as-mideast-tensions-in-us-mount.html", "message": "President Joe Biden (L) listens to Israel's Prime Minister Benjamin Netanyahu as he joins a meeting of the Israeli war cabinet in Tel Aviv.\nPresident Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nBiden said in early April that he thinks Netanyahu is making a \"mistake\" with his handling of the war, adding, \"I don't agree with his approach.\""}, {"id": "283ad178-df7f-4d6f-a9e6-923b4d92f536", "title": "Biden speaks with Netanyahu as tensions over the Israel - Hamas war mount in the US", "date": "2024-04-29 00:45", "url": "https://www.nbcnews.com/politics/white-house/biden-speaks-netanyahu-tensions-israel-hamas-war-mount-us-rcna149724", "message": "WASHINGTON — President Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nDuring the earlier April call, Biden \"emphasized that the strikes on humanitarian workers and the overall humanitarian situation are unacceptable,\" according to the White House readout.\nBiden said in early April that he thinks Netanyahu is making a “mistake” with his handling of the war, adding, “I don’t agree with his approach.”"}, {"id": "6a69bfa5-b94e-4d33-beb9-0c0f41d6cc14", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure."}, {"id": "f0cdef4e-7c50-4027-8313-c4d2941c8c9a", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "e999b605-474e-4d46-b0b2-afc9567f3f5c", "title": "Wakeley church stabbing : Teens allegedly discussed bombs , guns in group chats", "date": "2024-04-30 07:30", "url": "https://www.brisbanetimes.com.au/national/nsw/we-re-gonna-kill-teens-allegedly-discussed-bombs-guns-in-groups-chats-20240430-p5fnrv.html", "message": "A group of teenagers discussed carrying out a terrorism attack and a desire to kill before they were arrested in anti-terrorism raids last Wednesday, a court has heard.\nThe conversations took place in group chats after the alleged stabbing of Bishop Mar Mari Emmanuel during a live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15.\nThe father of a teenager accused of stabbing a priest in a Wakeley church leaves Parramatta Children’s Court.\nCredit: Janie BarrettNine days later, anti-terrorism police raided a dozen south-west suburbs and have arrested six young people, including a 16-year-old boy, who was charged with conspiring to prepare or plan for a terrorist act.\nThat 16-year-old has been in custody since his arrest a week ago and was refused bail at Parramatta Local Court on Tuesday by Magistrate Janet Wahlquist."}, {"id": "f20b5dd2-4968-4dfa-86bc-2fbad3247aa9", "title": "Likely missile attack by Yemen Houthi rebels targets a ship in the Red Sea", "date": "2024-04-29 15:00", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-container-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "2bd44d9d-f83e-4b7f-8d77-744a7416b01a", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "705a830d-0a2c-429d-9cf0-7330a156b101", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group."}, {"id": "a6948d32-0c77-47b5-a368-45fa5334008e", "title": "  First Told Pakistan About Balakot Airstrike : Modi on New India  Fight from Front  Policy", "date": "2024-04-30 03:45", "url": "https://www.news18.com/elections/first-told-pakistan-about-balakot-airstrike-pm-modi-on-new-indias-fight-from-front-policy-8871364.html", "message": "Prime Minister Narendra Modi has revealed the untold story of how he ensured Pakistan was the first to officially hear about the 2019 Balakot airstrike.\n“I instructed our forces to notify media about the airstrike, albeit after I had informed Pakistani authorities over phone that we have carried out an airstrike, killed these many people and caused this much destruction,” the prime minister said on Monday.\nPM Modi further stated that when he had dialled the neighbouring country, “they wouldn’t take calls”.\nEarlier this year, while delivering a keynote address at the Network18 Rising Bharat Summit 2024, PM Narendra Modi had recalled that when he was at the conclave five years ago, a significant event took place soon after.\nWhether terrorist masterminds or countries seeking peace and development, everyone has experienced the phenomenon of Rising Bharat, the PM said at the summit."}, {"id": "8cae9e1c-ebf7-42ab-a6c5-4d49b1fc6d43", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\nIn a Google-translated update on Telegram, Russia's defense ministry said that air defense systems had, in the past 24 hours, \"shot down ... six ATACMS operational-tactical missiles made in the USA.\"\nIt's uncertain how many ATACMS missiles Ukraine was given.\nIt's widely believed that Russian forces are aiming to recapture the city of Kharkiv in their forthcoming summer offensive.\nRussia's defense ministry announced the capture of the village of Novobakhmutivka, just north of Semenivka, on Sunday."}, {"id": "e69f33e4-b207-4035-bab0-dc06d83321b0", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "d49ba430-0b50-49c4-8f4d-435f2b8a8fb2", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 18:45", "url": "https://www.smdailyjournal.com/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_38dfa75b-1712-5b26-813d-63a038fce6d6.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "ea41a3fe-4055-4b0d-9f84-b92e3e1e0764", "title": "Hezbollah says it fired drones and guided missiles at northern Israel", "date": "2024-04-28 17:30", "url": "https://www.thehindu.com/news/international/hezbollah-says-it-fired-drones-and-guided-missiles-at-northern-israel/article68118107.ece", "message": "April 28, 2024 10:30 pm | Updated 10:30 pm IST - BeirutLebanon’s Iran-backed Hezbollah movement said on Saturday it had targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe Israeli Army said its Iron Dome air-defence system “successfully intercepted a suspicious aerial target that crossed from Lebanon into the area of Manara in northern Israel”.\nThe Army also “struck the sources of fire” of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nOvernight Saturday to Sunday Hezbollah said it had launched dozens of rockets at the Israeli military base at Meron, northern Israel.\nHezbollah has intensified its targeting of military sites in Israel since tensions soared between Israel and Iran over the bombing of Tehran’s Damascus consulate on April 1, widely blamed on Israel."}, {"id": "83647278-3473-43a2-b903-fe0c7f2b072f", "title": "Ukraine - Russia war live : Five killed in Russian strike on Ukraine  Harry Potter castle  ", "date": "2024-04-30 08:30", "url": "https://www.telegraph.co.uk/world-news/2024/04/30/ukraine-russia-war-latest-news-strike-odesa-missile/", "message": "Six long-range US missiles secretly shipped to Ukraine have been shot down over Crimea, Russia has claimed.\nThe Russian-backed head of occupied Crimea claimed that its air defences intercepted long-range Army Tactical Missile Systems (ATACMS) over the peninsula overnight.\nSergei Aksyonov posted a photo on Telegram showing what he described as undetonated submunitions of ATACMS missiles.\nHe said that they had been shot down over the occupied Crimean cities of Dzhankoi and Simferopol.\nLocal Crimean Telegram accounts also reported the news and said that the Crimean bridge had been closed as a result."}, {"id": "83f2d8ea-3bca-48f3-bb54-908a9be34be6", "title": "UN and global peace - Daily Times", "date": "2024-04-30 05:45", "url": "https://dailytimes.com.pk/1190598/un-and-global-peace/", "message": "Liberal institutionalists opine that the UN has succeeded in maintaining global peace and security as it has averted major global conflicts since 1945.\nTo maintain global peace and security, multilateral disarmament and arms limitation have remained the primary objective of the global organization.\nWith the development of nuclear weapons, global peace and security came under serious threat because of the danger of nuclear war.\nSimilarly, peacekeeping missions appear to be another contribution of the UN in establishing global peace and security.\nIt is a unique global partnership in a combined effort to maintain international peace and security in conflict zones as several countries are unable to transition from conflict to peace without the support of the World Organization."}, {"id": "91e18059-8d43-4f22-99bc-bb0e2cc2900c", "title": "A three - dimensional view of the Israel - Iran crisis", "date": "2024-04-28 20:00", "url": "https://www.thehindu.com/opinion/lead/a-three-dimensional-view-of-the-israel-iran-crisis/article68118479.ece", "message": "“Iran, Iran, Iran,” responded the Prime Minister.\nMr. Netanyahu, Israel’s longest-serving Prime Minister, has never minced words about Iran.\nAnd Israel’s response to the Iran attack was rather “feeble”, as Mr. Netanyahu’s National Security Minister Itamar Ben Gvir himself called it.\nAnd then, Mr. Biden told Mr. Netanyahu that the U.S. would not participate in any Israeli retaliation against Iran.\nBut when Mr. Biden told him that the U.S. would not join Israel’s retaliation, it limited Mr. Netanyahu’s options."}, {"id": "46b8ace2-e1b1-4998-978a-be695e585254", "title": "After Stabbing Bishop ,  Soldiers of Allah  Wanted to Kill Jews", "date": "2024-04-29 05:00", "url": "https://www.frontpagemag.com/after-stabbing-bishop-soldiers-of-allah-wanted-to-kill-jews/", "message": "The Australian government really doesn’t want you to see this video of a teen Muslim terrorist stabbing a bishop.\nPresident David Adler told CNN he hadn’t been asked to take it down, either by X or Australia’s e-safety commissioner.\nAfter stabbing a bishop, the Jihadi’s pals decided they wanted to kill some Jews.\nThe 16-year-old allegedly wrote online: “Allah is the best of planners and we are the soldiers of Allah.”Nothing to do with Islam, I’m sure.\nThe more “Soldiers of Allah” move to Australia (not to mention America), the safer we’ll all surely be."}, {"id": "afd3fa7f-4461-4a53-bcc3-4dcf9aa7c31c", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "1ebfb6cb-1ca7-402b-ae88-8e648ea765a2", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\nIn a Google-translated update on Telegram, Russia's defense ministry said that air defense systems had, in the past 24 hours, \"shot down ... six ATACMS operational-tactical missiles made in the USA.\"\nIt's uncertain how many ATACMS missiles Ukraine was given.\nIt's widely believed that Russian forces are aiming to recapture the city of Kharkiv in their forthcoming summer offensive.\nRussia's defense ministry announced the capture of the village of Novobakhmutivka, just north of Semenivka, on Sunday."}, {"id": "6d34407e-6291-4925-b54c-82588a7767c3", "title": "  My whole family has perished : 20 dead after Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 17:00", "url": "https://abc17news.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says."}, {"id": "6b1302ec-9a7c-454e-a31d-4158c45da0ba", "title": "Who is Lebanon Jamaa Islamiya , latest to parade weapons against Israel ? ", "date": "2024-04-29 15:30", "url": "https://www.al-monitor.com/originals/2024/04/who-lebanons-jamaa-islamiya-latest-parade-weapons-against-israel", "message": "Members of al-Jamaa al-Islamiya held a funeral procession Sunday in the town of Bebnine for two of the group's fighters.\nDozens of masked and armed men were seen walking the town's streets, brandishing their weapons and firing in the air.\nAl-Jamaa al-Islamiya is a Sunni Islamist political group founded in 1964 as the Lebanese branch of the Muslim Brotherhood.\nIbrahim Mneime, another independent lawmaker, said al-Jamaa al-Islamiya bears responsibility for the “military demonstration” and the fall of the wounded in Akkar.\nThe Israeli military told Agence France Presse that 20 rockets were launched toward Israel from Lebanon and that most of the projectiles were intercepted."}, {"id": "db2ceb4d-711e-46b1-b7ea-06f37b77071f", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-04-29 09:30", "url": "https://www.salisburyjournal.co.uk/news/national/24284585.teenagers-plotted-attack-jewish-people-sydney-stabbing-police-say/", "message": "Five teenagers, aged 14 to 17, were charged in a Sydney court on Thursday last week with a range of offences including conspiring to engage in or planning a terrorist act.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nThe boy accused of stabbing Emmanuel and a priest was charged with committing a terrorist act, a crime that carries a potential maximum penalty of life in prison.\nThe parents were in hiding for fear of reprisals after rioting broke out around the church within hours of the stabbing."}, {"id": "e60c7a41-95b4-48db-be6c-ff16a161690a", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-04-29 10:15", "url": "https://www.eadt.co.uk/news/national/24284585.teenagers-plotted-attack-jewish-people-sydney-stabbing-police-say/", "message": "Five teenagers, aged 14 to 17, were charged in a Sydney court on Thursday last week with a range of offences including conspiring to engage in or planning a terrorist act.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nThe boy accused of stabbing Emmanuel and a priest was charged with committing a terrorist act, a crime that carries a potential maximum penalty of life in prison.\nThe parents were in hiding for fear of reprisals after rioting broke out around the church within hours of the stabbing."}, {"id": "bf0f77db-99bf-4d1c-97c4-b5f4d77d5143", "title": "Iran Teases New Drone Visually Similar to Russia Lancet", "date": "2024-04-29 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240428-sputnik01.htm", "message": "Iran Teases New Drone Visually Similar to Russia's LancetSputnik News20240428Ilya TsukanovKicking off its foray into drone design and manufacturing in the 1980s during the Iran-Iraq War, Iran has gone on to create more than 50 different kinds of unmanned aerial vehicles, from reconnaissance and strike drones to loitering munitions.\nIran's Islamic Revolutionary Guard Corps has teased a new drone design apparently taking cues from Russia's distinct X-winged Lancet series of loitering munitions.\nRussia's Lancet DronesThe Russian loitering munitions going under the name \"Lancet\" actually constitute an entire lineup of kamikaze drones, all of them featuring a distinctive single or dual X-wing design.\nIn February, Ukraine announced that it would begin the production of its own Lancet-style drone, signaling a begrudging recognition of the Russian UAV design's potential.\nIran's DronesIran's drone manufacturers have created over 50 different drone designs, from short-range tactical UAVs and loitering munitions to rocket and propeller-powered long-range reconnaissance, attack and electronic warfare drones."}, {"id": "4bc46d0b-6f09-4542-ba39-f50a3782e572", "title": "Ukraine war briefing : Russia making gains from slow western aid , says Nato chief", "date": "2024-04-30 01:15", "url": "https://www.theguardian.com/world/2024/apr/30/ukraine-war-briefing-russia-making-gains-from-slow-western-aid-says-nato-chief", "message": "Ukrainian navy spokesperson Dmytro Pletenchuk said the strike was conducted by an Iskander-M ballistic missile with a cluster warhead.\nA Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday, according to local officials.\nUkraine’s allies have accused North Korea of transferring weapons to Russia for use against Ukraine in violation of an arms embargo.\nThe US has accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\nRussia in March vetoed the renewal of sanctions monitoring against North Korea’s nuclear and ballistic missile programmes."}, {"id": "60b05145-c769-4cfe-bfa8-bbfcbaa29e79", "title": "Joining Forces Against Terrorism : Japan New Law Commits More ThanWords to U . S . Effort", "date": "2024-04-29 23:00", "url": "https://www.heritage.org/homeland-security/report/joining-forces-against-terrorism-japans-new-law-commits-more-thanwords-us", "message": "By moving beyond the country's prior policy of non-involvement, the law will allow Japan's self-defense forces (SDF) to support the efforts of the U.S. forces in Afghanistan.\nFor Japan, this new approach means the Diet must amend the laws governing the self-defense forces and the Maritime Safety Agency.\nTherefore, the Administration should support Japan through active diplomacy around the Asia-Pacific region and through its own \"proactive\" public diplomacy program.\nFinally, when Japan's self-defense forces do deploy, they should be fully integrated into the defense architecture in regions where the war on terrorism is being waged.\nBy passing the anti-terrorism law, permitting Japan's self-defense forces to deploy to the Persian Gulf, the Diet has greatly aided Prime Minister Koizumi's effort to develop a new consensus in Japan on collective self-defense."}, {"id": "3461d748-8d95-4e2f-a5c0-64124293e329", "title": "Austria Urges Global Action on  Killer Robot as AI Weapon Concerns Rise", "date": "2024-04-29 21:15", "url": "https://www.techtimes.com/articles/304094/20240429/austria-urges-global-action-killer-robots-ai-weapon-concerns-rise.htm", "message": "Austria has recently raised the alarm on the urgent need for global action to regulate artificial intelligence (AI) in weapons systems amid growing concerns over the development of so-called 'killer robots,\" Reuters reports.\nAt the meeting, Austria discussed the ethical and legal challenges posed by the advancement of AI technology in warfare.\n(Photo: GENYA SAVILOV/AFP via Getty Images)Austria Calls for Urgent Action on AI Weapons ControlDuring the conference, Austrian Foreign Minister Alexander Schallenberg stressed the necessity of agreeing on international rules and norms to ensure human control over AI weapons.\nConcerns over the accuracy and reliability of AI systems have been raised, with examples ranging from misrecognizing objects to causing fatal accidents in civilian contexts.\nMeanwhile, Ukraine's efforts to develop AI drones with image recognition targeting systems further highlight the global trend toward AI-driven warfare."}, {"id": "4f1b1fcf-a750-4b90-ba59-7c8d7f92d876", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-04-29 09:00", "url": "https://www.swindonadvertiser.co.uk/news/national/24284585.teenagers-plotted-attack-jewish-people-sydney-stabbing-police-say/", "message": "Five teenagers, aged 14 to 17, were charged in a Sydney court on Thursday last week with a range of offences including conspiring to engage in or planning a terrorist act.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nThe boy accused of stabbing Emmanuel and a priest was charged with committing a terrorist act, a crime that carries a potential maximum penalty of life in prison.\nThe parents were in hiding for fear of reprisals after rioting broke out around the church within hours of the stabbing."}, {"id": "600ae65e-b484-4017-a521-ebc4896b6833", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-04-29 10:00", "url": "https://www.bucksfreepress.co.uk/news/national/24284585.teenagers-plotted-attack-jewish-people-sydney-stabbing-police-say/", "message": "Five teenagers, aged 14 to 17, were charged in a Sydney court on Thursday last week with a range of offences including conspiring to engage in or planning a terrorist act.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nThe boy accused of stabbing Emmanuel and a priest was charged with committing a terrorist act, a crime that carries a potential maximum penalty of life in prison.\nThe parents were in hiding for fear of reprisals after rioting broke out around the church within hours of the stabbing."}, {"id": "505e4268-3fb8-4332-8ca0-a0972dfd8b52", "title": "Suspected missile attack by Yemen Houthi rebels damages ship in the Red Sea : authorities", "date": "2024-04-29 19:45", "url": "https://www.theglobeandmail.com/world/article-suspected-missile-attack-by-yemens-houthi-rebels-damages-ship-in-the/", "message": "Open this photo in gallery: Yemen's capital Sana'a is seen on a map.The Associated PressA suspected missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virginio Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led air strike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "806c8604-8831-46d6-8b5a-d9b3dffdf627", "title": "World Central Kitchen resumes operations in Gaza after seven aid workers killed", "date": "2024-04-28 23:00", "url": "https://www.independent.co.uk/news/world/middle-east/world-central-kitchen-resume-gaza-b2536172.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}World Central Kitchen, the humanitarian group that saw seven of its aid workers killed in an Israeli airstrike earlier this month, said they resumed operations in Gaza on Sunday.\nNow, weeks later, WCK is resuming its work to help get as much food into Gaza, including northern Gaza, as possible.\nIsrael’s offensive in Gaza, sparked by Hamas’ October 7 attack in which 1,200 people were killed and 250 were taken hostage, has caused widespread devastation with more than 33,000 people killed.\nAmong those deaths are journalists and other humanitarian workers."}, {"id": "f0f99a1e-6207-43fb-8c52-65b6c4a9df54", "title": "Hamas alleges rocket barrage from Lebanon into northern Israel", "date": "2024-04-29 16:00", "url": "https://dailystar.com.lb/hamas-rocket-barrage-lebanon-northern-israel/", "message": "On Monday, the Ezzedine al-Qassam Brigades, the military wing of Hamas, launched a series of rockets from southern Lebanon targeting a northern Israeli military command center.\nIn response, the Israeli military reported intercepting most of the approximately 20 rockets launched from Lebanon and conducted strikes on the launch sites.\nFollowing the rocket barrage, an Israeli drone struck the town of Aita al-Shaab in southern Lebanon.\nEarlier in the year, a U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut, a Hezbollah stronghold.\nIn March, another Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre, while a Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley."}, {"id": "053f146c-f6a9-4628-b932-9b13ad968058", "title": "April 27 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-04-29 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/04/mil-240428-presstv12.htm", "message": "April 27: 'Axis of Resistance' operations against Israeli occupationIran Press TVSunday, 28 April 2024 7:49 AMBy Press TV Website StaffAmid Israel's genocidal war on Gaza, which has killed more than 34,400 Palestinians so far, including more than 16,000 children, resistance groups in Palestine and across the region continue their operations against the Tel Aviv regime and its Western backers.\nThe major operations carried out by the Palestinian and regional resistance groups on Saturday, April 27, are as follows:Al-Aqsa Martyrs Brigades' operations on April 27:(Gaza Strip)Targeted Israeli forces who stormed the Gaza City on the axis of Al-Salam roundabout with a heavy barrage of bullets.\nMujahideen Brigades' operations on April 27:(Gaza Strip)Bombed the settlement of \"Sderot\" with a barrage of rockets.\nWestern sector:At around 08:30 local time, Israeli soldiers, west of the Shomera settlement, were targeted with missiles.\nIslamic Resistance in Iraq's operations on April 27:(Iraq)Carried out a drone strike against a vital military target in the occupied city of Haifa."}, {"id": "46dccedc-c366-4205-90c4-5c9ff71cf371", "title": "Hamas claims rocket barrage from Lebanon into north Israel", "date": "2024-04-29 10:15", "url": "https://www.firstpost.com/world/hamas-claims-rocket-barrage-from-lebanon-into-north-israel-13764997.html", "message": "AdvertisementAccording to a Telegram announcement from the Ezzedine al-Qassam Brigades, Hamas forces “have fired a concentrated rocket barrage from south Lebanon towards” an Israeli military position.\nAs a “response to the massacres of the Zionist enemy (Israel)” in Gaza and the occupied West Bank, the armed wing explained the attack.\nThe latest rocket barrage came as Hamas negotiators were expected to arrive in Egypt on Monday, where they were due to respond to Israel’s latest proposal for a long-sought truce in Gaza and hostage release.\nOn April 21, the Qassam Brigades claimed a rocket barrage into northern Israel.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold."}, {"id": "2bdeff5d-ec9e-4e82-a967-a1196aed9e54", "title": "Yemen Houthi rebels claim downing US Reaper drone , release footage showing wreckage of aircraft", "date": "2024-04-28 23:00", "url": "https://wtop.com/world/2024/04/yemens-houthi-rebels-claim-downing-us-reaper-drone-release-footage-showing-wreckage-of-aircraft/", "message": "JERUSALEM (AP) — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing…JERUSALEM (AP) — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nU.S. Air Force Lt. Col. Bryon J. McGarry, a Defense Department spokesperson, acknowledged to The Associated Press on Saturday that “a U.S. Air Force MQ-9 drone crashed in Yemen.” He said an investigation was underway, without elaborating.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sank another since November, according to the U.S. Maritime Administration.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen."}, {"id": "bb57b22d-c6cd-43b7-8fc5-de2f9214585d", "title": "Houthi rebels claim downing US drone , release footage of wreckage", "date": "2024-04-28 16:15", "url": "https://www.militarytimes.com/news/your-military/2024/04/28/houthi-rebels-claim-downing-us-drone-release-footage-of-wreckage/", "message": "JERUSALEM — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week."}, {"id": "a5105436-da16-43ad-9de3-b97fcbd1779f", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure."}, {"id": "ec138ab6-da9a-4c2a-bf65-c7e4398f2b57", "title": "Handing Iran a Victory", "date": "2024-04-30 06:15", "url": "https://pjmedia.com/james-robbins/2024/04/29/handing-iran-a-victory-n4928600", "message": "Iran launched around 300 weapons from locations in Iran, Syria, and Yemen, including over 110 medium-range ballistic missiles, more than 30 land-attack cruise missiles, and over 150 uncrewed aerial vehicles.\nThe numbers tell us this was a concerted attack, a major effort by Iran to inflict pain on Israel.\nOnly a few of the incoming Iranian weapons got through, and they did little material damage.\n“I found few people out there who really believe Khe Sanh could be held if the North Vietnamese were determined to take it,” he reported .\nImagine if those 300 Iranian weapons had gotten through."}, {"id": "ff29c481-c5bc-4f7c-913a-43bc2e8553b6", "title": "Houthi rebels claim downing US drone , release footage of wreckage", "date": "2024-04-28 15:45", "url": "https://www.navytimes.com/news/your-military/2024/04/28/houthi-rebels-claim-downing-us-drone-release-footage-of-wreckage/", "message": "JERUSALEM — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week."}, {"id": "c2a29fc3-2e1e-4589-91fc-3a68aa4b76e2", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when."}, {"id": "4c0a8302-e78f-43e0-a6ba-ed2425be9f49", "title": "Sydney teenager charged after counter - terrorism raids texted  were going to kill , court hears | Australia news", "date": "2024-04-30 10:15", "url": "https://www.theguardian.com/australia-news/2024/apr/30/sydney-teenager-charged-after-counter-terrorism-raids-texted-were-going-to-kill-court-hears-ntwnfb", "message": "A 16-year-old Sydney boy charged with terrorism offences has been denied bail over fears for community safety after a court heard he messaged another young person “we’re going to kill”.\nSix teenagers were charged after counter-terrorism raids in Sydney last week, with two of them appearing in the children’s court at Parramatta on Tuesday.\n“We were planning big stuff bro, it’s conspiracy for a terrorist attack I think,” the court heard he wrote in a text message.\nThe court heard the 16-year-old’s parents, who were present for the hearing, wrote an affidavit describing an “excellent son” who was a good student.\nThe material allegedly included a video of an assault with the Islamic State symbol watermarked over the video."}, {"id": "e52d3aca-ef24-412d-8af6-49bf4bdad9d7", "title": "Somalia - Six Hormuud Telecom Staff Killed in Tragic Mogadishu Blast", "date": "2024-04-29 13:15", "url": "https://allafrica.com/stories/202404290199.html", "message": "Mogadishu, Somalia — On the afternoon of April 28, 2024, a devastating explosion rocked the outskirts of Mogadishu, Somalia, claiming the lives of six employees of Hormuud Telecom, the country's largest telecommunications company.\nHormuud Telecom confirmed the deaths of their staff members in a statement expressing deep condolences to the families, friends, and colleagues of the victims.\nThe explosion is part of a disturbing pattern of violence against commercial companies in Somalia, with Hormuud Telecom being a frequent target.\nHormuud Telecom has vowed to continue its operations despite the challenges, emphasizing its commitment to providing essential telecommunications services to the Somali people.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones."}, {"id": "950077fc-105e-4b09-951f-3c38fcff243b", "title": "Anti - Taliban resistance leader says a terrorist attack on U . S . soil is a  matter of when not if  in chilling warning to the Biden administration about the surge in extremism in Afghanistan since the withdrawal", "date": "2024-04-29 15:00", "url": "https://www.dailymail.co.uk/news/article-13347195/Anti-Taliban-resistance-leader-says-terrorist-attack-U-S-soil-matter-not-chilling-warning-Biden-administration-surge-extremism-Afghanistan-withdrawal.html", "message": "The leader of the anti-Taliban resistance in Afghanistan has issued a chilling warning that a new terrorist attack on America is a matter of 'when not if'.\nMany years ago, while he was still in Panjshir, Massoud started working on his memoir.\nThe resistance is almost solely fighting alone now Western forces have turned their backs on a country ravaged by war.\nBut their opponents are well-equipped and still have access to the billions of dollars in weapons left behind when foreign forces left two years ago.\nFormer head of U.S. Central Command General Kenneth F. McKenzie Jr has warned the threat from the Islamic State has grown since American forces left, and the desire to attack the U.S. is getting stronger."}, {"id": "29b013da-28df-4643-93b5-62d200276251", "title": "Israeli military hit 270 Gaza terror targets since start of Passover Holiday", "date": "2024-04-28 16:15", "url": "https://www.devdiscourse.com/article/international/2920628-israeli-military-hit-270-gaza-terror-targets-since-start-of-passover-holiday", "message": "Tel Aviv [Israel], April 28 (ANI/TPS): The Israel Defence Forces (IDF) said that over the first six day of the Passover holiday its forces attacked about 270 terrorist targets throughout the Gaza Strip, of which more than 20 were terror infrastructures that were aimed at the territory of Israel.\nIn the attacks rocket launch sites were destroyed.\nIn addition, the IDF attacked a launch site located in the designated humanitarian area in the southern Gaza Strip, using Israel Air Force aircraft.\nThe launch site was loaded and attacked before it could launch rockets at Israeli territory.\nThe IDF said that this was \"further evidence of Hamas's cynical use of civilian spaces for terrorist purposes.\""}, {"id": "4f9b3c7a-0995-4781-b086-be9ccc33cfa2", "title": "Yemen drone attack kills women and children", "date": "2024-04-29 04:15", "url": "https://www.bssnews.net/news/186035", "message": "DUBAI, April 28, 2024 (BSS/AFP) - A drone attack in Yemen killed fivecivilians on Saturday, according to both the Huthi rebels and governmentsources who accused each other of being behind the strike.\n\"Three women and two children were killed when they went to fetch water froma well,\" said the rebel-controlled health ministry, pointing the finger ofblame at forces loyal to the government.\nThe attack was in Taez province, in a government-held area near the frontlines.\nThe Iran-backed Huthis seized control of Yemen's capital Sanaa in 2014,prompting a Saudi-led military intervention the following year.\nWhile hostilities in Yemen have remained low since the expiry of a six-monthtruce brokered in April 2022, sporadic fighting flares in the ArabianPeninsula country."}]