[{"id": "011ceabc-c09c-4626-8ee1-e02d29d859e6", "title": "New York University issues new guidelines discouraging anti - Zionism", "date": "2024-08-24 00:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-816095", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Students and faculty who discriminate against or harass “Zionists” may be violating New York University’s hate speech policies, according to the school’s updated guidelines for the fall semester.\nIn July, Meta banned the use of “Zionist” as a cover for attacks on Jews or Israelis on its platforms.\nPro-Palestinian activists claim that targeting “Zionists” is not antisemitic because not all Jews identify as Zionists.\nNYU also recently settled a discrimination lawsuit brought by Jewish students.\nThe guidelines do not distinguish between targeting Jews and targeting Zionists, nor do they address the presence of anti-Zionist Jews in many of the campus protests; one such NYU group calls itself Jews Against Zionism."}, {"id": "0ae628d4-762e-4c3d-8a8b-94a984525427", "title": "RFK Jr . ends long - shot presidential campaign , which included series of bizarre comments about Jews", "date": "2024-08-24 00:00", "url": "https://www.jta.org/2024/08/23/politics/rfk-jr-ends-long-shot-presidential-campaign-which-included-series-of-bizarre-comments-about-jews", "domain": "jta.org", "domain_classification": "Unknown", "message": "Independent presidential candidate Robert F. Kennedy Jr., who injected outlandish comments about Jews into the national dialogue and also vocally supported Israel, suspended his campaign Friday and said he would support Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy said.\nEven amid such statements, Kennedy enjoyed support from some vocally pro-Israel Jews.\nMorton Klein, head of the right-wing Zionist Organization of America, was an Israel advisor to the campaign.\nKennedy, whom Trump has hinted could serve in his cabinet, would not be the first Trump ally to traffic in antisemitic conspiracy theories."}, {"id": "4716903b-8749-40db-bcc3-0e0546d1135f", "title": "Suspect In Blast Outside French Synagogue Wrapped In Palestinian Flag", "date": "2024-08-24 16:30", "url": "https://www.i24news.tv/en/news/international/europe/artc-suspect-in-blast-outside-french-synagogue-reportedly-decked-out-in-full-palestinian-gear", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "A blast early on Saturday outside a synagogue in southern France involved a suspect decked out in Palestinian emblems, police said, pointing out the incident was being treated as a potential terror attack.\nAuthorities beefed up security around Jewish sites following the early Saturday blast outside the Beth Yaacov synagogue in the seaside resort of La Grande Motte, near the city of Montpellier.\nTwo cars outside the synagogue burst into flames apparently after a gas canister blew up inside one of the vehicles, police said.\nThe Representative Council of Jewish Institutions in France (CRIF) branded the incident \"an attempt to kill Jews.\"\nHe also announced the strengthening of security around Jewish places of worship."}, {"id": "e149adc9-0bb8-4191-86fa-45e700942750", "title": "What I learned when a Brooklyn bookstore canceled a discussion of Judaism over my Zionism", "date": "2024-08-24 16:30", "url": "https://forward.com/opinion/647736/what-i-learned-when-a-brooklyn-bookstore-canceled-a-discussion-of-judaism-over-my-zionism/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Forwarding the News Thoughtful, balanced reporting from the Forward and around the web, bringing you updated news and analysis of the crisis each day.\nBut first, after being canceled, we all stood on the sidewalk for a few minutes, getting our wits about us.\nCountless emails and messages included the words, “We may not agree on everything, Andy, but …” Nothing more needed to be said.\nThere is a story that the historian George Mosse’s students used to tell about the 1960s anti-war protests in Madison, Wisconsin.\nOh to have the chance to engage this bookstore censor over which particular Zionism she was objecting to."}]