[{"id": "66975336-ef71-4179-be27-bd1d6fa45100", "title": "hamas chief assassination : Bomb smuggled into Iran guesthouse months ago killed Hamas leader", "date": "2024-08-02 05:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/bomb-smuggled-into-iran-guesthouse-months-ago-killed-hamas-leader/articleshow/112213238.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "c1e139d5-f738-4084-8dbe-8fb8fbf82c67", "title": "Hamas  beehive  leadership ensures survival despite Haniyeh killing – Firstpost", "date": "2024-08-02 06:30", "url": "https://www.firstpost.com/opinion/hamas-beehive-leadership-ensures-survival-despite-haniyehs-killing-13799960.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "An Iranian source told the pro-Hezbollah Lebanese Al Mayadeen news site that a missile fired from another country killed Haniyeh.\nOn April 10, his three sons and three grandchildren were killed in an Israeli airstrike in the Gaza Strip.\nOn June 25, his 10 family members, including his 80-year-old sister, were killed in an Israeli airstrike on Gaza’s al-Shati refugee camp.\nAdvertisementEarlier, Haniyeh was the Hamas leader in Gaza and also represented it abroad.\nHe was appointed Hamas leader after Yassin and his successor Abdel-Aziz Al-Rantissi were eliminated in Israeli airstrikes in March and April 2004, respectively."}, {"id": "429cad20-f507-4ccd-a1dc-f4fea3f25ed9", "title": "Report Claim Hamas Leader Haniyeh Killed by Bomb Planted in Guesthouse Two Months Ago", "date": "2024-08-02 07:30", "url": "https://www.newsx.com/world/report-claim-hamas-leader-haniyeh-killed-by-bomb-planted-in-guesthouse-two-months-ago/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "The bomb had been planted around two months prior to his arrival.\nWhile Israel has not publicly claimed responsibility for the assassination, NYT reported that Israeli intelligence officials briefed the United States and other Western governments on the operation’s details.\nHowever, Secretary of State Antony Blinken stated that the United States was not informed in advance about the assassination plot.\nA public funeral ceremony for Haniyeh was held in Tehran on Thursday, where crowds of mourners gathered to pay their respects.\nThe assassination of Haniyeh occurred just hours after Israel conducted an airstrike in Beirut, Lebanon, killing Fuad Shukr, a military commander of Hezbollah, an ally of Hamas."}, {"id": "023bdd1a-6922-4008-a7b5-123677acdc19", "title": "PLAYING COY : Asked About Haniyeh Killing , IDF Spokesman Says Israel Only Carried Out Airstrike In Lebanon", "date": "2024-08-02 04:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2301935/playing-coy-asked-about-haniyeh-killing-idf-spokesman-says-israel-only-carried-out-airstrike-in-lebanon.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "IDF Spokesman Rear Adm. Daniel Hagari played coy when asked about Israeli involvement in the assassination of Hamas leader Ismail Haniyeh, saying that the military only carried out one airstrike on Tuesday night, which killed Hezbollah military chief Fuad Shukr in Beirut.\n“We struck on Tuesday night in Lebanon and killed Fuad Shukr in an accurate aerial strike.\nI want to emphasize, there was no other aerial strike, not a missile and not an Israeli drone, in the entire Middle East that night, and I won’t comment further,” Hagari said.\nThis statement comes after The New York Times reported that Haniyeh’s death was caused by a sophisticated, remote-controlled bomb smuggled into his room at a Tehran guesthouse, where he was staying for the inauguration of Iran’s new president.\nIran has vowed to exact revenge on Israel for Haniyeh’s death, although Jerusalem has neither confirmed nor denied involvement."}, {"id": "ab32169c-5f51-45cf-9f1f-709a84b817fe", "title": "Fears Iran will hit Israel on  five front at any moment", "date": "2024-08-02 00:15", "url": "https://www.dailymail.co.uk/news/article-13700401/Fears-Iran-hit-Israel-five-fronts-moment-revenge-assassination-Hamas-boss-Ismail-Haniyeh-Tehran.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel is braced for an Iranian assault on five fronts ‘at any moment’ in revenge for the assassination of a Hamas boss on its soil.\nSupreme leader Ali Khamenei has instructed the Islamic republic’s Supreme National Security Council to launch a direct attack on Israel.\nHamas political chief Ismail Haniyeh was killed in his sleep at 2am on Wednesday after visiting Tehran for the presidential inauguration.\nWhile Israel has not claimed responsibility it is the fourth high-profile Hamas leader assassinated since October 7 and it is said to be ticking off a ‘kill list’.\nJust 12 hours before Haniyeh’s death, Israel killed Fuad Shukr, the military leader of Hezbollah, another Iranian proxy in Lebanon."}, {"id": "64e3d9e8-33e0-44d8-9527-00b785959eca", "title": "Israel Hamas conflict : Al Jazeera journalists killed in reported Israeli airstrike", "date": "2024-08-02 00:00", "url": "https://www.9news.com.au/world/al-jazeera-journalists-killed-in-reported-israeli-airstrike-in-gaza-network-says/4ab411bb-81a3-4bbf-b1d1-0cd73a2ceb29", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Undated photos of Al Jazeera staffers Ismail Al-Ghoul and Rami Al-Rifi (L-R).\nThe Al Jazeera bureau chief for Israel and Palestine, Walid Al Omari, said Thursday the claim Al-Ghoul was a member of Hamas' military wing was \"completely false.\"\nThe CPJ asked Israel to explain the killing of both Al Jazeera staffers, in what it said, \"appears to be a direct strike.\"\nKhader Al-Za'anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul's bloodied flak jacket."}, {"id": "93848fd7-b4bf-4c1a-8a21-f8a20482586f", "title": "Hezbollah leader says war with Israel has entered  new phase  after killings of top militant figures | Nation and World", "date": "2024-08-02 00:15", "url": "https://www.reviewjournal.com/news/nation-and-world/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures-3106243/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael did confirm it carried out the strike Tuesday in Beirut that killed Hezbollah commander Fouad Shukur, along with an Iranian military adviser and at least five civilians.\nHezbollah denied being behind that strike, a denial that Hezbollah leader Hassan Nasrallah reiterated.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad terrorist group and Hezbollah, and Iranian media showed him and Pezeshkian hugging."}, {"id": "61f78fe7-d0bb-4344-9d16-f43553d6b68f", "title": "Israel sustains deadly aggression on Lebanon , Hezbollah responds with dozens of rockets", "date": "2024-08-02 05:30", "url": "https://www.presstv.ir/Detail/2024/08/02/730523/Israel-attack-Lebanon-Hezbollah-response-rockets-Shukr-Haniyeh-assassination", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The Israeli regime sustains its deadly aggression against southern Lebanon after its recent assassination of a senior Hezbollah commander, prompting the Lebanese resistance movement to respond with dozens of retaliatory rockets.\nIt also followed the regime’s assassination of Ismail Haniyeh, the Palestinian resistance movement Hamas’ Political Bureau Chief, in the Iranian capital of Tehran.\nMost recently, the Hezbollah leader said fighting against the regime had entered “a new phase” after the dual assassinations.\nThe Israeli regime has been conducting sporadic attacks on Lebanon since October 7, 2023, when it launched a genocidal war against the Gaza Strip.\nHezbollah fought off two Israeli wars against Lebanon in 2000 and 2006, forcing a humiliating retreat upon the Tel Aviv regime’s military on both occasions."}, {"id": "958a794b-afd3-4024-b0fc-480419756d33", "title": "Hezbollah launches rocket attacks on Israel in response to airstrike", "date": "2024-08-02 07:30", "url": "https://www.chinadailyhk.com/hk/article/589666", "domain": "chinadailyhk.com", "domain_classification": "Unknown", "message": "(PHOTO / AFP)BEIRUT/SANAA - Lebanese militant group Hezbollah announced on Thursday that it targeted Israeli sites with rockets in response to an airstrike on southern Lebanon that killed four Syrians.\nThe latest attacks came amid rising tensions between Hezbollah and Israel following Tuesday's Israeli attack on Dahieh in Beirut's southern suburbs, killing Hezbollah's top military commander, Fouad Shokor.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli attack at the appropriate time and place.\n(PHOTO / AFP)\"The stance of the 'axis of resistance' is unequivocal: There must be a military response to Israeli transgressions,\" al-Houthi said in a televised address.\nIran has accused Israel of carrying out the assassination, though Israel has not confirmed its involvement."}, {"id": "db80b04c-0bad-4ae4-b9f6-f5d5e70d2d71", "title": "Israel - Hamas war latest : A cease - fire is key to ending the region cycle of violence , Blinken says", "date": "2024-08-02 07:00", "url": "https://www.newsday.com/news/nation/israel-hamas-war-latest-1-august-2024-t39005", "domain": "newsday.com", "domain_classification": "Unknown", "message": "The remarks came as prayers were held by Iran’s Supreme Leader Ayatollah Ali Khamenei and representatives of Palestinian militia groups for Hamas leader Ismail Haniyeh and his bodyguard.\nAnd the Israeli military said Thursday it confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\n4 killed in Israeli strike on Lebanese village, officials sayBEIRUT — Lebanon’s Health Ministry says an Israeli airstrike on a southern village has killed four people and wounded five.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging."}, {"id": "904b56a9-ca2f-4ff9-8989-bb0bb640a88e", "title": "Haniyeh Killed By Bomb Placed In Tehran Guesthouse 2 Months Ago In Astounding Mossad Penetration Of IRGC Security", "date": "2024-08-02 00:00", "url": "https://www.zerohedge.com/geopolitical/haniyeh-killed-bomb-placed-tehran-house-2-months-ago-astounding-intel-penetration-irgc", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Compound where Haniyeh was killed, via NYT\"The bomb had been hidden approximately two months ago in the guesthouse, according to five of the Middle Eastern officials,\" the report continues.\nNo doubt they are 'spiking the football' and want the Iranians and the world to know the astounding level of success they had in penetrating IRGC security and protocol.\nIran's Ayatollah Ali Khamenei led prayers at the funeral for killed Hamas leader Ismail Haniyeh, via Zuma Press.\nIt was detonated remotely by Mossad operatives who were on Iranian soil after receiving intelligence that Haniyeh was indeed in the room.\nThat's when, NYT says, he \"issued an order to strike Israel in retaliation, according to the three Iranian officials.\""}, {"id": "a098ac32-c4a8-4cc0-99ca-5e6752e63270", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:15", "url": "https://www.wcti12.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "8211a702-8bf8-4b52-8d44-f2d8fbf8998a", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 03:30", "url": "https://fox17.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "6fc5413d-074c-498b-bc71-48c17b3a5f27", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:00", "url": "https://kval.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "kval.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "1f19f724-f6d6-41d1-ae77-8a5b89733a4c", "title": "Hezbollah leader says war with Israel has entered  new phase  after killings of top militant figures – Butler Eagle", "date": "2024-08-02 03:15", "url": "https://www.butlereagle.com/20240801/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures/", "domain": "butlereagle.com", "domain_classification": "Unknown", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments."}, {"id": "8bd0247b-31e1-4e43-a995-2b91cc0b8f5b", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:00", "url": "https://www.nbcmontana.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "17727d88-ffe2-45f9-aa44-f49dc9c6bb80", "title": "For Iran and Hezbollah , calibrating response to Israeli strikes leaves no room for error", "date": "2024-08-02 00:15", "url": "https://www.timesfreepress.com/news/2024/aug/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“They can also hit Israeli or Jewish targets globally.”Trita Parsi, executive vice president of the Quincy Institute for Responsible Statecraft, said he expects Iran’s response to be another direct hit on Israel.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said."}, {"id": "56c97148-c29e-4fb7-9fc8-35e7f9d1c8bb", "title": "Hezbollah launches rockets at Israel", "date": "2024-08-02 05:15", "url": "https://www.orissapost.com/hezbollah-launches-rockets-at-israel/", "domain": "orissapost.com", "domain_classification": "Unknown", "message": "Beirut: Lebanese militant group Hezbollah has announced that it targeted Israeli sites with rockets in response to an airstrike on southern Lebanon that killed four Syrians.\nHezbollah added that it also attacked the Jal al-Alam site with rockets, Xinhua news agency reported.\nThe Israeli army in a statement said that five projectiles crossed from Lebanon into Israel, some of which were intercepted, and the rest fell in open areas.\nThe latest attacks came amid rising tensions between Hezbollah and Israel following Tuesday’s Israeli attack on Dahieh in Beirut’s southern suburbs, killing Hezbollah’s top military commander, Fouad Shokor.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli attack at the appropriate time and place."}, {"id": "99c113c3-5fe2-4a21-9b83-0966111b9167", "title": "Haniyeh Killed By Bomb Planted In Tehran Guesthouse : NYT", "date": "2024-08-02 00:00", "url": "https://www.urdupoint.com/en/world/haniyeh-killed-by-bomb-planted-in-tehran-gues-1849443.html", "domain": "urdupoint.com", "domain_classification": "Unknown", "message": "The bomb was hidden inside the guesthouse approximately two months before Haniyeh’s visit, five of the Middle Eastern officials told the Times.\nQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was inside the room at around 2 a.m. local time.\nThe guesthouse Haniyeh was staying at is run and protected by the Islamic Revolutionary Guards Corps in Neshat, a neighborhood of northern Tehran.\nIn 2006, President Mahmoud Abbas appointed Haniyeh as Palestinian prime minister after Hamas won the most seats in national elections.\nHe was then elected head of Hamas’ political bureau in 2017 and was widely considered Hamas’ overall leader until his assassination."}, {"id": "802b0d9f-be6d-4e27-9343-5340e5f58e12", "title": "Haniyeh killed by bomb planted in Tehran guesthouse : NYT", "date": "2024-08-02 06:45", "url": "https://dunyanews.tv/en/World/828142-haniyeh-killed-by-bomb-planted-in-tehran-guesthouse-nyt", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Haniyeh killed by bomb planted in Tehran guesthouse: NYTWorld World Haniyeh killed by bomb planted in Tehran guesthouse: NYTQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was insideFollow on Published On: Fri, 02 Aug 2024 11:16:00 PKTNEW YORK (APP) – Top Hamas leader Ismail Haniyeh was assassinated on Wednesday by a bomb that was covertly smuggled into the Tehran guesthouse where he was staying two months before his arrival, according to a leading American newspaper.\nThe bomb was hidden inside the guesthouse approximately two months before Haniyeh’s visit, five of the Middle Eastern officials told the Times.\nQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was inside the room at around 2 am local time.\nThe guesthouse Haniyeh was staying at is run and protected by the Islamic Revolutionary Guards Corps in Neshat, a neighborhood of northern Tehran.\nHe was then elected head of Hamas’ political bureau in 2017 and was widely considered Hamas’ overall leader until his assassination."}, {"id": "e963db04-cf11-4e54-943d-55e0250d0a81", "title": "How bomb that killed Hamas chief Ismail Haniyeh was smuggled into Tehran guesthouse", "date": "2024-08-02 08:45", "url": "https://www.firstpost.com/explainers/hamas-chief-ismaeil-haniyeh-assassination-bomb-smuggling-into-tehran-guesthouse-13799923.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Initial reports of Ismail Haniyeh’s assassination stated that the Hamas political leader was killed by an ‘airborne projectile’.\nThe assassinationAs per The New York Times report, the explosion that killed Haniyeh took place at around 2 am local time on August 7.\nPalestinian group Hamas’ top leader Ismail Haniyeh attends Iran’s new President, Masoud Pezeshkian’s swearing-in ceremony at the parliament in Tehran, Iran on July 30.\nMore on Ismail Haniyeh’s assassination:How Iran sheltered Hamas leader Ismail HaniyehIs Ismail Haniyeh’s assassination a setback for Israel-Hamas peace talks?\nIsmail Haniyeh killed: The Hamas leaders who have been targets of assassination bidsAfter Ismail Haniyeh’s assassination, which Hamas leaders remain?"}, {"id": "c91c48a9-78c7-4ed0-bbfb-3df74c702d51", "title": "Hezbollah leader says war with Israel has entered  new phase  | News , Sports , Jobs", "date": "2024-08-02 09:00", "url": "https://www.ironmountaindailynews.com/opinion/columns/2024/08/hezbollah-leader-says-war-with-israel-has-entered-new-phase/", "domain": "ironmountaindailynews.com", "domain_classification": "Unknown", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments."}, {"id": "acaa8428-de14-4a9f-9d29-38844b89e65a", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:15", "url": "https://www.krcrtv.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "krcrtv.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "e21a5265-a7dd-4758-99aa-a899a24fb8a8", "title": "Israel Confirms Death of Hamas Leader Mohammed Deif - Novinite . com", "date": "2024-08-02 00:00", "url": "https://www.novinite.com/view_news.php?id=227506", "domain": "novinite.com", "domain_classification": "Unknown", "message": "The Israeli military has confirmed the death of Mohammed Deif, the military leader of Hamas, following an airstrike in Gaza.\nThe attack occurred on July 13 in a compound located in the Khan Younis area.\nIn addition to Deif, another high-ranking commander of the radical Palestinian group was also killed in the strike.\nThe Israeli forces have released a video showing the airstrike.\nWith Deif's death, along with the earlier assassination of Ismail Haniyeh, Yahya Sinwar remains the only top Hamas leader still believed to be alive and reportedly hiding in Gaza."}, {"id": "cda84231-be71-4a14-b1de-302ebe73e9dc", "title": "15 killed by Israeli bombing in Gaza City", "date": "2024-08-02 05:30", "url": "https://www.bssnews.net/news/202367", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "GAZA, Aug 2, 2024 (BSS/XINHUA) - At least 15 Palestinians were killed during an Israeli bombing of a school sheltering displaced families in the Shujaiya neighborhood of Gaza City on Thursday, the Palestinian official news agency WAFA reported.\nThe Israeli airstrike targeted the Dalal Mughrabi school, and the victims included women and children, WAFA said.\nMeanwhile, the Israel Defense Forces (IDF) said in a statement that the Israeli Air Force, based on intelligence, struck \"terrorists\" operating inside a compound within the Dalal Mughrabi School.\n\"The compound was used by Hamas as a hideout for commanders and operatives and to plan terror attacks against the State of Israel,\" said the IDF.\nIsrael has launched a large-scale offensive against Hamas in the Gaza Strip since Oct. 7, 2023, after Hamas carried out a surprise attack on southern Israel, during which about 1,200 people were killed and about 250 were taken hostage."}, {"id": "b4f46d38-613e-417d-a689-ddaebef32fed", "title": "Mohammed Deif , Hamas military leader who eluded Israel for decades , is claimed to be dead – Winnipeg Free Press", "date": "2024-08-02 04:45", "url": "https://www.winnipegfreepress.com/world/2024/08/01/mohammed-deif-hamas-military-leader-who-eluded-israel-for-decades-is-claimed-to-be-dead", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel’s claim.\nOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation."}, {"id": "42315774-e84d-4080-94e2-38a8fb5b6b78", "title": "Israel - Hamas war latest : A cease - fire is key to ending the region cycle of violence , Blinken says", "date": "2024-08-02 05:30", "url": "https://www.aspendailynews.com/associated_press/israel-hamas-war-latest-a-cease-fire-is-key-to-ending-the-regions-cycle-of/article_5e1999d6-d7ca-536c-8cf7-01cf30b8b1c5.html", "domain": "aspendailynews.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: A cease-fire is key to ending the region's cycle of violence, Blinken saysU.S. Secretary of State Antony Blinken is calling for “all parties” in the Middle East to avoid escalatory actions that could plunge the region into further conflict"}, {"id": "81babad2-7ceb-4a67-9e12-b4462d65bef1", "title": "AP News in Brief at 11 : 04 p . m . EDT | iNFOnews | Thompson - Okanagan News Source", "date": "2024-08-02 03:30", "url": "https://infotel.ca/newsitem/world-briefly/cp1786753287", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Russia released 16 people, including Wall Street Journal reporter Evan Gershkovich and Paul Whelan, a corporate security executive from Michigan.\nIsrael has not claimed responsibility for Haniyeh’s assassination, but comments by Israeli military spokesman Rear Adm. Daniel Hagari stopped short of an outright denial.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nSummer McIntosh and Kate Douglass strike goldNANTERRE, France (AP) — It wasn't the medal Katie Ledecky would've preferred.\n___Simone Biles makes history with second all-around Olympic gymnastics title, 8 years after her firstPARIS (AP) — Simone Biles huddled with Sunisa Lee."}, {"id": "aafbaa85-57b9-44d8-95d4-8ebd99bfb058", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:00", "url": "https://cbs6albany.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "cbs6albany.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "0ed6e9f9-48e7-44fe-991e-e7b6136d25a1", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 00:00", "url": "https://local21news.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "local21news.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "3c122e8d-7807-4397-b5c6-fd21eea0ab0f", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 01:45", "url": "https://cbs4local.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "cbs4local.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "fd0da2b0-bac4-4a0b-b459-0427065048ee", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 03:15", "url": "https://www.ktxs.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "ktxs.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "8299b6f8-2128-496d-8175-2c3136a52b54", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 03:15", "url": "https://myfox28columbus.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "myfox28columbus.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "64656cc8-ea05-4c9f-9008-e20e76fe9fd2", "title": "Israel history of targeting Hamas , enemies located across the Middle East", "date": "2024-08-02 04:45", "url": "https://mynews4.com/news/nation-world/israels-history-of-targeting-hamas-enemies-located-across-the-middle-east-ismail-haniyeh-deadly-missile-attacks-airstrikes-assassination-iran-islamic-revolutionary-guard-corps-palestine-gaza-hostages", "domain": "mynews4.com", "domain_classification": "Unknown", "message": "Notorious Hamas leader Ismail Haniyeh and his bodyguard died in Iran earlier this week with an explosive secretly placed in the guest room where he was staying, several outlets are reporting.\nThe New York Times on the killing cited multiple Middle East sources, including members of Iran's Islamic Revolutionary Guard Corps.\nOne example came in 2010, when senior Hamas leader Mahmoud al-Mabhouh was killed in a hotel in Dubai.\nIn 2004, an Israeli helicopter fired two missiles on the white Subaru of top Hamas leader -- Abdel Aziz Rantisi -- killing him and his bodyguards.\nIt appeared on the phones of some 50,000 people, all of whom were located in countries known for spying on their citizens, The Washington Post in 2021."}, {"id": "66a07be7-a7be-43e3-9f5d-48a1a36a1da2", "title": "Israel Palestine Conflict : Hamas leader Ismail Haniyeh assassinated in Tehran just hours after boasting of his safety", "date": "2024-08-02 09:30", "url": "https://timesofindia.indiatimes.com/world/middle-east/hamas-leader-ismail-haniyeh-assassinated-in-tehran-just-hours-after-boasting-of-his-safety/articleshow/112218964.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Hamas leader Ismail Haniyeh was assassinated in Tehran early Wednesday, mere hours after confidently boasting about his safety in the Iranian capital.\nAccording to reports from the New York Post, Haniyeh's assassination came amid his high-profile visit for the inauguration of President Masoud Pezeshkian, where he was also granted an audience with Iran 's Supreme Leader Ayatollah Ali Khamenei.Dressed in a white shirt and black jacket, Haniyeh was seen in footage discussing the perceived threats to his life while walking through Tehran.\n“Resistance means we are proud to walk the streets of civilised countries and travel from one nation to another,” Haniyeh declared in the footage.Tragically, Haniyeh was killed at 2 am Wednesday in an attack at his Tehran residence, which also claimed the life of one of his bodyguards.\nInitial claims from Hamas pointed to an Israeli airstrike as the perpetrator, but later reports suggested that a bomb, smuggled into the guesthouse months prior, was used in the attack.Haniyeh's rise from a childhood in a refugee camp and imprisonment in Israel during the 1980s to a life of opulence in Qatar highlighted his significant role in the extremist Muslim world.\nHis assassination occurred just after he had been seen cheering the October 7 Hamas attack on Israel from his luxury office in Qatar.While Israel has yet to comment on the incident, both Hamas and Iran have accused the Jewish state of orchestrating the assassination."}, {"id": "cbd0c7af-3ad1-4b66-abef-0aecaed4e30f", "title": "Iran holds funeral for Hamas chief Haniyeh", "date": "2024-08-02 04:15", "url": "http://usa.chinadaily.com.cn/a/202408/02/WS66ac39bca3104e74fddb8210.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Thousands of mourners paid respects to Haniyeh as the Israeli military confirmed that an airstrike in Gaza last month killed the Hamas military chief, Mohammed Deif.\n\"China is always committed to safeguarding peace and stability in the Middle East and is opposed to external interference.\nThe Gaza conflict has been going on for 300 days, resulting in nearly 40,000 deaths and an unprecedented humanitarian catastrophe, Fu said.\nThe UN Security Council adopted a resolution in early June aimed at reaching a comprehensive Gaza cease-fire deal in three phases.\nIran's first vice-president Mohammad Reza Aref said his country has no intention of escalating the Middle East conflict, state media reported."}, {"id": "070d2c9d-e755-481e-8f0b-cad9c19a84eb", "title": "Iran holds funeral for Hamas chief Haniyeh", "date": "2024-08-02 04:00", "url": "http://europe.chinadaily.com.cn/a/202408/02/WS66ac39bca3104e74fddb8210.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Thousands of mourners paid respects to Haniyeh as the Israeli military confirmed that an airstrike in Gaza last month killed the Hamas military chief, Mohammed Deif.\n\"China is always committed to safeguarding peace and stability in the Middle East and is opposed to external interference.\nThe Gaza conflict has been going on for 300 days, resulting in nearly 40,000 deaths and an unprecedented humanitarian catastrophe, Fu said.\nThe UN Security Council adopted a resolution in early June aimed at reaching a comprehensive Gaza cease-fire deal in three phases.\nIran's first vice-president Mohammad Reza Aref said his country has no intention of escalating the Middle East conflict, state media reported."}, {"id": "e0853107-c11c-48ed-9ba8-2ab0f377d2bc", "title": "Middle East Tensions : Rockets Fired From Lebanon Into Israel After Hezbollah Commander Killed", "date": "2024-08-02 04:00", "url": "https://www.outlookindia.com/international/middle-east-tensions-rockets-fired-from-lebanon-into-israel-after-hezbollah-commander-killed", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "Dozens of rockets were launched from southern Lebanon into northern Israel late Thursday, in the first attack since top Hezbollah commander Fuad Shukr was killed by Israeli strike earlier this week in Beirut.\nAccording to Israel's public broadcaster, KAN, the rockets were fired towards the Western Galilee, with 15 being intercepted by Israeli defences."}, {"id": "d377ae4a-bd2a-4e17-bd0e-4ebf842bbad2", "title": "Double assassination against Iran proxies is humiliation the ayatollahs cant affor", "date": "2024-08-02 01:45", "url": "https://www.ynetnews.com/article/h1bhxdtfr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "For Hamas, a leading Iranian proxy, Israel’s action will resound throughout what is left of the movement.\nHamas in Gaza is already on its knees, with thousands of terrorists killed and captured, many miles of tunnels blown up and munitions seized and destroyed.\nIt is no longer able to operate as a coherent military organization and its supply lines from Egypt have been cut.\nThe terrorist leader in Gaza, Yahya Sinwar, has been forced into survival mode.\nHis military lieutenant,Mohammed Deif, was killed in an Israeli air strike earlier this month"}, {"id": "5f52baed-6354-4546-9129-1cf40047c63c", "title": "Is the Middle East on a precipice after 300 days of war ? * WorldNetDaily * by David Brummer", "date": "2024-08-02 03:30", "url": "https://www.wnd.com/2024/08/analysis-is-middle-east-on-precipice-after-300-days-of-war/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "Then on Oct. 8, Iran’s powerful proxy Hezbollah, started firing ordnance into Israel’s north, creating the environment for a potential regional war.\nFor 300 days our sons and daughters, brothers and sisters, mothers and fathers, grandparents, have been languishing in the dungeons of Hamas in Gaza.\nEach second of every minute of every hour of these 300 days is a crime against humanity.\nThis is an existential war against a stranglehold of terrorist armies and missiles that Iran would like to tighten around our neck.\nTake for example, the administration’s attitude after Iran fired those hundreds of missiles at Israel back in April."}, {"id": "1183d42a-db84-4c80-a58a-248cd92cdf6a", "title": "Hezbollah says fired  dozen of rockets at north Israel", "date": "2024-08-02 03:30", "url": "https://www.bssnews.net/news/202325", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon, Aug 2, 2024 (BSS/AFP) - Hezbollah said it launched rockets at northern Israel Thursday \"in response\" to a deadly Israeli strike in south Lebanon -- the group's first attack after Israel killed a top commander earlier this week.\nThe Iran-backed group said in a statement that it \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on... (the southern village of Shama) that killed a number of civilians\".\nThe Israeli military said that shortly after the rocket fire, the air force \"struck the Hezbollah launcher from which the projectiles were launched\".\nEarlier Thursday, the Lebanese health ministry said four Syrians were killed in an Israeli strike on the south, where Hezbollah and Israel have exchanged near-daily fire since the Gaza war began in October.\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on the southern village of Shama, it said in a statement."}, {"id": "06d9a558-4367-4d48-a69c-f12fc25cf929", "title": "Iran Update , August 1 , 2024 | Institute for the Study of War", "date": "2024-08-02 04:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-august-1-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, August 1, 2024Andie Parry, Kelly Campa, Katherine Wells, Annika Ganzeveld, Siddhant Kishore, Alexandra Braverman, Ria Reddy, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nIran and its allies fired around 170 one-way attack drones, 30 cruise missiles, and 120 ballistic missiles at Israel in the April 2024 attack.\nIran could inadvertently trigger an expanded conflict with Israel and even the United States if Iran launches an attack along the lines described here.\n[15] Both cities are far more populated than the two remote locations that Iran targeted in April 2024.\n[41]Palestinian fighters continued to attack Israeli forces in Tal al Hawa, southwestern Gaza City, on August 1."}, {"id": "a1c13725-32ee-4246-92b2-c14ca6f7efc6", "title": "Hezbollah says fired  dozen of rockets at north Israel", "date": "2024-08-02 08:15", "url": "https://www.naharnet.com/stories/en/307009-hezbollah-says-fired-dozens-of-rockets-at-north-israel", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah fired overnight anti-aircraft missiles on Israeli warplanes in south Lebanon, forcing them to retreat beyond the border.\nThe group had launched rockets at northern Israel Thursday \"in response\" to a deadly Israeli strike in south Lebanon -- the group's first attack after Israel killed a top commander earlier this week.\nHezbollah said in a statement that it \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on... (the southern village of Shamaa) that killed a number of civilians\".\nEarlier Thursday, the Lebanese health ministry said four Syrians were killed in an Israeli strike on the south, where Hezbollah and Israel have exchanged near-daily fire since the Gaza war began in October.\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on the southern village of Shamaa, it said in a statement."}, {"id": "552bcf06-2980-4a29-9432-df3ceeb90557", "title": "Hezbollah says fired  dozen of rockets at north Israel", "date": "2024-08-02 09:00", "url": "https://www.naharnet.com:443/stories/en/307009-hezbollah-says-fired-dozens-of-rockets-at-north-israel", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah fired overnight anti-aircraft missiles on Israeli warplanes in south Lebanon, forcing them to retreat beyond the border.\nThe group had launched rockets at northern Israel Thursday \"in response\" to a deadly Israeli strike in south Lebanon -- the group's first attack after Israel killed a top commander earlier this week.\nHezbollah said in a statement that it \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on... (the southern village of Shamaa) that killed a number of civilians\".\nEarlier Thursday, the Lebanese health ministry said four Syrians were killed in an Israeli strike on the south, where Hezbollah and Israel have exchanged near-daily fire since the Gaza war began in October.\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on the southern village of Shamaa, it said in a statement."}, {"id": "064226fb-ea25-49f8-87c9-10759d1d7405", "title": "Yemen Houthis pledge solidarity and support for Lebanon if Israel invades – NaturalNews . com", "date": "2024-08-02 09:00", "url": "https://www.naturalnews.com/2024-08-01-yemen-houthis-pledge-solidarity-lebanon-israel-invasion.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "\"Our stance is unequivocal against any Israeli aggression towards Palestine, Yemen and Lebanon,\" Abdulsalam said.\nHe described Israel as an occupier of Palestinian, Syrian and Lebanese lands, portraying it as the aggressor in the region.\nDuring a call with French President Emmanuel Macron, Pezeshkian warned of severe consequences for Israel if it escalates its actions against Lebanon.\nIsrael has blamed Hezbollah for the attack, though eyewitnesses and reports suggest that the casualties were caused by an Israeli Iron Dome interceptor missile.\nYemen's Houthis attack bulk carrier in Red Sea with suicide drone boat – first time in this conflict."}, {"id": "2b843fd7-8444-471a-b926-40ca7700ffd3", "title": "Australia back Israel account of aid worker Zomi Frankcom killing : new report", "date": "2024-08-02 05:30", "url": "https://www.sbs.com.au/news/article/australian-report-backs-israels-account-of-aid-worker-killing-but-calls-for-apology-compensation/pdgmwmab8", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "In his report, Binskin assessed that the IDF strike on the WCK aid workers was not knowingly or deliberately directed against the WCK.\nSeven aid workers, including Frankcom, were killed in Gaza when their three-car convoy was targeted by the Israeli drones.\nThe United Nations says more than 250 aid workers have been killed since the war in Gaza began.\n\"The Australian government will persist until proper protections for aid workers are in place.\nThe Frankcom family issued this photo along with a statement paying tribute to Lalzawmi \"Zomi\" Frankcom (bottom centre), an Australian aid worker killed delivering food in Gaza."}, {"id": "7a1e0879-4442-4ea5-a852-ca95fb1c88df", "title": "Death of Hamas military leader Mohammed Deif , Oct . 7 mastermind , confirmed , Israel says", "date": "2024-08-02 02:45", "url": "https://www.ksl.com:443/article/51086400/death-of-hamas-military-leader-mohammed-deif-oct-7-mastermind-confirmed-israel-says", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 4-5 minutesJERUSALEM — The head of Hamas' military wing, Mohammed Deif, was killed in an Israeli airstrike in Gaza last month, the Israeli military said on Thursday, a day after the group's political leader was assassinated in Tehran.\nHamas neither confirmed nor denied the killing of Deif, but one official, Ezzat Rashaq, said any word on deaths of its leaders was its responsibility alone.\nIran and Hamas have blamed Haniyeh's killing on Israel, which has neither denied nor confirmed a role in the assassination.\nPicture said to show leader of Hamas' military wing, known as Al-Qassam Brigades, Mohammed Deif in a location given as Gaza Strip in this handout picture released on Jan. 7.\n(Photo: Israel Defense Forces)Israeli Defense Minister Yoav Gallant said Deif's death was a milestone in Israel's goal of destroying Hamas' military wing, known as Al-Qassam Brigades."}, {"id": "26294811-d421-4f40-bf04-aa49e0660fa1", "title": "Amodei statement on 9 / 11 anniversary", "date": "2024-08-02 00:15", "url": "https://www.carsonnow.org/story/09/11/2014/amodei-statement-911-anniversary", "domain": "carsonnow.org", "domain_classification": "Unknown", "message": "“It is appropriate for us all to not forget the World Trade Center, the Pentagon and the ‘Let’s roll’ heroes of Flight 93.\nIt is also appropriate to not forget the victims of more than three decades of such attacks targeting Americans, including:— Bombing of U.S. Embassy, Beirut, Lebanon, April 18, 1983.\n— Bombing of U.S. Embassy, Kuwait, December 12, 1983.\n— Bombing of restaurant near U.S. Air Force base in Torrejon, Spain, April 12, 1984.\n— Hijacking of TWA Flight 847, June 14, 1985."}, {"id": "8de81a0a-9de5-4164-bd46-6a0501856c78", "title": "Israel treacherous frenemies | Israel National News", "date": "2024-08-02 04:15", "url": "http://www.israelnationalnews.com/news/393995", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "(JNS) At time of writing, Israelis are bracing for a possible direct and multi-front attack by Iran.\nThe point is that, until now, Israel has been unable to do that even though it has the capacity.\nThe general assumption is that, in the event of an Iranian onslaught that may overwhelm Israeli defenses, the U.S. will come to Israel’s aid.\nBritain has withdrawn its legal objection to the International Criminal Court prosecutor’s request for warrants to arrest Israel’s Prime Minister Benjamin Netanyahu and Defense Minister Yoav Gallant.\nAt the moment that Israel is fighting for its very life, Starmer has decided to side with Israel’s barbaric enemies."}, {"id": "0e0b07db-889d-4e5b-bcb3-13fa69ca1f70", "title": "Israel treacherous frenemies | Israel National News", "date": "2024-08-02 03:30", "url": "https://www.israelnationalnews.com/news/393995", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "(JNS) At time of writing, Israelis are bracing for a possible direct and multi-front attack by Iran.\nThe point is that, until now, Israel has been unable to do that even though it has the capacity.\nThe general assumption is that, in the event of an Iranian onslaught that may overwhelm Israeli defenses, the U.S. will come to Israel’s aid.\nBritain has withdrawn its legal objection to the International Criminal Court prosecutor’s request for warrants to arrest Israel’s Prime Minister Benjamin Netanyahu and Defense Minister Yoav Gallant.\nAt the moment that Israel is fighting for its very life, Starmer has decided to side with Israel’s barbaric enemies."}, {"id": "0846a16e-428c-49f9-9e83-9415182683c1", "title": "AP News in Brief at 11 : 04 p . m . EDT", "date": "2024-08-02 04:30", "url": "https://santamariatimes.com/ap/national/ap-news-in-brief-at-11-04-p-m-edt/article_8b3091f2-2bed-5e25-bfe8-ed2eb808cef9.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Thank you for reading!\nPlease log in, or sign up for a new account and purchase a subscription to continue reading."}, {"id": "b5bc90d2-a08c-4141-947e-1f8179410cdc", "title": "Australian aid worker Zomi Frankcom , who was among seven killed in Gaza airstrike , died as a result of Israeli  failures  ", "date": "2024-08-02 07:30", "url": "https://www.dailymail.co.uk/news/article-13701353/Australian-aid-worker-Zomi-Frankcom-seven-killed-Gaza-airstrike-died-result-Israeli-failures.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Serious errors led Israel to launch an airstrike on a humanitarian convoy that killed an Australian aid worker and six colleagues, government advice has found.\nThe Israeli Defence Force launched strikes in early April that killed Australian Zomi Frankcom and six other World Central Kitchen (WCK) workers as they delivered food in Gaza.\nAmid outrage over the deaths, the Australian government announced former Australian Defence Force chief Mark Binskin would serve as special adviser to the government on Israel's response to the incident.\nDemonstrably, that did not occur in relation to Zomi Frankcom and her World Central Kitchen colleagues,' she told reporters in Adelaide.\nA Israeli force member later mistakenly claimed he saw one of the convoy's drivers place a 'gun' into the vehicle."}, {"id": "a8f9697b-b5d4-433a-bbb4-0b12319f19c7", "title": "Russo - Ukraine War - 01 August 2024", "date": "2024-08-02 09:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Lyman direction, Russian troops four times stormed the positions of Ukrainian defenders in the areas of settlements Torske and Makiyivka.\nIn the Siver direction, Ukrainian troops stopped nine Russian attempts to improve the tactical position near Verkhnyokamiansky, Spirny, Ivanodarivka and Viymka.\nRussian forces unsuccessfully tried to advance in the settlements of Krasnogorivka, Paraskovievka and Konstantinivka."}, {"id": "d52c5e17-3ef6-4570-85bc-f2fb490a4072", "title": "Drone War : Russia and Ukraine are Both Developing FPV Drone Jammers", "date": "2024-08-02 06:45", "url": "https://nationalinterest.org/blog/buzz/drone-war-russia-and-ukraine-are-both-developing-fpv-drone-jammers-212144", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "In the ongoing war in Ukraine, small commercial off-the-shelf drones and custom-built loitering munitions have revolutionized modern warfare, allowing Ukrainian forces to effectively target Russian tanks and positions.\nThe Ukraine War Is Now the Drone WarSmall commercial off-the-shelf drones carrying modified ordnance and specialty-built loitering munitions have both proven to be game changers in modern warfare in the ongoing war in Ukraine.\nSince the early days of the fighting, Unmanned Aerial Systems (UAS) have been employed by Ukrainian soldiers to target Russian tanks and forward positions to great effect.\nThe report further suggested that Ukrainian drones were being \"disabled and crash(ed) 300-400 meters away from the jamming equipment.\nYet, it remains unclear if the jammers will impact Russian drones or other communications."}, {"id": "381cdca0-d3fc-498d-9a09-369c3c959020", "title": "Ten Facts about the American Civil War That Few People Know", "date": "2024-08-02 08:00", "url": "https://listverse.com/2024/08/02/ten-facts-about-the-american-civil-war-that-few-people-know/", "domain": "listverse.com", "domain_classification": "Unknown", "message": "WhatsApp Pin Share Email 0 SharesThere are few things more Americans know at least a baseline of facts about than the Civil War.\n[1]9 Submarine HistoryCSS Hunley – the Civil War Submarine – Forgotten HistoryWatch this video on YouTubeAt the time of the Civil War, no military anywhere in the world had perfected underwater fighting technology—yet.\n“50 Civil War Uniforms in 10 Minutes” – The Evolution of Blue & GreyWatch this video on YouTubeThe Civil War uniform is one of the things we all remember from school, right?\n[9]1 New Mexico’s Civil War HistoryThe American Civil War and the Battle of Glorieta Pass.\nNew Mexico’s Civil War battle is officially known as the Battle of Glorieta Pass."}, {"id": "0d908094-3cc7-4187-8f1d-059e79ab5fc4", "title": "Mig - 29K fleet to get UTTAM Mk2 FCR from Tejas MkII Program – Indian Defence Research Wing", "date": "2024-08-02 07:30", "url": "https://idrw.org/mig-29k-fleet-to-get-uttam-mk2-fcr-from-tejas-mkii-program/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Mig-29K fleet to get UTTAM Mk2 FCR from Tejas MkII Program| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIndia is making significant strides in developing indigenous aerospace technology, with the Uttam Mk2 AESA radar emerging as a cornerstone of its fighter jet programs.\nInitially designed for the Tejas MkII, this cutting-edge radar is now poised to equip a broader spectrum of Indian fighter aircraft.\nThe Uttam Mk2, boasting over 950 T/R modules and employing advanced GaN technology, represents a leap forward in radar capabilities.\nThe ultimate goal is to equip the upcoming TEDBF program with a radar-based on the Uttam AESA technology.\nThe development of the Uttam Mk2 AESA radar is a testament to India’s growing self-reliance in defence technology."}, {"id": "0ab298d6-082d-4265-a8ba-e63ac5dd05b8", "title": "BattleBots - ITV4 | TV Guide", "date": "2024-08-02 05:45", "url": "https://www.tvguide.co.uk/schedule/f15e73c2-f2f7-5938-be1b-39b8fb3300ec/battlebots", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "BattleBotsITV4 11:25 AM to 12:25 PM Friday 2 August Share Add toCalendar +Shock and Awe Season 5 Episode 33 of 40 S SubtitlesUS robot combat series where contestants control their armoured and technologically advanced automatons through a remote control and battle other robots to win the competition.\nJust 16 bots remain, but four must perish this time in the BattleBox - the victors will then be just two fights away from getting their hands on the Giant Nut, the most coveted trophy in robot sport.\nBattleBots airs on ITV4 at 11:25 AM, Friday 2 August .\n(Subtitles.)\nLearn more about BattleBots and other show/game show on our entertainment page"}, {"id": "fec2e86a-9d8a-4b75-ba25-5af28d3f3993", "title": "Battle Lines : Hamas and Hezbollah leaders assasinated , Venezuela disputed election", "date": "2024-08-02 06:30", "url": "https://www.yahoo.com/news/battle-lines-hamas-hezbollah-leaders-060000494.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This week on Battle Lines we look at the assassinations of Hamas and Hezbollah leaders in the Middle East that are raising fears of a wider war throughout the region amid chaos in the state of Israel.\nThen we look at the controversial Venezuelan elections that President Maduro claims to have won despite a disputed outcome.\nAcross the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "8fd7c7d6-34ff-4619-b7b8-69dc1683fead", "title": "Battle Lines : Hamas and Hezbollah leaders assassinated , Venezuela disputed election", "date": "2024-08-02 09:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/02/hamas-and-hezbollah-leaders-assasinated/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "c8bba1f1-60dd-4545-b5ce-50e369353fd6", "title": "The cries of the oppressed have overtaken the entire Middle East - Opinion", "date": "2024-08-02 02:45", "url": "https://www.brecorder.com/news/40315513/the-cries-of-the-oppressed-have-overtaken-the-entire-middle-east", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "The cries, too, fall like rain in summer.”The cries of the oppressed have overtaken the entire Middle East.\nIt is one dimension of this conflict but no matter how strong the enemy is there are always two sides to every conflict.\nThe long siege Marx says exhausts the besieged camp, but the guerilla warfare has exhausted those who have besieged their victims.\nThe conflict has not only created a dearth of soldiers but has also taken a heavy toll on the Israeli economy.\nThe cancer will have to be excised by the collective efforts of the surgeons, or else it will linger on."}, {"id": "963d0312-a250-4894-a93d-03b44c04aaaa", "title": "Russia War Casualties Up By 1 , 100 In Past Day", "date": "2024-08-02 06:45", "url": "https://menafn.com/1108509376/Russias-War-Casualties-Up-By-1100-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Since the full-scale invasion of Ukraine, Russia's casualty toll has reached an estimated 580,590, including 1,100 in the past day.\nThat's according to the General Staff of Ukraine's Army, Ukrinform reports.\nAlso, Ukraine's Armed Force have destroyed 8,402 Russian main battle tanks (+3 in the past day), 16,211 (+8) armored fighting vehicles, 16,161 (+42) artillery systems, 1,134 (+2) MLR systems, 907 air defense systems, 363 warplanes, 326 helicopters, 13,005 (+37) operational and tactical-level UAVs, 2,407 missiles, 28 warships/cutters, a submarine, 21,872 (+56) and fuel tankers, and 2,719 (+6) units of specialized equipment.\nSea update: Russia keeps two missile carriers on combat dutThe latest reports on enemy losses are being verified."}, {"id": "f6da7416-49d7-41c2-8ca2-ca83ab71a8d6", "title": "SteamWorld Heist II Review - Full Steam Ahead", "date": "2024-08-02 04:30", "url": "https://cogconnected.com/review/steamworld-heist-ii-review/", "domain": "cogconnected.com", "domain_classification": "Unknown", "message": "SteamWorld Heist II ReviewThe SteamWorld franchise has offered a diverse array of games, taking the lovable bots through various genres.\nAbandoning planetary exploration for a voyage at sea, SteamWorld Heist II delivers a story rich with environmental themes.\nIt’s with the gameplay where Heist II excels.\nSteamWorld Heist II builds on the solid foundations of the original to create a remarkable tactical adventure.\nWhile you may lose interest in the story, the addictive battle system will keep you hooked throughout."}, {"id": "33819971-56ba-4f4d-81c0-19eb2b61a60a", "title": "Hezbollah leader :  This is an open battle on all fronts  ", "date": "2024-08-02 06:30", "url": "https://www.sbs.com.au/news/podcast-episode/hezbollah-leader-this-is-an-open-battle-on-all-fronts/s653f7uhu", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "The leader of Lebanese military group Hezbollah, Sayyed Nasrallah has delivered a warning towards Israel, saying it has crossed far too many red lines in recent days with its actions.\nBecause some people have said that maybe the group (Hezbollah) was wrong.\nThe Hezbollah leader says recent developments have created a new situation in the Middle East.\n\"There is a battle in Gaza, there is a battle in southern Lebanon, there is an open battle in Yemen and even in Iraq because all of this is happening at the same time.\nThese are no longer fronts, this is an open battle on all fronts and it has entered a new phase.\""}, {"id": "509216b7-bcbb-492d-b40c-fa9bca8c7fe8", "title": "MG , Tesla , BYD : Electric vehicle prices drop -  as sales growth slows in Australia", "date": "2024-08-02 00:15", "url": "https://www.dailymail.co.uk/news/article-13700425/MG-Tesla-BYD-Electric-vehicle-prices-drop-sales-growth-slows-Australia.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Electric vehicle prices have fallen below $35,000 for the first time in Australia as brands continue to fight for dominance in the market.\nThe price cuts follow a fierce battle between three small electric cars last year and after slower growth in battery-powered vehicles in 2024.\nThe price change, including on-road costs, will make the MG ZS EV the cheapest electric vehicle in Australia to date and is a reduction of up to $8700 on its earlier price.\nMG Motor Australia chief executive officer Peter Ciao said the move was designed to make electric vehicles 'attainable' and to encourage more drivers to try the company's technology.\nThe price cuts come as electric vehicle growth slows in Australia, with sales of new EVs up by 16.5 per cent in the first six months of the year and representing almost eight per cent of all new car sales."}, {"id": "6f2cbaa4-1a79-4b3b-a4d5-5f2dfe27af91", "title": "House of the Dragon Season 2 Episode 8 Leak Showed THIS Targaryen Return From Game of Thrones", "date": "2024-08-02 08:30", "url": "https://www.pinkvilla.com/entertainment/hollywood/house-of-the-dragon-season-2-episode-8-leak-showed-this-targaryen-return-from-game-of-thrones-1334750", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Disclaimer: Major spoilers ahead for the House of the Dragon season 2 finale.\nHouse of the Dragon season 2 finale clips have leaked on Twitter and TikTok, with approximately 30 minutes of footage available.\nThe second season, adapting the Targaryen royal dynasty from Game of Thrones, has seen the Black and Green factions gather allies for a war.\n“We are aware that clips from the House of the Dragon season finale have surfaced across social media platforms,” Warner Bros.\nHouse of the Dragon season 1's finale also experienced leaks through HBO's international distributors, with even unrelated stories made public."}, {"id": "139e413c-6c73-4214-8008-8cfc250de118", "title": "What the papers say – August 2", "date": "2024-08-02 04:30", "url": "https://www.edp24.co.uk/news/national/24492609.papers-say---august-2/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "cead8e1f-8e89-410a-adf8-f480795efd70", "title": "House of the Dragon : How Does Aemond Die in the Books ? ", "date": "2024-08-02 04:30", "url": "https://comicbook.com/tv-shows/news/house-of-the-dragon-aemond-targaryen-death-fire-and-blood-george-rr-martin/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "Aemond Targaryen has emerged as one of the most important characters in House of the Dragon Season 2, taking charge of King's Landing while his brother, Aegon II, recovers from devastating injuries that he himself helped cause.\nMartin has an answer for that in Fire & Blood, the book that House of the Dragon is based on.\nMartin's Fire & Blood, as well as the first seven episodes of House of the Dragon Season 2...\nHeading into the House of the Dragon Season 2 finale, Aemond is in control of the army of the Greens, and is waging war against his half-sister, Rhaenyra.\n(Photo: Vhagar is far and away the largest dragon alive during House of the Dragon."}, {"id": "192a7094-305d-4eb3-8572-9f1bd8373203", "title": "Britain is in  a state of grey warfare with Russia , former head of MI6 warns - after the Mail revealed the Russian - linked fake news website which spread lies about the alleged Southport attacker", "date": "2024-08-02 00:15", "url": "https://www.dailymail.co.uk/news/article-13700009/Britain-warfare-Russia-MI6-Southport-attacker.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Britain is in 'a state of grey warfare with Russia', the former head of MI6 has warned, after a Russia-linked social media account spread lies about the alleged Southport attacker.\nHis comments came after a Mail investigation revealed that a Russia-linked social media account amplified incorrect information about the identity of the Southport suspect.\nThe false claims were viewed an estimated 27 million times and social media firms were last night under mounting pressure to explain why they were allowed to spread so widely.\n'So if these bots have been used to stir up, through social media, a violent response, I'm not the slightest bit surprised.\nWe need to think about how online content plays into information warfare,' he said."}, {"id": "2566d081-d5b8-4d2c-8e16-0365f044f5b6", "title": "Donations , trading , and pay cuts : How Israel is financing a tenth month of war", "date": "2024-08-02 07:45", "url": "https://www.israelnationalnews.com/news/394003", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "IDF officers claim that the official IDF supply lines have not been able to keep pace with the shortages generated by ten months of war.\nIt is a shortage that also causes further attrition and a drop in the percentage of people who show up for reserve duty.\"\nThis equipment should be provided by the IDF, but until the army provides the donations, they should not be stopped.\"\nSome claim to have needed to negotiate for scattered days of service, and other officer have found themselves trying to convince their troops to stay in service longer than allowed by IDF regulations.\nSome commanders have claimed to need to trade reserve days for extra supplies, benefits, or bonuses."}, {"id": "b73f9a2d-e6d3-40fd-b779-27eeaf5ee27a", "title": "What the papers say – August 2", "date": "2024-08-02 04:00", "url": "https://www.salisburyjournal.co.uk/news/national/24492609.papers-say---august-2/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "5338ae5b-d327-4b29-a94f-32b18abf153e", "title": "What the papers say – August 2", "date": "2024-08-02 01:45", "url": "https://www.ipswichstar.co.uk/news/national/24492609.papers-say---august-2/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "2390a4e0-6bfa-47c8-b1ba-edeceb123c43", "title": "What the papers say – August 2", "date": "2024-08-02 04:15", "url": "https://www.yorkpress.co.uk/news/national/24492609.papers-say---august-2/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "06870ef7-e06a-4209-9874-8dab6142bac3", "title": "What the papers say – August 2", "date": "2024-08-02 01:45", "url": "https://www.thenorthernecho.co.uk/news/national/24492609.papers-say---august-2/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "b1c8e870-2a24-4087-9892-9d36425f8556", "title": "Resident Biden claims were not at war anywhere in the world , while the U . S . is funding two wars , providing billions of dollars in weapons and instigating World War III – NaturalNews . com", "date": "2024-08-02 09:00", "url": "https://www.naturalnews.com/2024-08-01-resident-biden-claims-were-not-at-war.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "It’s all part of the depopulation, destabilization, military industrial complex embezzlement scheme and the Democrats in DC are 100 percent behind it.\nResident Biden seems to have somehow rewritten the definition of “war” to mean that if there are no boots on the ground, or Congress doesn't \"declare it,\" then there is no war going on.\nHere’s the quote from Dementia Joe himself, \"I’m the first president in this century to report to the American people that the United States is not at war anywhere in the world.” Sure Joe.\nJust last week, Resident Biden claimed, in his address to the nation, that the United States is not at war.\nStill wondering why the sneaky Demoncrats set up for a full-on DRAFT of male and FEMALE Americans for 2025?"}, {"id": "2351fbf9-3f42-4e49-88cb-24ee88d0a43c", "title": "Special Operations Forces cut through Kunsan rainy skies to demonstrate strike capability > U . S . Indo - Pacific Command > News Article View", "date": "2024-08-02 03:15", "url": "https://www.pacom.mil/Media/News/News-Article-View/Article/3859036/special-operations-forces-cut-through-kunsans-rainy-skies-to-demonstrate-strike/", "domain": "pacom.mil", "domain_classification": "Unknown", "message": "The Republic of Korea’s summers are famous for cloudy skies and torrential downpours that may appear at a moment’s notice.\nThe nearly three-week, multi-national training called Joint Combined Exchange Training, was hosted by the Special Operations Command Korea from July 15-31, 2024.\nThe goal of the training was to ensure interoperability with coalition special operations forces (SOF) partners in realistic training environments.\nTo do this, mission organizers created challenging scenarios in different domains to replicate adversarial tactics in combat scenarios.\n“Our Airmen here at the Wolf Pack demonstrate daily what it means to be forward-deployed and ready to fight tonight."}, {"id": "ecf6c3f0-955b-4016-af70-34412a8d6edd", "title": "What the papers say – August 2", "date": "2024-08-02 01:45", "url": "https://www.eveningnews24.co.uk/news/national/24492609.papers-say---august-2/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "Images of Axel Rudakubana, who turns 18 on August 7, appear on the front pages of a large chunk of the British dailies, with the Metro, and the Daily Express running photos alongside headlines that claim he has been “unmasked”.\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "cf2ef4e9-0d1a-4158-b722-d2e944ac22b1", "title": "Meet the American who launched the Frisbee , Fred Morrison , World War II combat pilot , POW", "date": "2024-08-02 09:00", "url": "https://www.foxnews.com/lifestyle/meet-american-launched-frisbee-fred-morrison-world-war-ii-combat-pilot-pow", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Fred Morrison launched a leisure lifestyle with his fantastic plastic flying saucer.\nWham-O, based in California, popularized the hula-hoop, super ball and Morrison’s Frisbee, among other whimsical innovations.\n'Obvious connection’ with another WWII pilot, inventorWalter Frederick \"Fred\" Morrison died on Feb. 9, 2010 at his home in Monroe, Utah, after battling cancer and Father Time.\nFred Morrison and Fred Arnold even shared the same birthday.\nFrisbee Fred was born on Jan. 23, 1920."}, {"id": "dd0814a0-899d-44a5-95aa-e7b066bcd1e4", "title": "Jeff Jarrett Addresses The Mental  Tug - Of - War  Of AEW Bryan Danielson", "date": "2024-08-02 09:00", "url": "https://www.wrestlinginc.com/1635115/jeff-jarrett-addresses-mental-tug-war-aew-bryan-danielson/", "domain": "wrestlinginc.com", "domain_classification": "Unknown", "message": "There has been mystery as to what the future holds for Bryan Danielson's career as he prepares to challenge Swerve Strickland for the AEW World Championship at AEW All In.\nAdvertisementSpeaking on his \"My World\" podcast, Jeff Jarrett shared his perspective about Danielson's recent mindset.\n\"I think he is literally -– and I say this is a shoot brother, as they say, but legitimate -– he is in a tug-of-war in his brain,\" Jarrett said.\n\"I think his wife and I think without saying it, but I think the kids want dad at home much more.\"\n\"I'm trying to encourage him that the obstacle that he may or may not feel because I tread lightly on this."}, {"id": "c12e43a8-cf44-4732-b4e7-4ee3cb22c6f6", "title": "Hezbollah chief says response against Israel  inevitable  ", "date": "2024-08-02 06:45", "url": "https://dunyanews.tv/en/World/828081-hezbollah-chief-says-response-against-israel-inevitable", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah chief says response against Israel 'inevitable'World World Hezbollah chief says response against Israel 'inevitable'Hassan Nasrallah warned the group will deliver \"a real response, not a symbolic\" one.\n\"The enemy, and those who are behind the enemy, must await our inevitable response,\" he said in a speech broadcast at the funeral of Hezbollah military commander Fuad Shukr.\nNasrallah warned the group will deliver \"a real response, not a symbolic\" one.\nIt also blamed him for carrying out a weekend rocket attack on the Israeli-annexed Golan Heights that killed 12 children, which Hezbollah denies.\n\"What happened in the suburb was an aggression, not just an assassination,\" Nasrallah said, insisting Israel targeted \"a civilian building, not a military base\" and \"killed civilians\"."}, {"id": "d8a35993-f15f-43bd-89f8-3eeb284405d1", "title": "What the papers say – August 2", "date": "2024-08-02 02:45", "url": "https://jerseyeveningpost.com/morenews/uknews/2024/08/02/what-the-papers-say-august-2-7/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Tomorrow’s Paper Today ?\nThe Guardian leads on a beefed-up police presence, with 19 further protests planned across the UK in the wake of the Southport stabbings.\nGUARDIAN: Police urged to step up action amid plans for 19 more far-right protests #TomorrowsPapersToday pic.twitter.com/59YB9C7S19 — Neil Henderson (@hendopolis) August 1, 2024The Times and The Independent look abroad for their fronts, with the two splashing on the biggest prisoner swap since the Cold War.\nTHE TIMES: Russia in biggest prisoner exchange since Cold War #TomorrowsPapersToday pic.twitter.com/9BSFwPgcXb — Neil Henderson (@hendopolis) August 1, 2024INDEPENDENT DIGITAL: US journalist freed in biggest prisoner swap since Cold War #TomorrowsPapersToday pic.twitter.com/0sBkljW7O8 — Neil Henderson (@hendopolis) August 1, 2024Back on British soil, the Financial Times and the i both opt for headlines concerning the economy.\nLastly, the Daily Star splashes with a unique proposal to “save the world”."}, {"id": "3e8476f2-29ca-4ed3-8e73-727e3a4bc10d", "title": "Austin Bay : America airpower is at risk", "date": "2024-08-02 08:45", "url": "https://www.sunjournal.com/2024/08/02/austin-bay-americas-airpower-is-at-risk/", "domain": "sunjournal.com", "domain_classification": "Unknown", "message": "Obtain “air superiority” (aka air dominance) and you can basically conduct air, land and sea operations at will.\nAir superiority provides a military that obtains it with immense tactical and operational flexibility.\nAir dominance and space dominance — space meaning satellites and other orbiting platforms — give commanders war-altering strategic capabilities.\nAdvertisementHere’s an example of operational advantage: In 2001, the U.S. used its air dominance to deploy air and ground military power in land-locked Afghanistan.\nI’ve called that “integrated ground to air to space power.”My 2014 column noted American air superiority faced budget cuts."}, {"id": "1c328b22-a3fa-4f7e-87d6-149b80502827", "title": "Commandos Master Foreign Weapons", "date": "2024-08-02 05:15", "url": "https://www.miragenews.com/commandos-master-foreign-weapons-1288672/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "Department of DefenceIntegrating with partner forces throughout the Indo-Pacific region is one of many special warfare tasks assigned to the 1st Commando Regiment, whose members recently undertook qualification and currency training on foreign and exotic weapons.\nOfficer Commanding 2nd Commando Company, Squadron Leader A, said it was an important activity.\n\"There are situations that require special warfare operators to have intimate knowledge of foreign weapon systems.\nAs with standard ADF weapons, foreign weapons have approved manuals for usage, and their training is standardised to align with ADF safety and training processes.\nAble Seaman J said it was important to maintain skills and currency with exotic and foreign weapons."}, {"id": "9deab9c5-2487-4c96-be8b-b728871eb8ac", "title": "More efforts needed for diabetes prevention , not just providing treatment , says deputy Health DG", "date": "2024-08-02 06:30", "url": "https://www.thestar.com.my/news/nation/2024/08/02/more-efforts-needed-for-diabetes-prevention-not-just-providing-treatment-says-deputy-health-dg", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "The Deputy Health director-general highlighted the efforts of Diabetes Malaysia (previously Malaysian Diabetes Association), for its self-funded initiatives to support the public healthcare system.\n\"Diabetes Malaysia consistently supports diabetes programmes through its national branch, 14 state branches and 36 district branches, with over 12,000 active members.\nDr Norhayati said non-governmental organisations such as Diabetes Malaysia had helped empower diabetes patients with the knowledge to care for themselves.\nPrimary care involves basic health services like check-ups and immunisations at clinics; secondary care involves specialist treatment for more complex conditions and tertiary care is for specialised, advanced treatment like surgery provided by hospitals.\nDr Norhayati said primary care plays a major role in the screening of non-communicable diseases such as diabetes but the burden of primary care has shifted to treating diabetes and its complications."}, {"id": "3b6193b3-13a3-4fd8-966a-99279c3c6ffa", "title": "RIGHT SPEAK : RU Active Assaults UKR 2 Dir in Donetsk Reg ; 98 C - Clashes at Front ; 48 C - Clashes in Pokrovsk , Toretsk Sectors ; UKR Spc - Ops Stop RU Breakthrough on Toretsk Front ; RU Fails Bid to Capture Kharkiv ; RU Retreated in Districts of ...", "date": "2024-08-02 08:45", "url": "http://www.rightspeak.net/2024/08/ru-active-assaults-ukr-2-dir-in-donetsk.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Aug 2024 (10) Jul 2024 (155) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "cdd0cd5d-643d-462a-a33a-6649dc4e6cff", "title": "With Hezbollah and Hamas assassinations , Netanyahu shows willingness to risk regional war for political survival", "date": "2024-08-02 01:45", "url": "http://www.econotimes.com/With-Hezbollah-and-Hamas-assassinations-Netanyahu-shows-willingness-to-risk-regional-war-for-political-survival-1683089", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "Israel’s apparent assassinations of Fuad Shukr, Hezbollah’s top military leader, in Beirut, and Hamas political leader Ismail Haniyeh, in Tehran, have raised again the specter of a regional war involving regional adversaries – one that could potentially drag the United States into the fray.\nUntil now, the Lebanese capital was targeted only once by Israel with the Jan. 2, 2024, assassination of Saleh Arouri, another Hamas leader, not far from where Shukr was killed.\nThe killings likely also make the war of attrition between Israel and Hezbollah more volatile and riskier.\nHis decision to authorize the assassinations in Beirut and Iran should be understood in the context of his fight for his political survival.\nI believe all Netanyahu’s actions, including the prolonging of the war in Gaza, should be understood in this context."}, {"id": "34b9bd80-cf5c-4e03-a0a7-6d8e6e341e60", "title": "Chinese warships off Alaska and Cambodia highlight the role of near and far waters in sea power dominance", "date": "2024-08-02 01:45", "url": "http://www.econotimes.com/Chinese-warships-off-Alaska-and-Cambodia-highlight-the-role-of-near-and-far-waters-in-sea-power-dominance-1683039", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "To understand the geopolitics of sea power, you need to understand two terms: “near waters” and “far waters.” Near waters are areas close to a country’s shoreline that are seen as important for its defense.\nFar waters are areas across the ocean that a country wants to be present in for economic and strategic interests.\nBut here’s the thing: The far waters of one country are the near waters of another, and that leads to tension.\nMore than shipbuildingChina is a global economic power, and that requires controlling its near waters and building a presence in far waters.\nIt raises the prospect of China’s ability to project power into its far waters – and near waters of the U.S.Albatrosses or hawks?"}, {"id": "5ce2eb37-575e-41b8-bcef-7869f4244b7a", "title": "U . S . and Philippine Warships Patrol South China Sea", "date": "2024-08-02 04:00", "url": "https://news.usni.org/2024/08/01/u-s-and-philippine-warships-patrol-south-china-sea", "domain": "news.usni.org", "domain_classification": "Unknown", "message": "U.S. and Philippine warships rendezvoused near a disputed South China Sea feature to conduct a joint maritime patrol on Wednesday.\nThis activity is the latest in a series of maritime cooperative activities that began last year amid increasing tensions between the Philippines and China over their claims in the South China Sea, particularly over resupply missions to a Marine outpost at Second Thomas Shoal.\nJoint patrols were envisioned in 2022 and 2023 to bring foreign partners into the South China Sea and Luzon Strait as a show of support.\nThe China Coast Guard’s use of water cannons, rammings and boarding actions eventually came to a head on a June 17 resupply mission when Canadian, Japanese, Philippine and U.S. jointly patrolled in the South China Sea.\nFollowing the exercise, Ramon Alcaraz resumed patrol duties and found a sunken Vietnamese fishing vessel at Jackson Atoll."}, {"id": "ec17d56d-4b86-4d0f-ba03-f8f853607f79", "title": "Beautiful but little - known city dethrones Phoenix as the United State hottest populated place", "date": "2024-08-02 05:30", "url": "https://www.dailymail.co.uk/news/article-13701013/Needles-dethrones-Phoenix-United-States-hottest-populated-place.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A small desert city has taken out the unwanted title of the hottest city in the United States for the month of July.\nTo escape the relentless sun, residents and tourists flock to the Colorado River, where Needles boasts three beaches.\n'You’ve [got to] be waist-deep in the Colorado River,' said City Manager Patrick Martinez.\nPhoenix is happy to relinquish the record to Needles, now the hottest monthly U.S. city with 103.2°F (preliminary avg July temp).\nTo combat the extreme heat, Needles operates a senior center offering a cool refuge and water for residents."}, {"id": "95e5c138-c787-4316-a089-1b299f3af29c", "title": "Russia has lost 580 , 000 soldiers in its war against Ukraine", "date": "2024-08-02 07:30", "url": "https://www.yahoo.com/news/russia-lost-580-000-soldiers-045336162.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia has lost 580,000 soldiers in its war against UkraineUkrainian soldiers with an UAV.\nPhoto: General Staff of the Armed Forces of UkraineUkraine’s defence forces continue to inflict losses on Russia.\nIt has lost 1,100 soldiers, 42 artillery systems and 8 armoured combat vehicles over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 2 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\nSupport UP or become our patron!"}, {"id": "be7dcb35-c46f-489c-b483-5c4ce0db24bf", "title": "Israeli judoka Inbar Lanir just medaled in Paris and is going viral at home for her Oct . 7 selflessness", "date": "2024-08-02 04:30", "url": "https://forward.com/fast-forward/640167/israeli-judoka-inbar-lanir-just-medaled-in-paris-and-is-going-viral-at-home-for-her-oct-7-selflessness/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Ben Sales August 1, 2024(JTA) — Israeli judoka Inbar Lanir has won a silver medal in Paris, one of Israel’s first two medals this year and its best finish in the sport since 1992.\n“In retrospect, I realized that she was none other than the one and only, Inbar Lanir,” Meshulam wrote.\nAt the last Olympics, in Tokyo, Israel won bronze in the mixed team competition, its only judo medal in those Games alongside two golds in gymnastics.\nThat squad included both Lanir and Paltchik, and both athletes won their second career medal on Thursday.\nBorn in Ukraine, Paltchik won gold at the 2020 European championship."}, {"id": "05668614-e55e-475b-a5d4-b2940b2995bf", "title": "Archeologists Uncover 3 , 600 - Year - Old Hoard Of Weapons , Other Items", "date": "2024-08-02 00:15", "url": "https://dailycaller.com/2024/08/01/archeologists-uncover-3600-year-old-weapons-jewelry-hoard-czech-republic/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Archeologists in the Czech Republic uncovered a hoard of artifacts, including weapons and jewelry, from 3,600 years ago.\nMartin Trefný, the curator of the hoard and professor at the University of Jan Evangelista Purkyně and the Museum of the Říp Region, told Live Science the functions behind these artifacts.\nThe latter function also applies to the spearhead,” Trefný told the outlet.\n“In the first case, the hoards are presumed to have a votive function, meaning they served as offerings to deities,” Trefný told Live Science.\nThe items are soon set to be displayed at the Podřipské Museum in Roudnice nad Labem, Czechia, according to Prague Morning."}, {"id": "31db08e6-cf1b-459a-96fb-5894ffd3b6e2", "title": "SecAF visits South Carolina Air National Guard > Air Force Reserve Command > News", "date": "2024-08-02 00:15", "url": "https://www.afrc.af.mil/News/Article/3858833/secaf-visits-south-carolina-air-national-guard/", "domain": "afrc.af.mil", "domain_classification": "Unknown", "message": "Secretary of the Air Force Frank Kendall visited the South Carolina Air National Guard’s 169th Fighter Wing July 31, as part of a senior leader visit.\nDuring his visit, Kendall was joined by U.S. Army Maj. Gen. R. Van McCarty, South Carolina National Guard adjutant general, U.S. Air Force Col. Michael Ferrario, 169th Fighter Wing commander and other senior leaders to discuss the unit’s operational future.\nThis discussion, led by U.S. Air Force Col. Jim Roth, South Carolina National Guard director of strategic plans, focused on successes and areas for improvement for future XAB deployments.\nAir Combat Command and maintaining aerial dominance.\n“Meeting Airmen and Guardians is one of my favorite parts of serving as the secretary,” Kendall said."}, {"id": "d0a0d1dd-0935-4f95-8def-871aa3d6d3fb", "title": "America Military Shotguns - The 5 Shotguns in the Armory", "date": "2024-08-02 07:45", "url": "https://sofrep.com/gear/americas-military-shotguns-the-5-shotguns-in-the-armory/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "Military Shotguns are highly effective close-range weapons that are brutally efficient in close-quarters combat (CQC).\nAs far as military shotguns go, the Remington 870 MCS stays true to its name and is by far the most modular of them all.\nIt serves in the armory of military shotguns in the United States and with numerous foreign military forces, including the SAS.\nThe Saiga 12 is an unusual choice for the American military, but it’s in the armory, so it makes the list of military shotguns.\nMilitary Shotguns – Now and ThenThe military shotgun has never been a front-line, general-issue weapon and never will be."}, {"id": "3412fb10-7689-4524-a92a-5d5c3cef44cf", "title": "The New World Chinese 8 . 0 file", "date": "2024-08-02 00:00", "url": "https://www.moddb.com/mods/red-alert-the-new-world/downloads/the-new-world-chinese-80", "domain": "moddb.com", "domain_classification": "Unknown", "message": "This mod provides a refreshing PvP experience, as well as many new battle mechanisms to make PVE also enjoyable.\nThe battle pace is a bit faster and data of many units are adjusted to match the new mechanism."}, {"id": "851c7b86-85c0-403f-88d8-82e228d2b6dd", "title": "LL Cool J Picks Def Jam Mount Rushmore , Leaves Some Notable Names Off", "date": "2024-08-02 03:00", "url": "https://www.billboard.com/music/rb-hip-hop/ll-cool-j-def-jam-mount-rushmore-club-shay-shay-shannon-sharpe-1235745087/", "domain": "billboard.com", "domain_classification": "Unknown", "message": "LL Cool J is causing a stir on Rap Twitter once again.\nHe was recently in the news for saying he wants to hear Andre 3000 rap instead of playing the flute.\nNow, during a recent appearance on Shannon Sharpe’s Club Shay Shay, he was asked to name his Mount Rushmore of Def Jam artists.\n“Because it’s Def Jam.” Shannon then asked, “Was Hov not at Def Jam?” to which LL answered, “Yeah, a thousand years later.” (It’s worth pointing out that the Queens rapper has had a long standing on again, off again cold war with Jay-Z.)\nCanibus answered LL’s “4,3,2,1” verse with “Second Round K.O.” and LL returned serve with “The Ripper Strikes Back” effectively ending the battle."}, {"id": "5121b4ef-8834-45ad-81a0-9b52a3678aa1", "title": "First round of US - made F - 16s land in Ukraine as war with Russia rages on", "date": "2024-08-02 04:15", "url": "https://wfin.com/fox-world-news/first-round-of-us-made-f-16s-land-in-ukraine-as-war-with-russia-rages-on/", "domain": "wfin.com", "domain_classification": "Unknown", "message": "The long-awaited arrival of U.S.-made F-16s have allegedly landed in Ukraine, officials said Wednesday, a move that will help Kyiv revive its air capabilities in its war against Russia.\nLithuanian Foreign Minister Gabrielius Landsbergis, an ardent supporter of Kyiv, took to X to confirm the delivery and said, “F-16s in Ukraine.\nAnother impossible thing turned out to be totally possible.”Despite multiple reports citing U.S. intelligence officials, neither the Pentagon nor Ukrainian defense officials have officially confirmed that the sorely needed warplanes have been delivered.\nKyiv’s push to keep the F-16 arrival a secret is not a surprising decision given the security challenges the planes will prove for the war-torn state.\nWe have no reason to doubt that.”Zelenskyy has long emphasized the important role F-16s would serve in bolstering Ukraine’s air defenses as Russia continues to pummel the country with drone and missile strikes."}, {"id": "66448a62-a5af-40ac-abec-3cae280e987e", "title": "Nasrallah : Israel Has  Crossed Red Lines  And They  Will Weep Terribly In The Days Ahead  – The Yeshiva World", "date": "2024-08-02 04:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2301931/nasrallah-israel-has-crossed-red-lines-and-they-will-weep-terribly-in-the-days-ahead.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Hezbollah Secretary General Hassan Nasrallah issued threats against Israel on Thursday, asserting that the IDF had “crossed red lines” with the assassination of Hezbollah military chief Fuad Shukr and Hamas chief Ismail Haniyeh.\nSpeaking in a televised address during Shukr’s funeral, Nasrallah declared that Israel should prepare for “rage and revenge on all the fronts supporting Gaza,” indicating that the conflict had entered “a new phase.”“Israelis will weep terribly in the days ahead,” Nasrallah stated, as Israel heightened its readiness for potential retaliation from Hezbollah and Iran.\nWhile Israel has not officially taken responsibility for Haniyeh’s death in Tehran, both Tehran and Hamas have blamed the Israeli state.\nThe assassination, along with the ongoing Gaza conflict, risks escalating the tit-for-tat exchanges across the Israel-Lebanon border into a wider regional conflict.\nIn his speech, Nasrallah hinted at international pressure for Hezbollah to respond in a controlled manner or not at all."}, {"id": "3a0fdc0a-4f0f-4b23-851a-80d7bff39bce", "title": "300 days of Gaza war : UAE Palestinian expats hope to see families in person ,  not in graves  ", "date": "2024-08-02 05:00", "url": "https://www.khaleejtimes.com/uae/300-days-of-gaza-war-uaes-palestinian-expats-hope-to-see-families-in-person-not-in-graves", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Her sister lost her house and all of her family's belongings when airstrikes destroyed their home in Gaza.\n\"I just want my sister and her children to stay alive,\" Reem implored, adding: \"After this war is over, I want to see them in person, not visit their graves.\"\nNews of the war in Gaza is too much for Reem to bear.\nNo school, home and livelihoodThe day-to-day realities for Reem and Salma's families in Gaza have become unimaginably grim.\nBoth Reem and Salma are providing much needed financial and emotional support as they can to their loved ones in Gaza."}, {"id": "318b8b53-ca50-405c-a610-2f4845b8adb6", "title": "Xi Focus : Building world - class armed forces for China", "date": "2024-08-02 01:45", "url": "http://english.anhuinews.com/newscenter/headline/202408/t20240802_7735439.html", "domain": "english.anhuinews.com", "domain_classification": "Unknown", "message": "BEIJING, Aug. 1 (Xinhua) -- The Chinese People's Liberation Army (PLA) celebrates its 97th founding anniversary on Thursday.\nOn Thursday, Xi's article on modernizing national defense and the armed forces was published by Qiushi, a flagship Party magazine.\nReform has been the key theme as Xi has reshaped the armed forces over the past decade.\nDuring exercises and training, previously independent military units across different services now conduct joint operations under a theater command.\nIn the reform-themed resolution adopted in July, China's leadership again pledged to \"deepen the reform of joint operations systems\" and \"refine the functions of the CMC command center for joint operations\" to enhance combat capabilities."}, {"id": "7cf66201-630f-4bc2-8bc4-8074f2eccf67", "title": "  Another impossible thing : F - 16 fighter jets land in Ukraine to bolster defence against Russia", "date": "2024-08-02 07:45", "url": "https://www.news24.com/news24/world/news/another-impossible-thing-f-16-fighter-jets-land-in-ukraine-to-bolster-defence-against-russia-20240802", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Ukraine needs the jets to fight Russia.\nFour NATO members have committed to providing Ukraine with more than 60 planes.\nAFPThe US has also been training Ukrainian pilots on how to fly the jets and has already graduated the first group of pilots on its operation.\nBelgium, Denmark, the Netherlands and Norway - all NATO members - have committed to providing Ukraine with more than 60 planes.\nUkraine needs at least 130 F-16 fighter jets to neutralise Russian air power, according to Ukrainian officials."}, {"id": "2326a079-2879-4a04-9539-425adcadf5d5", "title": "Lieutenant General Vikas Lakhera : Lt Gen Vikas Lakhera takes charge as Assam Rifles DG | Guwahati News", "date": "2024-08-02 03:30", "url": "https://timesofindia.indiatimes.com/city/guwahati/lt-gen-vikas-lakhera-takes-charge-as-assam-rifles-dg/articleshow/112209290.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recentlyHezbollah military commander's body found in debris of Beirut buildingFuad Shukar, a senior Hezbollah military commander, was found dead in the debris of a building in Beirut's southern suburb targeted by an Israeli strike.\nIsrael's military claimed responsibility, linking Shukar to a deadly attack in the Golan Heights.\nHezbollah's preliminary statement confirmed Shukar's presence in the building during the attack but awaited definitive results on his fate.\nAmidst growing concerns over China, US to upgrade military command in JapanThe United States and Japan emphasized the importance of peace and stability in the Taiwan Strait and the South China Sea amid China's assertiveness.\nGuwahati: Lt Gen Vikas Lakhera took over as the 22nd director general of Assam Rifles on Wednesday."}, {"id": "4d383223-deb0-4241-9811-f0f7a902d2e4", "title": "ADA Seeks Propulsion Expert for AMCA , TEDBF , and Kaveri Integration – Indian Defence Research Wing", "date": "2024-08-02 07:30", "url": "https://idrw.org/ada-seeks-propulsion-expert-for-amca-tedbf-and-kaveri-integration/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "ADA Seeks Propulsion Expert for AMCA, TEDBF, and Kaveri Integration| BySOURCE: AFIThe Aeronautical Development Agency (ADA) is on the lookout for a seasoned propulsion expert to contribute to its ambitious projects.\nThe selected candidate will play a pivotal role in driving propulsion-related activities for the Advanced Medium Combat Aircraft (AMCA) and the Twin Engine Deck Based Fighter (TEDBF).\nInterestingly, the job description also includes a significant component dedicated to the integration of the Kaveri engine into the Light Combat Aircraft (LCA) Tejas.\nThe hiring of a senior domain expert underscores ADA’s commitment to mastering propulsion technology, a critical aspect of any advanced fighter aircraft.\nThis move is expected to accelerate the development of these indigenous platforms, enhancing India’s self-reliance in the aerospace sector."}, {"id": "125c0d6f-7b93-4330-9042-045cea148737", "title": "Prabowo observes Baykar Technology combat drones in Turkey", "date": "2024-08-02 08:30", "url": "https://en.antaranews.com/news/320883/prabowo-observes-baykar-technologys-combat-drones-in-turkey", "domain": "en.antaranews.com", "domain_classification": "Unknown", "message": "Prabowo observes Baykar Technology's combat drones in TurkeyJakarta (ANTARA) - Indonesia's Defense Minister and President-elect Prabowo Subianto observed Baykar Technology's combat drones during his brief visit to Özdemir Bayraktar National Technology Center on the sidelines of his several-hour layover at Istambul Airport on July 31.Prabowo's visit to the center has demonstrated Indonesia's strong commitment to empowering its defense industry, Head of the Public Relations Bureau at Indonesia's Defense Ministry, Brig.\nGen. Edwin Adrian Sumantha, stated in Jakarta on Thursday.He remarked that the visit would hopefully enhance the cooperation between Indonesia and Turkey in the defense industry, adding that Prabowo's transit at Istambul Airport was made during his flight back from Moscow, Russia, to Jakarta.Sumantha said that Prabowo, accompanied by Indonesian Ambassador to Turkey Achmad Rizal Purnama, also met with Baykar Technology CEO Baykar Hayluk Bayraktar, during which they engaged in a brief conversation.Ambassador Purnama was quoted as expressing belief in further collaboration between Jakarta and Baykar Technology to drive the modernization of Indonesia's defense system that would positively contribute to regional security.He noted that Prabowo was given a Bayraktar Kzlelma fighter UAV miniature before leaving the company.Sumantha also said that the Indonesian Navy and Air Force chiefs of staff had hinted at the possibility of the Indonesian Government procuring Anka and Bayraktar combat drones.He stated that the Indonesian Defense Ministry had recently signed a procurement contract for 12 Anka combat drones with Turkish Aerospace Industries on February 3, 2023.The procurement contract also covered a training program, transfer of technology, and support for integrated logistic support (ILS), ground support & test equipment (GS&TE), a flight simulator, hangar infrastructure, and a 24-month or 600-flight-hour warranty period.The procurement contract, however, still awaits the Indonesian Finance Ministry's activation.According to its official website, Baykar Technology has been recorded as the first producer of Turkey's first indigenous UAVs.Due to its self-financed R&D activities and 93 percent localization rate, Baykar, which currently employs more than 4,500 workers, has delivered more than 500 UAVs since 1986.The company claims that its research and development (R&D) capabilities include the completecomplete design and development of UAV systems, aerial platforms, and ground components with their subsystems.\nTranslator: Genta TM, Rahmad NasutionEditor: Tia MutiasariCopyright © ANTARA 2024"}, {"id": "0ff8c0e7-d059-469a-b30c-f35894510576", "title": "Brit destroyer  on standby  with Israel and Hezbollah on brink of war | World | News", "date": "2024-08-02 08:30", "url": "https://www.express.co.uk/news/world/1931097/brit-destroyer-hms-duncan-israel-iran-middle-east", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Referring to the last few weeks, he continued: \"As tensions between the powerfully-armed Hezbollah militia army in southern Lebanon and Israel spiked, the UK was also making contingency plans.\nBack in 2006, when all-out war between Hezbollah and Israel last exploded, helicopters operating from Cyprus joined British and other warships carrying out a major evacuation of civilians from Lebanon.\n\"During that conflict Hezbollah managed to land a missile hit on an Israeli corvette off the coast of Lebanon.\"\nHe said: \"Her Sea Viper missile anti-air system is formidable and recently proved effective during combat operations in the Red Sea by sister vessel HMS Diamond against Houthi drones and missiles.\nThe amphibious assault ship USS Wasp (LHD 1) transits the Strait of GibraltarTrending"}, {"id": "25c29710-b537-457b-b899-755a514c0194", "title": "Egypt Establishes Fund For Human Trafficking Victims", "date": "2024-08-02 04:00", "url": "https://menafn.com/1108509008/Egypt-Establishes-Fund-For-Human-Trafficking-Victims", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Daily News Egypt) The fund, affiliated with the Prime Minister, will coordinate with the National Coordinating Committee for Combating and Preventing Illegal Migration and Human Trafficking, as well as relevant ministries and entities.\n64 of 2010, which addresses human trafficking.\nThe fund will also support activities specified in the national strategy to combat human trafficking and finance psychological, health, and social support programmes for victims.\nThe draft decision outlines the organisational structure of the Human Trafficking Victims Assistance Fund, including the formation and responsibilities of the fund's board of directors, the duties of the chairman, and the determination of the fund's resources.\nThis move is part of Egypt's ongoing efforts to address and combat human trafficking, ensuring comprehensive support for victims."}, {"id": "a2831026-6c32-4634-b60f-a925a913093e", "title": "cheesetower mission 2 file", "date": "2024-08-02 00:00", "url": "https://www.moddb.com/mods/cheesetower-3d/downloads/cheesetower-mission-2", "domain": "moddb.com", "domain_classification": "Unknown", "message": "RTX Remix is a modding platform by NVIDIA , which allows modders to create stunning HD remasters of classic games (see all supported) , with ray tracing and DLSS."}, {"id": "f6b7bd97-95ae-4d3d-8b82-ee5c51713ffe", "title": "Why Taiwan Constitutional Court Hearing on Legislative Powers Matters to Global Security", "date": "2024-08-02 06:30", "url": "https://www.yahoo.com/news/why-taiwan-constitutional-court-hearing-052918970.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "“When ministers go to the Legislative Yuan, they are working professionally,” Cho told TIME in late May.\n“So they should have freedom of speech, and they should not be threatened by the criminal code.”The scrutiny amendments have already caused a bitter schism in Taiwan society.\nWhen the bill was eventually passed, on May 28, DPP lawmakers hurled garbage bags at their opposition peers.\nWhile conceding that “this is a worry among the Taiwanese people and DPP legislators,” Cho personally is “more cautious,” he says.\nDespite the crowds gathered to protest the scrutiny amendments, one poll suggests that 57% of respondents supported enhanced legislative checks."}, {"id": "cc70970e-c1af-4076-b458-68f9a0ccb5f3", "title": "Why Taiwan Constitutional Court Hearing on Legislative Powers Matters to Global Security", "date": "2024-08-02 06:30", "url": "https://time.com/7006859/taiwan-constitutional-court-hearing-controversial-legislative-amendments-cho-jung-tai/", "domain": "time.com", "domain_classification": "Unknown", "message": "“When ministers go to the Legislative Yuan, they are working professionally,” Cho told TIME in late May.\n“So they should have freedom of speech, and they should not be threatened by the criminal code.”The scrutiny amendments have already caused a bitter schism in Taiwan society.\nWhen the bill was eventually passed, on May 28, DPP lawmakers hurled garbage bags at their opposition peers.\nWhile conceding that “this is a worry among the Taiwanese people and DPP legislators,” Cho personally is “more cautious,” he says.\nDespite the crowds gathered to protest the scrutiny amendments, one poll suggests that 57% of respondents supported enhanced legislative checks."}, {"id": "dceef579-1e12-4570-9444-17cd62ad47f1", "title": "Baypark hosts Battle in the Bay cheerleading competition this Saturday", "date": "2024-08-02 07:45", "url": "https://www.nzherald.co.nz/bay-of-plenty-times/news/baypark-hosts-battle-in-the-bay-cheerleading-competition-this-saturday/PUZLYG6VFZFVHFPP6S2HZV3URQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Demi Geary from Bay Twisters.\nPhoto / John BorrenTauranga’s Mercury Baypark will be the epicentre of cheer and excitement this Saturday, , as it hosts the highly anticipated Battle in the Bay cheerleading competition.\nWith 65 dynamic teams from across New Zealand set to showcase their skills, event producer Rebecca Grigson said they expected to draw a crowd of about 3000 enthusiastic spectators.\n“We’ve been doing Battle in the Bay for five years, since 2016, to bring people to a beautiful location to compete, and it gives a boost to the local economy.”Now in its sixth year, 2024 promised to be a memorable one.\nGrigson said they were keeping the ticket price cheap for spectators and supporters, offering a special price for seniors “so mum, dad and grandparents can come”."}, {"id": "e350537c-4474-48e6-9266-3329d779739f", "title": "How states pioneered the medical marijuana movement in America", "date": "2024-08-02 03:15", "url": "https://www.news-medical.net/news/20240801/How-states-pioneered-the-medical-marijuana-movement-in-America.aspx", "domain": "news-medical.net", "domain_classification": "Unknown", "message": "Yet, currently, 38 states and the District of Columbia has legalized the medical use of marijuana while 24 states and D.C. have legalized marijuana for recreational use.\nMallinson and Hannah, state politics scholars who met as doctoral students at Penn State, wanted to tell a comprehensive story about medical marijuana.\nPenn State News spoke with Mallinson about the book, the rise of medical marijuana in America and the role Pennsylvania has played.\nQ: How has the public perception of medical marijuana has changed over the years?\nThat was revealed later, though he maintained that wasn't his motivation for championing medical marijuana."}, {"id": "19c324f2-d177-4a52-ac91-f5404a70e6b2", "title": "Hezbollah Chief Says Battle Against Israel Enters  New Phase  ", "date": "2024-08-02 00:15", "url": "https://www.bloomberg.com/news/articles/2024-08-01/hezbollah-chief-says-battle-against-israel-enters-new-phase", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "9b5bd881-abc1-4e5c-b8f2-4e69978837eb", "title": "Caring beyond crisis : Dirk last column and a missing girl impact", "date": "2024-08-02 03:30", "url": "https://www.citizen.co.za/news/opinion/caring-beyond-crisis-dirks-last-column-and-a-missing-girls-impact/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Caring beyond crisis: Dirk’s last column and a missing girl’s impactA Grade seven pupil’s disappearance and Dirk's fight with cancer call us to care deeply and try harder.\nWhat shocked me the most was that it is the school that Little Egg attends.\nI will…ALSO READ: It’s far too early to lose the fightThis will be beloved Dirk’s last column for The Citizen.\nYou stand behind Dirk and his battle, with words of love and encouragement.\nLike Dirk…– Carine Hartman, his friend and colleague who is standing behind him, trying just a little harder…"}, {"id": "dbca3752-a351-4195-8aa6-0618c5f71629", "title": "Accused Swindler Who Allegedly Stole From 9 / 11 Survivor And Widow Mom Indicted", "date": "2024-08-02 02:00", "url": "https://dailycaller.com/2024/08/01/richard-yasnis-stole-9-11-survivor-indicted/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "A Massachusetts man has been indicted for allegedly swindling over $140,000 from a 9/11 survivor and her widowed mother, Nassau County officials announced Thursday.\nRichard Yasnis, 43, is accused of posing as an investment broker to defraud the victims, who were seeking to invest funds received from 9/11 Victim Compensation, according to Nassau County District Attorney Anne Donnelly.\nYasnis allegedly convinced the victim, who developed medical issues from her work at, to invest her compensation in a bogus property renovation scheme and the stock market, promising substantial returns.\nHeartless swindler stole $140,000 from sick 9/11 survivor and widow mom: prosecutors https://t.co/ejM35hMUFj pic.twitter.com/XZWkikWZ44 — New York Post Metro (@nypmetro) August 1, 2024“Instead of helping these women to secure their futures, Yasnis allegedly stole more than $140,000 from them – funds that were drawn in part from one of the victim’s 9/11 compensation for her work at Ground Zero in the aftermath of the terrorist attacks.\nYasnis allegedly persuaded the survivor to hand over $48,800 on July 31, 2023, after learning she would receive compensation for her 9/11-related illnesses, the press release stated."}, {"id": "f538f79b-99b3-43df-8cc0-19e5469722e9", "title": "Airwolf - Legend | TV Guide", "date": "2024-08-02 03:30", "url": "https://www.tvguide.co.uk/schedule/5485c805-652b-5a18-95bc-0e18fae8076c/airwolf", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "AirwolfLegend 9:00 AM to 10:00 AM Friday 2 August Share Add toCalendar +Code of Silence Season 4 Episode 8 of 24St John is asked to defend a man he dislikes, a combat unit commander accused of murder, and sets aside personal feelings to ensure he gets a fair trial.\nBarry Van Dyke and Michele Scarabelli starAirwolf airs on Legend at 9:00 AM, Friday 2 August .\nLearn more about Airwolf and other movie/drama on our drama pageTopics Movie ➝ Drama General"}, {"id": "33b1be04-4792-4b9b-b43b-4156e1bb947a", "title": "How Kamala Harri Immigration Failures Set Up Attacks by Trump", "date": "2024-08-02 00:15", "url": "https://www.bloomberg.com/news/articles/2024-08-01/how-kamala-harris-immigration-failures-set-up-attacks-by-trump", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "3fc5f3ec-ce63-4d60-9638-04a848a4b4bc", "title": "The Border  Crisi Kamala Harris Sounded the Alarm About Wasnt Immigration It Was Pollution", "date": "2024-08-02 03:15", "url": "https://freebeacon.com/democrats/the-border-crisis-kamala-harris-sounded-the-alarm-about-wasnt-immigration-it-was-pollution/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "As a California senator, Kamala Harris sought to protect the U.S.-Mexico border from an urgent \"crisis\"—but it wasn't the immigration crisis.\nDemocrats on the committee called for a freeze in funding for then-president Donald Trump's border wall, any \"new Border Patrol agents,\" and Immigration and Customs Enforcement personnel.\nHarris opposed the Trump administration's plans to build the border wall, calling the project a \"stupid use of money.\"\nHarris has often criticized Customs and Border Protection, the agency that marshals the U.S.-Mexico border, and Immigration and Customs Enforcement, which handles deportation cases against illegal aliens.\nShe has called for defunding Immigration and Customs Enforcement and accused the agency of \"crimes against humanity\" over conditions at its detention centers."}, {"id": "8974d1f0-9af0-4943-ad4b-6df4384fff3d", "title": "Formula 1 - Sky Sports F1 HD", "date": "2024-08-02 06:30", "url": "https://www.tvguide.co.uk/schedule/a8cf6658-d290-544e-8810-d654edbe315c/formula-1", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Formula 1Sky Sports F1 HD 12:00 PM to 2:05 PM Friday 2 August Share Add toCalendar +Bahrain F1 Gp: Qualifying 2hr Hlts 01.03 S SubtitlesThe Bahrain Grand Prix qualifying session.\nAnother chance to see the battle for grid positions for the first round of the season at Bahrain International Circuit in SakhirFormula 1 airs on Sky Sports F1 HD at 12:00 PM, Friday 2 August .\n(Subtitles.)"}, {"id": "a240e7ac-1829-4961-b638-83eb921c309f", "title": "How long will Netanyahu political gains from Haniyeh killing last ? ", "date": "2024-08-02 07:45", "url": "https://www.firstpost.com/world/how-long-will-netanyahus-political-gains-from-haniyeh-killing-last-13799682.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The same channels that once highlighted his faltering support are now buzzing with dramatic updates: Ismail Haniyeh, the Hamas political bureau chief—dead.\nThe Israeli military advocated for drafting more ultra-Orthodox soldiers, arguing that an increased number of conscripts was crucial to sustain the war effort.\nSpeech to the US CongressWhile June was a challenging month for Israeli Prime Minister Netanyahu, July brought some much-needed relief.\nHowever, Prime Minister Netanyahu’s address to Congress wasn’t just about impressing American lawmakers.\nAs events continue to unfold, the focus remains on Prime Minister Netanyahu’s leadership and how he will manage the precarious balance between military actions and political strategy."}, {"id": "4c2c20f1-f746-4d88-b9ea-32c1222c76e1", "title": "The Clone Wars Recreated - Liberation Patch file", "date": "2024-08-02 03:15", "url": "https://www.moddb.com/mods/the-clone-wars-recreated-total-conversion/downloads/the-clone-wars-recreated-liberation-patch", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Project: The Clone Wars Recreated Showcase Version Remastered - Build 1.0 - Liberation PatchAuthor: TCWR Productions / CT-7777Patch Filesize: 1,22GB (Compressed)Type: Showcase Version Update 1.0Liberation Patch - Addons- Doubled amount of nodes in Liberation Mode preventing unit stuck as much possible- New Weapon - MK II Paladin- Shotgun weapon swap from DC-15a to DP-23 based on Clone Wars Comics, The Clone Wars Legacy Archives and unreleased Battlefront II Model.\nEach scoped or optics weapon has unique Sight or Optics feature simillar to old Classic Battlefield 2.\nOptics mode also fixes the constant empty perk flashing when zooming with your sight.\nDrag GameData folder to main directoryExample:D:\\Games\\THE CLONE WARS RECREATED PRODUCTIONS-----------------------------------------------------Run Game:Navigate to:THE CLONE WARS RECREATED PRODUCTIONS\\GameDataHit RECREATED.exeDuring engine header files changes, sometimes the console error so-called CHUNK can appear.\nThe Clone Wars Recreated Productions 2024THIS PRODUCT IS NOT MADE, DISTRIBUTED, OR SUPPORTED BY ACTIVISION, RAVEN, DISNEY COMPANY ORLUCASARTS ENTERTAINMENT COMPANY LLC."}, {"id": "82f703ad-de74-4071-afc9-05e3d8189660", "title": "Lake , Gallego quickly move on from primary race , look toward November election", "date": "2024-08-02 03:30", "url": "https://www.abc15.com/news/political/elections/ruben-gallego-kari-lake-quickly-move-on-from-primary-race-look-toward-november-election", "domain": "abc15.com", "domain_classification": "Unknown", "message": "PHOENIX — U.S. Democratic Rep. Ruben Gallego will face Republican Kari Lake for Senate in November – a matchup he says he can win.\n“This is a competitive state.”Gallego and Lake started off the general election campaign with appearances at very different events in metro Phoenix.\nABC15 sat down for exclusive interviews with both Lake and Gallego leading up to the primary election.\nWatch those interviews below:In March, Kari Lake sat down with ABC15 to share her campaign priorities.\nEXCLUSIVE: Senate candidate Kari Lake sits down with ABC15 ArizonaIn June, Ruben Gallego sat down with ABC15 to share his campaign priorities."}, {"id": "5b427034-229a-4e3e-867c-e580b4ca1961", "title": "Harry Potter fans cant believe they didnt spot a key character that came back for the Battle of Hogwarts", "date": "2024-08-02 07:45", "url": "https://www.mirror.co.uk/film/harry-potter-fans-cant-believe-33378076", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Eagle-eyed Harry Potter fans have noticed that a small, but important character from the Philosopher's Stone appeared for a split second in the final filmHarry Potter fans can’t believe they didn’t spot a key character that came back for the Battle of HogwartsWithin J.K. Rowling's famous books, there are roughly 700 characters, however, just 14 of these show up in all eight movies.\nIn Harry Potter and the Philosopher's Stone, Gryffindor's Oliver Wood helps to teach Harry the rules of Quidditch.\nBut one TikToker, named Eddie, posted a video of Oliver reappearing during the Battle of Hogwarts in the eighth film, Harry Potter and the Deathly Hallows Part 2.\nThe video also has the caption: \"Can we appreciate how Oliver Wood came back to fight in the Battle of Hogwarts?\nOne TikToker - named Zogwarts - gave his followers the tricky task to name the Harry Potter film with just one screenshot."}]