[{"id": "8e7dadee-5300-4e52-9dc8-1f5d9774e5d4", "title": "Aon releases global catastrophe numbers for Q1", "date": "2024-04-30 13:30", "url": "https://www.insurancebusinessmag.com/us/news/catastrophe/aon-releases-global-catastrophe-numbers-for-q1-487163.aspx", "message": "Meanwhile, global disasters in the quarter claimed over 1,500 lives, a figure considerably below the long-term average.\nThe deadliest was the Noto earthquake, which resulted in 245 fatalities.\nThis was closely followed by severe flooding in the Democratic Republic of the Congo and Congo, which took 240 lives in January, and the catastrophic wildfires in Chile that claimed 131 lives the following month."}, {"id": "9c934b32-d1a4-4e2f-9230-504996341b85", "title": "CariCOF predicts a year of climate extremes in Caribbean", "date": "2024-05-01 06:15", "url": "https://www.jamaicaobserver.com/2024/05/01/caricof-predicts-year-climate-extremes-caribbean/", "message": "Hurricane damage in Rocky Point, ClarendonBRIDGETOWN, Barbados (CMC) — The Barbados-based Caribbean Climate Outlook Forum (CariCOF) Tuesday said 2024 is shaping up to be a year of climate extremes in the Caribbean.\nIn its latest Caribbean Climate Outlooks bulletin released here, CariCOF said for the three-month period up to July this year, a return to normal ocean temperatures in the equatorial Pacific and a near record warm Tropical North Atlantic Ocean are forecast.\n“Therefore, the region enters an intense heat season with recurrent heatwaves, and a possibly early start to an intense wet season.\nShower intensity and frequency are likely to sharply rise, resulting in high potential for flooding, flash floods, cascading hazards and associated impacts in most places, except the ABC (Aruba, Bonnaire and Curacao) islands.”But it noted that unknown is how frequent incursions of dry, dust-laden Saharan air into the Caribbean will be.\nIt said short-term drought to end of July is evolving in western and south-east Belize, and may possibly develop or continue in eastern and north-west Belize and central French Guiana."}, {"id": "d2dcbd41-b2b1-4ea1-b036-c83b55d7a3e8", "title": "2024 shaping up to be a year of climate extremes for Caribbean , CariCOF says", "date": "2024-04-30 17:45", "url": "https://www.jamaicaobserver.com/2024/04/30/2024-shaping-year-climate-extremes-caribbean-caricof-says/", "message": "A man fans himself to cool off as he sits on a bench in the shade.\nBRIDGETOWN, Barbados (CMC) — The Barbados Caribbean Climate Outlook Forum (CariCOF) Tuesday said 2024 is shaping up to be a year of climate extremes in the Caribbean.\nIn its latest Caribbean Climate Outlook bulletin, CariCOF said for the three months up to July this year, a return to normal ocean temperatures in the equatorial Pacific and a near-record warm Tropical North Atlantic Ocean are forecast.\n“Therefore, the region enters an intense heat season with recurrent heatwaves and a possibly early start to an intense wet season.\nIt said short-term drought to the end of July is evolving in western and southeast Belize, and may possibly develop or continue in eastern and northwest Belize and central French Guiana."}, {"id": "4a7146f3-258b-4df5-94a6-f77b116199d1", "title": "Report predicts increased extreme weather for Brazos Valley", "date": "2024-05-01 21:45", "url": "https://theeagle.com/news/local/weather/report-predicts-extreme-weather-increase/article_e5788d78-07f3-11ef-bc98-4751eac4a58d.html", "message": "As another round of thunderstorms are predicted for the Brazos Valley, a new report from the Texas state climatologist predicts extreme weather could become more commonplace in the future.\n“Events that are almost always destructive include hurricanes, tornadoes, hail, but you also get extreme heat and extreme rainfall.\nThroughout the Brazos Valley summer, Emergency Medical Services and city fire departments recorded dozens of heat exhaustion, heatstroke or sunstroke-related incidents.\n“Unfortunately, the Brazos Valley heat is part of the trend that we’ve seen across the entire state of Texas,” Nielsen-Gammon said.\n\"The Brazos Valley region is pretty much on-par with what the overall trend is across the United States on average."}, {"id": "04545a54-4f24-41f9-b483-bce181c956f5", "title": "After Maui , Hawaii lawmakers budget funds for firefighting equipment and a state fire marshal", "date": "2024-05-02 06:30", "url": "https://abcnews.go.com/US/wireStory/after-maui-hawaii-lawmakers-budget-funds-firefighting-equipment-109851437", "message": "“I think that the biggest game changer is now, Hawaii is viewed as a wildfire state,\" Rep. Kyle Yamashita, the chairperson of the House Finance Committee, told reporters after the bills passed.\nThe new fire marshal would review and assess fire risk in the state and work with county agencies to enforce the state fire code.\nThese duties have been handled by a council of the fire chiefs from Hawaii’s four main counties and state fire agencies since 1979, when Hawaii abolished the state fire marshal position.\nCurrently Hawaii is the only state without a state fire marshal.\n\"We need to learn how to deal with with these and prevent losses, mitigate losses, and just be prepared for the future.”The cause of the Lahaina wildfire is still under investigation."}, {"id": "a0a6a26e-85e7-4264-b75f-5013dc676bcc", "title": "After Maui , Hawaii lawmakers budget funds for firefighting equipment and a state fire marshal", "date": "2024-05-02 05:00", "url": "https://www.thespec.com/news/world/united-states/after-maui-hawaii-lawmakers-budget-funds-for-firefighting-equipment-and-a-state-fire-marshal/article_87b4bb5d-c3b4-59fa-91b4-95918153fbce.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "fb9d405c-004c-4e77-a224-258a7e75e090", "title": "Project underway to fight flooding in Sanford Mellonville neighborhood", "date": "2024-04-30 23:30", "url": "https://www.clickorlando.com/news/local/2024/04/30/project-underway-to-fight-flooding-in-sanfords-mellonville-neighborhood/", "message": "Work on the Mellonville Avenue Drainage Project includes replacing and upsizing the existing storm pipe to address flooding issues on 20th Street east of Washington Avenue.\nThe upgrades will provide additional storage and allow water to recede faster from areas like 20th Street between Mellonville Avenue and Summerlin Avenue, and the intersection of Mellonville Avenue at Crescent Street and Randolph Street.\nThis drainage project aims to get results by upgrading infrastructure that could fail in the future and create a serious flooding situation.\nSanford's Mellonville drainage project map.\nThe city expects work on the Mellonville drainage project will take a year to complete."}, {"id": "08115d2f-b3f2-42a9-b8c9-1bbb71d2cfbc", "title": "How to make your home hurricane resistant , as scientists predict an  extremely active  storm season – NBC Connecticut", "date": "2024-05-01 14:45", "url": "https://www.nbcconnecticut.com/news/business/money-report/how-to-make-your-home-hurricane-resistant-as-scientists-predict-an-extremely-active-storm-season/3279833/", "message": "The 2024 hurricane season is expected to be extremely active due to high-temperature waters.\nIn 2024, the national average cost to upgrade an entire house with hurricane windows runs between $1,128 and $10,293, or $100 and $500 per window, including installation, according to This Old House.\nUpgrades could help consumers protect their home, typically one of their most valuable assets, from windstorms and other natural disasters.\nHurricane resistance is about preventing 'pressurization'Hurricanes are different and unpredictable storms, said Jeff Ostrowski, a housing analyst at Bankrate.\nIf installing new hurricane windows aren't in the budget, shutters are lower-cost options to protect windows and other openings, said Chapman-Henderson."}, {"id": "989c05fa-cfde-47b8-8a6d-d6c5a70c3ef9", "title": "How to make your home hurricane resistant , as scientists predict an  extremely active  storm season – NBC10 Philadelphia", "date": "2024-05-01 14:45", "url": "https://www.nbcphiladelphia.com/news/business/money-report/how-to-make-your-home-hurricane-resistant-as-scientists-predict-an-extremely-active-storm-season/3846965/", "message": "The 2024 hurricane season is expected to be extremely active due to high-temperature waters.\nIn 2024, the national average cost to upgrade an entire house with hurricane windows runs between $1,128 and $10,293, or $100 and $500 per window, including installation, according to This Old House.\nUpgrades could help consumers protect their home, typically one of their most valuable assets, from windstorms and other natural disasters.\nHurricane resistance is about preventing 'pressurization'Hurricanes are different and unpredictable storms, said Jeff Ostrowski, a housing analyst at Bankrate.\nIf installing new hurricane windows aren't in the budget, shutters are lower-cost options to protect windows and other openings, said Chapman-Henderson."}, {"id": "81802341-d4ae-4774-95f0-abdcd6d660f5", "title": "No Garut resident took refuge owing to powerful quake : BPBD", "date": "2024-05-02 06:30", "url": "https://en.antaranews.com/news/312309/no-garut-resident-took-refuge-owing-to-powerful-quake-bpbd", "message": "No Garut resident took refuge owing to powerful quake: BPBDRelated news: BPBD Garut monitors the entire area after the earthquake occursGarut, W Java (ANTARA) - The Garut office of the Regional Disaster Mitigation Agency (BPBD) confirmed here on Wednesday that none of the residents took refuge following the recent powerful earthquake that struck the district's area on April 27.According to the agency's acting head, Aah Anwar Saefuloh, the quake-affected residents believe that their houses are still safe and secure, so they prefer staying at home to taking refuge.The magnitude 6.2 earthquake that rattled Garut District, West Java, on April 27 at midnight damaged 459 houses as well as 54 infrastructure and public facilities, including schools and hospitals.The damaged buildings were found in 101 villages of 29 sub-districts, he remarked, adding that the quake also injured six residents.The BPBD officers continued to verify the extent of damage caused to the affected buildings to calculate material losses incurred by locals due to the powerful quake, Saefuloh noted.Earthquakes regularly rock various parts of Indonesia since the country lies on the Circum-Pacific Belt, also known as the Ring of Fire, where several tectonic plates meet and cause frequent volcanic and seismic activities.West Java is one of the Indonesian provinces that is vulnerable to earthquakes.On Wednesday, January 3, 2024, for instance, a 5.9-magnitude earthquake jolted West Java's southern region.According to Head of the Meteorology, Climatology, and Geophysics Agency's Earthquake and Tsunami Center Daryono, the quake was triggered by a rock deformation in the Indo-Australian tectonic plate.Given its epicenter and hypocenter, the quake struck at a moderate depth and was the result of rock deformation in the Indo-Australian tectonic plate that subducted beneath the Eurasian plate, Daryono explained.The magnitude of the quake, which occurred at 7:53 a.m. local time, was later updated to 5.7.On November 21, 2022, at 1:21 p.m. local time, Cianjur District was jolted by a 5.6-magnitude earthquake, causing severe damage to 8,151 houses and moderate damage to 11,210 others.A total of 18,469 houses incurred mild damage.\nThe earthquake had also caused severe damage to 525 school buildings, 269 houses of worship, 14 healthcare facilities, and 17 office buildings, according to the Cianjur district government.Indonesia experienced the deadliest ever earthquake, followed by tsunami, in Aceh Province on December 26, 2004.\nThe catastrophe that also affected certain coastal areas in countries, such as Thailand, Sri Lanka, and India, reportedly killed some 230 thousand people.\nTranslator: Feri P, Rahmad NasutionEditor: Yuni Arisandy SinagaCopyright © ANTARA 2024"}, {"id": "94ebb9ab-4e49-4941-a39f-e1878b452e23", "title": "From Alberto to William : Here the list of 2024 hurricane names", "date": "2024-05-01 20:00", "url": "https://www.yahoo.com/news/alberto-william-list-2024-hurricane-173805964.html", "message": "TAMPA, Fla. (WFLA) — We’re in for an “extremely active” hurricane season, researchers predict, with a forecasted 23 named storms.\n‘Extremely active’ 2024 hurricane season ahead, researchers predictThe World Meteorological Organization maintains lists of 21 names that are used in a six-year rotation.\nList of names for the 2024 Atlantic Hurricane Season:Alberto Helene Oscar Beryl Isaac Patty Chris Joyce Rafael Debby Kirk Sara Ernesto Leslie Tony Francine Milton Valerie Gordon Nadine WilliamWhy do hurricanes have names?\nA total of 96 names have been removed from the Atlantic hurricane list since 1953.\nIn 2021, the WMO created a supplemental list of names to be used in case the regular list was exhausted."}, {"id": "545d29a5-0285-4897-973e-a7c631c9ee87", "title": "Alberto , Francine and Kirk : These are the hurricane names for 2024", "date": "2024-05-01 20:30", "url": "https://www.yahoo.com/news/alberto-francine-kirk-hurricane-names-185215009.html", "message": "TAMPA, Fla. (WFLA) — We’re in for an “extremely active” hurricane season, researchers predict, with a forecasted 23 named storms.\nList of names for the 2024 Atlantic hurricane season:Alberto Helene Oscar Beryl Isaac Patty Chris Joyce Rafael Debby Kirk Sara Ernesto Leslie Tony Francine Milton Valerie Gordon Nadine WilliamWhy do hurricanes have names?\nA total of 96 names have been removed from the Atlantic hurricane list since 1953.\nThe WMO determined there simply aren’t enough names beginning with Q, U, X, Y, and Z.\nNames beginning with those letters can also be difficult to understand across multiple languages."}, {"id": "1ce3f953-f44b-4efc-9101-f06876e836ed", "title": "Delos boosts wildfire insurance offering", "date": "2024-05-01 12:45", "url": "https://www.insurancebusinessmag.com/us/news/property/delos-boosts-wildfire-insurance-offering-487392.aspx", "message": "“With this product and the partnership with Lloyd’s underwriters, we can help homeowners fill the coverage gap that exists between their traditional homeowner’s policy and their vacancy status.\nWe are committed to creating insurance products that will help more homeowners in California, who may otherwise go uninsured, find insurance coverage.”"}, {"id": "96139632-87d4-4bf8-bd1f-4166d0a4ae59", "title": "Norfolk flood wall funding from state could fall short", "date": "2024-05-01 01:00", "url": "https://www.dailypress.com/2024/04/30/state-funding-for-norfolks-flood-wall-could-fall-short/", "message": "Norfolk’s plan to build a flood wall downtown to block damage from catastrophic storms could fall short by $48.8 million in state funds in the next fiscal year, according to changes to the proposed city budget.\n“We have adequate funds in place to initiate construction on Phase 1A,” City Manager Pat Roberts said at a Norfolk City Council retreat on Tuesday.\nThe governor originally proposed $73.8 million in state funding for the project in fiscal year 2025, but the General Assembly cut the proposed amount to $25 million.\nThe city planned for the state to split the remaining funding for the project not covered by federal sources evenly.\nThe city’s proposed budget for next fiscal year allocates only $25 million in state funds toward the project."}, {"id": "7fcaa5c6-1222-428b-95db-b22e6f22dba1", "title": "  On every roof something is possible : how sponge cities could change the way we handle rain | Environment", "date": "2024-05-02 05:45", "url": "https://www.theguardian.com/environment/2024/may/02/on-every-roof-something-is-possible-how-sponge-cities-could-change-the-way-we-handle-rain", "message": "Amsterdam has taken that one step further with blue-green roofs, specially designed to capture rainwater.\nCitywide, the blue-green roof coverage is even bigger, estimated at more than 45,000 sq metres.\nThe water levels in the blue-green roof are managed by a smart valve.\nView image in fullscreen The blue-green roof functions like ‘a flat rain barrel’.\n“Our philosophy in the end is not that on every roof, everything is possible,” says Spaan, “but that on every roof, something is possible.”"}, {"id": "4f45ab40-8ae8-4e8e-9350-57f68771a390", "title": "Hot , stormy summer is likely ahead for Maine growers", "date": "2024-05-02 05:45", "url": "https://www.bangordailynews.com/2024/05/02/homestead/homestead-environment/hot-stormy-summer-maine-growers-joam40zk0w/", "message": "In southern Maine, temperatures will average from 50 to 60 percent higher than a typical year.\n“That doesn’t necessarily mean it will be hot and oppressively humid.”Precipitation will likely be typical throughout the growing season, possibly a little wetter than usual in late summer, the weather service predicts.\nSome garden crops like corn will do well with hot weather, as do others with origins in warmer climates than Maine, like tomatoes and peppers, if diseases and pests are managed.\nThose are often grown at the beginning and end of the season elsewhere in the country, while Maine growers could historically grow them throughout the summer, Goossen said.\nAll kinds of crops could bolt, or flower prematurely, in very hot temperatures, making the plants tough and bitter to eat."}, {"id": "a4c9ce5c-f0ad-4574-96d6-a60978d2c47a", "title": "Katy residents celebrate ribbon - cutting ceremony for $13 . 5 million drainage project – Houston Public Media", "date": "2024-05-01 01:30", "url": "https://www.houstonpublicmedia.org/articles/infrastructure/2024/04/30/485089/katy-residents-celebrate-at-the-ribbon-cutting-ceremony-for-a-13-5-million-drainage-project/", "message": "More than 250 households that used to struggle with flooded streets and homes will benefit from new culverts, drainage pipes, and increased curb inlets.\nPatricia Ortiz/ Houston Public MediaResidents in the Cimarron neighborhood near Katy celebrated a completed $13.5 million drainage project during a ribbon-cutting ceremony on Tuesday.\nHarris County voters approved a $2.5 billion bond shortly after Hurricane Harvey.\nHarris County Commissioner Lesley Briones shared during the ribbon-cutting ceremony that she was pregnant and nearing her delivery date during Harvey.\nOver 180 projects across Harris County have benefited from the bond."}, {"id": "585ab1a5-0f29-4cf7-bd0d-5fa9d428207e", "title": "  Not fit for purpose : RAAC found in Huntly and Portree fire stations", "date": "2024-04-30 21:45", "url": "https://www.pressandjournal.co.uk/fp/news/aberdeen-aberdeenshire/6452915/raac-found-portree-and-huntly-fire-stations/", "message": "Two fire stations in the north and north-east will need to be rebuilt after the discovery of Reinforced Autoclaved Aerated Concrete (RAAC).\nThe Scottish Fire and Rescue Service (SFRS) has revealed 14 fire stations in Scotland have been deemed “not fit for purpose” including those in Huntly and Portree.\nRAAC found in Huntly and Portree fire stationsDeputy Assistant Chief Officer Stephen Wood, Head of Service Delivery for the North of Scotland, said: “Some of our ageing buildings are no longer fit for purpose and require urgent action.\n“We must find a permanent solution.”What is Reinforced Autoclaved Aerated Concrete (RAAC)?\nReinforced Autoclaved Aerated Concrete is a form of lightweight concrete used in construction in many public buildings in the UK between the 1950s and 1990s."}, {"id": "a7cd57a9-81a1-4980-8ebb-f1d6e1f25677", "title": "M 5 . 5 Earthquake Hits Indonesia North Maluku Province", "date": "2024-05-01 04:45", "url": "https://en.tempo.co/read/1862745/m-5-5-earthquake-hits-indonesias-north-maluku-province", "message": "TEMPO.CO, Jakarta - An earthquake shook the Jailolo area, West Halmahera Regency, North Maluku on Tuesday, April 30 at 20:52 West Indonesia Time.\nAccording to the Meteorology, Climatology and Geophysics Agency (BMKG), it was a tectonic earthquake with a magnitude of 5.5.\nDaryono said that based on the location of the epicenter and the depth of the hypocenter, the tectonic earthquake was a type of moderate earthquake due to rock deformation on the Maluku Sea Plate.\nBased on shakemap estimates, the earthquake sent tremors to the areas of Loloda, West Halmahera, Batang Dua Island and Ternate City, North Maluku, with an intensity scale of III MMI.\nTEMPO.COEditor's Choice: Estimated Loss from Garut Earthquake Hits Rp12.6bnClick here to get the latest news updates from Tempo on Google News"}, {"id": "cc8e107c-b7d7-4fd0-aa0e-c8ddc248ef60", "title": "FEMA Sends $1 MIllion To Lake Charles", "date": "2024-05-01 20:00", "url": "https://cool925.iheart.com/content/2024-05-01-fema-sends-1-million-to-lake-charles/", "message": "(Lake Charles, LA)-- More than a million-dollars in federal grant money is coming to Calcasieu Parish for Hurricane Laura relief funding.\nSenator Bill Cassidy announced on Tuesday that the Federal Emergency Management Agency will provide the grant to the Calcasieu Parish School Board.The FEMA grant will pay for repairs to school buildings that were damaged in the 2020 storm."}, {"id": "57596f6f-a3b5-42e2-a895-45e1175a1b32", "title": "Hurricane Season forecasts continue to show above - average activity", "date": "2024-05-02 00:30", "url": "https://wpde.com/weather/abc-15-weather-authority-blog/hurricane-season-forecast-above-average-activity-tropical-storm-la-nina-cool-waters-water-major-hurricanes-category-3-or-higher-20-named-storms-south-carolina-june-1-2024", "message": "We are nearing the start of hurricane season.\nWe are now a month away, and more bureaus have been releasing their forecasts for the upcoming season.\nThat, combined with the still expected very warm Atlantic ocean waters, is helping to make many forecasts quite active.\nREAD MORE:More forecasts from other institutions/bureaus/companies are coming out, and each one is very similar, showing a very active season with over TWENTY named storms.\nHurricane Season begins on June 1 and runs through November 30."}, {"id": "7b7fba4e-386a-46d8-b3a2-b5c4eab530ac", "title": "Kenya floods : Scores missing after weeks of heavy rain", "date": "2024-04-30 12:45", "url": "https://www.cnn.com/2024/04/30/africa/kenya-nairobi-flooding-missing-people-intl/", "message": "Mai Mahiu, Kenya CNN —At least 91 people are missing after heavy flooding across Kenya’s capital, Nairobi, the government said Tuesday, after weeks of heavy rain and flash floods ravaged parts of the country.\nSome 76 people are missing after flooding near the hard hit town of Mai Mahiu, northwest of Nairobi.\nResidents gather at the river bed to search for missing people in Mai Mahiu on Monday.\nKenya has registered heavy rain since mid-March but downpours have intensified over the past week, leading to mass flooding which has killed dozens of people.\nHeavy rains have also affected Tanzania and Burundi."}, {"id": "d32e693d-1706-4929-8093-20a912d090a0", "title": "Scores missing as Kenya ravaged by mass flooding", "date": "2024-04-30 15:15", "url": "https://kvia.com/news/us-world/cnn-world/2024/04/30/scores-missing-as-kenya-ravaged-by-mass-flooding/", "message": "CNNBy Larry Madowo and Isaac Oyombe, CNNMai Mahiu, Kenya (CNN) — At least 91 people are missing after heavy flooding across Kenya’s capital, Nairobi, the government said Tuesday, after weeks of heavy rain and flash floods ravaged parts of the country.\nSome 76 people are missing after flooding near the hard hit town of Mai Mahiu, northwest of Nairobi.\nLocals and first responders told CNN the disaster was caused by water blowing through a clogged tunnel under a railway bridge.\nKenya has registered heavy rain since mid-March but downpours have intensified over the past week, leading to mass flooding which has killed dozens of people.\nHeavy rains have also affected Tanzania and Burundi."}, {"id": "3843236a-0b33-43d1-8b77-8f6ac30ab4c5", "title": "Climate - driven  pulse of heat  to hit B . C ., say researchers - Victoria Times Colonist", "date": "2024-05-02 06:45", "url": "https://www.timescolonist.com/local-news/exceptional-climate-change-event-could-drive-bc-fire-weather-this-week-8683760", "message": "to see warming made five times more likely because of human-caused climate change.\nAn “exceptional climate change event” is forecast to push temperatures well above seasonal averages across B.C.\nScientists at the U.S. research group Climate Central have released models showing a warm spell stretching May 1 to 5 will be made five times more likely due to climate change.\nThe modelling is combined into a public-facing Climate Shift Index (CSI), a near real-time rapid attribution tool showing the likelihood climate change is influencing current global temperature patterns.\n“But what we want to do is highlight that the things that you see over the next few days are part of the climate change story.”"}, {"id": "f448e6d8-ef68-470c-8df9-7170f2821829", "title": "Labette County farmers find silver lining in weekend rainstorms", "date": "2024-04-30 23:30", "url": "https://www.yahoo.com/news/labette-county-farmers-silver-lining-213845849.html", "message": "BARTLETT, Kan. — Excessive rainfall over the weekend caused significant flooding issues for many – however for some it was beneficial.\nBartlett Co-op Association location manager Walter Eck says locally – the weekend storms didn’t have too much of an impact.\nHe says parts of Labette County saw three to four inches of rain – which was a big help to some farmers.\nThe river’s still rising, so we’re still seeing some moderate flooding in the river bottoms, the crops, and the river bottoms.\nSo it shouldn’t affect the crops in the river bottom too much,” said Walter Eck, Bartlett Co-op Association location manager."}, {"id": "cb2a2af2-9223-43b6-b548-35aa3f5bd780", "title": "Houston storms return , bring flash flood risk to saturated areas", "date": "2024-05-01 12:45", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/wednesday-outlook-storms-bring-flash-flood-risk-19430611.php", "message": "He brings five years of experience forecasting tropical systems, severe weather outbreaks, and blizzards to the Houston Chronicle.\nJustin looks forward to his work with the Houston Chronicle, where he'll be responsible for posting daily weather forecasts.\nOn top of daily forecasts, he is excited to tackle more in-depth weather and climate stories that impact the residents of Southeast Texas.\nA North Carolina native, Justin joined the Chronicle in July 2023.\nHe graduated with his bachelor's degree in meteorology from the University of North Carolina at Charlotte in December 2017."}, {"id": "cd945d28-4e0c-4612-a36f-46311582f50a", "title": "Large hail , damaging winds , tornadoes threaten KC area as severe weather returns", "date": "2024-04-30 13:45", "url": "https://www.yahoo.com/news/large-hail-damaging-winds-tornadoes-131201306.html", "message": "Powerful thunderstorms are expected to sweep through the Kansas City region Tuesday, bringing the threat of large hail, damaging winds and maybe a tornado or two, the National Weather Service said.\nThe Storm Prediction Center has placed Kansas City, Des Moines, Topeka and Lawrence under an enhanced risk of severe weather.\nNational Weather Service in Kansas CityAnother round of severe weather in forecastTuesday’s weather will kick off a stormy period for the Kansas City area.\nWeather watches and warningsA live data feed from the National Weather Service containing official weather warnings, watches, and advisory statements.\nSources: NOAA, National Weather Service, NOAA GeoPlatform and Esri."}, {"id": "6e090a55-d1b0-4379-8bc2-f3d380826039", "title": "Severe storms , tornadoes expected to continue in Great Plains", "date": "2024-04-30 19:30", "url": "https://www.upi.com/Top_News/US/2024/04/30/severe-storms-tornadoes-continue/9221714498343/", "message": "Dallas, Oklahoma City, Wichita, Kan., Kansas City, Mo., and Omaha, Neb., are among the major cities at risk for severe weather for several hours spanning Wednesday and Wednesday night.\nThe risk of severe weather will begin to shift eastward Thursday as the storm system moves along.\nSevere weather will extend from near Minneapolis to just north of Austin, Texas, or along a zone of about 1,000 miles.\nFor parts of the Great Plains, this will mark the third day in a row this week for the potential for severe weather.\nThe count of filtered severe weather incidents from last weekend is close to 500, with more than 150 tornadoes."}, {"id": "0914a8f4-485b-4e9f-8043-202dbbc70420", "title": "National Hurricane Center plans more outreach in preparing for  extremely active  storm season", "date": "2024-04-30 15:15", "url": "https://www.wuwf.org/florida-news/2024-04-30/national-hurricane-center-plans-more-outreach-in-preparing-for-extremely-active-storm-season", "message": "The National Hurricane Center is gearing up for what might be an extremely active, even record-breaking hurricane season.\nIt occurs when a storm’s wind speed increases by at least 35 miles per hour over a 24-hour period.\nSeveral of the strong storms hitting the U.S. over the last century were tropical storms just three days before landfall.\n“So we're comfortable making those forecasts public.”Historically, any tropical storm or hurricane watches and warnings have been issued on a full advisory.\nTropical cyclone public advisories, tropical weather outlooks, tropical cyclone discussions and key messages will all be translated."}, {"id": "f622e5de-cb20-4c32-a48e-d9bf7d48de1a", "title": "FIRST WARN WEATHER : Severe storms in NW counties , scattered showers for early evening", "date": "2024-04-30 23:00", "url": "https://www.kctv5.com/2024/04/30/first-warn-weather-severe-storms-nw-counties-scattered-showers-early-evening/", "message": "TENNIS BALL size hail possible with one of the strongest cells.\nWe will continue with the storm threat into our Wednesday and Thursday forecast.\nThe severe weather activity lies much more concentrated to the west rather than within our viewing area.\nWe still see a marginal risk for severe storms developing Wednesday and Thursday with the main threats of damaging winds and hail.\nWe expect to dial down to the lower 70s Friday but still isolated shower and storm activity chances are about 20 to 30% clear through the weekend."}, {"id": "69ac70ef-dae7-4259-80fc-47b9fcd67a41", "title": "Authorities monitoring for major flooding along E . Fork of San Jacinto River in NE Harris , SE Montgomery Counties", "date": "2024-04-30 22:45", "url": "https://www.click2houston.com/news/local/2024/04/30/authorities-monitoring-for-major-flooding-along-e-fork-of-san-jacinto-river-in-ne-harris-se-montgomery-counties/", "message": "The East Fork RV Park in Cleveland, Liberty County, flooded by water that crested the banks of the San Jacinto River following several days of heavy rain.\nHARRIS COUNTY, Texas – Authorities with the Harris County Flood Control District are monitoring for the potential of major flooding along the East Fork of the San Jacinto River in northeast Harris and southeast Montgomery Counties.\nStreets affected include Brookside, Chinquapin, River Side, E. San Jacinto, Glenwood, Dipping, Idlewild, and Lazy Creek.\nKingwood Area:Flooding is expected in the low-lying areas backing up to the East Fork of the San Jacinto River.\n“The Flood Control District’s Flood Watch team will continue to monitor the gages and water levels in the San Jacinto area."}, {"id": "101a7b08-3930-4fe6-99bd-a1fbd092c91d", "title": "Forecast : Threat for severe storms returns to Iowa Tuesday", "date": "2024-04-30 12:15", "url": "https://siouxcityjournal.com/news/state-regional/weather/weather-forecast-iowa-storms-wind-hail/article_f1529954-592d-5aef-aed6-677d10473a92.html", "message": "Showers and storms are likely during the afternoon and evening today in Iowa.\nDamaging wind and hail are expected in spots and tornadoes and flooding can't be ruled out.\nGet all the details on the hazards and storm timing in our latest forecast video."}, {"id": "a913c502-e42e-47c2-a3c6-c1b180ec7cb0", "title": "Local News - 977 The Bay", "date": "2024-05-02 11:00", "url": "https://977thebay.com/local-news/0afa80219af32b8fe33207cddbd349b2", "message": "While severe weather can happen outside of this timeframe, it is the most active for hurricane and tropical storm activity.\nResidents are encouraged to stock up on sandbags now so that they are prepared before a storm strikes our area.\nCommunity partners and DES will also be onsite distributing free hurricane preparedness supplies and information.\nDiscuss with loved ones how you will communicate before, during, and after a potential emergency or severe weather event.\nBring your pets indoors during severe weather."}, {"id": "5483cb7b-9574-4bd8-b2c9-3878297eccc3", "title": "West Java residents should be adaptive in mitigating earthquakes : BMKG", "date": "2024-04-30 13:15", "url": "https://en.antaranews.com/news/312195/west-java-residents-should-be-adaptive-in-mitigating-earthquakes-bmkg", "message": "West Java residents should be adaptive in mitigating earthquakes: BMKGJakarta (ANTARA) - The Meteorology, Climatology, and Geophysics Agency (BMKG) called on West Java residents to be adaptive and proactive in mitigating potential earthquakes, as the region is prone to the disaster.\nContinuous rains can cause dams to burst and lead to flooding.\n\"This occurred in Garut (West Java) and the Banten Province in the past.\nHence, there is a need for tighter vigilance and supervision of the soil condition in areas prone to landslides and floods,\" she stated.\nTranslator: Sugiharto P, KenzuEditor: Azis KurmalaCopyright © ANTARA 2024"}, {"id": "71c2ae9e-436f-43aa-895f-526ec06e8aaf", "title": "Kenya searches for more than 90 missing after floods", "date": "2024-04-30 11:30", "url": "http://www.channelafrica.co.za/sabc/home/channelafrica/news/details?id=7c3d3c85-2f88-4cc5-9e3c-9e085bcc1bab&title=Kenya%20searches%20for%20more%20than%2090%20missing%20after%20floods", "message": "At least 46 people were killed this Monday morning in a mudslide and flash floods in Mai Mahiu town in central Kenya, the Ministry said in a situation report, an increase of one on the previous death toll.\nSurvivors in Mai Mahiu described an onslaught of water that carried away houses, cars and railway tracks.\nFifty-three more people in Mai Mahiu were reported missing, the Interior Ministry said, while the Kenya Red Cross said its tracing desk had reports of 76 missing.\nIn all, at least 169 people have died across Kenya from heavy rains and flooding since last month.\nAt least 120 people were killed in Kenya late last year by flooding caused by the El Nino weather phenomenon."}, {"id": "591a4876-1691-4eab-b33e-656d2107f3f9", "title": "The first major ban on open fires in BC comes into effect May 3rd", "date": "2024-04-30 21:00", "url": "https://www.mynelsonnow.com/56267/provincial-news/the-first-major-ban-on-open-fires-in-bc-comes-into-effect-may-3rd/", "message": "The BC Wildfire Service has announced a 5-month ban on Category 3 fires in some parts of BC’s Interior, which includes the Kamloops, Penticton, Lillooet, Vernon, and Merritt fire zones.\nCategory 3 open fires will be prohibited from May 3 to Oct. 11, prohibiting people from burning three or more fires on a property at one time, and any fire burning with a burning pile of more than 2 meters in height or 3 meters in width.\nAs drought conditions persist across most of the province, officials fear the 2024 wildfire season could be as bad, or worse, than last year’s record-setter.\nThe BC Wildfire Service said in a media release that anyone found to be violating the open burning prohibition could face a $1,150 fine and up to $100,000 with possible jail time for those found guilty.\n- Advertisement -The fire ban does not include Category 1 campfires, or Category 2 open fires, for now."}, {"id": "4eea26e7-db3e-4858-b906-363f805e5e42", "title": "Houston flood risk continues : Here a timeline of storm activity", "date": "2024-05-02 10:45", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/thursday-outlook-storms-flood-risk-continues-19433481.php", "message": "He brings five years of experience forecasting tropical systems, severe weather outbreaks, and blizzards to the Houston Chronicle.\nJustin looks forward to his work with the Houston Chronicle, where he'll be responsible for posting daily weather forecasts.\nOn top of daily forecasts, he is excited to tackle more in-depth weather and climate stories that impact the residents of Southeast Texas.\nA North Carolina native, Justin joined the Chronicle in July 2023.\nHe graduated with his bachelor's degree in meteorology from the University of North Carolina at Charlotte in December 2017."}, {"id": "0cdddd82-9266-4724-91bc-2bac5d0c555b", "title": "Florida lawmakers introduce new bill that could save money on flood policies , attract homeowners", "date": "2024-05-02 02:00", "url": "https://www.news4jax.com/news/local/2024/05/01/florida-lawmakers-introduce-new-bill-that-could-save-money-on-flood-policies-attract-homeowners/", "message": "FLORIDA – Florida lawmakers introduced a new bill that could save customers money on flood policies and encourage more homeowners to get insurance.\nCongressman Byron Donalds and Senator Rick Scott introduced new legislation that could encourage Floridians to start shopping for flood insurance called “The Flood Insurance Relief Act”.\nThe goal of the Flood Insurance Relief Act is to attract more homeowners to get insurance.\nAbout a third of all U.S. flood policies are now written by private flood insurers.\nThe Flood Insurance Relief Act would provide a tax break with all flood policies, not just NFIP policies but also private policies as well."}, {"id": "b5dabb47-954d-45af-a86e-084048836352", "title": "Disaster relief loans now available for East Texans affected by severe weather , Gov . Abbott says", "date": "2024-05-02 01:00", "url": "https://www.yahoo.com/news/disaster-relief-loans-now-available-221029562.html", "message": "Greg Abbott’s request for a disaster declaration for Texas communities affected by severe weather including many portions of East Texas.\nBill that could help fix East Texas’ weather radar dead zones passes HouseTexas counties in the disaster declaration include Angelina, Hardin, Jasper, Newton, Orange, Sabine, San Augustine and Tyler.\n“For Texans who have been impacted by storms and flooding last month, this SBA disaster declaration will help them access the crucial financial assistance they need to recover and rebuild,” Abbott said.\n“Impacted Texans will be able to qualify for low-interest loans so they can begin to rebuild their homes and businesses that sustained storm damage.”PHOTOS: Severe storms bring flooding, downed power lines to East TexasThe SBA granted access to Home Disaster Loans, Business Physical Disaster Loans and Economic Injury Disaster Loan to provide homeowners, renters and businesses affected by the severe weather with low-interest loans.\nApplicants can also call SBA’s customer service center at 800-659-2955 or email disastercustomerservice@sba.gov for more information in disaster assistance."}, {"id": "c30a05dd-c759-457c-ba27-d6eee8bb6c85", "title": "FOX 26 Storm Alert Day issued for tonight through Thursday", "date": "2024-05-02 06:45", "url": "https://www.yahoo.com/news/fox-26-storm-alert-day-014111737.html", "message": "HOUSTON - A FOX 26 Storm Alert Day has been issued for Wednesday night and Thursday with multiple rounds of heavy rain and a few severe storms possible.\nHouston is in a two out of four, 15% street flood risk through Thursday.\nFlood risk will be lower towards the coast.\nHouston is in a 2 out of 5 severe storm risk through Thursday morning with hail and winds near 60 mph the main risks.\nStay ahead of the storms by getting weather updates with the FOX 26 weather team on our smart TV app Fox Local and our FOX 26 Weather App!"}, {"id": "a0861554-c18f-4624-b4ab-3eb8ce79a244", "title": "First responders from all over Texas meet at Coastal Bend Hurricane Conference", "date": "2024-05-01 22:15", "url": "https://www.kristv.com/news/local-news/in-your-neighborhood/nueces-county/robstown/the-two-day-annual-coastal-bend-hurricane-conference-has-started-here-are-the-biggest-takeaways", "message": "The official start to hurricane season is a month away, and on Wednesday more than a thousand first responders from all over met here in the Coastal Bend to help prepare for the upcoming hurricane season.\nPeople filled the Richard Borchard Fairgrounds for the Annual Coastal Bend Hurricane Conference.\nHawkins said they review past storms and one of the things they work on is how to improve their response time.\nNueces County Judge Connie Scott said this two-day conference gives everyone a chance to network and share their ideas.\nThomas said this conference gives those on the front line the exposure they need to be prepared."}, {"id": "a6eb3afb-c17e-4a7a-b453-e91365eeb463", "title": "Comox Valley Regional District focuses on Emergency Preparedness Week", "date": "2024-05-01 22:15", "url": "https://www.comoxvalleyrecord.com/community/comox-valley-regional-district-focuses-on-emergency-preparedness-week-7352307", "message": "Comox Valley Emergency Management and the Comox Valley Regional FireSmart Resilience committee will kick off Emergency Preparedness Week (May 5-11) with a Wildfire Community Preparedness Day on Saturday, May 4.\n“Emergency Preparedness Week is a great reminder to all residents and businesses in the Comox Valley to review their emergency plan and ensure they are prepared,” saidCari McIntyre, emergency planning co-ordinator at Comox Valley Emergency Management.\nThe Wildfire Community Preparedness Day event will take place from 9 a.m.-1 p.m. at the Comox Valley Farmers’ Market (4839 Headquarters Road, Courtenay.\n“FireSmart practices have proven they save lives and property,” said Lt. Ian Robertson, chair of the Comox Valley Regional FireSmart Resilience committee.\nHelpful steps• Go to www.comoxvalleyrd.ca/getnotified to sign up for local emergency notifications delivered to your landline or mobile phone."}, {"id": "503d106f-4e23-4c22-b73c-cfc49822af92", "title": "Smiles and laughter as a Nation rebuilds", "date": "2024-05-01 14:00", "url": "https://www.nationalobserver.com/2024/05/01/news/smiles-and-laughter-nation-rebuilds", "message": "In Skwlāx te Secwepemcúl̓ecw First Nation, where last summer fires in B.C.\nThat’s what stood out most for Kukpi7 (Chief) James Tomma following a ribbon-cutting ceremony for this community last week.\nThe ceremony celebrated a new subdivision that will house community members who lost their homes in August in the Bush Creek East wildfire.\nTomma has promised Skwlāx that he will be the last community member to close the door of his forever home behind him.\n“Now it's just clear-cut, very stark and brutal.” #Climate #Wildfire Tomma said he is indebted to his former councillor Wes Francois, whose team spearheaded the rebuild."}, {"id": "779ac59e-d047-4c26-a34e-9173d93ec419", "title": "Federal money will help prepare 2 Philly bridges for climate - driven floods", "date": "2024-05-02 02:00", "url": "https://whyy.org/articles/philadelphia-bridges-repair-flooding-climate-change/", "message": "Federal money is coming to Philadelphia to rebuild two bridges over the Wissahickon Creek in Northwest Philly to help them withstand the pressures of traffic and increased flooding.\nThe projects are part of a nationwide grant program to shore up roads and bridges against the impacts of human-caused climate change.\nHigher water levels in the area due to sea level rise disrupt travel on the road “daily,” according to the U.S. Department of Transportation.\nIn the northeastern United States, increased flood risk is among the biggest impacts of climate change.\nHeavy rain is becoming more frequent and intense, and sea level rise is causing more sunny-day flooding in coastal areas."}, {"id": "b85a3ea6-63f5-4881-9c62-13001f836c55", "title": "BE WEATHER AWARE TODAY", "date": "2024-05-01 15:45", "url": "https://www.kcbd.com/2024/05/01/be-weather-aware-today/", "message": "LUBBOCK, Texas (KCBD) - Thunderstorms are likely to bring a variety of severe weather types to parts of the South Plains today.\nThunderstorms are likely to bring a variety of severe weather types to parts of the South Plains late this afternoon and evening.\nToday's severe weather threat is Marginal, the lowest of the five levels used by the Storm Prediction Center.\nUse the Interactive Radar in our KCBD Weather app to track the storms.\nStorms, some severe, are likely late this afternoon and evening."}, {"id": "47dd66f7-81c3-431e-872e-e3c257fa6c32", "title": "Protect Your Home : Essential Tips For Wildfire Season in Missoula", "date": "2024-04-30 23:30", "url": "https://newstalkkgvo.com/protect-home-wildfire-missoula/", "message": "Missoula, MT (KGVO-AM News) - After a very dry winter, wildfire specialists are warning those living in the ‘wildland-urban interface’ to be especially careful to prepare for the upcoming wildfire season.\nI spoke with Taylor Blakely, Engineer Paramedic and Wildland Fire Program Coordinator with the Missoula Rural Fire District about important tips on keeping homes and properties safe from wildfire.\nLiving in the Wildland Urban Interface Brings Wildfire Danger“The most important thing is to take a look right next to your home,” began Blakely.\nBut you can give your home a chance by simple things like spreading out the canopy spacing of the trees.\n“Those are big projects and we understand that, but we're going to advise you on all areas of wildfire preparedness for your home.”Click below for the Wildfire Preparedness Guide."}, {"id": "0339dbf7-5a7a-472d-8f8b-ce5fd5688bf5", "title": "Kenya flood toll rises to 181 as homes and roads are destroyed", "date": "2024-05-01 15:00", "url": "https://www.thestar.com.my/news/world/2024/05/01/kenya-flood-toll-rises-to-179-as-homes-and-roads-are-destroyed", "message": "Torrential rain and floods have destroyed homes, roads, bridges and other infrastructure across the region.\nThe death toll in Kenya exceeds that from floods triggered by the El Nino weather phenomenon late last year.\nIn the central Kenyan town of Mai Mahiu, where at least 48 died in flash floods on Monday, two bodies were recovered from the debris on Wednesday, Kenya Red Cross South Rift Regional Manager Felix Maiyo said.\nEarlier on Wednesday, government spokesperson Isaac Mwaura said the total death toll had risen by 10 to 179.\nIn Kitengela, 33 km (20 miles) from Nairobi, Kenya Red Cross workers were helping to rescue residents whose homes were marooned by flood waters."}, {"id": "01f88bb7-5eb1-47f0-a002-b2214c21da32", "title": "Kenya flood toll rises to 181", "date": "2024-05-02 01:00", "url": "https://www.thenews.com.pk/print/1184544-kenya-flood-toll-rises-to-181", "message": "— AFP FileNAIROBI: Floods and landslides across Kenya have killed 181 people since March, with hundreds of thousands forced to leave their homes, the government and Red Cross said on Wednesday, as dozens more were killed in neighbouring Tanzania and Burundi.\nTorrential rain and floods have destroyed homes, roads, bridges and other infrastructure across the region.\nThe death toll in Kenya exceeds that from floods triggered by the El Nino weather phenomenon late last year.\nEarlier on Wednesday, government spokesperson Isaac Mwaura said the total death toll had risen by 10 to 179.\nIn Kitengela, 33 km (20 miles) from Nairobi, Kenya Red Cross workers were helping to rescue residents whose homes were marooned by flood waters."}, {"id": "ebe6eb62-ebaf-46f6-bf75-b08eb57f353b", "title": "Firefighters who lost homes to wildfire gear up for season ahead", "date": "2024-04-30 15:15", "url": "https://www.cbc.ca/news/canada/british-columbia/firefighters-lost-homes-2023-b-c-new-season-1.7188537", "message": "Wilson's Landing firefighters are pictured battling the McDougall Creek fire in 2023.\n(Submitted by Annick deGooyer)Zydowicz was one of 13 firefighters with the Wilson's Landing Fire Department to lose their homes.\nThirteen of the 24 members of the Wilson's Landing Fire Department lost their homes to wildfire last summer.\nThe Salvation Army served hundreds of meals to Wilson’s Landing firefighters and members of other fire departments.\n\"The Wilson's Landing firefighters are people who consistently demonstrate their commitment to the community,\" said Henson."}, {"id": "de961464-2cee-465e-aee4-f04be29fc981", "title": "ERCOT cautions of a potential power emergency this week", "date": "2024-04-30 19:45", "url": "https://www.tpr.org/environment/2024-04-30/ercot-cautions-of-a-potential-power-emergency-this-week", "message": "ERCOT late last week warned of a potential power emergency starting Monday evening through Wednesday.\nThe electrical grid operator said there may be a shortfall of power reserves, and that it was adjusting planned power plant outages to shore up supply for the anticipated shortage.\nDo you think that’s going to have an impact?\nTexas Standard: How does hurricane season affect power supply and demand?\nBut, in terms how we see these storms impacting the power, demand and supply side of things, it really depends on where it hits."}, {"id": "75855b10-0bcc-4be0-a8b7-6e1e84ac6cf7", "title": "Flood Threat Continues in the Plains", "date": "2024-04-30 14:15", "url": "http://www.weathernationtv.com/news/flood-threat-continues-in-the-plains", "message": "2 May 2024 1:15 AMFlooding has become a serious component of our nearly week-long severe weather threat, which is still ongoing.\nOvernight, the flood threat remains highest in Texas including Austin, Waco, and College Station.\nOne silver lining to this forecast is that much of the Central Plains (Kansas, Missouri) is still dealing with drought.\nThe flood threat continues to be elevated, especially in Texas, Louisiana, Oklahoma, and Arkansas.\nA few storms with our weekend wave of energy may be on the stronger side on Friday."}, {"id": "a32d8e97-89ed-4b2e-9534-82f5563fe3cc", "title": "Boynton Beach Announces Hurricane Vegetation Amnesty Week", "date": "2024-04-30 23:15", "url": "https://bocanewsnow.com/2024/04/30/boynton-beach-announces-hurricane-vegetation-amnesty-week/", "message": "The City of Boynton Beach announces free vegetation pickup as homeowners are encouraged to prepare for hurricane season now.\nThe City of Boynton Beach issued this advisory to BocaNewsNow.com:“As hurricane season approaches, the Boynton Beach Solid Waste Division urges residents to do their part by conducting tree trimming early.\nThe city is offering a hurricane vegetation amnesty week from May 6 -10, during which the city will allow residents unlimited, free vegetation pickup.\nOutside of vegetation amnesty week, residents may place 3 cubic yards of vegetation weekly the day before their scheduled pick-up.\nThe same guidelines apply for hurricane vegetation amnesty week.”Our Featured Local Journalism Supporter:News Updates | Breaking News and Traffic Alerts"}, {"id": "6da48a81-0e87-46f0-9cc0-a201e0000dbf", "title": "South Bethany voter guide : Mayor , 3 council members to be elected May 11", "date": "2024-05-01 09:45", "url": "https://www.yahoo.com/news/south-bethany-voters-guide-mayor-085216694.html", "message": "South Bethany will hold an election Saturday, May 11, voting for a mayor and three town council members.\nSouth Bethany Town Council candidate Steven Gallagher.\nSouth Bethany Town Council candidate Bob Shields.\nSouth Bethany Town Council candidate Rob Taishoff.\nThis article originally appeared on Delaware News Journal: Mayor, 3 council members to be elected in South Bethany on May 11"}, {"id": "45ec579d-6b2f-480f-8f10-0e9d9aa3287f", "title": "Panel of professors weighs wildfire risk for 2024", "date": "2024-04-30 21:00", "url": "https://www.nuggetnews.com/story/2024/05/01/news/panel-of-professors-weighs-wildfire-risk-for-2024/36404.html", "message": "A panel of University of Oregon professors who study climate change, smoke, and wildfire discussed the 2024 wildfire season in an online forum with journalists as the West braces for summer fires.\nSnowpack across Oregon is about average, and it’s been an El Niño winter and spring, meaning conditions have been wetter-than-normal.\nA stretch of hot summer months could dry it out just as fast, creating tinder for a wildfire.\n“Even the risk avoided by deenergizing the grid has different impacts to different communities,” she said.\nHeidi Huber-Stearns, a research professor and expert on the public health impacts of wildfire smoke, said power shutoffs can also trap people in unhealthy conditions."}, {"id": "76b4eecb-fd27-4de6-a630-2d8bf7d814df", "title": "No need to monitor Doppler radar on Wednesday", "date": "2024-04-30 22:30", "url": "https://www.startribune.com/no-need-to-monitor-doppler-radar-on-wednesday/600362838/", "message": "One more try: I did not invent Doppler radar.\nA previous company, EarthWatch, used Doppler to create a 3-D videogame-like simulation for TV weather graphics in the 1990s.\nIn truth I'd love to put up a big golf-ball radar dome on my roof, but my wife (and neighbors) might resist such efforts.\nDoppler, along with volunteer Skywarn weather spotters and improved NOAA warnings, has saved countless lives in recent decades.\nA portable NOAA NSSL Doppler on a flatbed truck measured winds of 224 mph during last Friday's giant wedge tornado near Harlan, Iowa."}, {"id": "0fcc55cd-026c-48c6-90b5-f1a2c5a1b14d", "title": "Meta Canadian News Ban Could Put People At Risk During Public Emergencies", "date": "2024-04-30 23:45", "url": "https://menafn.com/1108159145/Metas-Canadian-News-Ban-Could-Put-People-At-Risk-During-Public-Emergencies", "message": "government recently announced plans to work with American tech company Meta this wildfire season to deliver important public safety information.\nThis was made more challenging because people are often dispersed geographically and clinging to their phones and social media for reliable guidance.\nHere's what the government can do about itIn emergencies, information is keyThere are already more than 100 fires burning in British Columbia alone.\nWhile Google reached a deal with the federal government to provide Canadian news in 2023, Meta still blocks Canadian outlets on its platforms.\nLast summer, premiers , Indigenous groups and other members of the public requested the Meta media ban stop during emergencies."}, {"id": "97891563-e544-4bf4-b3c3-2b2424007de5", "title": "West Java Bandung Jolted by 4 . 2M Earthquake , 2 Aftershocks : BMKG", "date": "2024-05-01 09:30", "url": "https://en.tempo.co/read/1862771/west-javas-bandung-jolted-by-4-2m-earthquake-2-aftershocks-bmkg", "message": "TEMPO.CO, Jakarta - An earthquake measuring 4.2 magnitudes jolted Bandung Regency, West Java, at 10:06 a.m. local time on Wednesday, May 1, as reported by the Meteorology, Climatology, and Geophysics Agency (BMKG).\nDaryono, head of the BMKG’s quake and tsunami center, said the tectonic quake was located on land at a distance of 20 kilometers southeast of Bandung Regency.\nMoreover, the shaking was also reported in the Soreang, Pasirwangi, and other Garut areas at a lower intensity of II MMI.\nAlthough there have been no reports of damage to buildings caused by the earthquake, the BMKG recorded two aftershocks as of 10:28 a.m. local time.\nYOHANES PASKALISEditor's Choice: M 5.5 Earthquake Hits Indonesia's North Maluku ProvinceClick here to get the latest news updates from Tempo on Google News"}, {"id": "97ced575-e6bc-434a-b6f1-c3b3965a73f9", "title": "Tsunami alert as volcano erupts with three - mile ash plume | World | News", "date": "2024-05-01 14:00", "url": "https://www.express.co.uk/news/world/1894429/Tsunami-alert-volcano-erupts-ash-plume", "message": "An eruption from Mount Ruang volcanoA tsunami alert has been issued after a volcano in the infamous 'Ring of Fire erupted and spewed out a mile-high ash plume.\nThis follows an increase in the alert level for the Sulawesi Island volcano after sensors detected heightened volcanic activity.\nREAD NEXT: Watch dramatic moment huge volcano erupts sparking tsunami warningPeople are evacuated as Mount Ruang eruptsYulius Ramopoli, head of the Mount Ruang monitoring post, described the vibrations as so \"intense\" that it \"shook everything around us\".\nSituated in North Sulawesi province, the rumbling 2,378ft Ruang volcano sits just 59 miles northeast of Sam Ratulangi International Airport in Manado, the provincial capital.\nTrendingPeople watch as Mount Ruang eruptsSUBSCRIBE Invalid email We use your sign-up to provide content in ways you've consented to and to improve our understanding of you."}, {"id": "94acf20e-f060-4658-b841-577b4016f510", "title": "Greece boosts special firefighting units to cope with its growing heat risk", "date": "2024-05-01 04:45", "url": "https://abcnews.go.com/International/wireStory/greece-boosts-special-firefighting-units-cope-growing-heat-109814371", "message": "“It’s actually already summer for us,” Kolovos told The Associated Press during a recent training exercise.\nCrew members include forestry experts and firefighters with varied skills, many developed in training with colleagues in France, Spain and the United States.\nGreek authorities are doubling down on training and new firefighting methods, with another tough season expected this year.\nWindy and mountainous with hard-to-reach islands, Greece faces a daunting annual challenge in defending multiple urban settlements that overlap with wooded areas at wildfire risk.\n“We hope, because summer is coming again and the torment will begin.”___Theodora Tongas in Loutraki, Greece, contributed."}]