[{"id": "83fe171d-6fd8-465b-8183-fbc3e7416c4a", "title": "Hawaii could be threatened by tropical cyclone in Pacific Ocean", "date": "2024-08-21 00:45", "url": "http://www.sfchronicle.com/weather/article/hawaii-could-be-threatened-by-tropical-storm-19667371.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "Weather satellite imagery captured a disorganized area of showers and thunderstorms in the Pacific Ocean on Tuesday afternoon, the beginnings of a likely tropical storm that may impact Hawaii this weekend.\nThere is a much lower probability of reaching Category 1 hurricane strength, with sustained winds of at least 74 mph.\nAdvertisement Article continues below this adThe storm’s name will depend on exactly where in the Pacific it reaches tropical storm strength.\nThe National Hurricane Center previously predicted 1-4 named storms in the central Pacific this year, down from the usual 4-5.\nThe most recent tropical storm to make landfall on the Big Island was Tropical Storm Darby in 2016."}, {"id": "543a4dea-1d18-49c3-acef-87ad180b9402", "title": "One year since Hilary : Here what happened when the storm hit", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/one-since-hilary-happened-storm-232100686.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One year since Hilary: Here’s what happened when the storm hitOne year since Hilary: Here’s what happened when the storm hitSAN DIEGO (FOX 5/KUSI) — Tuesday marks one year since remnants of Tropical Storm Hilary unleashed historic torrential downpours on Southern California.\nFor the first time ever for California, the National Hurricane Center issued a tropical storm watch, and later a tropical storm warning.\nPHOTOS: Tropical Storm Hilary moves through San DiegoNonetheless, it dropped significant rain on Southern California, notably in desert and mountain areas.\nMeanwhile, peak wind gusts in San Diego County reached speeds of around 70 miles per hour to 84 miles per hour, according to NWS.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "298aab80-5e42-4c53-ba99-2d9f5dec82d2", "title": "Disaster declaration approved for Vermont for July flooding from remnants of Beryl - LocalNews8 . com", "date": "2024-08-21 04:00", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/20/disaster-declaration-approved-for-vermont-for-july-flooding-from-remnants-of-beryl/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "MONTPELIER, Vt. (AP) — President Biden has approved a major disaster declaration for Vermont that makes federal funding available to help people and communities affected by flooding from July 9 through July 11 caused by the remnants of Hurricane Beryl.\nThe storm dumped more than 6 inches of rain in just a few hours on parts of Vermont.\nVermont’s governor has made a separate disaster declaration request for flooding from storms on July 30.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "c5c05c16-d8ff-4eb3-9416-9eac7bf86959", "title": "Debby by the Numbers : Floods , Rain , Tornadoes And More", "date": "2024-08-21 03:15", "url": "https://www.wuft.org/weather/2024-08-20/debby-by-the-numbers-floods-rain-tornadoes-and-more", "domain": "wuft.org", "domain_classification": "Unknown", "message": "It's been more than 2 weeks since Debby smashed into Florida's Big Bend and triggered a life threatening storm surge, widespread flash floods, massive power outages and spawned multiple tornadoes.\nTropical Storm Debby pushed into southern Georgia on Monday after making landfall on Florida’s Big Bend coast and killing at least one person.\nDebby is expected to move offshore into the Atlantic Ocean, with winds pushing surf back toward the shoreline.\npic.twitter.com/3FHPT0YLJG — Jonathan Erdman (@wxjerdman) August 5, 2024Debby was the second hurricane of the 2024 Atlantic hurricane season, following the deadly and devastating Hurricane Beryl.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico - the 4th named storm of the 2024 Atlantic #hurricane season."}, {"id": "4f8d6a2c-5cdf-4647-8b4d-9fd58e40503e", "title": "Debby by the Numbers : Floods , Rain , Tornadoes And More", "date": "2024-08-21 05:15", "url": "https://www.southcarolinapublicradio.org/sc-news/2024-08-20/debby-by-the-numbers-floods-rain-tornadoes-and-more", "domain": "southcarolinapublicradio.org", "domain_classification": "Unknown", "message": "@WNCN pic.twitter.com/yP9ebW0Ez1 — Deana Harley (@Deanaharleynews) August 8, 2024Hurricane Debby became a tropical depression on August 3rd and then a tropical storm soon after.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico - the 4th named storm of the 2024 Atlantic #hurricane season.\nAround 2 a.m. on Aug. 8, Debby made a second landfall near Bulls Bay, South Carolina, with sustained winds near 50 mph.\nDuring a five-day period, dozens of cities and towns across South Carolina saw rainfall totals of more than a foot.\nTropical Storm #Debby will go down as number 2 for producing the most amount of rain in a tropical system in the state of South Carolina."}, {"id": "4cf9e655-ad1c-4bb9-9430-c8d02b65ac8e", "title": "Wexford County Council issue high tide warning due to impact of supermoon", "date": "2024-08-21 14:00", "url": "https://www.independent.ie/regionals/wexford/news/wexford-county-council-issue-high-tide-warning-due-to-impact-of-supermoon/a13508563.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Wexford County Council has issued a warning for people to take care in coastal areas due to high tides caused by the supermoon.\nMet Éireann issued a high tide advisory for all coasts which comes into effect at noon today (Wednesday) and remains in place until noon on Friday, August 23.\nIt is advised that during this period of supermoon spring tides, Highest Astronomical Tide (HAT) is expected to be exceeded in certain areas around the coast.\nIreland will also be affected by strong winds and increased storm surge form the remnants of Hurricane Ernesto.\nA combination of these strong onshore winds, high spring tides and significant waves may result in some localised coastal flooding and wave overtopping in the coming days."}, {"id": "ba391424-7133-43bc-91e5-11139805d924", "title": "Puerto Rico Insurers to Absorb Hurricane Ernesto Losses : AM Best", "date": "2024-08-21 08:45", "url": "https://www.insurancejournal.com/news/national/2024/08/21/789308.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Losses in Puerto Rico from Hurricane Ernesto are expected to be absorbed by the island’s domiciled insurers, according to industry rating AM Best.\nThe rating agency said premiums in Puerto Rico had been flat for years prior to hurricanes Maria and Irma in 2017.\nAlso, unaffiliated Puerto Rico-domiciled companies have accounted for a growing share of total Puerto Rico NPW.\nAdditionally, premium ceded for the unaffiliated Puerto Rico-domiciled companies to reinsurance companies has more than doubled since 2017.\nPhoto: Broken electricity lines above homes damaged after Tropical Storm Ernesto hit Fajardo, Puerto Rico, on Aug. 14, 2024."}, {"id": "82fe86fb-de30-497e-880c-c3ac1558bfbe", "title": "Hurricane Ernesto weather warning issued as storm to bring heavy rain and strong winds", "date": "2024-08-21 07:45", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/hurricane-ernesto-weather-warning-issued-29779477", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning from 11am on Wednesday to 8am on Thursday.\nGusts of up to 60mph and persistent rain could bring some “dangerous conditions” to some areas, the Met Office has warned.\nREAD MORE: Mum of city centre rioter, 16, who racially abused police officer tells judge 'he's just gone out with friends'A yellow weather warning for rain has been issued in Scotland, covering western and southern areas.\nRemnants of Hurricane Ernesto, which ripped through the North Atlantic last week, are playing a “background role” in the downpours and windy weather this week, according to the weather agency.\nMet Office meteorologist Dan Rudman said temperatures are likely to be “around or slightly below average for the time of year”."}, {"id": "2cbb0133-bdd8-42be-897c-5a002ef7b4fc", "title": "Storm Warnings in Place Across Europe , From Northern Greece to Poland", "date": "2024-08-21 12:00", "url": "https://www.insurancejournal.com/news/international/2024/08/21/789367.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Thunderstorm alerts are in place for a swath of Europe from Poland and Hungary to Italy and Greece.\nThere are orange warnings for northern Greece, as the summer heat gives way to violent storms and the risk of flooding.\nSerbia and Kosovo face similar alerts, while much of Italy is under a yellow storm warning.\nThere’s also a yellow warning for heavy rain in the west of Scotland, while the Gironde in southwest France is on flood alert.\n⚠️ Yellow weather warning UPDATED 📷Heavy rain across western ScotlandValid 1100 Wednesday to 0800 ThursdayLatest info 👉 https://t.co/QwDLMfRBfsStay #WeatherAware⚠️ pic.twitter.com/pCigWi4vAN— Met Office (@metoffice) August 21, 2024Photograph: Lightning striking over Nice, France, on Aug. 14, 2024."}, {"id": "66e33409-cd6c-4d43-8ca1-116db1abee9f", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast | iNFOnews", "date": "2024-08-21 11:00", "url": "https://infotel.ca/newsitem/cda-wildfires/cp1097929311", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coastTrees burned by the Bush Creek East Wildfire are seen above Little Shuswap Lake in Squilax, B.C., Monday, Sept. 11, 2023.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "a7f77997-5297-4951-b6f1-1dcc973b03ac", "title": "Met Office yellow weather warnings across united kingdom on Thursday as  summer air mixes with Hurricane Ernesto  ", "date": "2024-08-21 14:00", "url": "https://www.walesonline.co.uk/news/uk-news/met-office-yellow-weather-warnings-29783114", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "Yellow weather warnings for rain and wind have been issued across the UK for Thursday as humid summer air mixes with the remains of Hurricane Ernesto.\nUp to 6in (150mm) of rain and strong winds of up to 60mph could affect some areas over a 24-hour period, with flooding, dangerous coastal conditions and power cuts possible, the Met Office said.\nThe forecaster has issued a yellow warning for rain for the western half of Scotland, covering the Highlands, south-west Scotland and Strathclyde, from 11am on Wednesday to 8am on Thursday.\nSeparate yellow warnings for wind covering northern Wales and northern England, including both Cumbria and Northumberland, have been issued from 1am to 9am on Thursday.\nThe Scottish Environment Protection Agency has issued 21 flood alerts, meaning flooding is expected, across the Orkney and the Western Isles, and coastal areas in Moray and Dumfries and Galloway."}, {"id": "1be81744-3eb8-46c3-929f-3ed3dcd73dda", "title": "What should you do to prepare for the climate change storm ? ", "date": "2024-08-21 08:00", "url": "https://skepticalscience.com/prepare-climate-storm.html", "domain": "skepticalscience.com", "domain_classification": "Unknown", "message": "What should you do to prepare for the climate change storm?\nOn a personal level, you should prepare for the intensifying climate change storm like you would for an approaching major hurricane.\n(Image credit: rebuildbydesign.org)The tools above merge the physical and environmental risks from climate change with the societal risks that exacerbate weather and climate extremes.\nThe 2023 National Climate Assessment has individual chapters detailing how climate change is expected to unfold for 10 U.S. regions.\nMoneyThose with wealth will be much better positioned to weather the coming climate change storm."}, {"id": "7d6585b0-214c-4914-86d7-780761ce1a22", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 10:30", "url": "https://www.yahoo.com/news/gilma-becomes-2nd-hurricane-eastern-095051822.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from landThis image provided by the National Oceanic and Atmospheric Administration shows Tropical Storm Gilma, at center, Monday, Aug. 19, 2024.\n(National Oceanic and Atmospheric Administration via AP)MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nThe Category 1 storm was located about 935 miles (1,504 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "dae58924-69d6-4e62-bc84-d5dca2f987d5", "title": "Light earthquake : M4 . 3 quake has struck near Lorengau in Papua New Guinea", "date": "2024-08-21 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-m4-3-quake-has-struck-near-lorengau-in-papua-new-guinea-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, 173 km SE of Lorengau, Papua New Guinea (107 miles).\nThe earthquake occurred at a depth of 10 km (6 miles).\nThe 4.3-magnitude earthquake was detected at 07:16:46 / 7:16 am (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 173 km SE of Lorengau, Papua New Guinea."}, {"id": "b88e35e9-1433-487a-9516-a6d536f0f18d", "title": "Riding out the storm : post - Ernesto fitness comeback", "date": "2024-08-21 12:00", "url": "https://www.royalgazette.com/wellness/lifestyle/article/20240821/riding-out-the-storm-post-ernesto-fitness-comeback/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "Let’s dive into the essentials of hurricane fitness prep, guilt-free snacking, and bouncing back after the storm has passed.\nYour fitness goals didn’t wash away with the storm surge ― they’re still there, waiting for you to pick up where you left off.\n5, Forgive and forget: if you didn’t stick to your fitness goals or overindulged during the storm, let it go.\nAs usual, remain unapologetic about your fitness and wellness journey, stay true to yourself and always be honest with your efforts.\nShe specialises in nutrition, weight and sprint training, operating out of HindsSight Fitness and Wellness at the Berkeley Cultural Centre."}, {"id": "0229910d-4125-4ded-9b74-f4a75abd0c10", "title": "Timeline and rainfall of Hurricane Ernesto released", "date": "2024-08-21 12:00", "url": "https://www.royalgazette.com/weather/news/article/20240821/timeline-and-rainfall-of-hurricane-ernesto-released/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "At the same time, wind speeds by the airport were peaking at about 59mph with gust speeds at more than 71mph.\nMarops recorded top wind speeds of nearly 73mph at the same time, which were accompanied by 91mph wind gusts.\nHurricane Ernesto was the fifth named storm of the 2024 hurricane season, following Hurricanes Beryl and Debby and Tropical Storms Alberto and Chris.\nHowever, in a revised forecast released by the CSU, it predicted 25 named storms, including 12 hurricanes, half of which would become major hurricanes.\nThe National Hurricane Centre forecast an 85 per cent chance of a busier-than-average season with between 17 and 25 named storms, while Britain’s Met Office forecast 22 named storms during the season."}, {"id": "5e52343c-e22e-4e6f-943b-259115da2e32", "title": "Light earthquake : M4 . 4 quake has struck near Lospalos in Timor Leste", "date": "2024-08-21 08:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-m4-4-quake-has-struck-near-lospalos-in-timor-leste-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Thursday, 194 km NE of Lospalos, Timor Leste (121 miles).\nGlobal date and time of event UTC/GMT: 01/08/24 / 2024-08-01 03:25:42 / August 1, 2024 @ 3:25 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nAll ids that are associated to the event: us7000n7xv.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 194 km NE of Lospalos, Timor Leste."}, {"id": "677cc5b4-803a-4172-930a-56ebe427c4a9", "title": "Could Hawaii be impacted by developing tropical cyclones in the Pacific ? ", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/could-hawaii-impacted-developing-tropical-214048998.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Could Hawaii be impacted by developing tropical cyclones in the Pacific?\nDirect strikes on the archipelago are rare, but periods of increased waves and wind are more common with passing tropical cyclones.\nIn nearly all cases, these features act as barriers to tropical cyclones approaching the islands, rapidly leading to their weakening or dissipation.\nNOAA’s Central Pacific Hurricane Center, in coordination with the agency’s Climate Prediction Center, expects between one and four tropical cyclones to traverse the ocean, which is below the typical four to five tropical depressions, tropical storms and hurricanes.\nOriginal article source: Could Hawaii be impacted by developing tropical cyclones in the Pacific?"}, {"id": "07496622-2445-420c-a400-cd149e08774e", "title": "Light earthquake 4 mag , 33 km E of Hualien City , Taiwan", "date": "2024-08-21 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-4-mag-33-km-e-of-hualien-city-taiwan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Friday, 33 kilometers (21 miles) from Hualien City in Taiwan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 31.153 km (19 miles).\nThe epicenter was 34 km (21 miles) from Hualian (c. 350 500 pop), 84 km (52 miles) from Yilan (c. 94 200 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 33 km E of Hualien City, Taiwan."}, {"id": "74e5c066-aea6-46dd-b7ee-832c141f7e95", "title": "Coastal car parks shut as remnants of Hurricane Ernesto set to make landfall", "date": "2024-08-21 14:00", "url": "https://www.irishtimes.com/ireland/2024/08/21/weather-forecast-coastal-car-parks-shut-as-remnants-of-hurricane-ernesto-set-to-make-landfall/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "Photograph: NOAA via APGalway County Council has closed car parks in coastal areas in advance of expected high tides on Wednesday evening.\nA combination of the remnants of Hurricane Ernesto and very high tides could lead to flooding and wave overtopping.\nThe council has closed car parks in Galway city that are susceptible to flooding, including Silverstrand and Toft car parks.\nSalthill car park will be closed to the public from 1pm on Wednesday until further notice.\nAll coasts will be affected by strong winds, high waves, forecasted surges and high astronomical tides."}, {"id": "c52d682b-a849-4202-9ee5-720b652a34bd", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/western-alaska-yupik-village-floods-234629059.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "db1479a6-d7a7-4eec-8241-426ba63e82b7", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:30", "url": "https://www.kob.com/news/us-and-world-news/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms/", "domain": "kob.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "22aabf85-64da-4971-95b9-5243926e7bc4", "title": "Western Alaska Yupik village floods as river rises from a series of storms – Winnipeg Free Press", "date": "2024-08-21 00:15", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024.\n(Job Hale via AP)It caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river."}, {"id": "e7e03c17-d165-48e7-931d-a2f1d7af18f3", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 11:30", "url": "https://kstp.com/world/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms/", "domain": "kstp.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "19679de5-901d-4b6a-b719-85755d7046a2", "title": "Experts warn 2024 could be hottest year on record", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/experts-warn-2024-could-hottest-212720636.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Experts warn 2024 could be hottest year on recordWASHINGTON (NEXSTAR) — Climate scientists warn this year is likely to be the hottest on record, according to a briefing by the National Oceanic and Atmospheric Administration.\nLast year, 2023, was the hottest year on record.\nThose include Hurricane Beryl, the earliest Category 5 hurricane on record, hailstorms in Colorado and wildfires in New Mexico.\n“We have instruments on the space station that are measuring what is happening to the Earth,” Nelson said.\nNOAA estimates, because of near record sea temperatures and the La Nina, the Atlantic could see eight to 13 hurricanes this year."}, {"id": "454b7a15-9dfc-4257-bdb6-6878de987e65", "title": "Q & A : How advanced geocoding and PUIDS are revolutionizing peril risk assessment in insurance", "date": "2024-08-21 00:45", "url": "https://www.digitaljournal.com/business/qa-how-advanced-geocoding-and-puids-are-revolutionizing-peril-risk-assessment-in-insurance/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Charlton outlines the role that geocoding and PUIDs play in revolutionizing peril risk assessment for insurers.\nDigital Journal: How is rooftop geocoding essential for insurance companies to accurately price risk in areas prone to significant perils like hurricanes and wildfires?\nUnderwriters will be able to quickly and accurately price policies to risk data already linked to a PUID, eliminating operational overhead and increasing accuracy.\nWhat other tools are available to insurance carriers to improve risk assessment?\nFuture innovations in address technology and geocoding could significantly transform risk assessment in the insurance industry."}, {"id": "b785f34f-f166-49c2-9f22-5b3064174bd8", "title": "Valley fever cases rise to record high in California in 2023 : CDPH", "date": "2024-08-21 02:00", "url": "http://www.sfchronicle.com/health/article/valley-fever-cases-rise-record-high-california-19667254.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "California is on track to surpass last year’s record-high cases of valley fever, a potentially debilitating infection caused by inhaling fungal spores in dirt or dust.\nBrontë Wittpenn/The ChronicleCalifornia in 2023 reported a record-high number of valley fever cases — a potentially debilitating infection caused by inhaling fungal spores in dirt or dust — and 2024 is on track to surpass that, state health officials said Tuesday.\nIn 2023, nearly 9,300 cases of valley fever were reported statewide, about triple the number from a decade ago, according to state data.\n“These were the highest first and second quarter for valley fever that we’ve ever had in the state of California,” Cooksey said.\nBut California health officials have noted surges in valley fever roughly two years after major droughts — followed by a wet winter — since the early 2000s."}, {"id": "7f4973a6-88a5-4718-8510-84a26be874ad", "title": "Oxford schools address potential delays due to flooding", "date": "2024-08-21 02:30", "url": "https://www.wfsb.com/2024/08/20/oxford-schools-address-potential-delays-due-flooding/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "OXFORD, CT (WFSB) - As the new school year approaches, parents and students in Oxford are concerned about potential delays due to damage from Sunday’s storm.\nThe storm caused significant flooding, leaving many families, like AJ Powell’s, facing severe losses.\nThe storm caused significant flooding, leaving many families, like AJ Powell’s, facing severe losses.\nThe situation is further complicated by inaccessible long driveways, which are common in Oxford and essential for school bus routes.\nOxford has a lot of long driveways as well that are somewhat mini roads and those driveways are compromised,” said Oxford’s superintendent Dr. Robert Miller."}, {"id": "5f3b0795-700f-40ac-adfe-32dc0bf3060c", "title": "Storm system tracking north , could bring heavy rain Saturday", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/storm-system-tracking-north-could-013503726.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "They are expected to merge Tuesday night and when they do a tropical depression or tropical storm will form the next day.\nThe storm is expected to strengthen as it moves into the central Pacific.\nThere is a possibility for strong winds and heavy rain when the storm approaches the islands during the weekend.\nIt is expected to impact Hawaii Island as it passes south Saturday afternoon and potentially impact Maui County Sunday, with impacts to Oahu starting on Monday.\nThe storm has the potential to be named Hector if it develops into a tropical storm and east of 140W, and it would be named Hone if it forms west of 140W."}, {"id": "71fa6f48-f73d-4418-ab85-9a21e2baa7a2", "title": "Wildfires in Canada : Extreme weather fuelling flames", "date": "2024-08-21 11:15", "url": "https://www.ctvnews.ca/climate-and-environment/extreme-weather-fuelled-flames-coast-to-coast-largest-study-of-2023-wildfires-finds-1.7008427", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\nClimate models suggest that under the most extreme carbon emission scenarios, those conditions could be normal by 2050.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "616f67c5-bf89-459c-9dec-8509b74717f7", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.thespec.com/news/canada/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast/article_2a0828f5-e32e-5518-98b1-49b8b3363396.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "30d1e604-1243-4856-bef1-2cea3e159fde", "title": "Conway residents still dealing with river flooding after Debby", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/conway-residents-still-dealing-river-221926742.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CONWAY, S.C. (WBTW) — Waccamaw River flooding caused by Tropical Storm Debby forced many Conway residents to move their cars, call out of work, temporarily move or a combination of all three.\nThe entrances to Pitch Landing Road and Lees Landing Circle are currently blocked off by police cars.\nSome families trying to get to Conway’s Riverfront Park had to turn around after realizing how bad the flooding was.\nAlthough the river level is slowly falling, it’s still at major flood stage and will remain that way until about Friday.\nThe Stonebraker family is from Aynor and came to check out the flooding for themselves."}, {"id": "0da20b1b-311f-437c-b4ce-15f38d454184", "title": "Extreme weather fuelled fires coast to coast in 2023 , largest study finds", "date": "2024-08-21 13:45", "url": "https://www.nationalobserver.com/2024/08/21/news/extreme-weather-fires-2023-study", "domain": "nationalobserver.com", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nAlthough 2023 saw 834 large fires, only 60 of them were responsible for nearly three-quarters of the area burned.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "95a20645-0738-4e76-861a-cefecdf43acf", "title": "Zulu headquarters to be lifted , renovated to combat flooding | Business News", "date": "2024-08-21 12:15", "url": "https://www.nola.com/news/business/zulu-building-renovation-mardi-gras/article_515b2de8-5f2e-11ef-9f6c-a7fa4cbf9638.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "68b5b3ad-dc84-41fa-90f7-039f9df71f06", "title": "Smart health facilities triumph over Hurricane Beryl", "date": "2024-08-21 08:00", "url": "https://jamaica-gleaner.com/article/health/20240821/smart-health-facilities-triumph-over-hurricane-beryl", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Hurricane Beryl provided a defining moment for the Mandeville and Santa Cruz health centres, which were two of the four facilities upgraded to ‘gold standard’ under the Strengthening Healthcare Facilities in the Caribbean (Smart Hospitals Programme Phase 2).\nNotably, preliminary assessments conducted after the storm revealed minimal damage to both health centres.\n“Having weathered the storm, these Smart Health Centres underscore the necessity of robust healthcare infrastructure in regions vulnerable to natural disasters.\nThe Smart facilities serve as a model for adaptation, essential in strengthening and safeguarding public health systems amid climate uncertainty,” said Ian Stein, PAHO/WHO Jamaica representative.\nFor her part, Judith Slater, British High Commissioner to Jamaica, said, “I was heartened, but not surprised, to learn that the Mandeville and Santa Cruz ‘Smart’ health centres withstood Hurricane Beryl’s worst to emerge with minimal damage."}, {"id": "15788c5e-1621-410d-8b26-0255af98c9e8", "title": "Met Éireann issues High Tide Advisory for all coasts", "date": "2024-08-21 09:15", "url": "https://www.wlrfm.com/news/met-eireann-issues-high-tide-advisory-for-all-coasts-373228", "domain": "wlrfm.com", "domain_classification": "Unknown", "message": "Met Éireann has issued a High Tide Advisory for all coasts from 12 noon today (Wednesday) until 12 noon Friday.\nIt is advised that during this period of supermoon spring tides, Highest Astronomical Tide (HAT) are expected to be exceeded in areas around the coast.\nAccording to the forecaster, Ireland will be affected by strong winds and increased storm surge from the remnants of Hurricane Ernesto.\nA combination of strong onshore winds, high spring tides and significant waves may result in localised coastal flooding and wave overtopping in the coming days.\nAdvertisementWaterford City and County Council’s severe weather management team is monitoring the situation and Council ground crews will be on stand-by to put in place flood mitigation measures if the need arises."}, {"id": "b136ede5-346b-4de0-a407-b40957a71b7b", "title": "Lancashire Fire Service to use drones to prevent devastating wildfires", "date": "2024-08-21 04:45", "url": "https://www.lancashiretelegraph.co.uk/news/24529630.lancashire-fire-service-utilise-fire-prevention-drones/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "They intend to use intelligent firefighting drones to suppress fires as part of an effort to develop cost-effective early mitigation strategies for wildfires.\nTo tackle the fires, they will utilise several robots to work together as a swarm to identify and suppress any risks.\nIn 2018, East Lancashire fire and rescue crews sent 60 firefighters to a blaze on Winter Hill which was roughly a kilometre in size.\nAdditionally, teams spent 41 days battling 18 square kilometres of wildfire on Winter Hill moorland near Bolton.\nThrough using thermal and optical imaging the drones can automatically detect and investigate fires and relay the information to the fire team."}, {"id": "be8c5fa3-70c8-4a1f-8a89-42ea31edc0f5", "title": "Railroads hunker down as Hurricane Rita nears Texas , Louisiana ( 9 / 23 / 2005 ) - RailPrime | ProgressiveRailroading", "date": "2024-08-21 04:15", "url": "https://www.progressiverailroading.com/railPrime/details/Railroads-hunker-down-as-Hurricane-Rita-nears-Texas-Louisiana-9232005--67572", "domain": "progressiverailroading.com", "domain_classification": "Unknown", "message": "With Hurricane Rita bearing down on parts of Texas and Louisiana, ready to come ashore early tomorrow, freight and passenger railroads have been scrambling the past two days to batten down the hatches and prepare for the storm’s wrath.\nHowever, the railroad relocated all freight cars from Galveston Island, and moved inland other locomotives and cars threatened by potential flooding.\nComprising two TRE locomotives and six passenger cars, the train will be operated by a TRE crew provided by Herzog Transit Services Inc.\nKansas City Southern also is repositioning locomotives and cars away from points in Houston, Beaumont, Corpus Christi and Port Arthur, Texas.\nKCS also has embargoed traffic to Beaumont, Port Arthur, Port Neches and Chaison, Texas."}, {"id": "68e8e141-99e8-4899-99bc-89cde1336daa", "title": "Lancashire Fire Service to use drones to prevent devastating wildfires", "date": "2024-08-21 08:45", "url": "https://www.theboltonnews.co.uk/news/24529630.lancashire-fire-service-utilise-fire-prevention-drones/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "They intend to use intelligent firefighting drones to suppress fires as part of an effort to develop cost-effective early mitigation strategies for wildfires.\nTo tackle the fires, they will utilise several robots to work together as a swarm to identify and suppress any risks.\nIn 2018, East Lancashire fire and rescue crews sent 60 firefighters to a blaze on Winter Hill which was roughly a kilometre in size.\nAdditionally, teams spent 41 days battling 18 square kilometres of wildfire on Winter Hill moorland near Bolton.\nThrough using thermal and optical imaging the drones can automatically detect and investigate fires and relay the information to the fire team."}, {"id": "9063e4b9-bfaa-4948-9b02-e97c2145c803", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast - Medicine Hat NewsMedicine Hat News", "date": "2024-08-21 11:45", "url": "https://medicinehatnews.com/news/national-news/2024/08/21/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coastBy Bob Weber, The Canadian Press on August 21, 2024.\n“It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,” says the study, published Tuesday in the journal Nature Communications.\n“In 2023, we had the most extreme fire weather conditions on record over much of the country,” said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n“By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,” said Jain."}, {"id": "ff5a5ca5-48cf-4538-84c7-a73332a0c5e9", "title": "Yellow wind and rain warning issued for two counties", "date": "2024-08-21 11:15", "url": "https://www.breakingnews.ie/ireland/yellow-wind-and-rain-warning-issued-for-two-counties-1663526.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "A yellow wind and rain warning has been issued for Mayo and Galway for Wednesday night.\nThe warning comes into effect from 6:30pm on Wednesday night to 2:30am on Thursday morning.\nA high tide advisory warning has been issued for all coasts from 12pm on Wednesday until 12pm on Friday.\nWednesday will see strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides.\nA band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening."}, {"id": "3a2c6ea8-b982-4a35-aa3d-f28642d6642c", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:00", "url": "https://www.yahoo.com/news/tropical-depression-dumps-heavy-rain-012746455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An entrance to the Cheonggye stream is closed in preparation for an approaching Tropical Storm Jongdari in Seoul, South Korea, Wednesday, Aug. 21, 2024.\n(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken."}, {"id": "789c678d-6914-4f6b-b0a9-f06547252b93", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://abcnews.go.com/International/wireStory/tropical-depression-dumps-heavy-rain-southern-south-korea-113003758", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A tropical depression is dumping heavy rain in southern South Korea and the populous Seoul region after weakening from a tropical stormSEOUL, South Korea -- A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nGovernment officials had urged public vigilance and monitoring of areas like underground passageways and basement dwellings that are at high risk of flooding."}, {"id": "1d6fb995-84d5-493e-ab1f-06bdbd31bbd9", "title": "Scattered afternoon thunderstorms on Wednesday", "date": "2024-08-21 13:45", "url": "https://cbs12.com/news/local/weather-forecast-august-21-2024-west-palm-beach-south-florida-treasure-coast-scattered-afternoon-thunderstorms-on-wednesday", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "Southwest wind flow will persist through the middle of the week, elevating storm chances each afternoon.\nA heat advisory is in effect for Palm Beach County today as feels like temperatures will reach as high as 110 degrees this afternoon.\nShowers and thunderstorms will move towards the east coast this afternoon and early evening.\nOur elevated storm chance will continue through the rest of the week with highs in the upper 80s and lower 90s each day.\nThis paired with an onshore wind flow will mean a higher shower chance during the morning hours at the coast with a few stronger storms moving inland through the afternoon."}, {"id": "69ce2130-77cd-48f4-b63d-e7ce4eea196e", "title": "Ireland weather : Difficult travel conditions and coastal flooding as Met Éireann issues Status Yellow wind warning for two counties", "date": "2024-08-21 07:45", "url": "https://www.independent.ie/weather/difficult-travel-conditions-and-coastal-flooding-as-met-eireann-issues-status-yellow-wind-warning-for-two-counties/a73249536.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "It will be breezy and cloudy today with outbreaks of rain and drizzle, with a Status Yellow wind warning in place for two counties in the west.\nA Status Yellow wind warning has been issued from 7pm this evening until 2am tomorrow morning for Galway and Mayo.\nHighest temperatures during the day of 14 to 18 degrees, dropping to 8 degrees during what will be a clear night.\nHighest temperatures of 14 to 18 degrees during the day, dropping to what will be the coldest night for a while, at 7 degrees.\nHowever it's likely to become cloudier elsewhere with some showery rain as temperatures jump back up to 18 degrees."}, {"id": "14d7a3e3-9b89-467c-85ad-201b873f62c7", "title": "Chances For Rain Keeps Temps Down Wednesday", "date": "2024-08-21 05:30", "url": "http://www.news9.com/story/64de0dd5b95e10088537cebe/chances-for-rain-keeps-temps-down-wednesday", "domain": "news9.com", "domain_classification": "Unknown", "message": "By: News 9-A few showers and storms are possible in several parts of the state on Wednesday morning, and though the rain will cool us down a bit, it will still feel very hot.\nTracking a few showers and storms this morning and some pockets of heavy rain drifting southeast.\nThursday morning a few showers will once again be possible across northern and central Oklahoma but overall chances will stay low.\nDrink plenty of water or electrolyte replacement drinks several hours before and during long exposure to the summer heat.\nWear light-colored, loose fitting clothing and a wide-brimmed hat if working outdoors, and take plenty of shade breaks."}, {"id": "2a7f022a-4c6e-4da8-899a-39e2434c39b8", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://www.independent.co.uk/news/seoul-ap-south-korea-jeju-b2599284.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Sign up to the Independent Climate email for the latest advice on saving the planet Get our free Climate email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent.\nRead our privacy policy Thanks for signing up to theIndependent Climate email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region on Wednesday after weakening from a tropical storm.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday and South Korea’s weather agency said the system was expected to dissipate soon.\nThe Korean Peninsula, which includes South Korea, is often impacted by typhoons, especially between July and September when the heat is at its peak."}, {"id": "3685fc97-4560-4829-9243-5480633c7e38", "title": "Richmond Hill holds first city council meeting since Tropical Storm Debby", "date": "2024-08-21 11:45", "url": "https://www.yahoo.com/news/richmond-hill-holds-first-city-093526123.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "RICHMOND HILL, Ga (WSAV) — Richmond Hill held their first city council meeting since Tropical Storm Debby brought heavy rains and flooding, many packed city halls to voice their concerns on Tuesday.\nThe floodwaters have receded in Richmond Hill and now the true scope of the devastation is clear.\nMany were concerned about how the city will handle the next tropical storm.\n“We continue to access and revise drainage in all neighborhoods,” Mayor Carpenter said.\nour flood planning response will be addressed in the coming months,” Mayor Carpenter said."}, {"id": "92472718-7e71-4355-9510-f6eb9dab93d5", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 11:15", "url": "https://www.thereminder.ca/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "4610e159-492e-49c3-b9e0-368a0eb9aa65", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 11:15", "url": "https://www.kelownadailycourier.ca/news/world_news/article_d2e91d5a-d28f-58e9-8065-3799513aaa95.html", "domain": "kelownadailycourier.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "43312938-7623-4f23-a3e4-b20d6a9aaf93", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 12:00", "url": "https://www.newwestrecord.ca/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "cd1da6ee-f17b-4f85-97ca-588b662847a3", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 10:45", "url": "https://www.prpeak.com/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "b226c374-d930-4cc6-973d-56f7067d00ab", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area – Winnipeg Free Press", "date": "2024-08-21 02:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/tropical-depression-dumps-heavy-rain-in-southern-south-korea-and-seoul-area", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nFishing boats are anchored at a port as Typhoon Jongdari approaches Jeju Island, South Korea, Tuesday, Aug. 20, 2024.\nAbout 20 vehicles were damaged by floods in the southern town of Ulju, the nearby city of Ulsan and the central city of Seosan, according to South Korea’s Ministry of the Interior and Safety."}, {"id": "8ff17974-08ee-4111-803b-34ff924a8091", "title": "HECO prepares for potential stormy weather", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/heco-prepares-potential-stormy-weather-014551335.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HONOLULU (KHON2) — Hawai’i may face severe weather this weekend, prompting Hawaiian Electric (HECO) to brace for potential impacts on its services.\nDownload the free KHON2 app for iOS or Android to stay informed on the latest newsHECO warns that strong winds and flooding could damage power lines and cause outages.\nHECO advises customers to review their emergency plans, stock up on necessary supplies, and monitor storm’s progress closely.\nIf you plan to use a ladder while preparing your home for the storm, note the location of power lines before you begin.\nFor the latest news, weather, sports, and streaming video, head to KHON2."}, {"id": "11f83b7e-ff9c-49f6-9dc8-e38ce326dc5f", "title": "12 Home Insurance Exclusions You Need to Know About", "date": "2024-08-21 00:30", "url": "https://www.insidermonkey.com/blog/12-home-insurance-exclusions-you-need-to-know-about-1337467/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We will also cover the 12 major home insurance exclusions you need to know about.\nSupported by the primary house insurance market in the United States, North America is expected to hold the largest chunk of the global home insurance market over this period.\nWhile the state’s insurance market remains troubled, the firm is seeking home insurance rate rises.\nSimilar to State Farm, Farmers Insurance decided to limit new homeowners insurance policies in California.\nNow that we have looked at the global home insurance industry, let’s take a look at the home insurance exclusions you need to know about."}, {"id": "6d707201-6075-47b8-8116-1be2ec4e595f", "title": "Long Island storm damage : Mill Pond , Blydenburgh Park and more", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/suffolk/long-island-storm-damage-bxsnqwvs", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Harbor Road, Stony BrookHeavy rainfall took out a dam under Harbor Road in Stony Brook and emptied Mill Pond.\nStony Brook Grist Mill, Stony BrookThe Stony Brook Grist Mill, which is located on Harbor Road near Mill Pond, sustained flooding from the storm.\nStony Brook University, Stony BrookStony Brook University dealt with flooding at the Mendelsohn Center Monday.\nCredit: Newsday/James CarboneStony Brook University evacuated scores of students from dorms and postponed the move-in day for others Monday morning following the storm.\nUniversity officials also were offering students up to $5,000 if they canceled their housing assignment for the academic year."}, {"id": "0f066e36-bf4c-4d1f-ae13-19b8a2824764", "title": "Ground News - Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 13:45", "url": "https://ground.news/article/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast", "domain": "ground.news", "domain_classification": "Unknown", "message": "Toronto Sun Right Mixed Factuality Individual: Leon Cooperman Corporation: AllianzLargest study of 2023 wildfires finds extreme weather fuelled flames coast to coastThe largest study of Canada's catastrophic 2023 wildfire season concludes it is \"inescapable\" that the record burn was caused by extreme heat and parching drought, while adding the amount of young forests consumed could make recovery harder."}, {"id": "e3b6bf9f-f2e4-46b3-9304-eca6ef75f948", "title": "Is Houston still the  Energy Capital of the World ? Doesnt seem like it", "date": "2024-08-21 00:30", "url": "https://www.click2houston.com/news/local/2024/08/20/is-houston-still-the-energy-capital-of-the-world-doesnt-seem-like-it/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "How is it that a city known as the “Energy Capital of the World” struggles to keep the lights on?\nTexas launches new investigation into Houston’s power utility following deadly outages after BerylWith all of these issues in mind, one might wonder: what exactly makes Houston the “Energy Capital of the World”?\nAbundance of Energy Companies: Houston is home to more than 600 exploration and production firms, as well as 1,100 oilfield service companies.\nConcentration of Expertise: The city has a high density of energy professionals, including petroleum, automation, and electrical engineers.\nEnergy Diversity: While historically known for oil and gas, Houston has also become a leader in renewable energy, including wind and solar power."}, {"id": "e5c097cd-fbaa-42d6-af72-b7e5c733ed7b", "title": "Sunday massive rainfall may have been most in Connecticut history : NWS", "date": "2024-08-21 02:45", "url": "https://www.nbcnewyork.com/news/national-international/sundays-massive-rainfall-may-have-been-most-in-connecticut-history-nws/5722907/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The National Weather Service is looking at the possibility that Sunday's historic rain event set a record for the most rainfall ever in Connecticut over a 24-hour period.\nA State Climate Extremes Committee, including representatives from the National Weather Service in New York and National Weather Service climate experts will be reviewing two 24-hour rainfall measurements from Sunday.\nThe two totals were reported by private home weather stations in Oxford.\nOne measured 14.83\" of rain and the other measured 13.5\", according to the National Weather Service.\nThe NWS experts will examine the home weather stations at both locations to determine if they are in compliance with National Weather Service measurement guidelines and specifications."}, {"id": "5dc8c17b-3e0f-464c-a3fe-7877e6039dfb", "title": "7 Vermont counties receive FEMA major disaster declaration for early July storm", "date": "2024-08-21 00:15", "url": "https://vtdigger.org/2024/08/20/7-vermont-counties-receive-fema-major-disaster-declaration-for-early-july-storm/", "domain": "vtdigger.org", "domain_classification": "Unknown", "message": "Phil Scott’s request for a major disaster declaration from the Federal Emergency Management Agency for seven Vermont counties, according to a Tuesday press release from the governor’s office.\nThe disaster declaration does not apply to damage caused by storms on July 30, according to the press release.\nState officials have requested that Orange County be added to the declaration, according to the press release.\nOrange County was examined alongside the other seven counties when FEMA officials visited Vermont last month.\nThe Scott administration continues to work on a separate FEMA major disaster declaration request for damages related to the July 30 storm, the release said."}, {"id": "f1d9a0fe-95b1-49b0-a3fe-03e8d86f361d", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 00:15", "url": "https://mix931fm.com/on-august-20-this-texas-city-was-erased-by-a-massive-hurricane/", "domain": "mix931fm.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "1e3463b0-453b-43e6-8332-ed67f2daf224", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 03:30", "url": "https://q1077.com/ixp/151/p/hurricane-destroys-indianola-texas/", "domain": "q1077.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "73d24516-7bdf-49c2-adce-817ed3ddb489", "title": "Met Office issues urgent warning as wind and rain set to batter parts of united kingdom ", "date": "2024-08-21 11:45", "url": "https://www.coventrytelegraph.net/news/uk-world-news/met-office-issues-urgent-warning-29780811", "domain": "coventrytelegraph.net", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nThe Met Office has issued yellow warnings for large parts of Scotland, northern England and areas of Wales.\nThe warning for rain in Scotland begins today at 11am and extends until 8am on Thursday."}, {"id": "9d4b1b4a-d137-4d22-84ca-e2a732a1174f", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.clickondetroit.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "dfecdab2-ee3a-42ca-bb58-797b2e9ef309", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.local10.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "79dcc520-7307-4b60-9020-f53f7f5b452a", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:00", "url": "https://www.news4jax.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "4f0a6a60-4c6b-4208-8354-6488cdd528f1", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:00", "url": "https://www.clickorlando.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "cacd52ce-6b84-4466-adc9-1b53658d770c", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 02:30", "url": "https://www.theglobeandmail.com/canada/british-columbia/article-bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: British Columbia's wildfire service says southern parts of the province are benefitting from rain and cooler weather, a reprieve for the southeast in particular.\nThe BC Wildfire Service says two of those fires are classified as “being held,” meaning they’re expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey’re among about 110 out-of-control blazes representing 30 per cent of the province’s roughly 370 active wildfires.\nThe territory’s wildfire information website says the Snag Lake fire was “quiet” Monday after displaying “extreme” behaviour the day before."}, {"id": "24480681-06cd-40e7-ade9-1a95dea00905", "title": "Flooding closes two residence halls at Stony Brook University , forcing a housing reshuffle", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/education/flooding-closes-stony-brook-university-dorms-gsep0fyi", "domain": "newsday.com", "domain_classification": "Unknown", "message": "All students from two residence halls at Stony Brook University will be relocated after their dorms were badly damaged in a flash flood early Monday that took Suffolk County by surprise and caused millions of dollars in destruction across the region.\nAmmann and Gray residence halls \"will need extensive repairs and cannot be safely occupied,\" the university said on its website.\nBut the same residence halls flooded in September 2021 during the remnants of Hurricane Ida, displacing nearly 400 students.\nThe university also is offering a $5,000 incentive for any students who will cancel their housing for the 2024-25 academic year.\nStony Brook has 33 residence halls with nearly 9,000 undergraduates living on campus."}, {"id": "8740753d-3672-4f35-81e6-9085ba6484fe", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/as-south-korea-weather/cp817316219", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Tropical depression dumps heavy rain in southern South Korea and Seoul areaSeaweed is washed up on Gwangalli Beach in the aftermath of Tropical Storm Jongdari in Busan, South Korea, Wednesday, Aug, 21, 2024.\n(Gang Son-bae/Yonhap via AP)Original Publication Date August 20, 2024 - 6:31 PMSEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken."}, {"id": "3f9818e8-0172-4946-b963-d01adef1d701", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.independent.co.uk/news/puerto-rico-ap-san-juan-national-weather-service-rio-grande-b2599131.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "31cd42a4-328d-4cbf-8741-a0b12695f9b7", "title": "All hell broke loose : Sicily yacht sunk in brutal storm", "date": "2024-08-21 04:45", "url": "https://www.standardmedia.co.ke/europe/article/2001501353/all-hell-broke-loose-sicily-yacht-sunk-in-brutal-storm", "domain": "standardmedia.co.ke", "domain_classification": "Local - Africa", "message": "Divers off Porticello on the site where the British-flagged luxury yacht Bayesian sank with 22 people onboard on Aug 19, 2024.\n\"At around 4:00am, all hell broke loose,\" local fisherman Giovanni Lococco told AFP on Tuesday as he surveyed rescuers searching for six people missing.\nA photograph posted on social media by a local bar showed the yacht all lit up just hours before the storm.\nThe power of the storm knocked out the video feed on Angelo Formica's boat in Porticello, which he monitored from home.\nCharlotte Golunski, 35, a colleague of Lynch's, was on deck when the yacht sank and briefly, terrifyingly lost hold of her one-year-old daughter."}, {"id": "835198eb-d8bc-4a69-a7ef-0ece5a0f6289", "title": "India to spend $300 mln to build drains and expand water bodies in big cities", "date": "2024-08-21 08:00", "url": "https://economictimes.indiatimes.com/news/economy/policy/india-to-spend-300-mln-to-build-drains-and-expand-water-bodies-in-big-cities/articleshow/112675253.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"It could become one of the most significant approaches to flood mitigation in the cities,\" Vatsa said in an interview.\n\"While the importance of storm water drainage in reducing the runoff cannot be overlooked, they also need to be supplemented by some of the nature-based solutions such as increasing the capacity of rivers and lakes to carry rain water.\n\"He said of the 25 billion rupees ($298 million), Mumbai, Chennai and Kolkata would each receive 5 billion rupees, while Ahmedabad, Hyderabad, Bengaluru and Pune will get 2.5 billion rupees each.\n\"Whenever a city receives 100 mm of rainfall, there is bound to be inundation,\" Vatsa said.\n\"You need a certain level of investment continuously which is supported by a whole lot of governance measures so that the problem could be reduced.\""}, {"id": "da2ab9b1-19b5-4b79-9aed-2459c4e58b61", "title": "Dept Of Labour Closed To Walk - In Customers", "date": "2024-08-21 05:15", "url": "https://bernews.com/2024/08/dept-labour-closed-walk-customers/", "domain": "bernews.com", "domain_classification": "Unknown", "message": "The Department of Labour is currently closed to walk-in customers due to hurricane damage.\nA Government spokesperson said, “The Department of Labour would like to advise the public that its office is closed to walk-in customers due to hurricane damage.\nWhile email messages are being monitored, there is no in-person service available.\n“If your matter is urgent, please email sstephens@gov.bm and you will be directed to the appropriate person.\nWalk-in service is expected to resume on Monday, 26 August 2024."}, {"id": "15285612-53c5-49ea-8a93-8b08e25cbf37", "title": "Full Essex bank holiday weekend weather forecast as Hurricane Ernesto brings heavy rain", "date": "2024-08-21 12:00", "url": "https://www.essexlive.news/news/essex-news/full-essex-bank-holiday-weekend-9498009", "domain": "essexlive.news", "domain_classification": "Unknown", "message": "On Saturday morning from 1am to 4am there is an 80 per cent chance of extremely heavy rain.\nColchester weatherVery similar to the forecasts of Chelmsford and Southend with temperatures between 21 and 24C and heavy rain on Saturday morning.\nHeavy rain is once again expected on Saturday morning.\nBasildon weatherAround as warm as Thurrock with regular temperatures above 22C and heavy rain Saturday morning.\nCanvey Island weatherNo days set to be below 21C with slightly higher winds than the rest of the county."}, {"id": "758af2ed-62c4-4096-8ce3-8f90bbeb11ef", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/world/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "9818f67d-4197-4c65-868d-5b3aff54d0c8", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "5c2cef13-5b66-40af-b2ad-d4448bf5cfec", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 01:45", "url": "https://www.timescolonist.com/bc-news/bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of-control-9376725", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "f70c63e3-d53d-4431-85a9-876c96a0fbc7", "title": "India to spend $300 million to mitigate floods , conserve water in big cities", "date": "2024-08-21 08:00", "url": "https://www.marketscreener.com/news/latest/India-to-spend-300-million-to-mitigate-floods-conserve-water-in-big-cities-47701204/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "NEW DELHI (Reuters) - India will spend nearly $300 million in two years to expand water bodies like lakes and build drains in seven cities including Mumbai, Chennai and Bengaluru to mitigate floods and conserve water, a government official told Reuters on Wednesday.\nFlooding, often fatal, is common in Indian cities every monsoon as rapid urbanisation devours city lakes and waste clogs drains.\nSuch flooding has been preceded by severe water shortages in recent years, especially in Delhi and Bengaluru, where once-plenty water storage spaces have shrunk.\n\"It could become one of the most significant approaches to flood mitigation in the cities,\" Vatsa said in an interview.\nHe said of the 25 billion rupees ($298 million), Mumbai, Chennai and Kolkata would each receive 5 billion rupees, while Ahmedabad, Hyderabad, Bengaluru and Pune will get 2.5 billion rupees each."}, {"id": "876b5fc1-d91d-43e7-8130-48c8ac80552f", "title": "Tens of thousands remain without power after Puerto Rico tropical storm", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307400-tens-of-thousands-remain-without-power-after-puerto-rico-tropical-storm", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Tens of thousands of customers remained without power across Puerto Rico, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico's Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes.\nPuerto Rico's power grid remains fragile after Hurricane Maria razed it in September 2017 as a powerful Category 4 storm, though the grid already was crumbling before that, due to a lack of maintenance and investment."}, {"id": "c4818506-e641-4270-8ac7-8cd098b270f8", "title": "New research suggests exposure to wildfire smoke may affect outcome of surgeries :  Responsible for a significant perioperative morbidity burden  ", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/research-suggests-exposure-wildfire-smoke-033000560.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Exposure to wildfire smoke can impact anesthesia function and surgical outcomes, according to a new study.\nThe Hill reported on the research, which asserted that the fine particles and chemicals found in wildfire smoke lead to inflammation and decreased antioxidant levels.\nFurthermore, the study's authors warned the findings could be just the \"tip of the iceberg, with wildfire smoke exposure being responsible for a significant perioperative morbidity burden.\"\nWhat's being done about wildfire smoke?\nYou can shield yourself from wildfire smoke by investing in a HEPA air purifier for your home."}, {"id": "9a33010e-4106-41b5-bac7-dcc4481b4224", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 03:00", "url": "https://www.wbal.com/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm .\nThe northeast coastal town of Luquillo, popular with tourists, reported the highest number of outages, with 30% of clients without power.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico’s grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "efa2e735-f967-4a49-acc5-92cb08f296d9", "title": "British billionaire among missing people after storm in Italy sinks superyacht", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/british-billionaire-among-missing-people-005930240.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "| Italian Coast GuardBritish billionaire Mike Lynch is among the six missing passengers of the Bayesian, Lynch’s 184-foot superyacht, which sank off the coast of Sicily, Italy on Monday, according to multiple media reports.\nLynch has been known in UK media as the “British Bill Gates” for his influence in the technology world, as well as for his wealth.\nThe ship sank during a violent storm after a gust of wind that nearby ship captain Karsten Borner described as a “strong hurricane gust,” according to CNBC.\nHe added that he had been careful not to let his boat contact the yacht during the storm, but after the gust of wind concluded, the yacht was gone.\nLynch’s wife, Angela Bacares, is among the survivors, but Lynch’s 18-year-old daughter, Hannah, is among those missing."}, {"id": "4eacfaa4-3fc6-4af1-9754-7d7685168daf", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/wildfires-bc/cp1969590317", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "wildfires holding under 370 with 30 per cent classified as 'out of control'Smoke from the Calcite Creek wildfire is shown in this July 26 handout photo.\nThe BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "449f7539-66af-47ef-b771-de0868498304", "title": "Northern Ireland weather : Met Office forecasts strong winds and rain – but Hurricane Ernesto aftermath to pass by", "date": "2024-08-21 11:00", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/met-office-releases-more-details-as-hurricane-ernesto-aftermath-arriving-in-ni/a915622061.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "Areas of heavy rain moving north and east in Northern Ireland on Monday afternoon.\nWednesday will be cloudy with outbreaks of rain spreading east during the morning, and strong southwesterly winds will continue developing.\nThursday is expected to be a largely bright day with sunny intervals and scattered showered, although fresh to strong winds are likely to remain.\nThe Irish weather agency warned of “unseasonably strong” winds, very high tides and heavy rain as the remnants of Hurricane Ernesto pass over the island.\nThe remnants of the storm will lead to wet and windy weather on Wednesday through to Thursday as it passes over Ireland and the UK."}, {"id": "e6325529-e7a9-4c72-aae1-4a91ce7d9576", "title": "India to Invest $300 Million in Water Body Expansion and Flood Mitigation", "date": "2024-08-21 08:30", "url": "https://www.devdiscourse.com/article/law-order/3058719-india-to-invest-300-million-in-water-body-expansion-and-flood-mitigation", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "India is set to invest nearly $300 million over the next two years to expand water bodies and construct drains in seven cities, including Mumbai, Chennai, and Bengaluru, to mitigate floods and conserve water, according to a government official speaking to Reuters on Wednesday.\nRecent years have seen severe water shortages, particularly in cities like Delhi and Bengaluru, where water storage spaces have diminished.\nMoody's has warned that India's growing water stress could hamper its economic growth, projected at 7.2% for this fiscal year.\nOut of the allocated 25 billion rupees ($298 million), Mumbai, Chennai, and Kolkata will each receive 5 billion rupees, and Ahmedabad, Hyderabad, Bengaluru, and Pune will each get 2.5 billion rupees.\nMumbai recently experienced over 300 mm of rain in just six hours."}, {"id": "d9d4a934-22a8-48f0-a129-1d4cbf5f6cd4", "title": "BILLING MYSTERY", "date": "2024-08-21 08:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240821/billing-mystery", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "The Gleaner was also told that JPS reverted to the use of LNG at 9 p.m. on July 6.\n“The increase in the fuel rate from these two factors is further compounded on customers’ bills when GCT is applied.\nUNCLEAR OF BILLING TERMSStill, it remains unclear whether customers were billed accordingly, in terms of the days JPS relied on ADO and when it went back to using LNG.\nThe company is in the hot seat amid growing complaints over bills received for the July-August period.\nThe Ministry of Energy has set up dedicated email addresses to receive complaints from persons regarding their latest electricity bills, following widespread outcry over massive increases."}, {"id": "362a55d1-24c1-4c67-b44a-8b3dde2e1947", "title": "  Katrina Babie screening to mark anniversary ; storm prep and emergency backpack giveaway in Lake Charles", "date": "2024-08-21 00:30", "url": "https://www.wrkf.org/show/louisiana-considered/2024-08-20/katrina-babies-screening-to-mark-anniversary-storm-prep-and-emergency-backpack-giveaway-in-lake-charles", "domain": "wrkf.org", "domain_classification": "Unknown", "message": "To mark the upcoming 19th anniversary of Hurricane Katrina’s, the New Orleans Museum of Art will screen the documentary, Katrina Babies on Aug. 21.\nOn Aug. 24, the Equality Health Foundation will host a weather ready drive-thru emergency backpack giveaway at Zion Tabernacle Church in Lake Charles.\n___Today’s episode of Louisiana Considered was hosted by Diane Mack.\nLouisiana Considered wants to hear from you!\nLouisiana Considered is made possible with support from our listeners."}, {"id": "b90f90ca-4fb6-4042-8ba2-3e7459b2f6c5", "title": "President Biden approves Vermont major disaster declaration request", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/president-biden-approves-vermont-major-220549152.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Montpelier VT. – President Joe Biden approved Governor Phil Scott’s request for a FEMA major disaster declaration, which will assist Vermonters recovering from flooding in July.\nThis FEMA declaration provides funding to individuals in Addison, Orleans, Washington, Caledonia, Chittenden, Lamoille, and Essex counties.\nThe Individual Assistance program can cover eligible expenses like rental assistance, home repair, home replacement, lodging, and more.\nIndividuals and municipalities that suffered damage in all recent storms should continue to clean up and document damage.\nThe State will continue to provide updates, including the availability of Disaster Recovery Centers for more support."}, {"id": "e783f712-840b-472a-a809-455261834cc9", "title": "Met Office issues weather warning as last of Hurricane Ernesto hits united kingdom ", "date": "2024-08-21 10:00", "url": "https://www.walesonline.co.uk/news/wales-news/met-office-issues-weather-warning-29780359", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning for wind across parts of Wales.\nAccording to the forecaster, strong winds leading to some travel disruption will occur during the early hours of Thursday morning, August 22.\nThe weather warning applies to central, Tayside and Fife areas of Scotland, as well as Strathclyde, the south-west and the Lothian borders of the country.\nIt comes after another yellow weather warning was issued for parts of Scotland for Wednesday, August 21.\nParts of the country could see a period of heavy rain and strong winds, which could lead to impacts from flooding."}, {"id": "98b82fb5-f3e9-427b-8621-5f1f308e7806", "title": "Natural disasters and insurance : Some homes becoming uninsurable , but all may not be lost - Christopher Whitehead", "date": "2024-08-21 03:30", "url": "https://www.nzherald.co.nz/nz/natural-disasters-and-insurance-some-homes-becoming-uninsurable-but-all-may-not-be-lost-christopher-whitehead/3R7IDJZ3KJDCJAUAQC5AU3SGTQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Cautious insurersThere’s no general requirement in New Zealand that insurers cover anyone’s home, or that anyone’s home actually be insured.\nWhen homeowners do get insurance, the risk of certain losses from natural disasters is automatically covered by the Natural Hazards Commission (previously known as the Earthquake Commission).\nThe insurer may even offer “parametric” insurance, which pays out less than traditional insurance, but faster.\nWhile parametric insurance is relatively new worldwide, it’s an efficient solution for managing the risk of natural disaster damage.\nNatural disaster wouldn’t have to mean financial disaster as much as it does today."}, {"id": "b4e4f2e1-40b5-4535-b0d8-3d5cd112b1be", "title": "Remnants of Hurricane Ernesto to hit Donegal tonight", "date": "2024-08-21 07:30", "url": "https://donegalnews.com/remnants-of-hurricane-ernesto-to-hit-donegal-tonight/", "domain": "donegalnews.com", "domain_classification": "Unknown", "message": "THE remnants of Hurricane Ernesto are set to hit Donegal tonight.\nHurricane Ernesto is forecasted to track eastwards and combine with low pressure over Iceland today, passing between Ireland and Iceland tonight.\nAs this low pressure system tracks past the north-west, it will bring a spell of rather windy and wet weather across the country.\nThe low pressure system will coincide with very high spring tides tonight and Thursday.\nThe combination of these very high tides with strong winds will result in high waves and forecasted surge may lead to coastal flooding and wave overtopping."}, {"id": "bbddcb97-d320-4e06-b080-36cc459fdfcf", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 01:30", "url": "https://www.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "20e24448-4c3f-4054-b5a1-707b85b21b4c", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 03:00", "url": "https://us.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "4f1481a2-4075-4887-8839-4ae97395f74c", "title": "Fukuoka Observatory Urges Review of Nankai Trough Earthquake Info", "date": "2024-08-21 04:45", "url": "https://www.fukuoka-now.com/en/news/fukuoka-observatory-urges-review-of-nankai-trough-earthquake-info/", "domain": "fukuoka-now.com", "domain_classification": "Unknown", "message": "The Fukuoka Meteorological Observatory highlighted the need for a review of the government’s approach to disseminating information related to the Nankai Trough Earthquake.\nThis comes after the release of temporary earthquake information following the magnitude 7.1 earthquake in the Hyuga-nada region on August 8.\nDuring a regular press conference on August 20, the observatory emphasized the importance of ongoing preparedness for large-scale earthquakes, as the Nankai Trough region remains highly susceptible.\nShuichiro Fukumitsu, head of the Earthquake and Volcano Division, noted that public awareness of the temporary earthquake information issued for the first time was insufficient, indicating a need for more widespread educational efforts.\nHe also called for a comprehensive review of the government’s information dissemination strategies, incorporating feedback from local governments and other stakeholders."}, {"id": "1c2722bc-e8f8-4413-91d4-3cb064d728b3", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 10:00", "url": "https://www.thompsoncitizen.net/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377467", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "f1b0d985-0a67-48c1-8432-d24175363727", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.fitzhugh.ca/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377459", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "f69d5c8f-3154-4bbc-9c72-3002fa47c0f7", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.stalbertgazette.com/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377459", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "b54173bc-62f2-4083-912f-38e3dada3d20", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.pentictonherald.ca/news/national_news/article_e45d577e-e3f8-5ece-81eb-7e55d3df8542.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "Trees burned by the Bush Creek East Wildfire are seen above Little Shuswap Lake in Squilax, B.C., Monday, Sept. 11, 2023.\nThe largest study of Canada's catastrophic 2023 wildfire season concludes it is \"inescapable\" that the record burn was caused by extreme heat and parching drought, while adding the amount of young forests consumed could make recovery harder.\nTHE CANADIAN PRESS/Darryl Dyck"}, {"id": "3b1fcbc5-4b8b-4b34-aa76-66666a8e4ee6", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 11:30", "url": "https://www.tricitynews.com/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377467", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "693b5fb2-2f0b-48e1-8b1b-9712664aa2e6", "title": "In the news today : Canada , defence and the DNC , more aid for heading to Ukraine | iNFOnews", "date": "2024-08-21 11:00", "url": "https://infotel.ca/newsitem/in-the-news/cp1498422732", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "In the news today: Canada, defence and the DNC, more aid heading to UkraineFormer President Barack Obama speaks during the Democratic National Convention Tuesday, Aug. 20, 2024, in Chicago.\nWhat will be essential for any president, Hillman added, is to continue defence partnerships and expand opportunities for production co-operation with Canada.\nCanada pledges $5.7M in aid for Ukrainian childrenInternational Development Minister Ahmed Hussen says Canada will provide $5.7 million for Ukrainians to meet their basic needs.\nThe survey of more than 10,000 students in grades 7 to 12 highlights a \"worrying\" decline in youth mental health, the Centre for Addiction and Mental Health in Toronto said Wednesday.\n\"The picture is that students are struggling,\" Hayley Hamilton, the survey lead and co-director of CAMH’s institute for mental health policy research, said in an interview."}, {"id": "00890139-ad73-4c10-b4d4-fd99ebdae208", "title": "Storms are back and will stick around a while", "date": "2024-08-21 06:00", "url": "https://www.mysuncoast.com/2024/08/21/storms-are-back-will-stick-around-while/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "Then high pressure will build back in and swing the winds around to the SE in the morning which will then allow a more normal pattern of afternoon storms developing along the sea breeze inland and pushing back toward the coast during the late afternoon and evening.\nStorms dumped over 4 inches of rainfall over parts of the Suncoast on Tuesday (WWSB)For Wednesday expect to see a few late morning and early afternoon storms once again due to the SW winds out ahead of the frontal boundary.\nThere will also be quite a bit of dangerous lightning around with some of these storms.\nSome of these storms can produce lightning some 10 miles away from where the storm is.\nGoing to go with a blend right now with a good chance for scattered storms for both Saturday and Sunday."}, {"id": "2188f8d6-f833-4392-a145-c476c2b1c88f", "title": "Local skatepark advocacy group , family help clean up skatepark after flooding", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/local-skatepark-advocacy-group-family-024407446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SALT LAKE CITY (ABC4) — Flooding from last week’s severe weather across the Salt Lake and Utah Valleys left tons of debris to clean up.\nThe city of Orem and its skate park was no exception, but the city says that the weather was no match for the passionate people in the local skate community.\nPREVIOUSLY: Wicked weather along the Wasatch Front following monsoon thunderstormsThe effort was led by a local skatepark advocacy group, Go Skate Utah.\nThe group got the skate park all cleaned up and ready for action again.\nThe family mentioned they frequent the Orem Skate Park and wanted to help make the clean-up a special experience for all involved in the effort."}, {"id": "a5f93525-36aa-45ee-8a42-9f1948bc1fa4", "title": "Malawi receives an insurance payout of $11 . 2 million for El Nino - linked drought disaster - New Delhi Times - India Only International Newspaper", "date": "2024-08-21 04:45", "url": "https://www.newdelhitimes.com/malawi-receives-an-insurance-payout-of-11-2-million-for-el-nino-linked-drought-disaster/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "The Malawian government has received an insurance payout of $11.2 million for a crippling El Nino-linked drought that led the southern African nation to declare a state of disaster earlier this year.\nThe payout was given to Malawi this month, the African Development Bank said Monday.\nMalawi had a drought insurance policy through the bank and the African Risk Capacity Group, an agency of the African Union.\nThe funds will support food assistance to around 235,000 households in some of Malawi’s hardest-hit regions and also help with direct relief payments to more than 100,000 households, the African Development Bank said.\nZambia and Zimbabwe also declared states of disaster and have asked for international help, and Mozambique, Zambia and Zimbabwe were expected to receive drought insurance payouts by September, the African Development Bank said."}, {"id": "a4b5b938-578d-4b81-89f7-f4af1fc95b53", "title": "  Black swan  phenomenon may have sunk Bayesian yacht , experts say", "date": "2024-08-21 12:15", "url": "https://nypost.com/2024/08/21/world-news/black-swan-phenomenon-may-have-sunk-bayesian-yacht-experts-say/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A rare and unexpected “black swan” weather event may have led to the Bayesian superyacht’s speedy demise, maritime experts claim.\n7 A rare “black swan” weather event may have led to the Bayesian yacht’s speedy demise.\nFOTOGRAMMA/Shutterstock7 The yacht may have sunk so quickly due to the extreme weather event.\nAFP via Getty ImagesOther experts questioned why the crew wasn’t paying closer attention to various weather warnings ahead of the tragedy.\nEven if they had been paying closer attention, it was unlikely the crew could have been prepared for such a “high impact, low probability” weather event, Schanck added."}, {"id": "152e5aa4-42a0-4924-9078-3b73072d1204", "title": "Scots brace for 60mph wind and 24 hours of rain as Met Office updates weather warning", "date": "2024-08-21 09:15", "url": "https://www.dailyrecord.co.uk/lifestyle/scots-brace-60mph-wind-24-33506939", "domain": "dailyrecord.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the latest top news stories sent straight to your inbox with our daily newsletterSomething went wrong, please try again later.\nJoin the Daily Record's WhatsApp community here and get the latest news sent straight to your messages.\nBe prepared for weather warnings to change quickly: when a weather warning is issued, the Met Office recommends staying up to date with the weather forecast in your area."}, {"id": "2a7260e0-508e-4580-91ff-2dce5a518b31", "title": "Flooding Possible in Cork Up To Friday", "date": "2024-08-21 10:00", "url": "https://www.redfm.ie/cork/flooding-possible-in-cork-up-to-friday-1757013", "domain": "redfm.ie", "domain_classification": "Unknown", "message": "Winds of up to 120 kilometres per hour are set to hit parts of country, as the remnants of Hurricane Ernesto track towards Ireland.\nA status yellow wind warning has been issued for Mayo and Galway.\nWe do take a little dip as we go into Thursday night and Friday Morning.\nThere's a low pressure system that we are looking at very carefully at the moment because it could be stronger than tonight's system.\nWe could well see wind speeds with that system getting up to 110 or 120 kilometres an hour.\""}, {"id": "0be3d7a7-2975-45c9-b73e-b3483171e253", "title": "Naugatuck businesses begin cleanup process in wake of historic storm", "date": "2024-08-21 01:00", "url": "https://www.nbcconnecticut.com/news/local/naugatuck-businesses-cleanup-historic-storm/3367386/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "“I had to stand out in the middle of the road and just watch this all get flooded,” Water Street Pub and Barber Shop owner Anthony Mongillo said.\n“The next morning I came in and I was just speechless.”Mongillo, of Naugatuck, had recently celebrated one year since opening Water Street Pub and Water Street Barber Shop right next door.\nHe said momentum was building for both businesses, only to have a storm tear everything apart this past weekend.\nI put my blood, sweat and tears into both these places the past year, nonstop work,” Mongillo said.\nNumerous businesses in Naugatuck and the surrounding area continue to recoil after the damages brought on from Sunday's storm."}, {"id": "54eb14c5-1261-461f-9103-f8fe75b087bb", "title": "Bayesian yacht : Video shows storm battering boat before sinking in Sicily", "date": "2024-08-21 11:15", "url": "https://edition.cnn.com/2024/08/21/europe/bayesian-yacht-sicily-sinking-cctv-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Porticello, Italy CNN —Italian authorities have moved a body bag from a rescue boat to an ambulance at a Sicilian port, as rescue divers battle tough conditions in the ongoing search for the “Bayesian” superyacht’s remaining missing passengers.\nThe British-flagged vessel sank early Monday – killing at least one of 22 people on board – after its mast, one of the world’s tallest, broke in half during a violent storm.\nSecurity camera footage has shown the moments before a tornado sank the 56-meter-long (184-foot) yacht.\nShe said she and her husband were initially not concerned, but became worried when the windows of the yacht shattered.\nThree days on from the wreck, investigators are still at a loss as to how the ship sank so quickly."}, {"id": "edc9ca5f-8abb-4584-b9a7-ea470fc87af6", "title": "Bayesian yacht : Video shows storm battering boat before sinking in Sicily", "date": "2024-08-21 12:15", "url": "https://www.cnn.com/2024/08/21/europe/bayesian-yacht-sicily-sinking-cctv-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "Porticello, Italy CNN —Italian authorities have moved a body bag from a rescue boat to an ambulance at a Sicilian port, as rescue divers battle tough conditions in the ongoing search for the “Bayesian” superyacht’s remaining missing passengers.\nThe British-flagged vessel sank early Monday – killing at least one of 22 people on board – after its mast, one of the world’s tallest, broke in half during a violent storm.\nSecurity camera footage has shown the moments before a tornado sank the 56-meter-long (184-foot) yacht.\nShe said she and her husband were initially not concerned, but became worried when the windows of the yacht shattered.\nThree days on from the wreck, investigators are still at a loss as to how the ship sank so quickly."}, {"id": "9551840d-3f09-4842-98c0-58efc4fbe360", "title": "Kaktovik and Wales precincts fail to open for Alaska primary , Division of Elections says", "date": "2024-08-21 04:00", "url": "https://www.adn.com/politics/2024/08/20/kaktovik-and-wales-precincts-fail-to-open-for-alaska-primary-division-of-elections-says/", "domain": "adn.com", "domain_classification": "Unknown", "message": "The Alaska Division of Elections said that two precincts in rural Alaska failed to open for in-person voting on primary election day.\nCarol Beecher, director of the Division of Elections, said polling places in Wales and Kaktovik were unable to open on Tuesday.\nForty-three Kaktovik residents voted in the 2022 Alaska primary, along with 280 residents of Anaktuvuk Pass and 10 people from Wales.\nADVERTISEMENTAccording to Beecher, 399 of 402 Alaska precincts were open and operating by Tuesday afternoon for the primary election.\nIn 2022, precincts in Tununak and Atmautluak did not open on election day for that year’s primary and special congressional election."}, {"id": "321938db-4996-49eb-96da-44f1e30c2fbb", "title": "The deadly cost of America housing crisis", "date": "2024-08-21 11:15", "url": "https://www.yahoo.com/news/deadly-cost-americas-housing-crisis-093301905.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In some parts of the country, the only affordable homes for middle-class households are in areas prone to disasters.\nBecause of our collective refusal to build more housing where it is most needed, millions of people live with elevated climate risk.\nWhere I live, across the bay from San Francisco, thermometers climbed into the mid-80s — not exactly pleasant for perspiration-prone Ashkenazi men such as myself, but tolerable.\nCompare homebuilding in Houston (average daily July high of 95 degrees) with homebuilding in San Francisco.\nTo be sure, income and climate risk are not perfectly correlated; several wealthy enclaves are at risk of coastal erosion."}, {"id": "7bc1eacb-e8f7-4935-8d57-559434d25dab", "title": "The Search for an Affordable Home Is Putting Americans in Danger", "date": "2024-08-21 11:15", "url": "https://www.businessinsider.com/affordable-home-house-prices-americans-danger-death-climate-change-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Because of our collective refusal to build more housing where it is most needed, millions of people live with elevated climate risk.\nWhere I live, across the bay from San Francisco, thermometers climbed into the mid-80s — not exactly pleasant for perspiration-prone Ashkenazi men such as myself, but tolerable.\nCompare homebuilding in Houston (average daily July high of 95 degrees) with homebuilding in San Francisco.\nHouston's ability to build more housing than San Francisco comes down to the rules the two cities impose on the construction of new housing.\nTo be sure, income and climate risk are not perfectly correlated; several wealthy enclaves are at risk of coastal erosion."}, {"id": "a218ce6b-5fc8-4f4f-b3cc-09dce79c27bd", "title": "Climate crisis , drought drive young people out of Gokwe - Newsday Zimbabwe", "date": "2024-08-21 07:00", "url": "https://www.newsday.co.zw/local-news/article/200031201/climate-crisis-drought-drive-young-people-out-of-gokwe", "domain": "newsday.co.zw", "domain_classification": "Unknown", "message": "“I hope to go to South Africa after completing school and find a job,” he said.\n“Gokwe was famed for farming, but lately we have been affected greatly by climate change,” she said.\n“Most of our children are migrating to the cities, but the majority has gone to South Africa,” she said.\n“If we could have climate adaptation projects, we wouldn’t see these young people leave the village.”Natural resource governance and climate change expert Tapuwa O’bren Nhachi said climate change, especially drought, was closely associated with economic loss.\nNhachi said addressing migration related to climate change involved developing innovative solutions that targeted the root causes of migration."}, {"id": "52cffad4-60eb-4b71-8a0e-69ad026e6579", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 03:15", "url": "https://www.fox10phoenix.com/weather/connecticut-home-house-collapses", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "5e690490-8d63-4593-b3a8-4ef40374216a", "title": "Climate crisis , drought drive young people out of Gokwe", "date": "2024-08-21 07:00", "url": "https://www.thestandard.co.zw/local-news/article/200031201/climate-crisis-drought-drive-young-people-out-of-gokwe", "domain": "thestandard.co.zw", "domain_classification": "Unknown", "message": "“I hope to go to South Africa after completing school and find a job,” he said.\n“Gokwe was famed for farming, but lately we have been affected greatly by climate change,” she said.\n“Most of our children are migrating to the cities, but the majority has gone to South Africa,” she said.\n“If we could have climate adaptation projects, we wouldn’t see these young people leave the village.”Natural resource governance and climate change expert Tapuwa O’bren Nhachi said climate change, especially drought, was closely associated with economic loss.\nNhachi said addressing migration related to climate change involved developing innovative solutions that targeted the root causes of migration."}, {"id": "dd841413-ef26-4bed-bdc4-788b691ae708", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 01:45", "url": "https://www.fox29.com/weather/connecticut-home-house-collapses", "domain": "fox29.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "ebeb1329-d07e-48a9-8c24-7cf8fc6ce2ce", "title": "Modular Homes For Fire Survivors | News Radio 1190 KEX", "date": "2024-08-21 01:45", "url": "https://1190kex.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "ff90181e-751d-4f71-94dc-aeb68ef3adea", "title": "Modular Homes For Fire Survivors | K103 Portland", "date": "2024-08-21 02:30", "url": "https://k103.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "k103.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "b1b09c2a-afe4-47cf-bc5a-b835b90b5ad7", "title": "Modular Homes For Fire Survivors", "date": "2024-08-21 03:30", "url": "https://jamn1075.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "jamn1075.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "b5419609-eaeb-4e31-9f1c-ed50fc6e4a5e", "title": "Modular Homes For Fire Survivors | Z100 Portland", "date": "2024-08-21 02:45", "url": "https://z100portland.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "z100portland.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "eec9bfb2-ed79-4525-9813-ef1f0bfeb60a", "title": "Modular Homes For Fire Survivors | 106 . 7 The Eagle", "date": "2024-08-21 03:00", "url": "https://1067theeagle.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1067theeagle.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "34431636-14e3-4784-b989-4e943f1bb237", "title": "Modular Homes For Fire Survivors | 105 . 9 The Brew", "date": "2024-08-21 03:30", "url": "https://1059thebrew.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1059thebrew.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "98dc8b4b-094f-4c35-8873-71bf2c4816dd", "title": "Weymouth greenfield site homes plan is turned down", "date": "2024-08-21 07:00", "url": "https://www.dorsetecho.co.uk/news/24531427.weymouth-greenfield-site-homes-plan-turned/", "domain": "dorsetecho.co.uk", "domain_classification": "Unknown", "message": "The controversial development, had it been allowed, would have included a new bridge over the Pudsey Brook and a new site road.\nDozens of objections had been sent to Dorset Council about the proposals including one from Weymouth Town Council which objected on the grounds the site being outside the defined development boundary, traffic concerns, local flooding issues and sustainable drainage systems.\nThe town council said there was also confusion about a footpath route and concerns about over-burdening the storm and sewage drains.\nThe greenfield site is west of the lane with the proposal for three 3-bed homes and four 4-bed homes, all with attached garages.\nA previous application for the site was submitted in 2015 but later withdrawn to await flood data remodelling from the Environment Agency."}, {"id": "414763b1-a1ed-416d-8321-eff3552a01b6", "title": "Naxos Potato Crisis : Drought and Poor Infrastructure Hit Production", "date": "2024-08-21 11:45", "url": "https://www.in.gr/2024/08/21/english-edition/naxos-potato-crisis-drought-poor-infrastructure-hit-production/", "domain": "in.gr", "domain_classification": "Unknown", "message": "Προς εξαφάνισηΓιατί «πεθαίνουν» οι παραλίες της ΙσπανίαςΤόσο στην Ισπανία όσο και σε άλλα μέρη του κόσμου οι παραλίες εξαφανίζονται.\nΜπορεί να υπάρξει μία συμβατική λύση; Ή μήπως ήρθε η ώρα για ορισμένα αντιδημοφιλή μέτρα;"}, {"id": "ab67c304-d2f2-4326-a8f2-2c2b786ad13d", "title": "Tricky time for farmers - survey", "date": "2024-08-21 01:00", "url": "https://www.odt.co.nz/rural-life/red-meat/tricky-time-farmers-survey", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "Beef + Lamb New Zealand has released its annual stock number survey which showed a notable decline in both sheep and cattle numbers as of June 30.\nSheep numbers were estimated to have decreased by 4.3%, down to 23.31 million, with breeding ewe numbers falling by 2.9% and trading sheep stock numbers down 7.9%.\nBeef cattle numbers dropped 6.6% in Otago and increased 5.1% in Southland.\nThe number of beef cattle might recover more quickly as prices have remained strong for beef and farmers have been switching from sheep to cattle.\nWhile sheep numbers had been declining slowly, afforestation had accelerated that sharply and also driven down cattle numbers."}, {"id": "af10e0f1-26cf-427d-aaed-0c0847455565", "title": "Yellow wind and rain warning issued for two counties - News", "date": "2024-08-21 11:45", "url": "https://www.kildare-nationalist.ie/news/yellow-wind-and-rain-warning-issued-for-two-counties_arid-29033.html", "domain": "kildare-nationalist.ie", "domain_classification": "Unknown", "message": "Michael BoltonA yellow wind and rain warning has been issued for Mayo and Galway for Wednesday night.\nThe warning comes into effect from 6:30pm on Wednesday night to 2:30am on Thursday morning.\nA high tide advisory warning has been issued for all coasts from 12pm on Wednesday until 12pm on Friday.\nWednesday will see strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides.\nA band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening."}, {"id": "a21cc0d2-babc-467d-bfc4-86a12f1f13b2", "title": "Yellow wind and rain warning issued for two counties - Homepage", "date": "2024-08-21 11:30", "url": "https://www.waterford-news.ie/yellow-wind-and-rain-warning-issued-for-two-counties_arid-29033.html", "domain": "waterford-news.ie", "domain_classification": "Unknown", "message": "Michael BoltonA yellow wind and rain warning has been issued for Mayo and Galway for Wednesday night.\nThe warning comes into effect from 6:30pm on Wednesday night to 2:30am on Thursday morning.\nA high tide advisory warning has been issued for all coasts from 12pm on Wednesday until 12pm on Friday.\nWednesday will see strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides.\nA band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening."}, {"id": "b4686490-6a3a-4c8e-8805-28b3c4dd0f92", "title": "Yellow wind and rain warning issued for two counties", "date": "2024-08-21 11:30", "url": "https://www.echolive.ie/nationalnews/arid-41460115.html", "domain": "echolive.ie", "domain_classification": "Unknown", "message": "Michael BoltonA yellow wind and rain warning has been issued for Mayo and Galway for Wednesday night.\nThe warning comes into effect from 6:30pm on Wednesday night to 2:30am on Thursday morning.\nA high tide advisory warning has been issued for all coasts from 12pm on Wednesday until 12pm on Friday.\nWednesday will see strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides.\nA band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening."}, {"id": "9ae9b478-d4b9-4570-bf3c-966b60d154eb", "title": "The Engineer - Severn Trent unveils 25m deep storm overflow tank", "date": "2024-08-21 12:15", "url": "https://www.theengineer.co.uk/content/news/severn-trent-unveils-25m-deep-storm-overflow-tank", "domain": "theengineer.co.uk", "domain_classification": "Unknown", "message": "Severn Trent has unveiled a 25m deep by 25m wide storm overflow storage tank designed to protect residents of Stroud from potential flooding and prevent spills into rivers.\nThe Stroud Sewer Strategy project has delivered a 7,400m3 capacity concrete-lined tank built with partners Galliford Try.\nIts ‘smart controls’ will hold storm water back during severe weather events and return it back to the water company’s treatment works when rainfall has subsided.\nSevern Trent added that a new concrete lid will be installed on the overflow storage tank in the coming weeks.\nIn July 2024 Severn Trent announced a £450m programme to cut spills from other storm overflows at 900 sites across the Midlands."}, {"id": "14ba1b28-7b88-459d-bc8e-4516c5617ee6", "title": "Divers search Sicily yacht wreck with united kingdom tech boss among missing", "date": "2024-08-21 02:30", "url": "https://japantoday.com/category/world/divers-search-sicily-yacht-wreck-with-uk-tech-boss-among-missing", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "Among the six missing were UK tech entrepreneur Mike Lynch and his 18-year-old daughter Hannah, and Jonathan Bloomer, the chair of Morgan Stanley International, and his wife Judy.\nThe search was made difficult by the British-flagged yacht lying largely intact on the seabed some 50 meters down.\nDivers trained to work in tight spaces were flown in from Rome and Sardinia late Monday.\nMarco Tilotta, from the Palermo fire service divers' unit, told AFP search efforts were concentrated on getting inside the sleeping and living areas of the yacht.\nIts 75-metre mast was the world's tallest aluminium sailing mast, according to the Charter World website."}, {"id": "249ec6e3-27d6-47e2-acec-6c54df71caa0", "title": "Uttarakhand : Heavy rain triggers landslides and flooding in Uttarakhand | Dehradun News", "date": "2024-08-21 00:30", "url": "https://timesofindia.indiatimes.com/city/dehradun/heavy-rain-triggers-landslides-and-flooding-in-uttarakhand/articleshow/112666439.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Authorities rescued the remaining trekkers but continue searching for the missing woman despite challenges from adverse weather conditions.\nAustria battles major flooding after record downpoursHeavy rains caused significant flooding in Alpine regions of Austria, disrupting transportation and damaging property.\nRain triggers landslides in Tripura: 7 dead, 2 go missingContinuous rain in Tripura led to landslides that caused seven deaths and left two people missing, while over 5,600 residents became homeless.\nDehradun : Uttarakhand experienced intense rainfall on the intervening night of Monday and Tuesday, causing landslides in the hilly regions and flooding in the plain areas.\nThe worst-affected areas in Haldwani include Krishna Vihar, Devi Vihar, Shiwalik Vihar and Gayatri Colony, where water and slush entered over 300 houses."}, {"id": "df4459ab-1896-4bc4-afd7-dd3f5ecd3bd7", "title": "Wildfire on Lookout Mountain , Clear Creek Canyon", "date": "2024-08-21 06:00", "url": "https://www.cpr.org/2024/08/20/wildfire-on-lookout-mountain-clear-creek-canyon/", "domain": "cpr.org", "domain_classification": "Unknown", "message": "The Goltra fire burning on Lookout Mountain near Clear Creek Canyon grew significantly overnight, according to the Jefferson County Sheriff's Office.\nU.S. 6 through Clear Creek Canyon remains completely closed to traffic and authorities are calling in additional resources to tackle the fire this morning.\nNo homes are currently at risk, the sheriff's office said.\nThe sheriff's office said high wind in the area has posed a problem since the fire broke out.\nHowever, the county remains under a stage one ban, which restricts campfires, smoking and fireworks."}, {"id": "086e7d21-e0e2-4dad-ad35-eb77768b08cf", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 03:00", "url": "https://www.fox5dc.com/weather/connecticut-home-house-collapses", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "905e6528-c7f6-4163-9755-3950c8817894", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 05:15", "url": "https://www.fox32chicago.com/weather/connecticut-home-house-collapses", "domain": "fox32chicago.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "5e4029ce-366c-49bc-8ca7-70d50a6447d1", "title": "Climate change is already reshaping PNW shorelines . Tribal nations are showing how to adapt", "date": "2024-08-21 04:00", "url": "https://www.adn.com/nation-world/2024/08/20/climate-change-is-already-reshaping-pnw-shorelines-tribal-nations-are-showing-how-to-adapt/", "domain": "adn.com", "domain_classification": "Unknown", "message": "(Ivy Ceballo/The Seattle Times/TNS)SHORES OF THE SALISH SEA, Tulalip, Wash. — Keeley Chiasson plodded through the steep, sandy sediment near the base of the bluff.\nBut coastal tribes in the Pacific Northwest often hit bureaucratic hurdles to access the money, workforce and collaboration needed to adapt, according to a new report by the Northwest Climate Resilience Collaborative.\nSome coastal tribes in the Pacific Northwest have uprooted entire villages to move to higher ground.\nThese issues were among those highlighted in the new report by the Northwest Climate Resilience Collaborative.\nTulalip and other tribal nations across the Pacific Northwest have developed climate solutions rooted in nature."}, {"id": "bdd982de-2751-4775-b9aa-b9440ad31797", "title": "Rotorua housing development : 202 new homes at Ngongotahā green - lit", "date": "2024-08-21 07:45", "url": "https://www.nzherald.co.nz/rotorua-daily-post/news/rotorua-housing-development-202-new-homes-at-ngongotaha-green-lit/LZ4D4ZICYFBGNNU6HIDMJ5DTRA/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "The Ministry of Housing and Urban Development said it approved the application as Rotorua was one of the ministry’s priority areas.\nThe Bay of Plenty Regional Council said there were not any “insurmountable issues” and provided extensive comments on issues including flooding, contaminated soils and land stability.\nRotorua Lakes Council said Watchman Residential engaged with the council from early 2023 and reduced several issues it had with the proposal.\nWatchman Residential director Marcus Jacobson addresses a public meeting in Ngongotahā.\nPhoto / Andrew WarnerThe council said traffic issues were dealt with and it was deemed stage one would not adversely affect the state highway roading network."}, {"id": "cdcd269f-b345-4859-a73c-7f55b3a79f21", "title": "Several Bay Area counties receive CAL FIRE grant for wildfire prevention", "date": "2024-08-21 02:00", "url": "https://abc7news.com/post/several-bay-area-counties-receive-cal-fire-grant-wildfire-prevention/15210472/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Several Bay Area counties receive CAL FIRE grant for wildfire preventionEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nSAN FRANCISCO (KGO) -- Every year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients."}, {"id": "846d0c7d-938c-4331-b60b-975b67cedac1", "title": "What is known about the sinking of a luxury yacht off the coast of Sicily and those aboard", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/news/nation/yacht-bayesian-lynch-sicily-waterspout-missing-sinking-j38994", "domain": "newsday.com", "domain_classification": "Unknown", "message": "They took them aboard their yacht and alerted the coast guard.\nAmong the missing is 59-year-old tech tycoon Mike Lynch, sometimes described as the British Bill Gates.\nIn this picture released by the Italian Firefighters Tuesday, Aug. 20, 2024, Scuba divers study a map of the sailing yacht Bayesian at the Porticello harbor.\nThe Bayesian was a luxury yacht built in 2008 by the Italian firm Perini Nav.\nAs the search for the missing continues, authorities already have begun trying to piece together exactly what happened."}, {"id": "f76d352d-27b2-4d2c-8b90-4b5982ca2aed", "title": "Texas wildfire threats continue amid triple - digit temps", "date": "2024-08-21 03:15", "url": "https://www.fox7austin.com/news/texas-wildfire-threats-continue-amid-triple-digit-temps", "domain": "fox7austin.com", "domain_classification": "Unknown", "message": "The Travis County Commissioners Court issued a burn ban for parts of Travis County as Central Texas reaches triple-digit temperatures.\nTravis County is 1 out of nearly 115 counties under a burn ban in the state, according to the Texas A&M Forest Service.\nThis week, Governor Abbott announced he has deployed additional state firefighting resources as wildfire threats continue to increase across Texas and wildfire prepardness reaches level three.\n\"We are starting to see some activity in the Central Texas area.\nThat area of risk where it is dry and hot is expanding into Central Texas."}, {"id": "55354d48-def8-4df6-803c-b07826789582", "title": "Monsoon rains cause widespread flooding across Pakistan", "date": "2024-08-21 08:45", "url": "https://dunyanews.tv/en/Pakistan/832126-monsoon-rains-cause-widespread-flooding-across-pakistan", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Monsoon rains cause widespread flooding across PakistanPakistan Pakistan Monsoon rains cause widespread flooding across PakistanThe downpour brought relief from heat as citizens enjoyed respite from humidityFollow on Updated On: Wed, 21 Aug 2024 11:44:34 PKTLAHORE (Dunya News) – The monsoon rains have wreaked havoc in various parts of the country, including the provincial capital Lahore, with low-lying areas submerged due to water accumulation.\nIn Lahore, heavy rainfall after midnight on Wednesday turned Lakshmi Chowk, The Mall, Jail Road, Baghbanpura, Tajpura, Iqbal Town, Chowburji and other low-lying areas into ponds.\nElsewhere, Muridke, Chashma, and surrounding areas experienced torrential rains accompanied by strong winds, while Balochistan faced severe flooding due to monsoon rains.\nIn Khuzdar, intense rain with thunderstorm caused rivers and streams to overflow, resulting in a flood situation in rural areas.\nIslamabad and Rawalpindi also saw substantial rainfall, causing waterlogging in low-lying areas, streets, and neighborhoods."}, {"id": "80e0c2ce-744f-42b7-a634-203aa45eb1f7", "title": "WATCH : Agriculture Ministry hands out supplies to fisherfolk in Parottee , St Elizabeth", "date": "2024-08-21 02:15", "url": "https://www.jamaicaobserver.com/2024/08/20/agriculture-ministry-hands-supplies-fisherfolk-parottee-st-elizabeth/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica — Minister of Agriculture, Fisheries and Mining, Floyd Green on Friday handed out supplies to fisherfolk in Parottee, St Elizabeth as part of the ministry’s Hurricane Beryl Fisheries Recovery Programme.\nParottee is one of the communities that remains without electricity since the passing of Hurricane Beryl on July 3.\nSpeaking at the voucher handover ceremony at the Parottee Seventh-day Adventist Church, Green said, “This is a part of our overarching response programme.\n“The people who have not yet been reached please visit our offices, leave your information, we will do our verification processes and we will try to help.\nWe will build back quickly and we will build back stronger,” Green said."}, {"id": "602ac078-4910-4420-9f6c-12fa606f00ad", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 03:15", "url": "https://www.fox7austin.com/weather/connecticut-home-house-collapses", "domain": "fox7austin.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "8bd5fc64-e5a1-4c63-806f-a59375ea5e4a", "title": "Nevada wildfire causes rail and power outages , but crews halt flame progress", "date": "2024-08-21 05:15", "url": "https://lasvegassun.com/news/2024/aug/20/nevada-wildfire-causes-rail-and-power-outages-but/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Nevada wildfire causes rail and power outages, but crews halt flames’ progressScott Sonner / AP, fileWINNEMUCCA — A wildfire has forced the suspension of rail service in northern Nevada and left about several thousand rural residents without power.\nBut fire officials said Tuesday that night crews had halted the progress of the flames, which charred more than a square mile (2.6 square kilometers) of terrain and temporarily shut down part of Interstate 80.\nBut firefighters had contained about 50% of the blaze by nightfall, the land management agency said.\nThe utility NV Energy reported that more than 3,000 residents remained without electricity into the evening after power lines were shut down as a precaution in the afternoon.\nMultiple aircraft, including a large airtanker and a helicopter, were assisting 20 fire engines and crews on the ground, the Bureau of Land Management said."}, {"id": "cee0c072-9a87-4726-bee1-45c0bcf470e5", "title": "Craig Manor Flood Prevention Project To Begin In October - Journal & Topics Media Group", "date": "2024-08-21 13:15", "url": "https://www.journal-topics.com/articles/craig-manor-flood-prevention-project-to-begin-in-october/", "domain": "journal-topics.com", "domain_classification": "Unknown", "message": "Construction of a major flood relief project in Des Plaines’ Craig Manor neighborhood is expected to begin in October.\nAldermen earlier this month awarded the contract to conduct the work that won’t be completed until around July 2025.\nCraig Manor Subdivision is located on the city’s north side at Central and Wolf roads.\nThat water will eventually be released back into the storm sewer system where it will flow to a safe area.\nThe Metropolitan Water Reclamation District is providing a $1 million grant to help fund the project."}, {"id": "684dc8d6-2566-432b-bed9-9cdf418cf4b1", "title": "Sicily yacht sinking : live update", "date": "2024-08-21 09:15", "url": "https://fortune.com/europe/article/sicily-yacht-bayesian-sinking-live-update-italian-divers-launch-search-for-six-including-missing-u-k-tech-magnate-mike-lynch/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Divers searching for six missing people following the sinking of a superyacht off Sicily have found two bodies, a source close to the search told AFP Wednesday.\nUK tech tycoon Mike Lynch and his teenage daughter Hannah are among the six people missing.\nBut the tech entrepreneur and his daughter, his lawyer Christopher Morvillo and his wife Neda, and Jonathan Bloomer, the chair of Morgan Stanley International, and his wife Judy, were all reported missing.\nAnarchic sea conditionsThe speed with which the yacht sank, and the fact that other boats around it were unaffected, was extraordinary.\nMany are fairly inconsequential, but some can pack winds of more than 100 kilometres (62 miles) per hour, said Inness."}, {"id": "6f1ac7ee-0078-4769-9854-1f3350562939", "title": "Residents left in limbo for 2nd day after flooding impacts  critical infrastructure  at Winnipeg highrise", "date": "2024-08-21 02:45", "url": "https://www.cbc.ca/news/canada/manitoba/flooding-winnipeg-holiday-towers-evacuations-1.7300185", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Water spewing out of the pipe quickly started flooding the 25-storey residential highrise at 170 Hargrave St., part of the Holiday Towers complex.\nShaw said the city registered and assessed 230 residents who were forced out of their homes on Monday.\nDiana Putte was among 230 tenants who were evacuated from the Holiday Towers complex.\n'Raining in the hallway': tenantRamona Hope, who has been living at Holiday Towers for 19 years, was in her fifth-floor unit when the flooding began.\nWRE Development, the management company that oversees Holiday Towers, did not respond to CBC's requests for comment before deadline on Monday and Tuesday."}]