[{"id": "ae336b53-dc67-4697-a98b-a872ea465aad", "title": "Analysis : Helicopter crash comes at a fraught time for region and Iran itself", "date": "2024-05-20 04:15", "url": "https://www.cnn.com/middleeast/live-news/raisi-iran-president-helicopter-crash/h_3c508dcd26c8260ddb963ac89cbc9246", "message": "An anti-missile system operates after Iran launched drones and missiles towards Israel, as seen from Ashkelon, Israel April 14.\nAmir Cohen/Reuters/FileThe crash of a helicopter carrying Iran’s president and foreign minister comes at an especially fraught moment in the Middle East – and for Iran domestically.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nIsrael struck back a week later, according to US officials, hitting targets outside the Iranian city of Isfahan with a much smaller, calibrated response.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces."}, {"id": "46841d6f-b28f-43bc-9d28-d1775e43a23c", "title": "Israeli airstrike kills 27 people in central Gaza , mostly women and children", "date": "2024-05-20 00:30", "url": "https://abcnews.go.com/International/wireStory/airstrike-kills-20-central-gaza-fighting-rages-israels-110371874", "message": "His departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nNetanyahu's office in a statement said they focused on Israel's military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nIn recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war's early days.\nThe airstrike in Nuseirat, a built-up Palestinian refugee camp in central Gaza dating back to the 1948 Arab-Israeli war, killed 27 people, including 10 women and seven children, according to records at Al-Aqsa Martyrs Hospital in nearby Deir al-Balah, which received the bodies."}, {"id": "5b8af261-c371-43d0-a330-f1cf8447660f", "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel leaders are increasingly divided", "date": "2024-05-20 02:00", "url": "https://www.santafenewmexican.com/ap/international/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/article_73176110-7773-5507-86ed-004c09d640a4.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "5a9c4333-d771-4247-9e3f-1b66bf5a279c", "title": "U Jake Sullivan met with Israel Benjamin Netanyahu to discuss war in Gaza", "date": "2024-05-20 04:15", "url": "https://www.wkbw.com/world/israel-at-war/us-adviser-jake-sullivan-met-with-israeli-prime-minister-benjamin-netanyahu-to-discuss-the-war-in-gaza", "message": "His departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nU.S. National Security Adviser Jake Sullivan met with Netanyahu to discuss an ambitious U.S. plan for Saudi Arabia to recognize Israel and help the Palestinian Authority govern Gaza in exchange for a path to eventual statehood.\nNetanyahu's office in a statement said they focused on Israel's military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nThe war has killed at least 35,000 Palestinians, according to Gaza's Health Ministry, which doesn't distinguish between combatants and civilians."}, {"id": "e916890d-05f1-486a-a4ac-ee2d557fa4d9", "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel leaders are increasingly divided", "date": "2024-05-20 02:00", "url": "https://www.dailyexcelsior.com/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/", "message": "DEIR AL-BALAH (Gaza Strip), May 19 : An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month.\nA separate strike on a Nuseirat street killed five people, according to the Palestinian Red Crescent emergency service.\nIsrael launched its offensive after Hamas’ Oct 7 attack, in which militants stormed into southern Israel, killing around 1,200 people, mostly civilians, and abducting some 250.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.\nHe has said it’s pointless to discuss postwar arrangements while Hamas is still fighting because the militants have threatened anyone who cooperates with Israel."}, {"id": "0e5a988e-fe50-4a4f-900d-40891bf022da", "title": "Mass graves in Gaza show victim hands were tied , says UN rights office", "date": "2024-05-20 02:15", "url": "https://new.finalcall.com/2024/05/08/mass-graves-in-gaza-show-victims-hands-were-tied-says-un-rights-office/", "message": "Disturbing reports continue to emerge about mass graves in Gaza in which Palestinian victims were reportedly found stripped naked with their hands tied, prompting renewed concerns about possible war crimes amid ongoing Israeli airstrikes, the UN human rights office, OHCHR, said on April 23.\n“Among the deceased were allegedly older people, women and wounded, while others were found tied with their hands …tied and stripped of their clothes,” said Ravina Shamdasani, spokesperson for the UN High Commissioner for Human Rights.\nAl-Shifa discoveryAdvertisement ›Citing the local health authorities in Gaza, Ms. Shamdasani added that more bodies had been found at Al-Shifa Hospital.\nMounting tollAs of April 22, more than 34,000 Palestinians have been killed in Gaza, including 14,685 children and 9,670 women, the High Commissioner’s office said, citing the enclave’s health authorities.\nFourteen Palestinians were killed, three of them children,” the UN rights chief said, noting that 10 ISF members had been injured."}, {"id": "d23896c2-079c-48bc-af1e-7074849ab968", "title": "Israel at war with enemies it creates", "date": "2024-05-20 01:45", "url": "https://trinidadexpress.com/opinion/letters/israel-at-war-with-enemies-it-creates/article_317d463e-163e-11ef-97e2-8b680d5a6e6a.html", "message": "With its tenth murder for the year on Saturday night, the homicide rate in Tobago is now on par with Trinidad’s.\nUp to 2022, the sister isle’s murder rate was one-third of Trinidad’s.\nBy 2023, it had leapt to half and now, just five months into 2024, it is almost the same.\nTobago, with a population of 60,000, has a homicide rate of 22 per 50,000 people for this year (so far).\nTrinidad’s rate is 44 per 100,000."}, {"id": "8b130835-da76-49a6-93a4-93dc1c7c349c", "title": "Strikes kill 11 in Ukraine region under Russian offensive", "date": "2024-05-20 03:15", "url": "https://www.thenews.com.pk/print/1191110-strikes-kill-11-in-ukraine-region-under-russian-offensive", "message": "Russian military investigators work in a restaurant building hit by recent shelling, which local Russian-installed authorities called a Ukrainian military strike, in the course of Russia-Ukraine conflict in Donetsk, Russian-controlled Ukraine, May 11, 2024.\n— ReutersKYIV, Ukraine: Russian attacks on Ukraine’s Kharkiv region on Sunday killed at least 11 people, said authorities in the border area facing a new offensive by Moscow’s forces.\nRussian forces since May 10 carried out a ground assault in the northeastern region, where they achieved their biggest territorial gains in a year-and-a-half.\nShortly after, authorities reported another attack in the Kharkiv region.\nAfter launching increased aerial strikes, Russia carried out a ground assault in the border region on May 10."}, {"id": "c6eff835-4de3-4c3c-a4a7-f36d58452337", "title": "Day 225 : Continued Israeli Bombing Kills Dozens In Gaza", "date": "2024-05-20 00:00", "url": "https://imemc.org/article/day-225-continued-israeli-bombing-kills-dozens-in-gaza/", "message": "On Saturday, Day 225 of the ongoing Israeli genocide of the Palestinians in the Gaza Strip, Israeli missiles and shells killed many Palestinians and injured many more, in several parts of the Gaza Strip.\nIn Gaza City, many Palestinians were injured by live fire from Israeli military helicopters, while the army fired many shells at the Zeitoun neighborhood, causing injuries, before they were rushed to the Baptist Hospital.\nIn northern Gaza, casualties were reported when the army fired barrages of live rounds at Palestinians in the vicinity of Kamal Adwan Hospital in Beit Hanoun.\nMedics rushed most of the slain and the wounded to Adwan Hospital despite continued Israeli bombing and shelling around it.\nIn addition, the army fired dozens of live rounds, and many artillery shells at several areas, east of the Al-Boreij and the Al-Maghazi refugee camps, in central Gaza."}, {"id": "46a9c082-acab-47f5-8f44-422aa388a282", "title": "At least 11 killed as Russia presses forward with its offensive in northeastern Ukraine", "date": "2024-05-20 02:00", "url": "https://www.columbian.com/news/2024/may/19/at-least-11-killed-as-russia-presses-forward-with-its-offensive-in-northeastern-ukraine/", "message": "KYIV, Ukraine — At least 11 people were reported killed in attacks in Ukraine’s war-ravaged northeast on Sunday as Russia pushed ahead with its renewed offensive.\nIn the Kharkiv region, the focus of the offensive, the Kharkiv Regional Prosecutor’s Office said six people were killed and 27 wounded in a Russian strike on the outskirts of the regional capital, also called Kharkiv.\nRegional Gov.\nOleh Syniehubov said that five more people were killed and nine wounded in an attack on the region’s Kupiansk district, southeast of the regional capital.\nRussia’s Ministry of Defense said Sunday that its forces in the area were “continuing to advance into the depths of the enemy’s defense.” Ukraine’s General Staff said Russia had stepped up its attacks around Kharkiv and that the situation was “dynamic.”"}, {"id": "f697ec87-a2a2-4b77-b293-ce7938ae0306", "title": "Biden White House Establishes Sanctuaries for Russian Forces Attacking Ukraine ; Does This Sound Familiar ? ", "date": "2024-05-20 00:00", "url": "https://redstate.com/streiff/2024/05/19/biden-white-house-establishes-sanctuaries-for-russian-forces-attacking-ukraine-does-this-sound-familiar-n2174403", "message": "Russia has since clawed back ground Ukraine took last year during its counteroffensive, which pushed Russian forces back across the border.\n“The assistance is for the defense and not for offensive operations in Russian territory,” said one of the officials, who was granted anonymity to discuss sensitive issues.\nSecretary Blinken, the Biden administration has made clear it doesn’t want Ukraine using U.S. equipment to strike onto Russian territory.\nAnd the Secretary, in his conversations with Minister Umerov, talks through how best those capabilities can be used, and we believe that is within Ukrainian territory.\nThe Russians are “smart now,” Ustinova said, “because they know there is a restriction for Ukrainians to shoot at the Russian territory."}, {"id": "4f5346b4-98c8-4534-88f7-a870c8544ecd", "title": "Airstrike Kills 27 In Central Gaza And Fighting Rages As Israel Leaders Are Increasingly Divided – 710am KURV", "date": "2024-05-20 00:30", "url": "https://www.kurv.com/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/", "message": "In recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war’s early days.\nA separate strike on a Nuseirat street killed five people, according to the Palestinian Red Crescent emergency service.\nIsrael launched its offensive after Hamas’ Oct. 7 attack in which militants stormed into southern Israel, killing around 1,200 people, mostly civilians, and abducting about 250.\nMourners gathered Sunday for the funeral of one of four hostages killed in the attack whose bodies were recently found by Israeli troops in Gaza.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians."}, {"id": "9dde88af-c0af-4b31-9c12-dfd2aa0a96fe", "title": "Drone footage shows wreckage of crashed helicopter", "date": "2024-05-20 04:15", "url": "https://www.cnn.com/middleeast/live-news/raisi-iran-president-helicopter-crash/h_f56d9dc05b70138e1dacf0cfa1daa796", "message": "A helicopter carrying Iran's President Ebrahim Raisi takes off, near the Iran-Azerbaijan border, on May 19.\nAli Hamed Haghdoust/IRNA/WANA/ReutersIranian President Ebrahim Raisi was likely traveling on a Bell 212 helicopter that began operating in the late 1960s, according to CNN military analyst Cedric Leighton.\nLeighton told CNN's Paula Newton that the difficulty in obtaining spare parts could have played a factor in the crash.\nThe helicopter was first produced in the United States and then in Canada, Leighton, a retired US Air Force colonel, said.\n“So spare parts would have definitely been an issue for the Iranians.”"}, {"id": "b5253cd4-905d-4797-a3da-3cd4e64f7652", "title": "Airstrike on Gaza kills 27 as Israelis argue over post - war plan", "date": "2024-05-20 02:00", "url": "https://www.independent.ie/world-news/middle-east/airstrike-on-gaza-kills-27-as-israelis-argue-over-post-war-plan/a278209321.html", "message": "Airstrike on Gaza kills 27 as Israelis argue over post-war planPrime minister Benjamin Netanyahu’s rival Benny Gantz threatens to quit government in row over who will govern the strip post-warA man carries the body of a Palestinian child recovered from a house hit by an Israeli strike, in Nuseirat, in the Gaza Strip yesterday.\nIsraeli politicians are arguing over how the strip should be governed after the war.\nPhoto: ReutersWafaa Shurafa Today at 03:30An Israeli airstrike killed 27 people in central Gaza and fighting with Hamas raged across the north yesterday as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month."}, {"id": "e17b5aee-570d-4831-9f00-20ca75b284fb", "title": "Ukraine war briefing : Russian forces launch deadly attack on Kharkiv lakeside resort", "date": "2024-05-20 02:15", "url": "https://www.theguardian.com/world/article/2024/may/20/ukraine-war-briefing-russian-forces-launch-deadly-attack-on-kharkiv-lakeside-resort", "message": "Russia struck a lakeside resort on the edge of Kharkiv on Sunday and attacked villages in the surrounding region, killing at least 11 people and wounding scores.\nProsecutors said six people were killed in the resort, with one missing and 27 wounded.\nRescuers said the initial strike was followed by a second strike about 20 minutes later, targeting emergency crews at the scene in a “double tap”.\nLocal governor Oleh Syniehubov said Russian forces shelled two villages of the district with a self-propelled multiple rocket launcher.\nThe missile strikes were the latest in what have been constant Russian attacks in recent weeks on the Kharkiv region of north-eastern Ukraine, where Russian troops have launched an offensive."}, {"id": "259dfcf3-a9e7-4e97-b373-03845c7d43db", "title": "Rescuers are searching for the helicopter that was carrying the president of Iran", "date": "2024-05-20 03:00", "url": "https://www.ideastream.org/npr-news/2024-05-19/rescuers-are-searching-for-the-helicopter-that-was-carrying-the-president-of-iran", "message": "Updated May 20, 2024 at 00:49 AM ETIranian President Ebrahim Raisi and the country's foreign minister, Hossein Amir Abdollahian, were declared dead Monday in a helicopter crash, Iranian state media reported.\nEarlier, IRNA reported that the president of the Iranian Red Crescent Society confirmed that rescue and search teams had identified Raisi's crashed helicopter.\nThe Fars News Agency posted what it said was video footage of rescue teams that had been dispatched to the area of the helicopter's \"hard landing.\"\nStill, Raisi has been viewed as more of a hard-liner than his predecessor, former Iranian president Hassan Rouhani.\nIran's president is the head of its government, but the country is ruled by Khamenei, its supreme leader."}]