[{"id": "fac1f95a-a83c-40bc-aeb0-d0542be50ee3", "title": "Vanuatu hit with 6 . 2 magnitude earthquake", "date": "2024-05-09 01:45", "url": "https://www.perthnow.com.au/technology/vanuatu-hit-with-62-magnitude-earthquake-c-14602417", "message": "Vanuatu has been hit with a 6.2 magnitude earthquake.\nThe earthquake struck about 95km from Luganville about 7.24pm (AEST) on Wednesday, according to Geoscience Australia.\nCamera Icon A magnitude 6.2 earthquake hit Vanuatu on Wednesday night.\nGeoscience Australia Credit: NCA NewsWireCamera Icon There’s no tsunami threat on the Australian coast.\nBureau of Meteorology Credit: NCA NewsWireTheNightly Get in front of tomorrow's news for FREE Journalism for the curious Australian across politics, business, culture and opinion."}, {"id": "f709333a-dd90-412a-9f97-30b768c21fec", "title": "Jasper County recovering from storm damage , trees falling on roads", "date": "2024-05-09 04:00", "url": "https://kfdm.com/news/local/jasper-county-recovering-from-storm-damage-trees-falling-on-roads", "message": "Parts of Jasper County are still underwater and now trees are falling in the streets, posing a threat to safety for residents.\n\"They're just falling at random times and it's scary to have your kids outside without knowing where the trees are going to land,\" says White.\n\"Our precinct four commissioner Dennis Marsh, he actually sent an estimate last week of about 10 trees, 11 trees per mile in his precinct that he's finding on the county roads that are dead,\" says Precinct 1 Commissioner Seth Martindale.\nThe trees were then unable to withstand the flooding and high winds and began collapsing.\nAmong flooding and falling trees, some roads in Jasper County have also been compromised."}, {"id": "c1c39957-d309-491f-8f05-acffc05ca3d5", "title": "An elite club with past Indonesian presidents ? Why incoming leader Prabowo idea is stirring debate", "date": "2024-05-09 03:30", "url": "https://www.channelnewsasia.com/asia/indonesia-presidential-club-prabowo-megawati-sby-jokowi-4321176", "message": "Media outlets were quick to pounce on the idea of a presidential club, first raised by Mr Prabowo’s spokesperson in late April.\nEarlier this week, he said the presidential club would not be a formal set-up and there are no plans to institutionalise it, unlike the Presidential Advisory Council (Wantimpres).\nBy the time Mr Prabowo takes office on Oct 20, Indonesia will have three living former presidents: Mr Joko Widodo, Mr Susilo Bambang Yudhoyono and Ms Megawati Soekarnoputri.\nThe United States has such a club, Mr Andi noted.\nIt is widely believed that Ms Megawati viewed this as a betrayal."}, {"id": "0f94c528-603b-42cf-b079-995344024ad0", "title": "Buncombe County residents left picking up the pieces from severe hail storm", "date": "2024-05-09 04:15", "url": "https://wlos.com/news/local/buncombe-county-residents-left-picking-up-the-pieces-from-severe-hail-storm", "message": "Wednesday afternoon’s hail storm left many locals in fear of what Wednesday night's storm could do next to their property.\nOver in Buncombe County, just outside of Barnardsville, Vanessa Ankney faces the daunting task of picking up what’s left of her chicken coop.\nAnkney showed News 13 just how much destruction the hail storm left behind.\nNews 13 also spoke with Sherry Hardwood, who works at Triangle Stop.\nTriangle stop is located just about four miles away from Ankney and she says she’s still in disbelief."}, {"id": "dc482c14-fc39-4cb3-b2e6-acc3bcd2e582", "title": "Too many trees creating unhealth forest in northern Arizona", "date": "2024-05-09 00:45", "url": "https://www.azfamily.com/2024/05/08/too-many-trees-northern-arizona-have-created-higher-fire-risk/", "message": "FLAGSTAFF, AZ (AZFamily) — Wildfires in Coconino County have cost local communities homes, hundreds of millions of dollars, and an entire mountainside worth of forest.\nJay Smith, Coconino County forest restoration director, said while the forest looks lush and green, that’s not exactly what they want.\nHowever, Smith said the trees that make up these forests are also what’s choking it out.\nHowever, Coconino County is now fighting the next major wildfire before it happens.\nOnce this work is done, they’ll bring back fire, which has kept this forest healthy for millions of years."}, {"id": "8266b3d8-d64e-4575-ab6d-acb0a899c6de", "title": "Severe storms kill 2 people in Tennessee and 1 in North Carolina", "date": "2024-05-09 04:15", "url": "https://www.wcpo.com/weather/8-tornadoes-confirmed-in-ohio-3-in-michigan-as-severe-storms-cross-us", "message": "Severe storms tore through the central and southeast U.S. late Tuesday and Wednesday, spawning damaging tornadoes, producing massive hail, and killing two people in Tennessee and one person in North Carolina.\nThe National Weather Service had previously reported a likely tornado on the ground in nearby Columbia, about 45 miles south of Nashville.\nThe National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nIn North Carolina, a state of emergency was declared for Gaston County Wednesday evening following a large storm.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well."}, {"id": "d09f51c2-5412-4160-a124-ff4ff54dfcee", "title": "Powerful storms kill 3 as tornadoes tear through central and southeastern US", "date": "2024-05-09 02:15", "url": "https://www.twincities.com/2024/05/07/powerful-storms-kill-3-as-tornadoes-tear-through-central-and-southeastern-us/", "message": "The National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe weather service continued issuing tornado warnings into the night, mostly in Tennessee, but also in Missouri, Alabama, Georgia and Texas.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well.\n“It was just a lot of chaos.”In southern Indiana, the National Weather Service confirmed a tornado touched down early Wednesday.\nOn Monday, parts of the central United States were battered by heavy rain, strong winds, hail and tornadoes, including a deadly twister that ripped through an Oklahoma town."}, {"id": "078f2e6f-3fcf-473b-9e4c-231129de8bcc", "title": "Powerful storms kill 3 as tornadoes tear through central and southeastern US", "date": "2024-05-09 02:15", "url": "https://www.mcall.com/2024/05/08/powerful-storms-kill-3-as-tornadoes-tear-through-central-and-southeastern-us/", "message": "The National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe weather service continued issuing tornado warnings into the night, mostly in Tennessee, but also in Missouri, Alabama, Georgia and Texas.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well.\n“It was just a lot of chaos.”In southern Indiana, the National Weather Service confirmed a tornado touched down early Wednesday.\nOn Monday, parts of the central United States were battered by heavy rain, strong winds, hail and tornadoes, including a deadly twister that ripped through an Oklahoma town."}, {"id": "8b98cf1e-87e1-4055-9461-febfb5f79118", "title": "Powerful storms kill 3 as tornadoes tear through central and southeastern US", "date": "2024-05-09 04:00", "url": "https://gazette.com/ap/national/powerful-storms-kill-3-as-tornadoes-tear-through-central-and-southeastern-us/article_781679bb-c59d-5b74-966e-9c340d52647c.html", "message": "Powerful storms kill 3 as tornadoes tear through central and southeastern USSevere storms are tearing through the central and southeast U.S., spawning damaging tornadoes, producing massive hail, and killing two people in Tennessee and another in North Carolina"}, {"id": "ed50619a-28a8-498b-bc4a-63b53e0e9bfa", "title": "Powerful storms kill 3 as tornadoes tear through central and southeastern US", "date": "2024-05-09 03:30", "url": "https://www.wsbradio.com/news/powerful-storms-kill/XPE7KPXADSDJX3OMKQLQDME5KI/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "74bc0926-20c6-4f98-9906-1ece5575faed", "title": "Preparing for more storms across eastern Kentucky", "date": "2024-05-09 01:45", "url": "https://www.wsaz.com/2024/05/08/preparing-more-storms-across-eastern-kentucky/", "message": "BOYD COUNTY, Ky. (WSAZ) - It’s the calm before the storm with emergency management crews on standby, as another round of storms are expected to pick up later Wednesday evening.\n“Be prepared before you go to bed and have multiple ways to receive those warnings,” said Tim England, Boyd County Emergency Management Director.\nEngland says a helpful tip is making sure you have everything you need before you go to bed when it comes to night-time storms.\nFor example, having a flashlight on hand, plus your phone and portable charger handy.\nEngland says the potential for flooding from streams and creeks is at the forefront."}, {"id": "0dbb2ad8-cd6c-498d-87ee-721f6562a281", "title": "Community is  part of the equation  when it comes to wildfire prevention", "date": "2024-05-09 04:00", "url": "https://www.ksby.com/community-is-part-of-the-equation-when-it-comes-to-california-wildfire-prevention", "message": "Firefighters and partner agencies from across California gathered Wednesday in Paso Robles to discuss their commitment to preventing wildfires as part of Wildfire Preparedness Week.\nDuring the gathering, some speakers focused on the public's role in wildfire prevention.\n“It's paying attention to your surroundings, paying attention to what you're doing when you're doing it,” Owens said.\nOwens added that many wildfires begin as vehicle or vegetation fires.\nA lack of awareness surrounding your vehicle or property could allow a fire to start."}, {"id": "a025d12d-86f0-45b3-a261-83fefa5c94eb", "title": "Storm Chaser Rescues Texas Family After Home Is Hit by a Tornado", "date": "2024-05-09 00:00", "url": "https://knue.com/storm-chaser-saves-texas-family-tornado/", "message": "One family outside of Abilene is certainly grateful for Storm Chaser Freddy McKinney.\nAs the harrowing video aired live on YouTube, viewers watched on as McKinney rescued the family and their dog.\nStorm Chaser Freddy McKinney, who regularly goes live on YouTube while searching for severe weather, quite possibly saved this family from a much worse fate.\nMcKinney was able to rescue the young family and get them to the nearest hospital.\nLearn the 21 Storm Names for the 2024 Hurricane Season in Texas June brings the official start of summer."}, {"id": "39524584-489d-43d6-bed1-71f1eac4ad15", "title": "Storm Chaser Rescues Texas Family After Home Is Hit by a Tornado", "date": "2024-05-09 04:30", "url": "https://mix931fm.com/a-storm-chasers-daring-rescues-after-a-texas-familys-home-is-hit-by-a-tornado-gofundme-now-live/", "message": "One family outside of Abilene is certainly grateful for Storm Chaser Freddy McKinney.\nAs the harrowing video aired live on YouTube, viewers watched on as McKinney rescued the family and their dog.\nStorm Chaser Freddy McKinney, who regularly goes live on YouTube while searching for severe weather, quite possibly saved this family from a much worse fate.\nMcKinney was able to rescue the young family and get them to the nearest hospital.\nLearn the 21 Storm Names for the 2024 Hurricane Season in Texas June brings the official start of summer."}, {"id": "26dee6ce-329d-4ee3-b533-067dedd50fb7", "title": "State , federal & local leaders meet for annual Montana wildfire season briefing", "date": "2024-05-09 02:00", "url": "https://www.ktvq.com/news/state-federal-local-leaders-meet-for-annual-montana-wildfire-season-briefing", "message": "HELENA — Despite a strong storm that brought snow to Helena Wednesday, Montana’s wildfire season isn’t far away.\nState, federal and local administrators met in Helena to talk about their preparations, in Gov.\nLeaders met at the Montana Department of Natural Resources and Conservation’s fire aviation support hangar at the Helena Regional Airport.\nLeaders said it’s still early to know what kind of fire season Montana could see this year, but they’re prepared.\n“I say that with some confidence, in that, whatever this fire season brings, know that your counties are ready."}, {"id": "f8f40bf1-5bf1-4ae6-8931-36fbe50b9f52", "title": "State , federal & local leaders meet for annual Montana wildfire season briefing", "date": "2024-05-09 02:15", "url": "https://www.ktvh.com/news/state-federal-local-leaders-meet-for-annual-montana-wildfire-season-briefing", "message": "HELENA — Despite a strong storm that brought snow to Helena Wednesday, Montana’s wildfire season isn’t far away.\nState, federal and local administrators met in Helena to talk about their preparations, in Gov.\nLeaders met at the Montana Department of Natural Resources and Conservation’s fire aviation support hangar at the Helena Regional Airport.\nLeaders said it’s still early to know what kind of fire season Montana could see this year, but they’re prepared.\n“I say that with some confidence, in that, whatever this fire season brings, know that your counties are ready."}, {"id": "fef40633-2c1e-4e55-a54d-266d124bab2e", "title": "Stormy , warm and snowy : NOAA April climate report card", "date": "2024-05-09 02:00", "url": "https://www.foxweather.com/weather-news/noaa-april-2024-climate-assessment", "message": "That means through April, this year is the fifth-hottest out of the nation's 130-year climate history, and the country has endured seven billion-dollar disasters so far.\nThe biggest severe weather outbreak so far this year generated more than 100 tornadoes across the Midwest and Plains on April 25-28.\nDEADLY SEVERE WEATHER OUTBREAK SLAMS NEW ORLEANS WITH FLASH FLOODING, TORNADOES ACROSS SOUTHSevere weatherApril has been plagued with severe weather and strong storms.\nThe Midwest and Plains are still cleaning up after the deadly April 25-28 tornado outbreak.\nUS SEES RECORD NUMBER OF BILLION-DOLLAR WEATHER, CLIMATE DISASTERS IN 2023The billion-dollar disasters so far this year are:"}, {"id": "fa68e454-bf90-4588-8475-5f9657ea3ca9", "title": "Wild Storm Winding Down", "date": "2024-05-09 02:15", "url": "https://www.ktvh.com/weather/wild-storm-winding-down", "message": "A WINTER STORM WARNING continues for the Big Snowy Mountains, the Big Belt Mountains, the Little Belt Mountains, the Highwood Mountains and the Bozeman Pass area into Thursday morning.\nA WINTER WEATHER ADVISORY continues for the southern Rocky Mountain Front into Thursday morning.\nTremendous rain, snow and wind created hazardous conditions across most of Montana but the worst of it is over as the storm is slowly pulling away.\nThe storm will start pulling away on Thursday with mostly cloudy skies and showers in the lower elevations, a couple snow showers in the mountains through the morning.\nSome showers and thunderstorms are possible early next week but overall the weather will settle down some after this record breaking storm."}, {"id": "b20a28d3-5c2a-4f9f-9cd4-ed5ef6b289c8", "title": "Caribbean Teams Innovate to Protect Cancer Patients from Compounding Disasters", "date": "2024-05-09 01:45", "url": "https://www.ieyenews.com/caribbean-teams-innovate-to-protect-cancer-patients-from-compounding-disasters/", "message": "Dr. James Shultz was co-senior author of the “Personal View” paper that published recently in The Lancet Oncology.\nCompounding Disaster HazardsThe Caribbean’s geographically dispersed populations create impediments to timely cancer screening and treatment, and there is a shortage of centers providing comprehensive cancer care in the region.\nMany Caribbean cancer patients aren’t diagnosed until their cancer is at a later stage because they have to travel to other islands for care.\nReasons for OptimismTeams in the Caribbean have made significant progress in protecting cancer patients from the risks posed by these hazards.\nArticle Title: Protecting Caribbean patients diagnosed with cancer from compounding disasters"}, {"id": "c26196fe-fb59-475a-9d2d-fd08ea3549b2", "title": "At least 3 killed as storms slam southeast U . S . after tornadoes bring devastation to Midwest", "date": "2024-05-09 02:15", "url": "https://www.cbsnews.com/news/fatalities-storms-slam-southeast-u-s-tennessee-north-carolina-tornadoes-midwest/", "message": "The National Weather Service had previously reported a likely tornado on the ground in nearby Columbia, about 45 miles south of Nashville.\nMolder said there was a \"number of sightings of confirmed tornado touch-downs\" in the area that resulted in \"bodily injuries and property damage.\"\nThe National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe weather service continued issuing tornado warnings into the night, mostly in Tennessee, but also in Missouri, Alabama, Georgia and Texas.\nTornadoes were first reported after dark Tuesday in parts of Michigan, Indiana and Ohio, according to the National Weather Service."}, {"id": "8428796c-60c8-468a-bf38-992d3e88cdad", "title": "Powerful storms kill 2 as tornadoes tear through central and southeastern US", "date": "2024-05-09 01:45", "url": "https://www.fox5atlanta.com/weather/tornadoes-michigan-ohio-tennessee-north-carolina", "message": "FIND OUT WHEN AND HOW THESE STORMS WILL IMPACT GEORGIAIn North Carolina, a state of emergency was declared for Gaston County Wednesday evening following a large storm.\nTornadoes were first reported after dark Tuesday in parts of Michigan, Indiana and Ohio, according to the National Weather Service.\nThe National Weather Service confirmed tornadoes touched down Tuesday in western Ohio: five in Warren County and one each in Darke, Mercer and Auglaize counties.\nThe weather service said crews are still surveying areas of Franklin and Butler counties to determine if tornadoes struck there, as well.\nTornadoes were also confirmed in Pennsylvania just outside Pittsburgh, in central Arkansas and in northern West Virginia."}, {"id": "067607cd-8707-43e1-97ef-b8fbf8a3a131", "title": "Murfreesboro Has A FIRST That Will Shock You ! ", "date": "2024-05-09 02:00", "url": "https://www.wgnsradio.com/article/87098/murfreesboro-has-a-first-that-will-shock-you", "message": "Murfreesboro Has A FIRST That Will Shock You!\nMay 08, 2024 at 04:21 pm by WGNS"}, {"id": "44df76bd-50c3-4258-be3a-df3c0cdbcfbb", "title": "2 dead as tornadoes tear through central and southeastern US", "date": "2024-05-09 03:00", "url": "https://www.ctvnews.ca/world/powerful-storms-kill-2-as-tornadoes-tear-through-central-and-southeastern-u-s-1.6879499", "message": "Tornadoes were first reported after dark Tuesday in parts of Michigan, Indiana and Ohio, according to the U.S. National Weather Service.\nThe National Weather Service confirmed tornadoes touched down Tuesday in western Ohio: five in Warren County and one each in Darke, Mercer and Auglaize counties.\nThe weather service said crews are still surveying areas of Franklin and Butler counties to determine if tornadoes struck there, as well.\nTornadoes were also confirmed in Pennsylvania just outside Pittsburgh, in central Arkansas and in northern West Virginia.\nTuesday's storms came a day after parts of the central United States were battered by heavy rain, strong winds, hail and twisters."}, {"id": "67ae6978-543f-4578-8ecd-eec8e22477ea", "title": "Map Shows Which Maine Towns Could Be Underwater in 50 Years", "date": "2024-05-09 03:30", "url": "https://949whom.com/ixp/488/p/maine-towns-flooding-climate-change/", "message": "While these storms have caused damage inland, they have wreaked havoc on Maine’s coast.\nClimate Central / Google Maps Climate Central / Google Maps loading...attachment-Flood-OOB loading...Portland's Munjoy Hill could see the addition of new waterfront real estate.\nClimate Central / Google Maps Climate Central / Google Maps loading...\nIn Central Maine, the east side of Water Street could end up underwater, like they were during December’s ‘Grinch’ storm.\nClimate Central / Google Maps Climate Central / Google Maps loading..."}, {"id": "01efe318-6742-464d-ba5f-e4db2c313f79", "title": "A few storms tomorrow , better chance Friday", "date": "2024-05-09 02:00", "url": "https://www.wctv.tv/2024/05/08/few-storms-tomorrow-better-chance-friday/", "message": "TALLAHASSEE, Fla. (WCTV) - Strong storms are the main focus late tomorrow for some, and a better opportunity for more of the area on Friday.\nThis could bring a few rounds of strong to possibly severe storms to the area early Friday morning and another round for some in the afternoon.\nIf storms are stronger in the morning, this should limit instability for afternoon storms.\nRisks with the strongest storms include; damaging winds of 50 to 60 mph, small hail, and localized flooding with some storms.\nTo stay updated on all the latest forecasts and weather, follow WCTV First Alert Weather on Facebook and X (Twitter)."}, {"id": "a85f15a6-493d-4264-95bc-49f38f33166e", "title": "Powerful storms kill 2 as tornadoes tear through central and southeastern US", "date": "2024-05-09 02:00", "url": "https://www.news-gazette.com/news/nation-world/powerful-storms-kill-2-as-tornadoes-tear-through-central-and-southeastern-us/article_0b8d5b08-59ff-5423-b6b1-0910799c890e.html", "message": "Champaign, IL (61820)TodayThunderstorms early, then variable clouds overnight with still a chance of showers.\nWinds ENE at 10 to 15 mph.\nChance of rain 90%..TonightThunderstorms early, then variable clouds overnight with still a chance of showers.\nWinds ENE at 10 to 15 mph.\nChance of rain 90%."}, {"id": "984654b0-abc4-4a2b-8a17-8cd5a13bf1dd", "title": "Deadliest California wildfires list : Camp Fire is deadliest wildfire in California history", "date": "2024-05-09 04:00", "url": "https://abc7ny.com/california-fires-trump-tweet-fire-wildfires-map/4673982/", "message": "Camp Fire is deadliest wildfire in California historyThe Camp Fire has killed 86 people and at one point left hundreds of people unaccounted for.\nThe Camp Fire has killed 86 people and at one point left hundreds of people unaccounted for.\nHere are the deadliest wildfires in California history, according to statistics compiled by CalFire as of August 2019.\nCAMP FIRE - (Butte County), November 2018Deaths: 86Structures destroyed: 18,804Acres burned: 153,336RELATED: Camp Fire is now most destructive wildfire in California history2.\nIRON ALPS COMPLEX (Trinity County), August 2008Deaths: 10Structures destroyed: 10Acres burned: 105,855RELATED COVERAGE: Wildfire updates across California"}, {"id": "69eafb60-f203-4453-b256-95f2321269a2", "title": "Powerful storms kill 2 as tornadoes tear through central and southeastern US", "date": "2024-05-09 01:45", "url": "https://www.lowellsun.com/2024/05/08/powerful-storms-kill-2-as-tornadoes-tear-through-central-and-southeastern-us/", "message": "The National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe weather service continued issuing tornado warnings into the night, mostly in Tennessee, but also in Missouri, Alabama, Georgia and Texas.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well.\n“It was just a lot of chaos.”In southern Indiana, the National Weather Service confirmed a tornado touched down early Wednesday.\nOn Monday, parts of the central United States were battered by heavy rain, strong winds, hail and tornadoes, including a deadly twister that ripped through an Oklahoma town."}, {"id": "fa2b0179-8bd3-47ba-9e15-7bb3f2dc4a09", "title": "Kesar Mango : Kesar mango prices rise for exports despite crop shortage |", "date": "2024-05-09 02:15", "url": "https://timesofindia.indiatimes.com/city/rajkot/kesar-mango-prices-rise-for-exports-despite-crop-shortage/articleshow/109962472.cms", "message": "We also published the following articles recentlyAs freight costs surge, exports of mango & more sufferUnited Arab Emirates deluge disrupts South India's export of perishable goods, impacting mango farmers.\nBengaluru sees a 124% increase in mango exports, but challenges persist due to cargo shortage and high charges.\nAlphonso mango mela begins in DharwadSevere drought in Dharwad led to a 35% deficit in Alphonso mango yield.\nRajendra Poddar and experts organized a mango mela at Gandhi Shanti Pratisthana to offer chemical-free fruits.\nThis year, the major problems are high freight rates and a shortage of space in cargo flights due to flooding in Dubai and the Red Sea crisis.”Exporters said the prices of export-quality kesar are high due to high freight rates."}, {"id": "2507c334-a252-42fe-82ed-2de2b8eb795e", "title": "Poor planning begets disaster - The Standard", "date": "2024-05-09 03:15", "url": "https://www.thestandard.co.zw/editorials/article/200026636/poor-planning-begets-disaster", "message": "El Niño-induced droughtTHE front page lead story in our NewsDay edition yesterday made very interesting and revealing reading.\nNcube said government “didn’t know how deep the drought was” and so it was pleasantly “surprised” that the drought was “much deeper” than it thought.\nThe drought will surely have devastating effects on our already battered economy which is in desperate need of respite.\nWe are in this mess all because of poor planning.\nAnd a typical example of this poor planning is that we don’t have any grain reserves to speak of, yet we used to have them and could even afford to feed others in times of drought."}, {"id": "99069fd4-0ec2-47f9-86ef-4deda4f05066", "title": "Mobile home owners demanding better safety regulations following tornado damage", "date": "2024-05-09 04:00", "url": "https://www.fox17online.com/news/local-news/kzoo-bc/kalamazoo/mobile-home-owners-demanding-better-safety-regulations-following-tornado-damage", "message": "Mobile home owners demanding better safety regulations following tornado damageAccording to the National Weather Service, mobile homes that are not appropriately tied down are vulnerable to 50 mile-per-hour winds.\nThose living in the Pavilion Estates told FOX 17 Wednesday maybe it's time for a change.\nShe had just moved into her Pavilion Estates home 10 months ago, and within seconds, she watched it all get ripped away.\nGovernor Gretchen Whitmer addressed that concern during her tour of the Pavilion Estates community Wednesday.\n\"I've never even heard the phrase before, but this is apparently an additional safety measure to help keep mobile homes on their foundation.”Pavilion Estates residents said that's not enough."}, {"id": "709a7b44-338b-4050-8de5-6d38423b5894", "title": "Update : Expect damaging winds and quarter - sized hail with thunderstorms in Limestone County Wednesday", "date": "2024-05-09 04:30", "url": "https://www.al.com/weather-alerts/2024/05/expect-damaging-winds-and-walnut-sized-hail-with-thunderstorms-in-lauderdale-and-limestone-counties.html", "message": "On Wednesday at 9:38 p.m. the National Weather Service issued an updated severe thunderstorm warning valid until 10:30 p.m. for Limestone County.\nThe weather service comments, \"For your protection move to an interior room on the lowest floor of a building.\nLightning safety plan:When venturing outdoors, it's crucial to have a lightning safety plan in place.\nNavigating heavy rain: Essential safety measures for wet roadsWhen heavy rain pours, the risk of flooding and treacherous roads rises.\nAdvance Local Weather Alerts is a service provided by United Robots, which uses machine learning to compile the latest data from the National Weather Service."}, {"id": "a6ebadbf-bf83-44a3-9f3a-3f3e10400453", "title": "Prescribed burn up to 269 acres planned Thursday west of Sunriver along Forest Service Road 41", "date": "2024-05-09 04:15", "url": "https://ktvz.com/news/fire-alert/2024/05/08/prescribed-burn-up-to-269-acres-planned-thursday-west-of-sunriver-along-forest-service-road-41/", "message": "Ignitions on the West Maintenance 5D Prescribed Burn are planned for 10 a.m.\nAreas adjacent to the prescribed burn, including communities on the west side of Sunriver could experience smoke impacts overnight and in the early morning hours.\nThis prescribed burn is being implemented with support from participants in the Central Oregon Prescribed Fire Training Exchange (TREX) program.\nThis prescribed burn is occurring within the Central Oregon Landscape, one of 21 focal landscapes identified within the Forest Service’s Wildfire Crisis Strategy.\nDuring prescribed burns, smoke may settle in low-lying areas overnight."}, {"id": "11dc73b0-a2b5-4e5c-b03f-f455d759fc40", "title": "Powerful storms kill three as tornadoes tear through parts of US", "date": "2024-05-09 04:30", "url": "https://www.wandsworthguardian.co.uk/news/national/24307695.powerful-storms-kill-three-tornadoes-tear-parts-us/", "message": "The National Weather Service had previously reported a likely tornado on the ground in nearby Columbia, about 45 miles (72 kilometres) south of Nashville.\nThe National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe National Weather Service in Nashville on Wednesday evening issued a tornado watch for parts of Arkansas, Mississippi, Missouri and Tennessee until 3am central daylight time.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well.\nIn southern Indiana, the National Weather Service confirmed a tornado touched down early on Wednesday."}, {"id": "decd2bbb-2a17-40ef-ab50-e251b988ebb0", "title": "Powerful storms kill three as tornadoes tear through parts of US", "date": "2024-05-09 04:30", "url": "https://www.southwalesguardian.co.uk/news/national/24307695.powerful-storms-kill-three-tornadoes-tear-parts-us/", "message": "The National Weather Service had previously reported a likely tornado on the ground in nearby Columbia, about 45 miles (72 kilometres) south of Nashville.\nThe National Weather Service said water rescues were ongoing in those areas and described the flooding from heavy thunderstorms as life-threatening.\nThe National Weather Service in Nashville on Wednesday evening issued a tornado watch for parts of Arkansas, Mississippi, Missouri and Tennessee until 3am central daylight time.\nThe weather service said crews are still surveying areas in other counties to determine if tornadoes struck there, as well.\nIn southern Indiana, the National Weather Service confirmed a tornado touched down early on Wednesday."}, {"id": "f3ef8c5e-b047-4b7a-96b1-f4f6ec782e25", "title": "Storm damages businesses , cars , and trees along U . S . 60 in the Monett and Aurora , Mo ., areas", "date": "2024-05-09 02:00", "url": "https://www.ky3.com/2024/05/08/storm-damages-businesses-cars-trees-along-us-60-monett-mo-area/", "message": "(KY3) - A strong storm damaged businesses, cars, and trees in the Monett area on Wednesday.\nThe storm also knocked power lines on U.S. 60 between Aurora and Monett.\nThe storm rolled down U.S. 60 around 4 p.m.\nIt then moved east to the Aurora area.\nMonett Emergency Manager Kelley McMillan described the damage on KY3 News at 5 p.m. She said the storm damaged signs along the business route and uprooted trees around the hospital."}, {"id": "ee902826-c727-4f61-a1be-6f273c2ceaac", "title": "  At a breaking point : Beach  nourishment  plan posed for Atlantic Avenue", "date": "2024-05-09 02:00", "url": "https://www.thewesterlysun.com/news/westerly/at-a-breaking-point-beach-nourishment-plan-posed-for-atlantic-avenue/article_65a5d8a0-0cab-11ef-a42d-aba6a34469dd.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "6942c541-d0a1-487d-9b42-b8cbf734408e", "title": "One - hectare wildfire discovered northeast of Chetwynd", "date": "2024-05-09 02:15", "url": "https://energeticcity.ca/2024/05/08/one-hectare-wildfire-discovered-northeast-of-chetwynd/", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "c57c06ad-082a-4aaa-bc51-169eeaafb30f", "title": "Powerful storms kill 2 as tornadoes tear through central and southeastern US", "date": "2024-05-09 02:00", "url": "https://www.wokv.com/news/powerful-storms-kill/XPE7KPXADSDJX3OMKQLQDME5KI/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "c8003c14-8a11-407f-a413-7c000e254b9f", "title": "Powerful storms kill 2 as tornadoes tear through central and southeastern US", "date": "2024-05-09 02:15", "url": "https://www.local3news.com/local-news/tennessee/8-tornadoes-confirmed-in-ohio-3-in-michigan-as-severe-storms-cross-central-us/article_3e579eb9-e536-5fd5-9c0c-09db653963de.html", "message": "At least eight tornadoes have touched down in Ohio and three have been confirmed in Michigan as severe storms barreled through the central U.S., killing one man in Tennessee when a tree toppled onto his vehicle"}, {"id": "dbcc7371-f52f-4315-b12a-e406411ad855", "title": "Powerful storms kill 3 as tornadoes tear through central and southeastern US", "date": "2024-05-09 04:00", "url": "https://www.krmg.com/news/powerful-storms-kill/XPE7KPXADSDJX3OMKQLQDME5KI/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "ebf1d71a-d664-4d98-9ac1-cc172a5c3b2c", "title": "GALLERY : Severe weather rolls through Middle TN", "date": "2024-05-09 01:00", "url": "https://www.yahoo.com/news/gallery-severe-weather-rolls-middle-222832691.html", "message": "NASHVILLE, Tenn. (WKRN) — Severe weather is passing through Middle Tennessee and Southern Kentucky Wednesday, leading to multiple Tornado Warnings and Tornado Watches across the area.\nTracking severe weather across Middle Tennessee: May 8, 2024Viewers shared the following photos of the storm — and the hail that fell during the storm — with News 2 on Wednesday, May 8:Storm moving through Lebanon (Courtesy: Sabrina Buer)Storm moving north of Lebanon (Courtesy: Eli Hodge)Storm moving north of Lebanon (Courtesy: Eli Hodge)Storm moving north of Lebanon (Courtesy: Eli Hodge)Storm over Big Sandy River in Springville (Courtesy: Sylvia Abshire)Storm moving on I-65 North in White House (Courtesy: Spencer Ellithorpe)Storm over Springfield (Courtesy: Jett Taylor Dehmlow)Storm over Portland (Courtesy: Victor Cantrell)Storm in Montgomery County (Courtesy: Megan Miller)Storm in Unionville moving towards Eagleville (Courtesy: Desiree Franks)Lochlan Stephens, age 5, excited to collect hail in Greenbrier (Courtesy: Brian Stephens)Hail in Greenbrier (Courtesy: Reggie Tullos)Hail in Greenbrier (Courtesy: Reggie Tullos)Hail in Big Rock (Courtesy: Kayla Tipton)Hail in Paris (Courtesy: Tammy Brown)Hail in Paris (Courtesy: Mary Reynolds)Hail in Clarksville (Courtesy: Deb Stinson)Hail in Clarksville (Courtesy: Keya Maxwell)Hail in Clarksville (Courtesy: Keya Maxwell)Hail in Clarksville (Courtesy: Denise Collins)Hail in Clarksville (Courtesy: Tina Roberts)Hail in Clarksville (Courtesy: Tina Roberts)Hail in Clarksville (Courtesy: Patricia Miller)Hail in Clarksville (Courtesy: Ryan Caudill)Hail in Clarksville (Courtesy: Phyllis Hobson)Hail in Clarksville (Courtesy: Pam Seay)Hail in Clarksville (Courtesy: Pam Seay)Hail in Cedar Hill (Courtesy: Amery Freeman)Hail in Cedar Hill (Courtesy: Amery Freeman)Fallen tree in Indian Mound (Courtesy: Charlene Thompson)Flooding in Springfield (Courtesy: Springfield Parks and Rec)Flooding in Springfield (Courtesy: Springfield Parks and Rec)Storm damage in Columbia (Courtesy: Heather Muiznieks)If you took any pictures or videos of the severe weather, please email them to pix@wkrn.com.\nDon’t forget to take the power and reliability of the WKRN Weather Authority with you at all times by downloading the News 2 Storm Tracker app.\nFor the latest news, weather, sports, and streaming video, head to WKRN News 2."}, {"id": "d1b2ee75-71c0-471c-a805-cc8f745ef122", "title": "Dry conditions lead to heightened wildfire concerns in Northern Michigan", "date": "2024-05-09 02:15", "url": "https://www.yahoo.com/news/dry-conditions-lead-heightened-wildfire-080810320.html", "message": "NORTHERN MICHIGAN — Temperatures are warming up and summer is on its way — bringing with it dryer conditions and heightened concerns about wildfire risk.\n“There’s more moisture in that stuff versus everything that’s dormant or dead from the winter,” Sullivan said.\n“It’s not dry anymore when you start growing things.”Dry conditions in the spring lead to higher risks of a wildfire.\nAs of Tuesday, most of Northern Michigan and the Upper Peninsula are in the \"Very High\" fire risk category.\nThis article originally appeared on The Petoskey News-Review: Dry conditions lead to heightened wildfire concerns in Northern Michigan"}, {"id": "eb8cb81a-bf9f-4b40-b38e-819cda745064", "title": "INT : Major storms continue across the country following devastating overnight tornadoes in Michigan", "date": "2024-05-09 01:45", "url": "https://inlandnewstoday.com/story.php?s=74493", "message": "Major storms continue across the country following devastating overnight tornadoes in Michigan Damaging winds, large hail and possible tornadoes continue to threaten parts the country from Texas to the mid-Atlantic through Thursday.\nAndy Beshear cautioned residents to \"remain alert\" as severe weather moves across the state.\nThe severe weather follows devastating overnight tornadoes in Michigan.\nParts of Texas could also see severe storms Wednesday evening and night, including very large hail and damaging winds, according to the weather service in Fort Worth.\nApril and May are generally the peak months for severe weather during the year."}, {"id": "510d5f3b-ccb4-4e5a-9937-97eb8ffcddfa", "title": "Deadly storms claim 100 lives , damage 100 , 000 homes in south Brazil - World News", "date": "2024-05-09 04:00", "url": "http://english.sina.com/world/2024-05-09/detail-inauqwnt3211138.shtml", "message": "At least 100 people have died and nearly 100,000 homes have been destroyed or significantly damaged from more than a week of record rainfall and flooding in south Brazil's Rio Grande do Sul state, local authorities said on Wednesday.\nThe National Confederation of Municipalities said in an update that overflowing rivers and floods in the state have affected around 1.45 million people and forced some 200,000 residents to flee their homes.\nAs many as 414 of 497 towns in the state, a top agricultural and livestock producer that borders Argentina and Uruguay, have suffered from the storms and declared emergencies.\nThe confederation estimates the economic losses at 4.6 billion reals (about 904 million US dollars), taking into account the damage to housing and public infrastructure, as well as agriculture, livestock, industry, commerce and services.\nIn just one week, Rio Grande do Sul saw five months' worth of rain, sparking unprecedented flooding."}]