[{"id": "2702e39b-dae7-49c3-9a52-aa39520d8585", "title": "Nat cat losses in the first half driven by severe thunderstorms and flooding – Munich Re", "date": "2024-07-31 19:15", "url": "https://www.insurancebusinessmag.com/us/news/reinsurance/nat-cat-losses-in-the-first-half-driven-by-severe-thunderstorms-and-flooding--munich-re-499511.aspx", "domain": "insurancebusinessmag.com", "domain_classification": "Unknown", "message": "“When the atmosphere is one degree warmer, it can absorb 7% more moisture – which means more energy for weather extremes and heavy precipitation.\nThanks to its leading risk expertise, Munich Re is capable of covering natural disaster-related risks on a large scale.\nWe laid the groundwork for that expertise 50 years ago, when we hired our first meteorologist,” Rauch said."}, {"id": "84458618-4a01-488f-8af3-74abc7b6cd87", "title": "Storm Brewing Off Florida Coast Could Become Tropical Depression", "date": "2024-07-31 16:15", "url": "https://www.theepochtimes.com/us/storm-brewing-off-florida-coast-could-become-tropical-depression-5697084", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "If it strengthens, it will be the second storm to affect the United States this season, following Hurricane Beryl, which struck Texas in early July.\nThe National Hurricane Center (NHC) is watching “a large tropical wave” that is set to enter the Caribbean on July 31, approaching the Lesser Antilles.\nTo become a tropical depression, this tropical wave would have to develop into a cyclone with “organized deep convection” and surface winds moving counter-clockwise around a “well-defined center,” producing maximum sustained winds of 38 mph or less, according to the NWS.\nIf the system takes shape, it will be introduced as Tropical Depression Debby.\nHurricane season began on June 1 and will run through Nov. 30."}, {"id": "9e08c79b-df56-4d75-a88b-5547c37a5c28", "title": "Hurricane Beryl to cost Americans nationwide nearly $32 billion", "date": "2024-07-31 07:45", "url": "https://www.ktbs.com/weather/headlines/hurricane-beryl-to-cost-americans-nationwide-nearly-32-billion/article_99fa8a18-8651-5601-aeed-4705909ea6ab.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "ba2d8a19-cb14-440b-9b6d-42dd14b3b418", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists | iNFOnews", "date": "2024-07-31 11:45", "url": "https://infotel.ca/newsitem/sahara-subdues-hurricanes/cp519855211", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Sand from the Sahara Desert causing recent lull in the hurricane season: scientistsScientists say tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season.\nTHE CANADIAN PRESS/HO — Amanda Dunfield, *MANDATORY CREDIT*Original Publication Date July 31, 2024 - 1:01 AMHALIFAX - Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\n\"You can see it in the atmosphere, moving from Africa westward across the Atlantic,\" says Chris Fogarty, manager of the Canadian Hurricane Centre in Dartmouth, N.S.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "41376cf8-8c2a-47a3-8efb-2b4a6cad5b5c", "title": "July is the wettest in 70 years since Hurricane Hazel", "date": "2024-07-31 19:45", "url": "https://www.yorkregion.com/news/july-is-the-wettest-in-70-years-since-hurricane-hazel-breaks-rainfall-record-at-toronto/article_6baf1acb-8864-56b6-816c-9685ed2b0d88.html", "domain": "yorkregion.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "7099a6ba-1529-49ed-b55b-4235e22325c5", "title": "Why renters suffer after hurricanes , floods and wildfires : NPR", "date": "2024-07-31 09:30", "url": "https://www.npr.org/2024/07/31/nx-s1-4998376/renters-and-weather-disasters", "domain": "npr.org", "domain_classification": "International", "message": "You may be more vulnerable to climate-driven disasterstoggle caption Ryan Kellman/NPRVenus James loved living in Matlacha, Florida.\ntoggle caption Ryan Kellman/NPRAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\ntoggle caption Ryan Kellman/NPRMeanwhile, the cost of temporary housing also increases in places where many homes have been destroyed.\ntoggle caption Ryan Kellman/NPR“The people who were hit the hardest were the poorest,” says Char Seuffert, a longtime real estate agent on the island.\n“Disaster creates disaster,” James says."}, {"id": "825ab108-5620-4b2e-9dce-17e0db170f6c", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 21:15", "url": "https://www.tpr.org/economy-and-labor/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "tpr.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "83d2f667-1027-4fde-aeef-9faaa2464049", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists – Winnipeg Free Press", "date": "2024-07-31 11:30", "url": "https://www.winnipegfreepress.com/canada/2024/07/31/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "HALIFAX – Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year’s Atlantic hurricane season, scientists say.\nScientists say tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season.\nOnly three named storms have formed over the Atlantic since hurricane season started on June 1 — tropical storms Alberto and Chris, and hurricane Beryl, which on July 2 became the earliest Category 5 hurricane to be recorded over the Atlantic.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\n“Let’s not wait until these storms are in the news.”In late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "f9dd4b33-e66c-40db-a229-04ea5e0913e2", "title": "West Haven rolls out hurricane readiness plan ahead of active storm season", "date": "2024-07-31 23:30", "url": "https://www.nbcconnecticut.com/news/local/city-of-west-haven-rolls-out-hurricane-readiness-plan-ahead-of-active-storm-season/3350300/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "The City of West Haven is preparing for an active hurricane and tropical storm season.\nThe city’s Emergency Management Director Rick Fontana held a meeting on Wednesday with city department heads to discuss their hurricane preparedness plan.\nDespite hurricane season typically beginning from June through November, in West Haven, the hurricanes more often begin from August through September.\nThis year will be the first year the City of West Haven has the option for mandatory evacuations.\nIn addition, West Haven is also improving existing infrastructure in some flood-prone areas, including the installation of gates at the underpass on Campbell Avenue."}, {"id": "44e4797d-9097-4c2f-85a8-0d5c085d1eab", "title": "System could become Tropical Storm Debby , eye Gulf Coast if it stays weak . What to know", "date": "2024-07-31 23:15", "url": "https://www.yahoo.com/news/system-could-become-tropical-storm-223142751.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "System could become Tropical Storm Debby, eye Gulf Coast if it stays weak.\n➤ Track all active stormsShould the storm drift into the Gulf Coast, its warmer waters could allow it to quickly intensify.\nThe tropical wave could become Tropical Storm Debby if it intensifies and sustained wind speeds reach 39 mph.\nThe Gulf Coast would experience similar water hazards if the storm swings to the west rather than the east.\nStorm tracker: Monitor tropical wave as it moves toward FloridaThis article originally appeared on Pensacola News Journal: Tropical wave in Atlantic could eye Gulf Coast if it stays weak"}, {"id": "e9326f60-de5e-4c57-b6f1-a86253adb3b4", "title": "  We cant give up , Gov . Scott tells flood - weary Vermont", "date": "2024-07-31 21:30", "url": "https://www.nhpr.org/2024-07-31/we-cant-give-up-scott-tells-flood-weary-vermont", "domain": "nhpr.org", "domain_classification": "Unknown", "message": "After yet another catastrophic flood on Tuesday — and more torrential rains in today's forecast — Gov.\nTuesday's flooding was much more localized than what took place in 2023 and earlier this month, when the remnants of Hurricane Beryl came to Vermont.\nBut where the rains fell hard, they once again destroyed homes, roads, and required a dozen swift water rescues.\nSt. Johnsbury saw a historic 8.08 inches of rain in a single day — shattering a record set in 1913.\nStill, Morrison said that swift water rescues teams immediately leapt into action and saved lives."}, {"id": "3dbd18b6-91c4-4a55-a2f9-e3d3450d9e33", "title": "More flooding hits Vermont with washed - out roads , smashed vehicles and destroyed homes", "date": "2024-07-31 01:15", "url": "https://www.nbcnews.com/news/us-news/flooding-hits-vermont-washed-roads-smashed-vehicles-destroyed-homes-rcna164409", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "The fresh flooding yielded similar scenes of catastrophe to the flooding weeks earlier, but on a smaller scale.\nMost of the rain fell in the Lyndon and Lyndonville areas, and in St. Johnsbury, about 10 miles south.\nDmitry Belyakov / APThe state experienced major flooding earlier in July from the tail end of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms.\n“The last storm was a wake-up call,” he said of the flooding earlier this month."}, {"id": "86555191-5220-4c60-986a-bc3596f90170", "title": "More flooding hits Vermont with washed - out roads , smashed vehicles and destroyed homes - Boston News , Weather , Sports", "date": "2024-07-31 15:00", "url": "https://whdh.com/regional/vermont/more-flooding-hits-vermont-with-washed-out-roads-smashed-vehicles-and-destroyed-homes-2/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "The fresh flooding yielded similar scenes of catastrophe to the flooding weeks earlier, but on a smaller scale.\nMost of the rain fell in the Lyndon and Lyndonville areas, and in St. Johnsbury, about 10 miles (16 kilometers) south.\nWe can’t go anywhere.”The state experienced major flooding earlier in July from the tail end of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms.\n“The last storm was a wake-up call,” he said of the flooding earlier this month."}, {"id": "440a02d8-d5da-4257-a811-59124d932f1c", "title": "More flooding hits Vermont , washing out roads and destroying homes", "date": "2024-07-31 02:30", "url": "https://www.pennlive.com/weather/2024/07/more-flooding-hits-vermont-washing-out-roads-and-destroying-homes.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "The fresh flooding yielded similar scenes of catastrophe to the flooding weeks earlier, but on a smaller scale.\nWe can’t go anywhere.”The state experienced major flooding earlier in July from the tail end of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states.\n“The last storm was a wake-up call,” he said of the flooding earlier this month."}, {"id": "daa4f97a-95ca-48f2-b50c-c7d31e4848da", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 12:15", "url": "https://www.timescolonist.com/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291862", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "4115f2bb-868b-48ff-baa1-87a78d505eaa", "title": "More flooding hits Vermont with washed - out roads , smashed vehicles and destroyed homes - WSVN 7News | Miami News , Weather , Sports", "date": "2024-07-31 12:15", "url": "https://wsvn.com/news/us-world/more-flooding-hits-vermont-with-washed-out-roads-smashed-vehicles-and-destroyed-homes/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "The fresh flooding yielded similar scenes of catastrophe to the flooding weeks earlier, but on a smaller scale.\nMost of the rain fell in the Lyndon and Lyndonville areas, and in St. Johnsbury, about 10 miles (16 kilometers) south.\nWe can’t go anywhere.”The state experienced major flooding earlier in July from the tail end of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms.\n“The last storm was a wake-up call,” he said of the flooding earlier this month."}, {"id": "873b6f00-52fa-40c4-8025-298c18c3628c", "title": "Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-07-31 22:15", "url": "https://apnews.com/article/vermont-flooding-climate-change-severe-weather-3f1e3c5f55a69cd75d5b5ad0f31792f3", "domain": "apnews.com", "domain_classification": "International", "message": "Vermont is flooding.\n(AP Photo/Charles Krupa)Climate change warming the atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nA study last year in the journal Climate Change found that extreme precipitation in the Northeast will increase 52% by the end of the century.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms."}, {"id": "603bc2c5-82dd-4448-b4a7-712d79216678", "title": "Know your flood risk and act now", "date": "2024-07-31 00:45", "url": "https://www.witn.com/2024/07/30/know-your-flood-risk-act-now/", "domain": "witn.com", "domain_classification": "Unknown", "message": "One government agency is urging residents to understand their flood risk and act now.\nBut the crucial question remains, how can you determine your flood risk and what steps should you take?\nFEMA Deputy Assistant and Federal Insurance Administrator, Jeff Jackson, emphasizes that the first, crucial step is to assess your flood risk.\nBut why is it necessary to purchase flood insurance now if peak hurricane season isn’t until September?\nIt’s important to note that when it comes to flood insurance your claim could be denied if only your home is affected."}, {"id": "6f4b5e15-8d7b-4df7-9306-7af1381e0a43", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 04:30", "url": "https://www.yahoo.com/news/vermont-man-evacuates-neighbors-during-040112568.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Governor calls on flood-weary Vermonters to 'stick together' with more thunderstorms on the horizonCrews clean up debris from flash floods in Lyndonville, Vt., Wednesday, July 31, 2024.\nParts of the state hit by flooding Monday night and Tuesday are bracing again as a new round of severe thunderstorms moves through the region.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "8e796e84-e8c3-4b1e-bdbf-d27cb01299ed", "title": "This Is Considered the Worst July Storm in Kentucky History", "date": "2024-07-31 00:00", "url": "https://newstalk1280.com/ixp/76/p/worst-july-storm-ky-history/", "domain": "newstalk1280.com", "domain_classification": "Unknown", "message": "As I await the return of the electricity, I thought I'd do a little digging into the history of July storms in Kentucky.\nThe Weather Channel's data indicates the '22 flood in Eastern Kentucky was the nation's deadliest non-tropical flash flood in 45 years.\nThe Worst July Storm in Kentucky's HistoryBut it was back in 1939 when Kentucky incurred the wrath of what would come to be classified by the National Weather Service as the worst July storm in the Commonwealth's history.\nAdditionally, the rapidly rising waters destroyed the Kentucky Mountain Bible Institute which was rebuilt as the Kentucky Mountain Bible College.\nKeep reading to discover the 50 of the most expensive climate disasters in recent decades in the U.S. Gallery Credit: KATELYN LEBOFF"}, {"id": "f79ca445-22fd-4ad5-8921-4d5af776c9d7", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 04:45", "url": "https://www.clickondetroit.com/news/2024/07/31/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nIn May, Vermont became the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by extreme weather fanned by climate change.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "0858d53c-9c32-445b-b293-2b2412946972", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 05:30", "url": "https://www.news4jax.com/news/2024/07/31/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nIn May, Vermont became the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by extreme weather fanned by climate change.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "7a7d07a2-0dc2-4c80-9bbd-c00db9bfe2be", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 05:15", "url": "https://www.clickorlando.com/news/2024/07/31/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nIn May, Vermont became the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by extreme weather fanned by climate change.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "4eb5e9f7-251a-43ed-a81f-12fb34a8ef0a", "title": "Vermont flooding leaves state devastated once again – NECN", "date": "2024-07-31 14:00", "url": "https://www.necn.com/news/local/theres-a-lot-of-broken-hearts-vermont-looks-to-recover-after-again-being-ravaged-by-historic-flooding/3296187/", "domain": "necn.com", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,\" Gov.\nWe have to stick together and fight back against the feeling of defeat.”With more rain in the forecast today, Vermonters should stay vigilant.\nWatch the weather, respect road closures, follow Vermont Emergency Management and register with the Vermont Alert system (https://t.co/VvC3pFgMr9) for up-to-date information.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "ff805668-706c-4ad9-956c-0b9691393e24", "title": "You cant escape climate change , but in some areas , risk is lower – Chico Enterprise - Record", "date": "2024-07-31 00:00", "url": "https://www.chicoer.com/2024/07/30/you-cant-escape-climate-change-but-in-some-areas-risk-is-lower/", "domain": "chicoer.com", "domain_classification": "Unknown", "message": "While there is no place on Earth that is immune to the impact of climate change, some places are less exposed to risk than others.\nNote also that FEMA’s ratings consider not only the kinds of events that can be worsened by climate change (floods, droughts, wildfires, storms), but also natural hazards that aren’t affected by climate change, like earthquakes and volcanoes.\nWhat midsize counties have the lowest climate change risks?\nWhat most populated counties have the lowest climate change risks?\nThe article You Can’t Escape Climate Change, but in Some Areas, Risk Is Lower originally appeared on NerdWallet."}, {"id": "8107a848-a59a-4337-8b91-7b849b45f9c3", "title": "New England forecast : Rain moves in with warm temps , humidity lingers", "date": "2024-07-31 11:15", "url": "https://www.bostonglobe.com/2024/07/31/metro/ken-mahan-new-england-5-day-forecast/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Another round of scattered showers and thunderstorms plagued northern portions of Vermont and New Hampshire last night as the area continues to recover from early Tuesday’s torrential floods.\nAdvertisementFlood watches are in place for parts of Northern New England, with ongoing chances for rain and thunderstorms today.\nMostly cloudy skies and rounds of scattered showers may bring moments of heavy rain across the region.\nMuch of New England may see scattered storms that could bring heavy downpours and flash flooding, especially up north.\nWednesday’s breakdownSouthern New England: Mostly cloudy skies with scattered storms throughout much of the day."}, {"id": "c93fe2d3-838c-4b2e-925f-da58a20321e1", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 04:45", "url": "https://www.wsls.com/news/2024/07/31/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nIn May, Vermont became the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by extreme weather fanned by climate change.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "d3a57875-bdc6-4090-8223-2388052c1434", "title": "In the news today : Rocky road ahead for Jasper small businesses | iNFOnews | Thompson - Okanagan News Source", "date": "2024-07-31 11:45", "url": "https://infotel.ca/newsitem/in-the-news/cp1583599870", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "In the news today: Rocky road ahead for Jasper's small businessesThe remains of hotels in Jasper, Alta., on Friday July 26, 2024.\nThe business community of Jasper — a town whose economy depends on tourism, particularly the crucial summer season — is facing an overwhelming challenge in the months ahead.\nTHE CANADIAN PRESS/Amber BrackenOriginal Publication Date July 31, 2024 - 1:16 AMHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThe federal agency will also publish an estimate for economic growth in the second quarter today."}, {"id": "42c7ceb2-5429-47a2-9020-2ff7a718f215", "title": "U . S . flooding : Vermont man evacuates neighbours after witnessing driver get swept away", "date": "2024-07-31 15:00", "url": "https://www.ctvnews.ca/world/vermont-man-evacuates-neighbours-during-flooding-weeks-after-witnessing-a-driver-get-swept-away-1.6984169", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "\"This time, it's especially bad after workers spent the past three weeks working furiously to recover from the last flooding,\" Gov.\nThis week's storms have caused destruction, albeit on a smaller scale, like the flooding the state endured in early July that killed two people.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nNow more then ever, I encourage Vermonters who weren't impacted to find ways to help, because no act is too small.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event."}, {"id": "1df84f76-1c95-46d6-8445-12c55fa6902a", "title": "How could tropical wave affect Florida ? Everything you need to know in less than a minute", "date": "2024-07-31 11:00", "url": "https://www.yahoo.com/news/could-tropical-wave-affect-florida-100718687.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "How could tropical wave affect Florida?\nTropical cyclone is the generic term for tropical depression, tropical storm or hurricane.\nAccuWeather forecasters said the tropical wave could become a tropical storm before approaching the U.S.\nWill tropical wave impact Florida or your weekend plans?\n➤ How to prepare for a hurricaneSave on hurricane supplies during tax-free holidayThe next tax-free holiday for hurricane supplies runs from Aug. 24 through Sept. 6."}, {"id": "0de292aa-a116-4599-b3b0-92083fdf28d3", "title": "Vermont man evacuates neighbors during flooding , weeks after seeing driver get swept away", "date": "2024-07-31 15:30", "url": "https://www.wcti12.com/news/nation-world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-seeing-driver-get-swept-away-rainwater-extreme-weather-thunderstorms-hurricane-beryl-rescues-forecast", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains.\nNearly three weeks ago, he watched helplessly as a man drowned after getting caught while driving through floodwaters from Hurricane Beryl.\nMore rain was forecast for central and northern Vermont on Wednesday, with the possibility of flash flooding.\nThe fresh flooding yielded similar scenes of catastrophe as the flooding weeks earlier in which two people died, but on a smaller scale.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "aabfddf1-cf1b-4744-85ff-577d8c7e0f29", "title": "July is the wettest in 70 years since Hurricane Hazel", "date": "2024-07-31 18:00", "url": "https://www.northbaynipissing.com/news/july-is-the-wettest-in-70-years-since-hurricane-hazel-breaks-rainfall-record-at-toronto/article_1ee8a082-a05d-5d54-8364-9231d427de07.html", "domain": "northbaynipissing.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "e213633a-0c94-4d9a-ab7d-d0b2403873b9", "title": "July is the wettest in 70 years since Hurricane Hazel", "date": "2024-07-31 19:45", "url": "https://www.muskokaregion.com/news/july-is-the-wettest-in-70-years-since-hurricane-hazel-breaks-rainfall-record-at-toronto/article_d00db92a-37c4-53dd-8a98-ad4fc8b0d7fd.html", "domain": "muskokaregion.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "0863d064-5257-4c84-92e6-71383a0840cd", "title": "More flooding hits Vermont with washed - out roads , smashed vehicles and destroyed homes", "date": "2024-07-31 00:15", "url": "https://www.ajc.com/news/nation-world/more-flooding-hits-vermont-with-washed-out-roads-smashed-vehicles-and-destroyed-homes/FQJZTEMBVRAXPMAYFQM2K6CRXE/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "765b0fbf-baad-49ab-a2eb-676205254801", "title": "Vermont man evacuates neighbors during flooding , weeks after seeing driver get swept away", "date": "2024-07-31 16:15", "url": "https://www.wcyb.com/news/nation-world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-seeing-driver-get-swept-away-rainwater-extreme-weather-thunderstorms-hurricane-beryl-rescues-forecast", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains.\nNearly three weeks ago, he watched helplessly as a man drowned after getting caught while driving through floodwaters from Hurricane Beryl.\nMore rain was forecast for central and northern Vermont on Wednesday, with the possibility of flash flooding.\nThe fresh flooding yielded similar scenes of catastrophe as the flooding weeks earlier in which two people died, but on a smaller scale.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "89d89327-1316-4a7d-b134-98441f259c68", "title": "Vermont man evacuates neighbors during flooding , weeks after seeing driver get swept away", "date": "2024-07-31 15:30", "url": "https://turnto10.com/news/nation-world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-seeing-driver-get-swept-away-rainwater-extreme-weather-thunderstorms-hurricane-beryl-rescues-forecast", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains.\nNearly three weeks ago, he watched helplessly as a man drowned after getting caught while driving through floodwaters from Hurricane Beryl.\nMore rain was forecast for central and northern Vermont on Wednesday, with the possibility of flash flooding.\nThe fresh flooding yielded similar scenes of catastrophe as the flooding weeks earlier in which two people died, but on a smaller scale.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "1f7f1850-c557-4729-962b-a3eb4857a5e4", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 15:15", "url": "https://www.wsbradio.com/news/national/vermont-man/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "fd9606eb-b118-42ec-acd8-3ca576879a8b", "title": "Tropical update : System brewing in the Caribbean could impact the Wilmington area", "date": "2024-07-31 14:30", "url": "https://www.yahoo.com/news/tropical-system-brewing-caribbean-could-131756711.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is predicting a tropical wave approaching the northern Caribbean to eventually develop into a tropical depression, and then likely a tropical storm, by the weekend.\nIf the system were eventually to strengthen into a tropical storm, it would be named Debby, the fourth named storm of the season.\nAccording to the hurricane center, the disturbance has a 60% chance of developing into a tropical depression, a step below a tropical storm, by this weekend.\nAccording to the U.S. Lifesaving Association, rip currents are channelized currents of water flowing away from shore at surf beaches.\nThis article originally appeared on Wilmington StarNews: Tropical update for Wilmington, NC coast"}, {"id": "a571357b-5f77-4c71-a8e2-05304230473c", "title": "Vermont man evacuates neighbors during flooding , weeks after seeing driver get swept away", "date": "2024-07-31 15:30", "url": "https://newschannel20.com/news/nation-world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-seeing-driver-get-swept-away-rainwater-extreme-weather-thunderstorms-hurricane-beryl-rescues-forecast", "domain": "newschannel20.com", "domain_classification": "Unknown", "message": "Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains.\nNearly three weeks ago, he watched helplessly as a man drowned after getting caught while driving through floodwaters from Hurricane Beryl.\nMore rain was forecast for central and northern Vermont on Wednesday, with the possibility of flash flooding.\nThe fresh flooding yielded similar scenes of catastrophe as the flooding weeks earlier in which two people died, but on a smaller scale.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "6bd07c77-4810-47c3-992d-11d8f1959635", "title": "2 years after Hurricane Ian , FEMA approves $2 million for Okeechobee County", "date": "2024-07-31 18:45", "url": "https://www.wptv.com/weather/hurricane/2-years-after-hurricane-ian-fema-approves-2-million-for-okeechobee-county", "domain": "wptv.com", "domain_classification": "Unknown", "message": "OKEECHOBEE COUNTY, Fla. — Nearly two years after a monster Hurricane Ian left a trail of damage in Okeechobee County, the federal government has approved a $2 million grant to reimburse the county for debris removal.\nIan, which at one point grew to Category 5 strength, hammered Florida in late September of 2022, downing trees, damaging roofs, and knocking out power to Okeechobee County residents.\n\"Approximately 180,868 cubic yards of vegetative debris and 4,796 cubic yards of hurricane-generated debris were removed from roads and public property,\" FEMA said.\nWPTV Multiple mobile homes in Okeechobee County were damaged by Hurricane Ian's wrath.\nWhitehead said the county is responsible to pay for the hurricane expenses as they're happening, and used money from an emergency fund, that will be replenished with the FEMA reimbursement."}, {"id": "a4e6f63d-e6e1-4ed8-acda-03921980e6ae", "title": "4 . 7 - magnitude earthquake jolts Tokyo area : JMA", "date": "2024-07-31 05:00", "url": "https://www.prokerala.com/news/articles/a1551842.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Tokyo, July 31 : An earthquake with a preliminary magnitude of 4.7 on early Wednesday rocked the Tokyo metropolitan area, the country's weather agency said.\nThe temblor occurred at 01:47 a.m. local time, measuring 3 on the Japanese seismic intensity scale of 7 in areas in Tokyo, Kanagawa and Chiba Prefecture, said the Japan Meteorological Agency (JMA).\nAt a depth of 120 km, the epicentre was located in Tokyo's 23 wards at a latitude of 35.7 degrees north and a longitude of 139.6 degrees east, Xinhua news agency reported.\nThe tremors were felt strongly in central Tokyo, with no tsunami warnings issued.\nThere have been no reports of damage or casualties due to the temblor."}, {"id": "e40ecebe-a27a-4290-934b-d4e8e4623d38", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 18:15", "url": "https://gazette.com/ap/national/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_f4e4b42c-57e9-5968-a090-b1ca4347a7c5.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way"}, {"id": "bb59336c-eecd-4766-8e1f-dd11cc9b74e0", "title": "Drainage issues impact small businesses in Hahira", "date": "2024-07-31 22:30", "url": "https://www.walb.com/2024/07/31/drainage-issues-impact-small-businesses-hahira/", "domain": "walb.com", "domain_classification": "Unknown", "message": "HAHIRA, Ga. (WALB) - A small business in Hahira is working to stay open after flash flooding caused property damage across Lowndes County.\nAlmost a year ago, Ish Delish Nutrition saw similar flooding due to Hurricane Idalia.\nTravios Pray showed WALB a video he recorded of water draining once the city of Hahira began to empty the drain.\nThe business says they are at risk for mold and must replace flooring and possibly electrical work because of drainage issues.\nIsh Delish Nutrition is back open as they prepare for their annual kickball tournament to donate funds to homeless families."}, {"id": "f801bf52-05f2-49b8-a339-c897af0e904b", "title": "4 . 7 - magnitude earthquake jolts Tokyo area : JMA", "date": "2024-07-31 02:45", "url": "https://www.siasat.com/4-7-magnitude-earthquake-jolts-tokyo-area-jma-3071018/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Tokyo: An earthquake with a preliminary magnitude of 4.7 on early Wednesday rocked the Tokyo metropolitan area, the country’s weather agency said.\nThe temblor occurred at 01:47 a.m. local time, measuring 3 on the Japanese seismic intensity scale of 7 in areas in Tokyo, Kanagawa and Chiba Prefecture, said the Japan Meteorological Agency (JMA).\nAt a depth of 120 km, the epicentre was located in Tokyo’s 23 wards at a latitude of 35.7 degrees north and a longitude of 139.6 degrees east, Xinhua news agency reported.\nThe tremors were felt strongly in central Tokyo, with no tsunami warnings issued.\nThere have been no reports of damage or casualties due to the temblor."}, {"id": "a32220da-a850-4bd1-85b7-a3d937edc8f9", "title": "National Hurricane Center tracking system with 60 % chance of developing . What can Florida expect ? ", "date": "2024-07-31 12:00", "url": "https://www.yahoo.com/news/national-hurricane-center-tracking-system-105123446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "National Hurricane Center tracking system with 60% chance of developing.\nAccuWeather meteorologists said there's a chance the system could become a tropical storm over the weekend or early next week.\nTropical cyclone is the generic term that covers all tropical systems, including tropical depression, tropical storm and hurricane.\nStorm tracker: Monitor tropical wave as it moves toward FloridaWhat impact can Florida expect from tropical wave?\nNational Hurricane Center map: What are forecasters watching now?"}, {"id": "96cce653-5d11-4da2-8a51-afae5962fc05", "title": "Light earthquake 4 . 3 mag , 195 km S of Attu Station , Alaska", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-3-mag-195-km-s-of-attu-station-alaska/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Wednesday, 195 km S of Attu Station, Alaska (121 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nId of earthquake: us6000nh2g.\nExact location of earthquake, 173.2577° East, 51.0934° North, depth 19.294 km.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 195 km S of Attu Station, Alaska."}, {"id": "fc0a3f61-cee0-497f-b1b6-b56e1627f658", "title": "Heat Waves Are Creating New Challenges for Art Storage and Logistics", "date": "2024-07-31 22:30", "url": "https://www.artnews.com/art-news/news/climate-change-heat-waves-art-storage-and-logistics-1234713228/", "domain": "artnews.com", "domain_classification": "Unknown", "message": "Fine art storage companies are hyper-aware of extreme temperatures and high humidity levels—not to mention hurricane conditions—due to strict industry standards, new climate-control systems, and the mounting expenses and logistical challenges from growing demand for client services.\n“Frankly, it feels like things aren’t getting better,” said Francis Petit, director of the New York office for art logistics firm Gander & White.\nWhen it comes to Gander & White’s Palm Beach and Miami offices, there are additional logistical challenges for art transportation and storage services, especially during hurricane season.\nGander & White director Gilles de Greling told ARTnews that every storm is different and that he no longer offers guarantees for hurricane protection and preparedness plans.\n“We’re not picking up guys on the street to pick up your art,” de Greling said with a laugh."}, {"id": "e8412728-afbb-41ea-85e4-062ef6f18962", "title": "Tropical Storm Carlotta has formed in the eastern Pacific , forecasters say – Winnipeg Free Press", "date": "2024-07-31 21:30", "url": "https://www.winnipegfreepress.com/world/2024/07/31/tropical-storm-carlotta-has-formed-in-the-eastern-pacific-forecasters-say", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "MIAMI (AP) — Tropical Storm Carlotta has formed in the eastern Pacific, but is moving away from Mexico, forecasters said Wednesday.\nThe National Hurricane Center in Miami says in an advisory that a tropical depression was upgraded to the tropical storm, with maximum sustained winds of 45 mph (75 kph).\nThe system is centered about 310 miles (500 kilometers) southwest of Manzanilla, Mexico, and is moving northwest at 12 mph (19 kph).\nCarlotta is forecast to become a hurricane on Friday.\nHowever, no coastal watches or warnings were in effect with the storm."}, {"id": "b7c0299e-adac-4a78-b883-69204bab711f", "title": "Light earthquake 4 . 4 mag , Komandorskiye Ostrova , Russia region", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-4-mag-komandorskiye-ostrova-russia-region-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes Komandorskiye Ostrova, Russia region (0 miles) on Wednesday.\nId of earthquake: us6000nh11.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Komandorskiye Ostrova, Russia region."}, {"id": "a0568e98-580d-4bea-9368-c761d88de112", "title": "Moderate earthquake , 5 . 3 mag has occurred near South Sandwich Islands region", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/moderate-earthquake-5-3-mag-has-occurred-near-south-sandwich-islands-region/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was detected on Wednesday, South Sandwich Islands region (0 miles).\nId of earthquake: us6000nh1h.\nThe earthquake occurred at a depth of 35 km (22 miles) below the earth’s surface.\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: South Sandwich Islands region."}, {"id": "18ce269c-644a-4def-a06e-1759175282ef", "title": "Light earthquake , 4 . 9 mag was detected near central East Pacific Rise", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-9-mag-was-detected-near-central-east-pacific-rise-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has struck on Wednesday, central East Pacific Rise (0 miles).\nDate and time of earthquake in UTC/GMT: 31/07/24 / 2024-07-31 04:11:37 / July 31, 2024 @ 4:11 am.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: central East Pacific Rise."}, {"id": "e949ac1b-d380-4d20-b268-f5d22ba9a294", "title": "Light earthquake : M4 . 3 quake has struck near the Fiji Islands", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-m4-3-quake-has-struck-near-the-fiji-islands-42/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported south of the Fiji Islands (0 miles) on Wednesday.\nThe earthquake occurred at a depth of 532.687 km (331 miles) below the earth’s surface.\nId of earthquake: us6000ngpb.\nThe 4.3-magnitude earthquake has occurred at 15:46:27 / 3:46 pm (local time epicenter).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: south of the Fiji Islands."}, {"id": "d2d01a85-95c9-43c8-b2b1-b7d715a310d6", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 18:15", "url": "https://www.boston.com/news/weather/2024/07/31/governor-call-flood-weary-vermonters-stick-together-more-thunderstorms/", "domain": "boston.com", "domain_classification": "Unknown", "message": "Weather Governor calls on flood-weary Vermonters to ‘stick together’ with more thunderstorms on the horizon Thunderstorms on Tuesday brought another round of heavy flooding that washed away roads, crushed vehicles, pushed homes off their foundations and required at least two dozen boat rescues in northeastern Vermont.\nZac Drown, of Lyndon Electric Company, clears debris amid flood damage in Lyndon, Vt., Tuesday, July 30, 2024.\nA National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\nAdvertisement:“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,” Gov.\nAdvertisement:Nearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl."}, {"id": "b096a1ad-df68-4f48-9dfb-6e29f7ebca0a", "title": "Tropical depression may form near Florida this weekend | Hurricane Center", "date": "2024-07-31 14:00", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/atlantic-hurricane-season-system-may-develop-tropical-depression/article_4fff19f4-2cff-5987-8369-07445c7eb56c.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "6e0a8eee-a1ec-48fc-9ec7-2c4f63fecbc6", "title": "Light earthquake , 4 . 4 mag was detected near the Fiji Islands", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-4-mag-was-detected-near-the-fiji-islands-43/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes south of the Fiji Islands (0 miles) on Saturday.\nExact location of earthquake, 179.8736° East, -24.0033° South, depth 528.744 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nDate and time of earthquake in UTC/GMT: 27/07/24 / 2024-07-27 20:34:40 / July 27, 2024 @ 8:34 pm.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: south of the Fiji Islands."}, {"id": "965ad810-e870-4b2c-b09b-8fcd8d829c55", "title": "Light earthquake , 4 . 9 mag strikes near Kermadec Islands region", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-9-mag-strikes-near-kermadec-islands-region-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was detected on Thursday, Kermadec Islands region (0 miles).\nThe 4.9-magnitude earthquake was detected at 03:01:25 / 3:01 am (local time epicenter).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Kermadec Islands region."}, {"id": "e933bcf0-4ddd-4f72-a097-59b6493e40da", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 11:00", "url": "https://www.kgou.org/business-and-economy/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "kgou.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "92beb77e-8be8-4318-a713-0d46f44210b6", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 10:45", "url": "https://www.ksmu.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "ksmu.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "204e85ab-c631-404a-afa9-d2df5eb0e2a7", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 14:00", "url": "https://www.whro.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "whro.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "a0aba0b5-9cc1-437a-9362-fc3403f21368", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 16:15", "url": "https://www.publicradiotulsa.org/npr-national-news/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "publicradiotulsa.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "72ee46a0-4053-4f3d-9075-171628ba1598", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 12:15", "url": "https://www.wyomingpublicmedia.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "wyomingpublicmedia.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "2605215e-4cf9-41c8-a7bd-611254a89446", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 15:30", "url": "https://www.kvpr.org/npr-news/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "kvpr.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "af1f520c-78a8-47e9-bcd6-c86d842ad6d8", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 12:00", "url": "https://kansaspublicradio.org/npr-news/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "kansaspublicradio.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "8a507a01-fe00-45c4-af4a-42d10d92c9b9", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 13:45", "url": "https://www.kmuw.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "kmuw.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "426a441e-38fd-4f1c-b089-8a2f4f846f20", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 12:15", "url": "https://www.ijpr.org/npr-news/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "ijpr.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "2215a27f-f375-4f7e-9c64-7dfd5a2d3196", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 12:15", "url": "https://www.kios.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "kios.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "273e334c-b02f-4bb3-9cef-9a6348fe1caa", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 11:15", "url": "https://www.wcsufm.org/latest-from-npr/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "wcsufm.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "71fcfe2a-d97b-4ecd-8be1-bd0270e6490c", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-07-31 22:15", "url": "https://radio.wpsu.org/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "radio.wpsu.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "0b385751-dcc5-4971-859a-8a3fa092d906", "title": "  A moving monster : How did the Jasper wildfire become so vicious , so fast ? ", "date": "2024-07-31 16:45", "url": "https://globalnews.ca/news/10670403/jasper-alberta-wildfire-conditions-response-experts/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\n4:13 Jasper wildfire: 30-50% of structures damagedQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nAnd there’s finite resources.”Story continues below advertisement2:08 Jasper wildfire: How did mountain pine beetles play a role?\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "3aa71558-9b23-4d45-971d-ee7c092ba545", "title": "Light earthquake , 4 . 5 mag strikes near Hicks Bay in New Zealand", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-5-mag-strikes-near-hicks-bay-in-new-zealand/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 103 km NNW of Hicks Bay, New Zealand (64 miles) on Saturday.\nThe 4.5-magnitude earthquake was detected at 01:53:34 / 1:53 am (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact time and date of earthquake 27/07/24 / 2024-07-27 01:53:34 / July 27, 2024 @ 1:53 am UTC/GMT.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 103 km NNW of Hicks Bay, New Zealand."}, {"id": "d4ffabe7-621e-4d00-8342-6f0e553a5d21", "title": "Light earthquake , 4 . 1 mag was detected near Ust - Kamchatsk Staryy in Russia", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-1-mag-was-detected-near-ust-kamchatsk-staryy-in-russia-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) strikes 72 km S of Ust’-Kamchatsk Staryy, Russia (45 miles) on Thursday.\nExact location of earthquake, 162.6077° East, 55.5809° North, depth 60.774 km.\nExact time and date of earthquake 04/07/24 / 2024-07-04 11:01:36 / July 4, 2024 @ 11:01 am UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 72 km S of Ust’-Kamchatsk Staryy, Russia."}, {"id": "a0817ea3-b90c-4c74-9ecf-573e81a14b19", "title": "Light earthquake 4 . 8 mag , Banda Sea", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/30/light-earthquake-4-8-mag-banda-sea/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.8 (ml/mb) was reported Banda Sea (0 miles) on Tuesday.\nId of earthquake: us6000ngzx.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIn the past 24 hours, there have been one, in the last 10 days three, in the past 30 days eight and in the last 365 days thirty-five earthquakes of magnitude 3.0 or greater that have been detected nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Banda Sea."}, {"id": "17f4a08e-a82e-4643-a752-d08a037391ac", "title": "Light earthquake , 4 . 5 mag was detected near South Sandwich Islands region", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-5-mag-was-detected-near-south-sandwich-islands-region-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes South Sandwich Islands region (0 miles) on Thursday.\nDate and time of earthquake in UTC/GMT: 18/07/24 / 2024-07-18 02:54:55 / July 18, 2024 @ 2:54 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: South Sandwich Islands region."}, {"id": "d46e2608-1d7d-425d-897b-7c5a53a0df16", "title": "Light earthquake : M4 . 3 quake has struck near Lae in Papua New Guinea", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/30/light-earthquake-m4-3-quake-has-struck-near-lae-in-papua-new-guinea-8/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Thursday, 56 kilometers (35 miles) from Lae in Papua New Guinea.\nThe earthquake occurred at a depth of 56.852 km (35 miles) below the earth’s surface.\nEpicenter of the earthquake was 56 km (35 miles) from Lae (c. 76 300 pop).\nClose country/countries, Papua New Guinea (c. 6 065 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 56 km NNW of Lae, Papua New Guinea."}, {"id": "eec1e316-d7d9-41e2-8c0a-a63c91bf41e1", "title": "Light earthquake : M4 . 3 quake has struck near Masamba in Indonesia", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-m4-3-quake-has-struck-near-masamba-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Monday, 76 kilometers (47 miles) from Masamba in Indonesia.\nEvent ids that are associated to the earthquake: us7000mxtj.\nId of event: us7000mxtj.\nEpicenter of the earthquake was 87 km (54 miles) from Poso (c. 47 100 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 76 km NE of Masamba, Indonesia."}, {"id": "9810636d-0563-46b8-98fd-626b3149a676", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 18:15", "url": "https://www.cbc.ca/news/canada/nova-scotia/sahara-desert-sand-causing-hurricane-season-lull-1.7280954", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nAnd the strong winds that carry the layer along causes wind shear, which can tear storms apart.\nHurricane activity will returnFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "6ff91cc2-f187-4b85-ba03-dae6f643aa12", "title": "Storm tracker : NHC continuing to track system that could become Tropical Storm Debby", "date": "2024-07-31 11:45", "url": "https://www.aol.com/storm-tracker-nhc-continuing-track-105512906.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is tracking a \"large tropical wave\" in the Atlantic Ocean that could develop into Tropical Storm Debby later this week or over the weekend, potentially near Florida or the Southeast U.S.\nIf its winds reach 39 mph, the system would receive the name Tropical Storm Debby, and it would be the fourth named storm of what's predicted to be an extremely active 2024 Atlantic hurricane season.\nThe National Hurricane Center is tracking a \"large tropical wave\" in the Atlantic Ocean that could develop into Tropical Storm Debby later this week.\nAtlantic storm trackerIf the map above is not loading on your screen, click here.\nThis article originally appeared on USA TODAY: NHC tracking system that could become Tropical Storm Debby"}, {"id": "011e72f0-5da0-43ab-a5fe-20db8815f560", "title": "Weak infrastructure , distrust make communication during natural disasters hard on rural Texas", "date": "2024-07-31 11:00", "url": "https://www.yahoo.com/news/weak-infrastructure-distrust-communication-during-100000716.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rural communities, especially in East Texas, start from a deficit.\nMost residents in Deep East Texas, which includes Polk County and Livingston, should receive alerts through the Genasys Mass Notification System operated by the Deep East Texas Council of Governments, a coalition of local governments.\nPolk County parlayed a grant to multiple telecommunications providers to expand broadband to the entirety of Polk County.\n“We have a lot of people that follow our Facebook page that are from San Jacinto County, Tyler County and Trinity County,” Murphy said.\nFollowing Beryl, they learned quickly about the Polk County cooling stations, what help the state was sending and where to pick up MREs."}, {"id": "a39dce81-4289-460c-be7f-c53867272ca7", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 23:15", "url": "https://www.wsbradio.com/news/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "fb6c6d9d-00bf-474d-8937-ee3894c8aae1", "title": "Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-07-31 18:00", "url": "https://www.independent.co.uk/news/vermont-ap-dartmouth-college-national-weather-service-burlington-b2589077.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Vermont is flooding.\nClimate change warming the atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms."}, {"id": "50fbe543-7b8c-4b61-9a34-a7850c90ae92", "title": "Light earthquake 4 . 1 mag , Izu Islands , Japan region", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-1-mag-izu-islands-japan-region-11/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.1 (ml/mb) was reported Izu Islands, Japan region (0 miles) on Saturday.\nEvent id: us6000ngaf.\nIds that are associated to the earthquake: us6000ngaf.\nThe epicenter of the earthquake was roughly 420.193 km (261 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Izu Islands, Japan region."}, {"id": "afdb74fb-f6fa-4da4-b978-b62134f63832", "title": "Light earthquake , 4 mag was detected near Finschhafen in Papua New Guinea", "date": "2024-07-31 09:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-mag-was-detected-near-finschhafen-in-papua-new-guinea-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has struck on Wednesday, 24 km E of Finschhafen, Papua New Guinea (15 miles).\nIds that are associated to the event: us6000ngpc.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 47.92 km (30 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 24 km E of Finschhafen, Papua New Guinea."}, {"id": "ec345881-ba85-4133-8bc4-18f98a7431e7", "title": "Moderate earthquake , 5 . 1 mag was detected near the Kermadec Islands", "date": "2024-07-31 19:00", "url": "https://www.earthquakenewstoday.com/2024/07/31/moderate-earthquake-5-1-mag-was-detected-near-the-kermadec-islands-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake magnitude 5.1 (ml/mb) has occurred on Wednesday, south of the Kermadec Islands (0 miles).\nIds that are associated to the event: us6000nh47.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: south of the Kermadec Islands."}, {"id": "f45d7b4f-007e-4b85-830f-962180b73745", "title": "Light earthquake , 4 . 3 mag was detected near Sarabetsu in Japan", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-3-mag-was-detected-near-sarabetsu-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 20 kilometers (12 miles) from Sarabetsu in Japan on Saturday.\nId of earthquake: us6000ngdz.\nThe earthquake occurred at a depth of 106.851 km (66 miles).\nEpicenter of the earthquake was 25 km (15 miles) from Obihiro (c. 173 900 pop), 31 km (19 miles) from Otofuke (c. 40 900 pop), 81 km (50 miles) from Shimo-furano (c. 25 900 pop), 70 km (43 miles) from Shizunai-furukawachō (c. 22 400 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 20 km NW of Sarabetsu, Japan."}, {"id": "0137ce52-9267-4965-b56e-7e38878901a1", "title": "Light earthquake , 4 . 4 mag strikes near Tobelo in Indonesia", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-4-mag-strikes-near-tobelo-in-indonesia-23/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 35 kilometers (22 miles) from Tobelo in Indonesia on Thursday.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nNearby country/countries, Indonesia (c. 242 968 000 pop) (That might be effected).\nEpicenter of the event was 92 km (57 miles) from Ternate (c. 101 700 pop), 92 km (57 miles) from Sofifi (c. 36 200 pop), 36 km (22 miles) from Tobelo (c. 10 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 35 km SW of Tobelo, Indonesia."}, {"id": "21002197-d127-434d-938d-9e4184015de1", "title": "Light earthquake : M4 . 1 quake has struck near Kirensk in Russia", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-m4-1-quake-has-struck-near-kirensk-in-russia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) has struck on Thursday, 91 kilometers (57 miles) from Kirensk in Russia.\nExact location of earthquake, 108.708° East, 57.032° North, depth 10 km.\nThe epicenter was at a depth of 10 km (6 miles).\nEarthquake epicenter was 91 km (57 miles) from Kirensk (c. 13 300 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 91 km SSE of Kirensk, Russia."}, {"id": "10417cde-cc91-4ff7-9c3d-b5deac7e6fb7", "title": "Light earthquake : M4 . 3 quake has struck near Puerto Madero in Mexico", "date": "2024-07-31 14:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-m4-3-quake-has-struck-near-puerto-madero-in-mexico-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Wednesday, 88 kilometers (55 miles) from Puerto Madero in Mexico.\nAll ids that are associated to the event: us6000nh2h.\nClosest city/cities or villages, with min 5000 pop, to hypocenter/epicentrum was Puerto Madero.\nEvent epicenter was 88 km (55 miles) from Puerto Madero (c. 9 700 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 88 km SW of Puerto Madero, Mexico."}, {"id": "3236b82e-fd17-4084-87c8-12c8ed09d77d", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 09:45", "url": "https://www.timescolonist.com/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291867", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "35801cb6-4bf7-4bbc-a5dc-fa607e132b56", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away | iNFOnews", "date": "2024-07-31 11:45", "url": "https://infotel.ca/newsitem/us-vermont-flooding/cp238326860", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Governor calls on flood-weary Vermonters to 'stick together' with more thunderstorms on the horizonTrees sit across a roadway destroyed by flash floods in Lyndonville, Vt., Wednesday, July 31, 2024.\nParts of the state hit by flooding Monday night and Tuesday are bracing again as a new round of severe thunderstorms moves through the region.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "2ca96677-1e48-4cbe-b1ac-34a15378f79c", "title": "Hurricane Preparedness Forum in Avon , NWS expects above average storm season", "date": "2024-07-31 05:00", "url": "https://www.wtkr.com/news/in-the-community/outer-banks/hurricane-preparedness-forum-held-in-avon-nws-expects-above-average-storm-season", "domain": "wtkr.com", "domain_classification": "Unknown", "message": "HATTERAS VILLAGE, NC — Hurricanes are nothing new for Outer Banks residents, but the National Weather Service is expecting an above average storm season and with the Dare County Department of Emergency Management, are hosting Hurricane Preparedness Forums around OBX.\nWatch: NWS hurricane preparedness forums coming to the Outer BanksHow the Outer Banks prepares for hurricanesMore than 30 Hatteras residents piled into the Avon Volunteer Fire Department for the forum Tuesday afternoon.\nHurricane season is every year from May to October, but the peak of it is usually in September.\nWatch: Outer Banks prepares for weekend's coastal storm impactOuter Banks prepares for weekend's coastal storm impactOne resident attending has been coming to the Outer Banks for decades, but just moved here full-time in 2023.\nThe next Hurricane Preparedness Forum will be held in-person and online at the Dare County Emergency Operations Center in Manteo on Wednesday from 10 a.m. to 11:30 a.m."}, {"id": "f9a336b6-feb6-4e46-b184-632000d02b17", "title": "Guest commenatry : Galveston , can we talk a bit about hurricanes ? ", "date": "2024-07-31 06:45", "url": "https://www.galvnews.com/opinion/guest_columns/guest-commenatry-galveston-can-we-talk-a-bit-about-hurricanes/article_1b92035b-5860-5241-95f3-ec480e6a2875.html", "domain": "galvnews.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "9c34bace-e0c4-47cd-8dd8-ae874806d08c", "title": "Tropical Wave In Atlantic May Strengthen Into Storm , Poses Threat To US Coastlines - Generac Hldgs ( NYSE : GNRC ), Home Depot ( NYSE : HD ) ", "date": "2024-07-31 20:15", "url": "https://www.benzinga.com/news/24/07/40078321/tropical-wave-in-atlantic-may-strengthen-into-storm-poses-threat-to-us-coastlines", "domain": "benzinga.com", "domain_classification": "Unknown", "message": "The storm is “relatively dormant or poorly organized” as a tropical wave, but it may strengthen as it approaches Florida, AccuWeather reported.\nA tropical wave is a low-pressure area that moves from the Indian Ocean across Africa to the Atlantic Ocean and sometimes develops into a tropical depression, tropical storm or hurricane.\nRead Also: Hurricane Beryl Expected To Weaken To Tropical Storm As It Hits Texas“The tropical wave is currently battling a harsh environment in a sea of dry air as it moves west across the Atlantic.\nThe tropical wave is expected to strengthen into tropical rainstorm after meeting with “another ripple in the atmosphere,” AccuWeather said, but it is unknown exactly when and where that will happen.\nBut if the storm tracks over the big islands, it may be more of a problem for the U.S. Gulf Coast later on, according to AccuWeather."}, {"id": "bc040257-665a-4579-a939-a9572295bc9b", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 09:45", "url": "https://www.delta-optimist.com/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291862", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "eb06c38f-4721-4916-b6b4-f9e4ea2f7e7d", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 09:30", "url": "https://www.fitzhugh.ca/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291852", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "8b5a01d2-c1e5-4cda-bfea-4be0f9bd37fa", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 09:30", "url": "https://www.tricitynews.com/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291862", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "0b3e94d3-3863-4ee0-9ec7-ac5184610be7", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 10:30", "url": "https://www.thompsoncitizen.net/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291862", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "bb7aeb76-64a3-4779-b351-6a168fd9956f", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 11:15", "url": "https://www.coastreporter.net/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291862", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed to bring you up to speed...\nHere is a roundup of stories from The Canadian Press designed to bring you up to speed...Jasper's small businesses brace for challenges after wildfiresJasper's small business community is facing a difficult road ahead as it grapples with the destruction and loss of visitors caused by recent wildfires.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nThis report by The Canadian Press was first published July 31, 2024.\nThe Canadian Press"}, {"id": "6a0e2fce-bd05-4744-9b90-f3b6fc9e39eb", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 11:30", "url": "https://www.airdriecityview.com/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291852", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "While Kliewer has business interruption insurance, she says it only covers a few weeks of lost revenue.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nHere's what else we're watching...StatCan to release May GDP figures todayStatistics Canada will release its May gross domestic product report this morning.\nThe federal agency will also publish an estimate for economic growth in the second quarter today.\nThe defence has argued the two went to Coutts to make a statement that individual freedoms must be protected."}, {"id": "e805bafe-ad5c-40ba-83bd-2a4a17e3d2c9", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 21:30", "url": "https://local12.com/news/nation-world/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "local12.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "a07239e1-b514-4cb6-93ba-bebb752e8412", "title": "Light earthquake : M4 . 4 quake has struck near Farkhār in Afghanistan", "date": "2024-07-31 04:15", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-m4-4-quake-has-struck-near-farkhar-in-afghanistan-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 13 kilometers (8 miles) from Farkhār in Afghanistan on Wednesday.\nId of earthquake: us6000nh0d.\nNearby country/countries that might be effected, Afghanistan (c. 29 121 000 pop).\nIn the past 24 hours, there have been one, in the last 10 days five, in the past 30 days nine and in the last 365 days thirty-four earthquakes of magnitude 3.0 or greater that have been detected nearby.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 13 km ESE of Farkhār, Afghanistan."}, {"id": "c1ec940b-1a01-4121-8781-2b916d2f7f7d", "title": "Light earthquake , 4 . 7 mag has occurred near Churubamba in Peru", "date": "2024-07-31 19:00", "url": "https://www.earthquakenewstoday.com/2024/07/31/light-earthquake-4-7-mag-has-occurred-near-churubamba-in-peru/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.7 (ml/mb) has struck on Wednesday, 65 kilometers (40 miles) from Churubamba in Peru.\nDate and time of earthquake in UTC/GMT: 31/07/24 / 2024-07-31 14:05:04 / July 31, 2024 @ 2:05 pm.\nThe epicenter was at a depth of 11.071 km (7 miles).\nEpicenter of the earthquake was 76 km (47 miles) from Huánuco (c. 148 000 pop), 84 km (52 miles) from Tingo María (c. 53 200 pop), 76 km (47 miles) from Oxapampa (c. 12 000 pop), 98 km (61 miles) from Villa Rica (c. 7 400 pop), 76 km (47 miles) from Ambo (c. 6 900 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 65 km E of Churubamba, Peru."}, {"id": "c8e3e478-c4ea-4de5-9ebf-5602f4268844", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 18:15", "url": "https://abc6onyourside.com/news/nation-world/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "3f2a161a-f37b-42ee-984f-54153c08490f", "title": "Sunnyside neighbors worried a construction home that began leaning after Hurricane Beryl could collapse and hurt someone", "date": "2024-07-31 23:15", "url": "https://abc13.com/post/sunnyside-neighbors-worried-construction-home-leaning-after-hurricane-beryl-collapse/15128381/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Sunnyside neighbors worried about home's wood frame leaning over after Beryl: 'It's an eyesore'Neighbors in Houston's Sunnyside neighborhood are having safety concerns about a construction home that began leaning after Hurricane Beryl.\nNeighbors in Houston's Sunnyside neighborhood are having safety concerns about a construction home that began leaning after Hurricane Beryl.\nNeighbors in Houston's Sunnyside neighborhood are having safety concerns about a construction home that began leaning after Hurricane Beryl.\nNeighbors in Houston's Sunnyside neighborhood are having safety concerns about a construction home that began leaning after Hurricane Beryl.\nHOUSTON, Texas (KTRK) -- More than three weeks after Hurricane Beryl hit Southeast Texas, the damage left behind by the storm still causes safety concerns for people living in Houston's Sunnyside neighborhood."}, {"id": "88f4bfe8-6eef-4b35-9424-13c4a9b87715", "title": "CenterPoint botched Hurricane Beryl response to get Texas House committee hearing Wednesday as lawmakers point at generator bill", "date": "2024-07-31 03:00", "url": "https://abc13.com/post/hurricane-beryl-centerpoint-energy-disaster-response-criticism-texas-senate-hearings-paul-bettencourt-carol-alvarado/15123940/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Texas lawmakers demand CenterPoint customers not pay $800M generator bill after fiery hearingTexas lawmakers grilling CenterPoint Energy about the company's response to Hurricane Beryl is only beginning with a House hearing due next.\nTexas lawmakers grilling CenterPoint Energy about the company's response to Hurricane Beryl is only beginning with a House hearing due next.\nTexas lawmakers grilling CenterPoint Energy about the company's response to Hurricane Beryl is only beginning with a House hearing due next.\nTexas lawmakers grilling CenterPoint Energy about the company's response to Hurricane Beryl is only beginning with a House hearing due next.\nHOUSTON, Texas (KTRK) -- After grilling CenterPoint's CEO, Texas lawmakers worried that not enough would be done to keep the lights on during this hurricane season."}, {"id": "32c3c2df-869a-4309-8f0c-0ce834bc6984", "title": "Weak infrastructure , distrust make communication during natural disasters hard on rural Texas", "date": "2024-07-31 20:15", "url": "https://dentonrc.com/news/state/weak-infrastructure-distrust-make-communication-during-natural-disasters-hard-on-rural-texas/article_51595a8a-4f58-11ef-8d44-df76e657d3b8.html", "domain": "dentonrc.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "63a814d3-b5e5-4fdc-a119-aaa0053bb9d0", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 18:15", "url": "https://fox11online.com/news/nation-world/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "2ab062b4-28cc-4bca-a14e-e3538a0b6cca", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 09:45", "url": "https://lethbridgeherald.com/news/national-news/2024/07/31/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "In the news today: Rocky road ahead for Jasper’s small businessesBy The Canadian Press on July 31, 2024.\nThe business community of Jasper - a town whose economy depends on tourism, particularly the crucial summer season - is facing an overwhelming challenge in the months ahead.\nTHE CANADIAN PRESS/Amber BrackenHere is a roundup of stories from The Canadian Press designed to bring you up to speed…Jasper’s fire-affected small businesses face rocky road aheadJasper’s small business community is facing a difficult road ahead.\nThe Transportation Safety Board will release its report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia’s coast.\nSahara sands causing lull in hurricane seasonScientists say tiny grains of sand from the Sahara Desert are responsible for the almost month-long lull in this year’s Atlantic hurricane season."}, {"id": "90a45a76-1000-4884-a5a6-f5ca401a25d7", "title": "In the news today : Rocky road ahead for Jasper small businesses", "date": "2024-07-31 12:15", "url": "https://www.stalbertgazette.com/national-news/in-the-news-today-rocky-road-ahead-for-jaspers-small-businesses-9291852", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "While Kliewer has business interruption insurance, she says it only covers a few weeks of lost revenue.\nThe Transportation Safety Board will release a report today on the fire and loss of more than 100 containers from a cargo ship off British Columbia's coast.\nHere's what else we're watching...StatCan to release May GDP figures todayStatistics Canada will release its May gross domestic product report this morning.\nThe federal agency will also publish an estimate for economic growth in the second quarter today.\nThe defence has argued the two went to Coutts to make a statement that individual freedoms must be protected."}, {"id": "30d33086-5de8-45eb-b77d-c5bbf932c529", "title": "Valley News - Heavy rain in northern Vermont leads to washed out roads and rescues", "date": "2024-07-31 01:00", "url": "https://www.vnews.com/Heavy-rain-in-northern-Vermont-leads-to-washed-out-roads-and-rescues-56267260", "domain": "vnews.com", "domain_classification": "Unknown", "message": "The fresh flooding yielded similar scenes of catastrophe to the flooding weeks earlier, but on a smaller scale.\nMost of the rain fell in the Lyndon and Lyndonville areas, and in St. Johnsbury, about 10 miles (16 kilometers) south.\nAt least 5 inches (12.7 centimeters) of rain fell farther north in area of Morgan, which is near the Canada border.\nWe can’t go anywhere.”The state experienced major flooding earlier in July from the tail end of Hurricane Beryl.\n“The last storm was a wake-up call,” he said of the flooding earlier this month."}, {"id": "b66c713e-fdcb-4947-bcb9-1438f1bdb642", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 18:15", "url": "https://khqa.com/news/nation-world/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "khqa.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "f8556fb7-18de-4903-aac8-5eebf6399077", "title": "Non - Shocking Update For Western Montana Bitterroot River", "date": "2024-07-31 21:30", "url": "https://kyssfm.com/update-for-western-montanas-bitterroot-river/", "domain": "kyssfm.com", "domain_classification": "Unknown", "message": "If anything should close a portion of a river to the public, that's probably as good of an example as any.\nClark Fork and Blackfoot River closures were lifted earlier this week.\nThe July 24 severe thunderstorm in the Missoula area caused extensive damage to power lines, trees, and property in the west-central Montana area.\nThe Aftermath of the Severe Thunderstorm in Missoula, Montana - July 2024 The National Weather Service cited 80 mph winds at the Missoula Montana Airport and over 100 mph winds at the apex of Mount Sentinel.\nPowerful winds left behind a path of broken trees, downed power lines, failing traffic lights, and debris as far as the eye can see."}, {"id": "87059c98-15a6-4682-9a70-e4f6574e526d", "title": "Hurricane center ups chances to 60 % tropical system could form , threaten Florida", "date": "2024-07-31 00:00", "url": "https://www.yahoo.com/news/hurricane-center-ups-chances-60-231500907.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ORLANDO, Fla. — The National Hurricane Center increased the odds a system developing in the Atlantic could turn into the season’s next tropical depression or storm with a projected path that could threaten Florida.\n“There is some potential for a tropical depression to form late this week in the vicinity of the Bahamas.”The NHC’s wide swath of the system’s potential path shifted north and farther east since Monday but all of Florida’s peninsula remains in the potential path.\nThe season so far saw the early formation of Hurricane Beryl, which cut a deadly path from the Caribbean into Mexico and into Texas.\nThe height of hurricane season runs from mid-August into October.\nHurricane season officially runs from June 1-Nov. 30."}, {"id": "96477d94-263e-4260-9cd3-47bf3fc03250", "title": "CenterPoint wants $1 billion - plus Hurricane Beryl recovery costs to be covered by Houston - area customers – Houston Public Media", "date": "2024-07-31 00:30", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/07/30/495218/centerpoint-hurricane-beryl-costs-houston-customers/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "CenterPoint EnergyIt took a matter of hours, maybe even minutes, for Hurricane Beryl to knock out electricity for more than 2.2 million customers in the Houston region.\nCenterPoint CEO Jason Wells acknowledged during a special Texas Senate committee hearing Monday that the utility company plans to pass its recovery costs onto its 2.8 million customers in the Houston area.\nState Sen. Carol Alvarado, a Houston Democrat, asked Wells whether CenterPoint would ask for a rate increase to recoup its storm recovery costs.\nCenterPoint intends to increase their rates to recoup the cost of recovering from Hurricane Beryl, passing the cost on to the customer.\nTexas also needs a better system for allowing utility companies to recoup their infrastructure and storm recovery costs, that do not correlate to increased costs for customers, according to Haverlah."}, {"id": "b129822f-4a12-4100-8f65-5957c8c876dd", "title": "Houston area Hurricane Beryl death toll spikes to 36 , at least one other death pending – Houston Public Media", "date": "2024-07-31 00:30", "url": "https://www.houstonpublicmedia.org/articles/news/hurricane/2024/07/30/495226/houston-area-hurricane-beryl-death-toll-spikes-to-36-at-least-one-other-death-pending/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "David SmithThe Hurricane Beryl death toll has spiked to at least 36 people around Houston, including a 5-year-old who drowned in a hurricane-swollen bayou in Fort Bend County, officials said.\nBrazoria County officials still could not confirm hurricane-related deaths on Tuesday, but medical officials contracted by the county said a report is pending to determine at least one potential death attributed to the hurricane.\nAt least eight people in Harris County died from hyperthermia because of power loss several days after the hurricane.\nRELATED: Hurricane Beryl caused at least 22 Houston-area deaths, with more than half power outage-relatedMontgomery County has reported at least three deaths related to the hurricane.\nGalveston County reported five, and Matagorda County reported one death."}, {"id": "29a766d4-2d1a-4820-b849-cc27a4be4687", "title": "Tropical Storm Carlotta has formed in the eastern Pacific , forecasters say", "date": "2024-07-31 23:15", "url": "https://article.wn.com/view/2024/07/31/Tropical_Storm_Carlotta_has_formed_in_the_eastern_Pacific_fo/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Tropical Storm Carlotta has formed in the eastern Pacific, but is moving away from Mexico.\nThe National Hurricane Center in Miami says in an advisory that a... read full story"}, {"id": "de75d57d-4c6c-46c1-9816-462178697197", "title": "Severe storms in the Southeast US leave 1 dead and cause widespread power outages", "date": "2024-07-31 17:30", "url": "https://isp.netscape.com/news/story/0001/20240731/19b7d72b8c2c91e07c0b96d8aed029bd", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Severe storms in the Southeast US leave 1 dead and cause widespread power outagesCANTON, Ga. (AP) — A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nRepeated heavy rains and thunderstorms also have struck parts of the Southeast over the last week."}, {"id": "ed2bc5b7-265a-4dc6-9532-d94b0f74740b", "title": "You cant escape climate change , but in some areas , risk is lower – Greeley Tribune", "date": "2024-07-31 01:00", "url": "https://www.greeleytribune.com/2024/07/30/you-cant-escape-climate-change-but-in-some-areas-risk-is-lower/", "domain": "greeleytribune.com", "domain_classification": "Unknown", "message": "While there is no place on Earth that is immune to the impact of climate change, some places are less exposed to risk than others.\nNote also that FEMA’s ratings consider not only the kinds of events that can be worsened by climate change (floods, droughts, wildfires, storms), but also natural hazards that aren’t affected by climate change, like earthquakes and volcanoes.\nWhat midsize counties have the lowest climate change risks?\nWhat most populated counties have the lowest climate change risks?\nThe article You Can’t Escape Climate Change, but in Some Areas, Risk Is Lower originally appeared on NerdWallet."}, {"id": "ed886110-f0bd-4b2a-b22d-e144240b4d4c", "title": "You cant escape climate change , but in some areas , risk is lower – The Mercury", "date": "2024-07-31 00:45", "url": "https://www.pottsmerc.com/2024/07/30/you-cant-escape-climate-change-but-in-some-areas-risk-is-lower/", "domain": "pottsmerc.com", "domain_classification": "Unknown", "message": "While there is no place on Earth that is immune to the impact of climate change, some places are less exposed to risk than others.\nNote also that FEMA’s ratings consider not only the kinds of events that can be worsened by climate change (floods, droughts, wildfires, storms), but also natural hazards that aren’t affected by climate change, like earthquakes and volcanoes.\nWhat midsize counties have the lowest climate change risks?\nWhat most populated counties have the lowest climate change risks?\nThe article You Can’t Escape Climate Change, but in Some Areas, Risk Is Lower originally appeared on NerdWallet."}, {"id": "2ec92b2d-eba8-44d3-a4b8-ae924945602c", "title": "You cant escape climate change , but in some areas , risk is lower – thereporteronline", "date": "2024-07-31 00:30", "url": "https://www.thereporteronline.com/2024/07/30/you-cant-escape-climate-change-but-in-some-areas-risk-is-lower/", "domain": "thereporteronline.com", "domain_classification": "Unknown", "message": "To place an obituary Monday through Friday, 8:30am to 3:00pm, please email obits@thereporteronline.com or call us at 610-235-2690 for further information.\nSaturday & Sunday, please contact obits@thereporteronline.com"}, {"id": "6fef448c-00a2-4530-bf85-1d364f37fd75", "title": "  It makes absolutely no sense : Man with mold in condo denied Ian recovery help by county", "date": "2024-07-31 09:45", "url": "https://www.yahoo.com/news/makes-absolutely-no-sense-man-090127389.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "'It makes absolutely no sense': Man with mold in condo denied Ian recovery help by countyIt has been nearly two years since Hurricane Ian hit Volusia County, and Robert Arnold is among the property owners still living with the impacts of the flooding.\nArnold turned to the Volusia County government for help through its Transform386 Hurricane Ian recovery effort but was denied.\nWho does the county's Hurricane Ian recovery plan help?\nWhen Hurricane Ian came through, it brought with it nine inches of flooding inside Arnold's condo.\nThis article originally appeared on The Daytona Beach News-Journal: Daytona man with Hurricane Ian damage denied help from county"}, {"id": "a45b5b56-f1f3-4e6b-8063-c2f9150aefdd", "title": "More flooding hits Vermont with washed - out roads , smashed vehicles and destroyed homes", "date": "2024-07-31 00:30", "url": "https://www.wgauradio.com/news/national/more-flooding-hits/7XVGBVDNIRE5DGPYHYRXCKZX2Y/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "91eb057c-a19c-4d00-915d-f3d23df68a60", "title": "Foster + Partners unveils plan for rebuilding Antakya post - earthquake", "date": "2024-07-31 14:00", "url": "https://www.dezeen.com/2024/07/31/antakya-masterplan-hatay-turkey-foster-and-partners/", "domain": "dezeen.com", "domain_classification": "Unknown", "message": "British architecture studio Foster + Partners has revealed its masterplan to rebuild Antakya, Turkey, following the Turkey-Syria earthquakes last year.\nAccording to Foster + Partners, around 80 per cent of the buildings in Antakya were damaged in the earthquake.\n\"Before the earthquake, the city of Antakya faced some challenges that we aim to address during the sustainable reconstruction,\" said Foster + Partners partner Loukia Iliopoulou.\nFoster + Partners plans to begin rebuilding in one area of Antakya, starting with building the high streets to establish homes near places of employment.\nThe images are by Foster + Partners."}, {"id": "a107058e-d338-4c76-8649-625ca7dabbe2", "title": "Post - storm rebuilding costs could be issue for working - class Florida residents", "date": "2024-07-31 15:00", "url": "https://news.wgcu.org/top-story/2024-07-31/post-storm-rebuilding-costs-could-be-issue-for-working-class-florida-residents", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "As the Atlantic Ocean shows signs of heating up, potentially fueling damaging hurricanes, a former state and national disaster chief warned Tuesday of working-class Floridians being priced out of communities in post-storm rebuilding.\n“I don't think it's going to slow down rebuilding, because it's not really slowing things down in Fort Myers,” Fugate said, referring to rebuilding after Hurricane Ian slammed into the Fort Myers area in 2022.\n“They're actually taking very smart, appropriate steps to address the issue of changing climate events,” Fugate said.\nWhile it had not forecast rapid intensification, the hurricane center put Florida in the potential path of the system.\nThe chance of formation over the next week was upped from 50 percent on Monday to 60 percent Tuesday morning."}, {"id": "76274392-ec76-41c3-a2f2-64e8bbb495c3", "title": "SGU Students Aid in Grenada Relief Efforts Following Hurricane Beryl", "date": "2024-07-31 22:15", "url": "https://www.sgu.edu/news-and-events/sgu-students-aid-in-grenadas-relief-efforts-following-hurricane-beryl/", "domain": "sgu.edu", "domain_classification": "Unknown", "message": "In the wake of the destruction to Grenada caused by Hurricane Beryl, St. George’s University students stepped up to aid in the island’s recovery from the storm.\n“By responding so quickly to this urgent need, they have been instrumental in Hurricane Beryl relief efforts and giving back to Grenada.\nSGU volunteers in CarriacouAs a proud Grenadian and aspiring veterinarian at SGU, Cédric Verdier was eager to be a part of a six-member team made up of current SGU students and alumni who volunteered in Carriacou.\nIn addition to coordinating the SGU Student Relief Aid Drives, Andres created an SGA GoFundMe page, which has raised over US$12,000 to be used as part of the NaDMA disaster relief efforts.\nSeeing people come together to donate, plan, and give their time for this island has been nothing short of amazing.”Want to get involved with hurricane relief efforts?"}, {"id": "3d3ce99a-f979-4ed8-b2a2-d939b8f3aaaf", "title": "Severe thunderstorm warning issued for Omaha metro area", "date": "2024-07-31 23:15", "url": "https://omaha.com/news/local/weather/severe-thunderstorm-warning-issued-for-omaha-metro-area/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "7642f2ac-c7e5-453d-a6dc-6a93a0cb1557", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 04:30", "url": "https://www.mymotherlode.com/news/national/3400022/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Governor calls on flood-weary Vermonters to ‘stick together’ with more thunderstorms on the horizonGovernor calls on flood-weary Vermonters to ‘stick together’ with more thunderstorms on the horizon View PhotoLYNDON, Vt. (AP) — Vermont’s governor said Wednesday that the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he called on residents to “stick together” amid fears that more bad weather was on its way.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nWeeks after Lyndonville resident Jason Pilbin watched a driver get swept away by floodwaters, his community was ravaged again.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "6e5b7ba9-df70-4ac1-8f7a-bdf215a18a7b", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 04:30", "url": "https://toronto.citynews.ca/2024/07/31/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nIn May, Vermont became the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by extreme weather fanned by climate change.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "c1309e1c-4ccd-410d-aaf3-ec732f3f2a9b", "title": "Losses from storm risks could cut into Florida state reinsurer funds – Moody ", "date": "2024-07-31 14:45", "url": "https://www.insurancebusinessmag.com/us/news/reinsurance/losses-from-storm-risks-could-cut-into-florida-state-reinsurers-funds--moodys-499485.aspx", "domain": "insurancebusinessmag.com", "domain_classification": "Unknown", "message": "Moody's placed the ratings of the FHCF, Citizens Property Insurance Corporation, and the Florida Insurance Guaranty Association under review for a possible upgrade.\nThis review reflects the close financial and governance ties between these entities and the state of Florida."}, {"id": "850918d8-8eba-494b-965f-2e035a5b4fb2", "title": "Tiger Bay Q & A with Craig Fugate , Florida Master of Disasters , Waffle House Index inventor", "date": "2024-07-31 10:30", "url": "https://www.yahoo.com/news/tiger-bay-q-craig-fugate-090944464.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "That's when he developed the “Waffle House index.\"\nCraig Fugate, former director of the Division of Florida Emergency Management and administrator for the Federal Emergency Management Agency, jokes with reporters after speaking at Capital Tiger Bay, July 30, 2024.\nColumn by Craig Fugate: Bold, creative solutions needed in the Panhandle after Hurricane Michael (from 2019)It takes three things to close a Waffle House, Fugate explained.\nPeople have actually written papers on the logistics of getting a Waffle House open,\" Fugate said.\nThis article originally appeared on Tallahassee Democrat: Former FEMA head Fugate on 'Waffle House index' at Capital Tiger Bay"}, {"id": "6e35ac81-295f-4fe5-a175-84111fc26ddf", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 18:00", "url": "https://www.woonsocketcall.com/news/national_and_world_news/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_df881aa6-eca1-5d1e-8514-363076405234.html", "domain": "woonsocketcall.com", "domain_classification": "Unknown", "message": "Governor calls on flood-weary Vermonters to 'stick together' with more thunderstorms on the horizonVermont’s governor says the latest storm to the hit the state was “much worse than a punch or a kick,” and he is calling on residents to “stick together” with another round of bad weather on its way"}, {"id": "197b788e-8331-46cf-9c9f-30e933dd5446", "title": "Governor signs bill allocating $100M to Ruidoso wildfire recovery", "date": "2024-07-31 03:30", "url": "https://www.yahoo.com/news/governor-signs-bill-allocating-100m-005436348.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SANTA FE, N.M. (KRQE) – Governor Michelle Lujan Grisham has signed the only legislation to come out of her recent special session.\nThe bill, passed by lawmakers earlier this month, puts $100 million toward the wildfire response in the Ruidoso area.\nNew Mexico lawmakers hear talk on AI technology, transparency measuresThe governor originally called the special session to address crime.\nAmid criticism from the governor’s fellow Democrats, lawmakers adjourned the session without taking up any issues besides the Ruidos disaster recovery.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "3a809d64-84bc-4370-8629-26ffab481ce6", "title": "NC county emergency services reminds folks to  plan  as chances up to 60 % for tropical development", "date": "2024-07-31 15:00", "url": "https://www.yahoo.com/news/nc-county-emergency-services-reminds-123834648.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NC county emergency services reminds folks to ‘plan’ as chances up to 60% for tropical developmentCLINTON, N.C. (WNCN) — One central North Carolina county is already encouraging residents to get ready as the chances for a tropical system developing increased again on Tuesday.\nSoon after that message went out, Sampson County Emergency Services forwarded it out on a social media post.\nThe Clinton Police Department also shared the social media post from emergency services.\nOfficials with the Sampson County Emergency Services are asking people to think about a plan for “you and your family” if the system heads to North Carolina.\nSampson County Emergency Services also encouraged residents to sign up for alerts from the county."}, {"id": "fbdbd763-729c-48d3-84db-ae0309d4fe2e", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 15:00", "url": "https://www.missioncityrecord.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "missioncityrecord.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "36b4eb03-0f0b-4584-afdb-10e85b7ce8cb", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 15:00", "url": "https://www.theprogress.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "theprogress.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "629604bb-4ad0-4992-9f48-23a6ca90b309", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 14:00", "url": "https://www.kimberleybulletin.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "kimberleybulletin.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "dfa14045-158b-4fed-84ac-1819641c9410", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:15", "url": "https://www.thefreepress.ca/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "thefreepress.ca", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "a0802e51-9aa2-4798-9996-2f84916c58b5", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:15", "url": "https://www.peacearchnews.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "peacearchnews.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "87187b3e-17f5-41b5-b66e-b614541cc7fc", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:15", "url": "https://www.interior-news.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "interior-news.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "31547f33-0ff9-4e8c-8b1f-200390cbff93", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 15:30", "url": "https://www.grandforksgazette.ca/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "grandforksgazette.ca", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "52d5259d-5ebf-4643-9896-00d928e0f129", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 11:45", "url": "https://www.sookenewsmirror.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "sookenewsmirror.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "31958957-dff0-40ee-96ee-37ad3b0c68f6", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:00", "url": "https://www.ladysmithchronicle.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "ladysmithchronicle.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "44191a23-274a-469b-87c6-8a1eb7976dff", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 14:15", "url": "https://www.vernonmorningstar.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "vernonmorningstar.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "09a87558-1378-4380-8e6b-b3be3fce8c0c", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:15", "url": "https://www.ominecaexpress.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "ominecaexpress.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "783f07d6-37b0-43a0-aca5-787c5c3fd4b7", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 12:15", "url": "https://www.wltribune.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "wltribune.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "3ca99c61-1012-495c-8929-a7de31044906", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 14:30", "url": "https://www.pqbnews.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "pqbnews.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "e2bba20f-f82f-4fa6-8a79-b21487bcb73f", "title": "Political Spin : Irresponsible forest management spawns catastrophic fires", "date": "2024-07-31 14:30", "url": "https://www.nanaimobulletin.com/community/political-spin-irresponsible-forest-management-spawns-catastrophic-fires-7463908", "domain": "nanaimobulletin.com", "domain_classification": "Unknown", "message": "A column by Bruce UzelmanJasper, Alberta is the latest community to experience catastrophic wildfire.\nForest management policies, beginning in the early 1900s, prioritized fire suppression to preserve valuable timber and reforestation with the most commercially valuable species, which were coniferous, particularly pine.\nThe disastrous fire at Jasper demonstrates the impact of past and present forest management.\nB.C.’s Forest Practices Board recommends “landscape forest management,” to provide protection against aggressive wildfire.\nRather, without extensive reform, Jasper is the first of many catastrophic wildfires that will befall Canada’s west in 2024 and beyond."}, {"id": "82db557a-20a4-411f-a1ad-d8f401072c55", "title": "BMKG : Magnitude 5 . 0 Earthquake Jolts Maluku , No Tsunami Threat", "date": "2024-07-31 03:15", "url": "https://en.tempo.co/read/1897824/bmkg-magnitude-5-0-earthquake-jolts-maluku-no-tsunami-threat", "domain": "en.tempo.co", "domain_classification": "Unknown", "message": "TEMPO.CO, Jakarta - Indonesia's Meteorology, Climatology, and Geophysics Agency (BMKG) reported that a magnitude 5.0 earthquake struck the east coast of Central Maluku on Wednesday, July 31, 2024, at 6:21 a.m. local time.\nThe source mechanism analysis shows that the quake had a strike-slip mechanism,” said Daryono, the agency’s head of the quake and tsunami center, on Wednesday, July 31.\nTremors were felt in Central and Southwest Maluku, reaching an intensity of III on the Modified Mercalli Intensity (MMI) scale.\nNo damages or casualties have been reported, and the BMKG has issued no tsunami warning.\nThe public is advised to remain calm, not be influenced by baseless issues, and avoid cracked or damaged buildings."}, {"id": "51c98a0c-08e2-4a2c-8e25-57d9e295fd9c", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 15:00", "url": "https://www.thesunchronicle.com/news/nation_world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/article_133e4194-fba2-595a-88dc-6bc888bea100.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Vermont man evacuates neighbors during flooding, weeks after witnessing a driver get swept awayWeeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community of Lyndonville was ravaged again by flooding from heavy rains Tuesday"}, {"id": "39072875-b89f-465d-88bb-7b6ca507903a", "title": "Vermont man evacuates neighbors during flooding , weeks after seeing driver get swept away", "date": "2024-07-31 15:30", "url": "https://wtov9.com/news/nation-world/vermont-man-evacuates-neighbors-during-flooding-weeks-after-seeing-driver-get-swept-away-rainwater-extreme-weather-thunderstorms-hurricane-beryl-rescues-forecast", "domain": "wtov9.com", "domain_classification": "Unknown", "message": "Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains.\nNearly three weeks ago, he watched helplessly as a man drowned after getting caught while driving through floodwaters from Hurricane Beryl.\nMore rain was forecast for central and northern Vermont on Wednesday, with the possibility of flash flooding.\nThe fresh flooding yielded similar scenes of catastrophe as the flooding weeks earlier in which two people died, but on a smaller scale.\nIt came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "5d44cab3-2247-49f5-a968-ec2155dc1eaa", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 11:45", "url": "https://lufkindailynews.com/anpa/us/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-driver-get-swept-away/article_c9e42a05-9491-55c2-9f55-dbad34429c67.html", "domain": "lufkindailynews.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "935da8c9-fc0d-4b3c-8b38-6ecbe9b7f54c", "title": "Vermont man evacuates neighbors during flooding , weeks after witnessing a driver get swept away", "date": "2024-07-31 13:45", "url": "https://www.krmg.com/news/national/vermont-man/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "82ffe6d8-d0fb-4488-95c2-7b740f7f3c8a", "title": "Vermont rain forecast calls for more showers , possible flooding", "date": "2024-07-31 16:45", "url": "https://www.bostonglobe.com/2024/07/31/metro/vermont-forecast-rain-flooding-thunderstorms/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Flash flooding is expected to be ongoing for urban areas, highways, streets, and other low-lying areas.\nAdvertisementA flash flood warning is in effect for parts of central and northeast Vermont until 10:30 p.m., including Saint Johnsbury.\nThe chance for flooding is mostly concentrated in Northern New England, although any storms today can produce torrential downpours leading to flash flooding across much of New England.\nThis map shows how much rain needs to fall in one hour to produce flash flooding.\nParts of northeast Vermont and New Hampshire may only need to see 1 inch an hour to get flash flooding."}, {"id": "1732ed46-43a7-4689-a2f9-7df1ebb6d67c", "title": "California Park Fire could burn for weeks or months", "date": "2024-07-31 03:30", "url": "https://www.wsws.org/en/articles/2024/07/31/cphr-j31.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Experts are warning that the Park Fire could continue to spread for weeks, if not months and has the potential to become the biggest California wildfire ever.\nJune was the 13th consecutive month to break a global heat record.\nSome areas of the burn had their single-hottest 30-day periods on record just before the Park Fire broke out.\nDavid Peterson, a meteorologist at the United States Naval Research Laboratory in Monterey, California told the Times that fire-generated storms will impede fire-fighting.\nThe exceptionally hot and dry conditions are making for a record wildfire season on the West Coast."}, {"id": "9c4e1137-40ff-4d6d-b14d-0093ff9834cf", "title": "CenterPoint wants customers to bail it out for Beryl failures", "date": "2024-07-31 18:30", "url": "http://www.houstonchronicle.com/opinion/letters/article/centerpoint-beryl-executives-project-2025-trump-19607284.php", "domain": "houstonchronicle.com", "domain_classification": "Unknown", "message": "CenterPoint Energy CEO Jason Wells, center, spoke with the Public Utilities Commission of Texas on July 25 about CenterPoint's response to Hurricane Beryl.\nJon Shapley/Staff photographerDon’t bail out CenterPointRegarding “Utility grilled on storm response” (July 30): It appears that CenterPoint is looking for the same deal the gas companies got to offset the cost of gas during Winter Storm Uri.\nThat deal allows gas utilities to charge customers approximately $3 per month for years to come.\nAfter Hurricane Beryl, CenterPoint would like to do the same.\nThose who manage CenterPoint bear much of the responsibility for its poor performance and should share the cost of repairs."}, {"id": "beb2e010-7e5a-4e82-bcce-942e13be696d", "title": "Storms cause flooding , home damage in Putnam County", "date": "2024-07-31 03:00", "url": "https://www.yahoo.com/news/storms-cause-flooding-home-damage-000429252.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PUTNAM COUNTY, Tenn. (WKRN) — One woman was temporarily trapped in her Putnam County home due to Tuesday’s storm.\nHad I been in that living room, it would have killed me instantly.”The woman has lived in Putnam County for the past 19 years.\nPutnam County was not the only county that saw heavy storm activity on Tuesday, though.\nNews 2’s Storm Tracker saw heavy rain in Wilson County as well.\nDon’t forget to take the power and reliability of the WKRN Weather Authority with you at all times by downloading the News 2 Storm Tracker app."}, {"id": "b035e77a-8ce0-42a5-8259-631ee48b7bee", "title": "Northern Plains Severe Threat Today", "date": "2024-07-31 11:45", "url": "http://www.weathernationtv.com/news/northern-plains-severe-threat-today", "domain": "weathernationtv.com", "domain_classification": "Unknown", "message": "A cold front reaching down from Canada and a stalled-out low-pressure system create the risk of seeing severe weather just in time for the middle of the workweek.\nAll severe modes will be possible as storms move through.\nFor more on storm threat in areas of the Great Lakes, check out this article.\nWednesday's threat brings the possibility of seeing significant severe threats.\nIndicating the chance of seeing extremely large hailstones (2\"+ in diameter) and hurricane-force wind gusts (75+ mph gusts)."}, {"id": "d8a1cc06-e671-49a1-8439-40740dcbe493", "title": "Area crops impacted by extreme weather patterns", "date": "2024-07-31 22:15", "url": "https://wsbt.com/news/local/area-crops-impacted-by-extreme-weather-patterns-heavy-rain-dry-conditions-hurricane-beryl-high-heat-corn-soybeans-indiana-michigan", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "At first glance farm crops are looking good in most areas with all the rain that has fallen in the area.\nThe erratic weather is keeping farmers on their toes and their eyes on their corn and soybeans.\nSigns of that suffering include crops that are yellow, pale, or if there are dead spots in the field.\nHowever, some crops have grown tall enough where you won't be able to tell if they have been impacted.\nDavenport says he won’t know the exact impact from the weather until harvest time and August is a critical month."}, {"id": "0f92cd82-0258-4c56-9c62-2b6aa8d4ac7e", "title": "Some uncertainty remains around tropical wave in Atlantic", "date": "2024-07-31 14:30", "url": "https://cbs12.com/weather/hurricane-maps/tracking-the-tropics-wednesday-july-31-2024-west-palm-beach-south-florida-treasure-coast-hurricane-season-high-uncertainty-around-tropical-wave-in-atlantic", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is monitoring a tropical wave over the central Atlantic that is surrounded by dry air, keeping it disorganized as it approaches the Lesser Antilles.\nThe system could become a tropical depression later this week.\nUncertainty remains high with this potential system as it nears the Bahamas Saturday and Sunday.\nOther global models, like the European computer model has consistently pointed to the system developing over the Bahamas, possibly as a tropical depression.\nIf it increases tropical moisture across the region, it could enhance storm chances late this weekend and into early next week."}, {"id": "f166261d-02e1-4a0e-b615-8aa1f7be4403", "title": "Brutal heat and humidity continue into the weekend", "date": "2024-07-31 14:30", "url": "https://www.wsls.com/weather/2024/07/31/brutal-heat-and-humidity-continue-into-the-weekend/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "These conditions will continue throughout the week and into the weekend, with heat indices approaching anywhere from 105 to 110 east of Roanoke.\nIt’ll be worth monitoring the radar throughout the day.\nRain and Heat across the regionMore of the same conditions can be expected over the next 3-4 days as well.\nShould this storm become a tropical storm, it will be the 4th in the Atlantic Basin this year and would be named Debby.\nRegardless of formation, this will be a system worth monitoring, especially along the east coast."}, {"id": "8bd2d603-2c91-40da-b980-0eb56dc62a3a", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 19:00", "url": "https://www.richmond-news.com/world-news/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon-9293732", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "A National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "545617c3-4563-43eb-8fe6-1042261c8ed5", "title": "Tropical system strengthening in the Atlantic . Will it mean a hurricane for Hilton Head ? ", "date": "2024-07-31 18:15", "url": "https://www.yahoo.com/news/tropical-system-strengthening-atlantic-mean-162142553.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical system strengthening in the Atlantic.\nA tropical disturbance in the mid-Atlantic is steadily increasing its likelihood of developing into a tropical depression, according to the National Hurricane Center.\nA tropical disturbance becomes a tropical depression when the storm has maximum sustained surface winds of 38 mph or less.\nSome models suggest the system could pass near Florida’s east coast over the weekend as a tropical depression or tropical storm, according to reporting by the Miami Herald.\nIf the disturbance develops into a tropical storm, it would be called Debby."}, {"id": "cb3dc259-7d3c-48bc-a34c-9ceba55fb246", "title": "4 . 7 - magnitude earthquake jolts Tokyo area : JMA - Xinhua", "date": "2024-07-31 02:30", "url": "https://english.news.cn/20240731/e9b00eb1641b4d8f937308b1bee72053/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "TOKYO, July 31 (Xinhua) -- An earthquake with a preliminary magnitude of 4.7 on early Wednesday rocked the Tokyo metropolitan area, the country's weather agency said.\nThe temblor occurred at 01:47 a.m. local time, measuring 3 on the Japanese seismic intensity scale of 7 in areas in Tokyo, Kanagawa and Chiba Prefecture, said the Japan Meteorological Agency (JMA).\nAt a depth of 120 km, the epicenter was located in Tokyo's 23 wards at a latitude of 35.7 degrees north and a longitude of 139.6 degrees east.\nThe tremors were felt strongly in central Tokyo, with no tsunami warnings issued.\nThere have been no reports of damage or casualties due to the temblor."}, {"id": "5b930e7d-63ed-4a13-b8c7-23f81befc980", "title": "First Alert Weather | Wednesday , July 31 , 2024", "date": "2024-07-31 12:15", "url": "https://www.wsaz.com/2024/07/31/first-alert-weather-wednesday-july-31-2024/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "HUNTINGTON, W.Va. (WSAZ) -- It’s another muggy morning across the Tri-State, but certainly quieter than yesterday’s storms.\nBe ready for a hot one today, as temperatures will go from about 70° to the low 90s this afternoon (and play closer to 100° in the humidity).\nThe coming days are now looking to angle more toward easing the drought, but lets hope that happens without stumbling into flooding.\nCopyright 2024 WSAZ.\nAll rights reserved."}, {"id": "bbaaac14-a099-4946-8c2a-37968fa88a2c", "title": "Heavy rain , flash flooding makes this July one of the wettest on record", "date": "2024-07-31 22:00", "url": "https://wlos.com/news/local/heavy-rain-flash-flooding-makes-july-one-wettest-on-record-2024-showers-thunderstorms-hendersonville-flat-rock-etowah-laurel-park-warning-dont-drown", "domain": "wlos.com", "domain_classification": "Unknown", "message": "Heavy rain on Tuesday, July 30 that led to flash flooding in parts of Henderson County helped make this one of the wettest Julys on record at the Asheville Regional Airport.\nAs of Wednesday afternoon, this July ranks as the fifth wettest on record with 10.03 inches of rain.\nMuch of the rain came during the later part of July, with a daily record of 2.38 inches falling on Monday, July 22.\nMonday night's rain brought over five inches to Laurel Park and more than two inches to parts of Etowah, Hendersonville and Flat Rock.\nThere is a low chance of flash flooding tonight, but anywhere that had heavy rain last night has a better chance of flooding if there is more rain tonight."}, {"id": "00e005e3-d5f9-4d7c-a72c-08cd6973d192", "title": "Tropical Storm Carlotta has formed in the eastern Pacific , forecasters say", "date": "2024-07-31 21:30", "url": "https://toronto.citynews.ca/2024/07/31/tropical-storm-carlotta-has-formed-in-the-eastern-pacific-forecasters-say/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "MIAMI (AP) — Tropical Storm Carlotta has formed in the eastern Pacific, but is moving away from Mexico, forecasters said Wednesday.\nThe National Hurricane Center in Miami says in an advisory that a tropical depression was upgraded to the tropical storm, with maximum sustained winds of 45 mph (75 kph).\nThe system is centered about 310 miles (500 kilometers) southwest of Manzanilla, Mexico, and is moving northwest at 12 mph (19 kph).\nCarlotta is forecast to become a hurricane on Friday.\nHowever, no coastal watches or warnings were in effect with the storm."}, {"id": "9fc0cb78-d46b-4aab-a41c-99d366b7f055", "title": "Hazy , hot and humid on Wednesday with low storm chance", "date": "2024-07-31 14:30", "url": "https://cbs12.com/news/local/weather-forecast-july-31-2024-west-palm-beach-south-florida-treasure-coast-hazy-hot-and-humid-on-wednesday-with-low-storm-chance", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "After a warm and humid start to the day, a coastal shower or two will remain possible through the morning.\nA heat advisory is in effect for Palm Beach County today as heat index values could reach up to 110 degrees.\nHazy, hot and humid through Thursday with a low storm chance into Friday.\nChanges arrive starting Saturday as deep tropical moisture could work its way into the region.\nIf it increases tropical moisture across the region, it could enhance storm chances late this weekend and into early next week."}, {"id": "5d1afb42-b564-4309-be3f-5a8aeac150f2", "title": "Is Oregon Moving to a Drought ? Snowpack a Memory", "date": "2024-07-31 04:30", "url": "https://keyw.com/ixp/136/p/is-oregon-moving-to-a-drought-snowpack-a-memory/", "domain": "keyw.com", "domain_classification": "Unknown", "message": "Getty Images Getty Images loading...\nSo, I think we’re all kind of eager for a La Nina to happen next fall.\nBut, the onset of La Nina has shifted a little bit later than what we were expecting a few months ago.\nGet our free mobile appJefferson County is the only one to receive an official drought declaration.\n56 percent of the state is now considered to be in a moderate drought."}, {"id": "36d6af6b-8f4b-4a68-8a94-568b3fac47d8", "title": "Is Oregon Moving to a Drought ? Snowpack a Memory", "date": "2024-07-31 04:45", "url": "https://newstalk870.am/is-oregon-moving-to-a-drought-snowpack-a-memory/", "domain": "newstalk870.am", "domain_classification": "Unknown", "message": "Getty Images Getty Images loading...\nSo, I think we’re all kind of eager for a La Nina to happen next fall.\nBut, the onset of La Nina has shifted a little bit later than what we were expecting a few months ago.\nGet our free mobile appJefferson County is the only one to receive an official drought declaration.\n56 percent of the state is now considered to be in a moderate drought."}, {"id": "e9c135e7-5c5d-49fa-98a7-90609626a771", "title": "Could tropical wave in the Atlantic impact the Gulf Coast ? ", "date": "2024-07-31 21:15", "url": "https://www.fox8live.com/2024/07/31/could-tropical-wave-impact-gulf-coast/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "NEW ORLEANS (WVUE) - A tropical wave near the Lesser Antilles has the potential to affect the Gulf Coast.\nAs the tropical wave moves west through the Caribbean, it faces dry air, Saharan dust, wind shear, and interaction with Caribbean islands.\nTropical wave could develop as it nears south Florida (WVUE)Uncertainty remains about the system’s future.\nIf the wave avoids Caribbean islands and becomes organized, it could curve north earlier.\nA weaker wave crossing the islands might miss the northern trough, feel the high-pressure ridge’s influence, and move further west into the Gulf."}, {"id": "bab47d12-2ef5-40b4-a466-299d54a51d79", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 16:15", "url": "https://www.bowenislandundercurrent.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-9293152", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nWildfire expert Mike Flannigan says the major drivers of the fire were a confluence of several extreme conditions.\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais."}, {"id": "70b730b2-1807-4baf-8e59-7efa6fdab9d1", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 18:00", "url": "https://www.reddeeradvocate.com/news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7464563", "domain": "reddeeradvocate.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "3a96df01-e09c-423a-b6b8-7ef6f4b5c6ff", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? - Vanderhoof Omineca Express", "date": "2024-07-31 22:15", "url": "https://www.ominecaexpress.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "ominecaexpress.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "6bae1461-5cb4-44d4-922a-ab4b883e4503", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 19:00", "url": "https://www.prpeak.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-9293152", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nWildfire expert Mike Flannigan says the major drivers of the fire were a confluence of several extreme conditions.\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais."}, {"id": "cdc6b88f-722a-4ee0-8704-9bb656fab749", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 22:00", "url": "https://www.peacearchnews.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "peacearchnews.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "425a4004-d81a-4fda-8f35-fbbfc475d299", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 22:15", "url": "https://www.vicnews.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "vicnews.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "8be626dc-7c55-4827-b025-daa71eb60916", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 22:45", "url": "https://www.caledoniacourier.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "caledoniacourier.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "25d48f2f-ef2c-4735-b082-266403005f17", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-07-31 22:45", "url": "https://www.campbellrivermirror.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "campbellrivermirror.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "c04dc560-ce91-4ea9-9f16-97e6f88d1a25", "title": "Eastern Pacific Basin Roars to Life", "date": "2024-07-31 02:30", "url": "http://www.weathernationtv.com/news/tropical-formation-likely-along-the-west-coast-of-mexico", "domain": "weathernationtv.com", "domain_classification": "Unknown", "message": "31 Jul 2024 11:15 AMThere are multiple areas of potential tropical formation in the Eastern Pacific ranging from a low to high chance of formation in the next 7 days, including two areas of HIGH likelihood of development off the western coast of Mexico.\nThe area of low pressure with the highest likelihood of formation has been named \"Invest 94-E\" by the National Hurricane Center and \"a tropical depression is very likely to form within the next couple of days.\nThe system is forecast to move westward to west-northwestward at 10 to 15 mph during the next several days, remaining offshore of the southern coast of Mexico.\"\nRight now, this is NO threat to land, but will likely create large swells from the Baja through central Mexico.\nIf it manages to reach Tropical Storm Strength, it will be Caroletta."}, {"id": "f0ecba63-21ba-4f7f-a085-ed2e246c5160", "title": "Eastern Pacific Basin Roars to Life", "date": "2024-07-31 00:15", "url": "https://www.weathernationtv.com/news/tropical-formation-likely-along-the-west-coast-of-mexico", "domain": "weathernationtv.com", "domain_classification": "Unknown", "message": "31 Jul 2024 11:15 AMThere are multiple areas of potential tropical formation in the Eastern Pacific ranging from a low to high chance of formation in the next 7 days, including two areas of HIGH likelihood of development off the western coast of Mexico.\nThe area of low pressure with the highest likelihood of formation has been named \"Invest 94-E\" by the National Hurricane Center and \"a tropical depression is very likely to form within the next couple of days.\nThe system is forecast to move westward to west-northwestward at 10 to 15 mph during the next several days, remaining offshore of the southern coast of Mexico.\"\nRight now, this is NO threat to land, but will likely create large swells from the Baja through central Mexico.\nIf it manages to reach Tropical Storm Strength, it will be Caroletta."}, {"id": "067de175-c87f-4b8c-9ecf-3c01ab5c38c5", "title": "  This is unacceptable : CenterPoint CEO testifies before Texas House Committee on State Affairs", "date": "2024-07-31 22:30", "url": "https://www.yahoo.com/news/unacceptable-centerpoint-ceo-testifies-texas-201007608.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "AUSTIN (Nexstar) — CenterPoint Energy CEO Jason P. Wells testified before the Texas House Committee on State Affairs Wednesday morning regarding the power outages the company has largely taken the blame for following Hurricane Beryl.\nWells and other CenterPoint representatives also testified Monday at a Senate committee hearing and last Thursday before the Public Utility Commission.\nThese topics included communication, vegetation management, staff preparedness and supply preparedness.\nThese include advancing vegetation management efforts, strengthening communications and restoring partnerships with local partners.\nWhen asked by Hernandez if he could have done more in terms of vegetation management, Wells responded “In hindsight, absolutely."}, {"id": "3ad1452d-3bd4-47b4-8f2d-6ff515a280a8", "title": "Hurricane forecast : A rainy Florida sideswipe or a festering Gulf storm threat ? ", "date": "2024-07-31 18:00", "url": "https://www.yahoo.com/news/hurricane-forecast-rainy-florida-sideswipe-170520230.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "With water temperatures in the eastern Gulf in the upper 80s and favorable outflow aloft, that would be something that we’d need to watch.\nStorm tracker: Monitor tropical wave as it moves toward FloridaA 'tricky' forecast with two paths: A rainy Florida sideswipe or a festering Gulf tropical threat?\nThe Carolinas to the eastern Gulf Coast should continue to monitoring the situation in the meantime.\nAirmasses one to four miles up over the tropical Atlantic look to remain much drier than normal through mid-month, putting the kibosh on the development prospects of most tropical waves.\nThis article originally appeared on Tallahassee Democrat: Hurricane forecast: How tropical wave could impact Florida, Southeast"}, {"id": "ed2dced2-71f5-4312-b3f4-6ae4d0c1e35a", "title": "Tropical depression or storm may form by this weekend", "date": "2024-07-31 15:00", "url": "https://www.wlox.com/2024/07/31/tropical-depression-or-storm-may-form-by-this-weekend/", "domain": "wlox.com", "domain_classification": "Unknown", "message": "A tropical wave near the Lesser Antilles has a chance of becoming a depression or storm as it moves westward.\nThat area could become a tropical depression or tropical storm as it nears the Bahamas and possibly gets close to the U.S. coast.\nBy the end of this week into the weekend, the tropical wave could be near the Bahamas, South Florida, or Cuba.\nModels continue to be split on where the tropical disturbance will be next week.\n(wlox)Models continue to be split on where the tropical disturbance will be next week."}, {"id": "8bc0af3a-3ae4-4647-91c8-a1cf46f39155", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-07-31 23:15", "url": "https://www.krmg.com/news/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "702ef5ea-7cbf-458f-8cdc-3fc7892371bd", "title": "Slightly lower rain chances Wednesday", "date": "2024-07-31 05:00", "url": "https://www.mysuncoast.com/2024/07/31/slightly-lower-rain-chances-wednesday/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "WWSB ABC7 News at 6pmSARASOTA, Fla. (WWSB) - Some drier air will push into south Florida tomorrow, which will prompt slightly lower rain chances on Wednesday.\n40% chance of rain.\nThe low temperatures tonight will be in the mid- to upper-70s, and temperatures will reach the low 90s Wednesday afternoon.\nThursday and Friday, that sliver of dry air will move out of the way, and our rain chances will come back up a bit, to 50%.\nSlightly lower rain chances Wednesday, but storms become more likely by the weekend."}, {"id": "71855a9f-b6fa-421e-b371-917b2aa11e22", "title": "Brooklyn man travels to Florida during hurricane to have sex with young girl : DOJ", "date": "2024-07-31 23:15", "url": "https://cbs12.com/news/local/matthew-gabriel-bergida-34-sentenced-to-40-years-in-prison-have-sex-with-minor-hurricane-idalia-perry-police-department-united-states-department-of-justice-florida-july-31-2024", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "A Brooklyn man was sentenced to 40 years in prison after he traveled to Florida during a hurricane to have sex with a minor.\nBergida's case was investigated by the Perry Police Department, the Florida Department of Law Enforcement and Homeland Security, the DOJ says.\nCourt documents continue, that while law enforcement was enforcing the storm-related curfew they came across a young girl and learned of Bergida's sexual exploitation.\nLaw enforcement quickly responded to a local motel where they arrested Bergida.\nAfter his prison sentence, Bergida will have to undergo a lifetime of supervised release and will have to register as a sex offender."}, {"id": "7c24040a-e67f-4fa6-874d-3aa43386b4b8", "title": "Tropical depression could form near Florida this weekend , NHC says", "date": "2024-07-31 14:00", "url": "https://www.fox35orlando.com/weather/tropical-depression-could-form-near-florida-weekend-nhc-says", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "A large tropical wave in the Caribbean could develop into a tropical depression near Florida or the Bahamas as early as this weekend, according to a Wednesday morning update from the National Hurricane Center.\nWEDNESDAY FORECAST: Afternoon storms expected across Central FloridaThere's a medium (60%) chance that this system develops into a tropical depression this weekend or early next week near the Greater Antilles, the Bahamas or near Florida.\n\"In this scenario, if you hadn't been watching the weather, you may never know a tropical depression or tropical storm was tracking offshore of Florida toward the Carolinas,\" Garner said.\nAdditionally, it should be noted that Saharan dust in the Atlantic is to credit for keeping this tropical wave weak.\nAs the dust's influence wanes this weekend, there will be a window for the disturbance to develop into a tropical depression, or maybe Tropical Storm Debby."}, {"id": "019fd896-0dae-4b22-8619-9e853eb99e14", "title": "Delhi Basement Tragedy , Saurabh Bharadwaj : Delhi Chief Secretary Big Charge On AAP Minister After Basement Deaths", "date": "2024-07-31 06:30", "url": "https://www.ndtv.com/india-news/delhi-basement-tragedy-saurabh-bharadwaj-delhi-chief-secretarys-big-charge-on-aap-minister-after-basement-deaths-6228664", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The Chief Secretary has said that a meeting was convened after heavy rain last year led to waterlogging in the city to come up with a comprehensive strategy to prevent flooding, according to sources.\nOn the Master Drainage Plan, the Chief Secretary has said that an IIT Delhi report on this was not accepted by Aam Aadmi Party government.\nThe storm water drainage system in Delhi, the Chief Secretary has said, cannot be controlled without a proper legislative framework and this situation leads to flooding in several areas whenever there is heavy rain.\nWhat Led To Basement TragedyOn the Rajinder Nagar incident, the Chief Secretary has pointed to the findings of the probe conducted by the Municipal Corporation of Delhi.\nThe Blame Game ContinuesThis Chief Secretary's report is the latest episode in the blame game in the aftermath of the basement tragedy."}, {"id": "f8ca44c2-4e3c-4131-98b7-d8666a585db2", "title": "Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-07-31 17:45", "url": "https://www.mymotherlode.com/news/national/3400381/why-does-vermont-keep-flooding-its-complicated-but-experts-warn-it-could-become-the-norm.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "It’s complicated, but experts warn it could become the normWhy does Vermont keep flooding?\nIt’s complicated, but experts warn it could become the norm View PhotoVermont is flooding.\nClimate change warming the atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms."}, {"id": "1aab4942-c5c4-45bb-995c-703d7b4afb1e", "title": "Deadline for FEMA approaches for wildfire and flooding victims", "date": "2024-07-31 03:15", "url": "https://www.kob.com/new-mexico/deadline-for-fema-approaches-for-wildfire-and-flooding-victims/", "domain": "kob.com", "domain_classification": "Unknown", "message": "The agency has set up multiple emergency disaster centers all throughout the counties impacted.\nALBUQUERQUE, N.M. – FEMA is stepping in to help folks who lost their homes from recent wildfires and ongoing flooding.\nOn Wednesday, the Federal Emergency Management Agency announced that President Joe Biden signed off on increasing funding for debris removal and emergency protective measures in these affected areas, including Ruidoso.\nThe federal agency has set up multiple emergency disaster centers all throughout these areas.\nWhat type of help can they get and most importantly, how can they become better prepared for the next disaster,” Baltodano said."}, {"id": "29cfd2c1-c30e-47d9-ba82-b4a8bd075e86", "title": "Vermont Braces for More Rain After Historic Deluge", "date": "2024-07-31 21:45", "url": "https://www.sevendaysvt.com/news/vermont-braces-for-more-rain-after-historic-deluge-41503125", "domain": "sevendaysvt.com", "domain_classification": "Unknown", "message": "Officials urged residents to report damage to the Vermont 211 hotline.\nBut these historic downpours are happening at an all-too-regular pace for Vermonters.\nSome communities, Scott noted, have been hit by flooding four different times since July 2023.\n“We’ve got to stick together and fight back against the feeling of defeat.\nPhil Scott and other state officials were preparing for more potential damage as another round of rain took aim at Vermont on Wednesday."}, {"id": "19c66cb1-6504-4c34-a109-ee93d2a23980", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 14:00", "url": "https://www.delta-optimist.com/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291867", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "094565e4-48b0-44f8-b712-b570cdad085f", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 14:00", "url": "https://www.fitzhugh.ca/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291857", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "a6564cbb-350f-429d-ae1e-f8ccbdf38267", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 13:30", "url": "https://www.squamishchief.com/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291867", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "23e6e700-3c75-4b64-a172-57bcd5585c25", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 15:30", "url": "https://www.thompsoncitizen.net/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291867", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "58e82e16-2261-46dd-a6f9-84b98bf129dd", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 12:15", "url": "https://www.stalbertgazette.com/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291857", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\n\"You can see it in the atmosphere, moving from Africa westward across the Atlantic,\" says Chris Fogarty, manager of the Canadian Hurricane Centre in Dartmouth, N.S.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "ca366b9e-59be-4ffd-a91c-5e7f9caad733", "title": "Sand from the Sahara Desert causing recent lull in the hurricane season : scientists", "date": "2024-07-31 14:30", "url": "https://www.richmond-news.com/national-news/sand-from-the-sahara-desert-causing-recent-lull-in-the-hurricane-season-scientists-9291867", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "HALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nHALIFAX — Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say.\nFogarty, however, said hurricane season is sure to pick up in the weeks ahead, with the peak of the season typically arriving in the first few weeks of September.\nFogarty said now is the time for people in Eastern Canada to prepare for strong winds, heavy rain and storm surges.\nIn late May, the Canadian Hurricane Centre predicted an active hurricane season fuelled by record high ocean temperatures."}, {"id": "5685317a-4223-4a30-8a52-9b0350d69e4f", "title": "RRT launches multinational response to Hurricane Beryl", "date": "2024-07-31 21:30", "url": "https://trinidadexpress.com/newsextra/rrt-launches-multinational-response-to-hurricane-beryl/article_28d37468-4f5f-11ef-a890-f3e83b6993ad.html", "domain": "trinidadexpress.com", "domain_classification": "Unknown", "message": "Caricom does not have to take a position on the Venezuelan election because it is a domestic matter, Caricom chairman Dickon Mitchell said yesterday.\nThe Grenada Prime Minister was responding to a question at the news conference at the conclusion of the Caricom Heads of Government meeting in St George’s on why no statement had been issued on behalf of Caricom on the disputed outcome of Sunday’s presidential election in Venezuela, and whether that was an indication of division within Caricom over the issue."}, {"id": "8bb187c0-aa11-49e4-ba97-60ec214fe915", "title": "How stormwater can impact our waterways", "date": "2024-07-31 00:45", "url": "https://www.wkyt.com/2024/07/30/how-stormwater-can-effect-our-waterways/", "domain": "wkyt.com", "domain_classification": "Unknown", "message": "LEXINGTON, Ky. (WKYT)—In 2006, the EPA and the Commonwealth sued the City of Lexington, saying that the city failed to properly manage stormwater.\nAfter a system overhaul and some hard work, Lexington won a national award for stormwater mitigation and management in 2018.\nWhen we get rain here in Kentucky, we get stormwater, excess water runoff that doesn’t soak into the ground after a storm.\nHowever, during periods of excessive rainfall, new concerns can arise about stormwater mitigation efforts.\nUnlike our sanitary sewer system, stormwater runoff is not treated but discharged directly into our creeks and streams, along with the pollutants it grabbed along the way."}, {"id": "29966ae8-bc81-4c19-a35b-470f5f51d67f", "title": "Gov . Burgum declares summer storm disaster in central North Dakota", "date": "2024-07-31 22:30", "url": "https://www.yahoo.com/news/gov-burgum-declares-summer-storm-211554027.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Radar map of June 17 storm approaching Stutsman County.\n(Screenshot, National Weather Service Bismarck)North Dakota Gov.\nDoug Burgum declared a summer storm disaster for the central part of the state due to severe storms and flooding in the region from June 7 to July 17 in an executive order Wednesday.\nIn a news release, the governor’s office said the National Weather Service reported 6 to 9 inches of rainfall across central North Dakota during the more than five-week period.\nThe disaster declaration will remain in effect until Aug. 31, according to the executive order."}, {"id": "c4387bca-7ace-4252-82df-dfff7d9491f8", "title": "Gov . Burgum declares summer storm disaster in central North Dakota", "date": "2024-07-31 23:30", "url": "https://news.yahoo.com/news/gov-burgum-declares-summer-storm-211554027.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Radar map of June 17 storm approaching Stutsman County.\n(Screenshot, National Weather Service Bismarck)North Dakota Gov.\nDoug Burgum declared a summer storm disaster for the central part of the state due to severe storms and flooding in the region from June 7 to July 17 in an executive order Wednesday.\nIn a news release, the governor’s office said the National Weather Service reported 6 to 9 inches of rainfall across central North Dakota during the more than five-week period.\nThe disaster declaration will remain in effect until Aug. 31, according to the executive order."}, {"id": "ac8e77d2-c99d-406d-946d-69289a413f17", "title": "KRQE Newsfeed : UNMH recruiting staff , Armed robbery charges , Hot and mostly dry , Relief bill signed , Albuquerque horse rescue book", "date": "2024-07-31 15:00", "url": "https://www.yahoo.com/news/krqe-newsfeed-unmh-recruiting-staff-130815463.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wednesday’s Top StoriesWednesday’s Five Facts[1] How will UNMH staff incoming critical care tower during healthcare worker shortage?\n[2] VIDEO: Disgruntled customer returns to store flashing gun – A man is facing armed robbery charges after pulling a gun on a store clerk who denied his request for a refund.\nA criminal complaint states that Parson left the store but came back with a gun, demanding that the clerk open the cash register.\nThe bill appropriates $100 million to support recovery efforts following recent wildfires and flooding in the state.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "cd7c70f0-0f71-4628-9692-d3585e4152f6", "title": "New Castle County heat advisory issued . Has Delaware had a historically warm July ? ", "date": "2024-07-31 15:30", "url": "https://www.yahoo.com/news/castle-county-heat-advisory-issued-144644287.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "New Castle County heat advisory issued.\nThe National Weather Service issued a heat advisory for New Castle County on Wednesday as intense heat will hit the region on Thursday.\nHeat advisory: A heat advisory is issued within 12 hours of extreme heat conditions.\nExcessive heat watch: Heat watches are issued when conditions are favorable for excessive heat in the next 24 to 72 hours.\nThis article originally appeared on Delaware News Journal: Delaware heat wave: New Castle County heat advisory issued"}, {"id": "09dffdc5-2f38-4e2c-b8e2-0b3cf2a27407", "title": "State agencies work to restore West Ashley marsh", "date": "2024-07-31 03:30", "url": "https://www.live5news.com/2024/07/31/state-agencies-work-restore-west-ashley-marsh/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. (WCSC) - The South Carolina Oyster Recycling and Enhancement team at the South Carolina Department of Natural Resources has been working hard to restore a salt marsh behind a home in one West Ashley neighborhood.\nThe idea of this project came about in 2017 when a man named John Carr whose Ashleyville neighborhood home is directly in front of the marsh called the South Carolina Aquarium with concerns about the marsh turning into a mudflat.\nThe South Carolina Aquarium is also helping with this project by gathering community members to volunteer.\nThe Director of Conservation at the South Carolina Aquarium Sara McDonald says that the reason for this was because of drought and flooding.\nIf you’re interested in volunteering and helping build the third tidal creek, Lambert says to visit their website to learn how you can get involved."}, {"id": "bf143ecd-67c8-4b65-885e-da0053b1b8f0", "title": "Why plume of Saharan dust now in Texas is welcome", "date": "2024-07-31 21:30", "url": "http://www.lmtonline.com/news/houston-texas/article/saharan-dust-houston-hurricane-19609022.php", "domain": "lmtonline.com", "domain_classification": "Unknown", "message": "A thick cloud of Saharan dust shrouds Houston in a gray haze.\nGetty ImagesHoustonians can blame a massive plume of Saharan dust currently covering the region for reduced air quality across the state—and for a lack of activity in the tropics.\nWith atmospheric conditions becoming unbearable for some residents, triggering seasonal allergy-like symptoms, it's tough to see the silver lining in the Saharan dust cloud—but there is one.\nHazy skies are expected in the region this week due to Saharan dust.\nAdvertisement Article continues below this adThe level of Saharan dust this year has been higher than normal."}, {"id": "81aa5a2b-f98e-4e5b-87f4-46288059d510", "title": "Jasper wildfire : Fire - affected small businesses face rocky road ahead", "date": "2024-07-31 14:00", "url": "https://globalnews.ca/news/10661240/jasper-wildfire-small-business-recovery/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Federal officials have said about one-third of the buildings in the Jasper townsite were lost in the blaze, and it’s already clear that some business owners lost their homes as well as their businesses.\nStory continues below advertisementThe agency said insurers will likely face significant claims from businesses with respect to commercial buildings and business interruption losses.\nSo that’s just gone.”Ireland said when and if business owners get the all-clear to go back, reopening will be complicated by the staffing situation.\nStory continues below advertisementFor the latest information on the wildfire status and danger across the province, visit the Alberta Wildfire website.\nFor the latest on road closures in Alberta, you can visit the 511 Alberta website."}, {"id": "73aed1ca-bfd2-437f-8ffc-b8fb1850668a", "title": "Wildfire safety tips from the experts", "date": "2024-07-31 17:00", "url": "https://www.yahoo.com/news/wildfire-safety-tips-experts-150633214.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "If you’re in a vehicleIf you’re in a car and a wildfire is beginning to surround you, resist the urge to jump out.\nIf you’re completely overrun by fire, take shelter inside your vehicle – you’re going to be much better off than outside of the vehicle.\nIf you’re trapped outside during a wildfireThe Oak Fire burns through trees on July 24, 2022, near Jerseydale, California.\n- Justin Sullivan/Getty ImagesIf you’re trapped outdoors with a wildfire approaching, call 911 and give them your exact location, Heggie said.\nMott said we should think ahead and prepare for wildfire but also “don’t worry yourself sick about it."}, {"id": "048a90ef-366e-43fd-ac98-ba497f426db3", "title": "Extreme heat to linger in southeast Louisiana for several more days", "date": "2024-07-31 16:15", "url": "https://www.fox8live.com/2024/07/31/extreme-heat-linger-southeast-louisiana-several-more-days/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "NEW ORLEANS (WVUE) - While we’re no strangers to heat, the repeated lashing of high temperatures and humidity will pose a higher threat throughout the week.\nHighs will rise to the mid to upper 90s with heat index values soaring to 105 to 113 degrees.\nThose who work outdoors will be highly impacted as heat illness is cumulative through repeated exposure.\nMeaning, that your body remembers being overheated yesterday and the day prior... that can send you into a heat illness episode easily after a few days - even if you’re not as hot.\nOur higher heat energy will allow for very heavy downpours and gusty winds."}, {"id": "fc5d3288-50ff-4469-94a6-82c75181e1e2", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 18:15", "url": "https://wchstv.com/news/nation-world/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "wchstv.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "07e3b98f-4e43-4e2c-ab9f-f6a40c6147f3", "title": "Storms wreak havoc on Southeast US leaving 1 dead and thousands without power", "date": "2024-07-31 21:15", "url": "https://newschannel9.com/news/local/storms-wreak-havoc-on-southeast-us-leaving-1-dead-and-thousands-without-power-georgia-south-carolina-atlanta-tennessee-electricity-straight-line-winds-lightning-hospitalized-flooding", "domain": "newschannel9.com", "domain_classification": "Unknown", "message": "A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.\nNo one was injured along the path of the storm, which stayed on the ground for 3.4 miles (5.4 kilometers)."}, {"id": "4e83c6ad-0621-45a8-a887-c585bd14d287", "title": "Fall Forecast Calls for Stubborn Heat , Increased Wildfire Risks , Severe Weather", "date": "2024-07-31 22:15", "url": "https://www.claimsjournal.com/news/national/2024/07/31/325437.htm", "domain": "claimsjournal.com", "domain_classification": "Unknown", "message": "Summer heat is expected to last well into autumn across much of America, bringing an increased risk of wildfires and severe weather—especially in the Western U.S. and California.\nMuch of the nation will experience a delayed transition to cooler temperatures this year, following a summer with intense heat, according to AccuWeather, which issued its 2024 U.S. Fall Forecast on Wednesday.\nRelated: California Wildfire Outlook: ‘A Challenging Season for Firefighters’The Pacific Northwest is the only region that may expect an early arrival of fall-like weather, including some early-season storms.\nThe forecast also calls for wildfire activity to increase in September.\nIt calls for 40,000 to 50,000 wildfires this year, below the historical average of 68,707 wildfires annually."}, {"id": "7d6e397e-04a9-4be4-8ea7-a743920e42c0", "title": "Jacksonville New Bridge Street Project continues with key upgrades", "date": "2024-07-31 15:30", "url": "https://www.wcti12.com/news/local/jacksonvilles-new-bridge-street-project-continues-with-key-upgrades", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Improvements are continuing with the New Bridge Street Project in Jacksonville.\nCity officials say infrastructure upgrades will continue on storm drain improvements in the month of August that will take place near the children's museum.\nIn addition, sidewalk demolition and installation of curb and gutter will take place near Boomtown Furniture to the corner of Bayshore next week on August 5.\nThe New Bridge Project overall involves a number of enhancements such as water systems, sidewalks, street lighting, landscaping, medians, delivery areas, and the removal of overhead power lines.\nThe primary objective is to enhance the infrastructure, prevent flooding, and create an attractive corridor that promotes local businesses and welcomes residents."}, {"id": "3154bb11-482f-42cf-91d7-82bfce044678", "title": "Authorities look for improvements as Dallas clean up after May storm continues", "date": "2024-07-31 22:30", "url": "https://www.dallasnews.com/news/politics/2024/07/31/authorities-look-for-improvements-as-dallas-clean-up-after-may-storm-continues/", "domain": "dallasnews.com", "domain_classification": "Unknown", "message": "City officials could also help by working with Oncor and residents to keep power lines clear, said Paula Blackmon, a Dallas City Council member representing parts of east Dallas hit hardest by the May 28 storm.\nSome of the hardest-hit areas were east and north Dallas and Mesquite, according to statistics Oncor provided to city council members.\nAdvertisementPiloto said company representatives met with seven Dallas council members that month as they reviewed the impacts of the storm and their response to it.\nDistrict 9 covers parts of East Dallas, including White Rock Lake and Lakewood, as well as part of far east Dallas.\nAdvertisementBlackmon, District 9′s city council representative, said she still wants the utility company to provide data showing the duration of outages around the city."}, {"id": "55196ce6-9186-47d3-99e8-53278dd27515", "title": "How $1 . 7 million of FEMA money will help solve flooding in Boynton Beach", "date": "2024-07-31 00:00", "url": "https://www.wptv.com/news/region-s-palm-beach-county/boynton-beach/how-1-7-million-of-fema-money-will-help-solve-flooding-in-boynton-beach", "domain": "wptv.com", "domain_classification": "Unknown", "message": "BOYNTON BEACH, Fla. — Federal Emergency Management Agency has granted the city of Boynton Beach $1,737,750 to help with what the city is calling the Heart of Boynton (HOB) project.\nCity of Boynton Beach The $10 million project will focus on areas around Seacrest Boulevard, north of Boynton Beach Boulevard.\n\"Why is Boynton Beach at this point where they're flooding in so many different parts?\"\nBoynton Beach Where will $23.5 million go to help fix flooding in Boynton Beach?\nResident Rose Senior, who lives in the San Castle area of Boynton Beach, said the road by her house is constantly flooding."}, {"id": "05c752d8-666d-42f6-b278-7ff5f4c7e2cd", "title": "Delhi schools closed : Delhi schools shut amid heavy rain : Red alert issued by Meteorological department", "date": "2024-07-31 20:00", "url": "https://economictimes.indiatimes.com/news/india/delhi-schools-shut-amid-heavy-rain-red-alert-issued-by-meteorological-department/articleshow/112176927.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Education Minister Atishi stated on X, “In light of very heavy rainfall this evening and the forecast of heavy rainfall tomorrow, all schools will remain closed tomorrow.” This decision aims to safeguard students amid the ongoing storm.The heavy rainfall has caused extensive waterlogging throughout Delhi, reviving concerns from recent flooding incidents.\nSaxena emphasized, “Have cautioned all officers to remain alert in light of the ongoing heavy downpour in Delhi.\nFor instance, an Air India flight from Tokyo was rerouted to Jaipur, and Vistara’s flight UK998 from Pune was diverted to Lucknow.\nIndiGo advised travelers to check their flight status, stating, “The rain gods have decided to shower #Delhi with their blessings tonight.\nAs a result, we're expecting heavy rainfall throughout the night."}, {"id": "b577dfe8-36bf-4909-be1d-f7999e27c2b7", "title": "Extreme Heat , Hurricanes , Wildfires : How Summer Extremes Disrupt the Power Grid", "date": "2024-07-31 05:00", "url": "https://yubanet.com/scitech/extreme-heat-hurricanes-wildfires-how-summers-extremes-disrupt-the-power-grid/", "domain": "yubanet.com", "domain_classification": "Unknown", "message": "Here’s what summer extreme weather means for the grid, and how researchers at the Department of Energy’s Pacific Northwest National Laboratory are stepping up to face the challenge.\n(Animation by Sara Levine | Pacific Northwest National Laboratory)Even solar panels are less efficient in hot weather, said Vishvas Chalishazar, an electrical engineer at PNNL.\nThey can also damage the power grid enough to knock out power for millions, as recently seen after Hurricane Beryl in Texas.\nAnimation by Sara Levine | Pacific Northwest National LaboratoryWhen the power grid is vulnerable to extreme weather, that means communities are vulnerable as well.\n“The heatwaves in the Pacific Northwest and cold snaps in Texas are not just one-offs."}, {"id": "d4cc5424-842f-4c55-b8a2-6bfdfa58e623", "title": "How climate change fuels economic decline and migration", "date": "2024-07-31 11:00", "url": "https://www.biznews.com/thought-leaders/2024/07/31/climate-change-economic-decline-migration", "domain": "biznews.com", "domain_classification": "Unknown", "message": "In his book On the Move: The Overheating Earth and the Uprooting of America, Abrahm Lustgarten explores how climate change is reshaping American migration patterns.\nBloomberg CityLab chatted with Lustgarden about these economic incentives and the future of climate migration.\nHow does the US approach to climate migration differ from that of other countries?\nFor middle-class America, there are many ways in which the effects of climate change are making life more expensive.\nIt was all of those experiences together that shaped my turning the focus of my climate migration reporting to what it means for Americans."}, {"id": "98a30388-de22-4ce1-a84d-a49b294ebc9e", "title": "Tampa Electric power lines go underground to push back against storms", "date": "2024-07-31 12:15", "url": "https://www.tampabay.com/news/environment/2024/07/31/tampa-electric-powerlines-go-underground-push-back-against-storms/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "Floridians know the drill: Hurricane season hits, big storms take down power lines and residents are left without electricity.\nThen came a well-attended community meeting with Tampa Electric representatives, maps and information.\nTampa Electric says about half of its power lines are already underground, mostly in areas of new construction and paid for by developers.\nDuke Energy Florida removed 26 miles of overhead lines in 2023 and plans to remove 61 more this year.\nTampa Electric spends about $150 million a year on its Storm Protection Plan, which includes undergrounding lines as well as trimming trees and strengthening power poles."}, {"id": "d2ea72f7-3d18-4953-87d3-a07db9d73a5c", "title": "Severe Weather System in Southeast | Georgia", "date": "2024-07-31 22:30", "url": "https://www.local3news.com/local-news/georgia/severe-storms-in-the-southeast-us-leave-1-dead-and-cause-widespread-power-outages/article_c079cb5e-7cf3-5ba5-8315-57954710383f.html", "domain": "local3news.com", "domain_classification": "Unknown", "message": "Severe storms in the Southeast US leave 1 dead and cause widespread power outagesA weather system that produced severe thunderstorms in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power"}, {"id": "df0a2989-9bfe-4cf6-9c45-abd4ef105f19", "title": "Northern Nevada Dream Center sends rescue bags to hurricane victims", "date": "2024-07-31 05:15", "url": "https://www.carsonnow.org/story/09/16/2017/northern-nevada-dream-center-sends-rescue-bags-hurricane-victims", "domain": "carsonnow.org", "domain_classification": "Unknown", "message": "About a week ago, the Northern Nevada Dream Center (NNDC) in Carson City shipped around 260 rescue bags to the East Texas Dream Center for distribution to people in need following the devastation of Hurricane Harvey, NNDC Executive Director Susan Sorenson said.\n\"When we heard from the East Texas Dream Center about the needs in Houston, we knew our Rescue Bags would be a huge help to the folks there.\"\nRescue bags are made up of travel-sized toiletries and snacks for men, women, boys and girls, Sorenson said.\n\"Donations were brought in and we had two nights of packing last week to prepare for Texas,\" Sorenson said.\nMonetary donations can be made online here at the NNDC hurricane relief page, where donors can also get more information of the items most needed."}, {"id": "7a29da93-f3b0-4c3a-8989-60f313a83307", "title": "Dollywood theme park affected by flash flooding , injuring 1", "date": "2024-07-31 00:45", "url": "https://www.yahoo.com/news/dollywood-theme-park-affected-flash-230000567.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Park employees and local officials guided park visitors to safety Sunday afternoon.\nCleanup crews were reportedly deployed and within ten minutes, the entrance to the park was blocked due to heavy rain.\nFlash floodingIn a statement released on X on July 28, Dollywood Parks & Resorts gave an update on the flooding conditions: “This afternoon, Sunday, July 28, a strong thunderstorm caused flash flooding at Dollywood.\nWith the assistance of Pigeon Forge Police and Fire Departments, park personnel directed guests to safety during the storm.\nSarah Myers told CNN about her experience at the park during the flooding."}]