[{"id": "d47fb457-3652-4ccd-b66a-85bb16d8e7cb", "title": "Israel Amb . to united kingdom :  Jewish communities feel like theyre under attack by antisemitism  ", "date": "2024-05-19 21:00", "url": "https://www.israelnationalnews.com/news/390213", "message": "She recounted how \"the young students are feeling it on the campuses here and some people feel it where they work or live.\nHotovely explained the feelings these days in the UK Jewish community, saying that it is a, “Very proud community and very much connected to Israel.\nMany people that I meet are saying, ‘My son is in Gaza,’ ‘My nephew is in Gaza.’ So we really feel the strong bond between the Jewish community here and the Israelis.\nAt the same time, Jewish communities feel like they're under attack by antisemitism.\nDuring the press conference, he said, ‘We won't be hijacked by those radicals,’ and at the same time he defined it as a threat to Britain, not as a threat just to the Jewish community."}, {"id": "d05c88e6-79e1-4d91-a892-c6462552b7e3", "title": "Thousands turn out for pro - Palestinian Nakba Day protest in downtown Austin", "date": "2024-05-19 23:00", "url": "https://www.yahoo.com/news/thousands-turn-pro-palestinian-nakba-215257588.html", "message": "Thousands gathered to protest the Israel-Hamas war and commemorate the 76th anniversary of the Nakba, the day Palestinians were displaced from their homes in 1948.\nSeveral thousand people marched through downtown Austin on Sunday afternoon to protest and commemorate the 76th anniversary of the Nakba, when three-quarters of Palestinians were expelled from their homes.\nA peaceful May Day protest on campus called on the higher education institution to divest from weapons manufacturing companies that contribute to Israel.\nThe family of Michelle Teague and her husband, Jon Davidson, has attended nearly every pro-Palestinian protest since Oct. 7, they said.\nThis article originally appeared on Austin American-Statesman: Thousands turn out for pro-Palestinian protest in downtown Austin"}, {"id": "68377e5d-b86e-4839-93a8-a6cb5c70a87b", "title": "Mass Antisemitic Rally In Front Of Munich Synagogue Calls For Israel Eradication", "date": "2024-05-19 18:00", "url": "https://www.i24news.tv/en/news/international/europe/artc-mass-antisemitic-rally-in-front-of-munich-synagogue-calls-for-israel-s-eradication", "message": "Nearly 4,000 anti-Israel protestors turned up on Saturday in front of the main Munich synagogue demanding the obliteration of the Jewish state, according to German media reports.\nA mix of German Muslim, leftist and mainstream Germans appeared at the mass rally, according to the online German news organization NIUS.\nThere has been scarce resistance to rising antisemitism in the southern German city of Munich in the state of Bavaria.\nHe will not ban the Palestine Committee Stuttgart because he is not allowed to do that.\nIsraeli lawyers told i24 that Nopper can delete all postings of NGOs, including Palestine Committee Stuttgart, on the city website to ensure that the city does not enable Palestine Committee Stuttgart to finance the terrorist entities, Hamas and Samidoun."}, {"id": "b00d1a13-70fc-4f12-b175-625b9bca5a48", "title": "  Nakba  in a Vacuum : AP Covers 1948  Mass Expulsion , Erases Arab War of Annihilation", "date": "2024-05-19 11:30", "url": "https://www.camera.org/article/nakba-in-a-vacuum-ap-covers-1948-mass-expulsion-erases-arab-war-of-annihilation/", "message": "The selective reporting is the ultimate ruse for erasing Palestinian responsibility for their own decades-long fate.\nIt’s not that the Associated Press was unaware of the fateful steps that local Arabs, aided by five invading Arab countries in 1948, took which sealed the fate of the Palestinian Arabs.\nIn addition, the May 14 story falsely states about Palestinian refugees: “After the war, Israel refused to allow them to return.\n” In fact, as CAMERA’s Alex Safian previously reported , as a goodwill gesture during the Lausanne negotiations in 1949, Israel offered to take back 100,000 Palestinian refugees even before any discussion of the refugee question.\nUnlike the previous two stories, AP this time included some of the basic history of Arab rejectionism and belligerence which birthed the Palestinian refugee problem:"}]