[{"id": "30d6f9ab-3f7f-4e4d-8d7f-f40d4f72f5c7", "title": "Hezbollah reveals military muscle in clashes with Israel", "date": "2024-08-17 04:30", "url": "https://dunyanews.tv/en/World/831311-hezbollah-reveals-military-muscle-in-clashes-with-israel", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah reveals military muscle in clashes with IsraelWorld World Hezbollah reveals military muscle in clashes with IsraelHezbollah has gradually revealed its military capabilities in cross-border clashes with Israel.\nSince Israel and Hezbollah last went to war in 2006, the pro-Iran militant group has increased its military strength, according to analysts.\nHezbollah likely released the video to \"deter\" Israel from a major operation against it, he said.\nThe group has released three videos purportedly showing drone footage over military and other facilities in northern Israel including the port city of Haifa, and the annexed Golan Heights.\nKahwaji also said that Hezbollah wants to \"avoid provoking Israel into an all-out war\"."}, {"id": "428adea3-0b5d-48f6-99b3-d5af82ab8f05", "title": "Hezbollah footage shows  underground rocket launch site - Newspaper", "date": "2024-08-17 04:30", "url": "https://www.dawn.com/news/1852827/hezbollah-footage-shows-underground-rocket-launch-sites", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Hezbollah, the Lebanese group, published footage on Friday that appeared to show its fighters driving trucks with rocket launchers through a maze of tunnels to an apparent underground launch site.\nThe footage, four minutes and 35 seconds long, is the latest in a series of videos by the group showing its purported military capabilities.\nThe newest video depicts fighters riding motorcycles, working on laptops and driving around a dozen trucks through the rocky tunnels.\nThe video identified the facility as being named “Imad 4”, an apparent reference to Imad Mughniyeh, a shadowy Hezbollah commander killed in 2008.\nShortly after Hezbollah published its video, the Iranian embassy in Beirut said Iran had its own underground missile stations that could strike Israel."}, {"id": "343449d1-05ef-4c55-ad08-c30f3d297d57", "title": "Hezbollah reveals military muscle in clashes with Israel – Ya Libnan", "date": "2024-08-17 03:30", "url": "https://yalibnan.com/2024/08/17/hezbollah-reveals-military-muscle-in-clashes-with-israel/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Hezbollah has gradually revealed its military capabilities in 10 months of cross-border clashes with Israel, analysts say, including footage of purported underground missile facilities released Friday amid fears of all-out war.\nSince Israel and Hezbollah last went to war in 2006, the pro-Iran militant group has increased its military strength, according to analysts.\nHezbollah likely released the video to “deter” Israel from a major operation against it, he said.\n“Hezbollah began firing Katyusha rockets, drones and guided missiles at the same time to overwhelm the Iron Dome,” Helou said.\nKahwaji also said that Hezbollah wants to “avoid provoking Israel into an all-out war”."}, {"id": "20fcad10-9604-411b-b526-783044a0ee11", "title": "Drug - crazed son who stabbed his mother to death in front of shocked paramedics discovers his fate", "date": "2024-08-17 01:00", "url": "https://www.dailymail.co.uk/news/article-13751973/callum-cameron-carol-cameron-perth-stabbing.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A web developer has been found guilty of murder after stabbing his own mother to death in front of paramedics while affected by a cocktail of drugs.\nThe court heard how Ms Cameron, a 63-year-old nurse, had called paramedics in the early hours of the morning concerned her son had overdosed.\nAmbulance officers arrived and found Ms Cameron helping him drink water in his bed and he became agitated when they attempted to take him to hospital.\nHowever, when Ms Cameron further pressed him to go with the ambulance officers he went to the kitchen where he retrieved a knife and she followed him.\nHe was taken to hospital in an ambulance in which he repeatedly asked paramedics if his mother was going to be alright."}, {"id": "c0fa403e-588c-49b9-b508-09794a364f33", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike", "date": "2024-08-17 01:00", "url": "https://us.cnn.com/2024/08/16/europe/israel-uk-france-iran-retaliation-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nThe Foreign Ministers of France and Britain, Stephane Sejourne and David Lammy, meet with their Israeli counterpart Israel Katz at the Ministry of Foreign Affairs in Jerusalem on August 16, 2024.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "7f816cb7-917e-4135-a778-db26dfc7c480", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike", "date": "2024-08-17 01:00", "url": "https://www.cnn.com/2024/08/16/europe/israel-uk-france-iran-retaliation-intl-latam/", "domain": "cnn.com", "domain_classification": "International", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nThe Foreign Ministers of France and Britain, Stephane Sejourne and David Lammy, meet with their Israeli counterpart Israel Katz at the Ministry of Foreign Affairs in Jerusalem on August 16, 2024.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "2d3b7fd4-3982-4777-bd9e-997a760801bb", "title": "Muted response from united kingdom and France after Israeli FM calls for retaliation to any Iran strike - LocalNews8 . com", "date": "2024-08-17 04:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/08/16/muted-response-from-uk-and-france-after-israeli-fm-calls-for-retaliation-to-any-iran-strike/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Both France and the UK, however, have downplayed such a prospect, with the UK emphasizing the need to break the “current destructive cycle of retaliatory violence” in the Middle East.\nFrench Foreign Minister Stéphane Séjourné told a press conference in Jerusalem that it would be “inappropriate” to speak of “a retaliation or preparation for an Israeli retaliation” whilst diplomatic talks are underway.\nKatz’s declaration comes amid heightened fears of a reprisal attack from Iran, following the assassination of Hamas’ political leader Ismail Haniyeh in Tehran.\nIran has blamed Israel for Haniyeh’s death but Israel hasn’t confirmed or denied responsibility.\nI just say this, this attack from Iran has been predicted now, I think every day over the last two and a half weeks."}, {"id": "23ee669f-f9d6-4e5b-99fd-ae23401b5da2", "title": "China Expresses Alarm Over U . S . Mid - Range Missile Deployment in the Philippines", "date": "2024-08-17 04:30", "url": "https://www.devdiscourse.com/article/politics/3054010-china-expresses-alarm-over-us-mid-range-missile-deployment-in-the-philippines", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "China has raised significant concerns regarding the deployment of a U.S. mid-range missile system to the Philippines, describing the situation as 'very dramatic' and capable of destabilizing the region.\nFilipino Foreign Secretary Enrique Manalo, however, sought to placate these concerns by confirming that the missile system is only a temporary measure.\nDespite China's stance that the missile system could be 'destabilizing,' Manalo firmly disagreed, reiterating the temporary nature of the deployment.\nThe U.S. Army had transported the missile system, which can fire the Standard Missile-6 and Tomahawk Land Attack Missile, to the northern Philippines in April as part of joint military exercises with Philippine forces.\nThe situation remains tense as the U.S. and the Philippines condemn China's expanded assertions in the South China Sea, where multiple nations have overlapping territorial claims."}, {"id": "4cd6426c-fff0-4d7f-bfc8-033793244ded", "title": "  Radicalised  boy ( 16 ) who allegedly stabbed army chaplain at barracks had come to garda attention for online terror reposts", "date": "2024-08-17 03:00", "url": "https://www.independent.ie/irish-news/crime/radicalised-boy-16-who-allegedly-stabbed-army-chaplain-at-barracks-had-come-to-garda-attention-for-online-terror-reposts/a2058205876.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Within hours of chaplain Fr Paul Murphy (52) being attacked at 10.45pm on Thursday with a large bayonet-style knife at Renmore Barracks, detectives raided the family home of the boy and seized a number of devices including his laptop and mobile phones.\nThe Defence Forces had been deployed to Mali for almost 10 years where they were involved in training and peacekeeping as well as counter-terrorism missions before pulling out of the war-torn country last September.\nOriginally from Co Waterford, Fr Murphy has been a chaplain in the Defence Forces for decades and has served on a number of overseas missions.\n​Members of the Defence Forces fired a number of warning shots in an attempt to prevent the teenage suspect from further injuring the chaplain.\n“I want to thank the Defence Forces personnel and gardaí for their action and response,” he said."}, {"id": "fc3da1da-ad56-482e-a116-35f9f3c099cb", "title": "Israel Stuns By Saying US , united kingdom , France Will Assist In Offensive Strikes On Iran", "date": "2024-08-17 03:00", "url": "https://www.zerohedge.com/geopolitical/israel-stuns-saying-us-uk-france-will-assist-offensive-strikes-iran", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Foreign Minister Israel Katz said Friday that he expects not only the US but also its allies Britain and France to assist in offensive operations against Iran if it attacks.\nWhen on April 13 Iran fired hundreds of ballistic missiles and drones on Israel, US fighter jets helped intercept many of the inbound projectiles.\nBut US involvement was only defensive, and ultimately there was no direct counterstrike on targets inside Iran.\nBREAKING: A senior @WhiteHouse National Security Council official warns Iran of \"cataclysmic\" consequences if the Islamic Republic attacks #Israel.\nCertainly, Israel's goading the US into direct attacks on Iran will be met with displeasure at least behind close doors at the White House, State Dept, and Pentagon."}, {"id": "06a45d6d-7107-4dea-9176-452c32682360", "title": "Gaza ceasefire talks paused with resumption planned next week", "date": "2024-08-17 02:45", "url": "https://www.rappler.com/world/middle-east/gaza-ceasefire-talks-paused-august-16-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "On Thursday, Israel and mediators began the latest round in months of talks to end the war in Gaza, which has killed tens of thousands of Palestinians.\nA senior Hamas official, Izzat al-Rishq, told Reuters Israel “did not abide by what was agreed upon” in earlier talks, citing what mediators had told them.\nBiden says deal ‘much, much closer’In Washington, Biden said a deal was “much, much closer” than before the talks began.\nAn Israeli official said its delegation in Doha was heading home and Israeli Prime Minister Benjamin Netanyahu was expected to meet Blinken on Monday.\nWashington hopes a ceasefire agreement in Gaza can defuse the risk of a wider war."}, {"id": "4c063f2e-e536-4b07-b1a5-65404e578982", "title": "Iran may be making calculations before retaliatory attack on Israel", "date": "2024-08-17 03:30", "url": "https://www.wglt.org/2024-08-16/iran-may-be-making-calculations-before-retaliatory-attack-on-israel", "domain": "wglt.org", "domain_classification": "Unknown", "message": "Iran blamed the killing on Israel and has vowed revenge.\nNPR's Jackie Northam looks at the calculations Iran may be making ahead of any such move.\nNORTHAM: Israel has been bracing for some sort of attack since the assassination, unclear if or how it will happen.\nNORTHAM: Four months ago, Iran had to make the same calculations after its diplomatic compound in Syria was attacked, killing seven people.\nNORTHAM: One off-ramp for Iran could be the cease-fire talks between Hamas and Israel that resume this week."}, {"id": "22919f18-9ebf-4f74-8534-c29cc0a598cb", "title": "Iran may be making calculations before retaliatory attack on Israel", "date": "2024-08-17 03:45", "url": "https://www.wxxinews.org/npr-news/2024-08-16/iran-may-be-making-calculations-before-retaliatory-attack-on-israel", "domain": "wxxinews.org", "domain_classification": "Unknown", "message": "Iran blamed the killing on Israel and has vowed revenge.\nNPR's Jackie Northam looks at the calculations Iran may be making ahead of any such move.\nNORTHAM: Israel has been bracing for some sort of attack since the assassination, unclear if or how it will happen.\nNORTHAM: Four months ago, Iran had to make the same calculations after its diplomatic compound in Syria was attacked, killing seven people.\nNORTHAM: One off-ramp for Iran could be the cease-fire talks between Hamas and Israel that resume this week."}, {"id": "a45ed377-cbd5-471a-b5f2-a72f88d29068", "title": "Rajasthan Shocker : Communal Tension Grips Udaipur After Class 10 Student Stabs Another At Govt School", "date": "2024-08-17 00:45", "url": "https://www.freepressjournal.in/india/rajasthan-shocker-communal-tension-grips-udaipur-after-class-10-student-stabs-another-at-govt-school", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "Rajasthan Shocker: Communal Tension Grips Udaipur After Class 10 Student Stabs Another At Govt School | FileCommunal tension erupted in the lake city of Udaipur, Rajasthan after a class 10 student stabbed another at a government school on Friday.\nThe accused absconded after the incident, while the injured student was rushed to the Maharana Bhupal (MB) Hospital, where he is undergoing treatment.\nAs the tension escalated shops in Chetak Circle, Hathipole, Ashwini Bazaar, Bapu Bazaar and Ghantaghar area of ​​the city were shut down.\nUdaipur ASP City Umesh Ojha said that police forces are deployed in almost all areas of the city.\nNotably, two years ago, the Udaipur Citybhad witnessed the beheading incident of tailor Kanhiya Lal by two radical Muslim men."}, {"id": "aab63229-70ae-4835-b8c0-3e96d002fe0f", "title": "Israel - Hamas War day 315 : What happening in Israel and West Bank ? ", "date": "2024-08-17 04:15", "url": "https://www.jpost.com/israel-hamas-war/2024-08-17/live-updates-815086", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Launch of an Iranian satellite at Imam Khomeini Spaceport in Iran's rural Semnan province.\n28 January 2024.\n(photo credit: AP)In a significant move to enhance its intelligence-gathering capabilities, Iran is actively pursuing partnerships with two Chinese satellite companies, according to a Friday report by The Washington Post citing Western security officials.\nThe collaboration, primarily involving Iran’s Islamic Revolutionary Guard Corps (IRGC), includes delegation exchanges with Chinese firms specializing in remote-sensing satellite technology."}, {"id": "61238179-da73-433e-a2ac-a3f9316468fc", "title": "Russian diplomat sees US  approval  behind attack on gas pipelines - Newspaper", "date": "2024-08-17 04:30", "url": "https://www.dawn.com/news/1852832/russian-diplomat-sees-us-approval-behind-attack-on-gas-pipelines", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "MOSCOW: Russia’s ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\nThe Wall Street Journal reported on Thursday that Ukraine’s top military commander approved the 2022 attack on the gas pipelines despite a warning from the US Central Intelligence Agency to Ukrainian President Volodymyr Zelenskiy not to carry out the attack.\n“They seek to shift all responsibility to their Ukrainian puppets,” Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n“We will seek to identify the real perpetrators of the bombing and punish them.” Russia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine — which has repeatedly denied involvement — was behind the attack."}, {"id": "df587c2d-c2c8-4eac-9cdc-d33193d378e6", "title": "US official says Mideast mediators are preparing for implementation of cease - fire deal in advance", "date": "2024-08-17 01:15", "url": "https://www.13abc.com/2024/08/16/us-official-says-mideast-mediators-are-preparing-implementation-cease-fire-deal-advance/", "domain": "13abc.com", "domain_classification": "Unknown", "message": "It was unclear what measures were being taken, but the official said a new “implementation cell” was being established in Cairo in advance.\nThe comments came hours after mediators expressed hope that a deal was within reach.\nBlinken was expected to meet with Netanyahu on Monday to discuss the new deal, said an Israeli official who spoke on the condition of anonymity in line with official requirements.\nIn a clear message to Israel, Hezbollah released a video, with Hebrew and English subtitles, showing underground tunnels where trucks were transporting long-range missiles.\nHezbollah started attacking Israel on Oct. 8 and says it will stop only when the Gaza war ends."}, {"id": "0bc67196-2e59-41e3-830d-1ef2f58ee7b1", "title": "Rajasthan : Internet suspended , section 144 imposed in Udaipur after school stabbing incident sparks communal tensions", "date": "2024-08-17 03:00", "url": "https://www.livemint.com/news/rajasthan-internet-suspended-section-144-imposed-in-udaipur-after-school-stabbing-incident-sparks-communal-tensions-11723855067665.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "The Rajasthan government has imposed a 24-hour internet shutdown in Udaipur following communal tensions that erupted after a Class 10 student allegedly stabbed another boy at a government school on Friday.\n#WATCH | Udaipur, Rajasthan: Force deployed in the city after a clash broke out between two children, earlier todaySection 144 has been imposed in the city by Arvind Poswal, District Collector of Udaipur to maintain law and order here.\npic.twitter.com/z0k2FgFGxt — ANI MP/CG/Rajasthan (@ANI_MP_CG_RJ) August 16, 2024Here's what happened in Udaipur school According to reports from news agency PTI, the reason behind the stabbing at the government school in Bhattiyani Chohatta is not yet clear.\nHowever, giving details on the incident, Arvind Poswal, District Collector Udaipur told news agency ANI, \"This incident took place in the early hours.\nIt is our duty to maintain peace in the city.”#WATCH | Rajasthan: Arvind Poswal, District Collector Udaipur says, \"This incident took place in the early hours today."}, {"id": "976984bb-fdca-48fe-81b3-f412187283d7", "title": "Kolkata doctor rape - murder : Select Mumbai private hospitals to halt OPD services in protest", "date": "2024-08-17 03:45", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/kolkata-doctor-rape-murder-select-mumbai-private-hospitals-to-halt-opd-services-in-protest-23376341", "domain": "mid-day.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTThe attack took place as doctors were protesting the rape and murder of a trainee doctor on the hospital premises.\nA representative from Jaslok hospital confirmed that the facility will shut down routine outpatient services in accordance with the IMA’s call but will keep emergency services operational.\n“Patients who visit the hospital will be referred to emergency services,” the spokesperson said.\nRoutine outpatient services at the hospital will be affected, though emergency and casualty departments will continue to function.\nOur hospital sees about 500 patients daily for routine outpatient services, and we estimate that our absence will impact at least half of them,” said Miet Shah, a third-year resident at the hospital."}, {"id": "53725cf6-2fef-43c8-a512-b6eafd5dc6d5", "title": "A Florida couple won $3 , 300 at the casino . Two men then followed them home and shot them . ", "date": "2024-08-17 03:45", "url": "https://www.yahoo.com/news/florida-couple-won-3-300-205739288.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Florida couple won $3,300 at the casino.\nA Florida couple is grateful to be alive after two masked men attacked, robbed and shot them as they returned home from a date night at a casino, according to authorities.\nI was hysterical, I screamed and cried,\" Chambliss told the TV station about what she thought when the robbers shot Delacruz.\n\"We don't get to do it often just because we both work extremely hard,\" Chambliss told the station.\nThis article originally appeared on USA TODAY: Florida couple ambushed, shot after winning $3,300 at Hard Rock casino"}, {"id": "2d38c9a4-8522-459b-b856-6514600974a4", "title": "Homeless man indicted for stabbing spree in Ozone Park that left two men injured : DA – QNS", "date": "2024-08-17 00:15", "url": "https://qns.com/2024/08/homeless-man-indicted-stabbing-spree-ozone-park-two-injured/", "domain": "qns.com", "domain_classification": "Unknown", "message": "A homeless man was arraigned on attempted murder charges for allegedly stabbing a grandfather at an Ozone Park subway station, moments after he allegedly stabbed a motorist pumping gas at a Mobil station on North Conduit Avenue.\nSign up for our QNS email newsletter to get news, updates, and local insights delivered straight to your inbox!\nA homeless man from Brooklyn was indicted by a Queens grand jury for a stabbing spree that left two men wounded in Ozone Park during the evening of Wednesday, Aug. 7.\nHe walked up to a 67-year-old grandfather and allegedly stabbed him once in the neck before entering the subway tracks.\nHe was apprehended minutes later by police from the 106th Precinct in Ozone Park after they found him hiding beneath the platform along the Rockaway-bound tracks."}, {"id": "aa4e6807-0657-4138-a87d-d455ffbfa9a7", "title": "China got  very dramatic  after the US military flew a new missile system out to the Western Pacific , ally says", "date": "2024-08-17 04:30", "url": "https://news.yahoo.com/news/china-got-very-dramatic-us-171019607.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "China got 'very dramatic' after the US military flew a new missile system out to the Western Pacific, ally saysChina had a \"very dramatic\" reaction to the US deploying a new missile system in the Western Pacific, the Philippines' top diplomat said.\nThe weapon in question is the Mid-Range Capability, or Typhon, missile system, a new US military asset that was deployed in April during a joint US-Philippines training.\nManalo said that while he and Yi discussed the situation, \"they made it very dramatic\" but that he reassured Yi he shouldn't be worried.\nThe Mid-Range Capability system is ground-based and versatile, capable of firing both the Standard Missile 6 and Tomahawk Land Attack Missile.\nThe USS Savannah fires a Standard Missile 6 from a containerized launching system during a test in the eastern Pacific Ocean."}, {"id": "f8a1f746-be94-44d0-990d-910b5f6d18ed", "title": "Six killed in alleged Israeli strike in Lebanon , health ministry says", "date": "2024-08-17 01:00", "url": "https://www.jpost.com/breaking-news/article-815081", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An alleged Israeli airstrike early Saturday had killed six people and wounded three others in the Nabatieh region in south Lebanon of the country, the health ministry said.\nThe number was later updated to nine killed and four wounded by Hezbollah-affiliated media outlets in the country.\nAl-Manar, one of Lebanon's Hezbollah-affiliated outlets, reported that some of those hit by the strike had Syrian citizenship.\nThe strike allegedly hit the home of a family of 12, Ynet published, citing local reports.\nThe local report claimed that some of those killed in the strike were children."}, {"id": "8201ae09-a0ce-471f-baa5-def25ef0b5c8", "title": "Santa Fe High School Civil Trial : Jury now deliberating in case", "date": "2024-08-17 01:00", "url": "https://www.fox26houston.com/news/santa-fe-high-school-civil-trial-jury-now-deliberating-case", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "In the closing arguments of the 2018 Santa Fe High School shooting trial, attorneys presented starkly contrasting views on the responsibility for the tragedy.\nPREVIOUS COVERAGE: Santa Fe HS shooting civil trial day 5: Survivor, victim's parents recount harrowing experiencePREVIOUS COVERAGE: Santa Fe High School shooting civil trial: Plaintiff, co-defendants counsel present opening statementsMcGuire argued that the case revolves around issues of justice and accountability, pointing to Dimitrios Pagourtzis, the accused shooter, and his parents, Antonio Pagourtzis and Rose Marie Kosmetatos.\nThe plaintiffs' attorney also pointed out inconsistencies in the parents' claims about their awareness of their son's mental state.\nIn contrast, Lori Laird, the defense attorney for the Pagourtzis parents, urged the jury to focus on the facts and not let emotions cloud their judgment.\nShe contended that Dimitrios Pagourtzis acted independently, purchasing the ammunition and carrying out the attack without his parents' consent or knowledge."}, {"id": "336df35b-4eba-41a0-b750-3a452c9bc2d6", "title": "Violent Israeli Colonization Surges in Gaza , as Peace Talks Hang in Balance", "date": "2024-08-17 03:00", "url": "https://sputnikglobe.com/20240817/violent-israeli-colonization-surges-in-gaza-as-peace-talks-hang-in-balance-1119799188.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240817/violent-israeli-colonization-surges-in-gaza-as-peace-talks-hang-in-balance-1119799188.htmlViolent Israeli Colonization Surges in Gaza, as Peace Talks Hang in BalanceViolent Israeli Colonization Surges in Gaza, as Peace Talks Hang in BalanceSputnik InternationalLeila Hatoum, a Lebanese-based journalist, economist, and geopolitical analyst joined Sputnik’s Fault Lines on Friday to discuss the tension in the Middle East as well as the colonization of Israeli settlers on Palestinian land.\n2024-08-17T00:39+00002024-08-17T00:39+00002024-08-17T00:39+0000analysispalestiniansdohaisraelhamaswest bankmiddle eastusmilitaryisrael-gaza conflicthttps://cdn1.img.sputnikglobe.com/img/07e8/08/10/1119799745_0:160:3072:1888_1920x0_80_0_0_d27689bc27291ee65935571f3fa41ffd.jpgOn Tuesday, it was reported that a senior Iranian security official had warned that if Israel’s ceasefire talks with Hamas fell through then Iran would attack Israel.\nThe attack would be in response to the assassination of Hamas political chief Ismail Haniyeh who was visiting Iran at the time of his killing.\nThe riot, which occurred in the village of Jit, resulted in the killing of one Palestinian and the serious injuries of others, Palestinian health officials said.\n\"Anybody who was kicked out of the United States basically 300 years ago can come now to the US, start shooting people and killing them and telling them, 'this is my land.'\""}, {"id": "79b8bf47-cec0-4c74-b9de-12b5b970f08b", "title": "Irish authorities investigating stabbing of Catholic chaplain as possible terror incident", "date": "2024-08-17 01:00", "url": "https://www.myspiritfm.com/News?view=post&blogid=Catholic%2DNews&articleid=278151", "domain": "myspiritfm.com", "domain_classification": "Unknown", "message": "Military authorities in Ireland are investigating the stabbing of a Catholic chaplain as a potential terrorist attack, according to media reports on Friday.\n\"I want to thank defence forces personnel & Gardai for their action and response,\" the prime minister said.\nI have been briefed on the shocking incident outside Renmore Barracks last night & my thoughts are with the member of the defence forces in hospital.\nI want to thank defence forces personnel & Gardai for their action and response.\n— Simon Harris TD (@SimonHarrisTD) August 16, 2024The Irish Independent, meanwhile, reported that the incident is being investigated as a possible terror attack."}, {"id": "90a8a742-2ce2-4598-b05b-75adbc697d5c", "title": "National Award has validated my personal vision : Mukesh Gautam | Punjabi Movie News", "date": "2024-08-17 04:30", "url": "https://timesofindia.indiatimes.com/entertainment/punjabi/movies/news/national-award-has-validated-my-personal-vision-mukesh-gautam/articleshow/112570203.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Filmmaker Mukesh Gautam , and his family, including daughter Yami Gautam , are celebrating yet another addition of National Film Awards in the Gautam household.\nMukesh’s film Baghi Di Dhee has bagged Best Punjabi Film in the 70th National Film Awards announced on Friday.\n“Someone was mentioning that first my son-in-law won the National Award, next I did, and perhaps Yami too may be in line for the award next year for Article 370,” laughs Mukesh.He adds, “Of course, it feels wonderful at winning the award.\n“When I made Ek Noor, it was a period in Punjabi film history that wasn’t as commercial and bereft of stars like Diljit (Dosanjh) and Gippy (Grewal).\nI have made at least four docudramas, including on Sufi poets like Waris Shah, which also won the National Radio and TV award,” he says."}, {"id": "d1ea1d0f-1a18-4354-9e7b-7bb18bbd0bac", "title": "Blind elderly man stabbed in South Seattle , SWAT arrest suspect", "date": "2024-08-17 03:00", "url": "https://www.fox13seattle.com/news/blind-man-stabbed-columbia-city", "domain": "fox13seattle.com", "domain_classification": "Unknown", "message": "articlePolice arrested a man accused of stabbing a 60-year-old blind person in Seattle's Columbia City neighborhood Sunday evening.\nPolice said the victim, who is blind, was struck in the head with a cane by the suspect.\nCane used as a weapon in the stabbing of an elderly blind man in Columbia City.\nThe SWAT Team was given a search warrant to enter the home and arrest the man.\nDuring the arrest, officers recovered a switchblade believed to be used in the stabbing, along with two additional knives."}, {"id": "da86238f-d8bb-4f4c-87c2-789c3ca7569a", "title": "Secret Service pulls from Biden protective team to guard Trump", "date": "2024-08-17 03:00", "url": "https://timesofindia.indiatimes.com/world/us/secret-service-pulls-from-bidens-protective-team-to-guard-trump/articleshow/112579985.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "But the increased threat of violence against Trump, combined with Biden's recent reduced travel schedule, made the step both necessary and feasible, the official added.A White House spokesperson had no immediate comment, and a Trump campaign spokesperson declined to comment.The Secret Service has been under a cloud since July 13, when an assailant was able to fire, unimpeded, on Trump at an outdoor campaign rally in Butler, Pennsylvania.\nThe attack grazed Trump's ear, killed a spectator and seriously wounded two others.\nThe FBI is investigating, and congressional leaders have also opened inquiries.The Secret Service has taken responsibility for the security lapses that made the shooting possible.\nThe steps the Secret Service is taking are a natural part of its asymmetrical approach to assure their no-fail mission is fulfilled.\n\"We're going to go back in October,\" he said in an interview with billionaire entrepreneur Elon Musk this week."}, {"id": "14037383-0b90-4271-80af-1a7ba7843a14", "title": "Police Officer Who Shot & Killed Family Dog Rehired in Ohio", "date": "2024-08-17 02:45", "url": "https://www.yahoo.com/news/police-officer-shot-killed-family-010000193.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Lorain police officer hit the headlines last year after he shot and killed a dog named Dixie.\nThe tragic incident sparked a public outcry in Ohio as they demanded justice for the dog, a 3-year-old Labrador mix.\nMellenie explains although she got a hold of two of the dogs, Dixie started running because of the officer screaming.\nThe pup was “in the middle of the street on the yellow lines” and “no way near him or charging him” when the officer fatally shot Dixie.\nThe 3-year-old pup had no biting incidents and was “one of the most lovable dogs ever possible.”The post Police Officer Who Shot & Killed Family Dog Rehired in Ohio appeared first on DogTime."}, {"id": "c0962055-30ab-44c7-a1d6-79b4191ca1f5", "title": "Robert Kennedy assassin Sirhan Sirhan , inmate at Donovan prison , rejected for parole", "date": "2024-08-17 03:00", "url": "https://www.nbcsandiego.com/news/local/robert-kennedy-assassin-sirhan-sirhan-inmate-at-donovan-prison-rejected-for-parole/3599647/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Sirhan Sirhan, the man convicted of assassinating Sen. Robert F. Kennedy in 1968 at Los Angeles' Ambassador Hotel, was denied Friday in his latest bid for parole.\nIt marks the 17th parole hearing for Sirhan.\nIn 2021, a two-person state parole panel recommended that Sirhan be granted parole, but Gov.\n\"After decades in prison, Mr. Sirhan has failed to address the deficiencies that led him to assassinate Senator Kennedy,\" the governor said in a statement rejecting the parole grant.\n\"Mr. Sirhan lacks the insight that would prevent him from making the same types of dangerous decisions he made in the past.\""}, {"id": "476ac82a-a61b-45bc-8d49-b6dce2e985d4", "title": "US watches closely as Ukrainian forces push into Russia with US - provided arms", "date": "2024-08-17 01:00", "url": "https://www.yahoo.com/news/us-watches-closely-ukrainian-forces-234559335.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The US has watched closely as Ukrainian forces pushed deeper into Russian territory, powered in part by US-provided arms and equipment that have raised questions about whether Kyiv has abided by the Biden administration’s restrictions on the use of American weaponry.\nUS-made Humvees were seen entering Russia’s Kursk oblast through the Ukraine-Russia border crossing near Sudzha, Russia, on Tuesday in a Reuters photograph.\nUkraine has also used HIMARS rocket launchers as part of the operation, officials said, but the vehicles appear to have remained in Ukrainian territory, using the range of its GMLRS missile to hit Russia.\nUkraine has used the missiles to strike Russian air defense systems in Russian-occupied Crimea.\nUkraine says it has seized approximately 400 square miles of territory inside Russia, forcing Russian authorities to declare emergencies and carry out large-scale evacuations."}, {"id": "11ef85e8-966f-44d1-8ef6-61c7a10a3f73", "title": "US watches closely as Ukrainian forces push into Russia with US - provided arms", "date": "2024-08-17 01:00", "url": "https://www.cnn.com/2024/08/16/politics/us-watch-ukraine-push-into-russia/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —The US has watched closely as Ukrainian forces pushed deeper into Russian territory, powered in part by US-provided arms and equipment that have raised questions about whether Kyiv has abided by the Biden administration’s restrictions on the use of American weaponry.\nUS-made Humvees were seen entering Russia’s Kursk oblast through the Ukraine-Russia border crossing near Sudzha, Russia, on Tuesday in a Reuters photograph.\nUkraine has also used HIMARS rocket launchers as part of the operation, officials said, but the vehicles appear to have remained in Ukrainian territory, using the range of its GMLRS missile to hit Russia.\nUkraine has used the missiles to strike Russian air defense systems in Russian-occupied Crimea.\nUkraine says it has seized approximately 400 square miles of territory inside Russia, forcing Russian authorities to declare emergencies and carry out large-scale evacuations."}, {"id": "ae104b06-52e0-4899-b79f-6b72b6c17d12", "title": "Texas jurors are deciding if a student parents are liable in a deadly 2018 school shooting", "date": "2024-08-17 03:00", "url": "https://www.wsbradio.com/news/national/texas-jurors-are/KIUMJ53NVBBJ7IQFKRMWEUDSC4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "2de8b776-fcde-4319-bfdc-8c47b4b07f6d", "title": "National strike held over India doctor murder", "date": "2024-08-17 04:15", "url": "https://www.yahoo.com/news/national-strike-held-over-india-034552609.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Protests demanding justice for the murdered woman and greater protection for women in general have been held across India [Reuters]Doctors in India have begun a national strike, escalating the protest against the rape and murder of a female colleague in the West Bengal city of Kolkata.\nThe Indian Medical Association (IMA), the country's largest grouping of doctors, said all non-essential hospital services would be shut down across the country on Saturday.\nIn a statement, the IMA said emergency and casualty services would continue to run and that the strike would last for 24 hours.\nDoctors at some government hospitals announced earlier this week that they were indefinitely halting elective procedures.\nProtests have also been held in many other Indian cities like Delhi, Hyderabad, Mumbai and Pune."}, {"id": "1f2cf70f-ebda-4348-a9ed-bd29a6280bb8", "title": "Woman Pleads Not Guilty to Murdering Wife With Sword", "date": "2024-08-17 03:45", "url": "https://mynewsla.com/crime/2024/08/16/woman-pleads-not-guilty-to-murdering-wife-with-sword/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A woman pleaded not guilty Friday to charges that she fatally stabbed her wife with a sword and attacked her mother-in-law in San Dimas.\nWeichien Huang, 44, is charged with one count each of murder and attempted murder stemming from the alleged attack on July 18.\nInvestigators determined upon further investigation that Huang and her wife were engaged in an argument at their residence moments before Huang attacked her with a sword, according to sheriff’s officials.\nHuang’s wife was identified by the medical examiner as Chen Chen Fei, who was pronounced dead at the scene, according to sheriff’s officials.\n“At some point, Huang attacked Fei with a sword."}, {"id": "df27a898-b7df-4fd1-84b5-8e515cc13bba", "title": "Factorio : Space Age shows off terrifying new Pentapod creatures", "date": "2024-08-17 02:30", "url": "https://www.destructoid.com/factorio-space-age-shows-off-terrifying-new-pentapod-creatures/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "But every Friday, developer Wube Software has been showcasing a new feature, system, or element that will be present in Factorio: Space Age.\nAnd today, they revealed our first new threat in the expansion: terrifying Pentapod creatures.\nThe new creatures featured by Wube in today’s Factorio Friday Facts are Pentapod’s, almost starfish-looking creatures with five limbs.\nPerhaps most interesting about the reveal is that all of these creatures seem to be exclusive to the planet Gleba, one of four new planets coming in Factorio: Space Age.\nFactorio: Space Age looks like it’s going to have a ton of content for an expansion, and I simply can’t wait to explore everything new it has to offer when it releases on October 21, 2024."}, {"id": "0f9e6b89-30b5-46a8-a575-3e6f4fa7d94e", "title": "Iran Update , August 16 , 2024 | Institute for the Study of War", "date": "2024-08-17 01:00", "url": "https://www.understandingwar.org/backgrounder/iran-update-august-16-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, August 16, 2024Annika Ganzeveld, Andie Parry, Kathryn Tyson, Alexandra Braverman, Ria Reddy, Johanna Moore, and Brian CarterInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nThe United States recently warned Iran that an Iranian attack on Israel could trigger a “robust military response” from Israel.\nThere are some indications that Iran will wait until the current ceasefire negotiations conclude to conduct an attack on Israel.\nNumerous Friday prayer leaders vowed on August 16 that Iran will give a “harsh” and “tooth-breaking” response to Israel for killing Haniyeh.\n[80]South African Navy Commander Admiral Monde Lobese discussed naval cooperation and maritime security with Iranian security officials in Iran between August 11 to August 16."}, {"id": "1e31b432-53d1-4c24-bc1f-c65c67839f32", "title": "Multiple MT Bridges Need Replacing For Sentinel Missile Project", "date": "2024-08-17 03:00", "url": "https://catcountry1029.com/ixp/1106/p/montana-bridge-replacements/", "domain": "catcountry1029.com", "domain_classification": "Unknown", "message": "By now, you've probably heard the rumblings about the Sentinel Missile Project and the major upgrade that the system will receive in the coming years.\nAs part of the project, 11 bridges in the Lewistown area will need to be replaced.\nThe Montana Department of Transportation nominated an additional three bridges needing replacement.\nNine of the 11 bridges to be replaced in Montana Montana Department of Transportation loading...Three of the 11 bridges to be replaced in Montana Montana Department of Transportation loading...\nSentinel Missile Program In MontanaAccording to the Air Force Global Strike Command, Sentinel is the weapon system proposed to replace the aging Minuteman III intercontinental ballistic missile system."}, {"id": "6cb43c4a-e72d-47ad-8a86-ed79f0768637", "title": "What the Heck Was Zelenskyy Thinking ? - The Daily Reckoning", "date": "2024-08-17 00:15", "url": "https://dailyreckoning.com/what-the-heck-was-zelenskyy-thinking/", "domain": "dailyreckoning.com", "domain_classification": "Unknown", "message": "What the Heck Was Zelenskyy Thinking?\nThe soldiers will be killed or captured, and the equipment will wind up in Russian war museums.\nThe Russian Way of WarBy Byron KingWith over a thousand years of history behind them, Russians definitely know a few things about fighting wars on their own territory.\nThink of the Spanish-American War, World War I, World War II, Korea, Vietnam, the Cold War in Europe and serial wars in the Middle East since the 1990s.\nIn other words, Russian military power is the first derivative of Russia’s national energy and industrial economy."}, {"id": "8fa7b1e2-371b-4301-97f2-3246a6ba7907", "title": "Japan to survey Alaskan island in hopes of recovering WWII dead", "date": "2024-08-17 02:45", "url": "https://english.kyodonews.net:443/news/2024/08/0c2fb1a7e69e-japan-to-survey-alaskan-island-in-hopes-of-recovering-wwii-dead.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "Some 2,600 Japanese soldiers died on Attu Island in May 1943, according to the Ministry of Health, Labor and Welfare, in a doomed attempt to hold the northern Pacific island, captured in June 1942, from over 10,000 U.S. personnel.\nRemains of around 320 soldiers were recovered in 1953, but later inspections in 2007 and 2008 did not culminate in the collection of any remains.\nThe United States will provide a boat for the upcoming five-day survey that will include the inspection of roads and runways and confirmation of the location of remains of the Japanese war dead.\nDuring the trip next week, the participants plan to also visit a U.S. military base in Alaska and offer prayers at a cenotaph to Japanese soldiers.\nYamazaki's grandfather, Yasuyo Yamazaki, commanded the Japanese forces on Attu Island and led the men to their death under orders from the headquarters."}, {"id": "0b276867-8528-47c3-9be3-9f098b8a605a", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-08-17 03:30", "url": "https://gamingbolt.com/page/5496?action_type_map=fp781524", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "There would be only a few people who don't know anything about video games and those who know even a bit about games the few of the very first name they'll be able to recall would be street fighter .\n... Read More"}, {"id": "dd30d403-ba57-443c-af1a-5d9fd785630e", "title": "US sanctions comparable to  war crime  ", "date": "2024-08-17 02:45", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66bfd6ada31060630b923844.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The letter said the unilateral application of certain economic sanctions by Washington constitutes collective punishment, \"which is considered a war crime\" and prohibited by the Geneva Conventions.\nCollective punishment has become a standard practice of US foreign policy through sanctions, and the US imposes them more than any other country, the letter said.\nHundreds of millions of people currently live under the sanctions, and notable cases include Cuba, Iran, Syria and Venezuela.\nIt cited comments by Mike Pompeo, former US secretary of state, about the effectiveness of the Donald Trump administration's sanctions against Iran.\nEconomic crisis\"I saw firsthand how unilateral coercive measures in the form of economic sanctions have constrained the government's fiscal ability to implement their social protection programs and deliver basic public services,\" Fakhri wrote in his report."}, {"id": "04805fec-ef03-41f5-af48-46bb7cbfea26", "title": "US sanctions comparable to  war crime  ", "date": "2024-08-17 03:00", "url": "https://global.chinadaily.com.cn/a/202408/17/WS66bfd6ada31060630b923844.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The letter said the unilateral application of certain economic sanctions by Washington constitutes collective punishment, \"which is considered a war crime\" and prohibited by the Geneva Conventions.\nCollective punishment has become a standard practice of US foreign policy through sanctions, and the US imposes them more than any other country, the letter said.\nHundreds of millions of people currently live under the sanctions, and notable cases include Cuba, Iran, Syria and Venezuela.\nIt cited comments by Mike Pompeo, former US secretary of state, about the effectiveness of the Donald Trump administration's sanctions against Iran.\nEconomic crisis\"I saw firsthand how unilateral coercive measures in the form of economic sanctions have constrained the government's fiscal ability to implement their social protection programs and deliver basic public services,\" Fakhri wrote in his report."}, {"id": "8e5fd20b-d2fc-4935-98ce-40616b4ae27a", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | The Standard", "date": "2024-08-17 02:45", "url": "https://www.standard.net.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "11ffa276-5703-4e64-997e-c46e541563e4", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | The Examiner", "date": "2024-08-17 03:45", "url": "https://www.examiner.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "ffedc8f1-3e95-4381-acf8-9084c2649f7f", "title": "Gallipoli peninsula : ﻿Wildfire threatens ANZAC war graves in Turkey", "date": "2024-08-17 00:15", "url": "https://www.9news.com.au/national/gallipoli-peninsula-wildfire-threatens-anzac-war-graves-in-turkey/f7ec2326-ac73-40f2-8f7c-3a62ab2eb985", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Wildfires that threatened the graves of Australian soldiers at ANZAC Cove in Gallipoli, Turkey , have been brought under control, though the threat remains.\nDry, hot, and windy weather conditions sparked a series of fires that quickly spread across the Gallipoli Peninsula , affecting several commemorative and operational sites.\nIt has not yet been confirmed whether Australian war graves and memorials have been damaged.\nAn aerial shot shows part of the extinguished wildfire area at the Anzac Cove beach.\nWe understand there are efforts underway to control fires that are burning on the Gallipoli Peninsula,\" Albanese said."}, {"id": "a64c0c60-7d98-4551-bd99-e479d4658462", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | Bendigo Advertiser", "date": "2024-08-17 00:00", "url": "https://www.bendigoadvertiser.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "b1d5dfdc-12fe-43f5-b114-594a0298169e", "title": "Roy Woodward recalls Battle of Coral - Balmoral in Vietnam | Bendigo Advertiser", "date": "2024-08-17 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8727929/roy-woodward-recalls-battle-of-coral-balmoral-in-vietnam/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Roy, who lives in Victor Harbor, South Australia, was involved in the Battle of Coral-Balmoral, which ran from May 12 - June 6, 1968.\nAccording to the Department of Veterans' Affairs, it was an attack on Fire Support Base (FSB) Coral, about 7km north of Tan Uyen.\nThe base, set up by Australian and New Zealand forces, was used to \"intercept and disrupt\" the enemy from entering or leaving Saigon."}, {"id": "537577fd-9ded-4f0a-8ac8-5498596701a5", "title": "Russia alleges NATO hidden hand in Ukraine Kursk offensive", "date": "2024-08-17 02:45", "url": "https://tribune.com.pk/story/2488726/russia-alleges-natos-hidden-hand-in-ukraines-kursk-offensive", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A key aide to Russian President Vladimir Putin alleged on Friday that the West, particularly the US-led NATO alliance, had a hand in planning Ukraine's recent surprise attack on Russia's Kursk region.\nUkraine justified the incursion as necessary to compel Russia, which had invaded Ukraine in February 2022, to engage in \"fair\" peace talks.\nHis comments implied that Ukraine's first acknowledged incursion into sovereign Russian territory carries a significant risk of escalating the conflict.\nDespite the relatively small scale of the incursion, for Putin, it represents a significant escalation and crosses a critical red line.\nRussia's defense ministry released footage that it claimed showed a Russian drone destroying a US-made Stryker armored combat vehicle in the Kursk region."}, {"id": "90078e6d-9c64-4d56-9de4-848487e60870", "title": "The Crown Jewel Of American Socialism", "date": "2024-08-17 03:00", "url": "https://www.zerohedge.com/political/crown-jewel-american-socialism", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "I have a right to get my money back.”President Roosevelt signs the Social Security Bill on August 14, 1935.\nThe money also does not go into a Social Security retirement fund or a food-stamp emergency fund that earns interest.\nThe money that is being used to fund Social Security today is being seized by the IRS from their children and grandchildren and their peers.\nProponents of Social Security claim that their support of this socialist program demonstrates their care and compassion.\nToday, so many people are convinced that if Social Security were repealed today, there would be people dying in the streets tomorrow."}, {"id": "44049ea1-bdc4-458e-a8fb-7b4bc83405fb", "title": "What to watch on TV and streaming today : Emily in Paris , Saving Private Ryan and Girls Aloud at the BBC", "date": "2024-08-17 04:30", "url": "https://www.independent.ie/entertainment/television/what-to-watch-on-tv-and-streaming-today-emily-in-paris-saving-private-ryan-and-girls-aloud-at-the-bbc/a440553964.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Attack on Pearl Harbor: Minute by Minute RTÉ2, 7.30pm New three-part documentary focusing on the Japanese raid that led to America entering World War II.\nGirls Aloud at the BBCGirls Aloud at the BBC BBC Two, 9.10pm Clips from the archive featuring Sarah Harding, Kimberley Walsh, Nadine Coyle, Cheryl Tweedy and Nicola Roberts.\nEmily in Paris Netflix, streaming now Emily might be technically single, but her heart and mind are still intertwined with two love interests.\nThe Union Netflix, streaming now Brace yourselves.\nHalloween Ends Netflix, streaming now And now for something completely different — a summer blockbuster that’s Halloween-themed!"}, {"id": "1f43845e-d958-4611-9516-4371bb5de4bd", "title": "Crackdown on cross - border crime urged", "date": "2024-08-17 02:45", "url": "http://europe.chinadaily.com.cn/a/202408/17/WS66bfe643a31060630b92388c.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The informal discussion between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug 16, 2024.\nThe pledge was made at an informal discussion among foreign ministers from the four countries in Chiang Mai, Thailand.\nStatistics showed that under cooperation among the four countries, more than 50,000 criminals involved in gambling-related fraud have been arrested since the joint efforts were launched a year ago.\nOnly through increased joint efforts by regional countries can the trend of high incidences of these illegal activities be effectively countered and reversed, Wang said.\nThailand and Laos have both expressed hope that Myanmar will realize peace and stability, saying they are willing to provide assistance to the country."}, {"id": "ca44c4d4-821d-40bd-a981-e1b0928794b6", "title": "Crackdown on cross - border crime urged", "date": "2024-08-17 04:15", "url": "http://usa.chinadaily.com.cn/a/202408/17/WS66bfe643a31060630b92388c.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The informal discussion between the Foreign Ministers of China, Laos, Myanmar and Thailand is held in Chiang Mai, Thailand, Aug 16, 2024.\nThe pledge was made at an informal discussion among foreign ministers from the four countries in Chiang Mai, Thailand.\nStatistics showed that under cooperation among the four countries, more than 50,000 criminals involved in gambling-related fraud have been arrested since the joint efforts were launched a year ago.\nOnly through increased joint efforts by regional countries can the trend of high incidences of these illegal activities be effectively countered and reversed, Wang said.\nThailand and Laos have both expressed hope that Myanmar will realize peace and stability, saying they are willing to provide assistance to the country."}, {"id": "9404b014-9371-45e0-b0c7-91b6354b6ae7", "title": "Battle Star Wars - Legend Xtra", "date": "2024-08-17 04:15", "url": "https://www.tvguide.co.uk/schedule/17e36c9e-e4fe-5dc8-a4d7-4192a17be18e/battle-star-wars", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Battle Star Wars (2019)Legend Xtra 10:00 AM to 11:50 AM Saturday 17 August Share Add toCalendar +Battle Star WarsWhen the leader of the evil Coalition threatens to destroy a Rebel planet for its resources, his daughter has no choice but to join the Rebel side and fight for what is right.\nSci-fi drama, starring Alyson Gorske, Aimee Stolte and Justin BertiBattle Star Wars airs on Legend Xtra at 10:00 AM, Saturday 17 August .\nCertificate PGTopics Movie ➝ Drama Science Fiction"}, {"id": "b722a426-f1f2-42db-9463-11518ad67641", "title": "RMT seeks to rein in strike action by Royal Fleet Auxiliary seafarers to aid Labour government war agenda", "date": "2024-08-17 01:00", "url": "https://www.wsws.org/en/articles/2024/08/16/wcqr-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The RMT leader is acting to rein in his members based on support for the Labour government’s war agenda.\nThis is based on a transactional agreement to support war.\nThe RMT represents 500 members at the RFA from deckhands, engine, communications, catering staff and security staff.\nThe first day of strike action was used by Nautilus to warn the Labour government it was sitting on wider opposition.\nLynch in a July 11 update to members at RFA members described meeting with the MOD and new Armed Forces Minister Luke Pollard MP, as a breath of fresh air."}, {"id": "02551a48-fbd6-4b8d-9c96-21317bad94cd", "title": "Kotaku Weekend Guide : 5 New And Old Games We Cant Wait To Play", "date": "2024-08-17 00:45", "url": "https://www.kotaku.com.au/2024/08/kotakus-weekend-guide-5-new-and-old-games-we-cant-wait-to-play/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "We’ve got pigskins flying, mysteries that need solving, and games we simply adore that we’d like to return to.\nIf you’re unsure what to play this weekend, fear not.\nThe Crimson DiamondThe Crimson Diamond is AVAILABLE NOW!!\nThe Crimson Diamond is perhaps most reminiscent of Sierra adventures, especially the Clara Bow games which saw their plucky heroine tossed into murder mysteries during the roaring ‘20s.\nOr it could be that the more melancholy, blue-tinted mashup of chill vibes and menacing macabre undertones is more my style than the other Persona games."}, {"id": "feb66c18-1fe1-46d2-be16-18daf964e48a", "title": "Where Is Celeborn In  The Rings Of Power  season 2 ? ", "date": "2024-08-17 01:00", "url": "https://www.themarysue.com/where-is-celeborn-in-the-rings-of-power-season-2/", "domain": "themarysue.com", "domain_classification": "Unknown", "message": "Is Celeborn dead in The Rings of Power season 1?\nWith the mystery box structure of The Rings of Power season 1, there’s a lot that’s just deceptive and hiding in plain sight, and some that’s intentionally misleading.\nSo, will we see Celeborn in The Rings of Power season 2?\nThere’s a chance that we could see Celeborn in The Rings of Power season 2.\nThe destruction of Eregion is possibly going to be THE big battle that ends The Rings of Power season 2."}, {"id": "697d739c-2d57-47ff-b21c-736641f918d2", "title": "Taliban rule : IRR commended for extending humanitarian services to high - risk families - Pakistan", "date": "2024-08-17 03:00", "url": "https://www.brecorder.com/news/40317937/taliban-rule-irr-commended-for-extending-humanitarian-services-to-high-risk-families", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Marking three years since the Taliban seized power in Afghanistan, IRR, in collaboration with SADAAH and the Rehman Malik Foundation, hosted an event at Soho House London.\nSpeakers, including Baroness Hussein-Ece, Elham Ehsas, Mandy Sanghera, Tim Walker, Sarah Sands, and Anil Qasemi, highlighted the ongoing gender apartheid in Afghanistan under Taliban rule.\nSpeaking on behalf of IRR and the Rehman Malik Foundation, Ali Rehman Malik highlighted the devastating impact of terrorism, particularly from the Taliban, on the social and economic fabric of Pakistan and Afghanistan.\nExpressing grave concerns over the new wave of terrorism in Pakistan, Ali Rehman Malik commended Pakistan’s resolve and continued efforts to eliminate terrorism.\nMalik vowed to continue his father’s legacy of serving humanity through IRR International and the Rehman Malik Foundation."}, {"id": "5270bf10-5c20-4576-b3ea-01e17011e43b", "title": "Israel , Gaza and Josh Shapiro : What to watch for during the DNC", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/american-politics/article-815076", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Harris’ Jewish husband, Doug Emhoff, is also expected to take a primetime turn.\nThe Democratic convention will run Monday through Thursday in Chicago, with marquee speakers — including Harris, Walz and former presidents Barack Obama and Bill Clinton — speaking in the evening.\n​Jim Zogby, the president of the Arab American Institute and a longtime Democratic Party operative, said progressive protesters are showing up in large numbers at the Democratic convention because they feel betrayed by the Democratic administration.\n“Israel’s genocidal war in Gaza has become central to the agenda of progressives in the Democratic Party,” he said in his most recent weekly newsletter.\nIf either — or both — mention the war, Jewish organizations will closely scrutinize the differences, as will pro-Palestinian activists."}, {"id": "bf81905b-c6aa-45c2-a04c-edcda34d5ed2", "title": "Rooster crowing", "date": "2024-08-17 00:45", "url": "https://www.cbc.ca/player/play/audio/9.6483147", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "When search suggestions are available use up and down arrows to review and enter to select."}, {"id": "608518aa-b4d8-40f9-9c7f-88c0c5deea6a", "title": "The Challenge : Jonna Mannion says Season 40 castmate has a  bad reputation  and she  terrified  to face her", "date": "2024-08-17 03:00", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-jonna-mannion-says-season-40-castmate-has-a-bad-reputation-and-shes-terrified-to-face-her/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Unsurprisingly, Jonna revealed one teammate she particularly fears having to go against: Tori.\nShe admitted that their elimination battle on USA 2 was not good for her, but also said she is cool with Tori.\nJonna revealed how she spent her All Stars prize moneyWhile on Zach’s podcast, Jonna admitted being surprised to get a call for the first season of The Challenge: All Stars.\n“I spent some on paying off my house,” Jonna revealed, adding that she also bought her husband a truck.\nThe Challenge: Battle of the Eras airs Wednesdays at 8/7c on MTV."}, {"id": "82aaec0e-6967-4fe8-b627-0057fdc8b793", "title": "Newsom condemns prosecutor ballot measure as he signs anti - theft laws", "date": "2024-08-17 00:15", "url": "https://www.yahoo.com/news/newsom-condemns-prosecutors-ballot-measure-234927298.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "He described the ballot measure as a return to the 1980s tough-on-crime era and contended that the legislative package actually addresses the retail theft issue.\nShe signaled that her group, which is still officially supporting Prop 36, will likely reconsider its position.\nMichelin told POLITICO afterward that the association’s board could vote to remove its support for Prop 36 in the coming weeks.\nMahan held a press conference outside San Jose City Hall on Friday to respond to Newsom’s public statements.\nHe argued Prop 36 would give courts a crucial tool to compel more repeat offenders into addiction treatment, though he also supported the anti-theft bills Newsom signed."}, {"id": "0e2498ce-5557-4310-8685-b0854114cb1a", "title": "AI deepfake : San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 04:15", "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/san-francisco-goes-after-websites-that-make-ai-deepfake-nudes-of-women-and-girls/articleshow/112580949.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"These images are used to bully, humiliate and threaten women and girls,\" he said in an interview with The Associated Press.\n\"And the impact on the victims has been devastating on their reputation, mental health, loss of autonomy, and in some instances, causing some to become suicidal.\nThe is not naming the specific apps being sued in order to not promote them.\n\"And we will certainly utilize our powers in the course of this litigation.\n\"Many of the tools are being used to create realistic fakes that \"nudify\" photos of clothed adult women, including celebrities, without their consent."}, {"id": "fd7e5215-113d-4ff7-ae1d-ac205f890f58", "title": "San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 02:00", "url": "https://abcnews.go.com/Business/wireStory/san-francisco-after-websites-make-ai-deepfake-nudes-112905802", "domain": "abcnews.go.com", "domain_classification": "International", "message": "“These images are used to bully, humiliate and threaten women and girls,\" he said in an interview with The Associated Press.\nBut it can be hard to determine who runs the apps, which are unavailable in phone app stores but still easily found on the internet.\nThe AP is not naming the specific apps being sued in order to not promote them.\nShe applauded San Francisco's action but said more efforts are needed, including from bigger companies like California-based Meta Platforms and its subsidiary WhatsApp, which was used to circulate the images in Spain.\nOrganizations that have been tracking the growth of AI-generated child sexual abuse material will be closely following the San Francisco case."}, {"id": "56a29af3-dbdf-4798-85a0-5ecf33d1b807", "title": "Boys are using AI to deepfake nude photos - a lawsuit could stop it", "date": "2024-08-17 00:45", "url": "https://fortune.com/2024/08/16/ai-nude-deepfakes-boys-social-media-classmates-school/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Nearly a year after AI-generated nude images of high school girls upended a community in southern Spain, a juvenile court this summer sentenced 15 of their classmates to a year of probation.\n“These images are used to bully, humiliate and threaten women and girls,” he said in an interview with The Associated Press.\nThe AP is not naming the specific apps being sued in order to not promote them.\nBut they’ve also popped up in schools around the world, from Australia to Beverly Hills in California, typically with boys creating the images of female classmates that then circulate widely through social media.\nOrganizations that have been tracking the growth of AI-generated child sexual abuse material will be closely following the San Francisco case."}, {"id": "8414138f-515a-4c87-84f2-1fdd8003207c", "title": "San Francisco goes after websites that make AI deepfake nudes of women and girls", "date": "2024-08-17 02:45", "url": "https://www.wfmz.com/business/san-francisco-goes-after-websites-that-make-ai-deepfake-nudes-of-women-and-girls/article_3681f5f3-ccc1-555d-b120-f751be500fc9.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "San Francisco goes after websites that make AI deepfake nudes of women and girlsNearly a year after AI-generated nude images of high school girls upended a community in southern Spain, a juvenile court this summer sentenced 15 of their classmates to a year of probation"}, {"id": "ffeca624-1e43-4a6c-8a99-5f2d6c82bccb", "title": "Govt urged to take steps to keep print media alive", "date": "2024-08-17 00:45", "url": "https://www.thestar.com.my/news/nation/2024/08/17/govt-urged-to-take-steps-to-keep-print-media-alive", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KUALA LUMPUR: The government has been urged to take proactive measures to ensure print media remains relevant amid the proliferation of online media, even suggesting that ministries, government agencies and departments be required to purchase advertising space in newspapers.\n“This could help boost newspaper sales and revitalise print newspaper subscriptions in the country,” he told Bernama.\nHe added that print media also serves as a reference for readers seeking verified news in a physical form.\nHe also urged local media companies with print platforms to intensify their efforts and be more creative in attracting more advertising from private companies, government agencies and non-governmental organisations.\nShe added that this would be a win-win effort to foster the reading culture among the people, while also boosting demand for print media."}, {"id": "2364a4d2-843a-468e-9483-4fc1985c36bd", "title": "Harris vs . Trump : Tax Cuts Take Spotlight in Battle to Win Swing State Votes", "date": "2024-08-17 00:45", "url": "https://www.bloomberg.com/news/articles/2024-08-13/harris-vs-trump-tax-cuts-take-spotlight-in-battle-to-win-swing-state-votes", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "064976ae-7dbd-45c6-82ab-e569619e1444", "title": "Dutton strident Gaza digression drowns out Liberal epic election blunder in NSW | Karen Middleton", "date": "2024-08-17 01:15", "url": "https://www.theguardian.com/australia-news/article/2024/aug/17/duttons-strident-gaza-digression-drowns-out-liberals-epic-election-blunder-in-nsw-ntwnfb", "domain": "theguardian.com", "domain_classification": "International", "message": "In that day’s question time, Dutton followed through, making it the subject of every opposition question, drowning out all else.\nAt the last NSW local government elections, Liberal candidates could lodge their own forms but this time the party had decided to do it centrally and online.\nIt’s understood a relatively junior party staffer called the NSW president, Don Harwin, on Tuesday night with the bad news.\nIt’s not clear exactly when the federal Liberal party was alerted but its senior figures have since made their extreme displeasure known.\nBoth incidents saw federal Liberal candidates affected by the NSW brawls and administrative failures."}, {"id": "3c922b64-3ce4-4ddf-bb01-100bd9cb1659", "title": "Friday ( pt 1 of 2 ): Today Playhouse is  Animal Control  | 96 . 3 ROV", "date": "2024-08-17 01:00", "url": "https://rovrocks.iheart.com/featured/john-boy-and-billy/content/2024-08-16-1119-the-john-boy-billy-big-sh-friday-pt-1-of-2-todays-playhouse-is-animal-/", "domain": "rovrocks.iheart.com", "domain_classification": "Unknown", "message": "Friday (pt 1 of 2): On today’s Late Riser’s Podcast, TGIF!..\n- JD’s 24-Hour Stores are geared up for back to school.. - It’s Randy’s birthday so it’s roasting time!\n- first up his Chipmunk story.. - then a verbal battle with British Comedian Scott Angrave.. - We’ll jump into the playhouse for a new script called “Animal Control”.. - We’ll talk sports with Tom Sorenson.. - and we’ll finish up with how romantic Randy is..℗®© 2024 John Boy & Billy, Inc.See omnystudio.com/listener for privacy information."}, {"id": "7496c4e6-7653-4115-b727-2d0ba11d03c7", "title": "Friday ( pt 2 of 2 ): Today Playhouse is  Animal Control  | 96 . 3 ROV", "date": "2024-08-17 01:00", "url": "https://rovrocks.iheart.com/featured/john-boy-and-billy/content/2024-08-16-1119-the-john-boy-billy-big-sh-friday-pt-2-of-2-todays-playhouse-is-animal-/", "domain": "rovrocks.iheart.com", "domain_classification": "Unknown", "message": "Friday (pt 2 of 2): On today’s Late Riser’s Podcast, TGIF!..\n- JD’s 24-Hour Stores are geared up for back to school.. - It’s Randy’s birthday so it’s roasting time!\n- first up his Chipmunk story.. - then a verbal battle with British Comedian Scott Angrave.. - We’ll jump into the playhouse for a new script called “Animal Control”.. - We’ll talk sports with Tom Sorenson.. - and we’ll finish up with how romantic Randy is..℗®© 2024 John Boy & Billy, Inc.See omnystudio.com/listener for privacy information."}]