[{"id": "e44dd016-8de2-44b1-be6e-ac6921fba3de", "title": "Two children among four dead in Lebanon strikes blamed on Israel", "date": "2024-05-18 17:30", "url": "https://www.al-monitor.com/originals/2024/05/two-children-among-four-dead-lebanon-strikes-blamed-israel", "message": "May 17, 2024 — Beirut (AFP)Strikes in Lebanon blamed on Israel killed four people Friday including two children and a local Hamas official, state media and a source close to the Palestinian group said.\nThe NNA said two Syrian children were killed in the Najjariyeh strike, identifying them as Osama and Hani al-Khaled.\nThe United Nations children's agency UNICEF said on X that \"two children were killed in an air strike in southern Lebanon,\" adding: \"Protection of children is an obligation under the international humanitarian law.\"\nThe Israeli army statement said that \"Hezbollah's aerial defence array deliberately operates from within civilian areas, thus endangering the lives of civilians in southern Lebanon\".\nThe Israeli army said that \"approximately 75 launches were identified crossing from Lebanon into Israeli territory, dozens of which were intercepted\"."}, {"id": "bc7fc5e4-68da-4d46-91af-4baa5b08ec8c", "title": "Israeli airstrike eliminates Islamic Jihad officer in Rafah , Gaza", "date": "2024-05-18 08:15", "url": "https://www.jpost.com/breaking-news/article-801622", "message": "An Israeli airstrike killed the Palestinian Islamic Jihad (PIJ) terrorist organization’s Rafah Brigade head of logistics, the IDF announced on Saturday morning.\nThe PIJ operative was reportedly responsible for preparing terrorists for attacks on Israeli personnel in the area.\nThe airstrike eliminating the PIJ operative was one of a broader array of strikes across the Strip.\nIDF engages in heavy Jabalya fighting, destroys weapons production facilityDuring raids on terrorist positions in the outskirts of Jabalya, Israeli troops of the 460th Brigade encountered and engaged squads of terrorists, the IDF later noted.\nThe IDF's 460th Brigade engages terrorists in Jabalya."}, {"id": "84b6aec9-6ef8-453a-8f50-6c7dfb354c78", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:00", "url": "https://finance.yahoo.com/news/yemens-houthi-rebels-launch-missile-160448930.html", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "1e58b9fe-8dfa-4be3-9044-7b5268a1cbb6", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:30", "url": "https://www.aol.com/yemens-houthi-rebels-launch-missile-160448262.html", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "5179ee4f-39ea-45ea-b121-d8b159c4049b", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:30", "url": "https://abcnews.go.com/International/wireStory/yemens-houthi-rebels-launch-missile-strikes-oil-tanker-110363563", "message": "Yemen's Houthi rebels launch a missile that strikes an oil tanker in the Red Sea, US military saysDUBAI, United Arab Emirates -- DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "0c2d107e-4057-4ee8-a6d2-a7ad10343465", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 19:15", "url": "https://abcnews.go.com/Business/wireStory/yemens-houthi-rebels-launch-missile-strikes-oil-tanker-110363564", "message": "Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas warYemen's Houthi rebels launch a missile that strikes an oil tanker in the Red Sea, US military saysDUBAI, United Arab Emirates -- DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "edbf84b7-3cd6-47b6-a4e2-3ccc5dcc87c9", "title": "Houthis strike oil tanker with missle : U . S . military", "date": "2024-05-18 17:00", "url": "https://www.ctvnews.ca/world/yemen-s-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-u-s-military-says-1.6891763", "message": "DUBAI, United Arab Emirates -Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "484ff1bc-fefc-4d88-a44a-8f20238bcc67", "title": "Middle East Crisis : Yemen Houthi Rebels Launch Missile That Strikes Oil Tanker in Red Sea , Says US Military", "date": "2024-05-18 17:15", "url": "https://www.latestly.com/agency-news/world-news-yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says-5974258.html", "message": "Dubai, May 18: Yemen's Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.\nMiddle East Crisis: US, UK Launch Retaliatory Strikes on Houthi Sites in Yemen’s Red Sea After Attack on British Oil TankerSince the Houthis seized the country's north and its capital, Sanaa, in 2014, the U.S. military has previously lost at least five drones to the rebels."}, {"id": "1388aa40-582a-49f4-b8a8-3255a5f9316b", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:00", "url": "https://www.devdiscourse.com/article/science-environment/2943186-yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says", "message": "Yemen's Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "a2368475-1352-4cea-b433-81f4c1eda530", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 19:00", "url": "https://www.whec.com/business/yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says/", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "abfcf8d0-b2e4-4988-8707-25ed077e6868", "title": "World Should Rally to Halt Unfolding Atrocities in Darfur", "date": "2024-05-18 02:00", "url": "https://article.wn.com/view/2024/05/18/World_Should_Rally_to_Halt_Unfolding_Atrocities_in_Darfur/", "message": "Tens of thousands of people in El Fasher have already been displaced, with many civilians trapped in the city without access to aid.\nClick to expand ImageDamage to Babiker Nahar Pediatric Hospital in El Fasher, capital of North Darfur following an airstrike, May 11, 2024.\n© 2024 Ayin NetworkObservers within the United Nations, governments, and civil society have warned an attack on El Fasher would cause immeasurable suffering.\nThis is consistent with the RSF and allied forces’ modus operandi in West Darfur last year.\nThe ongoing assault in El Fasher bares stark similarities to these findings and warns of a tragedy which may repeat itself."}, {"id": "347b0619-4f07-45f0-a472-c5fcbde334e9", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone as footage shows wreckage", "date": "2024-05-18 07:15", "url": "https://www.newsday.com/news/nation/yemen-houthi-us-drone-israel-hamas-war-q10884", "message": "DUBAI, United Arab Emirates — Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as “carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen."}, {"id": "6eb142a1-6437-4606-b965-6ebc58df40d4", "title": "  Yemeni Houthis Down Another US MQ - 9 Reaper : Footage Reveals Wreckage  ", "date": "2024-05-18 08:45", "url": "https://www.devdiscourse.com/article/law-order/2942867-yemeni-houthis-down-another-us-mq-9-reaper-footage-reveals-wreckage", "message": "Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nThe two incidents likely represent just the latest attacks by the Houthis as they press their campaign over the Israel-Hamas war in the Gaza Strip.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nOnline video showed wreckage resembling the pieces of the Reaper on the ground, as well as footage of that wreckage on fire.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the US Maritime Administration."}, {"id": "9a632d69-0f55-4db8-923a-db0ea4b0a0d4", "title": "Update : Israeli army says kills senior commander in Lebanese Islamic organization - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/61228b475b09450c9107e64dc649ea9f/c.html", "message": "JERUSALEM, May 17 (Xinhua) -- The Israel Defense Forces (IDF) on Friday said it killed Sharhabil Ali al-Sayed, a senior commander in the Lebanese Islamic Group, or Jamaa Islamiya, in an airstrike on the area of Majdal Anjar village in southeastern Lebanon.\n\"Al-Sayed has recently led many attacks and acts of terrorism from Lebanese territory against Israel in the eastern sector, in cooperation with the Lebanese Hamas branch,\" the IDF said in a statement.\nThe statement noted that the operation was carried out \"to harm the organization's ability to promote and carry out terrorist operations that it planned in the recent period and in the near future against Israel on the northern border.\"\nEarlier in the day, the IDF reported that 75 launches of rockets and drones were carried out from Lebanon into northern Israel.\nMeanwhile, Lebanese military sources told Xinhua on Friday that an Israeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene."}, {"id": "4761c88b-78c5-4105-8678-def40c563538", "title": "Ukrainian Forces Strengthening Defense In Kharkiv Sector , Destroy Eight Enemy Dugouts", "date": "2024-05-18 01:30", "url": "https://menafn.com/1108227726/Ukrainian-Forces-Strengthening-Defense-In-Kharkiv-Sector-Destroy-Eight-Enemy-Dugouts", "message": "The enemy continued to carry out active offensive and assault operations in the Pokrovsk and Dnipro River sectors.\nIn the Kharkiv sector, the enemy launched 15 airstrikes, using 18 guided aerial bombs.\nSince the beginning of the day, the Russians have carried out six airstrikes near Chasiv Yar, Pivnichne, Druzhba, and Toretsk.\nAnother enemy airstrike was recorded in the Kurakhove sector, near the village of Bohatyr.\nIn the Dnipro River sector, the Russians tried to dislodge Ukrainian forces from the bridgeheads on the left bank of the Dnipro River."}, {"id": "6386b715-8fe0-4434-925b-525adfa92a53", "title": "Israeli strikes kill at least 5 in Lebanon , including civilians", "date": "2024-05-18 03:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/israeli-strikes-kill-least-5-lebanon-including-civilians-3612501", "message": "Smoke billows over northern Israel after rockets were fired from Lebanon, amid ongoing cross-border hostilities between Hezbollah and Israeli forces, by Israel's border with Lebanon, May 16, 2024.\nPhoto: Reuters/Ayal MargolinIsraeli strikes on southern and eastern Lebanon killed at least five people on Friday including Lebanese militants, Palestinian fighters and Syrian civilians, security sources told Reuters.\nOn Friday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and launched a drone attack the furthest into Israeli territory since October."}, {"id": "76ebc03b-4bb4-49e7-90e5-6876e60cb200", "title": "IDF Finds Loaded Rocket Launchers in Rafah", "date": "2024-05-18 02:00", "url": "https://www.breitbart.com/politics/2024/05/16/idf-finds-loaded-rocket-launchers-in-rafah/", "message": "The Israel Defense Forces (IDF) has found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip, now in its second week.\nThese launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\nThe rocket launchers were destroyed by the IDF.\nIn another targeted raid, the soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched.\nThe fact that the IDF is discovering and destroying rocket launchers provides further justification for the ongoing Rafah operation, to which the Biden administration and much of the international community has objected."}, {"id": "587301d0-99c8-40d6-a1fa-e93866d31049", "title": "At Least 20 Killed – Israeli Army Suffers Highest Losses in Rafah", "date": "2024-05-18 19:00", "url": "https://www.palestinechronicle.com/at-least-20-killed-israeli-army-suffers-highest-losses-in-rafah/", "message": "Firing RocketsEarlier today, the Palestinian Resistance fired rockets towards Ashkelon, in addition to Israeli military sites in Gaza.\nIn the morning, Al-Qassam also announced that it had shelled the Israeli occupation forces stationed inside the Rafah Crossing in the southern Gaza Strip with mortar shells.\nMeanwhile, in the northern Gaza Strip, the Al-Qassam Brigades fired a SAM-7 missile at an Israeli Apache helicopter north of Jabaliya.\nBack to Rafah, the Al-Quds Brigades said that its fighters are engaged in fierce clashes with Israeli soldiers and vehicles east of Rafah.\nThey also fired high-caliber mortar shells at Israeli occupation soldiers and vehicles in Al-Tanour neighborhood in the same axis."}, {"id": "f4e5ce8c-ca6f-40a3-9388-cd24e7167424", "title": "Israeli strikes kill at least five in Lebanon , including two children", "date": "2024-05-18 00:00", "url": "https://www.gulf-times.com/article/682753/region/israeli-strikes-kill-at-least-five-in-lebanon-including-two-children", "message": "Israeli strikes on southern and eastern Lebanon killed at least five people yesterday including two children, security sources and Unicef said.Israel and Lebanese armed group Hezbollah have been exchanging fire across Lebanon’s southern border for seven months in parallel with the Gaza war.\nOther Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon.Yesterday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nUnicef Lebanon separately said two children were killed in an Israeli strike on Friday.A separate Israeli strike on Majdal Anjar, on Lebanon’s eastern border with Syria, killed Sharhabil al-Sayed, a member of Palestinian group Hamas who was in charge of the faction’s operations in Lebanon’s eastern Bekaa Valley, according to two security sources.The strike also killed another Palestinian Hamas member, the sources said.The Israeli military said its forces struck a Hezbollah launcher and military infrastructure in southern Lebanon and confirmed the death of al-Sayed.It said sirens warning of incoming rockets and hostile aircraft sounded in several communities throughout yesterday and at one point identified 75 launches crossing from Lebanon into Israel.\nIt said dozens of the launches were intercepted and there were no immediate reports of deaths or damage.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days."}, {"id": "5c1eb0f0-19be-443a-9d6e-9922f9f78dda", "title": "Man who murdered united kingdom pensioner in revenge for Gaza jailed for at least 45 years", "date": "2024-05-18 08:15", "url": "https://www.asiaone.com/world/man-who-murdered-uk-pensioner-revenge-gaza-jailed-least-45-years", "message": "After his arrest, he told detectives he had committed the acts because of the conflict in Gaza and said he would have killed more people if he had been able to, prosecutors said.\nHe was found guilty last month of murder, attempted murder and assaulting two female detectives during his police interview.\nAlid left the house and walked down the road where he passed Carney on the opposite side of the street.\nHe circled back and attacked him from behind, stabbing him six times in the chest, abdomen and back.\nFollowing his interview with police, he attacked the two female detectives, with one suffering injuries to her shoulder and wrist."}, {"id": "9af99e9d-08ad-4a1d-9ffd-29ab02df2918", "title": "Yemen Houthi rebels reportedly fire missile , hitting tanker in Red Sea", "date": "2024-05-18 19:00", "url": "https://www.voanews.com/a/yemen-s-houthi-rebels-reportedly-fire-missile-hitting-tanker-in-red-sea/7617619.html", "message": "Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nThe Houthis have launched attacks on shipping in the Red Sea and Gulf of Aden, demanding Israel ends the war in Gaza.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nEven so, shipping through the Red Sea and Gulf of Aden still remains low because of the threat."}, {"id": "98f97f70-ff28-45b8-b35c-88e43a3f680d", "title": "Israel Hamas war : IDF finds bodies of three hostages in Gaza", "date": "2024-05-18 02:15", "url": "https://www.watoday.com.au/world/middle-east/israeli-army-finds-bodies-of-three-hostages-amid-fierce-fighting-in-northern-gaza-20240518-p5jemx.html", "message": "Jerusalem, Cairo: The Israeli military said its troops in Gaza found the bodies of three Israeli hostages killed by Hamas during its October 7 attack, including German-Israeli Shani Louk.\nThe military identified the other two bodies as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nThe Israeli military said its troops in Gaza found the bodies of the three Israeli hostages.\nCredit: Hostages Families Forum Headquarters via APAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsraeli Prime Minister Benjamin Netanyahu called the deaths “heartbreaking,” saying, “We will return all of our hostages, both the living and the dead.”"}, {"id": "78317415-b1b4-41f0-bbba-3d9d29a9c642", "title": "At least 1 killed , 8 injured in Israeli airstrike on West Bank Jenin - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/0920c9fd2d8b4c1091bb89409d07a62f/c.html", "message": "Palestinians inspect a destroyed building after an Israeli airstrike in the West Bank city of Jenin, on May 18, 2024.\n■A Palestinian boy inspects a destroyed building after an Israeli airstrike in the West Bank city of Jenin, on May 18, 2024.\n(Photo by Ayman Nobani/Xinhua)Palestinians inspect a destroyed building after an Israeli airstrike in the West Bank city of Jenin, on May 18, 2024.\n(Photo by Ayman Nobani/Xinhua)A Palestinian woman inspects a destroyed building after an Israeli airstrike in the West Bank city of Jenin, on May 18, 2024.\n(Photo by Ayman Nobani/Xinhua)Palestinians inspect a destroyed building after an Israeli airstrike in the West Bank city of Jenin, on May 18, 2024."}, {"id": "115978a8-3453-465a-8876-368e643deeaf", "title": "Moscow blames West for Ukraine long - range weapon strikes inside Russia", "date": "2024-05-18 01:15", "url": "https://www.voanews.com/a/moscow-blames-west-for-ukraine-s-long-range-weapon-strikes-inside-russia-/7616955.html", "message": "Russia’s Foreign Ministry accused Western nations Friday of “playing with fire” by allowing Ukraine to use the long-range rockets and weapons they had supplied to strike targets inside Russia.\nWhite House national security spokesperson John Kirby told reporters Friday that the Biden administration does not encourage or enable attacks with U.S.-supplied weapons inside Russia.\nIn the Kharkiv region, Russian forces have advanced 10 kilometers from the border, Ukrainian President Volodymyr Zelenskyy said Friday.\n“That's what we are doing.” Russian troops are “advancing daily according to plan,\" he said.\nMeanwhile, in an effort to increase the number of Ukrainian troops, Zelenskyy signed two laws on Friday allowing prisoners to join the army while imposing steep fines for draft dodgers."}, {"id": "840b0390-7590-4a9e-9de4-ab4f52507475", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone", "date": "2024-05-18 00:00", "url": "https://krcgtv.com/news/nation-world/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone", "message": "Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as \"carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nOnline video showed wreckage resembling the pieces of the Reaper on the ground, as well as footage of that wreckage on fire.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen."}, {"id": "603f3b4b-8cbe-4e3f-baa3-8a407f206dbf", "title": "Ukraine braces for heavy battles as Putin says Russia carving out  buffer zone  – The Irish Times", "date": "2024-05-18 07:45", "url": "https://www.irishtimes.com/world/europe/2024/05/18/ukraine-braces-for-heavy-battles-as-putin-says-russia-carving-out-buffer-zone/", "message": "Photograph: Finbarr O'Reilly/New York TimesUkrainian prosecutors said they were investigating attacks on civilians in two cities in the northeastern region of Kharkiv a president Volodymyr Zelenskiy reported successes by troops fighting a fresh Russian assault there on Saturday.\nZelenskiy said in his nightly video address that Ukrainian forces had grown in confidence, particularly in the Kharkiv region.\nHowever, Russia’s ministry for defence said its forces captured the village of Starytsia in the Kharkiv region on Saturday, eight days after a new Russian push in the area began.\nREAD MOREIn the eastern Donetsk region around Chasiv Yar, a city seen as a key target in Russia’s campaign, Zelenskiy said Ukrainian forces had repelled a Russian assault.\nIn a bid to boost troop numbers amid Russia’s new offensive, a mobilisation law has come into force in Ukraine."}, {"id": "08b31215-b66e-4750-9525-02c1f8ea1480", "title": "Jenin : Terrorist eliminated in aerial strike", "date": "2024-05-18 19:15", "url": "http://www.israelnationalnews.com/news/390151", "message": "תיעוד התקיפה בג'נין דובר צה\"לThe IDF and ISA struck an operations center where terrorists operated in the area of Jenin, eliminating an important wanted terrorist who was responsible for numerous terror attacks.\nBased on ISA intelligence, an IAF fighter jet and helicopter struck a compound used as an operations center of the terror infrastructure in Jenin.\nDuring the strike, the terrorist Islam Khamayseh was eliminated.\nThe compound was a dangerous terrorist infrastructure, and its dismantling was carried out to remove an imminent threat posed by the terrorists who promoted terror attacks in the area of Jenin and Israeli territory.\n\"The IDF and ISA will continue operating to thwart any terror threat to Israeli civilians,\" the joint statement read."}, {"id": "af69e8ec-2ae7-45ec-997b-799da215703b", "title": "Hamas loses  commander  in Israeli strike - Newspaper", "date": "2024-05-18 02:15", "url": "https://www.dawn.com/news/1834210/hamas-loses-commander-in-israeli-strike", "message": "BEIRUT: Hamas said on Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nA source close to the Palestinian group had earlier said FP that Sayed was a Hamas official responsible for Lebanon’s Bekaa region and “was killed in an Israeli strike that targeted his vehicle”.\nThe strike came after Israeli strikes earlier in the day killed a Hezbollah fighter and two children, according to the Lebanese group and official media.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al Aruri and six others in Hezbollah’s south Beirut stronghold."}, {"id": "a398e3ca-ad53-4a08-af8d-c200eaa4c79e", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone as footage shows wreckage", "date": "2024-05-18 03:00", "url": "https://www.ivpressonline.com/news/world/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone-as-footage-shows/article_5084072c-62a0-5b41-87a8-1c8c83f2bd02.html", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "d9a6c7ee-bf2b-4cc8-bded-adc11b1c41a0", "title": "U . S . Ban On Strikes Within Russia Compromising Ukraine Ability To Defend Itself - ISW", "date": "2024-05-18 08:00", "url": "https://menafn.com/1108228718/US-Ban-On-Strikes-Within-Russia-Compromising-Ukraines-Ability-To-Defend-Itself-ISW", "message": "(MENAFN- UkrinForm) The U.S. ban on Ukrainian forces using U.S.-made weapons for strikes within Russia is severely compromising Ukraine's ability to defend itself against Russian offensive operations in the north of the Kharkiv region.\nThe Institute for the Study of War (ISW) said this in a new Russian offensive campaign assessment , Ukrinform reports.\nAccording to the ISW, U.S. officials reiterated the White House's unwillingness to support Ukraine's use of U.S.-provided weapons in strikes against military targets in Russia.\n\"This U.S. policy is severely compromising Ukraine's ability to defend itself against Russian offensive operations in northern Kharkiv region,\" ISW analysts said.\nThe report also notes that Russian forces would likely be able to stretch Ukrainian forces along a wide front and fix Ukrainian troops in the international border area even as the tempo of Russian offensive operations in northern Kharkiv region slows."}, {"id": "9501ec0f-cbaf-4b74-bc7b-f14d1efaf7a6", "title": "Hezbollah Launches First - Ever Airstrike On Israeli Territory", "date": "2024-05-18 00:00", "url": "https://www.zerohedge.com/geopolitical/hezbollah-launches-first-ever-airstrike-israeli-territory", "message": "Via The CradleHezbollah launched the first-ever Lebanese airstrike on an Israeli target on Friday, using a never-before-seen drone for the operation.\npic.twitter.com/YXaO5fSDLr — Middle East Observer (@ME_Observer_) May 16, 2024Three Israeli soldiers were reportedly injured – with one seriously wounded – in the drone attack.\nCoinciding with Israel’s brutal assault on Rafah and its relentless attacks across the Gaza Strip, Hezbollah has stepped up its operations in recent days.\nIn response to Israeli airstrikes on eastern Lebanon the day prior, Hezbollah also announced on Thursday a drone attack on Elbit Systems, the Israel-based international military technology company.\nA couple of days ago we saw how Hezbollah used the new… https://t.co/mkl9FoQ2qi pic.twitter.com/6m5SpSrHkP — Ali Hashem علي هاشم (@alihashem_tv) May 16, 2024It also targeted the David Cohen factory in Tel Hai, north of the Kiryat Shmona settlement."}, {"id": "f20c864d-94e3-430e-8a60-ab872f93d9fc", "title": "Israeli forces kill senior Palestinian militant in Jenin , wound eight others", "date": "2024-05-18 10:15", "url": "https://www.thejournal.ie/israeli-forces-kill-senior-palestinian-militant-in-jenin-6383302-May2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "d2036a41-3cae-4756-81d9-67c45ff8a38c", "title": "Israeli forces kill senior Palestinian militant in Jenin : army", "date": "2024-05-18 10:00", "url": "https://www.bssnews.net/news/189756", "message": "RAMALLAH, Palestinian Territories, May 18, 2024 (BSS/AFP) - The Israelimilitary said on Saturday it killed a senior Palestinian militant during anair strike on an \"operations centre\" in the occupied West Bank city of Jenin.\n\"A number of significant terrorists were inside the compound,\" the IsraeliDefense Forces said in a statement posted to Telegram.\nThe Al-Quds Brigade, the armed wing of militant group Palestinian IslamicJihad, confirmed in a statement that Khamayseh was killed and several otherswounded during an Israeli raid on Friday night.\nIsrael has occupied the West Bank since 1967 and its troops routinely carryout incursions into areas such as Jenin, which are nominally under thePalestinian Authority's security control.\nThe West Bank has seen a recent surge in violence, particularly since theIsrael-Hamas war erupted on October 7."}, {"id": "3d2f612d-f5e4-4225-9582-7e01000119db", "title": "Israel - Hamas war : Fighting intensifies in Gaza", "date": "2024-05-18 19:15", "url": "https://www.africanews.com/2024/05/18/israel-hamas-war-fighting-intensifies-in-gaza/", "message": "The rumble of explosions echoed over northern Gaza on Saturday as the Israeli offensive in the Palestinian enclave goes on.\nSmoke clouds obscured a skyline that has been largely destroyed in seven months of war between Israel and Hamas.\nAn Israeli fighter jet and helicopter late Friday carried out a strike in the West Bank city of Jenin.\nSeven months of Israel's war in Gaza have killed more than 35,000 people, most of them women and children, according to local health officials.\nAround 1,200 people, mostly civilians were killed by Hamas-led militants in the Oct. 7 attack on southern Israel which ignited the conflict."}, {"id": "2600e75f-94f6-4cce-bd42-2e776e86f6a8", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532073.html", "message": "Beirut, May 18 : A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement \"will remain resistant until the complete liberation of Palestine.\"\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "b304ca27-6395-47a0-a3a6-16f4c5c80ecb", "title": "Mysterious Explosion At St . Petersburg Military Academy : New Details Emerging", "date": "2024-05-18 09:00", "url": "https://charter97.org/en/news/2024/5/18/595492/", "message": "Mysterious Explosion At St. Petersburg Military Academy: New Details Emerging 8 18.05.2024, 8:1223,296There could be other reasons than a drone.\nA powerful explosion occurred on Friday, May 17 at the Military Academy of Communications named after S. M. Budyonny, which is located on Tikhoretsk Avenue in St. Petersburg, Russia.\nInitially, Russian resources reported an alleged drone strike on a military academy.\nAccording to updated data, 7 people were injured as a result of the explosion, two of whom are in intensive care.\nGovernor of St. Petersburg Alexander Beglov said that the incident “is not of a terrorist nature.”The Leningrad Military District confirmed rumors about an abnormal explosion of ammunition “during work.” They refer to a 76 mm caliber projectile from the Second World War."}, {"id": "1f239bdd-5355-469f-9aec-3c9722a30a9c", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/hamas-official-killed-in-israeli-strike-in-lebanon-3028179/", "message": "Beirut: A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nIsraeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene, Lebanese military sources told Xinhua news agency.\nAlso Read First lorries with aid for Gaza leave newly constructed US pierThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement “will remain resistant until the complete liberation of Palestine.”Tensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "afd0074a-f9e2-4bb8-ae11-e3d5104d9d10", "title": "US ban on strikes on Russian territory undermines Ukraine ability to defend itself – ISW", "date": "2024-05-18 07:15", "url": "https://www.yahoo.com/news/us-ban-strikes-russian-territory-014527860.html", "message": "The Institute for the Study of War (ISW) believes that the US ban on Ukraine using Western weapons to strike Russian territory significantly undermines Ukraine's ability to defend itself against Russian offensive operations in the northern part of Kharkiv Oblast.\nIn addition, Russian forces and equipment can freely assemble before engaging in combat operations.\nSenior NATO military commanders confirmed ISW's prior assessments that Russian forces do not have sufficient forces to achieve a \"strategic breakthrough\" in Ukraine.\nRussian forces recently marginally advanced near Avdiivka.\nUkrainian and Western sources continue to report that Russian forces are committing war crimes in newly occupied areas of Kharkiv Oblast."}, {"id": "98ed6912-8ead-416b-b438-db150b6d3b8e", "title": "Israel strikes kill at least five in Lebanon , including two children", "date": "2024-05-18 11:15", "url": "https://www.newarab.com/news/israel-strikes-kill-least-five-lebanon-including-two-children", "message": "Israeli strikes on southern and eastern Lebanon killed at least five people on Friday including two children, security sources and UNICEF said.\nIsrael and Hezbollah have been exchanging fire across Lebanon's southern border for seven months in parallel with the Gaza war.\nOther Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon.\nUNICEF Lebanon separately said two children were killed in an Israeli strike on Friday.\nRELATED Israel strikes on Lebanon kill Hezbollah fighter, 2 children MENAIt said dozens of the launches were intercepted and there were no immediate reports of deaths or damage."}, {"id": "35498a84-1946-4213-aa06-462374760ef7", "title": "7 Weird Weapons From World War II", "date": "2024-05-18 06:15", "url": "https://www.history.com/news/weird-weapons-world-war-ii", "message": "More than any conflict in history, World War II was a “war of technology; a war of science,” says John Curatola, senior historian at the National WWII Museum.\n“In the Second World War, all sides were looking for new and innovative ways to get at the enemy.\nHere are seven of the strangest weapons that were dreamed up during World War II.\nProject Habakkuk (UK)In the early years of World War II, German U-boats terrorized the North Atlantic, sinking British Navy vessels and civilian ships.\nEarly in World War II, the Soviets invested in a novel, albeit inhumane weapon: trained dogs operating as suicide bombers."}, {"id": "e6302724-7209-41af-a83e-6cd3e08c5dc5", "title": "Israel pushes into new parts of northern Gaza , recovers another slain hostage", "date": "2024-05-18 18:45", "url": "https://www.yahoo.com/news/dozens-killed-wounded-israeli-forces-142236689.html", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nThe Israeli military said its forces have continued to operate in areas across Gaza including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nGantz said his proposal would include creating a temporary U.S.-European-Arab-Palestinian system of civil administration for Gaza while Israel retains security control.\nDefence Minister Yoav Gallant on Wednesday demanded clarity on post-war plans and for Netanyahu to forswear any military reoccupation of Gaza.\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20."}, {"id": "f7b332d4-bea2-4d73-8c2e-6830479b72ee", "title": "Israel recovers another slain hostage ; pushes into new parts of northern Gaza", "date": "2024-05-18 19:00", "url": "https://www.nbcnews.com/news/world/israel-recovers-another-slain-hostage-pushes-new-parts-northern-gaza-rcna152920", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nAt the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.\nThe Israeli military said its forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called “precise operations against terrorists and infrastructure”.\nIsrael’s military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.\nIsrael says it must capture Rafah to destroy Hamas and ensure the country’s security."}, {"id": "d9370b61-fc34-4b71-886a-5f54c5a36bd0", "title": "Israeli forces : Dozens killed and wounded as Israeli forces thrust deeper in Gaza Jabalia and Rafah", "date": "2024-05-18 15:30", "url": "https://economictimes.indiatimes.com/news/defence/dozens-killed-and-wounded-as-israeli-forces-thrust-deeper-in-gazas-jabalia-and-rafah/articleshow/110235432.cms", "message": "At the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.One site has been Jabalia , the largest of Gaza Strip's eight historic refugee camps.\nOn Saturday, troops and tanks edged into streets so far spared the ground offensive, residents said.\n\"We know of dozens of people, martyrs (killed) and wounded, but no ambulance vehicle can get into the area,\" he told Reuters.The Israeli military said forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nAbout 125 people are still being held in Gaza.In Rafah, where Israeli tanks thrust into some of the eastern suburbs and clashed with Palestinian fighters there, residents said Israeli bombing from the air and ground persisted all night.Rafah had been sheltering more than one million displaced Gazans.\nUNRWA , the main U.N. aid agency for Palestinians, said more than 630,000 people had fled Rafah since the offensive there began on May 6.Israel says it must capture Rafah to destroy Hamas and ensure the country's security."}, {"id": "7c476f60-2635-42f9-a390-de463a1081d2", "title": "Dozens killed , wounded as Israeli forces thrust deeper in Gaza", "date": "2024-05-18 18:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/dozens-killed-wounded-israeli-forces-thrust-deeper-gaza-3613056", "message": "At the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.\nIn one strike, medics said 15 Palestinians were killed and dozens wounded.\n\"We know of dozens of people, martyrs (killed) and wounded, but no ambulance vehicle can get into the area,\" he told Reuters.\nThe Israeli military said forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20."}, {"id": "35476af1-9ddf-4354-96c7-f8febc361919", "title": "US fight against terrorism increases terrorist threat , North Korean diplomat says", "date": "2024-05-18 12:30", "url": "https://tass.com/world/1790105", "message": "The United States’ efforts to combat terrorism are only leading to a rise in the terrorist threat, Kwon Jong Gun, head of the North Korean Foreign Ministry's North America Department, said.\nEarlier, the US decided to keep North Korea on the list of countries Washington says are \"not cooperating fully\" in its fight against terrorism.\n\"It is an axiom that as the US steps up its ‘counterterrorism efforts,’ the global terrorist threat is not declining but on the contrary, the vicious circle of terrorism and revenge is expanding and various terrorist groups are emerging,\" the North Korean diplomat said, commenting on the US decision.\nAccording to the Korean Central News Agency (KCNA), he stressed that Pyongyang consistently pursued a policy of combating all forms of terrorism threatening global peace.\nHowever, Venezuela, Iran, North Korea and Syria remained on the list, which is different from that of state sponsors of terrorism, Washington officials added."}, {"id": "9e0340c5-f62d-459e-a4ec-47f38e51642d", "title": "Terrible twoness | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-05-18 09:30", "url": "https://www.arkansasonline.com/news/2024/may/18/terrible-twoness/", "message": "You only need two sides for politics and wars, including culture wars.\nThe Terrible Twoness is applied to the world's wars and conflicts where Americans pick sides that they know nothing about.\nBut neither do I support Israel's current far-right government, or their conduct of the war in Gaza.\nIsrael has killed at least 30 times more civilians than those that Hamas murdered on Oct. 7.\nFortunately, Arkansas colleges and universities have applied existing policies about demonstrations, and to my knowledge, no police have been involved."}, {"id": "5f268639-76dc-43a2-970d-733f149b04cc", "title": "Singapore boosts security following deadly Ulu Tiram police station attack", "date": "2024-05-18 15:15", "url": "https://www.malaymail.com/news/singapore/2024/05/18/singapore-boosts-security-following-deadly-ulu-tiram-police-station-attack/135214", "message": "SINGAPORE, May 18 — Singapore has stepped up security measures, including at the country’s checkpoints, following an attack at Ulu Tiram police station, Johor, yesterday which killed two police officers and injured another.\nSingapore Home Affairs Ministry (MHA) today said these measures include increased patrols and enhanced checks on travellers and conveyances.\n“Travellers should expect delays at the checkpoints due to enhanced checks, and factor in additional time needed for immigration clearance.\nAdvertisementMHA said the ministry and Home Team Departments have been monitoring global and regional security developments closely, including the attack in Johor yesterday, allegedly by a member of the Jemaah Islamiyah (JI).\n\"The suspect is not affiliated with any terrorist groups and has no connection to JI."}, {"id": "b52e1ad3-9128-4d55-bfc0-bf9dd97cac6d", "title": "Operation Iron Swords", "date": "2024-05-18 03:00", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-17.htm", "message": "Operation Iron Swords - Day 224 - 17 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nThere, according to the verified information we have, they were brutally murdered by Hamas terrorists, and their bodies were taken into the Gaza Strip.\n?the corridor of the center of the Gaza Strip and in the neighborhood of Bakshi, the fighters eliminated terrorists, exposed and destroyed underground infrastructures.\nOpinion polls show that Netanyahu would be defeated if the elections were held now amid the chaos of war, according to the newspaper report.\nOperation Iron Swords - By the NumbersIn a recent interview on the Call Me Back podcast with Dan Senor, Israeli Prime Minister Benjamin Netanyahu disclosed startling statistics regarding the casualties in the ongoing conflict between Israel and Hamas."}, {"id": "5c014b7e-4c91-43ea-86f4-44de5a9f4fb9", "title": "Israel - Hamas War Day 225 : What happening in West Bank , Gaza ? ", "date": "2024-05-18 04:15", "url": "https://www.jpost.com/israel-hamas-war/2024-05-18/live-updates-801614", "message": "Israeli prime minister Benjamin Netanyahu and Cabinet minister Benny Gantz during a press conference in the Kirya military base in Tel Aviv , Israel , 28 October 2023.\n(photo credit: ABIR SULTAN/POOL)What National Unity party leader and war minister Benny Gantz did on Saturday night was to force Prime Minister Benjamin Netanyahu to reveal his true war and post-Hamas strategy.\nGantz, as well as Defense Minister Yoav Gallant, and the IDF high command have made it clear that winning the war requires removing Hamas from power."}, {"id": "7aea7191-3201-4903-aa5a-b0cb230015ff", "title": "Aid delivery to Gazans arriving via US - built pier", "date": "2024-05-18 18:00", "url": "https://nypost.com/2024/05/18/world-news/aid-delivery-to-gazans-arriving-via-us-built-pier/", "message": "Israel and Hamas fighters wage a fierce battle in northern Gaza Saturday as aid deliveries started moving into the Palestinian territory via a United States-constructed pier off the coast.\nIsraeli Army/AFP via Getty Images4 The new method for aid delivery comes as Israel faces global pressure to provide supplies to Gazans.\nIsrael said that its forces cleared Jabalia of Hamas fighters shortly after the terrorist group’s Oct. 7 attack on the Jewish state, killing 1,200 people and kidnapping another 250.\n4 National Security Adviser Jake Sullivan will visit Israel for talks with Prime Minister Benjamin Netanyahu about the Rafah offensive.\nSullivan is expected to stress US support for efforts take out Hamas terrorists in Rafah through targeted attacks rather than a full-blown invasion of the southern city."}, {"id": "bc20e7f2-a19a-4362-b414-0bcb3f9b9fb2", "title": "Ukraine destroys Russian S - 300 at Belbek airfield in Crimea with ATACMS missiles", "date": "2024-05-18 11:15", "url": "https://www.yahoo.com/news/ukraine-destroys-russian-300-belbek-103400192.html", "message": "Recent attacks and responses at Belbek Airfield in CrimeaExplosions near the Belbek airfield in the early hours of May 15 led to multiple fires, as reported by the Crimean Wind monitoring channel.\nIn response to the attacks, the Russian Ministry of Defense claimed to have intercepted 10 ATACMS missiles over Crimea.\nDefence Express, a military news outlet, suggested that Ukrainian Defense Forces may have targeted Russian MiG-31 fighters parked at the Belbek airfield with ATACMS missiles during these strikes.\nAdditionally, the Atesh guerrilla movement claimed responsibility for \"successful attacks\" on Russian military targets in Crimea.\nRead also: Ukrainian forces possibly hit Russian jets in Crimea ATACMS strikeAtesh agents at the Belbek military airfield reported a precise hit and hours of subsequent detonation of the main missile and artillery depot (military unit 80189)."}, {"id": "5bf1fc94-98a0-427d-a6d9-8027e175e519", "title": "Afghanistan officials , Schema - Root news", "date": "2024-05-18 07:30", "url": "https://schema-root.org/region/asia/southwest_asia/afghanistan/government/officials/", "message": "The western Herat province with Herat city as its capital, 640 kmÃ\u0083â\u0080\u009aÃ\u0082Â ...Pak, Afghan officials hold flag meeting KHYBER AGENCY - To discuss matters of mutual interests, flag meeting of Pakistani and Afghan officials was held at Torkham on Wednesday.\nAs a resultÃ\u0083â\u0080\u009aÃ\u0082Â ...Taliban Assassinates Key Afghan Regional Security Official Officials in Afghanistan say a top regional security commander and several of his bodyguards were killed in a bombing attack in southern Afghanistan early Wednesday.\nNezami says the HazarasÃ\u0083â\u0080\u009aÃ\u0082Â ...Afghan Officials: Pakistani Cross-Border Fire Kills Civilian Officials in Afghanistan say cross-border shelling by Pakistan has killed at least one civilian in the eastern province of Kunar.\nThe rise of Daesh in Afghanistan is raising alarm in Pakistan, say ... John Nicholson, commander of the US Forces in Afghanistan.\n“The armed group said they will join the peaceÃ\u0083â\u0080\u009aÃ\u0082Â ...German citizen arrested with Taliban in Afghanistan: Officials KANDAHAR, Afghanistan: A German national has been arrested with the Taliban in Afghanistan's insurgency-racked Helmand province, officials told AFP ... Photographs taken by the Afghan military show a man who looks to be in his 40s with a long reddish-brown beard speckled with grey, and wearing aÃ\u0083â\u0080\u009aÃ\u0082Â ...Afghan officials: Latest Taliban attacks kill 13 policemen Taliban attacks overnight in Afghanistan killed at least 13 policemen and wounded several others, officials said Friday."}, {"id": "68ca0753-68a5-4628-82c4-1caa2a8576ee", "title": "SC allows prosecution of HM operatives in Banihal attack", "date": "2024-05-18 03:30", "url": "https://www.dailyexcelsior.com/sc-allows-prosecution-of-hm-operatives-in-banihal-attack/", "message": "The Supreme Court drew parallels between the unsuccessful attack on the CRPF convoy and the deadly 14 February 2019 Pulwama attack, which claimed the lives of 40 CRPF personnel.\nThe Pulwama attack was perpetrated by a suicide bomber affiliated with the Pakistan-based Jaish-e-Mohammad (JeM).\nOn March 30, 2019, individuals suspected to be members of Hizbul Mujahideen attempted to execute an attack on a CRPF convoy in Banihal along the Jammu-Srinagar National Highway.\nFollowing the Pulwama attack, the Union Home Ministry transferred the investigation of the attempted ambush on the CRPF convoy to the NIA.\nNaikoo, one of Kashmir’s most wanted terrorists and the commander of Hizbul Mujahideen (HM) was killed during an encounter in Pulwama in May 2020."}, {"id": "6ac1dc8c-27a1-4115-87b8-99218bcdd45d", "title": "Xinhua Middle East news summary at 2200 GMT , May 17", "date": "2024-05-18 00:00", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/18/content_117196626.htm", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA -- Yemen's Houthi group said on Friday that it had shot down a \"U.S. MQ-9 spy drone\" over the Yemeni central province of Marib.\n\"The plane was targeted by a locally made surface-to-air missile, and the video showing scenes will be broadcast later,\" Houthi military spokesman Yahya Sarea said in a statement aired by Houthi-run al-Masirah TV.\n(Yemen-Houthis-U.S. Drone)- - - -BEIRUT -- A Hamas member was killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday, Lebanese military sources told Xinhua.\n(Hamas-Israel-Lebanon)- - - -GAZA -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has risen to 35,303, health authorities in the Palestinian enclave said in a press statement on Friday.\n(Gaza-Death Toll)- - - -JERUSALEM -- The Israel Defense Forces (IDF) and the Israeli Security Agency (ISA) recovered in a joint night operation the bodies of three Israeli hostages in the Gaza Strip, as announced by IDF Spokesman Daniel Hagari on Friday."}, {"id": "ccf28ab3-148a-4f97-9639-cc6a4e0e545e", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu", "date": "2024-05-18 15:30", "url": "http://www.middletownpress.com/news/world/article/aid-from-new-pier-off-gaza-should-be-distributed-19465538.php", "message": "Israeli army tanks are seen in the central Gaza Strip, Saturday, May 18, 2024.\nLeo Correa/AP Mourners, some armed, carry the body of Islam Khamaiseh draped in the Islamic Jihad militant group flag during his funeral in the West Bank Jenin refugee camp, Saturday, May 18, 2024.\nMajdi Mohammed/AP Demonstrators supporting Palestinians march during a rally to call for a ceasefire in Gaza, in Seoul, South Korea, Saturday, May 18, 2024.\nAhn Young-joon/AP This image released by Maxar Technologies shows the overview of the new pier off Gaza and aid trucks on Saturday, May 18, 2024.\nIn March, Gantz met with U.S. officials in Washington to discuss the war, earning a rebuke from Netanyahu."}, {"id": "5da45c42-0ac0-462a-bc70-68b7b8572ae7", "title": "Iran Update , May 17 , 2024 | Institute for the Study of War", "date": "2024-05-18 02:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-may-17-2024", "message": "Northern Gaza Strip: Israeli forces described the fighting in Jabalia as some of the most intense of the war.\nSouthern Gaza Strip: Israeli forces continued clearing operations in several areas of eastern Rafah.\nIsraeli forces continued clearing operations in several areas of eastern Rafah on May 17.\n[30]Aid trucks began transporting supplies from the US-constructed offshore pier into the Gaza Strip on May 17.\n[39]Palestinian militias conducted at least two indirect fire attacks from the Gaza Strip into Israel on May 17."}, {"id": "90153c0a-941a-4fa2-857f-f9c78b5eaf9c", "title": "U . S . ban on strikes within Russia compromising Ukraine ability to defend itself", "date": "2024-05-18 08:15", "url": "https://www.ukrinform.net/rubric-ato/3865112-us-ban-on-strikes-within-russia-compromising-ukraines-ability-to-defend-itself-isw.html", "message": "The U.S. ban on Ukrainian forces using U.S.-made weapons for strikes within Russia is severely compromising Ukraine's ability to defend itself against Russian offensive operations in the north of the Kharkiv region.\nThe Institute for the Study of War (ISW) said this in a new Russian offensive campaign assessment, Ukrinform reports.\nAccording to the ISW, U.S. officials reiterated the White House's unwillingness to support Ukraine's use of U.S.-provided weapons in strikes against military targets in Russia.\n\"This U.S. policy is severely compromising Ukraine's ability to defend itself against Russian offensive operations in northern Kharkiv region,\" ISW analysts said.\nThe report also notes that Russian forces would likely be able to stretch Ukrainian forces along a wide front and fix Ukrainian troops in the international border area even as the tempo of Russian offensive operations in northern Kharkiv region slows."}, {"id": "9c612bd4-7a4f-42f0-855e-2c53fb6d8941", "title": "Israel war on Gaza live : Battles in Jabalia and Rafah as Israel advances | Israel War on Gaza News", "date": "2024-05-18 08:00", "url": "https://www.aljazeera.com/news/liveblog/2024/5/18/israels-war-on-gaza-live-battles-in-jabalia-and-rafah-as-israel-advances?update=2907486", "message": "play video play videoThis video may contain light patterns or images that could trigger seizures or cause discomfort for people with visual sensitivities."}, {"id": "62ba4ee8-069d-40e3-88ab-d84185064273", "title": "Israel war on Gaza live : Battles in Jabalia and Rafah as Israel advances | Israel War on Gaza News", "date": "2024-05-18 08:00", "url": "https://www.aljazeera.com/news/liveblog/2024/5/18/israels-war-on-gaza-live-battles-in-jabalia-and-rafah-as-israel-advances?update=2907493", "message": "play video play videoThis video may contain light patterns or images that could trigger seizures or cause discomfort for people with visual sensitivities."}, {"id": "497fec8c-f244-4941-aff3-1b87526afe97", "title": "Houthis hit Panama - flagged oil tanker off Yemen : US", "date": "2024-05-18 18:45", "url": "https://www.canberratimes.com.au/story/8633145/houthis-hit-panama-flagged-oil-tanker-off-yemen-us/?cs=14264", "message": "The strike was the latest in months of attacks on ships in the Red Sea and Gulf of Aden by the Houthis, who seized control of most of Yemen's major population centres in a civil war, in opposition to Israel's war in Gaza."}, {"id": "41379edb-93cd-42f1-ac73-b88a71ebd178", "title": "Houthis hit Panama - flagged oil tanker off Yemen : US", "date": "2024-05-18 18:45", "url": "https://www.canberratimes.com.au/story/8633145/houthis-hit-panama-flagged-oil-tanker-off-yemen-us/?cs=14232", "message": "The strike was the latest in months of attacks on ships in the Red Sea and Gulf of Aden by the Houthis, who seized control of most of Yemen's major population centres in a civil war, in opposition to Israel's war in Gaza."}, {"id": "20f5a787-a8e6-498a-9794-3241f52280dd", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:30", "url": "https://www.theargus.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "128c3152-2ff5-4225-af80-daad611a8b42", "title": "Russian missile shot down near Kryvyi Rih", "date": "2024-05-18 18:00", "url": "https://www.yahoo.com/news/russian-missile-shot-down-near-155600183.html", "message": "Ukrainian air defense forces managed to shoot down a Russian missile over Kryvyi Rih district (illustrative photo)An explosion was heard in Kryvyi Rih at 3:42 p.m., public broadcaster Suspilne reported on May 18, citing its correspondents.\nA few minutes later, it was reported that a missile had been shot down over the Kryvyi Rih district.\nAt 3:34 p.m., the Air Force reported that a missile was flying towards the city.\nRead also: Ballistic missile strikes Odesa Oblast in early morning attackAt 3:49 p.m., an all-clear was given throughout Ukraine, except for Kharkiv Oblast.\nAt 3:55 p.m., the Dnipropetrovsk regional governor, Serhiy Lysak, said that a unit of Air Command East had shot down a missile over the Kryvyi Rih district."}, {"id": "68696945-d903-46cd-bf17-4802b0eba8f7", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 16:45", "url": "https://www.salisburyjournal.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "a3062b01-9fd3-4dc9-aa35-473a51a1b961", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 04:45", "url": "https://dunyanews.tv/en/World/812486-Hamas-says-commander-killed-in-Israel-strike-in-Lebanon", "message": "Hamas says commander killed in Israel strike in LebanonWorld World Hamas says commander killed in Israel strike in LebanonSharhabil Sayed was killed \"after he was targeted by Israeli aircraft\" in Lebanon's West Bekaa area.\nFollow on Published On: Sat, 18 May 2024 07:22:59 PKTBEIRUT (AFP) – Palestinian militant group Hamas said Friday that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nLebanon's official National News Agency reported one dead and two wounded in an \"enemy strike\" that targeted a vehicle in the same area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold."}, {"id": "bde6b838-1dd3-464f-a2d4-d75c9ee690f3", "title": "Israel prefers to avoid tough war with Hezbollah : Defence Minister", "date": "2024-05-18 05:15", "url": "https://www.prokerala.com/news/articles/a1532080.html", "message": "Day of Hamas attack will be remembered as the day its complete destruction began: Israeli Defence Minister (IANS FROM ISRAEL).\nImage Source: IANS NewsJerusalem, May 18 : Israeli Defence Minister Yoav Gallant has said that his country prefers to avoid a difficult war with the Lebanese armed group Hezbollah.\nAt the same time, Hezbollah's attacks continued on Friday, with dozens of rockets and drones launched into northern Israel.\nThe exchanges of fire between Hezbollah and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and recently launched a drone attack the furthest into Israeli territory since October."}, {"id": "fb071db8-66f1-428d-9461-36b4f4c148da", "title": "Putin suffers major blow as colonel guarding top secret base killed in united kingdom - supplied missile strike - World News", "date": "2024-05-18 13:45", "url": "https://www.mirror.co.uk/news/world-news/putin-suffers-major-blow-colonel-32839675", "message": "Lt-Col Alexander Kulakov, 38, died with a comrade in the Ukrainian strike on military unit No.\nThe Russian armed forces have not admitted the loss, nor publicly acknowledged the damage to the key listening post.\n‌Kulakov’s death in the strike was confirmed by Mayor of Alushta, Galina Ogneva, in an obituary coinciding with his funeral.\nThe giant golf-ball domes at Ai-Petri are used for long-range reconnaissance and air defence guidance, crucial to the Russian military.\nStorm Shadow missiles are supplied to Ukraine by Britain and France."}, {"id": "3a7ef0cd-cfbd-45d4-b247-920e8953fe19", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 00:00", "url": "https://japantoday.com/category/world/hamas-says-commander-killed-in-israel-strike-in-lebanon", "message": "Lebanese soldiers and onlookers gather around the remnants of a car after it was hit by an Israeli strike, reportedly killing a Hamas commander, in Lebanon's Bekaa ValleyPalestinian militant group Hamas said Friday that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nLebanon's official National News Agency reported one dead and two wounded in an \"enemy strike\" that targeted a vehicle in the same area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold.\nThe cross-border fighting has killed at least 419 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally."}, {"id": "f11aaee0-02cb-45b1-a0ec-ff7675bb4d59", "title": "Israel prefers to avoid tough war with Hezbollah : Defence Minister", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/israel-prefers-to-avoid-tough-war-with-hezbollah-defence-minister-3028188/", "message": "Jerusalem: Israeli Defence Minister Yoav Gallant has said that his country prefers to avoid a difficult war with the Lebanese armed group Hezbollah.\nAccording to reports in Lebanon, a local leader of the group was killed in the Israeli strikes.\nAt the same time, Hezbollah’s attacks continued on Friday, with dozens of rockets and drones launched into northern Israel.\nThe exchanges of fire between Hezbollah and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and recently launched a drone attack the furthest into Israeli territory since October."}, {"id": "82d97f50-bf8e-4939-aa21-dae9d98c17d9", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:00", "url": "https://www.yorkpress.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "6ee61125-7339-4266-aa23-556dc20caaec", "title": "US ban on strikes on Russian territory seriously undermines Ukraine ability to defend itself ISW", "date": "2024-05-18 17:15", "url": "https://rubryka.com/en/2024/05/18/v-isw-vvazhayut-shho-zaborona-ssha-byty-po-rosijskij-terytoriyi-serjozno-pidryvaye-zdatnist-ukrayiny-zahyshhatysya/", "message": "US ban on strikes on Russian territory seriously undermines Ukraine's ability to defend itself — ISWThe US unwillingness to support Ukraine's use of US-provided weapons in strikes against military targets in Russia seriously undermines the ability of the Armed Forces of Ukraine to defend themselves against Russian offensive operations in the north of the Kharkiv region.\nIn addition, Russian forces and equipment can freely assemble before entering combat.\nSenior NATO military commanders confirmed ISW's prior assessments that Russian forces do not have sufficient forces to achieve a \"strategic breakthrough\" in Ukraine.\nRussian President Vladimir Putin attempted to further known Russian information operations intended to directly undermine Ukrainian President Volodymyr Zelensky's legitimacy as president .\nRussian forces recently marginally advanced near Avdiivka."}, {"id": "7b3af94d-fb9c-449d-ac71-6724c67b4c5b", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 00:15", "url": "https://www.malaymail.com/news/world/2024/05/18/hamas-says-commander-killed-in-israel-strike-in-lebanon/135052", "message": "BEIRUT, May 18 — Palestinian militant group Hamas said Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas’ armed wing, the Ezzedine al-Qassam Brigades, said in a statement that “commander” Sharhabil Sayed was killed “after he was targeted by Israeli occupation aircraft” in Lebanon’s West Bekaa area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold.\nThe cross-border fighting has killed at least 419 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally."}, {"id": "76a908b8-bcae-4ea3-ae3a-bd077069ee51", "title": "  Forever changed : Terrorism victims push for passage of new bill to fix U . S . victims fund", "date": "2024-05-18 12:30", "url": "https://www.yahoo.com/news/forever-changed-terrorism-victims-push-114213054.html", "message": "“When your freedoms are taken away, it changes your life,” Synnestvedt told our Washington News Bureau.\nCongress established a fund in 2015 called the U.S. Victims of State Sponsored Terrorism Fund (USVSST Fund) that gives compensation to victims and survivors who won judgements in court after a terrorist attack.\nThe House bill is sponsored by Rep. Mike Lawler (R-NY), Rep. Josh Gottheimer (D-NJ), Rep. Nicole Malliotakis (R-NY), and Rep. Dan Goldman (D-NY).\nWe told you earlier this month how a watchdog report warned the fund is running low on money.\n“Victims of terrorism carry a prolonged grief with them throughout their lifetime,” said Mistrulli."}, {"id": "da2cb54f-5bd1-4f1d-b5ce-4ef9c3d2deb0", "title": "Govt mulls restricting use of cash , decides to introduce reforms in real estate sector", "date": "2024-05-18 11:15", "url": "https://www.thenews.com.pk/latest/1190471-govt-mulls-restricting-use-of-cash-introduce-reforms-in-real-estate-sector", "message": "— ReutersKARACHI: The federal government is considering imposing a restriction on use of cash along with introducing reforms in the real estate sector in its bid to tackle money laundering and terror financing.\nAs per documents available with Geo News, the meeting decided on the appointment of officials on deputation to operationalise the government body.\nThe document further revealed that the body also reviewed the progress on the implementation of the Internal National Action Plan (INAP) on the issue of cash in organised crimes.\nRegarding the issue of unregistered real estate business, the forum termed it a part of money laundering which results in significant revenue losses to the national exchequer.\nThe meeting also decided to invite provinces' suggestions on the issue of reforms in the real estate sector."}, {"id": "00bef7e1-5a25-4d37-9c3a-cbae81a9c220", "title": "Reuters World News Summary", "date": "2024-05-18 02:15", "url": "https://www.devdiscourse.com/article/politics/2942658-reuters-world-news-summary", "message": "Following is a summary of current world news briefs.\nSlovakia's PM Fico undergoes another operation, deputy PM says he is hopefulSlovakia's Prime Minister Robert Fico underwent a two-hour operation on Friday that have increased hopes for his recovery, a deputy prime minister said, following an assassination attempt this week that sent shockwaves through Europe.\nDeputy Prime Minister Robert Kalinak also said any decision to transfer Fico back to the capital Bratislava from the central city of Banska Bystrica where he is being treated would only be taken when there had been further improvement in his condition.\nRegional Governor Oleh Syniehubov had earlier put the death toll at one, with four of the injured in serious condition.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "5d1c931a-a9a9-4d60-be65-9da72a5c239a", "title": "Suspect in court as Putin friends capitalise on shooting of Slovakian PM Robert Fico | Robert Fico", "date": "2024-05-18 16:15", "url": "https://www.theguardian.com/world/article/2024/may/18/suspect-putin-shooting-slovakian-pm-robert-fico", "message": "The suspect in the shooting of Slovakian prime minister Robert Fico appeared in a closed court hearing on Saturday outside Bratislava amid growing fears about the future of the deeply divided nation.\nThe government has released only sparse details about the assailant or the health of the prime minister , who remains in a stable but serious condition.\n“Other European security services will be looking at their measures, realising that the danger can come out of nowhere,” the source said.\nIn Belgium, prime minister Alexander De Croo filed a police complaint against a radio presenter who urged listeners to “take him out”.\n“You see that it is possible to shoot down a prime minister."}, {"id": "d92e119b-c3d6-4a25-bdc0-a3cfab54c384", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu – Metro US", "date": "2024-05-18 15:30", "url": "https://www.metro.us/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-while-pressure-grows-on-netanyahu/", "message": "The plan also supports efforts to normalize relations with Saudi Arabia and widen military service to all Israelis.\nGantz, a longtime political rival of Netanyahu, joined his coalition and the War Cabinet in the early days of the war in a gesture at national unity.\nGantz spoke days after Israeli Defense Minister Yoav Gallant, the third member of the War Cabinet, said he would not remain in his post if Israel elected to reoccupy Gaza.\nPolls suggest Netanyahu would be replaced in elections, with Gantz the most likely candidate to be the next prime minister.\nIn March, Gantz met with U.S. officials in Washington to discuss the war, earning a rebuke from Netanyahu."}, {"id": "ac57abcd-d457-46b0-a1d0-b672da5c5b0e", "title": "J - K : SIA files supplementary charge - sheet against 2 terrorists", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/j-k-sia-files-supplementary-charge-sheet-against-2-terrorists-3028187/", "message": "Jammu: The J-K State Investigation agency on Friday filed a supplementary charge-sheet against two terrorists involved in multiple attacks in Jammu and Kashmir’s Rajouri district, officials said.\nTwo AK assault rifles, a pistol, seven grenades and a large amount of ammunition were seized from them, they added.\nThe accused had received large quantities of arms, ammunition and other war-like stores via drone drops in Lamberi, Rajouri.\nThese were then moved to Kandi Budhal for terrorist activities, as directed by their Pakistani handlers, the spokesman said.\nThe main charge-sheet was filed on December 29 last year by the SIA."}, {"id": "ce3fddb5-57e2-42d6-b09f-a225b32b747e", "title": "How Israel Rafah Campaign Might Shape Hezbollah Operations", "date": "2024-05-18 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/how-israels-rafah-campaign-might-shape-hezbollahs-operations", "message": "On April 22, Hezbollah claimed to strike a base north of Acre, its deepest attack into Israel since the Gaza war began.\nHezbollah’s Rafah CalculusThe onset of the Rafah campaign is vital to Hezbollah for two main reasons.\nIndeed, multiple indicators and statements imply an Israeli escalation against Hezbollah after Rafah.\nAccordingly, Hezbollah may feel compelled to flex its muscles during the Rafah campaign in order to impose conditions on Israel, Washington, and Paris.\nThe group has already committed to stop its attacks once the Gaza war is over, so it is certainly amenable to the general idea of de-escalation."}, {"id": "76863113-23ee-4467-880c-6859d0e3552b", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:30", "url": "https://www.breakingnews.ie/world/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-1627235.html", "message": "The first distribution of badly needed aid is expected to begin this weekend after rolling off a newly built US pier off the coast of Gaza.\nAdvertisementUS military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "557ab61a-1334-488d-8e4b-0ececb02f7e8", "title": "Poland invests $2 . 5 billion into fortifying border with Russia and Belarus", "date": "2024-05-18 17:00", "url": "https://www.aol.co.uk/news/poland-invests-2-5-billion-160116743.html", "message": "Foreign journalists report from an observation point while smoke rises after a Russian attack in Kharkiv, Ukraine, Friday, May 17, 2024.\nPoland, which borders both Ukraine and Russia, has ramped up its defence spending to 4 per cent of GDP this year.\nVolodymyr Zelensky, the Ukrainian president, also signed two other laws Friday, allowing prisoners to join the army and increasing fines for draft dodgers fivefold.\nThe Ukrainian president said he had spoken to Emmanuel Macron, the French president, who made the appeal and told him: “Let’s be honest... Emmanuel, I don’t believe it”.\nVladimir Putin, the Russian president, earlier on Friday also suggested that Moscow would not support the idea of a truce during the games in Paris this summer."}, {"id": "9e7579e3-897a-41d3-8231-cc964be78f07", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:00", "url": "https://www.eveningnews24.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "5a5a16f4-928e-4c50-a1cd-427f52b401c9", "title": "Policy on the cards to retsrict use of cash in real estate sector", "date": "2024-05-18 10:00", "url": "https://www.geo.tv/latest/544623-policy-on-the-cards-to-retsrict-use-of-cash-in-real-estate-sector", "message": "— ReutersAuthority to invite province's input on real estate sector reforms.\nInternal National Action Plan's implementation progress also reviewed.\nKARACHI: The federal government has decided to tighten the noose around money laundering and terror financing by imposing a restriction on the use of cash and introducing reforms in the real estate sector.\nAs per documents available with Geo News, the meeting decided on the appointment of officials on deputation to operationalise the government body.\nThe meeting also decided to invite provinces' suggestions on the issue of reforms in the real estate sector."}, {"id": "40f135bd-18a6-44b2-b025-b49cfd886c30", "title": "North Korea tests missile with autonomous navigation system", "date": "2024-05-18 13:15", "url": "https://www.presstv.ir/Detail/2024/05/18/725775/North-Korea-Confirms-Missile-Launch-Vows-Bolstered-Nuclear-Force", "message": "North Korea has successfully tested a missile with a \"new autonomous navigation system\", vowing to boost its nuclear capability as a deterrent against its enemies after the US and South Korea conducted joint drills with stealth fighter jets simulating air combat.\nNorth Korean leader Kim Jong-un oversaw the launch of the tactical ballistic missile into the East Sea, official Korean Central News Agency (KCNA) reported on Saturday.\nKCNA praised the accuracy and reliability of the new autonomous navigation system used in the missile.\nNorth Korea has fired off cruise missiles, tactical rockets and hypersonic weapons in recent months to upgrade its defenses.\nSouth Korea said stealth fighters conducted “intense” joint exercises in the central region to test and enhance offensive and defensive maneuverability."}, {"id": "fa7c310d-90f9-40b2-b4e9-282a9758dd12", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu", "date": "2024-05-18 18:00", "url": "https://www.smdailyjournal.com/news/world/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-while-pressure-grows-on/article_6cf19325-f580-59b1-a906-fa98ad4dc67c.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "be9048a5-140b-491c-8960-34a1cf710a05", "title": "Hamas says commander killed in Israel strike in Lebanon Bekaa", "date": "2024-05-18 12:00", "url": "https://www.naharnet.com/stories/en/305302-hamas-says-commander-killed-in-israel-strike-in-lebanon-s-bekaa", "message": "Palestinian militant group Hamas said that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas' armed wing, the Ezzedine al-Qassam Brigades, said in a statement that \"commander\" Sharhabil Sayed was killed \"after he was targeted by Israeli occupation aircraft\" in Lebanon's West Bekaa area.\nA source close to the Palestinian militant group, speaking on condition of anonymity, had earlier told AFP that Sayed was a Hamas official responsible for Lebanon's Bekaa region and \"was killed in an Israeli strike that targeted his vehicle.\"\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Arouri and six other militants in Hezbollah's south Beirut stronghold."}, {"id": "e824d08d-c794-4f57-af64-60cbbbba4a71", "title": "Hamas says commander killed in Israel strike in Lebanon Bekaa", "date": "2024-05-18 14:00", "url": "https://www.naharnet.com:443/stories/en/305302-hamas-says-commander-killed-in-israel-strike-in-lebanon-s-bekaa", "message": "Palestinian militant group Hamas said that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas' armed wing, the Ezzedine al-Qassam Brigades, said in a statement that \"commander\" Sharhabil Sayed was killed \"after he was targeted by Israeli occupation aircraft\" in Lebanon's West Bekaa area.\nA source close to the Palestinian militant group, speaking on condition of anonymity, had earlier told AFP that Sayed was a Hamas official responsible for Lebanon's Bekaa region and \"was killed in an Israeli strike that targeted his vehicle.\"\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Arouri and six other militants in Hezbollah's south Beirut stronghold."}, {"id": "5ffd3a43-88d1-4075-b5c0-3beb87fb04ad", "title": "Man Arrested : Man arrested for killing four | Indore News", "date": "2024-05-18 00:45", "url": "https://timesofindia.indiatimes.com/city/indore/man-arrested-for-killing-four/articleshow/110221182.cms", "message": "We also published the following articles recentlyFour persons were killed in an accident in KonaseemaFour persons were killed in a tragic road accident in Konaseema district involving an RTC bus.\nThe accident occurred as workers were loading paddy near Udumudi village on Tuesday night.\nAnjali murder case: Karnataka Police arrest accused from HubbaliGirish alias Vishwa, prime suspect in Anjali's murder, arrested by Hubbali Police after stabbing incident at her residence.\nHe told the police that there was a dispute between him and his relative Arvind over ‘Banjghadi’ tradition.\nWhen he saw two other people from Surdiya village passing from the area witnessing the crime, they followed them and mowed them down."}, {"id": "1dd7cf17-34c9-4cb1-a98c-9ca44b8afaf6", "title": "  Forever changed : Terrorism victims push for passage of new bill to fix U . S . victims fund", "date": "2024-05-18 00:45", "url": "https://www.yahoo.com/news/forever-changed-terrorism-victims-push-000336004.html", "message": "“When your freedoms are taken away, it changes your life,” Synnestvedt told our Washington News Bureau.\nCongress established a fund in 2015 called the U.S. Victims of State Sponsored Terrorism Fund (USVSST Fund) that gives compensation to victims and survivors who won judgements in court after a terrorist attack.\nThe House bill is sponsored by Rep. Mike Lawler (R-NY), Rep. Josh Gottheimer (D-NJ), Rep. Nicole Malliotakis (R-NY), and Rep. Dan Goldman (D-NY).\nWe told you earlier this month how a watchdog report warned the fund is running low on money.\n“Victims of terrorism carry a prolonged grief with them throughout their lifetime,” said Mistrulli."}, {"id": "826ff444-6d21-4f02-8742-42f3f4c661df", "title": "Troops neutralize bandits , recover arms , ammunition in Sokoto , Zamfara", "date": "2024-05-18 18:15", "url": "https://dailypost.ng/2024/05/18/troops-neutralize-bandits-recover-arms-ammunition-in-sokoto-zamfara/", "message": "The Nigerian Army says its troops neutralized eight terrorists and recovered arms in multiple operations.\nAccording to the statement, in Zamfara State, troops responding to a distress call about terrorists’ activities at Yar Sabiya Wuya District in Aka Local Government Area of Zamfara State, swiftly engaged terrorists in a fierce gun battle.\n“Similarly, in Imo State, troops on patrol around Umuaka in Njaba Local Government Area of Imo State foiled an attempted kidnap of Prince Chinonso Meremikwu.\nThe gallant troops recovered one AK-47 rifle with two loaded magazines and one motorcycle.\n“The troops moved swiftly and engaged the terrorists, neutralizing 2 extremists, and causing the others to flee.”"}, {"id": "c6a677ea-96f8-45de-b019-b9cb8d4ab02a", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/05/18/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend/", "message": "The first distribution of badly needed aid is expected to begin this weekend after rolling off a newly built US pier off the coast of Gaza.\nThe pier on the coast of the Gaza Strip (US Central Command via AP)US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "b46b11f6-a971-4b3c-aaa2-716ddd6d6304", "title": "Schmaybe 50 Tunnels Crossing Into Their Country Why Egypt So Riled About Rafah ? ", "date": "2024-05-18 03:00", "url": "https://hotair.com/tree-hugging-sister/2024/05/17/schmaybe-50-tunnels-crossing-into-their-country-why-egypt-so-riled-about-rafah-n3788602", "message": "Nearly 700 tunnel shafts have been identified in Rafah, with ~50 tunnels crossing into Egypt, revealed @DrGiladNoam at today's sham @CIJ_ICJ hearing.\nThose tunnels are used to smuggle weapons to Hamas and can be used to smuggle senior terrorists and/or hostages out of Gaza.\npic.twitter.com/UAgvyTCoJk — Israel War Room (@IsraelWarRoom) May 17, 2024At least fifty tunnels - so far - scootin' over - well, under - the border into Egypt.\n\"Nearly 700 tunnel shafts have been identified in Rafah, from which approximately 50 tunnels cross into Egypt.\nIf any Americans were to be spirited through those tunnels into Egypt, that would be the end of it."}, {"id": "6f91a92d-9cde-4519-88e7-f707a1a63a0c", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu", "date": "2024-05-18 17:00", "url": "https://www.gjsentinel.com/news/world/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-while-pressure-grows-on/article_c5219e5e-5196-5e62-9dae-9355158e8d65.html", "message": "Mourners, some armed, carry the body of Islam Khamaiseh draped in the Islamic Jihad militant group flag during his funeral in the West Bank Jenin refugee camp, Saturday, May 18, 2024.\nThe Israeli military says Khamaiseh, killed by an airstrike in the West Bank on Friday, was responsible for two shooting attacks on civilians, including one in 2023 that killed an Israeli man nearby a West Bank settlement.\nThe militant group Islamic Jihad said that Khamaiseh was a leader of the Jenin Brigade."}, {"id": "6573debd-a210-46b9-85e0-c48627d0a067", "title": "North Korea confirms missile launch , vows bolstered nuclear force", "date": "2024-05-18 06:15", "url": "http://www.koreaherald.com/view.php?ud=20240518050070", "message": "North Korean leader Kim Jong-un (right) oversees a test-firing of a tactical ballistic missile equipped with a new \"autonomous\" navigation system on Friday, in this photo released by the North's Korean Central News Agency the next day.\n(Yonhap)North Korea has test-fired a tactical ballistic missile equipped with a \"new autonomous navigation system,\" state media said Saturday, with leader Kim Jong-un vowing to boost the country's nuclear force.\nThe launch was the latest in a string of ever more sophisticated tests by North Korea, which has fired off cruise missiles, tactical rockets and hypersonic weapons in recent months, in what the nuclear-armed, UN-sanctioned country says is a drive to upgrade its defences.\nSeoul's military on Friday described the test as \"several flying objects presumed to be short-range ballistic missiles\" from North Korea's eastern Wonsan area into waters off its coast.\n\"The accuracy and reliability of the autonomous navigation system were verified through the test fire,\" Pyongyang's KCNA said Saturday, adding leader Kim expressed \"great satisfaction\" over the launch."}, {"id": "b676972f-4486-49c1-b6bd-59ff02517bd0", "title": "North Korea confirms missile launch , vows bolstered nuclear force", "date": "2024-05-18 10:15", "url": "https://www.koreaherald.com/view.php?ud=20240518050070", "message": "North Korean leader Kim Jong-un (right) oversees a test-firing of a tactical ballistic missile equipped with a new \"autonomous\" navigation system on Friday, in this photo released by the North's Korean Central News Agency the next day.\n(Yonhap)North Korea has test-fired a tactical ballistic missile equipped with a \"new autonomous navigation system,\" state media said Saturday, with leader Kim Jong-un vowing to boost the country's nuclear force.\nThe launch was the latest in a string of ever more sophisticated tests by North Korea, which has fired off cruise missiles, tactical rockets and hypersonic weapons in recent months, in what the nuclear-armed, UN-sanctioned country says is a drive to upgrade its defences.\nSeoul's military on Friday described the test as \"several flying objects presumed to be short-range ballistic missiles\" from North Korea's eastern Wonsan area into waters off its coast.\n\"The accuracy and reliability of the autonomous navigation system were verified through the test fire,\" Pyongyang's KCNA said Saturday, adding leader Kim expressed \"great satisfaction\" over the launch."}, {"id": "f0a29ca5-bfd0-4627-954a-167aac4354ce", "title": "7 soldiers injured after blast in St . Petersburg military academy", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532071.html", "message": "Image Source: IANS NewsSt. Petersburg, May 18 : Seven soldiers were injured after a World War II-era munition exploded in the Military Academy of the Signal Corps in St. Petersburg, Russia's Leningrad Military District said.\nThe explosion occurred on Friday during the cleaning of one of the basement premises when people unloaded garbage into a container, the district's press office was quoted as saying by Xinhua news agency.\nA 76-millimeter World War II-era munition \"arbitrarily detonated\", the press office said.\nThe wounded have been taken to the Defense Ministry's health facility, according to the press office.\nGovernor of St. Petersburg Alexander Beglov has denied that the incident was terrorist-related."}, {"id": "d52791dc-c647-4c23-9356-ddcef998be56", "title": "North Korea : Kim Jong Un orders speed up production to shore up nuclear force", "date": "2024-05-18 08:00", "url": "https://www.firstpost.com/world/north-korea-kim-jong-un-orders-speed-up-production-to-shore-up-nuclear-force-13772188.html", "message": "Kim said that the enemy would be afraid of North Korea’s nuclear combat posture after speeding up production of nuclear weapons read moreNorth Korean leader Kim Jong Un has directed accelerated production to rapidly enhance the country’s nuclear capabilities.\nKim said that the enemy would be afraid of North Korea’s nuclear combat posture after speeding up production of nuclear weapons, according to reports.\nAdvertisementNorth Korea fired multiple short-range ballistic missiles into the sea off its east coast on Friday, according to South Korea’s military.\nThis launch came a day after the US and South Korea conducted joint air combat drills with stealth fighter jets.\nFriday’s launches came a day after the U.S. and South Korea conducted joint drills with stealth fighter jets simulating air combat."}, {"id": "2fba6452-2a89-4f63-b376-294915a1c80c", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 10:00", "url": "https://www.edp24.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials."}, {"id": "9950c9cc-80f9-4977-8195-2655aa0b4a9e", "title": "Two police officers who took a two - hour break to get a kebab on the night of the Manchester Arena attack which left 22 dead are given final written warnings", "date": "2024-05-18 08:15", "url": "https://www.dailymail.co.uk/news/article-13432619/Two-police-officers-took-two-hour-break-kebab-night-Manchester-Arena-attack-left-22-dead-given-final-written-warnings.html", "message": "Two police officers who drove away for a kebab on a two-hour break on the night of the Manchester Arena terror attack have been handed final written warnings.\nThe Manchester Arena Inquiry had heard that suicide bomber Salman Abedi may have been challenged if a British Transport Police (BTP) officer had been present.\nAn investigation into the BTP officers was launched following a complaint by families of the victims relating to evidence heard at the inquiry.\nPC Jessica Bullough and PC Mark Renshaw went on a 10-mile round trip to buy kebabs on the night of the Manchester Arena attack.\nAnother BTP officer who was the subject of the complaint retired before the investigation began."}, {"id": "29535f53-a24b-4fa2-8675-6665b2d1cffb", "title": "The West hostage trap - American Thinker", "date": "2024-05-18 13:15", "url": "https://www.americanthinker.com/blog/2024/05/the_west_s_hostage_trap.html", "message": "Hamas is not unique in taking hostages, although its genocidal fury and the sheer number of hostages seized are unique.\nBiden’s new redline is the protection of non-combatants but offers no solution for winning against an enemy that uses hostages to maximize collateral damage.\nOnce, Western nations recognized that there was a price to pay for stealing enemy civilians as pawns in war.\nAnd because we no longer know where to assign moral blame for hostage-taking, it’s a factor in breaking apart Western civilization.\nI fear that the mass hostage-taking in Israel signifies a new chapter in the history of taking hostages."}, {"id": "a8bff68a-a673-4072-86b7-c4291db967c0", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 09:45", "url": "https://www.thetelegraphandargus.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials."}, {"id": "90169684-8b6e-4190-8162-cfd7a48e6449", "title": "Air raid alert in Russia Belgorod , explosion heard : Report", "date": "2024-05-18 08:15", "url": "https://www.prokerala.com/news/articles/a1532131.html", "message": "Moscow, May 18 : There has been an explosion in the Russian border region of Belgorod following a missile alert, the media reported early Saturday.\nThe Governor of the region, Vyacheslav Gladkov, had called on residents to take shelter via his Telegram channel.\nAs a result of Moscow's war of aggression against Ukraine, Russia's border region regularly comes under fire.\nHowever, casualties and damage are minuscule compared to the destruction and civilian deaths that Russia has caused in Ukraine.\nUkraine has been defending itself against a Russian invasion with massive Western support for more than two years."}, {"id": "e47c3dbb-ec1d-4a6e-b22b-90f088895e0c", "title": "South Korea KF - 21 Jet Live Fires Meteor Advanced Missile Successfully", "date": "2024-05-18 13:30", "url": "https://www.slashgear.com/1581011/south-korea-homegrown-stealth-fighter-kf-21-boramae-meteor-missile-live-fire-test/", "message": "South Korea's KF-21 Stealth Fighter Fired An Advanced Air-To-Air Missile For The First TimeAccording to the South Korean Yonhap News Agency, on May 8, the South Korean homegrown stealth fighter — KF-21 Boramae (\"Young Hawk\") — test-fired the MBDA Meteor medium-range air-to-air missile off the South Korean coast for the very first time.\nMinutes later, the missile passed within a meter of the drone and, presumably, detonated its fragmentation warhead and neutralized the target.\nWhile photos and videos from these tests are forthcoming, this test marks a significant milestone in the development of the 4.5-generation fighter jet (not a full fifth-generation fighter aircraft yet).\nSpecifically, the test brought the Boramae closer to what South Korea's Defense Acquisition Program Administration (DAPA) called \"Phase 1\" — essentially meaning the jet is cleared for air-to-air combat operations.\n[Featured image by the ROK Ministry of National Defense via Wikimedia Commons | Cropped and scaled | Korea Open Government License]"}, {"id": "07fecb04-dbbd-4178-977e-4fda7d838fb3", "title": "Scores of terrorists killed , anti - aircraft guns captured in eastern Rafah", "date": "2024-05-18 15:30", "url": "https://www.jpost.com/israel-hamas-war/article-801630", "message": "The combat team of the IDF’s Givati Brigade has killed more than 80 terrorists during operational activities in eastern Rafah, the military said on Saturday afternoon.\nThe Givati Brigade has been operating in the area for several weeks.\nDuring an assault conducted by the brigade’s 9th Battalion, troops found many anti-aircraft machine guns, the IDF reported.\nIDF Givati Brigade operates in eastern Rafah.\nEarlier, ABC News reported that, since May 4, roughly 1,400 buildings in Rafah have been destroyed."}, {"id": "25863baa-129a-44b8-add8-6010009eb254", "title": "Fierce fighting on streets of Gaza Rafah", "date": "2024-05-18 19:00", "url": "https://www.al-monitor.com/originals/2024/05/fierce-fighting-streets-gazas-rafah", "message": "Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, said that since Israel's Rafah operation began, there had been a massive movement of people.\nThe Israeli army said 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\".\nIsrael has vowed to defeat remaining Hamas forces in Rafah, which it says is the last bastion of the Iran-backed group.\nPalestinian sources in Rafah said Israeli forces were operating in the Al-Salam and Jenina neighbourhoods as well as on the Philadelphi route along the Egyptian border.\nThe World Health Organization has received no medical supplies in Gaza since the Rafah operation began, spokesman Tarik Jasarevic said Friday."}, {"id": "3dfa5f5c-bf6d-412d-a576-a43fe9b9eb99", "title": "Slovakia Deputy PM Blames Media for Fico Assassination Attempt", "date": "2024-05-18 17:15", "url": "https://www.breitbart.com/europe/2024/05/18/slovak-deputy-pm-blames-media-for-fico-assassination-attempt-as-shooter-reportedly-confesses-to-police/", "message": "Slovakian Deputy Prime Minister Robert Kaliňák has laid the blame for the assassination attempt against Robert Fico at the feet of the media for stoking division within society as the alleged shooter reportedly confessed to the attack during a police interrogation.\nSuspected shooter of Slovakian PM Robert Fico, identified by local media as 71-year-old Juraj Cintula, is believed to have confessed to his guilt during a police interrogation, Bratislava-based broadcaster TA3 reported on Sunday.\nLook what happened to athletes, actors, actually anyone who had a different opinion on vaccinations or on the war in Ukraine.\n“The four gunshot wounds that hit him in Wednesday’s assassination caused extensive injuries.\nKaliňák said that doctors attributed his recovery, in part, to Fico being in good physical shape, saying: “I don’t know many strong people like him."}, {"id": "d0125683-ecfa-41ce-bcc3-02328efe9d89", "title": "North Korea Test - Fires Ballistic Missile , Vows Bolstered Nuclear Force", "date": "2024-05-18 03:15", "url": "https://www.ndtv.com/world-news/north-korea-test-fires-ballistic-missile-vows-bolstered-nuclear-force-5688511", "message": "North Korea on Saturday confirmed that it had test-fired a tactical ballistic missile.\nNorth Korea on Saturday confirmed that it had test-fired a tactical ballistic missile, the government news agency KCNA reported, with leader Kim Jong Un vowing to boost the country's nuclear force.\nThe South Korean government reported the launch Friday, saying the North had fired multiple suspected short-range ballistic missiles.\nSeoul described the event as \"several flying objects presumed to be short-range ballistic missiles\" from North Korea's eastern Wonsan area into waters off its coast.\n\"The enemies would be afraid of and dare not to play with fire only when they witness the nuclear combat posture of our state,\" KCNA reported Kim as saying."}, {"id": "9a68a59e-63ce-4dbc-9b4f-15bc9f154526", "title": "North Koreas Kim Jong Un Seeks Speeds Up Nuclear Production To Cope With Enemies Reckless Confrontation", "date": "2024-05-18 03:30", "url": "https://www.india.com/news/world/north-koreas-kim-seeks-speeds-up-nuclear-production-to-cope-with-enemies-reckless-confrontation-6938892/", "message": "HomeNewsNorth Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’North Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’Kim expressed contentment with the outcome of the missile test, particularly praising the autonomous navigation system's performance.\nNorth Korea's Kim Seeks Speeds Up Nuclear Production To 'Cope With Enemies Reckless Confrontation'North Korean leader Kim Jong Un has issued a directive to expedite the production process to enhance the country’s nuclear capabilities.\nThe primary objective behind this move is to strengthen North Korea’s nuclear deterrence capabilities, as highlighted by KCNA.\nKim emphasized that by ramping up production, North Korea aims to instill fear in its enemies regarding the country’s nuclear combat readiness.\nKim made the production order “to cope with …the enemies’ reckless military confrontation” and bolster nuclear war deterrence, KCNA said."}, {"id": "6f26939b-1a8f-4bdd-8f85-a090aa11e0f9", "title": "Russian Army Loses 1 , 210 Soldiers In Ukraine Over Past Day", "date": "2024-05-18 08:00", "url": "https://menafn.com/1108228720/Russian-Army-Loses-1210-Soldiers-In-Ukraine-Over-Past-Day", "message": "(MENAFN- UkrinForm) Russia's overall combat losses in Ukraine between February 24, 2022 and May 18, 2024 are estimated at about 491,080 troops, with 1,210 soldiers killed or wounded in action in the past 24 hours.\nThe General Staff of the Armed Forces of Ukraine said this in a post on Facebook, Ukrinform reports.\nIn addition, as of May 18, Ukraine's defense forces have already destroyed 7,560 (+13) Russian tanks, 14,595 (+43) armored fighting vehicles, 12,639 (+36) artillery systems, 1,071 multiple rocket launchers, 801 (+1) anti-aircraft warfare systems, 354 (+1) warplanes, 326 helicopters, 10,108 (+35) tactical unmanned aerial systems, 2,203 (+3) cruise missiles, 26 warships/cutters, 1 submarine, 17,169 (+65) vehicles and fuel tankers, and 2,075 (+6) pieces of special equipment.\nUmerov on Kharkiv front: We are stabilizing situation, but we need more weaponsThe latest reports on enemy losses are being verified."}, {"id": "d4205e38-d1e6-4fbe-b472-30625a8251e6", "title": "Man who murdered pensioner  in revenge for Gaza  is terrorist - Judge", "date": "2024-05-18 12:30", "url": "https://www.asianimage.co.uk/news/24329267.man-murdered-pensioner-in-revenge-gaza-terrorist---judge/", "message": "The judge Mrs Justice Cheema-Grubb told Alid he had “hoped to frighten the people of Britain and undermine the freedoms they enjoy” when he murdered Mr Carney in a terrorist attack.\nShe said the attack on Mr Nouri was “an attempt to punish him for converting to Christianity”.\nDuring his police interview the day after the murder, Alid said he launched his attacks because “Israel had killed innocent children”.\nAhmed Alid attempted to kill his housemate, a Christian convert (Counter Terror Police/PA)Alid denied murder, attempted murder and assaulting the two officers, claiming he did carry out the stabbings but without intention to kill or cause serious harm.\nMrs Justice Cheema-Grubb ruled Alid had committed terrorist offences when he murdered Mr Carney and attempted to murder Mr Nouri."}, {"id": "4e3095a8-87b4-4ca9-8001-2eefb6c31bd7", "title": "Fierce fighting on streets of Gaza Rafah", "date": "2024-05-18 19:30", "url": "https://www.bssnews.net/international/189890", "message": "An AFP reporter said air strikes and artillery shells pounded eastern Rafahas warplanes criss-crossed over the city on Gaza's border with Egypt.\nThe Israeli army said 310 pallets began moving ashore in \"the first entryof humanitarian aid through the floating pier\".\nThe Rafah crossing, a vital conduit for humanitarian assistance, has beenclosed since Israel launched its operation in the city last week.\nIsrael has vowed to defeat remaining Hamas forces in Rafah, which it saysis the last bastion of the Iran-backed group.\nMeanwhile, Israel said it killed two senior Islamic Jihad militants inseparate air strikes in the northern West Bank and in Rafah."}, {"id": "302187bc-a980-4e83-891f-94cee9c9c2b8", "title": "FBI , DHS warn 2024 Pride events could be targeted by foreign terrorists groups", "date": "2024-05-18 12:30", "url": "https://www.yahoo.com/news/fbi-dhs-warn-2024-pride-111711314.html", "message": "But this year, the FBI and Department of Homeland Security warn foreign terrorist organizations and their supporters may target these LGBTQ+ venues and gatherings.\nOfficials say three alleged ISIS sympathizers were arrested in Austria last summer for attempting an attack during a Pride parade.\nKenya Hutton is one of the organizers of DC Black Pride, the nation’s largest celebration for the Black LGBTQ+ community.\nHutton said DC Black Pride works with local and federal police agencies to keep crowds safe.\nThe FBI says to report a threat, contact your local FBI field office (https://www.fbi.gov/contact-us/field-offices) or closest international office (https://www.fbi.gov/contact-us/international-offices) or call 1-800-CALL-FBI (225-5324)."}, {"id": "cbb3c37d-6f6a-4514-9b2f-07d049b750f3", "title": "Slovakia Reels from PM Shooting as Suspect Goes to Court", "date": "2024-05-18 09:30", "url": "https://www.kyivpost.com/post/32862", "message": "The suspect charged with the attempted murder of Slovak Prime Minister Robert Fico is expected on Saturday before a penal court that will decide whether to hold him in pre-trial detention.\nThe man, identified by Slovak media as 71-year-old poet Juraj Cintula, fired five shots at Fico on Wednesday and hit him four times.\nThe shooting occurred as Fico was walking towards his supporters after a government meeting in the central Slovak town of Handlova.\nAdvertisementA prosecutor proposed on Friday that Cintula be placed in pre-trial detention after he had been charged with a premeditated murder attempt.\nAdvertisement\"All these lies are the main reason why Robert Fico is fighting for his life today,\" he said in an emotional message on Smer's website."}, {"id": "60d36ef1-8af5-46d6-bbb5-424535c1b362", "title": "Meet the man who helped inspire the  Call of Duty  craze", "date": "2024-05-18 12:30", "url": "https://nypost.com/2024/05/18/lifestyle/meet-the-man-who-helped-inspire-the-call-of-duty-craze/", "message": "5 “The Way of Rōnan: Defying the Odds on Battlefields, in Business and in Life” is written by Tu Lam.\n5 Tu Lam’s amazing story from poverty-stricken immigrant to solider and businessman helped inspire the ‘Call of Duty’ video game serious.\nIn a 23-year military career Tu was a weapons specialist, a combat diver, a team leader, and a special forces commando.\nIt was just another beautiful day in Iraq.”But Tu Lam’s experiences left him injured, physically and mentally.\nTu Lam’s military career was over."}, {"id": "3b5853c1-f4c4-4798-929a-acfcc4aa66b1", "title": "Rocket Shell And Mine Explosion Kill 3 Children In Balkh And Badghis", "date": "2024-05-18 09:45", "url": "https://menafn.com/1108228936/Rocket-Shell-And-Mine-Explosion-Kill-3-Children-In-Balkh-And-Badghis", "message": "(MENAFN- Khaama Press) Officials and local sources in the provinces of Balkh and Badghis have confirmed that three children were killed and another injured due to the explosion of a rocket shell and landmine remnants from past conflicts in these provinces.\nMohammad Essa Wasiq, the spokesperson for the police command in Balkh province, announced in a statement that the incident occurred on Friday, May 17th, in the village of Alam Khil, Balkh district.\nThe statement mentioned that the explosion happened while three children were playing with a war remnant shell.\nAdditionally, local sources in Badghis province reported an explosion of a war remnant mine in the Qadis district of this province.\nReports indicate that this explosion took place in the village of Juwalq, Qadis district, resulting in the death of a 17-year-old teenager."}, {"id": "a4606625-df6d-4f5c-95b0-c641189954fb", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:00", "url": "https://www.yourlocalguardian.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "ea9a74f5-59bd-415c-881f-99d277c6b647", "title": "3 Spanish nationals killed in shooting in Afghanistan : Official", "date": "2024-05-18 08:15", "url": "https://www.prokerala.com/news/articles/a1532124.html", "message": "Bamyan : , May 18 (IANS) Three foreign nationals were killed in a shooting attack in central Afghanistan's Bamyan province.\nThe victims are confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively, from Spain, Norway, Australia, and Lithuania, Xinhua news agency reported.\nOut of the four foreigners, two were women, Bamyan's provincial police spokesperson Muhammad Khawani Rasa told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three others were injured in the shooting attack, Ministry of Interior Affairs Spokesperson Mufti Abdul Mateen Qani said on social media platform X on Friday."}, {"id": "bdae37ac-e271-429d-b422-a1502efb38c4", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 10:00", "url": "https://www.oxfordmail.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials."}, {"id": "b856870a-b980-42b6-aca0-2b58f2289dc3", "title": "Colin Sheridan : Harrowing memory of atrocity on our streets put in stark comparison to Gaza horror", "date": "2024-05-18 00:45", "url": "https://www.irishexaminer.com/opinion/columnists/arid-41397181.html", "message": "The bombs, later claimed by the Ulster Volunteer Force, killed 34 civilians, including an unborn child, and injured almost 300.\nMost of the victims were young women, although the ages of the dead ranged from 19 up to 80 years.\nSmoke rises following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, Friday, May 17, 2024.\nIf you were to go to one funeral per day of every child killed in Gaza, it would take 37 years.\nDisplaced Palestinians children take the coastal Rashid road to return to Gaza City as they pass through Nuseirat in the central Gaza Strip on April 14, 2024."}, {"id": "b129ef6a-951b-416d-ad28-9bbe8bf81585", "title": "Biden declares an end to America  forever  wars", "date": "2024-05-18 11:45", "url": "https://www.thetimes.co.uk/travel/destinations/north-america-travel/us/biden-declares-an-end-to-americas-forever-wars-mz6jj2f8m", "message": "Eighteen years later in the case of Iraq, and 20 years after the Afghanistan operation began, both wars have now come to an end for the United States.\nBut Biden, whose foreign policy legacy will depend on what happens in Iraq and Afghanistan between now and 2024, has drawn a line.\nIsis may be realigning its power structures in Africa but with US combat troops gone from Iraq by the end of this year, there could be a resurgence.\nIn Afghanistan, Isis is still a potent force for evil despite suffering a high attrition rate from relentless US and coalition special forces operations.\nThis suited the Biden doctrine based on ending America’s involvement in fighting other people’s wars."}, {"id": "785e6a3d-4a23-4ab3-a01f-a30deff515fc", "title": "3 Spanish nationals killed in Afghanistan Bamyan shooting : Afghan official", "date": "2024-05-18 06:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/18/content_117197124.htm", "message": "You are here:视频播放位置 下载安装Flash播放器BAMYAN, Afghanistan, May 18 (Xinhua) -- The three foreign nationals killed in a shooting attack in central Afghanistan's Bamyan province on Friday have been confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively from Spain, Norway, Australia and Lithuania.\nOf them, two were women, Bamyan's provincial police spokesperson Muhammad Khawani Rasa told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three other Afghans were injured in the shooting attack, spokesperson for the Ministry of Interior Affairs Mufti Abdul Mateen Qani said on social media platform X on Friday.\nFour suspects have been arrested, Qani added."}, {"id": "2e3eb323-96b6-4e01-b0ec-c6e7b2d2cccf", "title": "IDF kills Palestinian Islamic Jihad leader in air strike", "date": "2024-05-18 05:15", "url": "https://www.prokerala.com/news/articles/a1532086.html", "message": "Tel Aviv, May 18 : Israel Defense Forces (IDF), in a statement on Saturday, said that it killed a Palestinian Islamic Jihad (PIJ) leader on Friday night in an air strike.\nTel Aviv, May 18 (IANS) Israel Defense Forces (IDF), in a statement on Saturday, said that it killed a Palestinian Islamic Jihad (PIJ) leader on Friday night in an air strike.\nIDF said that in a joint operation with the Shin Bet, they located the Islamic Jihad operatives and struck the building where they were hiding.\nThe IDF said that the killed Palestinian Islamic Jihad was responsible for a major attack in the Hermesh settlement in West Bank, leading to the killing of many Jews.\nIn a statement on Saturday, the Palestinian Health Ministry said that Aslam Hamaisa has been killed and several injured in an attack by the Israel Air Force on a building in Jenin on Friday night."}, {"id": "1ed9b5c3-b819-4ef9-b0b1-fbfc07ebcc3f", "title": "Ukraine Can Still Beat Russia . It Just Comes Down to Western Aid . ", "date": "2024-05-18 09:45", "url": "https://www.businessinsider.com/ukraine-can-still-beat-russia-comes-down-to-western-aid-2024-5", "message": "With 14 to 21 well-equipped brigades, Ukraine could eject Russian forces from all Ukrainian territory, according to an American expert.\nOne is Ukraine amassing a sufficiently powerful ground combat force that can defeat the estimated 500,000 Russian troops in Ukraine.\nWith Russian forces solidly dug in behind minefields and fortifications across eastern and southern Ukraine, that Baltic scenario bears similarities to the situation that Ukraine faces today.\nGiven sufficient quantities of munitions, Ukraine could inflict enough losses to decisively attrit Russian forces that have already sustained an estimated 500,000 casualties.\nHe started with a 2023 Estonian Ministry of Defense plan that laid out a roadmap for Ukraine to defeat Russia."}, {"id": "3e89174b-3b26-4f90-b933-2d7b641083c7", "title": "Slovakia :  We have to stop this hatred  – DW – 05 / 18 / 2024", "date": "2024-05-18 06:15", "url": "https://www.dw.com/en/slovakia-we-have-to-stop-this-hatred/a-69119511", "message": "Politicians in Slovakia have unanimously condemned Wednesday's attack on PM Robert Fico.\nIt was more or less business as usual in Bratislava, the capital of Slovakia, the day after the assassination attempt on Prime Minister Robert Fico.\nIn response to a comment that an attempt had been made on the life of Prime Minister Robert Fico, he said: \"Yes, that's true.\n\"On the other hand, we are here in Bratislava, so you can't expect much sympathy or compassion for Robert Fico.\"\n\"I am shocked and appalled by the shots fired at Prime Minister Robert Fico,\" wrote PS leader Michal Simecka on X, formerly Twitter."}, {"id": "b240f008-4b9d-4b36-b9cc-94f1dfd66ac8", "title": "Fighting rages in Gaza Rafah after first aid delivery via pier", "date": "2024-05-18 10:00", "url": "https://www.voanews.com/a/fighting-rages-in-gaza-s-rafah-after-first-aid-delivery-via-pier-/7617323.html", "message": "Heavy clashes and bombardment Saturday rocked Gaza's southern city of Rafah, witnesses said, as the Israeli military announced the first 310 pallets of humanitarian aid had entered the besieged territory via a U.S.-built pier.\nMore than 10 days into what the Israeli military called a \"limited\" operation in Rafah, fighting between Israeli forces and Palestinian militants has also flared again in Gaza's north.\nThe 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier,\" the Israeli army said in a statement.\nIn the coming days, around 500 tons of aid are expected to be delivered to Gaza through the pier, according to U.S. Central Command.\nAmid the aid shortages, the Israeli army said \"dozens of Israeli civilians\" set fire to a Gaza-bound aid truck in the occupied West Bank on Thursday night, in the second such attack in a week."}, {"id": "67a90774-eba2-433d-9943-2a534191da84", "title": "Gaza : 31 Palestinians killed , 56 injured by Israeli bombardment last 24hrs - The Muslim News", "date": "2024-05-18 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-31-palestinians-killed-56-injured-by-israeli-bombardment-last-24hrs/", "message": "By Abdul Adil(The Muslim News): 31 Palestinians were killed and 56 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 24 hours, according to Ministry of Health.\nThis brings to total number of Palestinians killed by Israeli forces since 7 October 2023 to at least 35,303 and 79,261 injured in Gaza, according to Ministry of Health.\nFour Palestinians were killed and many others injured in Israeli airstrikes on the Nuseirat refugee camp in the central blockaded Gaza Strip.\nAn Israeli raid targeted a Palestinian house located in the al-Shati refugee camp in western Gaza and other raids targeted central Gaza city.\nMedical sources said that the bodies of nine Palestinians killed in Israeli airstrikes and bombardment arrived at the European Gaza Hospital near Khan Younes."}, {"id": "be3cc90e-7505-4921-a1f1-116e11d5bfeb", "title": "North Korea Kim seeks to shore up nuclear force , oversees missile test , KCNA says | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-18 00:45", "url": "https://www.asahi.com/ajw/articles/15271493", "message": "In this photo provided by the North Korean government, North Korean leader Kim Jong Un, left, supervises artillery firing drills in North Korea, March 7, 2024.\nThis way, the enemy would be afraid of North Korea's nuclear combat posture, Kim added.\nNorth Korea fired a number of short-range ballistic missiles towards the sea off its east coast on Friday, South Korea's military had said.\nKim expressed satisfaction with the successful missile test featuring an autonomous navigation system, KCNA said.\nFriday's launches came a day after the U.S. and South Korea conducted joint drills with stealth fighter jets simulating air combat."}, {"id": "e8783369-80b3-4f3c-bf78-2ec041e8f127", "title": "Ukraine can still beat Russia . It just comes down to enough Western aid . ", "date": "2024-05-18 10:15", "url": "https://www.yahoo.com/news/ukraine-still-beat-russia-just-090002875.html", "message": "With 14 to 21 well-equipped brigades, Ukraine could eject Russian forces from all Ukrainian territory, according to an American expert.\nOne is Ukraine amassing a sufficiently powerful ground combat force that can defeat the estimated 500,000 Russian troops in Ukraine.\nAn ill-prepared Ukrainian counteroffensive in summer 2023 sputtered amid Russian minefields and inexperienced Ukrainian troops struggling to master newly arrived Western combat vehicles.\nGiven sufficient quantities of munitions, Ukraine could inflict enough losses to decisively attrit Russian forces that have already sustained an estimated 500,000 casualties.\nEven this doesn't cover all the items Ukraine would need, such as air defense weapons for the front-line troops, Bohnert noted."}, {"id": "d066db2c-c8f0-468f-bdeb-9db3d252674e", "title": "Three Spanish nationals killed in Afghan Bamyan shooting", "date": "2024-05-18 11:15", "url": "http://www.uniindia.com/three-spanish-nationals-killed-in-afghan-s-bamyan-shooting/world/news/3201673.html", "message": "Three Spanish nationals killed in Afghan's Bamyan shootingKabul, May 18 (UNI) The three foreign nationals who died in a shooting attack in central Afghanistan's Bamyan province on Friday have been confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively from Spain, Norway, Australia, and Lithuania.\nOf them, two were women, Bamyan's provincial police spokesperson, Muhammad Khawani Rasa, told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three other Afghans were injured in the shooting attack, spokesperson for the Ministry of Interior Affairs Mufti Abdul Mateen Qani said on social media platform X on Friday.\nFour suspects have been arrested, Qani added."}, {"id": "e7dce69b-a534-4197-a739-842104562f77", "title": "Fighting rages in Gaza Rafah after first aid delivery via pier", "date": "2024-05-18 10:00", "url": "https://www.al-monitor.com/originals/2024/05/fighting-rages-gazas-rafah-after-first-aid-delivery-pier", "message": "Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, said that since Israel's Rafah operation began, there had been a massive movement of people.\nThe Israeli army said 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\".\nIsrael has vowed to defeat remaining Hamas forces in Rafah, which it says is the last bastion of the Iran-backed group.\nPalestinian sources in Rafah said Israeli forces were operating in the Al-Salam and Jenina neighbourhoods as well as on the Philadelphi route along the Egyptian border.\nThe World Health Organization has received no medical supplies in Gaza since the Rafah operation began, spokesman Tarik Jasarevic said Friday."}, {"id": "7eb420b9-4c81-4ca8-aca4-4b036cbe5f6c", "title": "Treasury details response to illicit finance threats of money laundering , terrorism", "date": "2024-05-18 12:00", "url": "https://biztoc.com/x/e4985e070c132a2e", "message": "The US Department of the Treasury this week released its 2024 report on illicit finance, examining threats of money laundering and terrorist financing and its strategies to combat them.\nThe Treasury cited professional money launderers, financial fraudsters, cybercriminals and those seeking to finance terrorism as ongoing threats to the US financial system.\nThe 44-page report…This story appeared on dlnews.com , ."}, {"id": "4d45c808-c7de-4125-acfe-8783e4d04955", "title": "Christian teenager killed in sword attack laid to rest", "date": "2024-05-18 17:30", "url": "https://www.christiantoday.com/article/christian.teenager.killed.in.sword.attack.laid.to.rest/141736.htm", "message": "Christian teenager killed in sword attack laid to restThe family of a 14 year old killed in a sword attack in London last month have paid tribute to him after his funeral on Friday.\nDaniel Anjorin was killed in the attack in the Hainault area of east London on 30 April as he walked to school.\nFamily and friends gathered for Daniel's funeral service at Jubilee Church, Ilford, in London on Friday.\nA statement posted to the church's website on behalf of the family said: \"Today, we laid our dear son Daniel to rest knowing that he is with the Lord, but he will be forever missed.\n\"The service today was befitting of Daniel in every way, because he was a gentle, spirited and just a peace-loving boy,\" he said."}, {"id": "be0350de-a00c-4753-8868-8e16f71e0515", "title": "IDF Claims Hezbollah Hit Israel Missile - Detecting Airship : Report", "date": "2024-05-18 17:00", "url": "https://www.businessinsider.com/idf-claims-hezbollah-hit-israels-missile-detecting-airship-report-2024-5", "message": "The IDF has claimed Hezbollah hit its \"Sky Dew\" radar balloon, a report says.\nThe IDF responded by striking Hezbollah sites, an IDF spokesperson said.\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementThe Israel Defense Forces (IDF) claimed that a Hezbollah drone struck a large missile-detecting airship known as \"Sky Dew,\" Israeli outlet Ynetnews reported.\n\"There were no casualties and no impact to the IDF's aerial situational awareness capability in the area,\" IDF Spokesperson Rear Admiral Daniel Hagari said, per Ynet News."}, {"id": "0d7527d0-9910-4985-8f3b-94c45a4c6ed0", "title": "A would - be assassin stirs Europe violent ghosts", "date": "2024-05-18 19:00", "url": "https://www.bostonglobe.com/2024/05/18/world/would-be-assassin-stirs-europes-violent-ghosts/", "message": "In significant respects, Russia is waging its war in Ukraine against Europe’s liberal democracies.\nIn this political world, there are no longer opponents, there are only enemies.\nThe Ukraine war sharpens these fissures because nationalists across Europe are aligned with President Vladimir Putin’s reactionary moral ideology.\nAdvertisement“The European Union is seen as unable to protect its own borders,” Rupnik said.\n“I don’t know about World War III,” Wigura said, “but it does not look good."}, {"id": "8111204f-bdff-411b-aee7-6d128dfd6662", "title": "One Palestinian killed , eight others wounded in an Israeli raid in the West Bank", "date": "2024-05-18 11:30", "url": "https://in-cyprus.philenews.com/international/one-palestinian-killed-eight-others-wounded-in-an-israeli-raid-in-the-west-bank/", "message": "A Palestinian militant was killed and eight other people were wounded on Friday in an Israeli airstrike on the Jenin refugee camp in the occupied West Bank, the Palestinian Authority’s health ministry and the Israel Defense Forces said.\nThe armed section of the Palestinian Islamic Jihad group said the militant who died was a member of the group and was named Islam Hamaisa.\nAccording to the Palestinian Authority’s Ministry of Health, the eight wounded were evacuated and are being treated in stable condition in hospitals.\nThe Israeli armed forces said the raid was carried out by a fighter jet and a helicopter.\nIt was a rare operation of this kind in the occupied West Bank, where violence had already escalated well before the Israeli/Hamas war broke out in the Gaza Strip on 7 October."}, {"id": "1734af6a-aec8-4d0d-9058-93c38686cddc", "title": "LANPAC 2024 Speech > U . S . Pacific Fleet > Speeches U . S . Pacific Fleet", "date": "2024-05-18 01:00", "url": "https://www.cpf.navy.mil/Newsroom/Speeches/Article/3779524/lanpac-2024-speech/", "message": "Here's how you knowAn official website of the United States government"}, {"id": "069479f1-0f14-4c3a-aeac-b0ab6cd1ea71", "title": "Social divisions and hostile rhetoric in Slovakia provide fertile ground for political violence", "date": "2024-05-18 00:30", "url": "https://www.newsday.com/news/nation/slovakia-prime-minister-polarization-v61889", "message": "But he blamed what he called the hostile communication strategies of Slovak politicians for the growing hostilities in recent years.\nPeople walk in Banska Bystrica, central Slovakia, Friday, May 17, 2024.\nHe referred to journalists and liberal Slovak politicians as “rats.” He called a major television network, two nationwide newspapers and a news website his enemies, and refused to communicate with them.\nPeople walk in Banska Bystrica, central Slovakia, Friday, May 17, 2024.\nSociety has been divided for a long time and this is another thing that will radicalize them even more.”"}, {"id": "7eae63ac-8d9f-4f3c-8a51-6e34f139f8f3", "title": "South Florida Pride Month organizers assure security as FBI warns of threats to LGBTQ events", "date": "2024-05-18 01:30", "url": "https://www.nbcmiami.com/news/local/south-florida-pride-month-organizers-assure-security-as-fbi-warns-of-threats/3313816/", "message": "Pride Month is less than two weeks away, and organizers of festivities in Florida are busy finalizing their events.\nWe know that we’re targeted a lot,\" said Jameer Baptiste, an organizer for the Wilton Manors Stonewall Parade and Festival during Pride Month in June.\nFTOs may look to exploit increased gatherings associated with the upcoming June 2024 Pride Month.\nIn Miami, Wynwood Pride is a multi-weekend event for the entire month of June with parties and events.\nOrganizers of both events say threats only make the LGBTQ community stronger."}, {"id": "70501870-b64f-4f6a-bb8c-4fd5dcbfd49e", "title": "Ulu Tiram attack shouldnt be taken lightly , says Zahid", "date": "2024-05-18 07:15", "url": "https://www.thestar.com.my/news/nation/2024/05/18/ulu-tiram-attack-shouldn039t-be-taken-lightly-says-zahid", "message": "JERANTUT: The early morning attack at the Ulu Tiram police station should not be taken lightly despite the country's overall peaceful state, says Datuk Seri Dr. Ahmad Zahid Hamidi.\nAhmad Zahid expressed confidence in Malaysia’s status as one of the most peaceful nations, as reflected in its peace index.\nWe must ensure our nation remains free from terrorism, and maintain harmony among various races and religions.\nThe swift police response in Ulu Tiram is greatly appreciated, and we aim to eradicate any terrorism influence or violence,” he added.\nHe was speaking to reporters after the inauguration of the 5.5 Megawatt Biogas Power Plant by Felcra Japutra Sdn Bhd and Cenergi SEA Berhad (Cenergi) on Saturday (May 18), which was also attended by Pahang Mentri Besar Datuk Seri Wan Rosdy Wan Ismail.- Bernama"}, {"id": "9e79ce59-4c47-49a1-b868-e5be241a0759", "title": "Here how the US Army multidomain task force is contributing to AUKUS", "date": "2024-05-18 00:00", "url": "https://www.defensenews.com/land/2024/05/17/heres-how-the-us-armys-multidomain-task-force-is-contributing-to-aukus/", "message": "HONOLULU — The U.S. Army’s 3rd Multidomain Task Force, headquartered in Hawaii, is getting officers from both Australia and the U.K. this summer and will work on advancing technology that’s.\nfocus of the second pillar of the AUKUS pact, according to U.S. Army Pacific Commander Gen. Charles Flynn.\nWorking on technology related to AUKUS Pillar 2 focus areas is a logical fit for the Multidomain Task Force.\n“AUKUS Pillar 2 is really about accelerating artificial intelligence and machine learning aspects,” Col. Michael Rose, the commander of the 3rd MDTF told Defense News at LANPAC.\nWhile developing technology which accomplish efforts within AUKUS Pillar 2 is not stated objective for a multinational, combined MDTF, Rose said, it’s a natural fit to do some of that work."}, {"id": "f861b886-dba6-4c4a-8929-4f78c9b00717", "title": "Here how the US Army multidomain task force is contributing to AUKUS", "date": "2024-05-18 00:00", "url": "https://www.defensenews.com/land/2024/05/17/heres-how-the-armys-multidomain-task-force-is-contributing-to-aukus/", "message": "HONOLULU — The U.S. Army’s 3rd Multidomain Task Force, headquartered in Hawaii, is getting officers from both Australia and the U.K. this summer and will work on advancing technology that’s.\nfocus of the second pillar of the AUKUS pact, according to U.S. Army Pacific Commander Gen. Charles Flynn.\nWorking on technology related to AUKUS Pillar 2 focus areas is a logical fit for the Multidomain Task Force.\n“AUKUS Pillar 2 is really about accelerating artificial intelligence and machine learning aspects,” Col. Michael Rose, the commander of the 3rd MDTF told Defense News at LANPAC.\nWhile developing technology which accomplish efforts within AUKUS Pillar 2 is not stated objective for a multinational, combined MDTF, Rose said, it’s a natural fit to do some of that work."}, {"id": "4a670e0b-1ac1-47ed-a473-8863a8973c47", "title": "Some 6 , 200 demonstrate in Berlin for Palestine on Nakba Day", "date": "2024-05-18 18:45", "url": "https://www.yahoo.com/news/6-200-demonstrate-berlin-palestine-174407296.html", "message": "May 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago.\nPalestinians mark Nakba Day on May 15 every year.\nOthers shouted \"Free Palestine, Free Gaza.\"\nMay 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago.\nMay 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago."}, {"id": "d7744cb8-2247-4ec6-bbff-21c7fd4992b4", "title": "Protests of despair", "date": "2024-05-18 09:45", "url": "https://www.thedailystar.net/opinion/views/project-syndicate/news/protests-despair-3612251", "message": "Rhetorically, at least, the 1968 protesters explicitly identified with the anti-imperialist Viet Cong position and a broader, positive socialist project, whereas today's protesters very rarely identify with Hamas, and instead are \"identifying with despair.\"\nAs Berardi puts it, \"Despair is the psychological and also cultural trait that explains the wide identification of young people with the Palestinians.\nThe authorities' obscenely repressive response to the protests supports Berardi's hypothesis.\nThe harsh crackdowns are not motivated by any fear that the protests will launch a new political movement; rather, they are expressions of panic—a futile refusal to confront the despair that pervades our societies.\nOne way to help break the impasse is to offer public support for the student protests."}, {"id": "220cd9e1-fb07-4469-a7e8-16cfd1f85d95", "title": "Tusk reveals £2bn  European Dome  to protect continent | World | News", "date": "2024-05-18 13:15", "url": "https://www.express.co.uk/news/world/1900791/donald-tusk-european-dome-russia-attack", "message": "Donald Tusk has revealed plans for a new 'European Dome' inspired by Israel's Iron DomePoland is leading collaborative efforts to develop a so-called “European Dome” to protect the skies of the continent from Russian attack, the country’s Prime Minister has said.\nDonald Tusk also revealed work on £2billion fortifications along his country’s borders - referred to as Shield East - is already underway.\nPoland had decided to invest 10 billion Polish Zlotys in the project, Mr Tusk announced.\nRead our Privacy PolicyThe project would involve a “satellite component”, Mr Tusk stressed.\n\"This will also be part of a large project that we must coordinate together with other partners, ie the safe dome.” Mr Tusk said he would discuss the financing of the satellite technology with the European Investment Bank next week."}, {"id": "03bf0a48-984a-4cd2-8af7-abfab7c29f90", "title": "Israel Atrocities - Live Event Reporting by Dunya News", "date": "2024-05-18 04:45", "url": "https://dunyanews.tv/en/Event-Reporting/156", "message": "Last month, more than 960 Israeli military raids were carried out across the occupied West Bank, with an average of 32 raids carried out every day.\nIt added that one strike in Rafah killed a “significant” Islamic Jihad figure who operated as the head of logistics for the organisation’s Rafah brigade.\nSat, 18 May 2024 12:34:59 PKTNo let-up in Israeli attacks on Jabalia, Rafah The Israeli military is still operating aggressively in the north of Gaza with large-scale air strikes and attacks.\nIn Rafah city, the Israeli military is pushing deeper into the central parts with overnight attacks on residential homes in Barbara refugee camp.\nSat, 18 May 2024 08:15:05 PKTAid reached Gaza for the first time via a US-built temporary pier, but an American official urged Israel to open much more efficient land crossings."}, {"id": "57a25225-be76-4798-bc33-c1d99be4d57c", "title": "American Doctors In Gaza See Up - Close Toll Of War Weapons On Children", "date": "2024-05-18 18:30", "url": "https://menafn.com/1108229417/American-Doctors-In-Gaza-See-Up-Close-Toll-Of-War-Weapons-On-Children", "message": "The strikes have also reduced to rubble the homes of Gaza medical students and staffers at the hospital, further reducing the ranks as locals are forced to evacuate or move their families to safety.\nThe White House continues to struggle with condemning Israel's attacks on Gaza, which have killed civilians, humanitarian aid workers and journalists.\n'”Before Friday's evacuation, the medical workers acknowledged the fear, shared by their Gazan counterparts, that the hospital will become a target if foreign aid workers leave.\n\"I owe a great debt to Dr. Hamawy,” Duckworth later said in a statement to The Post.\nWhen Duckworth learned that Hamawy was trapped in Gaza, she quickly got his phone number and said she remains in close contact with him."}, {"id": "168899cb-340c-442e-a3f8-68f9385c9714", "title": "Shot Slovakian PM Fico still in serious condition", "date": "2024-05-18 14:00", "url": "https://www.canberratimes.com.au/story/8632834/shot-slovakian-pm-fico-still-in-serious-condition/?cs=14232", "message": "\"We have not won yet, that is important to say,\" Deputy Prime Minister Robert Kaliniak, said on Saturday, giving an update on Fico's condition in front of the hospital in the town of Banka Bystrica where he is being treated."}, {"id": "a5d2b9ed-1076-44ff-89b9-0c12f4998e79", "title": "Shot Slovakian PM Fico still in serious condition", "date": "2024-05-18 14:00", "url": "https://www.canberratimes.com.au/story/8632834/shot-slovakian-pm-fico-still-in-serious-condition/?cs=14264", "message": "\"We have not won yet, that is important to say,\" Deputy Prime Minister Robert Kaliniak, said on Saturday, giving an update on Fico's condition in front of the hospital in the town of Banka Bystrica where he is being treated."}, {"id": "8bba72d8-df9c-4167-b2d0-4ae345f5214f", "title": "Slovak PM Fico Conscious and Communicative , Suspect Assisting Police", "date": "2024-05-18 02:00", "url": "https://www.breitbart.com/politics/2024/05/17/slovak-shooting-pm-fico-conscious-and-communicative-suspect-assisting-police-in-investigation/", "message": "Slovakian Prime Minister Robert Fico is awake and communicative after the attempted assassination against him, meanwhile the alleged gunman has helped police search his own car and home for evidence.\nThe President-elect of Slovakia Peter Pellegrini has met with shot Prime Minister Robert Fico, and has revealed the politician didn’t lose consciousness during or after the attack.\nRobert Fico has not suffered memory loss and remembers being shot, being evacuated by car and air to the hospital, and receiving treatment by the emergency team, Pellegrini said.\nPellegrini reveals: “The prime minister remembers what happened.\nThe suspect has reportedly confessed to police and proclaimed his pride at the act, and is assisting officers in their inviestigation."}]