[{"id": "85197dfc-536b-4a71-a907-57a99effe836", "title": "Campaign to derail Shapiro for vp choice accused of antisemitism – The Forward", "date": "2024-08-03 00:00", "url": "https://forward.com/fast-forward/640509/campaign-josh-shapiro-antisemitism-harris-palestinian/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Josh Shapiro, who is Jewish, is facing a campaign to keep him off the ticket because of his stance on Israel.\n“It’s not just that he, like many Democrats, is an outspoken supporter of Israel,” Klion wrote.\nSome note their backing for other Jewish candidates, including Sen. Bernie Sanders of Vermont, who has been sharply critical of Israel.\nHe is a cosponsor of legislation aimed at combating antisemitism that pro-Palestinian critics say stigmatizes their activism.\nHe launched an antisemitism task force last December, and much of its focus has been on the antisemitism Jewish students say they face on campus."}, {"id": "2d861872-b4da-4d85-a467-3ff42e0714aa", "title": "Reviving the Moroccan Jewish Diaspora rich history in Latin America", "date": "2024-08-03 00:45", "url": "https://www.jpost.com/diaspora/article-812863", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "This June, the city played host to a remarkable event: the inaugural Sephardic Moroccan Jewish Latin American Forum hosted by the Mimouna Association, organized under the DAKIRA initiative, a USAID-funded project.\nThis mosaic of voices provided a comprehensive understanding of the multifaceted nature of Latin American Jewish communities.\nTHE RICH history and culture of Moroccan Jews is famous throughout the Jewish world.\nPreserving Sephardi Latin American heritageMARRACHE TOOK part in a panel discussion titled “Preservation of Jewish Latin American Heritage: Sephardic Connection,” along with Jason Guberman, executive director of the American Sephardi Federation, and Laziza Dalil, director of communications of the Mimouna Association.\nThe Sephardic Moroccan Jewish Latin American Forum concluded with a renewed commitment to maintaining and nurturing the connections between Latin American Jewish communities and their Moroccan roots."}, {"id": "495e6b1e-ea04-41f1-85d7-ca81c026d9cf", "title": "The Israeli isolation since October 7 - The Jerusalem Post", "date": "2024-08-03 05:00", "url": "https://www.jpost.com/opinion/article-812891", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "French Jewish writer, public philosopher, and documentary filmmaker Bernard-Henri Lévy’s latest book Solitude Disraeli (currently available in French) affirms the solitariness of an Israel virtually alone on the world stage.\nAn only child, who grew up within a committed Zionist family, Sank attended Jewish schools and was active in a Zionist youth movement.\nBHL’s book, available shortly in English as Israel Alone, suggests that the Jewish state faces unprecedented isolation.\nIn the meantime, we take warm comfort in the fact that there are 7,000 lone soldiers currently serving in the IDF.\nAs long as Israel has the likes of Sam Sank – who remains available to be recalled for active duty – we are never alone."}, {"id": "4ca7a46e-e383-49bb-a486-3ed8a03a3c1d", "title": "Jewish competitors take wins and losses at Paris 2024 Olympics", "date": "2024-08-03 09:30", "url": "https://www.jpost.com/diaspora/article-813089", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "We are officially one week into the 2024 Paris Olympics, and there’s plenty of news to recap — from several Jewish medalists to security threats against Israel’s delegation.\nParis 2024 Olympics - Opening Ceremony - Paris, France - July 26, 2024.\nTwo viral posts circulated this week depicting Israeli Olympians sharing “Bring them home”-themed messages.\n2024 Olympics ScorecardHere’s your weekly rundown of Jewish and Israeli Olympians’ results and schedule.\nYour turnIt’s been quite the week for Jewish and Israeli Olympians — from Jessica Fox’s two gold medals to Israel’s first three wins in Paris."}, {"id": "bb42f9d1-851a-411c-902e-3fe56656739e", "title": "Jewish Democrats rally in a support of pro - Israel Kamala Harris", "date": "2024-08-03 00:45", "url": "https://www.jpost.com/us-elections/article-813078", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "PRIME MINISTER Benjamin Netanyahu meets with US Vice President, and presumptive Democratic presidential nominee, Kamala Harris, in Washington, last week.\nMost of all, the speakers tried to emphasize that Harris and her Jewish husband, Doug Emhoff, have a personal connection to the Jewish community.\nKamala is on our side“Jewish Americans stand with Kamala Harris because she stands with us,” a narrator says in the ad.\n“On Israel, she’s clear.”It cuts to a recent press conference in which Harris expresses her “unwavering commitment” to Israel.\nTrump recently claimed Harris “doesn’t like Israel” and that “she doesn’t like Jewish people” — even though her husband is Jewish and helmed a White House strategy to combat antisemitism."}, {"id": "b7fee708-bb3a-4b1a-8608-3d810d0471d4", "title": "Jewish Dems showcase new energy with Zoom call for Harris and six - figure ad buy", "date": "2024-08-03 00:00", "url": "https://www.jta.org/2024/08/02/politics/jewish-dems-showcase-new-energy-with-zoom-call-for-harris-and-six-figure-ad-buy", "domain": "jta.org", "domain_classification": "Unknown", "message": "Most of all, speakers tried to emphasize that Harris and her Jewish husband, Doug Emhoff, have a personal connection to the Jewish community.\nThe ad begins with a photo of Harris lighting Hanukkah candles with her Jewish husband, Doug Emhoff, and comes a week after the Republican Jewish Coalition launched its own ad.\nSoifer told the Jewish Telegraphic Agency that the Jewish Democrats ad will feature on digital platforms as well as on platforms that reach TVs hooked up to streaming providers.\n“Jewish Americans stand with Kamala Harris because she stands with us,” a narrator says in the ad.\n“On Israel she’s clear.”It cuts to a recent press conference in which Harris expresses her “unwavering commitment” to Israel."}, {"id": "b6cceb2b-9500-4159-905e-d2c506802eea", "title": "Josh Shapiro Offers Harris a Platform to Show Independence", "date": "2024-08-03 14:45", "url": "https://www.yahoo.com/news/josh-shapiro-offers-harris-platform-130000148.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Josh Shapiro speak to the press while making a stop at the Reading Terminal Market in Philadelphia, Pennsylvania, July 13, 2024.\nAnd radicals are ready to make it hurt if Harris picks Shapiro.\nJosh Shapiro, who’s on top of Harris’ short list of vice presidential picks.\n… Harris’ campaign is pressing Wall Street donors to cut their checks as soon as possible, citing a financial rule that bars contributions to tickets featuring a sitting governor.\n… The campaign Harris has now inherited has 24 field offices and more than 170 coordinated staff, with 2,500 volunteers participating in more than 174 events across the state last weekend."}, {"id": "45829840-406b-4398-be6f-5d943d57d43c", "title": "The extraordinary power of Billie Holiday  Strange Fruit , evoking the horror of racial lynching", "date": "2024-08-03 19:00", "url": "https://scroll.in/article/1070841/the-extraordinary-power-of-billie-holidays-strange-fruit-evoking-the-horror-of-racial-lynching", "domain": "scroll.in", "domain_classification": "Unknown", "message": "Time magazine named her 1939 recording of Strange Fruit the song of the 20th century.\nI find Strange Fruit a resonant example.\nThe song gazes unflinchingly on the “strange fruit” of the title: hanged, burned and mangled flesh left to rot on a tree.\nHoliday’s Strange Fruit evokes the filled cross in its testament to lynching as ongoing reality.\n“She fed everybody in New York for four years.”Holiday closed sets with Strange Fruit from 1939 until the final months of her life."}, {"id": "0961cd3f-098d-4b1b-95ea-77974984e8c9", "title": "Kamala Harris , Dangerous Political Rebel Through and Through", "date": "2024-08-03 04:15", "url": "https://newsblaze.com/usnews/politics/kamala-harris-dangerous-political-rebel-through-and-through_198356/", "domain": "newsblaze.com", "domain_classification": "Unknown", "message": "Kamala Harris came to her prominence by conforming, not leading.\nAmerica must recognize and reckon with Kamala Harris for who she is.\nI sincerely hope that sensibility and the love of country will guide the American public to vote Kamala Harris out of the political arena.\nI do not think Kamala Harris has the minimum grasp of this conflict.\nWith Kamala Harris contending for the White House spot, if she is elected president of the United States that event [fear] may be for real."}, {"id": "4345fb4e-a74b-4ca5-ac2b-7e98ce2aeb81", "title": "Latest Articles", "date": "2024-08-03 03:00", "url": "https://freerepublic.com/tag/*/index?more=4255910", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "ActBlue is hit with a DEMAND letter from @JasonMiyaresVA regarding accusations of campaign money laundering that is interfering in the U.S. election.\n\"My office has become aware of multiple serious allegations that ActBlue... [has] engaged in fraudulent, deceptive, and/or otherwise illegal activities in the Commonwealth of Cirginia and/or have aided and abetted others in doing so.\"\n\"This includes hundreds of thousands of dollars of contributions through individual donors in the Commonwealth in volumes that are facially implausible and appear suspicious.\"\n\"Taken together, these circumstances appear to indicate that contributions via ActBlue are being made from fictional donors or dummy accounts,..."}]