[{"id": "f872fe6f-871c-4d84-ae5e-4bf0f13afac0", "title": "Biden condemns antisemitism as campus protests continue", "date": "2024-05-08 02:00", "url": "https://www.theglobeandmail.com/world/us-politics/article-joe-biden-antisemitism-speech/", "message": "Open this photo in gallery: U.S. President Joe Biden holds a photograph of Holocaust victims on the day he addresses rising levels of antisemitism at the U.S.\n“I am calling on all Americans to stand united against antisemitism and hate in all its forms,” said Mr. Biden, whose three children all married into Jewish families.\nA year ago, Mr. Biden created a National Strategy to Counter Antisemitism.\nMr. Biden said there is “no place on any campus” for antisemitic rhetoric or acts.\nThere is political advantage for Mr. Biden in saying these things."}, {"id": "bb5448d6-322d-4de9-bac8-859937a61aca", "title": "Biden calls out  ferocious surge  of antisemitism", "date": "2024-05-08 01:45", "url": "https://www.voanews.com/a/biden-calls-out-ferocious-surge-of-antisemitism-/7602010.html", "message": "\"This hatred continues to lie deep in the hearts of too many people in the world,\" Biden said as he delivered the keynote address at the U.S.\n\"We've seen a ferocious surge of antisemitism in America and around the world,\" since the October attack, said Biden.\n\"We're grateful for President Biden's clear moral leadership confronting this threat, including through the historic U.S. National Strategy to Counter Antisemitism.\nAnd antisemitism is hate speech.\nIt is just hate speech."}, {"id": "d793f61b-6c8b-4e4b-9e3b-479ac185ef18", "title": "Biden decries surge of antisemitism since the October 7 Hamas attacks on Israel", "date": "2024-05-08 03:00", "url": "https://www.kalw.org/npr-news/2024-05-07/biden-decries-surge-of-antisemitism-since-the-october-7-hamas-attacks-on-israel", "message": "Biden drew a line from the atrocities in the Holocaust to the Oct. 7 Hamas attacks in Israel, and said what has followed that day has been despicable.\n\"We've seen a ferocious surge of antisemitism in America and around the world,\" Biden said.\nBiden last week delivered brief remarks denouncing \"chaos\" on college campuses, saying that things had gone too far.\n\"But there is no place on any campus in America — any place in America — for antisemitism or hate speech, or threats of violence or any kind,\" he said.\nSaul Loeb / AFP via Getty Images / AFP via Getty Images President Biden and House Speaker Mike Johnson hold images of Holocaust victims during the annual Days of Remembrance ceremony at the U.S. Capitol."}, {"id": "ca0fb1c6-297a-4a78-bee1-78ab029a8ac9", "title": "Biden condemns antisemitism sparked by college protests and Gaza war", "date": "2024-05-08 05:15", "url": "https://www.ksl.com/article/51003913/biden-condemns-antisemitism-sparked-by-college-protests-and-gaza-war", "message": "Biden has struggled to balance his support for Israel since the attack by Hamas — the deadliest day for Jews worldwide since the Holocaust — with his efforts to protect civilian life in Gaza.\nWhile acknowledging the ceremony was taking place during \"difficult times,\" Biden made no explicit reference to the deaths of Palestinians in the war in Gaza.\nBiden said, \"There's no place on any campus in America\" or any place in America for antisemitism or threats of violence.\nIn conjunction with Biden's speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nBiden campaign spokesman James Singer said in response that \"President Biden stands against antisemitism and is committed to the safety of the Jewish community, and security of Israel — Donald Trump does not.\""}]