[{"id": "ad5d8709-ff59-4e63-bf6b-9f615f15ebec", "title": "Antisemitism can easily become a slippery slope and lead to violence", "date": "2024-06-06 00:00", "url": "https://www.jpost.com/opinion/article-805109", "message": "It’s crucial to use the term “racism” because we understand all too well how rhetoric leads to violence in that context.\nThis is how violence and murder begin – with inflammatory rhetoric that escalates into physical harm.\nThis indiscriminate targeting underscores the horrific nature of the calls for violence emanating from university campuses and other pro-Hamas protests.\nThe path from hateful rhetoric to violence is short and well-trodden.\nPrior to Aish, he was eastern director of the Simon Wiesenthal Center where he oversaw the Museum of Tolerance in New York City and contributed to the center’s fight against antisemitism."}, {"id": "51e42709-946c-4dcc-b042-1567a4823f6a", "title": "Campus Reform the # 1 Source for College News", "date": "2024-06-06 19:30", "url": "https://www.campusreform.org/article/unbearable-jewish-students-sue-pennsylvania-college-cultivating-anti-semitic-atmosphere-campus/25591", "message": "Jewish students at Haverford College in Pennsylvania, supported by alumni and others, have sued the institution over accusations of anti-Semitism.\nThe Deborah Project, which is representing the plaintiffs, accused the school of “maintaining — and even supporting — a hostile environment for Jews.”The complaint, filed on May 13 in the U.S. District Court for the Eastern District of Pennsylvania, alleges that “Haverford has become an illiberal institution fixated on appeasing the demands of anti-Israel students and faculty.”[RELATED: Columbia Law National Lawyers Guild says Jewish students blocking divestment are threatening ‘everyone’s safety’]“As a result of Haverford’s capture by a fervently antisemitic anti-Israel faction, students and even tenured faculty who engage in public expression of pro-Israel viewpoints are penalized through formal investigations and other disciplinary measures, as well as through informal but pervasive stigmatization, harassment, and bullying campaigns,” the Deborah Project wrote.\nAccording to the lawsuit, the anti-Semitic atmosphere present on campus led to Jewish students being afraid to “speak Hebrew in public,” and made them “agonize over how to suppress identifiably Jewish proclivities, gestures, or expressions, lest they be exposed as insufficiently Israel-hating Jews.”“Nearly all of these Jewish students engage in agitated consideration every day about whether, wherever they are going on Haverford’s campus to class, to the library, to a meal or to meet a friend— they are going to be met with attacks on them and the basic tenets of their religion,” the lawsuit continued.\nAnd while so many of Haverford’s Jews stood up on their hind legs and repeatedly attempted to get the leadership to do the right thing and fulfill their legal obligations, all were met with deaf ears.”Campus Reform has reached out to Haverford College for comment.\nThis article will be updated accordingly."}, {"id": "35aacfab-e6c5-4ec9-ac46-57f8da44a093", "title": "UPenn bans encampments following pro - Palestinian protests", "date": "2024-06-06 16:15", "url": "https://www.inquirer.com/education/upenn-encampment-ban-israel-gaza-protest-20240606.html", "message": "The University of Pennsylvania on Thursday issued new temporary guidelines on campus demonstrations that for the first time specifically refer to encampments and prohibit them.\nAt Penn, an encampment was up for more than two weeks and eventually removed by Penn and city police.\nBut she voiced concern for how the temporary guidelines might impact any protests on campus “that Penn might dislike.”Encampments aren’t a new protest tactic at Penn.\nJewish Penn students reported 132 incidents of harassment during the duration of the encampment, according to the results of a survey circulated by the Penn President’s Jewish Student Advisory Council and obtained by The Inquirer.\nA handful of those complaints were about confrontations with encampment members, with two Jewish students reporting being called homophobic slurs and a “dirty liar.”"}, {"id": "8781e2ca-0667-4d53-a9a4-42eb4dfd27e2", "title": "Washington Hebrew Congregation , Temple Sinai Hold Panel on American Jew Future", "date": "2024-06-06 15:45", "url": "http://www.washingtonjewishweek.com/washington-hebrew-congregation-temple-sinai-hold-panel-on-american-jews-future/", "message": "Antisemitism, Israel, Zionism and the future of American Jews were the hot topics on May 29 at Washington Hebrew Congregation as a panel of local Jewish figures, including Franklin Foer of The Atlantic, discussed those pressing issues.\nWHC’s antisemitism committee partnered with Temple Sinai’s to use this program to bring the larger community together and view the issues throughdifferent lenses.\nThe panel also dove into the perceptions of identity and power in American society and how that framework is being applied to American Jews and Israel during the conflict.\nThe panel keyed on the generational divide that some Jewish communities are seeing over Israel and disconnection by younger Jews.\nComing into synagogues, members of the IDF, they just take everything for granted that American Jews are reflexively down with the cause,” Gregory said."}, {"id": "794a3c13-d6de-4f19-9862-4e721f5c02d5", "title": "Vandals kick in glass door at USC Chabad House – Daily News", "date": "2024-06-06 01:15", "url": "https://www.dailynews.com/2024/06/05/vandals-kick-in-glass-door-at-uscs-chabad-house/", "message": "An investigation was continuing Wednesday into the vandalism of a glass door at the Chabad House at USC, but police said they do not believe the damage rises to the level of a hate crime.\nAccording to the Los Angeles Police Department, officers from the USC Department of Public Safety responded to the house on the 2700 block of Severance Street around 9:15 p.m. Tuesday.\nLast night the Chabad at @USC was vandalized and individuals shattered glass at the Chabad House, @jewsc.\n“Today, the Chabad House at USC was vandalized.\n“The event only further highlights the rising antisemitism on US college campuses.”No further information about the suspects was immediately released."}, {"id": "631294e0-f230-4db6-905a-506e0f1ca7c2", "title": "AJC Library Program Showcases American Jewish Culture Across the DMV", "date": "2024-06-06 15:45", "url": "http://www.washingtonjewishweek.com/ajc-library-program-showcases-american-jewish-culture-across-the-dmv/", "message": "The Washington, D.C., office of the American Jewish Committee undertook a month-long effort during Jewish American Heritage Month to spread knowledge about Judaism and Jewish people.\nAnd that’s not what Jewish American Heritage Month is about.\nIt’s about Jewish American heritage,” Stolov said.\nAJC Regional Director Alan Ronkin said that informing people is key to making sure that Jewish culture is properly recognized and understood — and that celebrating Jewish culture can foster an important and lasting sense of Jewish pride in the community.\nI think people sometimes think of Jewish culture is just the bagels and latkes."}, {"id": "6a94776c-515d-46cc-9c1e-3f307dcad287", "title": "USC Chabad House Vandalized ; Police : Not a Hate Crime", "date": "2024-06-06 01:30", "url": "https://mynewsla.com/crime/2024/06/05/vandals-damage-front-door-at-uscs-chabad-house-2/", "message": "An investigation was continuing Wednesday into the vandalism of a glass door at the Chabad House at USC, but police said they do not believe the damage rises to the level of a hate crime.\n“LAPD Southwest Detectives responded to the location and gook a vandalism report.\nBased on preliminary information, this incident did not rise to the level of a hate crime.”Chabad House officials posted surveillance video of the crime on X.\n“Today, the Chabad House at USC was vandalized.\nAccording to police, the USC DPS and LAPD Southwest Area University Park Special Problems Unit is increasing patrols in the area while the investigation continues."}, {"id": "55d70518-ba46-47de-b6ac-88ae3ff626a7", "title": "Washington U . chief vowed to be  in  and  for  St . Louis . Did arrests diminish the message ? ", "date": "2024-06-06 15:00", "url": "https://www.stltoday.com/news/local/education/washington-u-chief-vowed-to-be-in-and-for-st-louis-did-arrests-diminish-the/article_9f6b06a2-1de8-11ef-894e-37d862a6ae76.html", "message": "Andrew Bursky, chair of Washington U.’s board of trustees, said in an interview the “in St. Louis, for St. Louis” initiative is more than a side project.\nThe release also announced a website for the “In St. Louis, For St. Louis” initiative, which highlights three main commitments, including to contribute to a more vibrant and equitable region.\n“We’re proud to be Washington University in St. Louis,” Martin said at the time.\n“Washington University cannot thrive if St. Louis isn’t thriving,” Bursky said.\n‘Everything costs something’After April 27, protesters increasingly used the university’s “In St. Louis, for St. Louis” commitment as ammunition against the school."}, {"id": "0dbb5a9c-225d-42ed-beff-6f4a449cdce7", "title": "Natan Sharansky talks unity , October 7 , anti - Zionism , Netanyahu - Israel News", "date": "2024-06-06 11:45", "url": "https://www.jpost.com/israel-news/article-805190", "message": "Not many people alive today have done as much for human freedom and the Jewish people as has Natan Sharansky.\nFollowing massive public campaigns by the State of Israel, world Jewry and leaders of the free world, Sharansky was released in 1986, and emigrated to Israel, on the very day of his release.\nSharansky also received the Congressional Medal of Honor in 1986 and the Presidential Medal of Freedom in 2006.\nClearly, there is almost nothing in the Jewish world and in Israel that Sharansky has not been involved with, in one way or another, in the course of his life.\nWe are part of the free world, yet still insist on maintaining our identity as a Jewish state.\""}]