[{"id": "5e199732-7b04-454a-a9f3-d75715a277eb", "title": "Russians attack 13 communities of Sumy Oblast , injuring 4 people", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/russians-attack-13-communities-sumy-005050079.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aftermath of the attacks on Sumy Oblast.\nPhoto: Sumy Oblast Prosecutor's OfficeRussian forces have conducted 87 attacks on 13 hromadas in Sumy Oblast over the past day, injuring four civilians.\nSource: Sumy Oblast Military AdministrationQuote: \"[A total of] 265 explosions were recorded.\nThe Russians attacked Bilopillia hromada with a guided bomb airstrike, FPV drones and mortar fire (11 explosions).\nThe Russians hit Shalyhyne hromada with a guided bomb airstrike, mortars and FPV drones (8 explosions)."}, {"id": "8efc292f-f383-456b-a3e2-86985a0643ac", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 02:00", "url": "https://www.journal-news.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "journal-news.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "a661c940-6563-4448-8814-47c9b6d6f305", "title": "Fires break out on abandoned Greek - flagged oil tanker", "date": "2024-08-24 08:30", "url": "https://www.sunstar.com.ph/network/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "d726524b-0d50-453c-925d-c15f22786080", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 09:45", "url": "https://www.news-gazette.com/news/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in/article_5120ce7d-9412-5e0e-9287-1bafe761e23a.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "cedda561-a3bc-4a41-88df-492394ac53f0", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 11:00", "url": "https://isp.netscape.com/pf/story/0001/20240824/9eb36bb2450b986bb677d67a32ec5ef0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Fires break out on abandoned Greek-flagged oil tanker Sounion that Yemen rebels attacked in Red SeaDUBAI, United Arab Emirates (AP) — Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "14738d86-d49f-4af7-9e44-607653f46dbf", "title": "Watch : Greek - flagged oil tanker goes up in flames after attack by Houthi rebels in Red Sea", "date": "2024-08-24 10:30", "url": "https://timesofindia.indiatimes.com/world/middle-east/watch-greek-flagged-oil-tanker-goes-up-in-flames-after-attack-by-houthi-rebels-in-red-sea/articleshow/112758993.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Fires broke out Friday on the Greek-flagged oil tanker Sounion, which had been attacked earlier this week by Yemen's Houthi rebels.\nThe European Union's Aspides naval mission in the Red Sea, which helped evacuate the tanker's crew, warned that caution is essential to prevent further deterioration of the situation.The Houthis have not yet acknowledged responsibility for the fire but released footage late Friday night showing an explosion striking the Sounion.\nAnalysis suggests the explosions were likely caused by planted explosives rather than a missile or drone strike.This attack is part of the Houthis' ongoing campaign against shipping in the Red Sea, linked to the broader conflict between Israel and Hamas.\nSince October, the rebels have targeted over 80 vessels, seizing one and sinking two, including the Tutor, which sank after explosives were planted aboard.The US military has responded by deploying additional forces to the region, including aircraft carriers, fighter jets, and a missile submarine.\nEarly Saturday, US Central Command announced the destruction of a Houthi missile system in Yemen within the past 24 hours."}, {"id": "7e3c958c-4031-4873-af19-7e1bbe636d77", "title": "Hezbollah strikes Meron Air Base , destroys Israeli spying devices", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240823-presstv04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah strikes Meron Air Base, destroys Israeli spying devicesIran Press TVFriday, 23 August 2024 10:35 AMLebanon's Hezbollah says it carried out a strike on the Meron military base, targeting Israel's spying devices.\nIn a brief statement, the resistance group said it destroyed espionage equipment inside the headquarters of the air surveillance unit and the air operations command at the base on Friday morning.\nAdditionally, the Lebanese resistance fighters shelled the Israeli al-Malikiyah military site and precisely struck the designated targets.\nThe Lebanese resistance movement has vowed to keep up its retaliatory attacks as long as the Israeli regime continues its war on Gaza.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts."}, {"id": "94c7f8f6-c360-4309-b565-0b6a7c91e4e6", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 01:45", "url": "https://www.springfieldnewssun.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "springfieldnewssun.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "15a58e85-7deb-4570-bec0-d3f174a0dc54", "title": "Fires break out on abandoned Greek - flagged oil tanker S ... ", "date": "2024-08-24 03:45", "url": "https://accesswdun.com/article/2024/8/1258853", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "17d89f39-4cdf-4c78-a173-29ef02ade5bb", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 09:45", "url": "https://santamariatimes.com/ap/business/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in/article_cd7c8d62-09c3-5e35-b7a5-11c8561761f1.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "c2c533cb-635a-4917-8346-404119e80b2b", "title": "Israeli shelling claims lives of 9 Palestinians in Gaza", "date": "2024-08-24 03:00", "url": "https://tribune.com.pk/story/2490587/israeli-shelling-claims-lives-of-9-palestinians-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises following an Israeli strike on a residential building, amid the ongoing conflict between Israel and Hamas, in Khan Younis, in the southern Gaza Strip, on August 16, 2024.\nFile Photo ReutersAt least nine Palestinians, including two children and a woman, were killed early on Saturday by Israeli shelling in Gaza's Khan Younis and the Al-Nuseirat camp area, according to the Palestinian news agency Wafa.\nThe shelling targeted two houses in southern Khan Younis, leading to the reported casualties.\nIn related news, Israeli airstrikes across southern Lebanon on Friday killed at least eight Hezbollah fighters and a child, as Hezbollah responded with artillery and rockets.\nA separate strike in Aita, a village approximately 14 km north of Israel's border, claimed the lives of a Hezbollah fighter and a child."}, {"id": "25ae30fb-78dc-4296-ab8b-86f7f8152420", "title": "12 Palestinians killed in Israeli shelling in Gaza", "date": "2024-08-24 06:30", "url": "https://tribune.com.pk/story/2490592/12-palestinians-killed-in-israeli-shelling-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises following an Israeli strike on a residential building, amid the ongoing conflict between Israel and Hamas, in Khan Younis, in the southern Gaza Strip, August 16, 2024.\nPHOTO: REUTERSAt least 12 Palestinians, including two children and a woman, were killed early on Saturday morning by Israeli attacks east of Gaza's Khan Younis and in the Al-Nuseirat camp area, the official Palestinian news agency Wafa said.\nPreviously, at least nine Palestinians, including two children and a woman, were killed early on by Israeli shelling in Gaza's Khan Younis and the Al-Nuseirat camp area, according to the Palestinian news agency Wafa.\nThe shelling targeted two houses in southern Khan Younis, leading to the reported casualties.\nIn related news, Israeli airstrikes across southern Lebanon on Friday killed at least eight Hezbollah fighters and a child, as Hezbollah responded with artillery and rockets."}, {"id": "8e7f6184-4b3a-4c08-b744-54bbe790e57f", "title": "On This Day In 1986 : Operation El Dorado Canyon , The F - 111 Shining Moment . ", "date": "2024-08-24 00:15", "url": "https://theaviationist.com/2020/04/15/on-this-day-in-1986-operation-el-dorado-canyon-the-f-111s-shining-moment/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "These were the beginnings of the Tuesday, April 15, 1986 Operation El Dorado Canyon, the U.S. retaliatory strikes on Libya.\nThe rehearsal confirmed the mission template for the actual Operation El Dorado Canyon as viable.\nOperation El Dorado Canyon was the shining moment of the F-111’s legacy.\nFinally, the F-111 ended its career in U.S. service in December 1998 as the EF-111 Raven electronic countermeasures variant used in Operation El Dorado Canyon.\nQaddafi’s despotic, and dramatic, reign was finally over, 25 years after the Operation El Dorado Canyon raids that happened on this day in 1986."}, {"id": "e60756fe-ab8d-4fb9-9f59-ce364a29003f", "title": "Israeli strikes kill eight , including child , in southern Lebanon", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240823-presstv01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli strikes kill eight, including child, in southern LebanonIran Press TVFriday, 23 August 2024 6:46 PMIsraeli airstrikes have claimed the lives of at least eight people, including a child, in southern Lebanon.\nLebanon's Health Ministry announced the fatalities on Friday, saying the victims were killed in Israeli drone attacks that targeted various locations across the south.\nIsraeli strikes also claimed the lives of six other people in different locations in the south.\nThe regime has been conducting near-daily attacks against southern Lebanon since October 7, when it launched a genocidal war on the Gaza Strip.\nThe attacks have reportedly claimed the lives of around 600 people in Lebanon."}, {"id": "87684ff7-11f6-46e3-bdf3-f440f9df0435", "title": "The war in Gaza is making thousands of orphans", "date": "2024-08-24 11:15", "url": "https://www.bostonglobe.com/2024/08/22/world/israel-hamas-war-orphans/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "They are convinced it will happen as soon as they can go back to Gaza City, where they were growing up before the war bulldozed that life.\nIt is making so many orphans in such chaos that no agency or aid group can count them.\nTens of thousands of people have been killed: many of them children, many parents.\nAs in other Muslim societies, religious strictures make legal adoption impossible in Gaza, though people can take in and financially sponsor orphans.\nEven for children who still have parents, postwar Gaza will be a difficult place to grow up, said Mahmoud Kalakh, a charity worker who founded the orphans’ camp."}, {"id": "de49caa5-f73e-40de-983a-4c91b00d1249", "title": "Russians destroy family house museum and estate of Ukrainian anarchist revolutionary Nestor Makhno in Huliaipole – photos", "date": "2024-08-24 12:30", "url": "https://www.yahoo.com/news/russians-destroy-family-house-museum-090016552.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russians destroy family house museum and estate of Ukrainian anarchist revolutionary Nestor Makhno in Huliaipole – photosRussian troops have destroyed the memorial house-museum and estate of the family of Nestor Makhno, a Ukrainian anarchist revolutionary and the commander of the Revolutionary Insurgent Army of Ukraine during the Ukrainian War of Independence, in Huliaipole, Zaporizhzhia Oblast.\nThe building caught fire and burned to the ground as a result of a missile strike.\nThe Russians targeted Bilenke in Zaporizhzhia district, and Huliaipole, Orikhiv, Novoandriivka, Mala Tokmachka, Levadne, Robotyne, Malynivka, and Preobrazhenka in Polohy district.\nAn infrastructure facility and several houses were damaged in the village of Bilenke as a result of a drone attack.\nA historical monument, the local history museum, was destroyed in Huliaipole during a night attack."}, {"id": "c163d2ee-e305-4408-89f8-8358db4f3ddc", "title": "US Secret Service puts agents on leave after Trump assassination attempt , media reports say", "date": "2024-08-24 05:00", "url": "https://www.ksl.com:443/article/51108257/us-secret-service-puts-agents-on-leave-after-trump-assassination-attempt-media-reports-say", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 1-2 minutesWASHINGTON — Multiple Secret Service agents have been placed on leave following an assassination attempt on former President Donald Trump last month, media outlets reported on Friday.\nFox and CBS reported that at least five Secret Service members involved in the incident, including the head of the Secret Service's Pittsburgh office, had been put on leave.\nThe Secret Service has said it was \"ashamed\" of the security lapse, and its chief stepped down in the aftermath of the assassination attempt.\nFollowing the attack, the Secret Service recommended that Trump avoid large outdoor events.\nTrump spoke from behind a shield of bulletproof glass in North Carolina on Wednesday, his first outdoor rally since the attack."}, {"id": "52c33408-92cb-4e0a-b140-6c0ad5ad6cae", "title": "First satellite rocket launch from Shetland is put off  for months  ", "date": "2024-08-24 12:15", "url": "https://www.dailymail.co.uk/news/article-13775689/satellite-rocket-launch-Shetland-months-engine-blew-up.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The first vertical satellite launch from European soil has been set back months following an engine explosion which engulfed the aircraft.\nThe aircraft's test launch at a SaxaVord Spaceport on the most northerly inhabited island in the UK went up in flames last Monday.\nGerman spacecraft company Rocket Factory Augsburg (RFA), which built the engine, revealed that no one was injured during the incident.\nA spokesman for SaxaVord said: ‘This was a test, and test campaigns are designed to identify issues prior to the next stage.\nThe failed test comes just three months after an initial test was deemed a success when RFA fired its rocket engines for eight seconds."}, {"id": "f8ca2e24-d72f-4c38-8584-17eb80b3cf2f", "title": "3 Killed , Several Injured In Stabbing Attack At Festival In Germany Solingen", "date": "2024-08-24 04:30", "url": "https://www.india.com/news/world/3-killed-several-injured-in-stabbing-attack-at-festival-in-germanys-solingen-7189676/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNews3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s Solingen3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenAt least three people were killed during a stabbing attack during a festival in the western German city of Solingen on Friday.\n3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenSolingen: in a tragic incident, three people were killed and several others sustained injuries in a stabbing attack during a festival in the western German city of Solingen, CNN reported.\nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram.\nRead more on Latest World News on India.com."}, {"id": "ff90a7db-47c2-41aa-9804-dad68f6dbd37", "title": "A Proportional Response ? American Strategy and the Red Sea", "date": "2024-08-24 09:00", "url": "https://nationalinterest.org/feature/proportional-response-american-strategy-and-red-sea-212426", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "“What is the virtue of a proportional response?” asks President Jed Bartlett of his National Security Council (NSC) in one episode of The West Wing.\nThat’s a proportional response.” Angrily, the president cuts off the aides trying to explain and interjects: “They do that, so we do this—it’s the cost of doing business.\nIt’s proportional, it’s reasonable, it’s responsible—it’s not nothing!”Today, the United States faces the challenge of mounting a proportional response to Houthi aggression in the Red Sea and the Gulf of Aden.\nIf safeguarding freedom of transit through the Red Sea is a vital U.S. interest, Biden’s strategy has proven insufficient to meet the challenge.\nSorkin’s overarching thesis in A Proportional Response is that restraint is the morally superior course of action for a superpower like America."}, {"id": "a7eac430-cc60-4c2c-8b4e-79edb06c0456", "title": "Exclusive - Top U . S . general makes unannounced Middle East trip as Iran threat looms", "date": "2024-08-24 12:45", "url": "https://www.yahoo.com/news/exclusive-top-u-general-makes-121110851.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "U.S. President Joe Biden's administration has been seeking to limit the fallout from the war in Gaza between Hamas and Israel, now in its 11th month.\nHezbollah has also threatened a response after Israel killed a senior Hezbollah commander in Beirut last month.\nIsrael, the United States and other allies managed to destroy almost all of the weapons before they reached their targets.\nBrown did not speculate about what Iran and its allies might do but said he hoped to discuss different scenarios with his Israeli counterpart.\n\"Particularly, as I engage with my Israeli counterpart, how they might respond, depending on the response that comes from Hezbollah or from Iran,\" Brown said."}, {"id": "e35964d9-bc1d-4f0d-8909-f52293f96086", "title": "Exclusive - Top U . S . general makes unannounced Middle East trip as Iran threat looms", "date": "2024-08-24 14:00", "url": "https://www.aol.com/exclusive-top-u-general-makes-121110689.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "U.S. President Joe Biden's administration has been seeking to limit the fallout from the war in Gaza between Hamas and Israel, now in its 11th month.\nHezbollah has also threatened a response after Israel killed a senior Hezbollah commander in Beirut last month.\nIsrael, the United States and other allies managed to destroy almost all of the weapons before they reached their targets.\nBrown did not speculate about what Iran and its allies might do but said he hoped to discuss different scenarios with his Israeli counterpart.\n\"Particularly, as I engage with my Israeli counterpart, how they might respond, depending on the response that comes from Hezbollah or from Iran,\" Brown said."}, {"id": "865988e8-d154-4aca-b90b-722fc26d0a05", "title": "Exclusive - Top U . S . general makes unannounced Middle East trip as Iran threat looms", "date": "2024-08-24 14:00", "url": "https://www.marketscreener.com/news/latest/Exclusive-Top-U-S-general-makes-unannounced-Middle-East-trip-as-Iran-threat-looms-47727259/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "AMMAN (Reuters) - The top U.S. general began an unannounced visit to the Middle East on Saturday to discuss ways to avoid any new escalation in tensions that could spiral into a broader conflict, as the region braces for a threatened Iranian attack against Israel.\nU.S. President Joe Biden's administration has been seeking to limit the fallout from the war in Gaza between Hamas and Israel, now in its 11th month.\nHezbollah has also threatened a response after Israel killed a senior Hezbollah commander in Beirut last month.\nIsrael, the United States and other allies managed to destroy almost all of the weapons before they reached their targets.\n\"Particularly, as I engage with my Israeli counterpart, how they might respond, depending on the response that comes from Hezbollah or from Iran,\" Brown said."}, {"id": "f25b62d1-e506-4cfc-b062-f52fc60572f4", "title": "Brit hostage found dead in Hamas  terror tunnel  died of execution - style gunshot", "date": "2024-08-24 08:30", "url": "https://www.mirror.co.uk/news/world-news/brit-hostage-found-dead-hamas-33530182", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The body of British hostage Nadav Popplewell, 51, was found along with five others in a tunnel 30 feet below the surface in the Gaza city of Khan Younis by Israeli soldiersA Brit hostage was found dead with execution-style gunshot wounds in a Hamas terror tunnel.\nSoldiers from the IDS entered the tunnel last Tuesday where they also found weapons belonging to Hamas.\nThe Israel-Hamas war was triggered by Hamas’s October 7 attack on southern Israel that killed 1,200 people and saw another 250 taken hostage.\nThe UK was steadfast in its support for Israel’s right to self defence, and would continue to work with partners to uphold regional security, the Prime Minister added.\nThe Prime Minister also urged Prime Minister Netanyahu to ensure greater access to detainees held by Israel, the increased delivery of aid to Gaza and to ensure international law was upheld at all times."}, {"id": "719b9a50-2c4d-4e5e-9f7f-76eecdd3737a", "title": "5 Secret Service agents assigned to modified duty | The Arkansas Democrat - Gazette", "date": "2024-08-24 10:45", "url": "https://www.arkansasonline.com/news/2024/aug/24/5-secret-service-agents-assigned-to-modified-duty/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe gunman, Thomas Matthew Crooks, 20, of Bethel Park, was killed by a bullet fired by a Secret Service agent.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he \"cannot defend why that roof was not better secured.\"\nKelly and other task force members are scheduled to return to the site of the rally shooting on Monday."}, {"id": "520e8d85-66e0-4db5-9bc7-5ffbb4165621", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 10:30", "url": "https://www.canberratimes.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "41620720-64c7-441e-bded-dadf18a8fba3", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 10:30", "url": "https://www.canberratimes.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "e53a10c7-be78-4624-8ac1-03c26c05ec3d", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 03:45", "url": "https://www.moneycontrol.com/news/world/three-dead-after-stabbing-attack-at-festival-in-western-germany-12805661.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:Three dead after stabbing attack at festival in western Germany"}, {"id": "aca2dda9-a48b-4e60-88fd-219adce038c3", "title": "Maryland police officer convicted of tossing smoke bomb at police during Capitol riot", "date": "2024-08-24 00:15", "url": "https://www.nbcwashington.com/news/local/maryland-police-officer-convicted-of-tossing-smoke-bomb-at-police-during-capitol-riot/3701325/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "A Maryland police officer was convicted on Friday of charges that he joined a mob's Jan. 6, 2021, attack on the U.S. Capitol and hurled a smoke bomb and other objects at police officers guarding a tunnel entrance.\nThe device struck a police officer's riot shield and filled the mouth of the tunnel with a large plume of smoke, prosecutors said.\n“The actions of one individual do not define the entire department,” the department said in a statement last year.\nLee, of Rockville, Maryland, applied to be a Montgomery County police officer in July 2021 — six months after the riot.\nMoving to the Lower West Terrace, Lee tossed the smoke bomb and three other “rock-like objects\" at officers guarding the tunnel, the judge found."}, {"id": "0b22363d-d774-4416-9806-c29dc6852f91", "title": "Israeli strikes on Lebanon kill eight fighters , one child , security sources say", "date": "2024-08-24 10:00", "url": "https://www.timesofearth.com/2024/08/24/israeli-strikes-on-lebanon-kill-eight-fighters-one-child-security-sources-say/", "domain": "timesofearth.com", "domain_classification": "Unknown", "message": "Israeli airstrikes across southern Lebanon on Friday killed at least eight fighters and one child, according to security sources, as armed group Hezbollah responded with artillery rounds and rockets across the border.\nIsraeli strikes killed six Hezbollah fighters in various towns across the south, according to the party’s death notices and a security source.\nThe Israeli military, in a statement posted online, said it had targeted Najem in Aita because he was a member of Hezbollah’s rocket and missile unit.\nIt said it had targeted two other Hezbollah fighters across the south.\nHezbollah’s press office said the group had fired rockets and artillery fire onto various Israeli military positions throughout the day."}, {"id": "1fb9c7c8-071a-45ba-93e1-32e9b19a3868", "title": "Germany mass stabbing : Three dead , several injured in knife attack at festival in Solingen", "date": "2024-08-24 03:15", "url": "https://www.dnaindia.com/world/report-germany-mass-stabbing-three-dead-several-injured-in-knife-attack-at-festival-in-solingen-3103850", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Germany mass stabbing: Three dead, several injured in knife attack at festival in SolingenThree people were killed and three others seriously injured in a stabbing attack during a festival in Solingen, Germany.\nGermany mass stabbing: In a tragic incident on Friday night, three people lost their lives, and three others were seriously injured in a stabbing attack during a festival in the western German city of Solingen.\nThe attack took place around 10 p.m. local time when an unidentified man targeted multiple people at the event.\nThe state's interior minister, Herbert Reul, visited the scene and described the attack as a targeted assault on human life.\nAs the investigation continues, the community of Solingen mourns the loss of lives and hopes for the recovery of those injured."}, {"id": "38166ba8-e6ba-4a6b-8861-62f92e818c58", "title": "Barmy conspiracy theory that Wagner boss Prigozhin is still alive a year on from death", "date": "2024-08-24 14:30", "url": "https://www.dailystar.co.uk/news/world-news/barmy-conspiracy-theory-wagner-boss-33531057", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailA mad theory that doomed ex-Wagner boss Yevgeny Prigozhin is actually still alive is still being peddled a year on from his fireball death.\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletter by clicking here."}, {"id": "72302355-0640-4627-9e38-95221575d130", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nHe was told about what happened but was asked to continue \"to avoid causing a mass panic attack\", he posted on Instagram."}, {"id": "f24278f9-37de-4d18-9736-499a78492bf4", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nHe was told about what happened but was asked to continue \"to avoid causing a mass panic attack\", he posted on Instagram."}, {"id": "b2bfe925-f30b-4c0b-ad62-afe95e5ee72e", "title": "Germany : Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/three-dead-after-stabbing-attack-at-festival-in-western-germany/articleshow/112753072.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGerman police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen Eight were injured, five of them seriously, the police said in a statement early on Saturday.\nThat is up from the four serious injuries the police reported earlier.\n\"Both victims and witnesses are currently being questioned.\nThe police are currently searching for the perpetrator with a large team,\" police said.The incident occurred around 9:40 p.m. (1940 GMT) on Friday, when the man attacked multiple people with a knife, the police said.Fatal stabbings and shootings are relatively uncommon in Germany .\nThe government wants to toughen rules on knives that can be carried in public by reducing the maximum length allowed.In June a 29-year-old policeman died after being stabbed in Mannheim during an attack on a right-wing demonstration."}, {"id": "c13847a3-de0d-43e1-ab94-560d9c8f056b", "title": "Three Persons Dead After Stabbing Attack At Festival In Germany", "date": "2024-08-24 10:30", "url": "https://saharareporters.com/2024/08/24/three-persons-dead-after-stabbing-attack-festival-germany", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, the police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "fe889ad2-7a53-43f2-92f5-1454e8b727f0", "title": "Knifeman kills three , injures three in nighttime assault in western Germany", "date": "2024-08-24 01:15", "url": "https://tribune.com.pk/story/2490583/knifeman-kills-three-injures-three-in-nighttime-assault-in-western-germany", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Photo ReutersThree people were killed and three others seriously injured in a stabbing attack at a festival on Friday night in Solingen, western Germany, according to police.\nThe incident occurred around 10pm (2100 CET) when an unidentified man attacked several people.\nMayor Tim-Oliver Kurzbach expressed his anguish, stating, \"It tears my heart apart that there was an attack on our city.\nA similar stabbing occurred in June, resulting in the death of a 29-year-old policeman in Mannheim during a right-wing demonstration.\nThe German government is currently working to tighten regulations on public knife carrying by reducing the permissible length of blades."}, {"id": "ed1bdb67-6cba-4d2d-b109-b5bc9675223b", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 01:15", "url": "https://www.channelnewsasia.com/world/solingen-germany-stabbing-three-dead-after-attack-festival-4564961", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany: Police hunted on Saturday (Aug 24) for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nEight were injured, five of them seriously, the police said in a statement early on Saturday.\n\"Both victims and witnesses are currently being questioned.\nThe police are currently searching for the perpetrator with a large team,\" police said.\n\"The perpetrator must be quickly caught and punished to the fullest extent of the law,\" German Chancellor Olaf Scholz said in a post on X."}, {"id": "254d3f76-d713-48e0-bbe7-9c00fb610961", "title": "3 dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.asiaone.com/world/3-dead-after-stabbing-attack-festival-western-germany", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany - Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday (Aug 23) night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "1aca6b60-f333-40b4-8709-570990e25e3e", "title": "Fires start on ship after Houthi strike | The Arkansas Democrat - Gazette", "date": "2024-08-24 10:45", "url": "https://www.arkansasonline.com/news/2024/aug/24/fires-start-on-ship-after-houthi-strike/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates -- Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nThe Greek-flagged oil tanker Sounion is seen heading into the Finnart Ocean Terminal in the United Kingdom on Nov. 29, 2017."}, {"id": "a183f31d-513a-4d8a-9155-c59b76b74594", "title": "Iran issues new revenge statement after a month of silence", "date": "2024-08-24 14:00", "url": "https://www.albawaba.com/news/iran-issues-new-revenge-statement-after-1582642", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "He promised that Iran will respond with precision, timing, and thorough consideration of all relevant variables.\nIran is determined to react without holding back, as Araghchi said, adding, \"We will act at the right time and in the right way.\"\nThere is no indication that there was inside participation in the killing, according to Iranian Intelligence Minister Esmail Khatib.\nThe Iranian Revolutionary Guard said in a statement that the killing was \"planned and executed by the Zionist regime with backing from the U.S.\nA warning was issued at the end of the statement: \"The Zionist regime will face severe and decisive punishment at the appropriate time and place.\""}, {"id": "4dda1d14-748f-4ee4-86cf-62bdde33d7a9", "title": "Deadly Stabbing Attack at Solingen Festival Leaves Multiple Victims", "date": "2024-08-24 00:00", "url": "https://www.devdiscourse.com/article/business/3062305-deadly-stabbing-attack-at-solingen-festival-leaves-multiple-victims", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A tragic stabbing attack at a festival in Solingen, Germany, on Friday night resulted in multiple fatalities and injuries, according to police.\nThe incident was reported by Bild newspaper, which stated that a man had randomly attacked festival-goers at approximately 9:45 p.m. (1945 GMT).\nSolingen Mayor Tim-Oliver Kurzbach confirmed the casualties and injuries but withheld further details.\nHe expressed his profound grief, saying, “It tears my heart apart that there was an attack on our city.\nGermany has seen sporadic instances of fatal stabbings and shootings, including the stabbing of a policeman in Mannheim in June and an attack on a train in 2021."}, {"id": "e1488d22-b2ec-4e1b-9586-be77d6e33f7a", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.swissinfo.ch/eng/three-dead-after-stabbing-attack-at-festival-in-western-germany/87430985", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Three dead after stabbing attack at festival in western Germanyreuters_tickers2 minutesBy Petra WischgollSOLINGEN, Germany (Reuters) -Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\n“It tears my heart apart that there was an attack on our city.\nThe police said the attack occurred at a festival to honour the town’s 650th anniversary.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "bc8e3ce6-cc5e-43c6-b3a3-d5c089ab57c3", "title": "German police search for assailant in festival stabbing that killed 3 - World", "date": "2024-08-24 09:00", "url": "https://www.brecorder.com/news/40319092/german-police-search-for-assailant-in-festival-stabbing-that-killed-3", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "FRANKFURT: German police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen.\nEight were injured, five of them seriously, the police said in a statement early on Saturday.\nA stabbing attack on a train in 2021 injured several.\nFriday’s attack occurred at a festival marking the 650th anniversary of Solingen in North Rhine-Westphalia, Germany’s most populous state, which borders the Netherlands.\nThe attack occurred at the Fronhof, a market square where live bands were playing."}, {"id": "66187d70-6f1e-45cd-aa73-cf0ac446ed9b", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/german-police-search-assailant-festival-043318580.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "German stabbing rampage is 'possible act of terrorism', official saysBy Petra Wischgoll, Tom Sims and Thomas SeythalSOLINGEN, Germany (Reuters) -A stabbing rampage in which a man killed three people and wounded eight others at a festival in the western German city of Solingen was \"a possible act of terrorism\", an official said on Saturday, as the search for the unknown assailant continued.\nA police official, Thorsten Fleiss, confirmed at the same briefing that the assailant appeared to aim for his targets' throats.\n\"The investigation and manhunt for possible further perpetrators and reasons for the crime are in full swing,\" the police said in a statement.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "6ca90c7a-76ad-40ce-a148-2e8837e7ba55", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 08:15", "url": "https://www.timeslive.co.za/news/world/2024-08-24-german-police-search-for-assailant-in-festival-stabbing-that-killed-3/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "b9ddbc4a-79f7-47e6-a6f9-8a61c51d6289", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 13:00", "url": "https://www.sowetanlive.co.za/news/world/2024-08-24-german-police-search-for-assailant-in-festival-stabbing-that-killed-3/", "domain": "sowetanlive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "ec4351b4-3728-4e8b-b1cb-88b2749b4d10", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 06:00", "url": "https://www.swissinfo.ch/eng/german-police-search-for-assailant-in-festival-stabbing-that-killed-3/87431429", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "German police detain individual after festival stabbing that killed 3reuters_tickers3 minutesBy Petra Wischgoll, Tom Sims and Rene WagnerSOLINGEN, Germany (Reuters) -Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several.\nHe told reporters it was a targeted attack on human life but declined to speculate on the motive."}, {"id": "e044ca07-7343-49fe-8e9b-1c7179550993", "title": "5 Secret Service agents assigned to modified duty | Northwest Arkansas Democrat - Gazette", "date": "2024-08-24 11:00", "url": "https://www.nwaonline.com/news/2024/aug/24/5-secret-service-agents-assigned-to-modified-duty/", "domain": "nwaonline.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe gunman, Thomas Matthew Crooks, 20, of Bethel Park, was killed by a bullet fired by a Secret Service agent.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he \"cannot defend why that roof was not better secured.\"\nKelly and other task force members are scheduled to return to the site of the rally shooting on Monday."}, {"id": "2559944b-c5df-44b1-865a-b3abd9d6ae84", "title": "Israeli Aggression Leaves 7 Civilians Injured in Central Syria", "date": "2024-08-24 10:30", "url": "https://english.almanar.com.lb/2182094", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Seven civilians were left injured as Israeli aggression targeted multiple sites in central Syria.\nThe Syrian air defenses intercepted the aggression’s missiles and shot down some of them.\nA Syrian military source reported, “At around 7:35 pm today, the Israeli enemy launched an air aggression from the direction of northern Lebanon, targeting several sites in the central region.\nEarlier this month, on August 9, Israeli occupation forces launched an airstrike from northern Lebanon, targeting several military positions in Syria’s central region, namely Homs.\nAccording to a Syrian military source, the attack resulted in the injury of four soldiers and caused limited material damage."}, {"id": "47a1717c-ac37-4c76-90db-6eb2af9a21d3", "title": "German police hunt for assailant in festival stabbing that killed 3", "date": "2024-08-24 09:45", "url": "https://www.swissinfo.ch/eng/german-police-hunt-for-assailant-in-festival-stabbing-that-killed-3/87431429", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "German police detain individual after festival stabbing that killed 3reuters_tickers3 minutesBy Petra Wischgoll, Tom Sims and Rene WagnerSOLINGEN, Germany (Reuters) -Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several.\nHe told reporters it was a targeted attack on human life but declined to speculate on the motive."}, {"id": "9b4696be-4a60-4944-8773-b018acdab90a", "title": "German police hunt for assailant in festival stabbing that killed 3", "date": "2024-08-24 08:15", "url": "https://www.cnbc.com/2024/08/24/german-police-hunt-for-assailant-in-festival-stabbing-that-killed-3.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "Police officers secure access to the crime scene after the Solingen city festival on August 24, 2024 in Solingen, Germany.\nPolice hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "60aead19-4088-4bf1-9add-b755aa224696", "title": "3 killed in Germany festival knife incident ; attacker reportedly on the run", "date": "2024-08-24 02:30", "url": "https://www.straitstimes.com/world/europe/multiple-dead-others-injured-after-stabbing-attack-at-festival-in-western-germany", "domain": "straitstimes.com", "domain_classification": "Local - Asia", "message": "SOLINGEN, Germany – A stabbing rampage in which a man killed three people and wounded eight others at a festival in the western German city of Solingen was “a possible act of terrorism”, an official said on Aug 24, as the search for the unknown assailant continued.\nPolice said they had detained a 15-year-old individual and were investigating whether there was a possible link to the attacker, who is still at large.\nA police official, Mr Thorsten Fleiss, confirmed at the same briefing that the assailant appeared to aim for his targets’ throats.\n“The investigation and manhunt for possible further perpetrators and reasons for the crime are in full swing,” the police said in a statement.\n“The perpetrator must be quickly caught and punished to the fullest extent of the law,” German Chancellor Olaf Scholz posted on X earlier on Aug 24."}, {"id": "78f9cf7a-6da8-4840-9a28-1683b9e32efd", "title": "Do Aircraft Carriers Travel Alone ? ", "date": "2024-08-24 00:30", "url": "https://www.slashgear.com/1645746/do-aircraft-carriers-travel-alone/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The U.S. has 11 aircraft carriers at the moment, and each one is a powerful asset that's a big target for enemy forces.\nBig is the key word here, since despite being faster than you might think, aircraft carriers aren't exactly the most lithe, stealthy ships on the water, and quite vulnerable to attacks.\nThey typically consist of the aircraft carrier, two guided missile cruisers, two anti-aircraft warships, and one to two anti-submarine destroyers or frigates.\nCarrier groups are rarely alike, depending on the nature of the mission.\nSometimes there are also other types of ships, including supply ships, mine sweepers, troop ships, and cargo ships carrying tanks and other equipment."}, {"id": "60df90df-be96-42f2-837b-55c70524c9e4", "title": "Police Search For Assailant After 3 Killed In Germany Stabbing Incident", "date": "2024-08-24 08:30", "url": "https://article.wn.com/view/2024/08/24/Police_Search_For_Assailant_After_3_Killed_In_Germany_Stabbi/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "German police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of... ...... read full story"}, {"id": "439a6bdc-cd78-4a73-aadd-f4d98eaa1beb", "title": "Secret Service agents reassigned in response to Trump assassination attempt", "date": "2024-08-24 01:15", "url": "https://www.voanews.com/a/secret-service-agents-reassigned-in-response-to-trump-assassination-attempt/7755164.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty as a response to the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nThe shooting was a devastating failure of one of the agency's core duties and led to Kim Cheatle's resignation as Secret Service director.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he \"cannot defend why that roof was not better secured.\""}, {"id": "7b3491ea-85ec-47e8-bbd8-476f10cbe8ba", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 13:00", "url": "https://apnews.com/article/secret-service-trump-shooting-f96d0d1dc85ca3d33e74eafc1177ff0b", "domain": "apnews.com", "domain_classification": "International", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nOne of the five agents was assigned to Trump’s protective detail, the official said.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "e574f841-c802-411d-995a-95cea66fba9d", "title": "Trump assassination attempt : At least 5 Secret Service agents placed on leave", "date": "2024-08-24 02:30", "url": "https://www.bostonherald.com/2024/08/23/at-least-5-secret-service-agents-placed-on-leave/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nThe agents are on administrative leave, meaning they cannot do investigative or protective work.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”"}, {"id": "d5a0db04-f032-4667-b4a1-823d0390c1e9", "title": "Security Beefed Up As Explosion Outside French Synagogue Injures Police Officer", "date": "2024-08-24 14:30", "url": "https://leadership.ng/security-beefed-up-as-explosion-outside-french-synagogue-injures-police-officer/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "An explosion has occurred outside the Beth Yaacov synagogue in La Grande-Motte, southern France, leaving one police officer injured and prompting a swift increase in security measures around Jewish places of worship across the country.\nAuthorities are reviewing CCTV footage that captured an individual walking away from the vehicles moments before the explosion.\nFrench Interior Minister Gérald Darmanin described the fire as “an obviously criminal act” and reassured the Jewish community of his full support.\nIn response to the attack, Prime Minister Gabriel Attal and Interior Minister Darmanin traveled to the scene on Saturday afternoon.\nJean-Luc Mélenchon, a prominent left-wing politician, called it an “intolerable crime,” while Jordan Bardella of the far-right National Rally party described it as “a criminal and antisemitic act.”"}, {"id": "a1c332a5-f902-455c-a877-ca8b39bcfb08", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:15", "url": "https://www.local10.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "local10.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "6f723a5a-0c36-4d11-9004-0f31c2002b7a", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:30", "url": "https://www.news4jax.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "02f9ef4c-9a03-4005-b483-72f2f98f50fb", "title": "Germany festival : Several dead and wounded in stabbing attack", "date": "2024-08-24 00:15", "url": "https://www.nzherald.co.nz/world/germany-festival-several-dead-and-wounded-in-stabbing-attack/BJSG72YO3FDEBPV2WNNLAZQD2M/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Several people have been killed and others wounded when a man knifed passers-by at random at a festival in the western German city of Solingen, newspaper Bild reports.\nVideo / BBCSeveral people have been killed and others wounded after a man knifed passers-by at random at a festival in the western German city of Solingen today, newspaper Bild reports.\nBild said the incident occurred at about 9.45pm on Friday (local time) and that at least three people were dead and several were wounded.\nWitnesses said the perpetrator was at large.\nThe local newspaper Solingen Tageblatt reported on its website that the attack occurred at a festival to honour the city’s 650 years."}, {"id": "d1e93f71-17b6-45ae-b0a8-061fd6cbed73", "title": "FBI probing drive - by attack on Sikh separatist in California", "date": "2024-08-24 04:30", "url": "https://economictimes.indiatimes.com/news/international/world-news/fbi-probing-drive-by-attack-on-sikh-separatist-in-california/articleshow/112754353.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "He said he immediately thought of Nijjar, saying \"this is how Hardeep Singh Nijjar had been assassinated and the whole picture of the scene went through my mind.\n\"As they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, said Raju.\nHe and his two friends fled into a nearby field and hid behind a haystack while they called 911.\n\"They want to stop the Khalistan referendum,\" he said.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "eb7498fc-396a-427d-86de-15bf46330c64", "title": "Sikh separatist attacked in drive - by in California , FBI probing", "date": "2024-08-24 00:30", "url": "https://www.ctvnews.ca/world/fbi-probing-drive-by-attack-on-sikh-separatist-in-california-1.7012634", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Nijjar was killed in June 2023 outside his gurdwara, a Sikh place of worship, in Surrey, British Columbia.\nThe FBI's Sacramento office confirmed it is collaborating with the California Highway Patrol \"in support of the investigation\" into the shooting.\nIn the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nThe Indian Embassy in Washington did not respond to a request for comment on Friday about the recent shooting in California.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "fa725a03-1a61-4c9e-98ac-ced7a09b8a9a", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:00", "url": "https://www.lowellsun.com/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt-2/", "domain": "lowellsun.com", "domain_classification": "Unknown", "message": "By MICHAEL BALSAMOAt least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nOne of the five agents was assigned to Trump’s protective detail, the official said.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "e8cd6734-b28e-4dce-9788-fd78732ea28f", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 11:45", "url": "https://www.nbcnews.com/news/world/dozens-killed-strikes-southern-gaza-preparations-cease-fire-talks-move-rcna168065", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "At least three dozen Palestinians were killed in multiple Israeli strikes in the southern Gaza Strip, officials said Saturday, even as preparations moved ahead for high-level cease-fire talks in the Egyptian capital.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nSeventeen others were killed when a strike hit a road south of Khan Younis, including the passengers on a tuk-tuk and passers-by, Nasser Hospital said.\nAnother strike hit a tuk-tuk east of Khan Younis, killing at least five people.\nFirst responders also recovered the bodies of 10 people from a residential block west of Khan Younis."}, {"id": "4bb15f7f-9dfa-4630-8e8c-a79361ab5de2", "title": "Dozens killed in strikes in Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 13:00", "url": "https://www.voanews.com/a/dozens-killed-in-strikes-in-gaza-as-preparations-for-cease-fire-talks-move-forward/7755285.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "At least three dozen Palestinians were killed in multiple Israeli strikes in the southern Gaza Strip, officials said Saturday, even as preparations moved ahead for high-level cease-fire talks in Egypt.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nSeventeen others were killed when a strike hit a road south of Khan Younis, including the passengers on a tuk-tuk and passers-by, Nasser Hospital said.\nAnother strike hit a tuk-tuk east of Khan Younis, killing at least five people.\nFirst responders also recovered the bodies of 10 people from a residential block west of Khan Younis."}, {"id": "3032672a-1016-4b84-9900-47753ff25326", "title": "Truman COMPTUEX Marks 10th NATO Scenario in Pre - Deployment Training", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240823-usn01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Truman COMPTUEX Marks 10th NATO Scenario in Pre-Deployment TrainingUS Navy23 August 2024From USS Harry S TrumanATLANTIC OCEAN -- Commander, U.S. Second Fleet, Joint Force Command - Norfolk Vice Adm. Doug Perry led the Harry S. Truman Carrier Strike Group (HSTCSG) in the role of a NATO maritime component commander during a multi-day scenario in the strike group's current Composite Unit Training Exercise (COMPTUEX) - the Joint Force's most complex, multi-domain training event.\n\"We train, mentor, and assess Naval forces to compete at an incredibly high-level,\" said Rear Adm. Max McCoy, commander, Carrier Strike Group 4.\n\"It is a privilege to work alongside our NATO Allies and partners,\" said Rear Adm. Sean Bailey, commander, Carrier Strike Group 8, HSTCSG.\nThe NATO scenario was a display of advanced capabilities in the maritime domain and the NATO Alliance's role as a deterrent against adversaries to prevent escalation - and defend the Alliance if necessary.\nCarrier Strike Group 4's mission is to train, mentor, and assess carrier strike groups, amphibious ready groups, and independent deployers for global combat against peer competitors."}, {"id": "c59644e5-eec7-4510-8359-12e74c927c6c", "title": "Secret Service quietly puts five officers on leave , as campaigns move on from Trump shooting", "date": "2024-08-24 00:15", "url": "https://www.salon.com/2024/08/23/secret-quietly-puts-five-officers-on-leave-as-campaigns-move-on-from/", "domain": "salon.com", "domain_classification": "Unknown", "message": "In addition to the Pittsburgh field office head, at least three officers from that office and one member of the former president’s personal detail were also placed on leave, according to CBS News.\nThe decision, which was not confirmed to be a disciplinary action, comes as the shooting — once thought to be election-defining — moves to the back burner on the campaign trail.\nThe shooting at the Butler, Pennsylvania rally was called a massive security breakdown, with the FBI later taking the reins of the investigation as the Secret Service’s own ​​internal affairs division continues its inquiry.\nThough Secret Service spokesperson Anthony Guglielmi didn’t confirm the suspensions, telling CBS they wouldn’t comment on individuals, he confirmed that agents were being held to “the highest professional standards” and that disciplinary action could occur if a policy violation was found.\nTrump, who returned on Wednesday for his first outdoor rally since the shooting, made no mention of the conspicuous newly added bulletproof glass standing between him and the crowd."}, {"id": "fce860e8-db2e-4ee2-bacc-63b8dde9fb10", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 06:45", "url": "https://www.smdailyjournal.com/news/national/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination/article_3332b8a8-6196-11ef-8e79-d7f0c6e2aed9.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "7e40d29c-d52e-4c24-9f6c-c831fdaddab0", "title": "German police search for assailant in festival stabbing that kills 3", "date": "2024-08-24 05:00", "url": "https://www.thestar.com.my/news/world/2024/08/24/german-police-search-for-assailant-in-festival-stabbing-that-kills-3", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "SOLINGEN, Germany (Reuters) -A stabbing rampage in which a man killed three people and wounded eight others at a festival in the western German city of Solingen was \"a possible act of terrorism\", an official said on Saturday, as the search for the unknown assailant continued.\nA police official, Thorsten Fleiss, confirmed at the same briefing that the assailant appeared to aim for his targets' throats.\n\"The investigation and manhunt for possible further perpetrators and reasons for the crime are in full swing,\" the police said in a statement.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "9daba8d4-00fc-47f4-b9d4-c8eb14664abe", "title": "Germany stabbing latest : Festival organiser warns  perpetrator on run  | World | News", "date": "2024-08-24 14:30", "url": "https://www.express.co.uk/news/world/1940038/germany-stabbing-latest-festival-organiser-manhunt", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "A woman and two men were murdered, while eight others were injured, in a \"brutal and senseless\" attack in the German city of Solingen last night, according to police.\nPolice have detained a person in connection with the stabbing, with a manhunt now underway.\nREAD MORE Horror festival attack leaves three dead and nine fighting for life [LATEST]An officer stands guard in SolingenThe incident is reported to have taken place at around 9.45pm in Fronhof central square in the city just outside of Dusseldorf in western Germany.\nAlthough there is limited information about the attacker so far, police believe the attack was committed by a lone wolf.\nHerbert Reul, interior minister of North Rhine-Westphalia, said: \"None of us knows why [the attack occurred].\""}, {"id": "e27ee160-0949-4505-a951-d24de5949c18", "title": "Suspect on the run , several dead in mass stabbing in Germany", "date": "2024-08-24 07:15", "url": "https://www.marketscreener.com/news/latest/Suspect-on-the-run-several-dead-in-mass-stabbing-in-Germany-47726705/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: At least three people were killed and several others were badly wounded in a mass stabbing in Germany on Friday (August 23).\nPolice searched the scene of the attack in Solingen, a city in western Germany.\nThey believe the suspect, a single, unidentified man, carried out the act on his own.\nBut the government wants tougher laws on carrying knives in public and banning longer blades.\nIn June 2024, a 29-year-old policeman died after he was stabbed during an attack on a right-wing demonstration in Mannheim."}, {"id": "cbb3201b-9f05-4930-8a91-775cc222ad70", "title": "German police hunting attacker who killed at least 3 in Solingen", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/german-police-hunting-attacker-killed-054122879.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The attacker was still on the run early on Saturday morning, police said, and the search continues.\nSpecial units were searching for the attacker in the city, according to a dpa reporter.\nPolice warned residents who observe anything suspicious not to act on their own initiative but call the police emergency number.\nThe attacker had managed to escape amid the panic that spread after the stabbing, said a spokesman for the North Rhine Westphalia Interior Ministry.\nPolice and ambulances stand near the scene, where people were killed and injured in an attack at the 650th anniversary celebrations of the city of Solingen in western Germany Gianni Gattus/dpaPolice officers stand at a cordon in the city center after, several people were killed and injured in an attack at the city's 650th anniversary celebrations."}, {"id": "9d824ad0-09b7-4726-aae5-60876d83a50e", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 10:30", "url": "https://www.yahoo.com/news/dozens-killed-strikes-southern-gaza-100838121.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CAIRO (AP) — Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "aee45c5e-4617-4fb9-90c2-bff9ab42f3b3", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 11:15", "url": "https://www.aol.com/dozens-killed-strikes-southern-gaza-100838074.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "CAIRO (AP) — Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "66d4e603-baa1-4451-8f18-e7376853c0d1", "title": "Dozens killed in strikes in Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 12:45", "url": "https://abcnews.go.com/International/wireStory/dozens-killed-strikes-southern-gaza-preparations-cease-fire-113119570", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Health workers say multiple Israeli airstrikes have killed at least three dozen Palestinians in southern Gaza while officials including a Hamas delegation gather for high-level cease-fire talks in neighboring EgyptCAIRO -- Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nMore than 100 hostages were released during a cease-fire last year, but Hamas is still believed to be holding around 110.\nA Hamas delegation arrived Saturday in Cairo to meet with Egyptian and Qatari officials, senior Hamas official Mahmoud Merdawy told the AP.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nAn Israeli delegation that arrived Thursday included the heads of the Mossad foreign intelligence service and Shin Bet security service and top general Maj. Gen. Eliezer Toledano."}, {"id": "dfc60dab-f6b8-427f-9fcb-6e3b1e2384bb", "title": "Hunt for German festival knifeman : Woman and two men are stabbed to death with five more seriously wounded in  brutal and senseles attacks on random passers - by", "date": "2024-08-24 08:00", "url": "https://www.dailymail.co.uk/news/article-13775535/Hunt-German-knifeman-woman-two-men-stabbed-death-diversity-festival.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A woman and two men were killed and eight others injured, five of them seriously, in the 'brutal and senseless' attack in the western German city of Solingen last night, police have said.\nThe usually quiet Fronhof central square had been packed with people last night for Solingen's three-day Festival of Diversity.\nThere are currently three fatally injured victims, four seriously injured and people in shock.\nRoad crossings were closed and residents were asked to stay in their homes following the attack last night.\nA police officer was killed and five people were wounded in a knife attack at a far-right rally in the city of Mannheim in late May."}, {"id": "11e986a6-6e67-4fee-a3a8-da542d523a1c", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 10:30", "url": "https://www.newsday.com/news/nation/israel-palestinians-gaza-war-news-08-24-2024-u34193", "domain": "newsday.com", "domain_classification": "Unknown", "message": "CAIRO — Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza.\nAssociated Press writer Wafaa Shurfa in Deir al-Balah, Gaza Strip, contributed to this report."}, {"id": "cf3c4524-130c-4652-9f04-039bdd78fcaa", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 12:30", "url": "https://www.aol.co.uk/dozens-killed-strikes-southern-gaza-120541013.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "CAIRO (AP) — At least three dozen Palestinians were killed in multiple Israeli strikes in the southern Gaza Strip, officials said Saturday, even as preparations moved ahead for high-level cease-fire talks in the Egyptian capital.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nSeventeen others were killed when a strike hit a road south of Khan Younis, including the passengers on a tuk-tuk and passers-by, Nasser Hospital said.\nAnother strike hit a tuk-tuk east of Khan Younis, killing at least five people.\nFirst responders also recovered 10 bodies from a residential block west of Khan Younis, six from the Hamad City area of Khan Younis, and two farther south in Rafah."}, {"id": "ed4b886b-ad3d-44db-9421-168d300b3f51", "title": "Multiple Israeli strikes kill dozens of Palestinian civilians . Cease - fire talks resume Sunday . ", "date": "2024-08-24 12:45", "url": "https://www.stltoday.com/news/nation-world/multiple-israeli-strikes-kill-dozens-of-palestinian-civilians-cease-fire-talks-resume-sunday/article_3028d2b4-6209-11ef-9a99-2bc82435ed83.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "CAIRO — At least three dozen Palestinians were killed in multiple Israeli strikes in the southern Gaza Strip, officials said Saturday, even as preparations moved ahead for high-level cease-fire talks in the Egyptian capital.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nAnother strike hit a tuk-tuk east of Khan Younis, killing at least five people.\nFirst responders also recovered the bodies of 10 people from a residential block west of Khan Younis.\nAssociated Press writer Wafaa Shurfa in Khan Younis, Gaza Strip, contributed to this report."}, {"id": "5c7a6053-e153-41d7-8050-3c3bcbaafe47", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 11:15", "url": "https://www.clickondetroit.com/news/world/2024/08/24/dozens-killed-in-strikes-in-southern-gaza-as-preparations-for-cease-fire-talks-move-forward/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "CAIRO – Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "0e65df80-ee83-47f2-8163-66d1b8b9bf60", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 10:45", "url": "https://www.local10.com/news/world/2024/08/24/dozens-killed-in-strikes-in-southern-gaza-as-preparations-for-cease-fire-talks-move-forward/", "domain": "local10.com", "domain_classification": "Unknown", "message": "CAIRO – Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "0f657405-93b9-412b-8317-9d8601ef6bc6", "title": "Arson attack at French synagogue investigated as terrorism", "date": "2024-08-24 12:45", "url": "https://abcnews.go.com/International/arson-attack-french-synagogue-investigated-terrorism/story?id=113119581", "domain": "abcnews.go.com", "domain_classification": "International", "message": "LONDON -- An arson attack on a synagogue in southern France is being investigated by the national Anti-Terrorism Prosecutor's Office.\nThe attack targeting the synagogue of La Grande-Motte, a popular seaside resort town along the southern French coast some 90 miles west of Marseille, at approximately 8 a.m. on Saturday morning, authorities said.\nThe prosecutor's office said two cars were set on fire on the grounds of the synagogue, one of which contained a gas bottle, causing an explosion.\nLaw enforcement officers stand in front of a synagogue, in background on the photo, following the fire and explosion of cars in La Grande-Motte, south of France, on August 24, 2024.\n“An attack targeted the synagogue of La Grande Motte this morning."}, {"id": "2b831937-4eaa-4bea-ab92-efbcc085dc78", "title": "Seven civilians injured in Israeli aggression targeting central Syria", "date": "2024-08-24 11:45", "url": "https://www.presstv.ir/Detail/2024/08/24/731945/Israeli-airstrike-on-central-Syria-region-leaves-seven-civilians-injured", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "At least seven civilians suffered injuries when Israeli military aircraft carried out a strike against several military installations and buildings in the central region of the Arab country.\nSyria’s official news agency SANA, citing a military source, reported that Israeli warplanes launched an assault from the direction of northern Lebanon at approximately 7:35 p.m. local time (1635 GMT) on Friday, targeting a number of sites in the central region.\nThe source said Syrian air defense units managed to intercept and shoot down some of the missiles.\nThe attack resulted in the injury of seven civilians and caused material losses in the targeted area.\nThe Israeli airstrike against the crisis-hit Arab nation comes amid the regime’s bloody onslaught against Palestinians in the besieged Gaza Strip."}, {"id": "857ef079-9ba5-4e72-80bf-a898eecd21c1", "title": "White House reports progress in Gaza cease - fire talks", "date": "2024-08-24 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240823-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "White House reports progress in Gaza cease-fire talksBy VOA News August 23, 2024A White House spokesman said Friday there has been progress made in Gaza cease-fire talks in Cairo as intensive fighting continues between the Israel Defense Forces and Hamas militants in the embattled enclave.\nThe talks include negotiators from Israel, the U.S., Egypt and Qatar, but not Hamas.\nWe need Hamas to participate, and we need to get down to the brass tacks of locking in these details.\"\nThe department said Austin underscored the importance of finalizing a cease-fire deal and the release of all hostages, including eight Americans, held captive by Hamas in Gaza.\nIsrael and Hezbollah have traded near-daily strikes for more than 10 months against the backdrop of Israel's war against Hezbollah's ally, Hamas, in Gaza."}, {"id": "eaf4ad42-c5b0-4f8c-87b5-cdfb4ccfaf39", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward – Winnipeg Free Press", "date": "2024-08-24 10:30", "url": "https://www.winnipegfreepress.com/world/2024/08/24/dozens-killed-in-strikes-in-southern-gaza-as-preparations-for-cease-fire-talks-move-forward", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "CAIRO (AP) — At least three dozen Palestinians were killed in multiple Israeli strikes in the southern Gaza Strip, officials said Saturday, even as preparations moved ahead for high-level cease-fire talks in the Egyptian capital.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nDisplaced Palestinians at a food distribution center in Deir al Balah, central Gaza Strip, Friday, Aug. 23, 2024.\nFirst responders also recovered 10 bodies from a residential block west of Khan Younis, six from the Hamad City area of Khan Younis, and two farther south in Rafah.\nAssociated Press writer Wafaa Shurfa in Deir al-Balah, Gaza Strip, contributed to this report."}, {"id": "3a45ddf4-9cca-427a-b9e2-1bd4fea17f97", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 12:45", "url": "https://www.clickorlando.com/news/world/2024/08/24/dozens-killed-in-strikes-in-southern-gaza-as-preparations-for-cease-fire-talks-move-forward/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "CAIRO – Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "01604a53-761d-4b9b-91d8-233adc233d45", "title": "Arson attack at French synagogue investigated as terrorism", "date": "2024-08-24 14:00", "url": "https://abc7news.com/arson-attack-at-french-synagogue-investigated-as-terrorism/15225891/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Arson attack at French synagogue investigated as terrorismLONDON -- An arson attack on a synagogue in southern France is being investigated by the national Anti-Terrorism Prosecutor's Office.\nThe prosecutor's office said two cars were set on fire on the grounds of the synagogue, one of which contained a gas bottle, causing an explosion.\nFrench Prime Minister Gabriel Attal added that 'in the face of antisemitism, in the face of violence, we will never let ourselves be intimidated.\"\n\"An attack targeted the synagogue of La Grande Motte this morning.\nI have been informed that the National Anti-Terrorism Prosecutor's Office has taken charge of the investigation."}, {"id": "c080c1bf-f161-4684-8127-79eafafbddac", "title": "Five Secret Service agents placed on modified duty after Trump assassination attempt", "date": "2024-08-24 04:45", "url": "https://www.9news.com.au/world/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/e3801723-d402-45e8-b526-0219d7a3570c", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former PresidentDonald Trumpin July, a law enforcement official told The Associated Press."}, {"id": "5e94ced1-5981-4076-a361-e25171e43187", "title": "Hunt for attacker after three killed in German stabbing", "date": "2024-08-24 14:15", "url": "https://www.canberratimes.com.au/story/8740873/hunt-for-attacker-after-three-killed-in-german-stabbing/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nHe was told about what happened but was asked to continue \"to avoid causing a mass panic attack\", he posted on Instagram."}, {"id": "83a6d26a-fab4-4156-a395-fdef03fd1d18", "title": "FBI probing attack on Sikh separatist with ties to Nijjar", "date": "2024-08-24 00:30", "url": "https://www.cbc.ca/news/canada/british-columbia/fbi-probe-attack-on-sikh-separatist-1.7303991", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Speaking through an interpreter, Raju told Reuters that a white car pulled up to the left of their truck, then fell back behind them before pulling up alongside them again.\nAs they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, Raju told Reuters.\n(CBC)In the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nRaju told Reuters he was not among those who received such calls.\nA look at the movement for an independent Sikh state Duration 13:38 Some Sikhs have historically been seeking an independent Sikh homeland in northern India called Khalistan."}, {"id": "543cc93d-1615-4204-b1f5-542c196b7f18", "title": "FBI probes attack on Sikh separatist in California", "date": "2024-08-24 06:30", "url": "https://tribune.com.pk/story/2490591/fbi-probes-attack-on-sikh-separatist-in-california", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Nijjar was killed in June 2023 outside his gurdwara, a Sikh place of worship, in Surrey, British Columbia.\nThat killing, and Trudeau's suggestion of possible Indian government involvement, triggered a diplomatic crisis between the countries.\nIn the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nThe Indian Embassy in Washington did not respond to a request for comment on Friday about the recent shooting in California.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "cf2f17dd-e6da-40b6-9cff-fe1c012d763f", "title": "Arson attack at French synagogue investigated as terrorism", "date": "2024-08-24 14:30", "url": "https://abc30.com/arson-attack-at-french-synagogue-investigated-as-terrorism/15225891/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Arson attack at French synagogue investigated as terrorismLONDON -- An arson attack on a synagogue in southern France is being investigated by the national Anti-Terrorism Prosecutor's Office.\nThe prosecutor's office said two cars were set on fire on the grounds of the synagogue, one of which contained a gas bottle, causing an explosion.\nFrench Prime Minister Gabriel Attal added that 'in the face of antisemitism, in the face of violence, we will never let ourselves be intimidated.\"\n\"An attack targeted the synagogue of La Grande Motte this morning.\nI have been informed that the National Anti-Terrorism Prosecutor's Office has taken charge of the investigation."}, {"id": "252fe253-7766-48cc-85b5-a1241cefa9b1", "title": "Blast attack on French synagogue is being treated as terrorism", "date": "2024-08-24 14:15", "url": "https://www.dailymail.co.uk/news/article-13775931/attack-french-synagogue-terrorism-denounce-attempt-jews.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "An explosion and fire at a synagogue in France today is being treated as terrorism as a community leader denounced the incident as an 'attempt to kill Jews'.\nTwo cars were set ablaze following an explosion next to a synagogue in France today in what was described as a ‘clear criminal attack’ on the Jewish place of worship.\nMr Darmanin called for the 'immediate reinforced protection' of all Jewish places of worship in France.\nYonathan Arfi, the president of the Representative Council of Jewish Institutions of France (CRIF) meanwhile described the incident as 'an attempt to kill Jews'.\n‘A gas bottle was clearly stored in one of two cars parked directly outside the synagogue, and that’s what caused the explosion."}, {"id": "8acf56f1-d8c7-4645-b94c-2f75effaba04", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 11:45", "url": "https://www.wsls.com/news/world/2024/08/24/dozens-killed-in-strikes-in-southern-gaza-as-preparations-for-cease-fire-talks-move-forward/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "CAIRO – Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nFirst responders also recovered 16 bodies from the Hamad City area of Khan Younis after a partial pullout of Israeli forces, 10 bodies from a residential block west of Khan Younis and two farther south in Rafah.\nThe circumstances of their deaths were not immediately clear, but the areas were repeatedly bombed by the Israeli military over the past week.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nMerdawy said Hamas' position had not changed from accepting an earlier draft that would include the full withdrawal of Israeli forces from Gaza."}, {"id": "95201d9c-34d9-41f7-9c6c-00db6f906a77", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward", "date": "2024-08-24 11:00", "url": "https://isp.netscape.com/news/world/story/0001/20240824/2abd1983d176c6ea3d19a5ace02688b6", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli airstrikes kill dozens in Gaza ahead of high-level cease-fire talks in EgyptCAIRO (AP) — Multiple Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.\nHe stressed that Hamas will not take part directly in Sunday's talks but will be briefed by Egypt and Qatar.\nAssociated Press writer Wafaa Shurfa in Deir al-Balah, Gaza Strip, contributed to this report.\n___Follow AP’s war coverage at https://apnews.com/hub/israel-hamas-war© Copyright The Associated Press.\nThe information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press."}, {"id": "3fb2f38d-8ed4-4242-9d5c-bd3e94589abe", "title": "As threats rise , Israelis turn to home bomb shelters", "date": "2024-08-24 03:30", "url": "https://www.al-monitor.com/originals/2024/08/threats-rise-israelis-turn-home-bomb-shelters", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Israeli couple Aviva Pertzov and Jeff Lederer put off building a bomb shelter for years.\nWhen it is finished, this \"safe room\" will have white-painted walls, a sofa and a tiled floor, and a single window with a heavy metal shutter that closes across it with a clang.\nHe added: \"Those (safe) rooms save lives.\nThe cost of building such a safe room varies approximately between $30,500 and $56,000.\nHowever, about 55 percent of Israeli households do not have safe rooms, according to official estimates, because of either cost, lack of space, fatalism or obstinacy."}, {"id": "a31c5120-c242-459f-b739-a2d9528cbad5", "title": "Pak : 2 killed , 10 injured in Pishin explosion", "date": "2024-08-24 10:00", "url": "http://www.uniindia.com/pak-2-killed-10-injured-in-pishin-explosion/world/news/3268637.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Islamabad, Aug 24 (UNI) Two people were killed and ten others, including policemen, were injured in an explosion in Pakistan's southwest Balochistan province on Saturday morning, police sources said.\nThe incident happened at about 11:00 a.m. local time (0600 GMT) in Pishin district of the province where explosives mounted on a motorbike were detonated by unidentified militants, the sources told Xinhua.\nThe injured people were shifted to a nearby hospital where three of them were in critical condition.\nNo group has claimed responsibility for the attack yet.\nUNI XINHUA AT ARN"}, {"id": "86a0d48f-a5ce-497e-b96b-eadc61de6e99", "title": "Ukraine prioritising holding on to Russian territory", "date": "2024-08-24 01:30", "url": "https://www.dailymail.co.uk/news/article-13775063/Ukraine-prioritising-holding-Russian-territory-seized-following-daring-mini-invasion-Zelensky-trade-Kursk-recover-land-captured-illegally-Putins-army.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine's daring 'mini-invasion' of southern Russia is not expected to push any further into the country, Western officials have said.\nSpeaking for the first time about the surprise incursion, they suggested that the Kyiv regime will chiefly aim to hold on to the territory it has already seized.\nOfficials indicated that the area of the Kursk region involved could be used in a potential trade-off by president Volodymyr Zelensky to recover Ukrainian land captured illegally by Moscow.\nThere are fresh hopes that negotiations could end the war after India's prime minister Narendra Modi visited Kyiv yesterday.\nWestern officials said five brigades of Russian troops were being reassigned to reinforce Kursk."}, {"id": "8f5c52b2-f9be-4c85-a4e6-b72be8624739", "title": "Explosion erupts outside synagogue in Southern France , police officer injured", "date": "2024-08-24 10:30", "url": "https://www.firstpost.com/world/explosion-erupts-outside-synagogue-in-southern-france-police-officer-injured-13807872.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "La Grande-Motte Mayor Stéphan Rossign said that the fire spread rapidly leaving the front door of the synagogue in shambles read moreA massive explosion erupted outside the Beth Yaacov synagogue in southern France on Saturday morning, injuring a police officer at the location.\nThe explosion took place after two cars were set on fire outside the synagogue.\nLa Grande-Motte Mayor Stéphan Rossign said that the fire spread rapidly leaving the front door of the synagogue in shambles.\nWhile the Mayor confirmed that the policeman was injured, no details were given about the condition of the officer.\nLe Motte, where the synagogue is located, houses 8,500 permanent residents and is touted as one of the top tourist locations in France."}, {"id": "758bae08-9288-4d69-a07f-54088fa39de1", "title": "Trump three - word warning to police association president as he hogged the microphone at explosive Arizona rally", "date": "2024-08-24 03:30", "url": "https://www.dailymail.co.uk/news/article-13775141/Trump-warning-police-association-president-Arizona-rally.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Donald Trump booted the president of the Arizona Police Association off the stage at his rally - telling him 'you gotta go.'\nJustin Harris joined the former president on stage at the Desert Diamond Arena in Glendale on Friday night.\nAfter speaking for nearly 10 minutes, the crowd grew restless and began chanting from Trump to take back the microphone.\nHarris looked at Trump standing behind him and the former president told him to wrap it up, saying 'you gotta go.'\nI will establish a new independent commission on assassination attempts,' Trump - an assassination survivor himself - said."}, {"id": "d5875457-880b-45b0-9df8-c944b02215a3", "title": "Police find weapon that may have been used in Solingen attack in bin", "date": "2024-08-24 14:30", "url": "https://www.yahoo.com/news/police-weapon-may-used-solingen-134143046.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police find weapon that may have been used in Solingen attack in binPolice cars stand at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations.\nChristoph Reichwein/dpaPolice have found a weapon they suspecte may have been used in the deadly stabbing in the western German city of Solingen in a rubbish bin in the town centre, investigators said on Saturday.\nThe find comes after three people were killed in the attack late on Friday night during a town festival.\nThe police confirmed on Saturday that their investigation is under way and searches are being carried out at several locations.\nA police officer stands at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations."}, {"id": "b3d0667a-bc32-41ba-83e2-73200f39e23e", "title": "Germany : At Least 3 Dead And Others Injured In Festival Stabbing , Assailant On The Run", "date": "2024-08-24 03:15", "url": "https://www.oann.com/newsroom/germany-at-least-3-dead-and-others-injured-in-festival-stabbing-assailant-on-the-run/", "domain": "oann.com", "domain_classification": "Unknown", "message": "(Photo by INA FASSBENDER/AFP via Getty Images)OAN Staff Abril Elfi5:12 PM – Friday, August 23, 2024At least three people have been killed and several others were injured after a stabbing attack took place at a Festival of Diversity in Germany.\nAdvertisementAccording to the newspaper Bild, an unidentified man began randomly stabbing bystanders on Friday night in Solingen, Germany.\nIt was unclear at first how many people had died, but the newspaper reported that the incident at a city festival at around 9.45 p.m. local time had resulted in at least three fatalities and several injuries.\nOther outlets have reported that at least four individuals were badly injured in addition to the three that died.\nCommemorating the city’s 650th anniversary, the “Festival of Diversity” commenced on Friday and was scheduled to continue through Sunday."}, {"id": "ffe2d1c3-c1b5-4f2e-bff5-270268db1588", "title": "German police hunt for suspect who killed three in festival stabbing", "date": "2024-08-24 10:30", "url": "https://www.yahoo.com/news/german-police-hunt-suspect-killed-100431100.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "German police hunt for suspect who killed three in festival stabbingPolice hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nGerman police have detained a person and are investigating whether there is a connection between them and the knife attack.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nPolice and ambulances near the scene of the knife attack in Soligen - GIANNI GATTUS/DPAThe perpetrator aimed specifically for peoples’ throats, one police spokesman said."}, {"id": "bdc11d9e-5a4f-4a4b-94ca-2ad88829ee8b", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 04:00", "url": "https://www.geo.tv/latest/560709-three-dead-after-stabbing-attack-at-festival-in-western-germany", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Police officers secure the area of an incident, after several individuals were killed on Friday night when a man randomly stabbed passers-by with a knife, at a city festival in Solingen, Germany, August 23, 2024.\n—ReutersSOLINGEN: Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration."}, {"id": "50afdb86-0be4-4935-9318-a202e9b858ef", "title": "German police hunt for suspect who killed three in festival stabbing", "date": "2024-08-24 10:30", "url": "https://www.aol.co.uk/news/german-police-hunt-suspect-killed-100431098.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nGerman police have detained a person and are investigating whether there is a connection between them and the knife attack.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nPolice and ambulances near the scene of the knife attack in Soligen - GIANNI GATTUS/DPAThe perpetrator aimed specifically for peoples’ throats, one police spokesman said.\nA stabbing attack on a train in 2021 injured several."}, {"id": "ccd8355d-39b8-4506-b235-560d522557b3", "title": "5 Secret Service agents placed on leave after Trump assassination attempt , Internet says  should be fired  ", "date": "2024-08-24 11:15", "url": "https://news.meaww.com/5-secret-service-agents-placed-on-leave-after-trump-assassination-attempt-internet-says-should-be-fired", "domain": "news.meaww.com", "domain_classification": "Unknown", "message": "BUTLER, PENNSYLVANIA: In the wake of the July 13 assassination attempt against former president Donald Trump in Pennsylvania, at least five US Secret Service agents have been placed on administrative leave.\nBREAKING:Multiple Secret Service agents have been placed on leave amid the investigation into the attempted assassination of President Trump.\nrevealed that a Secret Service whistleblower has alleged that headquarters officials discouraged additional security measures for the rally.\n\"There must be accountability at the Secret Service for its historic failures that led to the attempted assassination of President Trump,\" Comer stated.\nPublic outrage over delayed Secret Service actionAs the Secret Service places five agents on administrative leave nearly six weeks after the attempted assassination of former president Donald Trump, public outrage is growing."}, {"id": "47c45931-1139-4716-b767-a7ee72b4ca75", "title": "German police search for assailant in festival stabbing that killed 3 | World", "date": "2024-08-24 11:00", "url": "https://en.ammonnews.net/article/74629", "domain": "en.ammonnews.net", "domain_classification": "Unknown", "message": "Home WorldGerman police search for assailant in festival stabbing that killed 3Ammon News - German police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen.\nEight were injured, five of them seriously, the police said in a statement early on Saturday.\nThe police are currently searching for the perpetrator with a large team,\" police said.\nThe incident occurred around 9:40 p.m. (1940 GMT) on Friday, when the man attacked multiple people with a knife, the police said.\nThe perpetrator aimed specifically for the throats of his victims, the police added."}, {"id": "632dba9a-7087-435f-be72-8136f0baa328", "title": "Germany : Knife attack during festival in Solingen leaves three people dead | Indiablooms - First Portal on Digital News Management", "date": "2024-08-24 08:00", "url": "https://www.indiablooms.com/world-details/F/43242/germany-knife-attack-during-festival-in-solingen-leaves-three-people-dead.html", "domain": "indiablooms.com", "domain_classification": "Unknown", "message": "Photo Courtesy: PixabayAt least three people died and four others were injured in a knife attack in the western German city of Solingen on Friday, media reports said.\nThe attack took place during the “Festival of Diversity\", the three-day event to mark the 650th anniversary of the city's founding.\nHerbert Reul, interior minister for the state of North Rhine-Westphalia, was quoted as saying by CNN: \"None of us know why this happened.\nHeavily armed SEK units with about 40 special vehicles from all over North Rhine-Westphalia had been deployed to Solingen, DW reported quoting Bild.\nWith a population of about 160,000, the city in North Rhineland-Westphalia, is popularly known for its steel industry."}, {"id": "40341da0-ba5a-478e-875f-4f20f33d7587", "title": "As threats rise , Israelis turn to home bomb shelters", "date": "2024-08-24 06:15", "url": "https://www.ktbs.com/news/national/as-threats-rise-israelis-turn-to-home-bomb-shelters/article_53c88ef1-2c3a-5a73-9526-fd39a47604c2.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "a5da4e48-6002-4bde-990b-c2dbbd33c991", "title": "Arson attack on synagogue injures French policeman", "date": "2024-08-24 12:00", "url": "https://www.yahoo.com/news/arson-attack-synagogue-injures-french-113317622.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "We will find terrorist who tried to blow up synagogue, vows MacronPolice officers at the scene of the attack at the Beth Yaacov synagogue in La Grande-Motte - PASCAL GUYOT/AFPEmmanuel Macron promised French police would find the man who committed a “terrorist act” by trying to blow up a synagogue on Saturday morning in the seaside town of La Grande Motte.\nA policeman was injured in an explosion outside the Grande Motte Synagogue at 8.30am local time.\nGerald Darmanin, the interior minister, said: “An attempted arson attack, clearly criminal, hit the synagogue of La Grande Motte this morning.\n“The synagogue of La Grande-Motte is on fire.\n“I denounce in the strongest terms the events that took place this morning at the synagogue in La Grande-Motte."}, {"id": "904430e6-5f6e-4e9f-b0d4-8883464f8618", "title": "France opens terror probe after blast near synagogue", "date": "2024-08-24 13:00", "url": "https://article.wn.com/view/2024/08/24/France_opens_terror_probe_after_blast_near_synagogue/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "An explosion outside a synagogue in southern France wounded a police officer early on Saturday in what authorities said was being treated as a potential terror attack.\nFrance opens terror probe after blast near synagogue Security around Jewish sites was tightened following the early Saturday blast... read full story\"La Grande Motte's synagogue was the target of an attack this morning,\""}, {"id": "4b793c92-7dc3-47f5-9609-e8a5e69b539f", "title": "Solingen : German stabbing attack leaves three dead", "date": "2024-08-24 00:00", "url": "https://us.cnn.com/2024/08/23/europe/germany-solingen-stabbing-attack-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Those killed in the attack have been revealed as two men aged 67 and 56, and a woman aged 56.\nFlowers are left at the site of Friday's deadly stabbings in Solingen, Germany.\n“The attack in Solingen is a terrible event that I find very upsetting,” he wrote on X.\nPolice and ambulances near the scene where people were killed and injured in an attack at a festival in Solingen.\nFriday’s attack comes amid rising rates of knife crime in Germany, recently prompting Interior Minister Faeser to propose tightened laws to tackle the issue."}, {"id": "dff4fb5f-e455-4d8b-83fc-f4535fa5542f", "title": "Arson attack on synagogue injures French policeman", "date": "2024-08-24 12:15", "url": "https://www.aol.co.uk/news/arson-attack-synagogue-injures-french-113317910.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Police officers at the scene of the attack at the Beth Yaacov synagogue in La Grande-Motte - PASCAL GUYOT/AFPEmmanuel Macron promised French police would find the man who committed a “terrorist act” by trying to blow up a synagogue on Saturday morning in the seaside town of La Grande Motte.\nA policeman was injured in an explosion outside the Grande Motte Synagogue at 8.30am local time.\nGerald Darmanin, the interior minister, said: “An attempted arson attack, clearly criminal, hit the synagogue of La Grande Motte this morning.\n“The synagogue of La Grande-Motte is on fire.\n“I denounce in the strongest terms the events that took place this morning at the synagogue in La Grande-Motte."}, {"id": "3ea69328-133c-4c38-a75e-0bbd1448b427", "title": "Dozens killed in strikes in southern Gaza as preparations for cease - fire talks move forward | iNFOnews", "date": "2024-08-24 10:30", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp623939907", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Dozens killed in strikes in southern Gaza as preparations for cease-fire talks move forwardDisplaced Palestinians gather for food distribution in Deir al Balah, central Gaza Strip, Friday, Aug. 23, 2024.\nThe hospital received a total of 33 dead who were killed in three separate strikes in and around Khan Younis.\nAnother strike hit a tuk-tuk east of Khan Younis, killing at least five people.\nFirst responders also recovered 10 bodies from a residential block west of Khan Younis, six from the Hamad City area of Khan Younis, and two farther south in Rafah.\nAssociated Press writer Wafaa Shurfa in Deir al-Balah, Gaza Strip, contributed to this report."}, {"id": "bfa12d33-734b-4836-b00a-88fe6fcf354a", "title": "France opens terror probe after explosion outside synagogue wounds police officer", "date": "2024-08-24 14:30", "url": "https://www.firstpost.com/world/france-opens-terror-probe-after-explosion-outside-synagogue-wounds-police-officer-13807913.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "La Grande Motte’s mayor, Stephan Rossignol, said that CCTV had picked up images of an individual setting fire to the cars.\nReutersAn explosion outside a synagogue in southern France wounded a police officer early on Saturday, in what authorities said was being treated as a potential terror attack.\nLa Grande Motte’s mayor, Stephan Rossignol, said that CCTV had picked up images of an individual setting fire to the cars.\nThe police presence outside Jewish sites in France would be increased following the explosion, the minister added.\nThe town of La Grande Motte has about 8,500 permanent residents but the population swells during the summer tourism season."}, {"id": "5f777592-537f-44a9-819d-c99f2603f922", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.sconeadvocate.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "a051f955-d2f0-43d2-b02f-ad239bb09f05", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.easternriverinachronicle.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=6364", "domain": "easternriverinachronicle.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "fa2bdf23-503f-4177-9986-04d3b1f644d8", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.crookwellgazette.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "5a4eb245-d1c3-4cd4-867a-2a4503c3f855", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 10:45", "url": "https://www.maitlandmercury.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "eb5079c0-b10f-4aa7-ac16-2b47fc49bf30", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 11:15", "url": "https://www.yasstribune.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14264", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "4003571b-e091-4445-8224-0b9da7d8e57c", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 11:00", "url": "https://www.merimbulanewsweekly.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14264", "domain": "merimbulanewsweekly.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "d0b6a3cf-b2c4-4e93-81a9-66b54ab411ab", "title": "Police arrest Arizona man for threatening to kill Donald Trump", "date": "2024-08-24 02:15", "url": "https://www.jpost.com/international/article-816097", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Thursday, the Cochise County Sheriff's Office said.\nDonald Trump, the Republican nominee for president, was in Cochise County on Thursday when he visited the US border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff's office said.\nSyvrud was subsequently booked into the Cochise County Jail on a felony warrant from Graham County in Arizona for \"failure to register as a sex offender and two counts of threatening for this case,\" the sheriff's office added.\nAssassination attemptIn early August, a Virginia man was charged with threatening Vice President Kamala Harris, Trump's Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates."}, {"id": "93e0c3ff-e5cf-4e54-86e3-359fb0674b60", "title": "Final victim pulled from sunken yacht | The Arkansas Democrat - Gazette", "date": "2024-08-24 10:45", "url": "https://www.arkansasonline.com/news/2024/aug/24/final-victim-pulled-from-sunken-yacht-militant-on/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Final victim pulled from sunken yachtROME -- Italian rescuers on Friday brought ashore the last of seven bodies from a superyacht that sank off the coast of Sicily, the coast guard said.\n\"The Lynch family is devastated, in shock and is being comforted and supported by family and friends.\n(Alberto Lo Bianco/LaPresse via AP)This undated photo provided by the Lynch family shows Hannah Lynch and Faucet.\n(Courtesy of the Lynch family via AP)This undated photo provided by the Lynch family shows Hannah Lynch.\n(AP Photo/Salvatore Cavalli)This undated photo provided by the Lynch family shows Mike and Hannah Lynch."}, {"id": "6c3494a1-4aef-4ac9-b735-88cb1d383ca7", "title": "Police officer injured after two cars are lit on fire outside French synagogue in  terrorist  act", "date": "2024-08-24 12:30", "url": "https://nypost.com/2024/08/24/world-news/police-officer-injured-after-arson-attack-in-front-of-french-synagogue/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A police officer was hurt when two parked cars outside the Beth Yaacov synagogue in La Grande-Motte, near Montpellier, were set on fire and exploded.\nThere is CCTV footage of an individual setting fire to both cars, La Motte’ mayor, Stephan Rossignol said, according to France24.\nA French officer blocks the road nearby the synagogue following the fire and explosion of cars in La Grande-Motte, south of France.\nAFP via Getty ImagesDarmanin is expected to travel to La Grande-Motte on Saturday along with acting Prime Minister Gabriel Attal.\nLa Grande-Motte has about 8,500 permanent residents, but the population swells in the summer months as tourists flock to the coastal area."}, {"id": "883cf05b-0ff2-4c2f-ad7f-a5af56e96302", "title": "German police hunting attacker who killed at least 3 in Solingen", "date": "2024-08-24 07:15", "url": "https://www.yahoo.com/news/german-police-hunting-attacker-killed-055717963.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The attacker had managed to escape amid the panic that spread after the stabbing, said a spokesman for the North Rhine Westphalia Interior Ministry.\nThe Festival of Diversity began on Friday to mark the 650th anniversary of Solingen and was due to continue through to Sunday.\nPolice officers walk through the city center after several people were killed and injured in an attack at the city's 650th anniversary celebrations.\nChristoph Reichwein/dpaA police officer stands at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations.\nChristoph Reichwein/dpaPolice cars stand at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations."}, {"id": "dc54a0be-3de3-47c0-9600-5223ddf644a0", "title": "US Navy supercarrier gets drone command center that will operate $136 million  Stingray  drones", "date": "2024-08-24 12:30", "url": "https://www.yahoo.com/news/us-navy-supercarrier-gets-drone-113545275.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US Navy supercarrier gets drone command center that will operate $136 million 'Stingray' dronesThe US Navy has installed a new drone control center on the USS George H.W.\nThe command center will operate MQ-25 \"Stingray\" drones.\nThe US Navy has installed a new drone command center on board the USS George H.W.\nThe drone control center.\nDrones have become an increasingly core part of modern warfare, with the Russia-Ukraine war in particular putting the unmanned systems under the spotlight."}, {"id": "9bfd7241-e594-41e2-8fbd-98c2da495be5", "title": "US Navy supercarrier gets drone command center that will operate $136 million  Stingray  drones", "date": "2024-08-24 12:45", "url": "https://www.yahoo.com/news/us-navy-supercarrier-gets-drone-113545057.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US Navy supercarrier gets drone command center that will operate $136 million 'Stingray' dronesThe US Navy has installed a new drone control center on the USS George H.W.\nThe command center will operate MQ-25 \"Stingray\" drones.\nThe US Navy has installed a new drone command center on board the USS George H.W.\nThe drone control center.\nDrones have become an increasingly core part of modern warfare, with the Russia-Ukraine war in particular putting the unmanned systems under the spotlight."}, {"id": "7ab063c2-7b03-47cf-8010-3acb3686b8c6", "title": "US Navy Supercarrier Gets Drone Command Center for $136M MQ - 25s", "date": "2024-08-24 12:30", "url": "https://www.businessinsider.com/us-navy-supercarrier-drone-control-center-uav-mq-25-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "The US Navy has installed a new drone control center on the USS George H.W.\nThe command center will operate MQ-25 \"Stingray\" drones.\nAdvertisementThe US Navy has installed a new drone command center on board the USS George H.W.\nBush (CVN 77) aircraft carrier, Naval Air Systems Command (NAVAIR) said in a press release.\nThe Unmanned Air Warfare Center (UAWC) will operate MQ-25 \"Stingray\" drones — $136 million unmanned aircraft systems that will be used to refuel fighter jets such as the F/A-18 Super Hornet, the EA-18G Growler, and the F-35C in the air, extending the Navy's strike range."}, {"id": "5a0a8d87-e03b-4aa2-a8a6-af405ba6dd1f", "title": "Russo - Ukraine War - 23 August 2024", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-23.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe General Staff of the Armed Forces of Ukraine reported that Defense Forces of Ukraine continue to repel attacks.\nIn the Kharkiv direction, Russian terrorists are trying to appease Ukrainian units in the areas of Vovchansk and Glybokoye.\nIn the Kramators Краkomu direction, Ukrainian soldiers repelled 20 Russian attempts to advance near the Chasovoye Yar, Kalinivka and Ivanivsky."}, {"id": "b5356434-a8ba-4cb7-892f-7a2daa5776a9", "title": "10 Times Luck Won Battles - Listverse", "date": "2024-08-24 08:30", "url": "https://listverse.com/2024/08/24/10-times-luck-won-battles/", "domain": "listverse.com", "domain_classification": "Unknown", "message": "This list delves into ten historical battles where luck played a decisive role, tipping the scales in favor of one side and altering the course of history.\nThese instances remind us that in the chaos of war, sometimes the outcome hinges on an unpredictable stroke of luck.\nHis army, outnumbered and outmaneuvered, was trapped on Brooklyn Heights, with the East River behind them and the British forces closing in.\nFirst, American forces, advancing faster than anticipated, reached the bridge before the Germans could demolish it.\nThis extraordinary stroke of luck not only preserved Japan’s independence but also became a defining moment in Japanese history."}, {"id": "badbbd6d-8f20-4146-b99f-cef8035efe41", "title": "Russia to Modernize its Yak - 52 Trainers to Shoot Down Ukrainian Kamikaze Drones", "date": "2024-08-24 14:30", "url": "https://theaviationist.com/2024/08/24/russia-to-modernize-its-yak-52-trainers-to-shoot-down-ukrainian-kamikaze-drones/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "The Yak-52B2 upgrade includes electronic warfare systems and multifunctional displays that will allow it to combat reconnaissance and attack drones.\nAfter Ukraine began using its Soviet-era Yak-52 training aircraft to shoot down Russian drones, Russia also has announced repurposing the same planes in its inventory with specific upgrades.\nDmitry Motin: “Today, one of the priority projects for our bureau is the modernization of the Yak-52 training aircraft into the Yak-52B2 ‘UAV countermeasure aircraft’.\nRussia has usually used a combination of close/short-range, point-defense AD (Air Defense) systems like Pantsir, EW (Electronic Warfare) and jammers to bring down the drones.\nIt is currently not known how many Yak-52 Russia plans to convert for the purpose."}, {"id": "2f7b73b7-c73f-4466-8ab0-ac81b7bd0844", "title": "Ukraine Overtakes Russia in Military Technology Stakes", "date": "2024-08-24 07:45", "url": "https://www.kyivpost.com/post/37890", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukraine has become a global leader in military drone and electronic warfare technologies, surpassing Russia, which has lost its edge in the 30 months since its full-scale invasion, according to Forbes.\nDuring its 2014 illegal annexation of Crimea, Russia used drones and electronic warfare effectively to disrupt Ukrainian communications and target positions.\nRecent successes in the Kursk region serve to highlight Ukraine’s military prowess.\nWhilst its electronic warfare systems were initially effective, they now face diminishing impact as Ukraine adopts newer technologies and tactics.\nOver 200 Ukrainian companies now produce military drones, and 50 focus on electronic warfare systems thanks to a shift from commercial tech to military applications."}, {"id": "80ec0f77-d6e3-414d-9734-48a0bdc811fa", "title": "Shock Trials : How the U . S . Navy Tests Aircraft Carriers for Combat", "date": "2024-08-24 14:00", "url": "https://nationalinterest.org/blog/buzz/shock-trials-how-us-navy-tests-aircraft-carriers-combat-212450", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Shock trials are critical tests conducted by the U.S. Navy to assess the structural integrity, equipment resilience, and overall combat readiness of its warships, particularly aircraft carriers.\nSummary and Key Points: Shock trials are critical tests conducted by the U.S. Navy to assess the structural integrity, equipment resilience, and overall combat readiness of its warships, particularly aircraft carriers.\n-The recent USS Gerald R. Ford’s shock trials revealed key issues, allowing the Navy to address them before deployment.\nShock Trials: How the Navy Judges Its WarshipsAmerican aircraft carriers are among the most complex systems mankind has ever built and maintained.\nIf these things fail to live up to expected performance parameters under shock trials, it is unlikely they would survive in combat."}, {"id": "5fccaa36-f6c6-4e6a-ae36-8443c6446074", "title": "Great Board Games To Play If you Like Risk", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/great-board-games-like-risk/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "As this is my favorite genre of board game, I gladly present to you some of the best board games to play if you like Risk.\nRecommended VideosImage: Academy Games878 Vikings is a lesser-known board game set during the Viking invasions of England.\nIf you’ve ever wanted your Risk games to have more of a narrative, then Inis is the perfect board game for you to try.\nHowever, for those who enjoy Risk and also love more complex and dramatic board games, you can’t get much better than Twilight Imperium.\nWith these excellent suggestions of Risk-adjacent board games, you can start your next game night with your new favorite."}, {"id": "2fcce1ac-e34a-443a-97e7-095c88005d35", "title": "Russia Capture Of Pokrovsk Could Reshape The Conflict Dynamics", "date": "2024-08-24 11:15", "url": "https://www.zerohedge.com/geopolitical/russias-capture-pokrovsk-could-reshape-conflicts-dynamics", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Russia’s capture of Pokrovsk, however long it might take, could reshape the conflict’s dynamics due to this town’s strategic significance for Ukraine’s military logistics.\nBeyond it are just a few lightly defended towns and then vast expanses of grassland that could become the scene of maneuver warfare.\nNone of these three precedents suggests that Ukraine is capable of beating Russia head-to-head at maneuver warfare.\nIn that event, Russia might also take advantage of its post-Pokrovsk maneuver warfare successes (assuming that they’re achieved as expected) to branch out in other directions.\nThe Kharkov vector could also help cut off supply lines to Kramatorsk-Slavyansk and thus facilitate the full capture of Donbass."}, {"id": "799c6ed6-b6aa-4057-8d59-958f871a4b48", "title": "Russo - Ukraine War", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-kursk.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Ukrainian forces used at least three German Marder fighting vehicles in the Kursk Region, the first German armor advance onto Russian soil since the Great Patriotic War.\nThe first Battle of Kursk, fought between July 5 and August 23, 1943, was one of the largest and most significant battles of World War II.\nv There was fighting 06 August 2024 in the Sudzhansky and Korneevsky districts of Kursk Region.\nThe most important factor in the war right now is Russia's manpower and force availability advantage, in particular with infantry.\n\"Offensive operations also risk taking higher casualties than in defense at a time when Ukrainian forces are stretched thin."}, {"id": "ba8cfcb4-09b2-49a3-97db-3d5b27b941bf", "title": "Ukraine marks 33rd independence day amid the ongoing war", "date": "2024-08-24 13:15", "url": "https://www.albawaba.com/news/ukraine-marks-33rd-independence-day-amid-1582639", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Ukraine celebrates its 33rd independence anniversary on August 24, 2024, while fighting Russia over acquired regions.\nUkraine gained independence from the USSR on August 24, 1991, after a historic parliamentary decision and a referendum with 90% support.\nViktor Yushchenko won a re-run, but pro-Russian Viktor Yanukovych won in 2010.\nRussian invasion of Ukraine on February 24, 2022, alleging persecution of Russian-speaking Ukrainians in the east, changed the scenario.\n🇺🇦 On the 33rd anniversary of Ukraine's independence, the #G7 remains steadfast in our commitment to supporting Ukraine and its people."}, {"id": "58882967-9074-40b8-91c2-807dc7fc4c81", "title": "Army for  Viksit Bharat  by 2047 - Daily Excelsior", "date": "2024-08-24 00:30", "url": "https://www.dailyexcelsior.com/army-for-viksit-bharat-by-2047/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The focus of the meeting was squarely on the Government’s vision of ‘Viksit Bharat’ by 2047, which coincides with the centenary of the country’s independence.\nThis strategic alignment of the Army’s transformation is essential for the realisation of ‘Viksit Bharat’.\nBy encouraging the development of indigenous equipment, platforms, and weapons, the Army also supports the growth of Indian defence industries.\nChange is never easy, especially in a large and tradition-bound organisation like the Indian Army.\nA modern, agile, and technology-enabled Indian Army will not only enhance national security but also contribute to India’s standing as a global power."}, {"id": "3c3654e5-76a3-4386-9553-42fb68d38023", "title": "Battle of Kursk Has Unchained Ukraine From a Failing War Strategy", "date": "2024-08-24 11:15", "url": "https://www.businessinsider.com/kursk-battle-ukraine-russia-war-strategy-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "At the start of August, Ukraine seemed doomed to remain on the defensive, slowly but relentlessly being ground into retreat by Russian onslaughts.\nBut its successful new Kursk offensive has done more than seize 480 square miles of Russian territory and humiliate Putin.\nAfter nearly a year of a grim defensive battle, the Kursk operation has also allowed Ukraine to seize the initiative and force Moscow to dance to Kyiv's tune.\nThe Russians no longer hold the initiative across the entirety of the theater, like they have for most of last year.\"\nWhich means Ukraine has to find some economical way of keeping up the pressure on Russia, without losing more territory of its own."}, {"id": "95c21b23-8de6-4e4b-99f2-0614379b7a92", "title": "The fall of Vladimir Putin is now only a matter of time", "date": "2024-08-24 14:30", "url": "https://www.yahoo.com/news/fall-vladimir-putin-now-only-140108422.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Preparations had been made in such secrecy that Ukraine’s allies seemed to be as much in the dark as her enemies.\nThe Europeans and Americans have been every bit as blindsided by the speed of the advance as the Russians.\nThe principal aim was to alter the calculus within Russia, making the war less attractive and turning key figures against the man determined to prosecute it at any cost, Vladimir Putin.\nIt now seems clear that, if Ukraine’s Nato allies explicitly authorise the use of long-range missiles within Russia, Ukraine will continue to make gains.\nYes, Putin is also motivated by hunger for the energy reserves under Donbas and in the waters off Crimea."}, {"id": "01de3749-7a94-42fc-9da5-6eba1eb8baee", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 06:30", "url": "https://edition.cnn.com/2024/08/24/europe/ukraine-kursk-west-russia-weapons-analysis-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "f60a72f3-5956-4629-85fc-bdba64ce8d57", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 07:45", "url": "https://us.cnn.com/2024/08/24/europe/ukraine-kursk-west-russia-weapons-analysis-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "975f2b16-5dbc-43c8-889f-859b61af13cd", "title": "Hezbollah : What weapons does it have ? A visual guide", "date": "2024-08-24 07:45", "url": "https://us.cnn.com/2024/08/24/middleeast/hezbollah-weapons-visuals-intl-dg/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Though no match for Israel’s military might, Hezbollah’s increasingly sophisticated arsenal has the potential to inflict significant damage on Israel and its allies in the region.\nAs it fought in the trenches of that nearly decade-long war, Hezbollah became seasoned in urban warfare and solidified its alliances with other Iran-backed groups fighting in Syria.\nThroughout its decades-long conflict with Israel, Hezbollah has been engaged in asymmetric warfare.\nIt has sought to grow its political and military might, while seeking to establish deterrence despite Israel’s military superiority.\nBecause of Hezbollah’s growing power, a possible all-out war between Israel and Lebanon would thrust the Middle East into uncharted waters."}, {"id": "f7d23698-6fb0-4664-a6df-6bf9be60b772", "title": "Hezbollah : What weapons does it have ? A visual guide", "date": "2024-08-24 09:00", "url": "https://krdo.com/news/2024/08/23/hezbollah-what-weapons-does-it-have-a-visual-guide/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Lou Robinson and CNN staff(CNN) — Hezbollah is believed to be the most heavily armed non-state group in the world.\nThough no match for Israel’s military might, Hezbollah’s increasingly sophisticated arsenal has the potential to inflict significant damage on Israel and its allies in the region.\nAs it fought in the trenches of that nearly decade-long war, Hezbollah became seasoned in urban warfare and solidified its alliances with other Iran-backed groups fighting in Syria.\nThroughout its decades-long conflict with Israel, Hezbollah has been engaged in asymmetric warfare.\nIt has sought to grow its political and military might, while seeking to establish deterrence despite Israel’s military superiority."}, {"id": "0414e6ca-0e1b-4f70-8c30-ebe7d95f3f1d", "title": "When it comes to military AI , there is no second place", "date": "2024-08-24 12:45", "url": "https://www.yahoo.com/news/comes-military-ai-no-second-120200544.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "When it comes to military AI, there is no second placeWhen future military capabilities are discussed these days, artificial intelligence and how it will change the nature of warfare is at the top of the list.\nThe global military AI market is nearly $9 billion today and is expected to approach $25 billion by 2032.\nCongress, in providing for the common defense, must enable these critical programs with funding needed to win the military AI race, because in warfare, there is no second place.\nGary Roughead is a former United States Navy officer who served as the 29th Chief of Naval Operations from 2007 to 2011.\nHe previously served as Commander of the United States Fleet Forces Command from May 17 to September 29, 2007."}, {"id": "619c1310-3ef7-4b9d-ae6d-1b7c5d03aa81", "title": "When it comes to military AI , there is no second place", "date": "2024-08-24 14:30", "url": "https://www.marinecorpstimes.com/opinion/2024/08/24/when-it-comes-to-military-ai-there-is-no-second-place/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "The Air Force forewarned that it, too, might soon need to make “tough decisions” about NGAD, including potentially ending the entire program.\nThe global military AI market is nearly $9 billion today and is expected to approach $25 billion by 2032.\nCongress, in providing for the common defense, must enable these critical programs with funding needed to win the military AI race, because in warfare, there is no second place.\nGary Roughead is a former United States Navy officer who served as the 29th Chief of Naval Operations from 2007 to 2011.\nHe previously served as Commander of the United States Fleet Forces Command from May 17 to September 29, 2007."}, {"id": "754eb2ec-ec5f-47d3-bd3c-37e146f8ddee", "title": "Questions about war in Ukraine added to history exam for 11th graders in Russia", "date": "2024-08-24 14:30", "url": "https://www.yahoo.com/news/questions-war-ukraine-added-history-115613906.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The demo version of the Russian Unified State Exam in History for 2025 includes questions about the war in Ukraine and occupied territories.\nIn particular, 11th graders are expected to identify that \"the city of Kherson became part of the Russian Federation during the SVO in the 2020s.\"\n[\"SVO,\" or \"special military operation,\" is the term used by Russian propagandists to describe the war against Ukraine – ed.]\nStudents are expected to link his name with the war against Ukraine.\nQuestions about the war in Ukraine and annexed territories first appeared in the Russian Unified State History Exam in 2023."}, {"id": "63d83f44-31dc-46fc-9420-0279e1843f8f", "title": "US approves sale of Anti - Submarine Warfare Sonobuoys to India", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/defence/us-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india/articleshow/112753344.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelWashington DC: The United States Secretary of State, Antony Blinken , has approved a possible foreign military sale of anti-submarine warfare Sonobuoys and related equipment to India at an estimated cost of USD 52.8 million.The Defence Security Cooperation Agency delivered the required certification, notifying Congress of this possible sale today, the US Defence Security Cooperation Agency said in a release.Notably, the Defence Security Cooperation Agency is an agency within the United States Department of Defence.\n\"The Government of India has requested to buy AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys; AN/SSQ-62F HAASW sonobuoys; AN/SSQ-36 sonobuoys; technical and publications and data documentation; US Government and contractor engineering and technical support; and other related elements of logistics and program services and support.\nThe estimated total cost is USD 52.8 million,\" the agency stated.This proposed sale will support US' foreign policy and national security objectives by helping to strengthen the United States-India strategic relationship and improving the security of a major defence partner that continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions.The proposed sale will also improve India's capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nIndia will have no difficulty absorbing this equipment into its armed forces.The agency further added that the proposed sale of this equipment and support will not alter the basic military balance in the region.The principal contractor(s) will be Sparton Corporation, located in De Leon Springs, FL, or Undersea Sensor Systems Inc. (USSI), located in Columbia City, IN, or a combination of both.\nThere are no known offset agreements proposed in connection with this potential sale, it added."}, {"id": "6feaa255-0ccf-4b7a-88b5-9fc7d43b7a7f", "title": "The US is sending $125 million in new military aid to Ukraine , officials say", "date": "2024-08-24 06:30", "url": "https://www.deccanchronicle.com/world/the-us-is-sending-125-million-in-new-military-aid-to-ukraine-officials-say-1818433", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Washington:The Biden administration will send about $125 million in new military aid to Ukraine, U.S. officials said Thursday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war .\nThe officials spoke on condition of anonymity because the aid has not been publicly announced.\nThe aid comes as Ukrainian forces continue to broaden their surprise offensive into Russia , where officials say they have taken about 100 square kilometers (62 square miles) of territory around Kursk.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "86b5bfcd-c7c4-4dc5-a621-aa7bed5eedd8", "title": "US Approves $52 . 8 Million Anti - Submarine Warfare Sonobuoys Sale To India", "date": "2024-08-24 05:00", "url": "https://www.news18.com/world/us-approves-52-8-million-anti-submarine-warfare-equipment-sale-to-india-9025949.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The United States has approved a potential $52.8 million Foreign Military Sale (FMS) to India, including Anti-Submarine Warfare (ASW) sonobuoys and related equipment, which will help bolster its deterrence capabilities.\nThe sale includes AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys, AN/SSQ-62F HAASW sonobuoys, AN/SSQ-36 sonobuoys, as well as technical publications, and other logistics.\nDeterrence CapabilitiesThis proposed sale aims to bolster US-India strategic relations and enhance India’s anti-submarine warfare and deterrence capabilities, particularly for its MH-60R helicopters.\n“The proposed sale will improve India’s capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nThe proposed sale of this equipment and support will not alter the basic military balance in the region,” it added."}, {"id": "54b22b9f-f241-4f41-9213-9f3032535b32", "title": "Hezbollah : What weapons does it have ? A visual guide", "date": "2024-08-24 14:00", "url": "https://kesq.com/news/national-world/cnn-world/2024/08/23/hezbollah-what-weapons-does-it-have-a-visual-guide/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "By Lou Robinson and CNN staff(CNN) — Hezbollah is believed to be the most heavily armed non-state group in the world.\nThough no match for Israel’s military might, Hezbollah’s increasingly sophisticated arsenal has the potential to inflict significant damage on Israel and its allies in the region.\nAs it fought in the trenches of that nearly decade-long war, Hezbollah became seasoned in urban warfare and solidified its alliances with other Iran-backed groups fighting in Syria.\nThroughout its decades-long conflict with Israel, Hezbollah has been engaged in asymmetric warfare.\nIt has sought to grow its political and military might, while seeking to establish deterrence despite Israel’s military superiority."}, {"id": "2fc3bfe5-c76d-4e69-bab2-c8893e557a1d", "title": "US notifies sale of anti - submarine warfare sonobuoys to India", "date": "2024-08-24 14:00", "url": "https://www.thehindubusinessline.com/news/us-notifies-sale-of-anti-submarine-warfare-sonobuoys-to-india/article68562071.ece", "domain": "thehindubusinessline.com", "domain_classification": "Unknown", "message": "The US has notified the proposed sale of Anti-Submarine Warfare Sonobuoys and related equipment for around $52.8 million to India.\n“The Government of India has requested to buy AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys, AN/SSQ-62F HAASW sonobuoys: AN/SSQ-36 sonobuoys; technical and publications and data documentation, US Government and contractor engineering and technical support, and other related elements of logistics and programme services and support,” said the Agency.\nThe proposed sale will improve India’s capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare from its MH-60R helicopters.\nThe Defense Security Cooperation Agency said the proposed sale will support the foreign policy and national security objectives of the US by helping to strengthen the United States-India strategic relationship.\nThere will be no adverse impact on US defence readiness as a result of this proposed sale, the agency said in a release."}, {"id": "9e990b1e-783c-4741-b374-6a404362714f", "title": "India - Anti - Submarine Warfare Sonobuoys", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/wmd/library/news/india/2024/india-240823-dsca01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "India - Anti-Submarine Warfare SonobuoysMedia/Public Contact: pm-cpa@state.govTransmittal No: 24-79WASHINGTON, August 23, 2024 -- The Secretary of State has approved a possible Foreign Military Sale to the Government of India of Anti-Submarine Warfare Sonobuoys and related equipment for an estimated cost of $52.8 million.\nThe Government of India has requested to buy AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys; AN/SSQ-62F HAASW sonobuoys; AN/SSQ-36 sonobuoys; technical and publications and data documentation; U.S. Government and contractor engineering and technical support; and other related elements of logistics and program services and support.\nThe proposed sale will improve India's capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nImplementation of this proposed sale will not require the assignment of any additional U.S. Government or contractor representatives to India.\nThere will be no adverse impact on U.S. defense readiness as a result of this proposed sale."}, {"id": "9752de76-3614-4e74-a71d-8c436c3b268e", "title": "Revenge of the Kennedys : RFK Jr . Takes a Flame Thrower to the Entire System", "date": "2024-08-24 03:00", "url": "https://pjmedia.com/kevindowneyjr/2024/08/23/revenge-of-the-kennedys-rfk-jr-takes-a-blowtorch-to-the-entire-system-n4931932", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "\"It had become the party of war, censorship, corruption, big pharma, big tech, big AG, and big money.\nHe spoke of \"DNC-aligned judges\" whose job was to throw Kennedy and \"other candidates off the ballot and to throw President Trump in jail.\"\nAnd President Trump says that he will reopen negotiations with President Putin and end the war overnight as soon as he becomes president.\"\nRobert F. Kennedy Jr.\nAddress to the Nation https://t.co/Wf4xt12GSX — Robert F. Kennedy Jr (@RobertKennedyJr) August 23, 2024FACT-O-RAMA!"}, {"id": "070df4e2-0ae5-4868-8a51-6a13f26290ec", "title": "Va . 7th race raises issues of residency , military service", "date": "2024-08-24 11:15", "url": "https://richmond.com/news/state-regional/government-politics/elections/virginia-7th-congress-derrick-anderson-eugene-vindman/article_6476807a-60b0-11ef-be52-6b1d0a5d7740.html", "domain": "richmond.com", "domain_classification": "Unknown", "message": "Virginia's 7th District Localities that make up the district: Caroline County, Culpeper County, Fredericksburg, Greene County, King George County, Madison County, Orange County, Spotsylvania County, Stafford County, the southeastern half of Prince William County, and a small portion of Albemarle County.\n\"It has to be the primary place of residence,\" said Tim Tangen, manager of tax relief for Fairfax County.\nWhen he first ran for the 7th District seat two years ago, he rented an apartment in the same area, but announced his candidacy from his house near Alexandria.\n\"None of them — from Afghanistan to Alexandria — mean quite as much to me as my home, Virginia’s 7th District.\"\n\"I think you really shoot yourself in the foot if you're not living in the district,\" he said on a Richmond radio show then."}, {"id": "a6307c97-a8c0-4025-a409-d667a8efaeac", "title": "The Nam : Broken Arrow Released ! news", "date": "2024-08-24 10:30", "url": "https://www.moddb.com/mods/the-nam-vietnam-combat-operations/news/the-nam-broken-arrow-released", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Well, the new Broken Arrow DLC for The Nam: Vietnam Combat Operations promises to make your games harder and bloodier.\nBroken Arrow was the Vietnam War code to scramble all remaining aircraft to save a US unit from immediate destruction.\nPosted by Tigeryan on Aug 24th, 2024Finally, after another three-year work hiatus (and several new visits to battlefields in Vietnam), here is BROKEN ARROW, a new update for The Nam: Vietnam Combat Operations!\nBROKEN ARROW is the third free DLC for The Nam: Vietnam Combat Operations, after The Nam: Wider War and The Nam: Tour of Duty.\nThere were over 1000 reported fragging incidents during the Vietnam War, with many more unreported cases."}, {"id": "fe9f47c8-5f91-402c-85d0-92a96be92c9f", "title": "Winning : Long Term Ukrainian Prospects", "date": "2024-08-24 08:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtwin%5Carticles%5C202408230529.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 23, 2024: The NATO alliance supporting Ukraine in its battle against Russian invaders believes that Ukrainian victory is inevitable.\nWhile Russia has nuclear weapons, so do several NATO members as in the Americans, Britain and France.\nWhile doing this Ukraine will continue to replace Soviet era Russian weapons and equipment and replace it with European or American items that NATO members use.\nRussian leader Vladimir Putin started the war and, so far, he refuses to acknowledge the possibility of defeat.\nNow that defeat is a reality, Putin is trying to improvise some reasonably convincing story about how Russia actually won."}, {"id": "c49390ea-ede0-4a9c-92ea-276fb6f6226c", "title": "2 Okinawan caves offer glimpse into deadly WWII battle", "date": "2024-08-24 08:30", "url": "https://okinawa.stripes.com/travel/2-okinawan-caves-offer-glimpse-into-deadly-wwii-battle.html", "domain": "okinawa.stripes.com", "domain_classification": "Unknown", "message": "()A short drive from Murasaki Mura are two caves with historical significance: Chibichiri Gama and Shimuku Gama.\nThese caves were used during World War II and now provide a glimpse into what happened in the early days of the Battle of Okinawa.\nAccording to an article by Okinawa Times, about 1,000 villagers took shelter in the cave like those in Chibichiri Gama.\nThings to know- Chibichiri Gama GPS Coordinates: N 26.405367, E 127.724061 - Shimuku Gama GPS Coordinates: N 26.402432, E 127.731280* Chibibichiri Gama has a parking space nearby.\nInside Shimuku Gama, it is advised to wear sports shoes and carry a flash light and gloves."}, {"id": "64afb21c-27bd-4166-ae0d-525fd65f52d9", "title": "Explained : What is happening in Ukraine east frontline as Putin forces advance ? ", "date": "2024-08-24 10:30", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-kursk-offensive-donetsk-pokrovsk-b2601225.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}Ukrainian forces are advancing through Russia’s Kursk region as part of their historic cross-border assault, concentrating their resources on this attack - but Moscow’s forces are doing the same in eastern Ukraine.\nSince 6 August, when Ukraine began its cross-border attack, Russian forces have advanced several miles towards the eastern Ukrainian city of Pokrovsk, in the Donetsk region.\nIts capture is seen as key to the Russian military prosecuting Vladimir Putin’s objective of taking the Donetsk and Luhansk regions in eastern Ukraine, known as Donbas.\nIt added that Russian forces had advanced near Novogrodivka , Zavitny and Ptychy – three towns also on the southern edge of Moscow’s push towards Pokrovsk.\nMeanwhile, Russia’s takeover of parts of eastern Ukraine is material, and it could prove more fatal."}, {"id": "63d2fe2e-8b1f-4042-b02b-aa0ad73e8151", "title": "The F - 14 Tomcat Had One Ability The U . S . Navy Cant Get Back", "date": "2024-08-24 14:00", "url": "https://nationalinterest.org/blog/buzz/f-14-tomcat-had-one-ability-us-navy-cant-get-back-212449", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The Grumman F-14 Tomcat was more than just a speed demon; its impressive range and versatile capabilities made it the U.S. Navy's premier warplane.\nWhile the film is memorable for catapulting Tom Cruise’s career, the real star was the Grumman F-14 Tomcat.\nNot only was it a movie star, but the F-14 Tomcat was a war hero.\nThe F-14 Tomcat is likely the best Navy warplane ever designed.\nNothing Quite Like It TodayThe Navy toyed with purchasing a proposed follow-on aircraft to the F-14, the F-21 Super Tomcat."}, {"id": "54980978-3937-4864-92c0-93f6c3d93c15", "title": "New wave of cholera in Sudan threatens hundreds of thousands of refugees", "date": "2024-08-24 08:15", "url": "https://www.africanews.com/2024/08/24/new-wave-of-cholera-in-sudan-threatens-hundreds-of-thousands-of-refugees/", "domain": "africanews.com", "domain_classification": "Unknown", "message": "Sudan has been hit by a deadly cholera outbreak that has infected hundreds of people in recent weeks, health authorities said.\nThe UN Refugee Agency (UNHCR) reported that the spread of the disease is of particular concern in states hosting refugees - mainly Kassala, Gedaref, and Jazirah states.\nCholera is a fast-developing, highly contagious infection that causes diarrhea, leading to severe dehydration and possible death within hours when not treated, according to the WHO.\nThe cholera outbreak is the latest calamity for Sudan, which was plunged into chaos in April last year when simmering tensions between the military and a powerful paramilitary group exploded into open warfare across the country.\nMore than 10.7 million people have been forced to flee their homes since fighting began, according to the International Organization for Migration."}, {"id": "42c5e9fa-738c-453e-b08e-10b20f71c432", "title": "Sunaina Roshan opens up on Hrithik Roshan divorce and dad Rakesh Roshan cancer diagnosis : We are fighters | Hindi Movie News", "date": "2024-08-24 12:45", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sunaina-roshan-opens-up-on-hrithik-roshans-divorce-and-dad-rakesh-roshans-cancer-diagnosis-we-are-fighters/articleshow/112763637.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Hrithik Roshan and his sister Sunaina Roshan have always shared a close bond.\nSunaina shared that their strong family bond and inner strength help them face challenges together.\nSunaina Roshan also discussed her battle with cancer, emphasizing that she faced it with courage and refused to see herself as a victim.\nSunaina captioned the celebration as, \"My brother has always been there for me, a companion through the highs and lows of life.\n\"On the work front, Hrithik will be next seen in 'War 2', the sequel to 'War'."}, {"id": "03e759c0-bb69-476f-9a80-4b2a70138b59", "title": "Millions of Shiite Muslim pilgrims head to Iraq Karbala to mark the death of Imam Hussein", "date": "2024-08-24 11:15", "url": "https://kvia.com/news/2024/08/24/millions-of-shiite-muslim-pilgrims-head-to-iraqs-karbala-to-mark-the-death-of-imam-hussein/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "KARBALA, Iraq (AP) — Millions of Shiite Muslims have packed the streets of the Iraqi city of Karbala on their annual pilgrim to mark the death of Prophet Muhammad’s grandson, Hussein who became a symbol of resistance when he refused to pledge allegiance to the Umayyad caliphate, leading to his death in battle during the tumultuous first century of Islam’s history, and exacerbating the schism between Islam’s two main sects, Sunni and Shiite.\nThis year, the pilgrimage was shrouded with sadness over the war in Gaza and worries it may expand into a regional conflict with tensions spiking between Israel and Iran.\nKVIA ABC 7 is committed to providing a forum for civil and constructive conversation.\nPlease keep your comments respectful and relevant.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "e7ab3f12-2e1d-4be1-beb1-26db7579f1d4", "title": "Hamas negotiators in Cairo as Gaza conditions worsen under Israeli campaign", "date": "2024-08-24 13:00", "url": "https://www.yahoo.com/news/hamas-negotiators-cairo-gaza-conditions-123000161.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli military strikes in Gaza killed 50 people on Saturday, Palestinian health authorities said.\nHamas has accused Israel of going back on things it had previously agreed to in the talks, which Israel denies.\nIn Israel, Prime Minister Benjamin Netanyahu has locked horns with Israeli ceasefire negotiators over whether Israeli troops must remain all along the border between Gaza and Egypt, a person with knowledge of the talks said.\nA Palestinian official familiar with mediation efforts said it was too soon to predict the outcome of talks.\nIsrael's Gaza campaign has killed more than 40,000 people, Palestinian health authorities say."}, {"id": "8bb1189a-6c17-4a35-896a-5da0429a5e95", "title": "Hamas delegation arrives in Egypt to discuss Gaza ceasefire developments", "date": "2024-08-24 14:15", "url": "https://www.irishtimes.com/world/middle-east/2024/08/24/israel-hamas-war-gaza-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "More than 40,000 people have been killed in Gaza since the start of the war.\nIsraeli military strikes across Gaza killed 50 people on Saturday, Palestinian health authorities said.\nHamas has accused Israel of going back on things it had previously agreed to in the talks, which Israel denies.\nIn Israel, prime minister Binyamin Netanyahu has locked horns with Israeli ceasefire negotiators over whether Israeli troops must remain all along the border between Gaza and Egypt, a person with knowledge of the talks said.\nIsrael’s Gaza campaign has killed more than 40,000 people, Palestinian health authorities say."}, {"id": "a14baa95-9765-417b-8383-b5896c1c983a", "title": "Hamas negotiators in Cairo as Gaza conditions worsen under Israeli campaign", "date": "2024-08-24 14:00", "url": "https://www.marketscreener.com/quote/index/FTSE-EGYPT-INDEX-121232409/news/Hamas-negotiators-in-Cairo-as-Gaza-conditions-worsen-under-Israeli-campaign-47727353/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Israeli military strikes across Gaza killed 50 people on Saturday, Palestinian health authorities said.\nIsraeli negotiators were in Cairo on Thursday to meet mediators from the United States, which has presented a \"bridging proposal\" aimed at resolving continued disputes, focused on Israel's presence in strategic areas of Gaza.\nHamas has accused Israel of going back on things it had previously agreed to in the talks, which Israel denies.\nIn Israel, Prime Minister Benjamin Netanyahu has locked horns with Israeli ceasefire negotiators over whether Israeli troops must remain all along the border between Gaza and Egypt, a person with knowledge of the talks said.\nIsrael's Gaza campaign has killed more than 40,000 people, Palestinian health authorities say."}, {"id": "ed2ad8fc-d501-473e-ab22-961b1f1ea732", "title": "New book tells story of K - 9 World War II hero from Wisconsin", "date": "2024-08-24 03:30", "url": "https://www.tmj4.com/news/state-capitol/new-book-tells-story-of-k-9-world-war-ii-hero-from-wisconsin", "domain": "tmj4.com", "domain_classification": "Unknown", "message": "MADISON, Wis. — Families and their dogs took to downtown Madison on Thursday to celebrate the story of a K-9 World War II hero from Wisconsin.\n‘Brownie the War Dog,’ a new book from the Wisconsin Historical Society Press, tells the tale of Oren Kendley and his dog Brownie.\nHarm Venhuizen Attendees listen to author Kelly Nelson reading her new book, 'Brownie the War Dog.'\nHer subsequent research led her to the Wisconsin Veterans Museum and Joan Yohr, Kendley’s niece, who had kept close records of the family’s history.\nHarm Venhuizen Author Kelly Nelson signs a copy of 'Brownie the War Dog.'"}, {"id": "8ee2b414-d4a2-4c8f-99be-8e529c7cdf41", "title": "Sabotage Confirmed At Norwegian Air Base", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/sabotage-confirmed-norwegian-air-232318518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Norway has revealed that one of its most strategic air bases has been the target of sabotage.\nSuspected sabotage against Air Force Base in Northern Norway.\nIt is one of two Royal Norwegian Air Force (RNoAF) bases hosting permanent F-35A stealth fighter units and it is also receiving the service’s fleet of P-8A maritime patrol aircraft.\nF-35As from 332 Squadron of the Royal Norwegian Air Force (RNoAF).\nOperations continue as planned.”Roughly, 24 hours later, in another post on X, NATO said: “The security level at NATO air base Geilenkirchen has returned to Bravo."}, {"id": "e80c783a-3b93-4472-ad5a-8db86781c5a7", "title": "German Chancellor Scholz assures Kiev of undiminished war support", "date": "2024-08-24 10:30", "url": "https://www.wsws.org/en/articles/2024/08/24/b1bb-a24.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The state visit by German Chancellor Olaf Scholz (Social Democrats, SPD) to the Republic of Moldova was dominated by the escalation of the NATO war against Russia.\nGerman Chancellor Olaf Scholz, left, listens to Moldova's President Maia Sandu, right, during a press conference at the Presidential Palace in Chisinau, Moldova, Wednesday, Aug. 21, 2024.\nWe will support Ukraine for as long as necessary, and we will be Ukraine's biggest national supporter in Europe.”The “debate” over an alleged cut in funds, which international media outlets took note of, was always aimed at expanding war support for Ukraine.\nA possible end to German aid or arms supplies for Ukraine, which a large part of the population would support, was never considered.\nEven more clearly than the Chancellor, Freuding underlined that Berlin would massively expand its war support for Ukraine."}, {"id": "1aab7e95-88e5-4157-bd97-08834c57b36b", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/kyiv-incursion-russia-sends-defiant-040002651.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "fdd4ae49-9d4b-41eb-95ff-d824a6848c23", "title": "A traveller guide to 24 hours in Nagaland capital , Kohima", "date": "2024-08-24 06:15", "url": "https://yourstory.com:443/ys-life/a-travellers-guide-to-24-hours-in-nagalands-capita", "domain": "yourstory.com", "domain_classification": "Unknown", "message": "The real gem was Kohima, much known for its annual Hornbill festival that showcases the rich culture of diverse ethnicities in the state.\nThe two-hour road trip is a precursor to the beauty you are set to experience in Kohima.\nWhile 24 hours may seem a tad less to explore the city, there’s still a lot you can pack in without trying hard.\nFrom a visit to the War Memorial to the Cathedral of Kohima, and the Kisama Heritage Village—there’s much to see.\nKohima war cemeteryThe Kohima war cemetery has nearly lined gravestones and memorials, serving as a reminder of the valour of soldiers who lost their lives in the Battle of KohimaLocated on Garrison Hill, the Kohima war cemetery is believed to have been built in the tennis court of the then-deputy commissioner’s residence."}, {"id": "76a8d986-136e-4b2b-ac99-1c495c0e061e", "title": "Ammunition storage point on fire and exploding in Russia Voronezh Oblast", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/ammunition-storage-point-fire-exploding-013640983.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ammunition depot on fire and exploding in Russia's Voronezh OblastAlexander Gusev, Governor of Russia's Voronezh Oblast, has claimed that the region has been attacked by drones, resulting in the detonation of explosive objects.\nSource: Gusev on Telegram; АstraQuote from Gusev: \"Air defence and electronic warfare systems destroyed and jammed several UAVs in Voronezh Oblast.\nAs a result of falling wreckage, a fire started, which caused the detonation of explosive objects.\nDetails: Earlier, Gusev had reported about a supposedly downed UAV, a fire and one injured person.\nUpdated: The Astra Telegram channel reported that an ammunition depot in the town of Ostrogozhsk in Voronezh Oblast was on fire and explosions had been heard."}, {"id": "99e84c9d-d270-4134-bee9-696c22226245", "title": "The week in classical : Prom 37 : Britten War Requiem ; The Turn of the Screw – review | Classical music", "date": "2024-08-24 12:30", "url": "https://www.theguardian.com/music/article/2024/aug/24/the-week-in-classical-prom-37-britten-war-requiem-review-royal-albert-hall-lso-pappano-the-turn-of-the-screw-waterperry-opera-festival-oxfordshire", "domain": "theguardian.com", "domain_classification": "International", "message": "In the drowsy dog days of mid-August, we can almost forget that the Proms are finite: now, just three weeks left.\nThe War Requiem (1962) was first heard at the Proms a year after its composition.\nView image in fullscreen ‘Enormous forces’: Britten’s War Requiem at the Proms.\nView image in fullscreen ‘Deft physicality’: Charlotte Bowden (Governess), Ivo Clark (Miles) and Robin Bailey (Quint) in The Turn of the Screw.\nProm 37: Britten’s War Requiem ★★★★★The Turn of the Screw ★★★★Prom 37: Britten’s War Requiem is available on BBC Sounds and BBC iPlayer."}, {"id": "0d7fed7b-7392-4d16-9d59-7c68671d088c", "title": "US says it killed senior militant group leader in Syria", "date": "2024-08-24 02:00", "url": "https://www.businesstimes.com.sg/international/us-says-it-killed-senior-militant-group-leader-syria", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "AMERICAN forces killed a senior leader of an Al-Qaeda-affiliated militant group in a strike in Syria on Friday (Aug 23), the US military said.\nThe strike targeted Abu Abdul Rahman al-Makki, who was “a Hurras al-Din Shura Council member and senior leader responsible for overseeing terrorist operations from Syria,” the US Central Command (Centcom) said in a social media post.\n“Hurras al-Din is an Al-Qaeda-associated force based in Syria that shares Al-Qaeda’s global aspirations to conduct attacks against US and Western interests,” Centcom said.\nThe US military has around 900 troops in Syria as part of the international coalition against the Islamic State group.\nThe coalition was established in 2014 to help combat the jihadists, who had taken over vast swathes of Iraq and Syria."}, {"id": "5cd6318b-ba9c-4a2a-826e-24b087d30121", "title": "The US is sending $125 million in new military aid to Ukraine | News , Sports , Jobs", "date": "2024-08-24 08:15", "url": "https://www.marshallindependent.com/news/national-news-apwire/2024/08/the-us-is-sending-125-million-in-new-military-aid-to-ukraine/", "domain": "marshallindependent.com", "domain_classification": "Unknown", "message": "WASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv’s incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nThe latest package of aid includes air defense missiles, munitions for High Mobility Artillery Rocket Systems (HIMARS), Javelins and an array of other anti-armor missiles, counter-drone and counter-electronic warfare systems and equipment, 155mm and 105mm artillery ammunition, vehicles and other equipment.\nThe formal announcement came on Friday, which is the eve of Ukraine’s Independence Day."}, {"id": "46a8d01e-d6b5-41ab-8b91-617a62c73483", "title": "US says it killed senior militant group leader in Syria", "date": "2024-08-24 14:00", "url": "https://gulfnews.com/world/mena/us-says-it-killed-senior-militant-group-leader-in-syria-1.1724502590791", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "This website stores cookies on your computer.\nThese cookies are used to improve your experience and provide more personalized service to you.\nBoth on your website and other media.\nTo find out more about the cookies and data we use, please check out our Privacy Policy"}, {"id": "cc153541-6311-4734-b343-92890c4eebfc", "title": "MARKET REPORT : Melrose shares tumble after double downgrade", "date": "2024-08-24 01:45", "url": "https://www.dailymail.co.uk/money/markets/article-13773949/MARKET-REPORT-Melrose-shares-tumble-double-downgrade.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Nearly £500million was wiped off the value of Melrose following a double downgrade.\nMelrose shares fell 7.1 per cent, or 36.3p, to 474.7p, reducing its value by £471million.\nWhile most analysts reckon the stock is worth buying, UBS broke ranks by advising clients to sell shares in the owner of the GKN aerospace business.\nDowngrade: Melrose fell 7.1 per cent, or 36.3p, to 474.7p, reducing its value by £471mThe bank said one of the FTSE 100 group's biggest sources of revenue is overvalued.\nMelrose bought GKN, which made cannonballs used at the Battle of Waterloo and Spitfires for the Battle of Britain, for £8billion in a controversial deal in 2018."}, {"id": "1bf7ef9b-7ee3-4a6a-82dc-90834d6dccb0", "title": "Russia second front : How Europe can prepare against hybrid warfare", "date": "2024-08-24 06:15", "url": "https://www.euronews.com/2024/08/24/russias-second-front-how-europe-can-prepare-against-hybrid-warfare", "domain": "euronews.com", "domain_classification": "Unknown", "message": "Experts warn that politicians need to take Russia's so-called \"hybrid war'' more seriously and populations should be better prepared.\nDifficult to define, features of what experts have called Russia's \"hybrid war\" include everything that does not involve direct military confrontation.\nOne example of Russia's hybrid warfare is the uncovered plot to assassinate the CEO of Rheinmetall, a German automotive and arms manufacturer based in Dusseldorf earlier this month.\nRussia's war against Ukraine makes headlines every day: Soldier on the front line in the Zaporizhzhia region, Ukraine, August 2024.\nThe threat of online fake newsExperts say Russia's hybrid war is made up of several strategies: hacking, attacks on individuals or disinformation and fake news."}, {"id": "3a4b5dfb-61bd-4a8a-b37c-05c2220f7fa8", "title": "US Military Says It Killed Leader Of Al Qaeda - Aligned Group In Syria", "date": "2024-08-24 02:15", "url": "https://www.ndtv.com/world-news/us-military-says-it-killed-leader-of-al-qaeda-aligned-group-in-syria-6405103", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The U.S. military said it carried out a strike in Syria on Friday.\nAmerican forces killed a senior leader of an Al-Qaeda-affiliated militant group in a strike in Syria on Friday, the US military said.\nThe strike targeted Abu Abdul Rahman al-Makki, who was \"a Hurras al-Din Shura Council member and senior leader responsible for overseeing terrorist operations from Syria,\" the US Central Command (CENTCOM) said in a social media post.\nThe US military has around 900 troops in Syria as part of the international coalition against the Islamic State group.\nThe coalition was established in 2014 to help combat the jihadists, who had taken over vast swathes of Iraq and Syria."}, {"id": "2ee29168-d19f-471d-a082-796e5d8ad0a7", "title": "US govt approves sale of anti - submarine warfare sonobuoys to India for  hunter - killer  helicopters | India News", "date": "2024-08-24 06:00", "url": "https://timesofindia.indiatimes.com/india/us-govt-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india-for-hunter-killer-helicopters/articleshow/112756004.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: The US government has approved a proposed sale to India of anti-submarine warfare (ASW) sonobuoys and related equipment worth around $52.8 million (Rs 443 crore) for the multi-mission MH-60R Seahawk helicopters being inducted by the Indian Navy .The Biden administration’s notification to the US Congress on Friday said the proposed sale will support Washington’s foreign policy and national security objectives by helping to strengthen the bilateral strategic relationship and improving the security of a major defence partner, India, which “continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions”.The proposed sale will improve India’s capability “to meet current and future threats” by enhancing its capacity to conduct ASW operations from its MH-60R helicopters, the notification said.The Navy in March this year had commissioned its first squadron of six submarine-hunting MH-60R Seahawk helicopters, armed with Hellfire missiles, MK-54 torpedoes and precision-kill rockets, at INS Garuda in Kochi, as was then reported by TOI.By next year, India is slated to induct 24 heavy-duty Seahawks, which are also equipped with multi-mode radars and night-vision devices, under the Rs 15,157 crore ($2.13 billion) contract inked with the US in February 2020.The notification said the Indian government has requested to buy AN/SSQ-53G high-altitude ASW sonobuoys, AN/SSQ-62F HAASW sonobuoys and AN/SSQ-36 sonobuoys as well as engineering, technical and logistics support.\n“The proposed sale of this equipment and support will not alter the basic military balance in the region,” it said.Navy officers say the induction of Seahawks, which operate from decks of aircraft carriers and other frontline warships, represents a “significant capability jump” in detecting and destroying enemy submarines prowling in the Indian Ocean Region (IOR).The choppers can also be used for anti-ship strikes, over the horizon network-centric operations and electronic warfare missions, search and rescue, medical evacuation and vertical replenishment.“The advanced weapons, sensors and avionics suite make the Seahawks ideal for our maritime security needs, offering enhanced capabilities for both conventional as well as asymmetric threats.\nThey will enhance India’s blue-water capabilities, extend the operational reach and support sustained naval operations across spectrums,” an officer said.The new helicopters are crucial because the 140-warship Navy is currently grappling with just a handful of old ASW helicopters like Kamov-28s and Sea Kings, at a time when the presence of Chinese nuclear and diesel-electric submarines is only going to further increase in the IOR in the coming years.ASW choppers typically fly ahead of warships to “dunk” their sonobuoys into deep waters, “ping” for enemy submarines, and then fire missiles, torpedoes and depth charges to clear the path for the fleet during hostilities.After the first 24 MH-60Rs, the Navy has projected a long-term requirement for another 123 naval multi-role helicopters (NMRHs).\nThe MH-60Rs are a replacement for the older Sea King 42/42A helicopters that were retired in the 1990s.\nThe case for the 24 choppers, incidentally, began way back in 2005."}, {"id": "289cdd4e-f083-444b-a521-2472fa3ad7d9", "title": "Warplanes : More F - 35s Mean More F - 16s For Ukraine", "date": "2024-08-24 08:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairfo%5Carticles%5C202408230636.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "Most of the Russian-made MiG and Sukhoi aircraft Ukraine had in before the invasion are gone.\nWhat Ukraine wanted was F-16s, the most widely used jet fighter in the world since the Cold War ended.\nNow Ukraine has received the first of over a hundred F-16s and is using them against Russia’s declining air power.\nA growing number of Ukrainian pilots have been trained to operate F-16s and deliveries to Ukraine began in the last few months.\nThe Ukraine War that began in early 2022 was often a desperate battle for Ukrainians."}, {"id": "5c4038c5-bf9b-4330-a31f-d0b2cb95f3c2", "title": "EU review does not recommend sending military trainers to Ukraine for now , media report says", "date": "2024-08-24 08:30", "url": "https://economictimes.indiatimes.com/news/defence/eu-review-does-not-recommend-sending-military-trainers-to-ukraine-for-now-media-report-says/articleshow/112758860.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe EU's diplomatic service has called on member states to better adapt a military training mission for Ukraine to Kyiv 's needs but stopped short of recommending the bloc send military instructors to the war-torn country, German weekly Welt am Sonntag reported on Saturday.The EUMAM mission , launched in November 2022, has trained some 60,000 Ukrainian troops mainly in Poland and Germany and is set to be extended by another two years once the current mandate runs out in mid-November.\n\"It is highly likely that an EU military presence on Ukrainian soil would be perceived by Russia as a provocation,\" the review said.\n\"The fact that Russia can reach every location in Ukraine with their ballistic and UAV (drone) assets contributes to the highest level of threat for deployed EU military personnel.\n\"The review raised the need to be able to evacuate EU troops in an emergency and the logistical effort involved in offering instructors fortified housing and training sites, while saying that some protective measures, such as against long-range air threats, were not achievable.\n\"Should the necessary political and operational conditions be met, the deployment of EU military personnel on Ukrainian soil is feasible,\" the document concluded, adding further analysis would be needed to fully assess the risks and advantages.However, the review did recommend that the EU establish a coordination cell in Kyiv and explore possibilities to conduct training closer to Ukraine's borders while also training more Ukrainian instructors."}, {"id": "42af4b21-3428-4566-ab16-19e55f0ebc8b", "title": "Millions of Shiite Muslim pilgrims head to Iraq Karbala to mark the death of Imam Hussein", "date": "2024-08-24 11:15", "url": "https://apnews.com/article/iraq-arbaeen-pilgrimage-shiite-karbala-hussein-eeaf40a865e9ccd3f9698506344cea84", "domain": "apnews.com", "domain_classification": "International", "message": "Tahseen Al-Khafaji, head of the Iraqi security media cell, said that more than 3 million pilgrims had entered the country as of Friday, amid tight security measures.\nHussein’s death exacerbated the schism between Islam’s two main sects, Sunni and Shiite.\nOn Saturday, the rhythmic sound of pilgrims pounding their chests and heads as they circled the Imam Hussein Shrine filled the air.\n“Everything we offer is to commemorate and serve our Master (Hussein),” said Hussein Ali, a volunteer in Baghdad.\n—Associated Press writer Mohammed Khairullah in Diyala, Iraq and Ali Abdul Hassan in Baghdad contributed to this report."}, {"id": "61918705-1bd6-4baa-98c2-8ec030d9730f", "title": "  These guys changed the course of history  ", "date": "2024-08-24 05:00", "url": "https://www.news5cleveland.com/news/local-news/these-guys-changed-the-course-of-history-local-tuskegee-airman-receives-statue", "domain": "news5cleveland.com", "domain_classification": "Unknown", "message": "PORT CLINTON, Ohio — It's been nearly 80 years since the first Black military airmen, also known as the Tuskegee Airmen, fought in World War II.\nAnd to keep their legacy alive, the Liberty Aviation Museum in Port Clinton honored local Tuskegee Airman Dr. Harold Brown with a statue.\nDuring World War II, Brown flew 30 missions with the Tuskegee Airmen and served in the Korean War.\nEducation brought him the Port Clinton area, and he kind of adopted this museum as well.\nBrown settled in Port Clinton with Bordner, and they published a book called \"Keep Your Airspeed Up: The Story of a Tuskegee Airman\" in 2017."}, {"id": "4695b4aa-4571-4b0e-be0a-25328e5ee588", "title": "EU review does not recommend sending military trainers to Ukraine for now , media report says", "date": "2024-08-24 09:45", "url": "https://www.swissinfo.ch/eng/eu-review-does-not-recommend-sending-military-trainers-to-ukraine-for-now,-media-report-says/87431842", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "EU review does not recommend sending military trainers to Ukraine for now, media report saysreuters_tickers3 minutesBERLIN(Reuters) – The EU’s diplomatic service has called on member states to better adapt a military training mission for Ukraine to Kyiv’s needs but stopped short of recommending the bloc send military instructors to the war-torn country, German weekly Welt am Sonntag reported on Saturday.\nThe EU did not immediately respond to a request for comment on the review, which has also been seen by Reuters.\n“It is highly likely that an EU military presence on Ukrainian soil would be perceived by Russia as a provocation,” the review said.\n“Should the necessary political and operational conditions be met, the deployment of EU military personnel on Ukrainian soil is feasible,” the document concluded, adding further analysis would be needed to fully assess the risks and advantages.\nHowever, the review did recommend that the EU establish a coordination cell in Kyiv and explore possibilities to conduct training closer to Ukraine’s borders while also training more Ukrainian instructors."}, {"id": "eaac4239-9c7f-477d-8f68-3c7f736d34b7", "title": "Karbala pilgrimage : Millions of Shiite Muslims mark the death of Imam Hussein", "date": "2024-08-24 12:30", "url": "https://www.ctvnews.ca/world/millions-of-shiite-muslim-pilgrims-head-to-iraq-s-karbala-to-mark-the-death-of-imam-hussein-1.7012963", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Tahseen Al-Khafaji, head of the Iraqi security media cell, said that more than three million pilgrims had entered the country as of Friday, amid tight security measures.\nHussein's death exacerbated the schism between Islam’s two main sects, Sunni and Shiite.\nOn Saturday, the rhythmic sound of pilgrims pounding their chests and heads as they circled the Imam Hussein Shrine filled the air.\n\"Everything we offer is to commemorate and serve our Master (Hussein),” said Hussein Ali, a volunteer in Baghdad.\nAssociated Press writer Mohammed Khairullah in Diyala, Iraq and Ali Abdul Hassan in Baghdad contributed to this report."}, {"id": "4466f53a-0b6c-4826-8af0-c8d7f2a45f12", "title": "Gov . Evers Orders Flags to Half - Staff in Honor of Sergeant Jack Hohlfeld Who Lost His Life in World War II", "date": "2024-08-24 00:00", "url": "https://urbanmilwaukee.com/pressrelease/gov-evers-orders-flags-to-half-staff-in-honor-of-sergeant-jack-hohlfeld-who-lost-his-life-in-world-war-ii/", "domain": "urbanmilwaukee.com", "domain_classification": "Unknown", "message": "“Sergeant Jack Hohlfeld was a decorated military hero who selflessly answered the call to serve and gave his life defending the values and freedoms we as a nation hold most dear,” said Gov.\nOn Dec. 8, 1941, Sergeant Hohlfeld and members of the 24th Pursuit Group were engaged in combat and were soon overtaken by Japanese forces and forced to surrender as prisoners of war.\nSergeant Hohlfeld will be buried on Mon., Aug. 26, 2024, in La Crosse.\nNOTE: This press release was submitted to Urban Milwaukee and was not written by an Urban Milwaukee writer.\nWhile it is believed to be reliable, Urban Milwaukee does not guarantee its accuracy or completeness."}, {"id": "4dbb3d1e-e02f-4498-af0e-ebedae643cfa", "title": "Putin  feeding troops into a wood chipper  as Russia reels from Kursk  humiliation  | World | News", "date": "2024-08-24 07:00", "url": "https://www.express.co.uk/news/world/1939819/vladimir-putin-russia-ukraine-kursk", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin's Russia is struggling to respond after the Kursk incursionVladimir Putin is continuing to \"feed soldiers into the wood chipper” with Ukraine’s audacious Kursk operation amounting to a “humiliation” for the Russian President, former US National Security Advisor John Bolton has said.\nMr Bolton was speaking after a surprise incursion by Volodymyr Zelensky’s soldiers on August 6 saw Ukraine seize large chunks of Russian territory, leaving Putin furious.\nAnd Mr Bolton, speaking during a webinar organised by the Foreign Press Association, said the events of the last few days amounted to a “humiliation” for the Kremlin and Putin himself.\nIn answer to a question by Express.co.uk, Mr Bolton, who spent 18 months working alongside then-President Donald Trump between 2018 and 2019, said: “You think Russia can't get worse in its military performance, and it does what.\nRussian citizens in Kursk being evacuated from border settlements to safe areasTrending"}, {"id": "5d8f6ba9-e7d9-4559-a173-9a0606dcf39a", "title": "COD : Modern Warfare 3 Details Leaked !! ", "date": "2024-08-24 03:00", "url": "https://www.thfire.com/entertainment/cod-modern-warfare-3-details-leaked-11793", "domain": "thfire.com", "domain_classification": "Unknown", "message": "Call of Duty: Modern Warfare 3 the most awaited game of the year and is set to be released on Nov 8th 2011 now has some details leaked.\nThese leaked details offers you some sneak-peak of the way the game is going to work and some interesting pictures!\nHere’s what we know: Modern Warfare 3 will span the globe, much like the previous game.\nModern Warfare 3 will also reportedly tie up a number of loose ends from the previous two games that left players hanging, and pick up almost immediately after the cliffhanger ending of Modern Warfare 2.\nMultiplayer also makes a strong comeback in Modern Warfare 3, and even includes new game types and tons of new maps in addition to some of the older, more familiar multiplayer modes."}, {"id": "21d03211-ab82-40b4-b8cb-22ba51eb067d", "title": "Bakeru review : Mystical raccoon dog , starring Not - Goemon", "date": "2024-08-24 04:45", "url": "https://www.shacknews.com/article/141089/bakeru-review-score", "domain": "shacknews.com", "domain_classification": "Unknown", "message": "When I was a kid, one of my favorite Nintendo 64 games was Mystical Ninja Starring Goemon.\nWhile Good-Feel made a name for itself developing kid-friendly games for Nintendo (Kirby’s Epic Yarn and Princess Peach: Showtime!\nThe twist here is Bakeru is actually a feisty little tanuki, a mythological creature that’s a cross between a raccoon and a dog.\nI don’t love Bakeru like I love Mystical Ninja Starring Goemon, and that’s okay.\nThat’s what it feels like Bakeru is aiming for, and I think it hits that target cleanly."}, {"id": "29df5946-3b3f-4e31-9f62-dd226b5b0732", "title": "Switch eShop charts - August 24 , 2024", "date": "2024-08-24 10:30", "url": "https://nintendoeverything.com/switch-eshop-charts-august-24-2024/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "The latest Switch eShop charts for the week of August 24, 2024 are as follows:All Games1.\nSuper Mario Bros. Wonder13.\nThank Goodness You’re Here15.\nArcade Archives Vs. Super Mario Bros.24.\nDoom + Doom II27."}, {"id": "39de5b9e-f9db-48fc-bce7-0f60df26fad4", "title": "The Bachelor : How a double amputee became Ukraine most desirable man", "date": "2024-08-24 02:15", "url": "https://www.bbc.co.uk/news/articles/clywj08d89no", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Oleksandr is always on the go, telling me he spent the previous night filming a music video.\nIn the years before Russia's full-scale invasion, he was working as a barista in a Kyiv restaurant while studying graphic design.\nThe city was liberated by Kyiv just a month after Oleksandr was seriously injured while defending the nearby Ukrainian position.\nI felt a terrible pain in my legs and realised that it would mean the amputation of my legs,\" he said.\nAt the time, authorities said they had found more than 400 bodies in graves near the city."}, {"id": "986197dc-74ea-4bdb-9e7a-51228badfc2d", "title": "Ukraine president signs law banning Russia - linked religious groups", "date": "2024-08-24 12:00", "url": "https://us.cnn.com/2024/08/24/europe/ukraine-zelensky-orthodox-church-ban-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "President Volodymr Zelensky signed into law a bill banning religious groups with ties to Russia Saturday, Ukraine’s Independence Day.\nThe bill’s main target is the Ukrainian Orthodox Church (UOC) which has historically been linked to the Russian Orthodox Church, also known as the Moscow Patriarchate.\nThe law passed Ukraine’s parliament on August 20, with 265 lawmakers voting for and 29 voting against.\nBut with Russia’s annexation of Crimea in 2014, Ukraine’s Orthodox churches split.\nIn particular, 63% believe that Ukrainian Orthodox Church should be completely banned in Ukraine."}, {"id": "cf6c9ffd-bf2a-4074-aea2-5fac7ac8020d", "title": "Ukraine president signs law banning Russia - linked religious groups", "date": "2024-08-24 11:30", "url": "https://edition.cnn.com/2024/08/24/europe/ukraine-zelensky-orthodox-church-ban-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "President Volodymr Zelensky signed into law a bill banning religious groups with ties to Russia Saturday, Ukraine’s Independence Day.\nThe bill’s main target is the Ukrainian Orthodox Church (UOC) which has historically been linked to the Russian Orthodox Church, also known as the Moscow Patriarchate.\nThe law passed Ukraine’s parliament on August 20, with 265 lawmakers voting for and 29 voting against.\nBut with Russia’s annexation of Crimea in 2014, Ukraine’s Orthodox churches split.\nIn particular, 63% believe that Ukrainian Orthodox Church should be completely banned in Ukraine."}, {"id": "285c93e8-477d-4a81-8cbe-4ccb43b558dc", "title": "Ukraine president signs law banning Russia - linked religious groups", "date": "2024-08-24 11:15", "url": "https://www.aol.com/ukraine-president-signs-law-banning-090852261.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "President Volodymr Zelensky signed into law a bill banning religious groups with ties to Russia Saturday, Ukraine’s Independence Day.\nThe bill’s main target is the Ukrainian Orthodox Church (UOC) which has historically been linked to the Russian Orthodox Church, also known as the Moscow Patriarchate.\nThe law passed Ukraine’s parliament on August 20, with 265 lawmakers voting for and 29 voting against.\nBut with Russia’s annexation of Crimea in 2014, Ukraine’s Orthodox churches split.\nIn particular, 63% believe that Ukrainian Orthodox Church should be completely banned in Ukraine."}, {"id": "4528d411-3dd2-4cff-bbec-05bb4e098555", "title": "Harris has to say little about oil and gas these days . Experts explain why . ", "date": "2024-08-24 12:00", "url": "https://finance.yahoo.com/news/harris-has-to-say-little-about-oil-and-gas-these-days-experts-explain-why-113501348.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris hasn't said much about her position on oil and gas since becoming the presumptive, and now official, Democratic nominee for president.\nDemocratic presidential nominee Vice President Kamala Harris speaks during the Democratic National Convention Thursday, Aug. 22, 2024, in Chicago.\nBiden has long downplayed the good times for oil companies during his administration, choosing to focus instead on his green energy efforts.\nDespite tapping the Strategic Petroleum Reserve to combat high gas prices in 2021, prices haven't retreated all the way to pre-pandemic levels.\nThat's part of the reason why green energy supporters don't believe Harris will try to curtail oil production."}, {"id": "9715869a-f532-4fbc-9865-ebf6ff9fc44c", "title": "Navy to Commission Future Littoral Combat Ship Kingsville", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240823-usn02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Navy to Commission Future Littoral Combat Ship KingsvilleUS Navy23 August 2024From Commander, Naval Surface Forces, PacificIndependence-variant littoral combat ship USS Kingsville (LCS 36) will be commissioned, Saturday, August 24, 2024, at 10:00 a.m. CDT in Corpus Christi, Texas.\nKingsville is the 18th Independence-variant littoral combat ship (LCS) commissioned in the United States Navy, and the first U.S. Navy ship to bear this namesake.\nUSS Kingsville highlights not only the city of Kingsville and Naval Air Station Kingsville but also shows the efforts of two communities working together.\nLittoral combat ships are fast, optimally manned, mission-tailored surface combatants that operate in near-shore and open-ocean environments, winning against 21st-century coastal threats.\nMore information on the littoral combat ship program can be found at: https://www.navy.mil/Resources/Fact-Files/Display-FactFiles/Article/2171607/littoral-combat-ship-class-lcs/NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "c16de234-e5d2-4361-a160-5ce180af018a", "title": "Millions of Shiite Muslim pilgrims head to Iraq Karbala to mark the death of Imam Hussein – Winnipeg Free Press", "date": "2024-08-24 10:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/faith/2024/08/24/millions-of-shiite-muslim-pilgrims-head-to-iraqs-karbala-to-mark-the-death-of-imam-hussein", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "KARBALA, Iraq (AP) — Millions of Shiite Muslims packed the streets of the Iraqi city of Karbala Saturday on their annual pilgrim to mark the death of Prophet Muhammad’s grandson, Hussein, who became a symbol of resistance during the tumultuous first century of Islam’s history.\n(AP Photo/Hadi Mizban)Hussein’s death exacerbated the schism between Islam’s two main sects, Sunni and Shiite.\nOn Saturday, the rhythmic sound of pilgrims pounding their chests and heads as they circled the Imam Hussein Shrine filled the air.\n“Everything we offer is to commemorate and serve our Master (Hussein),” said Hussein Ali, a volunteer in Baghdad.\n—Associated Press writer Mohammed Khairullah in Diyala, Iraq and Ali Abdul Hassan in Baghdad contributed to this report."}, {"id": "03bd0092-2727-4d30-8fe3-c3c309aee1d3", "title": "Escalating violence : What is Israel doing to Palestinians in Tulkarem ? ", "date": "2024-08-24 14:00", "url": "https://www.siasat.com/escalating-violence-what-is-israel-doing-to-palestinians-in-tulkarem-3084263/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "In recent weeks, the situation of Palestinians in Tulkarem city has taken a worse turn as Israeli military raids have become nearly daily occurrences, intensifying the already dire conditions for residents.\nIsraeli aggression in TulkaremOn August 22, the Israeli military’s ground invasion of the Tulkarem refugee camp resulted in the deaths of three Palestinians.\nAccording to Al Jazeera reports, during the operations, Israeli soldiers used bulldozers to knock down the homes and essential facilities of the Palestinians.\nIn Tulkarem, many Palestinians claim that the issue is not only about military incursions but an occupation system that wants to erase them and their rights.\npic.twitter.com/UCOrRIbYfK — Halid Abdurrahman (@halidabdurrhman) August 22, 2024Hamas targeted IDF D9 bulldoze in Tulkarem⚡ BREAKING Flames rising after Hamas targeted IDF D9 bulldozer with locally made highly-explosive device, in Tulkarem."}, {"id": "caff1db5-e945-4947-81c0-57575fe1b493", "title": "Robert F . Kennedy Jr . Suspends Campaign , Urges Voters to Elect Donald Trump", "date": "2024-08-24 06:00", "url": "https://www.ncregister.com/cna/cna-20240823-rfk-jr-suspends-campaign", "domain": "ncregister.com", "domain_classification": "Unknown", "message": "“If I’m given the chance to fix the chronic disease crisis and reform our food production, I promise that within two years, we will watch chronic disease lift dramatically.”“We will make Americans healthy again,” he added.\n“Ultimately, the future, however it happens, is in God's hands and in the hands of the American voters, and those of President Trump.\nIf President Trump is elected and honors his word, the vast burden of chronic disease that now demoralizes and bankrupts the country will disappear,” Kennedy said.\nHe said he tried to meet with the Democratic presidential nominee, Vice President Kamala Harris, but she refused.\nHe is the son of former Democratic Sen. Robert F. Kennedy and the nephew of former Democratic President John F. Kennedy."}, {"id": "e1279f78-913c-475b-93e7-5a575e394788", "title": " :: Cobrapost :: ", "date": "2024-08-24 12:30", "url": "https://www.cobrapost.com/blog/us-approves/11337", "domain": "cobrapost.com", "domain_classification": "Unknown", "message": "News US Approves Sale Of $52 Million Anti-Submarine Warfare Sonobuoys To India Newsdesk | The proposed sale will also improve India's capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nIndia will have no difficulty absorbing this equipment into its armed forces.\nNew Delhi 24 August 2024As per news report of NDTV,The United States Secretary of State, Antony Blinken, has approved a possible foreign military sale of anti-submarine warfare Sonobuoys and related equipment to India at an estimated cost of USD 52.8 million.\nSource - NDTVRead More >>If you like the story and if you wish more such stories, support our effort Make a donation.\nPlease enable JavaScript to view the comments powered by Disqus."}, {"id": "735484ef-3cff-424c-8689-987ecc6129c2", "title": "McClain Cellars Unveils the Black Heroes Collection : A Tribute to American Icons", "date": "2024-08-24 03:00", "url": "https://www.pr.com/press-release/918752", "domain": "pr.com", "domain_classification": "Unknown", "message": "Irvine, CA, August 23, 2024 --( PR.com )-- McClain Cellars, Southern California’s only Black-owned winery, is proud to announce the launch of the Black Heroes Collection, a series of five extraordinary wines dedicated to celebrating the legacies of some of America’s most revered Black heroes.\n\"At McClain Cellars, we believe in the power of storytelling through wine,\" said Jason McClain, founder and proprietor.\n\"As one of very few black owned wineries in the US., the Black Heroes Collection is our way of paying tribute to the incredible men and women who have paved the way for future generations.\n\"The Black Heroes Collection is available now for purchase online and in McClain Cellars' tasting rooms located in Irvine, Solvang, and two locations in Laguna Beach, California.\nFor more information about the Black Heroes Collection or to schedule a tasting, please visit www.mcclaincellars.com or call 949-484-4459."}, {"id": "2be50397-0280-4f0f-b2a6-736ecac8713a", "title": "French authorities search for a suspect after an explosion at a synagogue injured a police officer", "date": "2024-08-24 14:15", "url": "https://abcnews.go.com/International/wireStory/french-authorities-shore-protection-jewish-places-worship-after-113119571", "domain": "abcnews.go.com", "domain_classification": "International", "message": "French authorities have opened a terrorism investigation after an arson attack on a synagogue in a southwestern Mediterranean town injured a police officer and security forces searched for a suspectFrench authorities search for a suspect after an explosion at a synagogue injured a police officerPARIS -- French authorities on Saturday opened a terrorism investigation after an arson attack on a synagogue in a southwestern Mediterranean town injured a police officer and security forces searched for a suspect.\nA police officer who walked up to the site was injured after a propane gas tank in one the vehicles detonated, the statement said.\nFive people, including the rabbi, who were present in the synagogue complex at the time of the attack were unharmed, it added.\nPresident Emmanuel Macron said the synagogue attack was a “terrorist act” and assured that ”everything is being done to find (its) perpetrator.\"\nActing Prime Minister Gabriel Attal said the synagogue was targeted in the attack that he called an “an act of antisemitism.\""}, {"id": "16afee3c-a419-4465-957f-9edb8dc92552", "title": "Smithsonian looks at history of voting by mail with absentee ballots : NPR", "date": "2024-08-24 10:30", "url": "https://www.npr.org/2024/08/24/nx-s1-5060433/voting-by-mail-history-absentee-smithsonian-national-postal-museum", "domain": "npr.org", "domain_classification": "International", "message": "A new mail-voting exhibition is a reminder that its use dates back to the Civil Wartoggle caption Zayrha Rodriguez/NPRFour years ago, millions more voters in the U.S. became familiar with voting by mail.\ntoggle caption Zayrha Rodriguez/NPRVillar hopes the exhibition can be expanded one day with more artifacts to fill in gaps in its presentation of mail-in voting’s extensive history.\nSponsor Message“We're actively collecting through this election and beyond because we want to continue the story,” Villar says.\n“Voting by mail and absentee voting for our military has really been a key part that has moved voting by mail forward in the last 160 years.\nAnd so they ended up printing these official ballots that didn't have the candidate names in them yet,” Villar explains."}, {"id": "cb5496a1-faf2-46de-ac9e-bb60b03980fa", "title": "J & K : One terrorist killed in ongoing Baramulla encounter", "date": "2024-08-24 14:30", "url": "https://www.prokerala.com/news/articles/a1558655.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Srinagar, Aug 24 : One terrorist was killed on Saturday in an encounter with the security forces in J&K's Baramulla district.\nEarlier, an exchange of firing took place between the security forces and the terrorists in the Watergam area of Baramulla district.\n\"In the exchange of firing, one terrorist was killed and his weapon was recovered from the encounter site.\nSecurity forces including the army, paramilitary forces and local police have been aggressively carrying out anti-terrorism operations in J&K for the last three months.\nOver 300 additional companies of paramilitary forces are being deployed to augment the strength of the already existing security forces in J&K to secure the democratic process."}, {"id": "6f0cdae4-a94d-4ecd-9fa5-9e2135057ada", "title": "Russian Army Loses 1 , 160 More Soldiers In Ukraine In Past Day", "date": "2024-08-24 11:00", "url": "https://menafn.com/1108596188/Russian-Army-Loses-1160-More-Soldiers-In-Ukraine-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Russian army's combat losses in Ukraine from February 24, 2022 to August 24, 2024 amount to nearly 606,490 invaders, including another 1,160 killed or wounded in action in the past day.\nThe General Staff of the of Ukraine said this in a post on , according to Ukrinform.\nThe Ukrainian defenders have also destroyed 8,542 enemy tanks (+9 in the past day), 16,620 armored combat vehicles (+21), 17,349 artillery systems (+42), 1,169 multiple launch rocket systems (+2), 935 air defense systems (+3), 367 aircraft, 328 helicopters, 14,064 unmanned aerial vehicles (+39), 2,444 cruise missiles (+2), 28 warships/cutters, 1 submarine, 23,383 motor vehicles (+54), and 2,911 special equipment units (+1).\nThe data is being updated.\nAs reported by Ukrinform, 149 combat clashes occurred on the front lines in Ukraine on August 23."}, {"id": "cc293c2f-179c-4a67-bab0-e4044716a9f3", "title": "Gaza talks set to resume in Cairo as fighting rages", "date": "2024-08-24 12:00", "url": "https://www.yahoo.com/news/gaza-talks-set-resume-cairo-113815576.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The United States, Egypt and Qatar have spent months trying to broker an end to the war in Gaza between Hamas Palestinian militants and Israel.\nA senior Hamas official said a delegation from the Islamist group was heading to Cairo, but that they would not engage in the talks.\nThe official said Hamas would insist Israel withdraw all its forces from all of Gaza, including \"from the border area with Egypt\", known as the Philadelphi Corridor.\nA second Hamas official on Saturday reiterated that \"the leadership of Hamas, including its leader Yahya Sinwar\" had already agreed to the Biden plan and want it put into effect without \"amendment of its wording.\"\nPalestinian militants also seized 251 hostages, of whom 105 remain in Gaza, including 34 the military says are dead."}, {"id": "c118c726-deca-4457-b539-d754d9f47da3", "title": "U . S . Catholics fund replacement for cathedral bell destroyed in atomic bombing of Nagasaki", "date": "2024-08-24 11:45", "url": "https://www.catholicnewsagency.com/news/258889/us-catholics-fund-replacement-for-cathedral-bell-destroyed-in-atomic-bombing-of-nagasaki", "domain": "catholicnewsagency.com", "domain_classification": "Unknown", "message": "Richmond, Va., Aug 24, 2024 / 07:00 amAhead of the 80th anniversary of the atomic bombings of the Japanese cities of Hiroshima and Nagasaki, Catholics in the United States are helping to fund the replacement of a cathedral bell destroyed in the Nagasaki blast.\nAmong the ruined structures in Nagasaki was the Urakami Cathedral, originally completed in 1925.\nIt represented the largest Catholic cathedral in East Asia at the time.\nWorshippers attend a Sunday Mass at Urakami Cathedral dedicated to the victims of the atomic bomb on the 75th anniversary of the Nagasaki atomic bombing, on August 9, 2020 in Nagasaki, Japan.\nHe said that 8,500 Catholics were killed in the Nagasaki bombing, from a population of about 12,000."}, {"id": "23bef6e7-f2aa-40d7-adf6-162e9e825877", "title": "US national security adviser to hold talks with Chinese foreign minister", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/wmd/library/news/china/2024/08/china-240823-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US national security adviser to hold talks with Chinese foreign ministerBy Nike Ching August 23, 2024U.S. President Joe Biden's national security adviser, Jake Sullivan, is heading to China next week for talks with Chinese Foreign Minister Wang Yi, according to a senior administration official.\nThis would be Sullivan's first trip to China as the White House national security adviser.\nThe senior official also said the United States will raise concerns about China's \"increased military, diplomatic, and economic pressure against Taiwan\" in next week's talks.\n\"The United States remains open to developing and implementing concrete risk reduction measures with the PRC.\nIn Washington, the United States expressed support for its ally, the Philippines."}, {"id": "e82e95ac-5389-408e-92cb-70e501480485", "title": "Bangkok Post - Kyiv looks to foster bilateral cooperation in Asia", "date": "2024-08-24 00:15", "url": "https://www.bangkokpost.com/opinion/opinion/2852862/kyiv-looks-to-foster-bilateral-cooperation-in-asia", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Kyiv looks to foster bilateral cooperation in AsiaToday, Ukraine celebrates the 33rd Anniversary of Independence -- a fight for which is still ongoing, as the people of Ukraine are determined to win this battle.\nDespite the ongoing aggression, Ukraine looks forward to continuing the strengthened cooperation with all peaceful countries in the world, including the Kingdom of Thailand.\nRemarkably, the Kingdom of Thailand was the first country in the region of Southeast Asia to recognise Ukraine as an independent state in December 1991.\nMany Thai high-level officials, including members of the parliament, visited Kyiv and held talks with their Ukrainian counterparts.\nUkraine and Thailand possess significant potential in promoting bilateral science and technological cooperation."}, {"id": "7fbf1685-8ac2-4202-af1c-29f3da80f08f", "title": "HOOK , Willow Nightingale , More Set For 8 / 24 AEW Collision", "date": "2024-08-24 06:00", "url": "https://www.wrestlezone.com/news/1498905-hook-willow-nightingale-more-set-for-8-24-aew-collision", "domain": "wrestlezone.com", "domain_classification": "Unknown", "message": "Willow Nightingale, Orange Cassidy, HOOK, and other stars will compete on the August 24th episode of AEW Collision.\nAEW confirmed that HOOK will face Big Bill, and Willow Nightingale will face Harley Cameron.\nAEW also announced that Jeff Jarrett will battle Ariya Daivari, and Jay Lethal will take on Katsuyori Shibata.\nAs previously announced, Lio Rush and Top Flight will face PAC and Blackpool Combat Club in a Wild Card in Cardiff Trios Match.\npic.twitter.com/z8kjvcf1iM — All Elite Wrestling (@AEW) August 24, 2024WrestleZone will have coverage of AEW Collision as it airs on Saturday."}, {"id": "dc87a2f0-9204-47de-994c-3ca9073c1300", "title": "Pro - Hamas mobs outside the DNC in Chicago must not be legitimized", "date": "2024-08-24 07:15", "url": "https://www.jpost.com/opinion/article-815969", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "US President Joe Biden attends the Democratic National Convention (DNC) in Chicago, Illinois, US August 19, 2024.\nInstead, you insinuated a horrifying moral equivalency between the Palestinian butchers of Gaza and the defenders of Israel.\nI am sure that President Biden didn’t intend to do so.\nThe Democratic Party candidate for president has Palestinian sanitary hygiene and food security, “pads” and “shit” (how vulgar!\nMaybe this is because Harris is just a potential “president of joy,” as former president Bill Clinton hailed her this week."}, {"id": "46f29971-e1a7-46c9-b7f5-827476b6a10e", "title": "Ukraine Celebrates Its 33Rd Anniversary", "date": "2024-08-24 09:45", "url": "https://menafn.com/1108596119/Ukraine-Celebrates-Its-33Rd-Anniversary", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm)On Saturday, August 24, Ukraine celebrates the 33rd anniversary of the Declaration of Independence.\nThe Independence Day of Ukraine celebrates the adoption by the Verkhovna Rada of the Ukrainian SSR in 1991 of the Declaration of Independence of Ukraine - a political and legal document that had certified the new status of the Ukrainian State.\nThis meant that the Ukrainian State has its own indivisible and inviolable territory, on which only the Constitution and laws of Ukraine apply.\nRead more: An exhibition of Ukrainian art works honoring Independence Day opened in KyivA total of 144 Independence Day events are set to take place throughout Ukraine, according to the National Police.\nUkrainian Diasporas are planning more than a hundred citizens' actions and other events in 20 different countries in celebration of Ukraine Independence Day."}, {"id": "f612c4b0-1024-4232-b06f-8f9b9165b6a6", "title": "Kamala Harris Gaza stance : VP says bloodshed is devastating , hostage and cease - fire deals needed as Hamas - Israel war continues", "date": "2024-08-24 00:30", "url": "https://abc7news.com/post/kamala-harris-gaza-stance-vp-says-bloodshed-is-devastating-hostage-cease-fire-deals-needed-hamas-israel-war-continues/15222721/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Harris says bloodshed in Gaza is devastating, emphasizes support for hostage and cease-fire dealsKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nThe uncommitted delegates entered the venue for Harris' speech Thursday, effectively ending the sit-in, and her speech appeared to go off without interruption from pro-Palestinian protesters."}, {"id": "27758e52-3a68-4d6e-b165-88c56bfcd72d", "title": "US sending $125 million in new military aid to Ukraine", "date": "2024-08-24 11:45", "url": "https://greatbendpost.com/posts/2b797477-eb43-4fa9-beb7-cf8e0a0954bc", "domain": "greatbendpost.com", "domain_classification": "Unknown", "message": "File photo White HouseWASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nRussian troops, meanwhile, are making gains in the Donetsk region of eastern Ukraine, around the city of Pokrovsk, a critical logistics hub.\nIf Pokrovsk falls, the defeat would imperil Ukraine’s defenses and bring Russia closer to its stated aim of capturing the Donetsk region.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "5f84d607-3429-4ca8-84e8-f444c8e10142", "title": "US sending $125 million in new military aid to Ukraine", "date": "2024-08-24 13:15", "url": "https://jcpost.com/posts/2b797477-eb43-4fa9-beb7-cf8e0a0954bc", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "File photo White HouseWASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nRussian troops, meanwhile, are making gains in the Donetsk region of eastern Ukraine, around the city of Pokrovsk, a critical logistics hub.\nIf Pokrovsk falls, the defeat would imperil Ukraine’s defenses and bring Russia closer to its stated aim of capturing the Donetsk region.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "d09287e2-5604-41b4-9afb-18b1a61850ea", "title": "US sending $125 million in new military aid to Ukraine", "date": "2024-08-24 14:15", "url": "https://littleapplepost.com/posts/2b797477-eb43-4fa9-beb7-cf8e0a0954bc", "domain": "littleapplepost.com", "domain_classification": "Unknown", "message": "File photo White HouseWASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nRussian troops, meanwhile, are making gains in the Donetsk region of eastern Ukraine, around the city of Pokrovsk, a critical logistics hub.\nIf Pokrovsk falls, the defeat would imperil Ukraine’s defenses and bring Russia closer to its stated aim of capturing the Donetsk region.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "23cc47ff-56b5-4fc2-85f2-0872de8aab44", "title": "US sending $125 million in new military aid to Ukraine", "date": "2024-08-24 14:30", "url": "https://hayspost.com/posts/2b797477-eb43-4fa9-beb7-cf8e0a0954bc", "domain": "hayspost.com", "domain_classification": "Unknown", "message": "File photo White HouseWASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nRussian troops, meanwhile, are making gains in the Donetsk region of eastern Ukraine, around the city of Pokrovsk, a critical logistics hub.\nIf Pokrovsk falls, the defeat would imperil Ukraine’s defenses and bring Russia closer to its stated aim of capturing the Donetsk region.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "b8c4b8c4-44d3-4916-924b-944dbfd9fe18", "title": "One year after Prigozhin death , the Kremlin is humiliated once more – POLITICO", "date": "2024-08-24 09:00", "url": "https://www.politico.eu/article/yevgeny-prigozhin-death-anniversary-vladimir-putin-war-in-ukraine-kremlin-kursk-russia/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "A year on, Russians are again confronted with what, before the full-scale invasion of Ukraine, would have been unthinkable.\nIn Kursk, foreign troops have entered Russia for the first time since World War II in a surprise Ukrainian offensive, causing some 133,000 people to flee.\n“There’s a general sense of confusion,” Vladimir, a Kursk resident who asked to remain anonymous for safety reasons, told POLITICO.\nIn both cases, reality exposed the narrative coming out of Moscow that it is in complete control as a lie.\nWe might never know to what extent Russians would have supported Prigozhin had he not cut short his rebellion last June."}, {"id": "6e9fc967-d8ef-40e3-9cdd-f69ff82c9b9a", "title": "Nike Offcourt Slide ( NFL Detroit Lions ) Black / Battle Blue - Apr 2021 - DD0530 - 001", "date": "2024-08-24 06:15", "url": "https://www.kicksonfire.com/nike-offcourt-slide-nfl-detroit-lions-black-battle-blue", "domain": "kicksonfire.com", "domain_classification": "Unknown", "message": "Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue100The Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue is an ideal blend of comfort and team spirit, designed for fans of the Detroit Lions.\nThis slide features an ultra-soft foam footbed, which provides excellent cushioning and support for all-day wear.\nThe upper strap is adorned with the iconic Detroit Lions logo set against a sharp black and battle blue color scheme, showcasing your allegiance to the team in a sleek and stylish manner.\nDurability and practicality are at the core of the Nike Offcourt Slide's design, as evidenced by its sturdy construction and hard-wearing sole.\nWhether you're heading to a game, running errands, or simply enjoying a lazy day, the Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue offers a fashionable, functional way to represent your favorite team."}, {"id": "932fddf3-1bb7-4f0b-b7f0-84158bbe3c17", "title": "The pros and cons of a condensed campaign for Harris : From the Politics Desk", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/pros-cons-condensed-campaign-harris-232102331.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The pros and cons of a condensed campaign for Harris: From the Politics DeskThe pros and cons of a condensed campaign for Harris: From the Politics DeskWelcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\nPlus, we dive into Robert F. Kennedy's decision to suspend his third-party bid and back former President Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy added.\nBut it changed dramatically after Harris took over as the Democratic presidential candidate and the polling landscape shifted.\nFrom there, Trump Jr. and donor Omeed Malik served as go-betweens to help close the deal."}, {"id": "11514bf6-c1be-4ca3-ae3b-f284e8f05ccc", "title": "Links 8 / 24 / 2024 | naked capitalism", "date": "2024-08-24 11:45", "url": "https://www.nakedcapitalism.com/2024/08/links-8-24-2024.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "#COVID-19GOOD NEWS: The US government has announced that it will again offer free at-home Covid tests starting in late September.\nKoreasWhy North Korea may find the South’s new vision for unification provocative The Conversation (Kevin W).\nThe gap between income per capita for South Korea v. North Korea is a chasm compared to that of West Germany and the GDR when the USSR fell.\nNevertheless, even though readers in comments on Lambert’s RFK, Jr. speech responded positively to this messaging, he spoke specifically of harm to children.\nThere can be no freedom without free speech Scott Ritter (Chuck L)AntitrustMr. Market Gets What It WantsGuillotine WatchClass WarfareAntidote du jour."}, {"id": "d983470e-7229-4ed8-85fb-ab62c66a882d", "title": "Robert F . Kennedy Jr . endorsement of Donald Trump is another bizarre twist , but the political consequences may be minimal", "date": "2024-08-24 00:30", "url": "https://www.theglobeandmail.com/world/us-politics/article-robert-f-kennedy-jrs-endorsement-of-donald-trump-is-another-bizarre/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The rump likely lean to Mr. Trump.\nThe groundwork for the alliance between Mr. Kennedy and Mr. Trump was laid months ago.\nAnd though the Kennedy campaign encountered problems getting their candidate’s name on state ballots for the November election, Mr. Kennedy either brushed aside or ignored these entreaties.\nThe Harris team refused to meet with the Kennedy campaign.\nEventually Mr. Kennedy saw that his only path was through an Independent candidacy, a conclusion buttressed by the fact that the preponderance of those who turned out to his events were Republicans who also liked Mr. Trump."}, {"id": "dd7e982e-a000-4cf6-95f3-0b2745a35390", "title": "All Call of Duty : Black Ops 6 Beta and Early Access dates", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/all-call-of-duty-black-ops-6-beta-and-early-access-dates/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Before Black Ops 6 officially launches in October, you can get a head start with the upcoming Open Beta period.\nIn this guide, we’ll show you all the Open Beta and Early Access dates for Call of Duty: Black Ops 6, including pre-load details.\nThe Open Beta, on the other hand, will be available for all platforms and is a separate event from Early Access.\nPre-loads for the Black Ops 6 Beta have already begun with the Modern Warfare 3 and Warzone Season 5 Reloaded update.\nKeep in mind that Open Beta progress might not transfer over to Black Ops 6’s full launch."}, {"id": "6f16f21f-f7d7-4f9e-b25d-866d94a058fc", "title": "Bastion coastal missile system crews of Nothern Fleet deploy launchers on coast of Barents Sea", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240823-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Bastion coastal missile system crews of Nothern Fleet deploy launchers on coast of Barents Sea23.08.2024During a field trip of the Northern Fleet's Separate Missile Formation equipped by Bastion coastal missile systems, the crews deployed the launchers on the coast of the Barents Sea.\nUnits of the Separate Missile formation marched from temporary deployment areas stationed at the Rybachy Peninsula.\nDuring the march, the missile men practised all types of support from organising security to air defence and passed through conditionally contaminated areas using individual and collective protection equipment.\nIn the course of the drills, the Bastion coastal missile system crews deployed on the coast, where servicemen train to deliver strikes electronically at the mock enemy ship detachment.\nInformation Activities Office of the Northern region (Severomorsk)NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "9c54a42e-3e49-43af-bf4c-4469eb6611c3", "title": "  Everything is a fight and it shouldnt be  – parents tell of struggle to secure school places for children with additional needs", "date": "2024-08-24 03:15", "url": "https://www.independent.ie/irish-news/everything-is-a-fight-and-it-shouldnt-be-parents-tell-of-struggle-to-secure-school-places-for-children-with-additional-needs/a1183044534.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Parents of children with additional needs have spoken about how they are at their wits’ end trying to secure school places for this academic year.\nSpecial needs assistants (SNAs), activists, parents and their children marched to the Department of Education in Dublin yesterday to demand action so that vital school places are available for children with special needs.\n“This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.\n“This includes 290 new special classes at primary level and 118 at post-primary.\n“For the coming school year, there will be over 3,300 special classes operating in primary and post-primary schools across the country."}, {"id": "3bc6b481-78aa-4c6a-a5c9-6995ee6799dc", "title": "Is Channing Tatum Character in Blink Twice Based on Jeffrey Epstein ? Zoë Kravitz Addresses Rumors", "date": "2024-08-24 06:30", "url": "https://www.pinkvilla.com/entertainment/hollywood/is-channing-tatums-character-in-blink-twice-based-on-jeffrey-epstein-zoe-kravitz-addresses-rumors-1341992", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Zoë Kravitz is addressing comparisons between Channing Tatum’s character in her film Blink Twice and Jeffrey Epstein.\nIn a recent interview with IndieWire, Kravitz, who is making her directorial debut with this movie, emphasized that the character and story are not based on Epstein.\nThe film, which Kravitz co-wrote with E.T.\nDespite the film’s focus on complex characters and themes, Kravitz stressed that it is not about any specific individual or situation.\nAdvertisementBlink Twice is set to release in theaters on August 23."}, {"id": "0a63149e-e0c7-4583-825d-a5f45b3daad3", "title": "Mud wrestling , bog snorkelling and car launching among this year weirdest festivals", "date": "2024-08-24 11:45", "url": "https://www.mirror.co.uk/travel/news/mud-wrestling-bog-snorkelling-car-33504492", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Whether its dangerously spreading fire through the streets of a picturesque village, going bog snorkelling or firing a car off a cliff, there are plenty of odd festivals happy to take your cash.\nImage: PA) PA)Cooper’s Hill Cheese Rolling, Gloucestershire, England - May 26 202Cooper’s Hill Cheese Rolling is a brutal event that has become a household name in the UK in recent years.\nImage: Getty Images) Getty Images)Sechseläuten, Switzerland - April 28 2025Sechseläuten is a centuries-old tradition to celebrate the beginning of spring in Zurich.\nAntler Shop nowImage: Getty Images) Getty Images)Boryeong Mud Festival, South Korea - Summer 2025In South Korea, Daecheon beach has long been recognised for its dirty water due to the beach’s mud.\nThe festival takes place on the beach in the mud each summer, and visitors can enjoy different mud-related experiences including mud wrestling,and mud pools."}, {"id": "1bb6931a-93f4-455a-8d34-3197e64baa13", "title": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation ( 23 August 2024 ) ", "date": "2024-08-24 11:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240823-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation (23 August 2024)23.08.2024The Armed Forces of the Russian Federation continue to repel the AFU attempt to invade the territory of the Russian Federation.\nThe AFU losses have amounted to up to 70 Ukrainian troops killed and wounded, two armoured fighting vehicles, and one motor vehicle.\nThe Armed Forces of the Russian Federation continue reconnaissance and search operations to locate and eliminate enemy small sabotage and reconnaissance groups attempting to get to the depth of the Russian territory.\nIn the past 24 hours, the AFU losses amounted to up to 400 Ukrainian troops and 17 armoured vehicles, including one tank, two armoured personnel carriers, 14 armoured fighting vehicles, two artillery guns, one MLRS launcher, two mortars, and 10 motor vehicles.\nDepartment for Media Affairs and InformationNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "049700eb-e938-4f98-a67b-6c97365e4040", "title": "Ukraine president signs law banning Russia - linked religious groups - LocalNews8 . com", "date": "2024-08-24 12:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/08/24/ukraines-president-signs-law-banning-russia-linked-religious-groups/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "President Volodymr Zelensky signed into law a bill banning religious groups with ties to Russia Saturday, Ukraine’s Independence Day.\nThe bill’s main target is the Ukrainian Orthodox Church (UOC) which has historically been linked to the Russian Orthodox Church, also known as the Moscow Patriarchate.\nThe law passed Ukraine’s parliament on August 20, with 265 lawmakers voting for and 29 voting against.\nBut with Russia’s annexation of Crimea in 2014, Ukraine’s Orthodox churches split.\nIn particular, 63% believe that Ukrainian Orthodox Church should be completely banned in Ukraine."}, {"id": "a45a450c-bdee-4c7a-bfdb-956ee6a89bab", "title": "  He Was An American Hero : Locust Grove Veteran Laid To Rest , Honored For Military Service", "date": "2024-08-24 06:00", "url": "http://www.bigcountry995.com/story/66c93285aaa326291cb024fc/he-was-an-american-hero:-locust-grove-veteran-laid-to-rest-honored-for-military-service", "domain": "bigcountry995.com", "domain_classification": "Unknown", "message": "An American hero was laid to rest on Friday in Locust Grove.\nMayes Key was a prisoner of war in World War II then served in the Korean War before coming back to his home state and raising a family.\nLoved ones say Mayes Key was calm, reserved, and didn’t like to brag, and there was nothing he loved more than God, his family, and his country.\nHe knew that everything was little in life compared to what he had experienced.”Key grew up in Yonkers, Oklahoma, a small town that was flooded in the 1940s to create Fort Gibson Lake.\n“When he came back from World War II, within a few days, he was working a regular job,” said Key."}, {"id": "3e1df416-0af2-4b03-8bf2-bb78df4d4457", "title": "  He Was An American Hero : Locust Grove Veteran Laid To Rest , Honored For Military Service", "date": "2024-08-24 07:15", "url": "http://www.thebulltulsa.com/story/66c93285aaa326291cb024fc/he-was-an-american-hero:-locust-grove-veteran-laid-to-rest-honored-for-military-service", "domain": "thebulltulsa.com", "domain_classification": "Unknown", "message": "An American hero was laid to rest on Friday in Locust Grove.\nMayes Key was a prisoner of war in World War II then served in the Korean War before coming back to his home state and raising a family.\nLoved ones say Mayes Key was calm, reserved, and didn’t like to brag, and there was nothing he loved more than God, his family, and his country.\nHe knew that everything was little in life compared to what he had experienced.”Key grew up in Yonkers, Oklahoma, a small town that was flooded in the 1940s to create Fort Gibson Lake.\n“When he came back from World War II, within a few days, he was working a regular job,” said Key."}, {"id": "6ebed0f8-67f6-4f17-9c5c-c72152c9eb4a", "title": "Tim Walz : Joe Biden 2 . 0", "date": "2024-08-24 11:45", "url": "https://www.americanthinker.com/articles/2024/08/tim_walz_joe_biden_2_0.html", "domain": "americanthinker.com", "domain_classification": "Unknown", "message": "Democrat Vice Presidential candidate Tim Walz keeps getting caught in lies.\nCome to find out, Walz and his wife didn’t use IVF; they used another, very different method -- intrauterine insemination (IUI).\nWalz is the politician who said, “One person’s socialism is another person’s neighborliness.” The implications of that statement are breathtaking.\nOn an international scale, we are witnessing two wars, either of which could escalate into World War III.\nCan anyone seriously envision Kamala Harris and Tim Walz standing up to these challenges, facing down America’s enemies with any kind of strength or resolve?"}, {"id": "c56f883a-56ce-4793-bb86-0b2b15a9472d", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "c7a0e6ba-3fe8-45e4-8b56-4c44f6b91a2b", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032905.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "1910cbdf-216b-44de-9e73-ace70db33506", "title": "Angelina Jolie dad Jon Voight urges Brad Pitt to end  NONSENSE  divorce battle for children stability |", "date": "2024-08-24 10:15", "url": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/angelina-jolies-dad-jon-voight-urges-brad-pitt-to-end-nonsense-divorce-battle-for-childrens-stability/articleshow/112760689.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Veteran actor Jon Voight is stepping in to help daughter Angelina Jolie amidst her bitter divorce battle with Brad Pitt .The actor has publicly called on Brad to bring an end to the ongoing 'nonsense' divorce battle, which is set to hit the eight-year mark.\nAnd I want Brad to step up to do, you know, what he has to do.\nDespite their differences, Voight recently expressed pride in Jolie and his granddaughter Vivienne after their success at the 2024 Tony Awards.\n\"I'm very proud of Vivienne,\" Voight told TMZ.\n\"I'm really proud of Angie because she really tries to encourage each of the kids to be what they want to be.\""}]