[{"id": "a8289e40-d642-4834-bbce-5d7cbea6adca", "title": "Jewish Columbia students push back against campus antisemitism", "date": "2024-05-09 03:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-800509", "message": "An open letter signed by over three hundred Jewish Columbia University and Barnard College students decrying antisemitism in the guise of antizionism on campus was issued on Wednesday during the weeks of protests, encampments, and building occupations.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York, in late April.\n(credit: MARY ALTAFFER/REUTERS)The letter listed instances of aggressive and dehumanizing rhetoric leveled at the Jewish students not just since the April 17 encampment that was expelled last Wednesday, but in response to Hamas's October 7 Massacre.\nMuch of the antisemitism encountered by the students was an inversion of the \"Holocaust legacy,\" said the students.\nThe situation became so tense with the establishment of the tent settlement aimed at forcing the administration to adopt anti-Israel policies, that Orthodox Union Jewish Learning Initiative on Campus director rabbi Elie Buechler warned Jewish students to leave campus for the Passover holiday."}, {"id": "ac6ec79a-229b-49f7-b406-c5e3eb258c35", "title": "Berkeley school teachers promoting Palestinian propaganda : ADL", "date": "2024-05-09 01:45", "url": "https://www.christianpost.com/news/berkeley-schools-ignoring-palestinian-propaganda-in-classroom.html", "message": "The organizations allege that the \"already-hostile environment\" for Jews in the school district has only worsened since they filed the Title VI complaint.\nThe Berkeley Unified School District did not immediately respond to The Christian Post's request for comment.\nIn a congressional hearing Wednesday, Berkeley Superintendent Enikia Ford Morthel denied that antisemitism has become “pervasive\" in her school district.\nA ninth-grader also faced bullying after his parents reported antisemitic incidents to BHS and the school district, according to the expanded complaint.\n\"The Berkeley School District must be held accountable for their inaction and seeming indifference to addressing this hostile school environment and must do more to ensure the safety of Jewish students.\""}, {"id": "c5f35777-f35e-4431-97dd-a2c30ba30703", "title": "Hatred towards Jews is a sign of what is to come . - The Jerusalem Post", "date": "2024-05-09 05:15", "url": "https://www.jpost.com/international/article-800481", "message": "Just like then, we see that what started with the Jews did not end with them.\nAny person who has approached these radicals, united only by a despisal of Jews, Israel, and the US, and questions them finds not even the scantest of knowledge of a conflict raging thousands of miles away.\nThe Jew is just the easiest of targets, but the synergy between the far Left and far Right bodes ill for our societies.\nNot only are the targeted Jews screaming to have their pain heard, but they are also raising the alarm for our societies.\nWhat starts with the Jews rarely ends with them."}, {"id": "be562ce2-b08c-47db-96bf-61ae333f8b5f", "title": "  Free everybody : Kim Kardashian shuts down pro - Palestinian heckler", "date": "2024-05-09 03:00", "url": "https://www.jpost.com/omg/article-800508", "message": "While participating in a discussion panel at a marketing event in Germany, a pro-Palestinian activist began yelling “Free Palestine” as Kim Kardashian attempted to deliver comments on her business.\nThe activist continued to scream “Free Palestine” as the moderator commented quietly “free speech.” As the activist continued to disrupt the event, she was escorted out by security.\nKim Kardashian reacts to protester shouting “Free Palestine” at OMR business festival in Hamburg:“Free everybody.” pic.twitter.com/ujGBtdp8Fl — Pop Crave (@PopCrave) May 8, 2024As security removed the pro-Palestinian woman, Kardashian can be heard stating “Free everybody.”While Kardashian’s ex-husband Kanye West has made headlines for his repeated antisemitic tyrades, Kardashian has been vocal in condemning antisemitism.\nKim Kardashian (credit: DAVID BECKER/GETTY IMAGES/AFP)“Hate speech is never OK or excusable.\nAfter October 7, Kardashian published the statement: “A message to my Jewish friends and family."}, {"id": "ac154ad2-8a53-4213-a416-164a57b6dca0", "title": "Live coverage : Pro - Palestine demonstrators to rally , pack ASUO Senate meeting", "date": "2024-05-09 04:45", "url": "https://www.dailyemerald.com/news/live-coverage-pro-palestine-demonstrators-to-rally-pack-asuo-senate-meeting/article_fd848edc-0d50-11ef-92c3-5bf7356455b8.html", "message": "× Browser CompatibilityYour browser is out of date and potentially vulnerable to security risks.\nWe recommend switching to one of the following browsers:"}, {"id": "dac4b028-87f4-4a8d-9719-86271cf9ca28", "title": "Ottawa cancels public ceremony for Israeli flag - raising , citing security concerns", "date": "2024-05-09 03:00", "url": "https://www.cornwallseawaynews.com/ontario-news/ottawa-cancels-public-ceremony-for-israeli-flag-raising-citing-security-concerns/", "message": "OTTAWA — City officials say they’ve cancelled plans to host a flag-raising ceremony at Ottawa City Hall marking the establishment of Israel because of security concerns.\nTherefore, this year’s commemoration will occur without the customary ceremony,” the city said in a news release Tuesday.\nDeborah Lyons, Canada’s envoy for combating antisemitism, condemned the decision to cancel the event.\n“Limiting Jewish participation in Canadian life due to the threat of violence is not acceptable,” she wrote on social media.\n“Based on this, I ask you — is it appropriate to be celebrating the State of Israel?” she wrote."}, {"id": "387aff8c-6ace-4e2c-957d-df12bb8f6b8a", "title": "Opinion : My experience at the Columbia University encampment", "date": "2024-05-09 07:00", "url": "https://ctmirror.org/2024/05/09/columbia-university-encampment-gaza/", "message": "Lily ForandLargely because of my age, I was privileged to hear student protesters’ unfiltered passion, instead of the defensive stance elicited by more skeptical senior reporters often looking for an angle with shock value.\nOne video in particular shows a protester holding up a sign to pro-Israeli demonstrators that read “Al-Qasam’s Next Targets.” It’s unclear whether the perpetrator was affiliated with Columbia University; nevertheless, this and other documented incidents are clearly unacceptable.\nAfter visiting the encampment and speaking to students, I’ve come away with a much clearer picture of the goals and behavior I believe defined the majority of protesters at the Columbia encampment.\nStudents set up a library at the encampment and walked around handing out cold cloths to anyone who was overheating.\nDalia, a Palestinian freshman at Columbia, explained that her peers were more “united” than ever and overwhelmingly supported university divestment from companies with Israeli ties (76.55%)."}]