[{"id": "6104ec98-e993-49a6-a8e5-8e4115d816c2", "title": "Capital Pride : OCDSB trustee wants school board to skip Ottawa Pride parade", "date": "2024-08-17 21:00", "url": "https://ottawa.ctvnews.ca/ocdsb-trustee-wants-school-board-to-skip-capital-pride-parade-over-pro-palestinian-comments-1.7004716", "domain": "ottawa.ctvnews.ca", "domain_classification": "Unknown", "message": "An Ottawa-Carleton District School Board (OCDSB) trustee is asking eastern Ontario's largest school board to join a number of organizations and the city's mayor to withdraw their participation from next week's Capital Pride festival over pro-Palestinian comments made by its organizers.\n\"We are disappointed to hear through public statements that the Mayor will no longer be taking part in Capital Pride events.\nWe invite Mayor Sutcliffe to listen to 2SLGBTQ+ community organizations about the importance of taking part in our city’s pride activities,\" Capital Pride said in an email.\n\"Capital Pride is, and always will be, committed to combating all forms of hate, discrimination and intolerance, including antisemitism and Islamophobia.\nThe annual Capital Pride Festival begins Saturday and runs through next week."}, {"id": "cb629b1f-dd94-4ec1-8d80-0d8dab623f8c", "title": "  A police state : US universities impose rules to avoid repeat of Gaza protests | US campus protests", "date": "2024-08-17 15:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/17/campus-protest-rules", "domain": "theguardian.com", "domain_classification": "International", "message": "Columbia University students, who were at the vanguard of the movement, may encounter the most changes.\nAs they plan for a new academic year and the prospect of more protests, university administrations nationwide have issued a flurry of new policies and proposals seeking to limit protests.\n“Disrupting speakers and events is not protected speech under the law and is a violation of university policy,” the spokesperson added.\nPolitical pressuresAs they prepare for the return of students and protests to campus, universities are also grappling with mounting accusations of antisemitism – many leveled by lawmakers and in two dozen lawsuits.\nBefore resigning, Shafik had promised a “vigorous” program of antisemitism training for faculty, staff and students in the fall."}, {"id": "12dd4697-5231-4247-a3e1-d491185eb017", "title": "Police : There was no hate crime at Reginald D Hunter gig : News 2024 : Chortle : The united kingdom Comedy Guide", "date": "2024-08-17 14:45", "url": "https://www.chortle.co.uk/news/2024/08/17/56373/police:_there_was_no_hate_crime_at_reginald_d_hunter_gig", "domain": "chortle.co.uk", "domain_classification": "Unknown", "message": "Police have said no crime took place at a Reginald D Hunter Edinburgh Fringe show after receiving complaints that his run-in with Israeli hecklers amounted to a ‘hate incident’.\nPolice Scotland have now said: ‘We were made aware of a hate incident, which reportedly took place at an event in Edinburgh on Sunday.\nOn Thursday Hunter broke his four-day silence over the incident, saying he ‘regretted’ what happened, but stopping short of an apology.\nCracking jokes as Jews are hounded out of your show is a sickening low that cannot be disguised as comedy.\nIf you find Chortle’s coverage of the comedy scene useful or interesting, please consider supporting us with a monthly or one-off ko-fi donation."}, {"id": "9ac0ae35-9f96-4c42-bc7b-f19bc3007ef7", "title": "Trump draws fire for remarks about Medal of Honor recipients", "date": "2024-08-17 18:30", "url": "https://www.k101fm.net/syndicated-article/?id=1579663", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "(WASHINGTON) — President Donald Trump sparked criticism when he said the Presidential Medal of Freedom, the nation’s highest civilian award, is “much better” than the Medal of Honor, the nation’s highest military honor, because soldiers are in “bad shape” or dead when they receive it – comments the former president’s campaign suggested were misinterpreted.\nAnd we just had always a great relationship, known her for a long time,” Trump said.\n“But I really, I watched Sheldon sitting so proud in the White House when we gave Miriam the Presidential Medal of Freedom,” he said.\nIt’s the equivalent of the Congressional Medal of Honor, but civilian version, it’s actually much better, because everyone gets the Congressional Medal of Honor, they’re soldiers.\nDuring the Bedminster event, Trump highlighted the importance of the Jewish vote, while also making false claims about various Democrats, including Harris."}, {"id": "3cc4434e-d498-4757-8fa2-991b49f8dd0d", "title": "Israel , Gaza and Josh Shapiro : What to watch for during the DNC", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/american-politics/article-815076", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Harris’ Jewish husband, Doug Emhoff, is also expected to take a primetime turn.\nThe Democratic convention will run Monday through Thursday in Chicago, with marquee speakers — including Harris, Walz and former presidents Barack Obama and Bill Clinton — speaking in the evening.\n​Jim Zogby, the president of the Arab American Institute and a longtime Democratic Party operative, said progressive protesters are showing up in large numbers at the Democratic convention because they feel betrayed by the Democratic administration.\n“Israel’s genocidal war in Gaza has become central to the agenda of progressives in the Democratic Party,” he said in his most recent weekly newsletter.\nIf either — or both — mention the war, Jewish organizations will closely scrutinize the differences, as will pro-Palestinian activists."}, {"id": "3ce8ef7e-da15-447a-b799-2b230435dba7", "title": "30 , 000 join  Jewish women for Kamala  call - The Jerusalem Post", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/diaspora/article-815077", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "It follows “Jewish Americans for Kamala Harris,” which was held with some of the same speakers earlier this month.\nThe biggest name on the call was Barbra Streisand, who urged participants to be “rebellious,” citing Jewish tradition.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris attends a campaign event in Las Vegas, on August 10.\n(credit: KEVIN MOHATT/REUTERS)“At our Passover seder every year, we like to expand on the traditional stories of Jewish men to include and celebrate Jewish women, rebellious women like Esther and Miriam,” the EGOT-winning singer and actress said.\n“If there’s one thing I’m certain about, after advocating with the Jewish community for close to two decades,” Katz said, “it’s that Jewish women get shit done.” Stay updated with the latest news!"}, {"id": "54d8a658-3ea0-473b-8a7f-d5c6959bbad8", "title": "Trump Seeks Expulsion Of Hamas Supporters ; Backs Israel War On Terror", "date": "2024-08-17 04:15", "url": "https://www.worthynews.com/97797-trump-seeks-expulsion-of-hamas-supporters-backs-israels-war-on-terror", "domain": "worthynews.com", "domain_classification": "Unknown", "message": "When I’m back in the oval office I will support Israel’s right to win its war on terror.\nThey have a right to win that war,” Trump told a conference against antisemitism at his golf club in Bedminster, New Jersey.\n“And I will give Israel the support that it needs to win, but I do want them to win fast.\nWe have to let them win fast,” he added.\nHe warned his Jewish supporters that their lives will get worse under Kamala Harris, his main rival for the nation’s top job."}]