[{"id": "3e13c984-ba6e-4abd-a9e0-ac345b3394a3", "title": "Israel , Gaza and Josh Shapiro : What to watch for during the DNC", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/american-politics/article-815076", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Harris’ Jewish husband, Doug Emhoff, is also expected to take a primetime turn.\nThe Democratic convention will run Monday through Thursday in Chicago, with marquee speakers — including Harris, Walz and former presidents Barack Obama and Bill Clinton — speaking in the evening.\n​Jim Zogby, the president of the Arab American Institute and a longtime Democratic Party operative, said progressive protesters are showing up in large numbers at the Democratic convention because they feel betrayed by the Democratic administration.\n“Israel’s genocidal war in Gaza has become central to the agenda of progressives in the Democratic Party,” he said in his most recent weekly newsletter.\nIf either — or both — mention the war, Jewish organizations will closely scrutinize the differences, as will pro-Palestinian activists."}, {"id": "059c0d89-c5a8-46df-a62a-95193257aff0", "title": "30 , 000 join  Jewish women for Kamala  call - The Jerusalem Post", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/diaspora/article-815077", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "It follows “Jewish Americans for Kamala Harris,” which was held with some of the same speakers earlier this month.\nThe biggest name on the call was Barbra Streisand, who urged participants to be “rebellious,” citing Jewish tradition.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris attends a campaign event in Las Vegas, on August 10.\n(credit: KEVIN MOHATT/REUTERS)“At our Passover seder every year, we like to expand on the traditional stories of Jewish men to include and celebrate Jewish women, rebellious women like Esther and Miriam,” the EGOT-winning singer and actress said.\n“If there’s one thing I’m certain about, after advocating with the Jewish community for close to two decades,” Katz said, “it’s that Jewish women get shit done.” Stay updated with the latest news!"}]