[{"id": "9263d48d-784e-4f65-83f9-43b1b1683a60", "title": "US fears Middle East conflict growing as Israel and Hezbollah exchange attacks as Gaza ceasefire deal teeters", "date": "2024-06-13 02:45", "url": "https://www.independent.co.uk/news/world/middle-east/israel-hezbollah-gaza-ceasefire-hamas-b2561683.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nOn Tuesday, Israeli forces killed a senior Hezbollah commander, Taleb Sami Abdullah, known as Abu Taleb, near the Lebanon-Israel border.\nThroughout the war, Yemen’s Iran-backed Houthi militants and an Iran-aligned group in Iraq have targeted ships passing through the busy Red Sea shipping corridor, in protest of the Israeli war effort in Gaza.\n“That will take a tremendous amount of pressure out of the system.”There’s still considerable daylight between Israel, Hamas, and the US, over a proposed ceasefire deal.\nSenior Hamas official Osama Hamdan told AFP it is seeking to add provisions guaranteeing \"a permanent cease-fire and complete withdrawal\" by the IDF, demands Israel has rejected."}, {"id": "48d09142-8331-4f5c-9ed8-15b023ff7366", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-13 04:30", "url": "https://www.news4jax.com/news/world/2024/06/12/hezbollah-vows-to-intensify-attacks-against-israel-after-senior-military-commander-is-killed/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "(AP Photo/Bilal Hussein)BEIRUT – Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said."}, {"id": "d3b342f2-426a-4552-95f0-ce08cca2bb19", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-13 01:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-12/hezbollah-israel-senior-military-commander-14159875.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Bilal Hussein/AP)BEIRUT — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said."}, {"id": "8b4463cb-71ad-4d0f-8946-6f044e70777f", "title": "Rescue Operations Completed In Kryvyi Rih After Russian Missile Strike", "date": "2024-06-13 01:00", "url": "https://menafn.com/1108326653/Rescue-Operations-Completed-In-Kryvyi-Rih-After-Russian-Missile-Strike", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Emergency rescue operations in Kryvyi Rih after a Russian missile strike have been completed.\nThis was reported by Interior Ihor Klymenko on Telegram , Ukrinform reports.\n\"Emergency and rescue operations have been completed.\nAmong the are five children,\" Klymenko wrote.\nRussian strike at Staryi Saltov inregion, there are casualtiesAs reported, in the afternoon of 12 June, Russian troops launched a missile attack on the residential sector of Kryvyi Rih ."}, {"id": "a9878c8d-856b-4cd6-a1d1-a7f1d441c49b", "title": "Ukraine says it struck Russian missile systems in Crimea", "date": "2024-06-13 03:30", "url": "http://www.china.org.cn/world/2024-06/13/content_117250815.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here: World视频播放位置 下载安装Flash播放器The Ukrainian military carried out missile strikes on Russian missile systems S-300 and S-400 in southern Crimea early Wednesday, the General Staff of the Ukrainian Armed Forces said in a statement.\nThe radar of the S-300 missile system stationed near the Belbek airfield was destroyed in the strike, the statement said.\nIt further said that two S-400 missile systems stationed near Belbek and the city of Sevastopol also came under attack.\nThe strikes caused a detonation of munition in all three areas where Russian anti-aircraft missile divisions are positioned, it said.\nOn Monday, the General Staff said that Ukrainian forces had struck two Russian S-300 complexes and one S-400 complex in Crimea."}, {"id": "8e828072-8f23-4a80-ae33-e620d83bb9fa", "title": "Hezbollah launches rocket barrage on Israel after strike kills top commander", "date": "2024-06-13 01:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/hezbollah-launches-rocket-barrage-on-israel-after-strike-kills-top-commander/articleshow/110952418.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The Israeli offensive prompted Hezbollah to mount cross-border attacks in support of Hamas.\nThe Israeli military said in a statement on Wednesday that it had struck a Hezbollah command and control centre, killing Abdallah and three other Hezbollah fighters.As sirens sounded across north Israel, Israeli army radio said around 150 rockets had been launched from Lebanon in an apparent response to the Israeli strike.\nHezbollah claimed attacks on a string of military bases, including on Mount Meron, an area housing a radar station that is roughly 8km south of the border.\nHezbollah vowed to intensify its attacks.There were no immediate reports of casualties from the rocket barrages.\nIsraeli military said a number of the rockets had been intercepted, but that several had hit the ground and started fires."}, {"id": "c29aaf8a-c6c5-4399-ba3d-8e54ea07da69", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 06:00", "url": "https://www.bostonglobe.com/2024/06/13/world/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-red-sea/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said."}, {"id": "a5e167ce-0d26-4453-9842-5d87a4e49329", "title": "Hezbollah fires most rockets yet in war after Israel kills a top commander", "date": "2024-06-13 04:00", "url": "https://www.asiaone.com/world/hezbollah-fires-most-rockets-yet-war-after-israel-kills-top-commander", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "He was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\nIn another, the group said it had attacked Israeli military headquarters in Ein Zeitim and Ami'ad, and an Israeli military air surveillance station in Meron.\nThe Israeli military earlier said Hezbollah had fired a barrage of around 50 launches from southern Lebanon into the Israeli-occupied Golan Heights.\nThe Israeli military said it fighter jets hit Hezbollah launch sites in two areas in southern Lebanon, while artillery shelled a third location.\nALSO READ: Hezbollah launches missiles and drones at northern Israel, wounding 14 Israeli soldiers"}, {"id": "44184d39-0108-4f30-b64b-052064f98c5a", "title": "S - 500 Prometheus Air Defense System Now Protecting Russia Kerch Bridge : Ukraine Spy Boss", "date": "2024-06-13 01:15", "url": "https://www.yahoo.com/news/500-prometheus-air-defense-system-001900448.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia has moved one of its S-500 air defense systems , the most advanced it has, to the occupied Crimean Peninsula to protect the Kerch Bridge , Ukraine’s spy boss said Wednesday.\nIt was developed to eventually replace the current A-135 anti-ballistic missile system deployed in silos around Moscow.\nA screen capture from the Russian Defense Ministry video of the 2021 test showing one of the 10x10 TELs used in the S-500 system.\nDeploying an S-500 system now would help provide another layer of protection, especially against potential ballistic missile strikes.\nA Ukrainian drone boat attack badly damaged the Kerch Bridge, as can be seen in this satellite image taken afterward."}, {"id": "459b1c32-c5ae-443e-810c-7a2087490b3c", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 05:30", "url": "https://economictimes.indiatimes.com/news/defence/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/articleshow/110956791.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelAboard the USS Laboon in the Red Sea, Jun 13 (AP) Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a US-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the US campaign while visiting one of her sister ships, the USS Laboon.Yemen's military spokesman Brig.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\n\"\"The impact of the (drone boat) caused severe flooding and damage to the engine room,\" it added.The US military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said."}, {"id": "e9c0f7f3-10e1-49c2-97b7-8fac68add34b", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 08:45", "url": "https://www.euronews.com/2024/06/13/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTYemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, marking another escalation in the face of a US-led campaign trying to protect the vital waterway.\nYemen's military spokesman, Brigadier General Yahya Saree, claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe US military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\nAn HSC-7 helicopter lands on the Arleigh Burke-class guided missile destroyer USS Laboon in the Red Sea."}, {"id": "ed3e33f2-e199-4aba-b263-dc50ba670c07", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 05:15", "url": "https://www.smdailyjournal.com/news/world/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/article_e93f431d-1884-583a-ba7e-93a1138d6d32.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "9b36b939-47ed-42a6-9869-c920828c72d5", "title": "Houthis attack ship in Red Sea using boat filled with explosives", "date": "2024-06-13 05:45", "url": "https://www.ynetnews.com/article/hjzp00x00h0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The Houthis in Yemen launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said."}, {"id": "02d1c81a-13bf-40db-be99-7598851075c3", "title": "Hezbollah vows to intensify attacks against Israel afte ... ", "date": "2024-06-13 02:45", "url": "https://accesswdun.com/article/2024/6/1247639", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said."}, {"id": "d193700b-1987-416b-b4cd-5ad9c8c2fef0", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea – Metro US", "date": "2024-06-13 02:15", "url": "https://www.metro.us/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/", "domain": "metro.us", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said."}, {"id": "d805dce6-8660-400c-a230-7cf1e74941be", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 00:45", "url": "https://isp.netscape.com/news/world/story/0001/20240612/12e8bf184bfa08669bbe17b8e1f99b0f", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red SeaABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer Laboon, when the alert came in on the attack.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,” he said."}, {"id": "bc27ffaf-f05b-4fa9-adef-24560d716c75", "title": "Russian fleet headed to Cuba", "date": "2024-06-13 01:15", "url": "https://www.tribune242.com/news/2024/jun/12/russian-fleet-headed-to-cuba/", "domain": "tribune242.com", "domain_classification": "Unknown", "message": "RUSSIAN warships conducted drills in the Atlantic, the military said Tuesday, as they were heading to visit Cuba, part of Moscow’s efforts to project power amid the tensions with the West over Ukraine.\nThe Russian Defence Ministry said the Admiral Gorshkov frigate and the Kazan nuclear-powered submarine conducted the exercise that was intended to simulate a missile strike on a group of enemy ships.\nThe Admiral Gorshkov is armed with new Zircon hypersonic missiles.\nThe Admiral Gorshkov and the Kazan are accompanied by two support vessels on their visit to Havana, which Cuban officials said reflected “historically friendly relations” between Russia and Cuba.\nThe Cuban statement followed a US announcement that Washington had been tracking Russian warships and aircraft that were expected to arrive in the Caribbean for a military exercise."}, {"id": "62c05097-799e-49ee-b082-8180b1d2a4ae", "title": "Ukraine - Russia war : Russia practises missile launches in nuclear drills - as G7 leaders to discuss Moscow sanctions", "date": "2024-06-13 09:15", "url": "https://news.sky.com/story/ukraine-russia-war-russia-practises-missile-launches-in-nuclear-drills-as-g7-leaders-to-discuss-moscow-sanctions-12541713", "domain": "news.sky.com", "domain_classification": "International", "message": "Sunak to set out £240m Ukraine aid package as G7 to focus on RussiaBy Tamara Cohen, political correspondentRishi Sunak will set out a £240m aid package to Ukraine as world leaders meet to discuss how to intensify financial pressure on Russia.\nThis is part of a £2.5bn military aid package to Ukraine this year.\nAgreed by Mr Sunak on a trip to Kyiv in January, the UK-Ukraine security deal includes the largest delivery of drones by any nation.\n\"The UK remains at the forefront of the international response as we have been from the outset.\n\"We must move from 'as long as it takes' to 'whatever it takes' if we are to end this illegal war."}, {"id": "dc61dc7e-53c1-4bc3-946a-21ccb4970237", "title": "County fireworks ban should be just the start", "date": "2024-06-13 03:30", "url": "https://www.santafenewmexican.com/opinion/editorials/county-fireworks-ban-should-be-just-the-start/article_6e7077b2-28d8-11ef-b7dc-6fc45eee9cd1.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "d2e5c3fd-d935-4614-993d-c1f893288b4f", "title": "Israel faces major Hezbollah escalation as Rafah battle continues", "date": "2024-06-13 01:15", "url": "https://www.longwarjournal.org/archives/2024/06/israel-faces-major-hezbollah-escalation-as-rafah-battle-continues.php", "domain": "longwarjournal.org", "domain_classification": "Unknown", "message": "(IDF image)Hezbollah launched “at least 215 rockets from Lebanon” at Israel on June 12 in the most significant escalation by the Iranian-backed terrorist group over eight months of war.\nHezbollah has been targeting Israel with rockets, drones, and missiles since October 8, 2023, when it chose to back Hamas’s war.\nHezbollah attacks usually average about a dozen or more projectiles daily, in contrast to the more than 215 launched on June 12.\nHezbollah’s attacks on Israel continued throughout June 12, and the group claimed responsibility for them to the pro-Iranian media outlet Al-Mayadeen.\nIranian media also claimed Hezbollah had targeted Israeli “spy facilities.” The terrorist group frequently claims it is able to carry out precision attacks targeting IDF posts and bases."}, {"id": "492c64d8-b2b9-4e41-9564-ff79ee69d6e6", "title": "Hezbollah Launches Retaliatory Strikes for Killed Commander as U . N . Accuses Hamas , Israel of War Crimes", "date": "2024-06-13 02:15", "url": "https://foreignpolicy.com/2024/06/12/hezbollah-commander-killed-israel-hamas-war-crimes-un/?tpcc=recirc_trending062921", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "Welcome back to World Brief, where we’re looking at escalations on the Israel-Lebanon border, European tariffs against Chinese electric vehicles, and Russian military drills.\nRevenge OperationHezbollah launched around 170 missiles and rockets at northern Israel on Wednesday in retaliation for the Israel Defense Forces (IDF) killing a top Hezbollah commander the day before.\nThe strikes—which targeted Israeli military factories, bases, and an air surveillance station—were one of the largest Hezbollah attacks on Israel since the Israel-Hamas war began eight months ago.\nOn Tuesday, Israeli forces killed Taleb Sami Abdullah (known as Hajj Abu Taleb), the most senior Hezbollah commander to be killed yet, along with three other Hezbollah fighters at a command-and-control center near Jouaiyya, Lebanon.\nLast month, the United States quadrupled tariffs on Chinese electric vehicles as well as semiconductors, solar cells, and advanced batteries."}, {"id": "3f11fd82-390c-4ede-a131-7b566ba6641d", "title": "Worcester police investigate shooting at WRTA bus hub", "date": "2024-06-13 00:15", "url": "https://www.yahoo.com/news/worcester-police-investigate-shooting-wrta-234607478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police investigate a shooting at the WRTA bus hub on Foster Street in Worcester.\nWORCESTER ― Police are investigating a shooting that occurred around 6:30 p.m. Wednesday at the Worcester Regional Transit Authority bus hub on Foster Street.\n11 Walmart/Fair Plaza bus, with several gun casings on the ground.\nThe shooting occurred just a few hours after a stabbing victim, a 32-year-old man, was taken to the hospital from a scene at Elm and West streets.\nThis article originally appeared on Telegram & Gazette: Worcester police investigate shooting at WRTA bus hub"}, {"id": "9d7f1c24-cb5a-4de1-a87b-a3c62f8836cf", "title": "Hamas Urges US To Put  Pressure  On Israel For Permanent Gaza Ceasefire", "date": "2024-06-13 05:30", "url": "https://www.ndtv.com/world-news/hamas-urges-us-to-put-pressure-on-israel-for-permanent-gaza-ceasefire-5878753", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Blinken, in Doha for the last stop of a tour to promote President Joe Biden's Gaza ceasefire roadmap, said the United States would work with regional partners to \"close the deal\".\nA senior Hamas official, Osama Hamdan, said it sought \"a permanent ceasefire and complete withdrawal\" of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\nHezbollah also claimed more than 10 other attacks on the Israeli military, including one with drones.\n'Starvation'A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\"."}, {"id": "e3b8eeec-a9ff-4886-85d6-8c6d274d9d93", "title": "Study details huge emissions resulting from Russia invasion of Ukraine", "date": "2024-06-13 07:30", "url": "https://tribune.com.pk/story/2471417/study-details-huge-emissions-resulting-from-russias-invasion-of-ukraine", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Fire rages after a Russian missile strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine in Kyiv, Ukraine January 2, 2024.\nMilitary activity was responsible for 51.6 million tons of CO2 equivalent emmmisions, the report said.\nThe majority of that number, 35.2 million tons of CO2 equivalent, was caused by the Russian military's fuel consumption, with a further 9.4 million tons from the Ukrainian military's use of fuel.\nIt said a million hectares of land had been scorched by 27,000 war-related fires, causing the equivalent atmospheric damage of 23 million tons of CO2.\n(This story has been corrected to change the invasion year to 2022, from 2020, in paragraph 2 and to fix the spelling of 'million tons' in paragraph 15)"}, {"id": "df903176-f6fb-49de-9399-bc2b26b0ded7", "title": "Hamas calls on US to put  direct pressure  on Israel for permanent ceasefire", "date": "2024-06-13 06:15", "url": "https://www.thejournal.ie/hamas-gaza-israel-antony-blinked-ceasefire-plan-6407843-Jun2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "Meanwhile, Hamas has called for the US to put “direct pressure” on Israel to secure a permanent ceasefire.\nA senior Hamas official, Osama Hamdan, said it sought “a permanent ceasefire and complete withdrawal” of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel’s northern border with Lebanon.\nThe Gaza war broke out after Hamas’s 7 October attack which resulted in the deaths of 1,194 people, mostly civilians.\n‘Starvation’A UN investigation concluded yesterday that Israel has committed crimes against humanity during the Gaza war, including that of “extermination”."}, {"id": "61c76f7b-e4e2-41bb-9251-fd311f61e5dd", "title": "Cargo ship attacked in Red Sea , crew member missing", "date": "2024-06-13 01:45", "url": "https://www.prokerala.com/news/articles/a1539075.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Aden : , June 13 (IANS) A commercial cargo ship was struck twice in attacks in the Red Sea off Yemen's western coast, leaving one crew member missing and the vessel adrift, Yemeni and maritime officials reported.\nOf the 21 crew members of different nationalities aboard the ship, one has been declared missing in the first attack, the official said.\nThere was no immediate claim of responsibility from the Houthi group which controls the Hodeidah area.\nHowever, the group has launched numerous attacks in recent months against commercial shipping in the Red Sea.\nSince November last year, the Houthi group has launched anti-ship ballistic missiles and drones targeting what they said were Israeli-linked ships transiting the Red Sea, to show solidarity with Palestinians in the Gaza Strip."}, {"id": "dd0ab45b-ab56-4a9b-92ea-d26687191646", "title": "Gaza war rages as US wants to  close  truce deal", "date": "2024-06-13 04:15", "url": "https://www.bssnews.net/news-flash/194908", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "Gaza war rages as US wants to 'close' truce dealDOHA, June 13, 2024 (BSS/AFP) - Top US diplomat Antony Blinken said Wednesday that a truce and hostage release deal to end the Gaza war was still possible, wrapping up a Middle East tour as deadly fighting rocked the Palestinian territory.\nBlinken, in Doha for the last stop of a tour to promote President Joe Biden's Gaza ceasefire roadmap, said the United States would work with regional partners to \"close the deal\".\n- Hezbollah rockets -As the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\nThe Gaza war broke out after Hamas's October 7 attack which resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\n- 'Starvation' -A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\"."}, {"id": "282c2220-8bea-441b-b069-ffe9a0cb1d15", "title": "Mangaluru City Police : Boliyar stabbing : 7 more arrested | Mangaluru News", "date": "2024-06-13 04:00", "url": "https://timesofindia.indiatimes.com/city/mangaluru/boliyar-stabbing-7-more-arrested/articleshow/110951850.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently70-year-old man stabbed in 'revenge' in Delhi, accused heldA 42-year-old man, Amit, was arrested for stabbing a 70-year-old in north Delhi.\nCity Police Commissioner Anupam Agrawal reported the incident in front of a bar in Boliyar.\nMangaluru: The city police have arrested seven more people in connection with the stabbing of two BJP workers at Boliyar in Konaje police station limits on Sunday evening.\nWith this, the total arrested accused in the case has gone up to 13.City police commissioner Anupam Agrawal said that the arrested accused are Imran, Koli Irshad, Tajuddin alias Sadiq, Sarvan, Mubarak, Ashraf and Tallath.\nThe police had booked a case against 20 accused in the stabbing incident.Three special teams have been constituted to trace all the absconding accused."}, {"id": "b4949141-f341-4634-8f08-e32696c68fd5", "title": "Best Reed Sheppard destinations in 2024 NBA Draft", "date": "2024-06-13 01:30", "url": "https://clutchpoints.com/best-reed-sheppard-destinations-in-2024-nba-draft", "domain": "clutchpoints.com", "domain_classification": "Unknown", "message": "With the 2024 NBA Draft just two weeks away, there is plenty of time to analyze the best fits for each of the top prospects in this class.\nSheppard was arguably the best freshman in the country in 2023-24, flying up draft boards to become a potential top-five pick.\nSheppard especially looks like a strong fit with the Houston Rockets or San Antonio Spurs should they choose to draft him.\nIn 2021, they used the second overall pick on Jalen Green out of G League Ignite.\nIf the Spurs have the chance to select Sheppard in the 2024 NBA Draft, they shouldn't hesitate."}, {"id": "97905757-3593-4e85-8b1b-f3fa6d3c68a7", "title": "The Latest | Hezbollah rocket barrage ups pressure on Israel as Gaza cease - fire negotiations drag on", "date": "2024-06-13 00:45", "url": "https://kdhnews.com/news/nation/the-latest-hezbollah-rocket-barrage-ups-pressure-on-israel-as-gaza-cease-fire-negotiations-drag/article_c092c347-1b0e-5914-9954-4d75e32298f9.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "Killeen, TX (76540)TodayMostly clear.\nA stray shower or thunderstorm is possible.\nWinds ESE at 5 to 10 mph..TonightMostly clear.\nA stray shower or thunderstorm is possible.\nWinds ESE at 5 to 10 mph."}, {"id": "6eb7cb1f-2b09-42dc-87bd-3578acd48f8f", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 05:30", "url": "https://www.recorderonline.com/news/national_news/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/article_d26c36b7-2cea-56dd-b6a3-8079b087c587.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have launched a boat-borne bomb attack against a commercial ship in the Red Sea, further escalating their campaign despite a U.S.-led campaign trying to protect the vital waterway"}, {"id": "03446c95-90ea-45d1-80ce-c34f96737e7a", "title": "World News | Yemen Houthi Rebels Launch Boat - borne Attack Against Greek - owned Ship in Red Sea", "date": "2024-06-13 01:15", "url": "https://www.latestly.com/agency-news/world-news-yemens-houthi-rebels-launch-boat-borne-attack-against-greek-owned-ship-in-red-sea-6034005.html", "domain": "latestly.com", "domain_classification": "Unknown", "message": "Dubai, Jun 13 (AP) Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a US-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the US campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe captain “reports the vessel is taking on water, and not under command of the crew,” the UKMTO said.\nThough he and others stressed at the time they were still investigating the attack, he stressed it appeared the vessel targeted had nothing to do with the war."}, {"id": "ce1c7e46-fe2c-4ab1-bbcf-a677e7ed833d", "title": "Murders & pilot errors : 6 African heads of state & govt who died in plane crashes", "date": "2024-06-13 01:00", "url": "https://www.pulse.ng/news/world/murders-and-pilot-errors-6-african-heads-of-state-and-govt-who-died-in-plane-crashes/y4pv1x2", "domain": "pulse.ng", "domain_classification": "Unknown", "message": "Mauritania Prime Minister Ahmed Ould BouceifOn May 27, 1979, a plane carrying Ahmed Ould Bouceif, the Prime Minister of Mauritania, crashed off the coast of Dakar, Senegal.\nPhoto Credit: Getty Pulse Live KenyaHowever, he died just a month later in a plane crash.\nThe situation in Burundi, however, remained peaceful, with the government declaring the plane crash an accident and appealing for calm.\nCentral African Republic Prime Minister Barthélemy BogandaADVERTISEMENTBarthélemy Boganda, the first Prime Minister of the Central African Republic, died in a plane crash on March 29, 1959, while en route from Berbérati to Bangui.\nMadagascar Prime Minister Joël RakotomalalaJoël Rakotomalala, the 9th Prime Minister of Madagascar, died in a helicopter accident on July 30, 1976."}, {"id": "b46926ad-ac4c-4f96-b75a-b526deb4dd36", "title": "Russian Flotilla Off Florida Coast Sparks Deployment of US Navy Destroyers , Planes", "date": "2024-06-13 02:45", "url": "https://www.military.com/daily-news/2024/06/12/navy-deployed-3-destroyers-planes-monitor-russian-submarine-and-frigate-off-florida-coast.html", "domain": "military.com", "domain_classification": "Unknown", "message": "The Pentagon deployed three Navy destroyers and maritime patrol aircraft this week to keep tabs on a group of Russian ships that conducted missile exercises and reportedly got within 30 miles of the Florida coast.\nThey also identified U.S. Navy P-8 Poseidon maritime patrol and anti-submarine aircraft as part of the response.\nAccording to images uploaded to sites such as Telegram by Russian state-run outlets, the Russian ships, including the frigate and the submarine, pulled into Havana on Wednesday.\nThe defense official who spoke with Military.com said that, while Russian naval visits to Cuba are routine, they have \"ratcheted up because of U.S. support to Ukraine and exercise activity in support of our NATO allies.\"\nRelated: Navy Relieved 12 Commanders in 6 Months -- Including 3 Firings that Were Never Publicly Announced"}, {"id": "2208aa46-b4ef-4b7c-86e0-f62f138be500", "title": "Nine killed , 29 injured , in Russian missile attack on Kryvyi Rih", "date": "2024-06-13 02:15", "url": "https://www.aljazeera.com/news/2024/6/13/nine-killed-29-injured-in-russian-missile-attack-on-kryvyi-rih", "domain": "aljazeera.com", "domain_classification": "International", "message": "Five children among those hurt after missile hit an apartment block in latest attack on Ukrainian president’s hometown.\nNine people have been killed and 29 injured, including five children, after a Russian ballistic missile struck an apartment building in Kryvyi Rih, Ukraine’s Interior Minister Ihor Klymenko said.\n“Every day and every hour, Russian terror proves that Ukraine, together with its partners, should strengthen air defences,” Ukrainian President Volodymyr Zelenskyy said after the attack.\nAbout 635,000 people lived in Kryvyi Rih before Russia launched its full-scale invasion of Ukraine in February 2022.\nIt lies in the southern industrial Dnipropetrovsk region where officials said three people, including a 13-year-old boy, were injured in a Russian drone attack on Wednesday."}, {"id": "ff150fcf-a00f-4be4-ae1f-a4746eb2af86", "title": "US fears Middle East conflict growing as Israel and Hezbollah exchange attacks as Gaza ceasefire deal teeters", "date": "2024-06-13 01:30", "url": "https://www.yahoo.com/news/us-fears-middle-east-conflict-002242457.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On Tuesday, Israeli forces killed a senior Hezbollah commander, Taleb Sami Abdullah, known as Abu Taleb, near the Lebanon-Israel border.\nThroughout the war, Yemen’s Iran-backed Houthi militants and an Iran-aligned group in Iraq have targeted ships passing through the busy Red Sea shipping corridor, in protest of the Israeli war effort in Gaza.\nA series of Hezbollah attacks last week set off massive forest fires in Northern Israel, and Israeli prime minister Benjamin Netanyahu promised “a very strong action” in response.\n“That will take a tremendous amount of pressure out of the system.”There’s still considerable daylight between Israel, Hamas, and the US, over a proposed ceasefire deal.\nSenior Hamas official Osama Hamdan told AFP it is seeking to add provisions guaranteeing \"a permanent cease-fire and complete withdrawal\" by the IDF, demands Israel has rejected."}, {"id": "dac85ad4-e77f-471d-adf0-00babd4b2b5b", "title": "Yemen Houthi Rebels Launch Boat - Borne Attack Against Greek - Owned Ship In Red Sea", "date": "2024-06-13 04:15", "url": "https://www.outlookindia.com/international/yemens-houthi-rebels-launch-boat-borne-attack-against-greek-owned-ship-in-red-sea", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "AP journalists on an embark with the US Navy happened to be interviewing Cmdr.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer Laboon, when the alert came in on the attack.\nBlomberg took multiple calls from sailors on board the vessel giving updates on the apparent attack.\nThe Laboon is one of the destroyers accompanying the USS Dwight D. Eisenhower aircraft carrier and both has shot down Houthi fire and escorted vessels through the region."}, {"id": "d2236cb2-c913-4557-ba37-e1398c029c99", "title": "1st LD Writethru : Yemen Houthis claim responsibility for attacking cargo ship , Israeli cities", "date": "2024-06-13 01:30", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/13/content_117250616.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA, June 12 (Xinhua) -- Yemen's Houthi group claimed responsibility on Wednesday for an attack on a cargo ship in the Red Sea and missile and drone strikes on two Israeli cities.\nHouthi military spokesman Yahya Sarea said in a televised statement that the group targeted the ship, identified as the \"Tutor,\" using \"an unmanned boat, several drones, and ballistic missiles.\"\nSarea justified the attack by accusing the cargo ship's owner of violating a Houthi ban on entering Israeli ports.\nThere has been no official statement from the Israeli side on the Houthi-claimed attacks.\nOf the 21 crew members of different nationalities aboard the ship, one has been declared missing in the first attack, the official said."}, {"id": "a9656970-af40-4a03-a4ce-2c65cefac5d4", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 00:45", "url": "https://kdhnews.com/news/nation/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/article_8d99d1d4-807b-5908-9fa3-d43592336e8e.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "Thank you for reading!\nPlease purchase a subscription to read our premium content.\nIf you have a subscription, please log in or sign up for an account on our website to continue."}, {"id": "f64fe91d-0817-4e0c-b945-68cbcdfe308a", "title": "Kyiv Oblast enterprise ablaze for second day in a row after mass Russian attack on June 12", "date": "2024-06-13 07:45", "url": "https://www.yahoo.com/news/kyiv-oblast-enterprise-ablaze-second-062300347.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kyiv Oblast enterprise ablaze for second day in a row after mass Russian attack on June 12Firefighting efforts still ongoing in Kyiv OblastFirefighters are still making efforts to extinguish the fire occurred after Russian June 12 attack on an industrial facility in Kyiv Oblast as of June 13, Ukraine’s State Emergency Service reported.\nДСНС Київщини249 firefighters, 98 pieces of equipment, and four fire engines are involved in extinguishing the fire as of 7:00 a.m. EET.\nДСНС КиївщиниДСНС КиївщиниRussian mass attack on June 12Russia sent a mass missile and drone attack primarily directed at Kyiv using Kh-101/Kh-555/Kh-55 cruise missiles from Tu-95MS strategic bombers and Shahed drones overnight on June 12.\nKyiv and Kyiv Oblast were the key targets.\nRead the original article on The New Voice of Ukraine"}, {"id": "6c9fa1ef-a39e-4ad8-bbe1-0b9b8c31e720", "title": "Drone identifies , eliminates , armed terrorist", "date": "2024-06-13 07:30", "url": "https://www.israelnationalnews.com/news/391488", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "פעילות כוחות צה\"ל ברצועת עזה צילום: דובר צה\"לIDF troops are continuing intelligence-based, targeted operations in the area of Rafah.\nOver the past day, the troops conducted targeted raids in the area, located weapons, and eliminated several terrorists in close-quarters encounters.\nDuring one of the operations, IDF troops used a drone to identify and strike an armed terrorist.\nOver the past day, the troops eliminated more than ten terrorist operatives, including a terrorist who took part in the October 7th massacre in southern Israel.\nMoreover, over the past day, the IAF struck and dismantled over 45 terror targets throughout the Gaza Strip, including military structures, armed terrorist cells, rocket launchers, tunnel shafts, and additional terrorist infrastructure."}, {"id": "e0d7866d-5859-41b2-818c-7cda0cd47002", "title": "Russia Ukraine war : Nine dead in Russian missile strike on Zelensky hometown - latest", "date": "2024-06-13 06:15", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-nuclear-weapons-latest-b2561724.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}G7 leaders are gathering today in Italy to discuss a plan that would unlock $50 billion of frozen Russian assets to use in funds for Ukraine’s war effort.\nThe summit comes as at least nine people have been killed and 29 injured in Russian airstrikes on Volodymyr Zelensky’s hometown Kryvyi Rih.\nThose killed in Kryvyi Rih include five children, officials said, after Russian missiles hit an apartment block in the town.\nThe deadly attack struck after Ukraine’s military hit three Russian surface-to-air missile systems in Moscow-occupied Crimea on Tuesday, its second reported strike on air defences on the peninsula this week."}, {"id": "bb9f9da5-00eb-43ce-8341-7f652934972c", "title": "Hezbollah Rains Down 160 Rockets On Northern Israel As War Expands", "date": "2024-06-13 04:45", "url": "https://www.zerohedge.com/geopolitical/hezbollah-rains-down-160-rockets-northern-israel-war-expanding", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "The Israel-Hezbollah war continues spreading and expanding along the border region, as on Wednesday the Shia paramilitary group backed by Iran fired some 160 missiles into Israel after the IDF killed a top Hezbollah commander, Taleb Sami Abdullah, in south Lebanon the day prior.\nIllustrative, via NBCThe commander oversaw all of the group's military operations in the central area of the Lebanon-Israel border, Hezbollah later confirmed.\nHe was so senior in the organization that he been active in fighting Israel even going back to the 1990s.\nAn Israeli military statement had confirmed his identity: \"Israeli Airforce aircraft eliminated Sami Taleb Abdullah, the commander of the Nasr Unit in the Hezbollah terrorist organization, last night,\" the IDF announced Wednesday.\nSlain Hezbollah commander Sami Taleb Abdullah, source: Israel HayomThe past week has also witnessed Israel's war cabinet take part in active discussion over whether to mobilize reserve forces, and whether the northern front should be expanded and an official war declaration made."}, {"id": "d87b48ef-9d8b-4961-9d7f-e73751a88b7c", "title": "Unmasking Iran strategy to take over the Middle East", "date": "2024-06-13 00:45", "url": "https://www.ynetnews.com/article/byo7jvdba", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Iran is spending billions of dollars to enact a four-part strategy to dominate the Middle East.\nThe short answer is that Iran’s money financed a highly productive strategy to project its power in the Middle East at the expense of Israel and the United States.\nIran’s money financed a highly productive strategy to project its power in the Middle East at the expense of Israel and the US.\nOperationally, Iran’s strategy is based first and foremost on the seemingly unending supply of “shahids” (martyrs) who are ready, either as true believers or because of mercenary motives, to wage jihad.\nThus, in their strategy, Iran’s terrorist armies take full advantage of the laws of warfare applying only to sovereign states."}, {"id": "eae7dec3-9eb0-482f-95fa-4c41e6029959", "title": "This Day in History", "date": "2024-06-13 07:45", "url": "https://www.smdailyjournal.com/lifestyle/this-day-in-history/article_9827a0ba-2777-11ef-9be0-efab338c5302.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.\nA new puzzle every day, seven days a week!"}, {"id": "949c56d3-d544-44ba-806a-414baf72aabb", "title": "US Library Of Congress Spotlights Its American  treasures  ", "date": "2024-06-13 09:15", "url": "https://www.forbesindia.com/article/lifes/us-library-of-congress-spotlights-its-american-treasures/93371/1", "domain": "forbesindia.com", "domain_classification": "Unknown", "message": "The US Library of Congress houses more than just books, with a new exhibit opening this week highlighting some of the institution's most diverse and symbolic treasures from the nation's history.\nFrom the contents of Abraham Lincoln's pockets the night of his assassination to early Spiderman sketches, a hundred treasures from the United States and beyond are on display from Thursday.\n\"The Library of Congress holds more than 178 million items in its collections, perhaps the most comprehensive collection of human knowledge ever assembled in one place,\" said its director, Librarian of Congress Carla Hayden.\nThe exhibit, officially titled \"Collecting Memories: Treasures from the Library of Congress,\" features only a tiny fraction of the institution's vast troves of millions of books, audio documents and photographs, as well as objects of all kinds, including numerous musical instruments.\n\"\"There's kind of a mythology around Abraham Lincoln, and this is all very humanizing, I think in many ways."}, {"id": "174f3009-516f-46f1-a30e-b67cd8c16f85", "title": "CPD : Juvenile grazed in the head during drive - by shooting in East Price Hill", "date": "2024-06-13 01:15", "url": "https://www.wcpo.com/news/local-news/neighborhood-news/east-price-hill/cpd-juvenile-grazed-in-the-head-during-drive-by-shooting-in-east-price-hill", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "CINCINNATI — A juvenile was grazed by a bullet in a drive-by shooting Wednesday evening in East Price Hill, Cincinnati police said.\nCPD said a juvenile girl, who's exact age hasn't been revealed, had a graze to the head.\nAn officer on scene said a black SUV fled the scene with four male occupants in the vehicle.\nThis is the second juvenile who has been injured in a drive-by shooting in Cincinnati in the last 24 hours.\nTuesday evening around 8:30 p.m. a 15-year-old boy was injured in a drive-by shooting near South Avondale Elementary School."}, {"id": "4ca65143-719e-459c-b15b-00ba4269e21f", "title": "Arizona Man Planned to Incite Race War with Mass Shooting at Atlanta Concert , Authorities Say", "date": "2024-06-13 02:45", "url": "https://www.yahoo.com/news/arizona-man-planned-incite-race-021813235.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The source allegedly informed authorities that they spoke with Prieto more than 15 times over three years at various gun shows.\nPrieto allegedly began to make suspicious and alarming comments as their conversations leaned more political.\nThe following day, he allegedly sold a firearm to the undercover agent for $2,000.\nWhile authorities did not identify whose concert Prieto planned to attack, the two proposed dates coincided with the two nights Bad Bunny was performing.\nAt the time of arrest, he allegedly confirmed he knew both the source and the undercover agent and discussed orchestrating a mass shooting in Atlanta."}, {"id": "f7b37065-8805-471f-84b8-e7f102b1eaa1", "title": "Russia - Ukraine war : List of key events , day 839", "date": "2024-06-13 02:15", "url": "https://www.aljazeera.com/news/2024/6/13/russia-ukraine-war-list-of-key-events-day-839", "domain": "aljazeera.com", "domain_classification": "International", "message": "Russia-Ukraine war: List of key events, day 839As the war enters its 839th day, these are the main developments."}, {"id": "417ef32b-6b05-4ca6-8dd9-bdd64a51c8b3", "title": "See where the experts have UConn stars Stephon Castle and Donovan Clingan going in the NBA Draft", "date": "2024-06-13 00:15", "url": "https://www.courant.com/2024/06/12/nba-mock-draft-see-where-some-experts-have-uconn-stars-stephon-castle-and-donovan-clingan-landing/", "domain": "courant.com", "domain_classification": "Unknown", "message": "Dom Amore: With cool precision, Xander Schauffele strives for the top of PGA world at The Travelers"}, {"id": "da150a07-09a0-4cb1-a455-b8bfad3b3e03", "title": "Invaders Fired Seven Times At Border Of Sumy Region", "date": "2024-06-13 07:45", "url": "https://menafn.com/1108327617/Invaders-Fired-Seven-Times-At-Border-Of-Sumy-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) At night and in the morning, the Russian military fired 7 times at the border areas and settlements of Sumy region.\n\"At night and in the morning, the Russians fired 7 times at the border areas and settlements of the Sumy region.\nThe enemy fired at the Khotyn community with artillery (3 explosions).\nIn the Krasnopilska community, mortar shelling (2 explosions) and artillery (4 explosions) were recorded.\nAs Ukrinform reported earlier, Russian troops fired 14 times during the day at the border areas and settlements of Sumy region , with a total of 41 explosions recorded."}, {"id": "f65b37c6-823c-4b04-b2bc-bd8a1ded2f3a", "title": "Russian forces  deliberately starved  Ukrainians in Mariupol , new report claims", "date": "2024-06-13 06:15", "url": "https://www.independent.co.uk/news/world/europe/ukraine-war-russia-mariupol-starvation-report-b2561231.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}Russian forces deliberately starved Ukrainians in Mariupol as a tactic of war by targeting their water, food and medical facilities before taking the strategic port city in 2022, according to an investigation by an international human rights group.\nAs they lay siege to Mariupol between February and May 2022, Russian forces attacked its energy, water, food and healthcare infrastructure, Ms Murdoch said.\nSatellite imagery collected by the investigators also showed that Russian fighter aircraft deliberately attacked the Mariupol drama theatre, where hundreds of people were sheltering, with “two 500kg bombs” on 16 March.\nRussian forces hit the Neptun swimming pool complex, which has been turned into a food distribution point, despite the presence of hundreds of civilians.\nThe remaining civilians were “systematically vetted by pro-Russian forces for their loyalties to the Russian State apparatus, through a compulsory security screening process known as ‘filtration’,” the report claimed."}, {"id": "3c1e82fa-5af2-4e02-8ce2-7c69eac0a488", "title": "Arizona man sold firearms to undercover FBI agent for mass shooting , indictment says", "date": "2024-06-13 02:45", "url": "https://www.sandiegouniontribune.com/news/nation-world/story/2024-06-12/arizona-man-sold-firearms-to-undercover-fbi-agent-for-mass-shooting-indictment-says", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "PHOENIX — A firearms dealer in Arizona sold weapons to an undercover federal agent he believed would help him carry out his plan for a mass shooting targeting minorities, an attack that he hoped would “incite a race war,” according to a federal grand jury indictment.\nThe indictment says the 58-year-old from Prescott, Arizona, recruited the undercover FBI agent and an informant at a gun show where Prieto was a vendor.\nThe indictment says planning for the shooting began in January and took place over several months at gun shows around Arizona, including in Phoenix and Tucson.\nAt the gun shows, the indictment alleges, Prieto sold two rifles to be used in the shooting to the FBI agent.\nPrieto was arrested in New Mexico on May 14 — around the time of the Atlanta concert — while driving east from Arizona."}, {"id": "bb298897-c1b0-4b03-9497-9932271c8916", "title": "UK to announce over $300 million in aid for Ukraine at G7 Summit", "date": "2024-06-13 06:15", "url": "https://www.yahoo.com/news/uk-announce-over-300-million-002846983.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "UK to announce over $300 million in aid for Ukraine at G7 SummitUK Prime Minister Rishi Sunak will announce a £242 million (approximately US$309 million) aid package for Ukraine at the G7 summit in Italy.\nSource: UK government websiteQuote from the message: \"At the Summit, the Prime Minister will announce up to £242 million in bilateral assistance to Ukraine, to support immediate humanitarian, energy and stabilisation needs, and lay the foundations for longer term economic and social recovery and reconstruction.\"\nThe press release stressed that the prime minister’s priority at the summit will be working with partners to agree on ways to use frozen Russian assets to support Ukraine.\nQuote from Sunak: \"We must be decisive and creative in our efforts to support Ukraine and end Putin’s illegal war at this critical moment.\nThe UK remains at the forefront of the international response as we have been from the outset."}, {"id": "45a946b1-88f2-4de8-801b-eb9e99e3bc7c", "title": "Arizona man sold firearms to undercover FBI agent for mass shooting , indictment says – Winnipeg Free Press", "date": "2024-06-13 01:45", "url": "https://www.winnipegfreepress.com/world/2024/06/12/arizona-man-sold-firearms-to-undercover-fbi-agent-for-mass-shooting-indictment-says", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "PHOENIX (AP) — A firearms dealer in Arizona sold weapons to an undercover federal agent he believed would help him carry out his plan for a mass shooting targeting minorities, an attack that he hoped would “incite a race war,” according to a federal grand jury indictment.\nThe indictment says the 58-year-old from Prescott, Arizona, recruited the undercover FBI agent and an informant at a gun show where Prieto was a vendor.\nThe indictment says planning for the shooting began in January and took place over several months at gun shows around Arizona, including in Phoenix and Tucson.\nAt the gun shows, the indictment alleges, Prieto sold two rifles to be used in the shooting to the FBI agent.\nPrieto was arrested in New Mexico on May 14 — around the time of the Atlanta concert — while driving east from Arizona."}, {"id": "796ca9e6-bac2-4100-bf44-569d46d701ec", "title": "A view from both sides of the Israel - Lebanon border", "date": "2024-06-13 01:30", "url": "https://www.ypradio.org/2024-06-12/a-view-from-both-sides-of-the-israel-lebanon-border", "domain": "ypradio.org", "domain_classification": "Unknown", "message": "And this was just the latest escalation in fighting between Hezbollah and Israel since the war in Gaza began in October.\nKat, Jane, good to have you here.\nSHAPIRO: So I'm picturing you, Jane and Kat, on opposite sides of this border, with rockets flying back and forth.\nKat, is the Israeli military ready for a second front in the north?\nI mean, a war with Hezbollah in Lebanon would be very different from the war against Hamas in Gaza."}, {"id": "64796d13-315d-49c2-ad9d-dc2e509fb976", "title": "Arizona man sold firearms to undercover FBI agent for mass shooting , indictment says", "date": "2024-06-13 06:15", "url": "https://article.wn.com/view/2024/06/13/Arizona_man_sold_firearms_to_undercover_FBI_agent_for_mass_s_0j/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "PHOENIX — A firearms dealer in Arizona sold weapons to an undercover federal agent he believed would help him carry out his plan for a mass shooting targeting minorities, an attack that he hoped would \"incite a race war,\" according to a federal grand jury indictment.\nMark Adams Prieto was indicted Tuesday by the... read full story"}, {"id": "3d358b28-6cf3-4c76-9fee-18460981d877", "title": "Russian submarines and warships dock in Cuba as Cold War allies reconnect", "date": "2024-06-13 08:45", "url": "https://www.mirror.co.uk/news/world-news/russian-submarines-warships-dock-cuba-33019741", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Earlier this week, amid rising tensions with the West, NATO warships closely monitored the Russian Navy as they conducted military exercises en route to Cuba.\nVladimir Putin is reportedly gearing up for a trip to North Korea, marking his third meeting with Kim Jong Un.\nThe US, South Korea and their allies suspect that North Korea has been supplying Russia with artillery, missiles and other conventional weapons to aid its war in Ukraine.\nJapanese broadcaster NHK, citing anonymous sources including high-ranking Russian officials, has reported that Putin is preparing to visit North Korea and Vietnam next week.\nMeanwhile, North Korea appears to be seeking help with space technology after its failed attempt to launch a second spy satellite into orbit in late May."}, {"id": "f5d65d23-753a-4b02-9110-598e7be447ed", "title": "Arizona man sold firearms to undercover FBI agent for mass shooting , indictment says", "date": "2024-06-13 01:45", "url": "https://www.thespec.com/news/world/united-states/arizona-man-sold-firearms-to-undercover-fbi-agent-for-mass-shooting-indictment-says/article_de2382b7-e042-5822-8bee-fc66e24bc0a0.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "d9e46452-fdf0-4482-a482-cfea4187b00e", "title": "Arizona Man Indicted for Gun - Trafficking and Hate Crime Plot", "date": "2024-06-13 00:45", "url": "https://www.devdiscourse.com/article/law-order/2980790-arizona-man-indicted-for-gun-trafficking-and-hate-crime-plot", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "An Arizona man has been indicted on four counts of gun-trafficking crimes after federal prosecutors said an undercover sting operation revealed that he planned to kill Black people in a mass shooting to \"incite a race war,\" according to the indictment.\nA grand jury indicted Mark Adams Prieto, 58, on Tuesday on charges of gun trafficking, transferring a gun for use in a hate crime and possession of an unregistered gun.\nBetween January and May, Prieto met repeatedly with the undercover agent and a source secretly helping the FBI at various gun shows around Arizona.\nBefore January, he had talked with the FBI source about \"carrying out a mass shooting targeting African Americans, Jews, and Muslims,\" the indictment said.\nIn March, Prieto sold to the undercover agent an AR-15 semiautomatic rifle to use in the attack at a Phoenix gun show."}, {"id": "43003952-4442-472f-bae7-e3f6f0fd4e0f", "title": "Gaza war rages as US wants to  close  truce deal", "date": "2024-06-13 03:15", "url": "https://thesun.my/world/gaza-war-rages-as-us-wants-to-close-truce-deal-GB12571689", "domain": "thesun.my", "domain_classification": "Unknown", "message": "DOHA: Top US diplomat Antony Blinken said Wednesday that a truce and hostage release deal to end the Gaza war was still possible, wrapping up a Middle East tour as deadly fighting rocked the Palestinian territory.\nBlinken, in Doha for the last stop of a tour to promote President Joe Biden’s Gaza ceasefire roadmap, said the United States would work with regional partners to “close the deal”.\n- Hezbollah rockets -As the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel’s northern border with Lebanon.\nThe Gaza war broke out after Hamas’s October 7 attack which resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\n- ‘Starvation’ -A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of “extermination”."}, {"id": "d32921f3-8a34-423c-9f5e-8a94b5b9cdc5", "title": "TTC bus stabbing : one person seriously injured", "date": "2024-06-13 01:30", "url": "https://www.cp24.com/news/one-person-seriously-injured-in-stabbing-on-ttc-bus-in-etobicoke-1.6924592", "domain": "cp24.com", "domain_classification": "Unknown", "message": "An argument led to a stabbing on a TTC bus in Etobicoke that left two people injured late Wednesday afternoon, Toronto police said.\nOfficers received a call for a stabbing near Berry and Park Lawn roads, north of the Queensway, shortly before 6 p.m.Two males were reportedly having a verbal argument on a TTC bus and stabbed each other, police said.\nWhen officers arrived, they located one of the males with a stab wound.\nPolice said the second male fled the scene but was later located by officers.\nIt is unclear if the two males know each other and what led to the argument."}, {"id": "52b9b070-c5f2-4beb-b340-c3ecfb526057", "title": "Russia Ukraine update : Nine killed in attacks on Ukraine as US widens sanctions on Russia", "date": "2024-06-13 00:30", "url": "https://www.9news.com.au/world/russia-ukraine-conflict-us-announces-new-sanctions-ahead-of-g7-meeting/87cdfca1-f64d-424f-9625-976ddeae6a68", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Zelenskyy said the strike had again proven that \"Ukraine, together with its partners, must strengthen its air defences\" - something that he has repeatedly appealed for with Ukraine's Western partners.\nEmergency workers in Ukraine clear the rubble as they search for victims after a Russian missile hit the area, in Kryvyi Rih, Ukraine, on Wednesday, June 12.\nToday, President Joe Biden and the other Group of Seven leaders will gather in Italy for their annual summit to discuss ways to help Ukraine, including how to divert more frozen Russian assets to Kyiv's defence.\n(AP Photo/Alex Brandon) (AP)Seven Chinese and Hong-Kong-based companies were targeted for shipping millions of dollars of material to Russia, including items which could be used in Russian weapons systems.\nUS officials say China is the leading supplier of critical components to Russia, supplying both Chinese and Western technology."}, {"id": "2a79f595-06ad-4dcd-91f3-aeda6b7d47b2", "title": "Huthis claim attack on merchant ship in Red Sea off Yemen", "date": "2024-06-13 04:15", "url": "https://www.bssnews.net/news-flash/194894", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DUBAI, June 13, 2024 (BSS/AFP) - Yemen's Iran-backed Huthi rebels on Wednesday claimed an attack on a merchant ship in the Red Sea, part of an ongoing campaign they say is an act of solidarity with Palestinians.\nThe Huthis, who are at war with a Saudi-led coalition after ousting the government from Sanaa in 2014, have launched scores of drone and missile attacks on shipping in the Red Sea and Gulf of Aden since November.\nIn a statement on Wednesday, the rebels said they had carried out a \"military operation targeting the Tutor ship in the Red Sea, using a naval drone, aerial drones and ballistic missiles\".\nIt added that the vessel was \"hit for a second time by an unknown airborne projectile\" and that military authorities were assisting.\nCENTCOM -- which along with British forces has been conducting strikes in rebel-held Yemen in retaliation for the Red Sea attacks -- also said it had destroyed three anti-ship missile launchers and a Huthi drone over the past 24 hours."}, {"id": "2d1f84bc-148c-4681-ad1c-c347fb9346e5", "title": "Stung by rebel drone tactics , Myanmar junta builds its own fleet", "date": "2024-06-13 04:30", "url": "https://www.japantimes.co.jp/news/2024/06/13/asia-pacific/myanmar-rebels-junta-chinese-drone/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Myanmar's resistance fighters notched decisive breakthroughs last year by relying on a scattered fleet of drones in battles against one of Southeast Asia's most feared militaries.\nBut as the civil war grinds on, the rebels increasingly find their familiar weapons — Chinese-made commercial drones modified to carry arms — in the unfamiliar hands of the country's ruling junta, according to seven people with knowledge of the matter.\n\"The battle is changing now as drones are being used by both sides,\" said a 31-year-old rebel fighter in the country's southeast, identifying himself by the nom de guerre of Ta Yoke Gyi.\nHe said the junta began using armed unmanned aerial vehicles (UAVs) to attack the rebels at around the turn of the year, and that a drone his unit recently shot down was identified as Chinese from its components and had been modified for combat.\nTwo rebel fighters in other parts of Myanmar also described similar skirmishes."}, {"id": "1e79ec65-ab28-4c25-af36-ba17db41dc3e", "title": "After historic expansion of VA health care , VA Manchester hosts PACT Act summer event for veterans", "date": "2024-06-13 02:45", "url": "https://www.unionleader.com/news/military/after-historic-expansion-of-va-health-care-va-manchester-hosts-pact-act-summer-event-for/article_f745aa36-2814-11ef-a30b-6fff4229db59.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "b92c6ccb-3279-4a86-9ffe-66cc48840545", "title": "UN agency finds both Israel and Hamas committed war crimes in early stages of the war", "date": "2024-06-13 04:15", "url": "https://www.voanews.com/a/un-agency-finds-both-israel-and-hamas-committed-war-crimes-in-early-stages-of-the-war/7654003.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "While in Qatar, U.S. Secretary of State Antony Blinken says Hamas’ response to the proposed cease-fire proposal includes “numerous” changes – some of which are “workable, some are not.” It comes on the same day that a United Nations inquiry finds that both Israel and Hamas committed war crimes at the onset of the war.\nPresident Joe Biden wants a ban on assault weapons.\nHis opponent, Donald Trump, says Biden is threatening the constitutional rights of gun owners.\nInter-Korean relations have sunk to their lowest level in years, as both countries intensify cross-border psychological warfare.\nAustralia’s national science agency warns a lack of scientists specialized in plant breeding could lead to \"dire\" food security implications around the world."}, {"id": "85bd0913-e9a7-46b4-8c2f-7c7f5d406a72", "title": "EU To Surrender Russian Assets To Ukraine | Armstrong Economics", "date": "2024-06-13 05:45", "url": "https://www.armstrongeconomics.com/world-news/war/eu-to-surrender-russian-assets-to-ukraine/", "domain": "armstrongeconomics.com", "domain_classification": "Unknown", "message": "Spread the loveThe United States discussed plans to provide Ukraine with a loan paid out with Russian assets that have been frozen since the start of the war.\nThe bulk of frozen Russian assets lie in Europe, and the European Union has announced its plans to “make Russia pay” by allocating those assets to Ukraine to fund its war against Russia directly.\nUkraine will receive $1.6 billion in frozen Russian assets this July, according to European Commission President Ursula von der Leyen who spoke at the Ukraine Recovery Conference 2024 on June 11.\nThe elites claim these funds amount to money that the Russian oligarchs stole from the Russian people, but that is simply not the case.\nThe West has confiscated assets from a foreign nation during a time of peace as Ukraine is not in the NATO alliance."}, {"id": "7b051d16-7e13-4a43-ae17-5fd8531c1780", "title": "Warplanes : Israel Expands its F - 35 Force", "date": "2024-06-13 04:30", "url": "https://www.strategypage.com/htmw/htairfo/articles/20240613042.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "June 13, 2024: Israel has ordered another 25 F-35 fighters, which will give Israel three F-35I squadrons.\nIsrael demonstrated what the F-35 was capable of in 2019 when Israel had only 14 F-35I fighters and some had been operational for over a year.\nF-35 software was designed over a decade ago when much less was known about how combat aircraft software could be hacked and already some basic changes in F-35 software architecture are underway to deal with that.\nSome major upgrades are needed in how F-35 software changes are made and how quickly.\nInitial reactions of Israeli F-35I pilots and air force commanders were positive."}, {"id": "1409056d-ba12-4f0a-9d71-f2733a1279cb", "title": "Warplanes : Israel Expands its F - 35 Force", "date": "2024-06-13 04:45", "url": "http://www.strategypage.com/htmw/htairfo/articles/20240613042.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "June 13, 2024: Israel has ordered another 25 F-35 fighters, which will give Israel three F-35I squadrons.\nIsrael demonstrated what the F-35 was capable of in 2019 when Israel had only 14 F-35I fighters and some had been operational for over a year.\nF-35 software was designed over a decade ago when much less was known about how combat aircraft software could be hacked and already some basic changes in F-35 software architecture are underway to deal with that.\nSome major upgrades are needed in how F-35 software changes are made and how quickly.\nInitial reactions of Israeli F-35I pilots and air force commanders were positive."}, {"id": "f312d79b-d323-4367-bb1c-a22e08d181af", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-13 03:30", "url": "https://www.tvguide.co.uk/schedule/10b51bbf-301f-505d-bd12-63cd096bce8f/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Thursday 13 June Share Add toCalendar +War Factories Season 4 Episode 5 of 10 S SubtitlesA French museum asks eccentric military equipment collector Bruce Crompton for help in acquiring an incredibly rare German Panzer 1 tank.\nHe also explores the remains of secret underground Nazi war factorieCombat Dealers airs on Discovery Channel HD at 9:00 AM, Thursday 13 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "25a49469-7e1e-470b-a8bd-694a093630c3", "title": "UN Says Both Israel And Hamas Are Guilty Of War Crimes", "date": "2024-06-13 00:15", "url": "https://www.shtfplan.com/headline-news/un-says-both-israel-and-hamas-are-guilty-of-war-crimes", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "The United Nations is now saying that both Israel and Hamas have committed war crimes and both sides are guilty.\nAn independent commission has found that both Hamas and Israel are to blame for crimes against humanity.\nIsraeli authorities have committed war crimes and crimes against humanity in Gaza since October 7th, a United Nations-backed commission has found following an independent investigation.\nThe probe also found that Palestinian armed groups were responsible for war crimes committed in Israel, according to a report by RT.\n“It is imperative that all those who have committed crimes be held accountable,” said the chair of the commission, Navi Pillay."}, {"id": "f3f5ba4d-4bad-49a0-80a6-e38a420ae813", "title": "World War II : Secrets from Above - National Geographic Channel HD", "date": "2024-06-13 04:15", "url": "https://www.tvguide.co.uk/schedule/4344df0b-21f9-5e6f-af48-3bce32d454d4/world-war-ii-secrets-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War II: Secrets from AboveNational Geographic Channel HD 10:00 AM to 11:00 AM Thursday 13 June Share Add toCalendar +Battle of the Atlantic Season 2 Episode 2 of 6 S Subtitles Audio DescriptionThe story of the Battle of the Atlantic, the longest military campaign of the Second World War as the Nazis attempted to starve BritainWorld War II: Secrets from Above airs on National Geographic Channel HD at 10:00 AM, Thursday 13 June .\n(Subtitles, audio description.)\nLearn more about World War II: Secrets from Above and other education/science/factual topics on our factual page"}, {"id": "cd20e441-9cf7-46a3-a5e1-571d5974285c", "title": "KNDS - Leonardo rupture could nix Italian Leopard 2 tank buy", "date": "2024-06-13 02:45", "url": "https://finance.yahoo.com/news/knds-leonardo-rupture-could-nix-164045466.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "ROME — A major Italian acquisition of Leopard tanks is on the brink of collapsing after a cooperation deal between tank manufacturer KNDS and Italy’s Leonardo was scrapped on Tuesday due to a row over technology transfer.\n“With 18 European user countries, Leopard 2 is the battle tank standard of our continent and of NATO.\nLast year’s Leonardo-KNDS cooperation deal also mentioned possible teaming on a separate Italian €5 billion ($5.4 billion) program to build 1,050 tracked fighting vehicles.\n“After this announcement today it is more difficult to imagine Italy working with KNDS on the A2CS program,” said the second source.\nThe rupture between KNDS and Leonardo could also have ramifications for Italy’s hoped-for entry into the European battle tank program known as the Main Ground Combat System (MGCS), which KNDS is running."}, {"id": "4e7b24d3-df74-4a33-9639-00fcd9025349", "title": "Taiwan self defence groups prepare for war with China", "date": "2024-06-13 02:15", "url": "https://www.theage.com.au/world/asia/this-man-fought-on-the-front-lines-in-ukraine-now-he-is-preparing-taiwanese-civilians-for-war-with-china-20240529-p5jhou.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Civil defence group members conduct night-time radio communication, formation and explosive identification exercises simulating attacks by Chinese soldiers, in New Taipei, Taiwan.\nAdvertisement“I’m from an older generation, so probably I will already be dead,” Chen says about the prospect of war with China.\nTony Lu, who fought in Ukraine alongside Australian Trevor Kjeldal, wears a T-shirt depicting his friend, who died in battle.\nAdvertisement“What was going through my mind was, ‘we have to do our part to help Ukraine’,” Lu says.\nKjeldal, 40, was killed in battle in the Luhansk region in November 2022, months after Lu left Ukraine."}, {"id": "8a12fb50-8ab7-4b96-841e-80f8f22bf23a", "title": "Islamic terrorists sacrifice children , then exploit the resulting outrage | WND", "date": "2024-06-13 00:45", "url": "https://www.wnd.com/2024/06/islamic-terrorists-sacrifice-children-exploit-resulting-outrage/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "This listing by Guterres, which includes Hamas and Palestinian Islamic Jihad terrorist organizations as well, is to be sent to the U.N. Security Council on June 14.\nObviously, this act equates the barbaric acts of Hamas in intentionally killing Israeli children and beheading babies to the unintentional killing of Palestinian children as a consequence of collateral fallout due to Hamas hiding among the innocent.\nUnwilling to sacrifice their seasoned soldiers to clear a path through the minefields, the mullahs recruited their own children to do it for them.\nMeanwhile, for the terrorists, a wounded Israeli they come across is a dead Israeli as they have been known to execute them on the spot.\nWhile such a mindset thrives for them when those dying children are infidels, it matters not if it comes to sacrificing Muslim children as well."}, {"id": "e31128bd-fb35-483d-97d4-2b380f57ca84", "title": "China appreciates enlightened Japanese  courage to expose historical truth on Japanese bacteriological warfare", "date": "2024-06-13 03:30", "url": "http://en.people.cn/n3/2024/0613/c90000-20180789.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "China appreciates enlightened Japanese' courage to expose historical truth on Japanese bacteriological warfareXinhua) 10:06, June 13, 2024BEIJING, June 12 (Xinhua) -- Regarding the Japanese scholars' donation of historical materials on Japanese biological warfare in China, a Chinese foreign ministry spokesperson said on Wednesday that the historical documents once again provide solid evidence that Japanese militarism committed bacteriological warfare crimes in China, and China appreciates the courage of enlightened Japanese to expose and confront the historical truth.\nSpokesperson Lin Jian made the remarks at a regular press briefing when asked to comment on Japanese scholars' donations.\nRecently, two Japanese scholars donated a large amount of historical materials on Japanese bacteriological warfare to China and expressed their hope for friendship and peace between Japan and China.\nThe historical materials they donated again demonstrate the undeniable and irrefutable evidence that Japanese militarism launched bacteriological warfare in China, he added.\nLin said Japan should face up to and deeply reflect on its history of aggression by Japanese militarism, learn from history, and avoid repeating past mistakes."}, {"id": "b7374a77-790e-42a7-9db8-dccb845232cc", "title": "Russia war with Ukraine accelerating global climate emergency , report shows | Climate crisis", "date": "2024-06-13 05:30", "url": "https://www.theguardian.com/environment/article/2024/jun/13/russia-war-with-ukraine-accelerating-global-climate-emergency-report-shows", "domain": "theguardian.com", "domain_classification": "International", "message": "The climate cost of the first two years of Russia’s war on Ukraine was greater than the annual greenhouse gas emissions generated individually by 175 countries, exacerbating the global climate emergency in addition to the mounting death toll and widespread destruction, research reveals.\nHistorically, governments have accounted poorly for the climate cost of war – and of the military industrial complex more broadly.\nThe UN general assembly has said that Russia should compensate Ukraine for the war, leading the Council of Europe to establish a registry of damage, which will include climate emissions.\nThis makes the global military carbon footprint – even without factoring in conflict-related emission surges – larger than that of all countries except the US, China and India.\n“We critically need international agreement on how conflict and military emissions are measured and addressed.”"}, {"id": "7218f13c-ca6b-416b-b378-b1a121e5315d", "title": "Russia war with Ukraine accelerating global climate emergency , report shows", "date": "2024-06-13 04:45", "url": "https://www.aol.co.uk/news/russia-war-ukraine-accelerating-global-040020264.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Photograph: Evgeniy Maloletka/APThe climate cost of the first two years of Russia’s war on Ukraine was greater than the annual greenhouse gas emissions generated individually by 175 countries, exacerbating the global climate emergency in addition to the mounting death toll and widespread destruction, research reveals.\nHistorically, governments have accounted poorly for the climate cost of war – and of the military industrial complex more broadly.\nThe UN general assembly has said that Russia should compensate Ukraine for the war, leading the Council of Europe to establish a registry of damage, which will include climate emissions.\nThis makes the global military carbon footprint – even without factoring in conflict-related emission surges – larger than that of all countries except the US, China and India.\n“We critically need international agreement on how conflict and military emissions are measured and addressed.”"}, {"id": "cd00ba4a-f8be-48aa-bc4f-a66552cd6705", "title": "Study details huge emissions resulting from Russia invasion of Ukraine", "date": "2024-06-13 04:00", "url": "https://www.asiaone.com/world/study-details-huge-emissions-resulting-russias-invasion-ukraine", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "KYIV — Russia's invasion of Ukraine has directly caused or paved the way to the emission of 175 million tonnes of carbon dioxide (CO2) into the atmosphere, a joint report said on Thursday (June 13).\nThe report used a measure called the Social Cost of Carbon to calculate the approximate financial cost of the additional emissions.\nMilitary activity was responsible for 51.6 million tons of CO2 equivalent emmmisions, the report said.\nAccording to the report, the war has significantly increased the frequency of landscape fires in the affected areas.\nIt said a million hectares of land had been scorched by 27,000 war-related fires, causing the equivalent atmospheric damage of 23 million tons of CO2."}, {"id": "df19398f-a7db-4bd2-9cda-f9eab19b6cd1", "title": "Border 2 : Sunny Deol Major Kuldeep Singh returns to complete unfulfilled promise in India biggest war film", "date": "2024-06-13 06:00", "url": "https://www.dnaindia.com/bollywood/report-border-2-sunny-deol-major-kuldeep-singh-returns-to-complete-unfulfilled-promise-in-india-biggest-war-film-3093310", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Border 2: Sunny Deol's Major Kuldeep Singh returns to complete unfulfilled promise in India's biggest war filmSunny Deol is all set to return as Major Kuldeep Singh in India's biggest war film, Border 2.\nOn Thursday, Sunny Deol, T-Series, and JP Films shared a post on social media welcoming Sunny Deol to Border 2 with the caption, “Ek fauji apne 27 saal purane waade ko pura karne, aa raha hai phirse.\nIndia's biggest war film, #Border2.\"\nNow, the fans are excited to see Sunny Deol returning as Major Kuldeep Singh in the sequel.\nLast year, Sunny Deol made a successful comeback to big screens with Gadar 2 and created a stir at the box office."}, {"id": "ed966d08-9a53-437c-9d39-dbae84cb032a", "title": "USAF - Led Exercise In Europe Aims To Sharpen Air - To - Air Combat Skills", "date": "2024-06-13 04:45", "url": "https://www.avweb.com/aviation-news/usaf-led-exercise-in-europe-aims-to-sharpen-air-to-air-combat-skills/", "domain": "avweb.com", "domain_classification": "Unknown", "message": "Dozens of NATO fighter pilots congregated last week at Ramstein Air Base in Germany for a U.S.-led exercise designed to hone their dogfighting skills.\nThe first-of-its-kind competition, dubbed “Ramstein 1v1,” challenged combat pilots from the U.S., UK, Norway, Netherlands, Belgium, Denmark, Finland, France, and Germany.\nThe allied nations’ air forces envision a need to sharpen air-to-air combat skills as tensions with Russia and China threatened to boil over to a shooting war that would put some of the world’s most advanced air forces head-to-head for the first time in decades.\nLt. Col. Michael Loringer, U.S. Air Force – Europe (USAFE) chief of weapons and tactics, said in a statement.\n“Basic fighter maneuvering is a foundational skill set for fighter pilots."}, {"id": "b4763826-eff4-4f33-ab9d-cec1128ea5dc", "title": "Call of Duty : Black Ops 6 Zombies mode , explained", "date": "2024-06-13 00:00", "url": "https://www.destructoid.com/call-of-duty-black-ops-6-zombies-mode-explained/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Black Ops has been known to have some of the best Zombies modes, thanks to its highly entertaining maps.\nHere’s what you can expect in Call of Duty: Black Ops 6’s Zombies mode.\nRecommended VideosWhat to expect in Black Ops 6 ZombiesGet ready to relive the nostalgia as Call of Duty: Black Ops 6 brings back the classic round-based Zombies mode, a feature that was dearly missed in the latest MW3 Zombies.\nThese unique abilities, such as the Burned Out GobbleGum that makes zombies burst into fire, were a hit in Black Ops 3 and are sure to add a new dimension to your gameplay in Black Ops 6’s Zombies mode.\nLike many Zombies entries, Easter Eggs can be found throughout the Call of Duty: Black Ops 6 Zombies map."}, {"id": "6b8d0d64-9641-4427-b873-ea805b952336", "title": "Study details huge emissions resulting from Russia invasion of Ukraine", "date": "2024-06-13 05:45", "url": "https://www.euractiv.com/section/global-europe/news/study-details-huge-emissions-resulting-from-russias-invasion-of-ukraine/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Russia’s invasion of Ukraine has directly caused or paved the way to the emission of 175 million tonnes of carbon dioxide (CO2) into the atmosphere, a joint report said on Thursday (13 June).\nThe report used a measure called the Social Cost of Carbon to calculate the approximate financial cost of the additional emissions.\nThe majority of that number, 35.2 million tons of CO2 equivalent, was caused by the Russian military’s fuel consumption, with a further 9.4 million tons from the Ukrainian military’s use of fuel.\nAccording to the report, the war has significantly increased the frequency of landscape fires in the affected areas.\nIt said a million hectares of land had been scorched by 27,000 war-related fires, causing the equivalent atmospheric damage of 23 million tons of CO2."}, {"id": "6e0d96c0-cacf-4aca-add5-b2bd510afe29", "title": "Learning from Myanmar rebels , junta builds new Chinese drone fleet", "date": "2024-06-13 04:45", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217357/Learning-from-Myanmar", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Debris reportedly belonging to a drone, which was shot down by Myanmar resistance fighters, is pictured in southeastern Myanmar, in this handout picture released June 11, 2024.\nTwo rebel fighters in other parts of Myanmar also described similar skirmishes to Reuters.\nThe news agency interviewed four resistance fighters, two analysts and an official from a country in the region who tracks the conflict.\nHe said he obtained information on junta drones from military officials and people with knowledge of weapons production.\nTwo resistance fighters told Reuters that they had shot down drones that appeared to be originally designed for spraying crops."}, {"id": "1667b4eb-4d4b-43fe-8354-61c29b5b5661", "title": "Immense  scale of Gaza killings amount to crime against humanity , UN inquiry says", "date": "2024-06-13 01:45", "url": "https://www.asiaone.com/world/immense-scale-gaza-killings-amount-crime-against-humanity-un-inquiry-says", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "GENEVA — Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN enquiry found on Wednesday (June 12), saying that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI says Israel obstructs its work and prevented investigators from accessing both Israel and the occupied Palestinian territories.\nThe reports, which cover the conflict through to end-December, found that both sides committed war crimes including torture; murder or wilful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court.\nALSO READ: Gaza civilian killings during Israel's freeing of hostages could be war crimes, UN says"}, {"id": "5f3c102a-c640-464f-a457-533e66e211c8", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-13 06:45", "url": "https://myrepublica.nagariknetwork.com/news/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes/", "domain": "myrepublica.nagariknetwork.com", "domain_classification": "Unknown", "message": "GENEVA, June 13: A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe commission found that in that attack, members of the military wings of Hamas and other Palestinian armed groups and Palestinian civilians committed war crimes, as well as violations and abuses of IHL and IHRL.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said."}, {"id": "3ce3f9e2-7201-477d-8f8f-b952b84e7575", "title": "US military Osprey aircraft wont return to full flight status until mid - 2025", "date": "2024-06-13 01:30", "url": "https://www.stripes.com/theaters/us/2024-06-12/osprey-military-deaths-investigation-lawmakers-14162752.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Relatives of service members killed in Osprey aircraft crashes clasp hands before a hearing on the Department of Defense’s V-22 Osprey program, June 12, 2024, on Capitol Hill in Washington.\n(Joe Gromelski/Special to Stars and Stripes)WASHINGTON — The military’s nearly 400 V-22 Ospreys will not be permitted to fly their full range of missions until mid-2025, the leader of the aircraft program told House lawmakers on Wednesday.\nChebi said 64 service members have been killed in air and ground accidents and another 93 have been injured since the military started flying the aircraft in 2007.\nThe services returned their Ospreys to flight status after Naval Air Systems Command lifted a three-month ban on March 8.\nFamily members of various fallen service members attended the hearing."}, {"id": "04f56bc7-2624-4db2-b226-17cc91e8b1ac", "title": "UN Probe Accuses Israel of Crimes Against Humanity , Hamas of War Crimes", "date": "2024-06-13 05:30", "url": "https://www.news18.com/world/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes-8931054.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "A UN investigation concluded Wednesday that Israel had committed crimes against humanity during the war in Gaza, including that of “extermination”, while Israeli and Palestinian armed groups had both committed war crimes.\nIt found that Israel “has committed war crimes, crimes against humanity” and other international law violations.\nThe commission determined that in that attack, members of the military wings of Hamas and other Palestinian armed groups, as well as Palestinian civilians, committed war crimes and other international law violations.\nThese acts were committed against civilians and members of the Israeli security forces, and constituted “war crimes”, it said.\n“Israel obstructed the commission’s investigations and prevented its access to Israel and the Occupied Palestinian Territory,” it added."}, {"id": "5a91345a-b3d3-4b81-9af1-102d524fd66c", "title": "Sunny Deol announces Border 2 as the cult classic turns 27 years old : deets inside | Hindi Movie News", "date": "2024-06-13 06:00", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sunny-deol-announces-border-2-as-the-cult-classic-turns-27-years-old-deets-inside/articleshow/110957090.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Probably one of the best war dramas made in Bollywood, J.P Dutta's Border turns 27 years old today.\nThe cult classic had an ensemble cast, including Sunny Deol, Suniel Shetty, Akshaye Khanna, Pooja Bhatt, Jackie Shroff, Tabu and others.\nA few minutes back, Sunny Deol took to his social media to announce the film.\nInitially, it was presumed that the film would be a sequel to the 1997 classic.\nDutta's Border is a cult film in the Indian film landscape."}, {"id": "50471972-8614-4881-9428-1a600d5449bf", "title": "Russia faces $32 billion bill for carbon emissions from Ukraine war", "date": "2024-06-13 01:30", "url": "https://www.newscientist.com/article/2435389-russia-faces-32-billion-bill-for-carbon-emissions-from-ukraine-war/", "domain": "newscientist.com", "domain_classification": "Unknown", "message": "The extra warming that would result from such emissions is calculated to lead to extreme weather around the world with impacts amounting to $32 billion.\nAdvertisementUkraine intends to add these climate-related costs to the list of damages for which Russia is responsible, and for which compensation will be demanded.\nAround 14 per cent of the total is due to passenger airlines having to reroute flights to avoid Russia and Ukraine.\nThe estimate of $32 billion is based on a 2022 study putting the social cost of carbon at around $185 per tonne of CO2.\nFor decades, low-income and island nations have fought to establish the principle that high-emitting, high-income countries should pay for the losses and damages caused by their greenhouse gas emissions."}, {"id": "53f0ce90-0f43-4ad0-8512-ed56ec6b02fe", "title": "San Antonians pay last respects to WWII veteran Bennett Stampes", "date": "2024-06-13 04:15", "url": "http://www.expressnews.com/news/article/bennett-stampes-funeral-19511005.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "Veterans and friends of Bennett Stampes stand at Fort Sam Houston National Cemetery as the flag covering his casket is folded during Tuesday’s burial service.\nJessica Phelps Carnations placed in honor of Bennett Stampes who was laid to rest at Fort Sam Houston National Cemetery.\nKeith Haycraft lays a carnation in honor of Bennett Stampes, who was buried at Fort Sam Houston National Cemetery.\n“You don’t ever think negative.”Marsha Box receives the flag in honor of Bennett Stampes who was interred at Fort Sam Houston National Cemetery.\nThe American flag in folded before being presented to Marsha Box during Tuesday’s funeral service for Bennett Stampes."}, {"id": "f70b8cb8-6a8f-471b-96b2-53ab39df54e7", "title": "Biden leads new drive to cement the West Ukraine war effort against Putin – and Trump", "date": "2024-06-13 06:15", "url": "https://www.cnn.com/2024/06/13/politics/joe-biden-ukraine-g7-donald-trump-vladimir-putin/", "domain": "cnn.com", "domain_classification": "International", "message": "Washington CNN —President Joe Biden is leading the world’s richest democracies in sending a beefed-up message to Russian President Vladimir Putin that the West will not forsake Ukraine despite political shocks casting doubts over its commitment.\nA flurry of new Western plans to help UkraineStill, the latest Western plans to help Ukraine send a strong message of intent.\nThe sanctions target foreign financial firms aiding Putin’s war effort, restrict Russian access to some US software and information technology.\nRussian advances on the battlefieldThese are substantial and credible political, economic and political demonstrations of support for Ukraine.\nNot surprisingly, Zelensky has always chafed at the self-imposed limits of Western support for his war effort that are a symptom of Biden’s core aim of avoiding a direct NATO confrontation with Russia."}, {"id": "6d5cfa39-9b14-4a0f-a400-ebc462be97eb", "title": "Why class based regiments have survived test of time in Indian Army", "date": "2024-06-13 07:15", "url": "https://indianexpress.com/article/research/why-class-based-regiments-have-survived-test-of-time-in-indian-army-8046647/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "The Congress party had been criticising the colonial policies of caste and community based recruitment in the Indian Army for years.\nIn the years that followed, although some mixed class regiments were formed, the infantry remained largely caste and community based.\nAs of now, there are 26 class based regiments in the Indian Army.\nThereafter, the Martial Race theory is what shaped recruitment policy in the Indian Army.\nIn the 1980s an experiment was carried out to mix battalions of fixed class regiments."}, {"id": "edd2b5ae-65a7-4490-92b1-23f8fa49b2d2", "title": "Gears of War : E - Day takes place across  multiple days  in - game and and is about sticking with the characters through  every minute  of the Locust invasion", "date": "2024-06-13 00:15", "url": "https://www.gamesradar.com/games/action/gears-of-war-e-day-takes-place-across-multiple-days-in-game-and-and-is-about-sticking-with-the-characters-through-every-minute-of-the-locust-invasion/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "Gears of War: E-Day takes place across more than just one day, confirms Gears creative director Matt Searcy.\n\"It's not a day, it's multiple days,\" Searcy said.\nIt'll explore the game's Emergence Day event, in which the Locust Horde rose from its underground civilization and invaded the Earth-like planet of Sera, killing billions of humans and kicking off the Locust War that serves as the backdrop to the series' narrative.\nIt's reasonable to assume Gears of War: E-Day might go a Black Hawk Down route and make the whole in-game storyline last 24 hours, but it's good to know we'll see some of the preceding events that led up to the invasion and ensuing battle.\nSearcy also told us Gears of War: E-Day will \"absolutely be doing more\" linear levels instead of Gear 5's open-ended maps."}, {"id": "a5ec13d7-94d0-46b2-a33f-c464dcf295be", "title": "Gaza ceasefire plan hangs in balance as Hamas seeks changes", "date": "2024-06-13 05:15", "url": "https://dunyanews.tv/en/World/818232-Gaza-ceasefire-plan-hangs-in-balance-as-Hamas-seeks-changes", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Gaza ceasefire plan hangs in balance as Hamas seeks changesWorld World Gaza ceasefire plan hangs in balance as Hamas seeks changesBlinken said Hamas had proposed numerous changes to a US-backed proposal for a ceasefire in Gaza.\nHamas also wants written guarantees from the US on the ceasefire plan, two Egyptian security sources said.\nUN FINDINGS ON WAR CRIMESThe war in Gaza began on Oct 7 when militants led by Hamas killed 1,200 Israelis and took more than 250 hostages, according to Israeli tallies.\nA UN inquiry found that both Israel and Hamas had committed war crimes early in the Gaza war and that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe evidence gathered by such UN-mandated bodies can form the basis for war crimes prosecutions."}, {"id": "64a48891-950a-43bb-aa51-ae0ab7b83214", "title": "Border 2 is CONFIRMED ! Sunny Deol announces long - awaited sequel of his iconic war drama : Bollywood News", "date": "2024-06-13 05:45", "url": "https://www.bollywoodhungama.com/news/bollywood/border-2-confirmed-sunny-deol-announces-long-awaited-sequel-iconic-war-drama/", "domain": "bollywoodhungama.com", "domain_classification": "Unknown", "message": "After sharing a cryptic video yesterday and making the internet go wild with speculations, Sunny Deol has confirmed that he will return in one of India’s biggest War films of all time - Border 2.\nSunny Deol announces long-awaited sequel of his iconic war dramaProduced by T-Series and JP films and written by Nidhi Dutta, daughter of legendary director JP Dutta, Border 2 will be the biggest war film in India.\nSunny Deol, T-Series and JP films shared a post on social media welcoming Sunny Deol to Border 2 with the caption, “Ek fauji apne 27 saal purane waade ko pura karne, aa raha hai phirse.\nIndia's biggest war film, #Border2 / Produced by Bhushan Kumar, Krishan Kumar, JP Dutta & Nidhi Dutta will be directed by Anurag Singh”View this post on Instagram A post shared by Bollywood Hungama????\nBorder 2 is written by Nidhi Dutta and produced by Bhushan Kumar, Krishan Kumar and JP Dutta and Nidhi Dutta."}, {"id": "315cdba5-28ab-472f-b149-13a905cbf2fa", "title": "Asia - Pacific Diabetes Devices Market Hits USD 5 . 6 Billion", "date": "2024-06-13 06:15", "url": "https://www.openpr.com/news/3537024/asia-pacific-diabetes-devices-market-hits-usd-5-6-billion", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Asia-Pacific Diabetes Devices Market Hits USD 5.6 Billion in 2032, Forecasts 7.3% CAGR (2023-2032)https://www.acumenresearchandconsulting.com/request-sample/242https://www.acumenresearchandconsulting.com/buy-now/0/242The Asia-Pacific region is experiencing a significant surge in the prevalence of diabetes, a chronic health condition that poses a substantial burden on both individuals and healthcare systems.\nIn response to this growing epidemic, the diabetes devices market in the Asia-Pacific is poised for substantial growth.\nOne of the primary challenges is the high cost of advanced diabetes management devices.\nMoreover, the rising demand for advanced diabetes management solutions creates opportunities for technological innovation and product development.\nCollaborations between healthcare providers, technology companies, and government agencies can further enhance market growth and improve diabetes care across the region.Asia-Pacific Diabetes Devices Market Table of Content:CHAPTER 1."}, {"id": "4becbdf7-559a-4501-bd72-0bdd6e54f051", "title": "  Nazi Playbook Come To Life : Jewish Leaders Demand Mask Ban Amid Surge In Antisemitic Protests", "date": "2024-06-13 02:45", "url": "https://dailycaller.com/2024/06/12/jewish-leaders-mask-ban-antisemitic-protests/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Jewish leaders are urging mask ban amid the rise of antisemitic protests, New York Post reported Wednesday.\n(RELATED: Elite Universities Scale Back Operations To Cope With Surge In Pro-Palestinian Protests)“A mask law will make a difference,” Richman told New York Post.\nNobody wanted their face to be seen.”New York’s anti-mask law, which had been in place for nearly two centuries, was repealed in 2020 during the COVID-19 pandemic.\n“We are experiencing and seeing the Nazi playbook come to life in 2024,” he said, New York Post stated.\nThis 2024, 173 anti-Jewish hate crimes have been recorded, compared to 101 for all of 2023, according to the New York Post."}, {"id": "7bc3dfca-483c-477d-aeb6-3a065bb28ebd", "title": "Prince of Persia : The Sands of Time Remake Will Feature Redesigned Levels and Combat", "date": "2024-06-13 02:15", "url": "https://gamingbolt.com/prince-of-persia-the-sands-of-time-remake-will-feature-redesigned-levels-and-combat", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "“What I wanted to bring is the idea of ‘sanctify, respect, modernize, and add.’ So those four pillars are what we use to define everything in the game.\nIf we take an enemy, for example: Do we want to sanctify it, keep it as-is because it’s so iconic?\nBut we modernize stuff like the level design, for example, and really enhance the scale of the world.\n“The original combat, for a lot of players today, would feel quite dated.\nPrince of Persia: The Sands of Time is due out in 2026 for PS5, Xbox Series X/S, and PC."}, {"id": "3e14c0c4-5637-4910-8295-1e3f1de570d5", "title": "4 down , 46 to go as first batch of London , Ont .- built armoured vehicles will soon be sent to Ukraine", "date": "2024-06-13 00:15", "url": "https://www.cbc.ca/news/canada/london/general-dynamics-london-ontario-ambulance-armoured-vehicles-ukraine-1.7232099", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "The first four of 50 military vehicles being built at a London, Ont., factory have rolled off the assembly line and will soon be en route to the Ukrainian army.\nLondon North Centre MP Peter Fragiskatos, right, and Ukrainian Col. Andrii Shmilyk are seen in front of employees at GDLS.\nThe 50, costing a total of $500 million, are in addition to 39 GDLS military vehicles that were delivered to Ukraine in 2022.\nHere you have state-of-the-art equipment that can see, and has seen, Ukrainian soldiers taken off the battlefield, operated on as necessary, given whatever help they might require and allowed to recover.\"\nIt's expected the 10 ambulance-variants military vehicles being shipped this summer from Canada will be in use by early autumn, said Fragiskatos."}, {"id": "32d186fe-15a6-4a5d-9c68-243fc2ea8d60", "title": "Russian ships arrive in Cuba as Cold War allies strengthen their ties", "date": "2024-06-13 07:00", "url": "https://krdo.com/news/2024/06/12/russian-ships-set-to-arrive-in-cuba-as-cold-war-allies-strengthen-their-ties/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "A CNN team on the ground saw members of the small Russian community in Cuba and Russian diplomats carrying national flags to welcome the crews.\nThe four Russian ships are now docked in berths usually occupied by cruise ships.\nUS Navy ‘monitors’ exercisesEn route to Cuba, the Russian warships conducted drills in the Atlantic, the Russian Ministry of Defense said Tuesday.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons."}, {"id": "a2e16df2-e949-4531-88b9-d9673af48da0", "title": "Aadhar vs Green Card : Meme war erupts as India wins against united states in T20 clash", "date": "2024-06-13 06:00", "url": "https://www.dnaindia.com/viral/report-aadhar-vs-green-card-meme-war-erupts-as-india-wins-against-usa-in-t20-clash-3093312", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Aadhar vs Green Card: Meme war erupts as India wins against USA in T20 clashThe T20 World Cup match between India and the USA became a global sensation, not just for the cricketing action but also for the humorous memes it spawned.\nThe much-anticipated T20 World Cup match between India and the USA not only brought cricketing excitement but also sparked a meme war on the internet.\nHigh Hopes Dashed for Team USAWednesday's match began with high hopes for the American side, fresh from a victory over Pakistan.\nOne meme humorously remarked on the diverse origins of the US team, joking that it represented \"Akhand Bharat,\" referencing a unified India.\nAnother highlighted the newfound awareness of cricket in the US, quipping, \"Americans came to know that they have a Cricket team after the Indians-driven team beat Pakistan."}, {"id": "dea93f29-8193-42c4-a537-bf7f61bbd9b8", "title": "Russia war with Ukraine accelerating global climate emergency , report shows", "date": "2024-06-13 09:15", "url": "https://www.enviweb.cz/rss/349101", "domain": "enviweb.cz", "domain_classification": "Unknown", "message": "Most comprehensive analysis ever of conflict-driven climate impacts shows emissions greater than those generated by 175 countries in a yearThe climate cost of the first two years of Russia's war on Ukraine was greater than the annual greenhouse gas emissions generated individually by 175 countries, exacerbating the global climate emergency in addition to the mounting death toll and widespread destruction, research reveals.Russia's invasion has generated at least 175m tonnes of carbon dioxide equivalent (tCO2e), amid a surge in emissions from direct warfare, landscape fires, rerouted flights, forced migration and leaks caused by military attacks on fossil fuel infrastructure - as well as the future carbon cost of reconstruction, according to the most comprehensive analysis ever of conflict-driven climate impacts.\nContinue reading..."}, {"id": "e83b77cd-f320-4992-925e-1d7b5ab352b0", "title": "Alberta Premier Danielle Smith taking over fight of energy  war room  ", "date": "2024-06-13 01:15", "url": "https://www.timescolonist.com/national-business/alberta-premier-danielle-smith-taking-over-fight-of-energy-war-room-9076558", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "EDMONTON — Alberta Premier Danielle Smith says she's bringing the province's energy \"war room\" under the purview of her office because she needs to take on the fight with Ottawa on behalf of the energy industry.\nEDMONTON — Alberta Premier Danielle Smith says she's bringing the province's energy \"war room\" under the purview of her office because she needs to take on the fight with Ottawa on behalf of the energy industry.\nA day earlier, the Alberta government said the Canadian Energy Centre, long-dubbed the \"war room,\" is being retooled and brought in-house directly under Smith's office.\nThe United Conservative Party premier defended the centre's work, releasing reports and information about the industry, and balked at the moniker \"war room.\"\n\"I don't even know if the Canadian Energy Centre would even be allowed to talk about some of these things,\" said Smith."}, {"id": "5b24e750-54ef-40b3-bc29-547eb68fe8ce", "title": "Visions of Mana gets a console and PC release date for late August", "date": "2024-06-13 00:00", "url": "https://www.destructoid.com/visions-of-mana-gets-a-console-and-pc-release-date-for-late-august/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Square Enix has finally revealed the release date for its Mana follow-up, Visions of Mana.\nThe game is arriving on console and PC on August 29, still well within the previously established summer 2024 launch window.\nVisions of Mana is an action RPG like its many predecessors, allowing you to wield weapons or elements to defeat foes.\nAs someone who only knows of the Mana series by reputation, I can say that Visions of Mana may make me commit.\nImage via Square EnixSquare Enix also revealed different purchase editions for Visions of Mana."}, {"id": "02803981-9ef4-455f-884b-0fc2aef19984", "title": "  Dragon Age : The Veilguard  Release Window , Trailer , Gameplay , and More", "date": "2024-06-13 02:15", "url": "https://www.themarysue.com/the-dragon-age-the-veilguard-reveals-gave-us-a-lot-to-process/", "domain": "themarysue.com", "domain_classification": "Unknown", "message": "Here’s what we know about Dragon Age: The Veilguard so far.\nThe Dragon Age: The Veilguard trailer introduces new companionsOn Sunday, BioWare and EA Games released the first trailer for Dragon Age: The Veilguard, a cinematic look at what’s to come in the fourth game of the series.\nCombat is also smoother, faster, and less static than in previous Dragon Age games.\nDragon Age: The Veilguard is slated for release in fall 2024, though we do not know the exact date yet.\nYou can add it to your wishlist or follow Dragon Age on social media for updates."}, {"id": "ca0cca4c-e825-446a-935f-73379323cd44", "title": "Alberta Premier Danielle Smith taking over fight of energy  war room  – Winnipeg Free Press", "date": "2024-06-13 00:15", "url": "https://www.winnipegfreepress.com/business/2024/06/12/alberta-premier-danielle-smith-taking-over-fight-of-energy-war-room", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "EDMONTON – Alberta Premier Danielle Smith says she’s bringing the province’s energy “war room” under the purview of her office because she needs to take on the fight with Ottawa on behalf of the energy industry.\n“It should be led out of the premier’s office.”Alberta Premier Danielle Smith answers questions during a media availability at the 2024 Western Premiers Conference in Whitehorse, Monday, June 10, 2024.\nSmith says she's bringing the energy \"war room\" — well-known for its feud with a children's Bigfoot cartoon — under her office because she needs to take on the fight with Ottawa on behalf of the province's energy industry.\nTHE CANADIAN PRESS/Crystal SchickA day earlier, the Alberta government said the Canadian Energy Centre, long-dubbed the “war room,” is being retooled and brought in-house directly under Smith’s office.\n“I don’t even know if the Canadian Energy Centre would even be allowed to talk about some of these things,” said Smith."}, {"id": "1766aff9-568e-4430-ba36-67517d3ac19d", "title": "House of the Dragon : What to Know Before Season 2", "date": "2024-06-13 05:45", "url": "https://comicbook.com/tv-shows/news/house-of-the-dragon-season-2-release-date-cast-hbo/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "How Did House of the Dragon Season 1 End?\n(Photo: HBO)The entirety of House of the Dragon Season 1 followed the reign of King Viserys Targaryen.\nThe second season of House of the Dragon picks up just days after the death of Lucerys.\nWhat Happens in House of the Dragon Season 2?\nHow to Watch House of the Dragon Season 2Things can get confusing in the world of streaming these days, but there are multiple ways to watch House of the Dragon every week."}, {"id": "287011d6-3f28-4510-91d6-1feaa17a927e", "title": "UN Inquiry on Gaza Finds Israel Committed War Crimes Including Starvation , Torture and Murder", "date": "2024-06-13 00:15", "url": "https://havanatimes.org/news/un-inquiry-on-gaza-finds-israel-committed-war-crimes-including-starvation-torture-and-murder/", "domain": "havanatimes.org", "domain_classification": "Unknown", "message": "By Democracy NowHAVANA TIMES – A new report by a UN independent human rights body finds both Israel and Palestinian armed groups have committed war crimes since Hamas’s surprise attack on October 7.\nThe damning report accuses Israel of using starvation as a method of warfare, forcible transfer and intentionally directing attacks against civilians.\nThe report also calls for the immediate and unconditional release of all hostages held by Hamas.\nHis call to Israeli Defense Minister Yoav Gallant came as the United Nations’ top human rights office said Israel likely committed war crimes during the operation, which killed at least 274 Palestinians.\nJeremy Laurence, spokesperson for the Office of the United Nations High Commissioner for Human Rights, said Israel’s actions had left human rights workers “deeply shocked.”Jeremy Laurence: “Hundreds of Palestinians, many of them civilians, were reportedly killed and injured."}, {"id": "60a14b99-1fc2-471b-ab68-8d32cc7f0945", "title": "Ara : History Untold , Microsoft New 4X Grand Strategy Game , Locks in a September Release", "date": "2024-06-13 01:15", "url": "https://wccftech.com/ara-history-untold-release-date-microsoft/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "A couple years ago Microsoft and developer Oxide Games (Ashes of the Singularity) unveiled Ara: History Untold, a new 4X turn-based game with elements of grand strategy and even city building mixed in.\nYou can check out the Xbox Podcast Ara: History Untold Showcase, below.\nWhile the proof will be in the playing, as a 4X and turn-based strategy nut, Ara: History Untold is definitely on my radar.\nExperiment with gameplay-impacting Traits and powerful Leader Abilities drawn from the effect they had on world history.\nAra: History Told launches on PC, including, of course, PC Game Pass, on September 24."}, {"id": "6d5bae6b-0f0a-4b72-8d73-fd4bb8f3b918", "title": "Crowdfunding Weapons As Ukraine Soldiers Fight , Die", "date": "2024-06-13 00:00", "url": "https://menafn.com/1108326545/Crowdfunding-Weapons-As-Ukraine-Soldiers-Fight-Die", "domain": "menafn.com", "domain_classification": "Unknown", "message": "I had last visited my friends in the 109thSeparate Territorial Defense Brigade in the late summer of 2023, when their unit was stationed close to Bakhmut.\nSoldiers from the 109th Separate Territorial Defense Brigade prepared the radio-controlled car to drive it into a Russian trench later in the day after packing it with explosives.\nPhoto: David KirichenkoResigned to his fate but still there, still fightingI conducted drone warfare interviews with several soldiers from the unit, including Norman.\nWith my friends from the 109th Separate Territorial Defense Brigade.\nWhen we have to fight to defend ourselves and our loved ones, we will, but we can only take so much."}, {"id": "1228c61a-05d2-4156-9a3c-7e899bce485b", "title": "Is Fortnite down ? Here when server downtime ends – and early patch notes for update v30 . 10", "date": "2024-06-13 07:00", "url": "https://www.mirror.co.uk/gaming/fortnite-down-heres-server-downtime-33007502", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The latest season for Fortnite went live just over two weeks ago, which means this update is a little overdue.\nServers are down today as the patch rolls out, but they'll be back up and running soon.\nThe @FortniteStatus Twitter account confirmed that Fortnite servers are going offline at 9am BST / 4am EDT / 1am PDT.\nWe're still waiting on official news as to all of the updates and changes on the way today, but here's what we're expecting to see in the early Fortnite patch notes we've pieced together, including two new Fortnite Lego modes.\nFortnite early patch notes for update v30.10These early Fortnite patch notes are taken from the game's official Trello board, and are labelled as being fixed in the next update – which is this one, so here's what we're expecting to see."}, {"id": "a8ab2335-b617-4ae6-90a9-c9378e1b845c", "title": "Morale : Drones Drive Russian Soldiers to Suicide", "date": "2024-06-13 04:45", "url": "http://www.strategypage.com/htmw/htmoral/articles/202406130251.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "There are enough old school Russian soldiers to make large scale infantry attacks possible.\nWhat this comes down to is life is considerably shorter for Russian men in peacetime and that gets worse in wartime.\nOn land the Ukrainian use of drones was so intense that droves carrying video cameras often spotted Russian soldiers committing suicide rather than waiting Ukrainian drones to find and kill them.\nUkrainian soldiers on the ground sometimes had opportunities to take cellphone photos of Russian soldiers committing suicide or finding bodies of Russian troops who had obviously killed themselves.\nUkrainian drones are an obvious cause of Russian suicides but the war in general has seen a substantial number of Russian soldiers choosing suicide over continued combat with the Ukrainians."}, {"id": "df7ebb74-00e3-4e68-8788-4fd0ada54fef", "title": "The ICC actions against Israel undermine its credibility", "date": "2024-06-13 07:45", "url": "https://www.jpost.com/opinion/article-805684", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "At the end of World War II, the victorious Allies demanded unconditional surrender from both Germany and Japan.\nIn 1939, the majority of German citizens supported the Nazi party led by Adolf Hitler.\nGerman cities had been bombed into piles of rubble, Russian troops had entered Berlin, and millions of Germans were either dead or in captivity.\nWith defeat imminent, Hitler committed suicide.\nThe Nazi dream of a thousand-year Reich was over."}, {"id": "8b810676-ab55-4a2c-99a3-4c99bf923f65", "title": "Former SPAWAR civil engineer pleads guilty to government contracting bribery scheme", "date": "2024-06-13 02:15", "url": "https://www.sandiegouniontribune.com/news/courts/story/2024-06-12/former-spawar-civil-engineer-pleads-guilty-to-government-contracting-bribery-scheme", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "Soriano worked as a civilian engineer at SPAWAR and was a certified contracting officer representative.\nIn that role, he was not able to approve defense contracts himself — that was the job of a contracting officer — but he “had the ability to influence the award of defense contracts,” according to his plea agreement.\nFlores and his company, indicted alongside Soriano in November, have pleaded not guilty to the charges against them.\nCambridge International Systems pleaded guilty in April, admitting that the firm acted through Thurston to bribe Soriano in exchange for government contracts worth millions of dollars.\nLiberty Gutierrez, described in court documents as a close family friend of Soriano, pleaded guilty to a money laundering charge in 2021, admitting that she received $593,000 in salary from three contracting firms for which she did little or no actual work."}, {"id": "b016ab6e-9f21-4670-8ad8-64e7d83e430f", "title": "  I Should Be Dead : Gazans Recall Chaos Of Israeli Hostage Rescue Raid", "date": "2024-06-13 04:15", "url": "https://menafn.com/1108326926/I-Should-Be-Dead-Gazans-Recall-Chaos-Of-Israeli-Hostage-Rescue-Raid", "domain": "menafn.com", "domain_classification": "Unknown", "message": "'No one could move'Eyewitnesses said the Israeli raid and retreat were covered by heavy air strikes as well as drone and tank fire.\nSeveral told AFP they had seen bodies in the streets, which AFP could not independently verify.\nThe fighters also took about 251 hostages, of whom 116 hostages now remain in Gaza, although the army says 41 of them are dead.\nAlaa Al Khatib, a displaced woman living in the camp, told AFP she was walking to a market when she saw people climbing out of a refrigerated truck and exiting a small white car.\n“They were wearing clothes like Hamas and Islamic Jihad people, and some were masked,” said another local man, Mahmoud Al Assar, 27."}, {"id": "6613742c-1a71-4a0c-8214-dddf9437717f", "title": "David Cameron lashes out at BBC Emma Barnett for  constant interrupting  in fiery clash | Politics | News", "date": "2024-06-13 09:15", "url": "https://www.express.co.uk/news/politics/1910648/david-cameron-emma-barnett-bbc-rishi-sunak", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Former Prime Minster David Cameron accused BBC journalist Emma Barnett of “constantly interrupting” him in a tetchy interview during which she grilled him about the performance of Rishi Sunak, the current occupant of Number 10.\nAnd the now-Foreign Secretary also insisted he “did not feel sorry” for Mr Sunak - while claiming he was paying the price for the twin impacts of the war in Ukraine and the pandemic.\nMs Barnett grilled Lord Cameron in the wake of last night’s Sky News interviews with Mr Sunak and Labour leader Sir Keir Starmer.\nAt one point she asked him to respond to a clip of a former Conservative Party member who said she had “lost trust” in the party after Mr Sunak was handed a fixed penalty notice for breaking lockdown restrictions in 2022.\nHe replied: “I thought the Prime Minister was very frank in saying that, you know, he made a mistake that he apologised for it and I think that's the right thing to say."}, {"id": "b8a47a41-3c82-428e-8172-916f2c3e83cd", "title": "Sunny Deol Announces Border 2 : Take A Look Back At The Iconic War Film Which Released In 1997", "date": "2024-06-13 09:15", "url": "https://www.freepressjournal.in/entertainment/sunny-deol-announces-border-2-take-a-look-back-at-the-iconic-war-film-which-released-in-1997", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "On Thursday (June 13), Sunny Deol announced his next film Border 2.\nThe film is a sequel to the 1997 hit war drama Border, which was directed by JP Dutta.\nIn addition, it was honoured with three National Film Awards: Best Film on National Integration, Best Lyricist for Javed Akhtar, and Best Playback Singer (Male) for Hariharan.\nAs Sunny Deol has announced Border 2, fans are excited to relive the story once again after 27 years.\nIt will be directed by Anurag Singh, and produced by Bhushan Kumar, Krishan Kumar, JP Dutta and Nidhi Dutta."}, {"id": "98d4c4de-7743-4527-8004-36258246918f", "title": "The world turns its back while the noose tightens around Sudan", "date": "2024-06-13 01:00", "url": "https://www.dailymaverick.co.za/article/2024-06-12-the-world-turns-its-back-while-the-noose-tightens-around-sudan/", "domain": "dailymaverick.co.za", "domain_classification": "Unknown", "message": "(Photo: EPA-EFE / Amel Pain)A friend, writing from Paris, lost four more family members in Sudan last week, including his wife’s uncle who was forced to witness his sister being raped.\nThey are trying to find a way of getting her out of Sudan, possibly through Uganda, so she can get proper medical treatment.\nThe military formations have held the levers of power ever since the colonial power Britain created a new Sudanese military based on ethno-regional lines a hundred years ago.\n“Instead, we are forced to watch in real-time as the noose tightens around millions of civilians begging to be saved… But make no mistake, Sudan is not being ignored.\nEither way, Sudan has become emblematic not just of the collapse of the global security order but of the limits of American power."}, {"id": "aedc23fc-6405-465b-ba27-d683336a4b81", "title": "Reasi attack shows why security in Jammu and Kashmir needs more than just a military approach", "date": "2024-06-13 02:45", "url": "https://scroll.in/article/1069168/reasi-attack-shows-why-security-in-jammu-and-kashmir-needs-more-than-just-a-military-approach", "domain": "scroll.in", "domain_classification": "Unknown", "message": "The Reasi attack reiterated the fact that addressing the security challenges in Jammu and Kashmir require more than just a military approach; it must be embedded in local politics and a delicate societal equilibrium.\nIn 2023, a total of 59 people – 24 security personnel, seven civilians and 28 terrorists – were killed in Rajouri-Poonch.\nThe thinning of troops in the hilly areas of Jammu and Kashmir has had consequences.\nIn terms of geography, Rajouri-Poonch and even Reasi, which adjoins Rajouri, is an extension of Pakistan-controlled Kashmir.\nThe Reasi terror attack, which was clearly timed with Prime Minister Narendra Modi's swearing-in ceremony to get maximum attention internationally, has reinforced this fact at a great cost."}, {"id": "67a84e02-4e9c-4800-b506-8f77e9e3c55a", "title": "Russia loses another 980 soldiers , 17 tanks and 34 artillery systems in one day", "date": "2024-06-13 07:30", "url": "https://www.yahoo.com/news/russia-loses-another-980-soldiers-044530413.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 980 soldiers, 17 tanks and 34 artillery systems in one dayThe Russians lost 980 servicemen, 17 tanks and 34 artillery systems on the battlefield over the past day.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 13 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:522,810 (+980) military personnel;7,928 (+17) tanks;15,208 (+21) armoured combat vehicles;13,770 (+34) artillery systems;1,099 (+0) multiple-launch rocket systems;846 (+2) air defence systems;359 (+0) fixed-wing aircraft;326 (+0) helicopters;11,075 (+33) strategic and tactical UAVs;2,285 (+5) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,794 (+58) vehicles and tankers;2,294 (+4) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "00307cc0-1c78-441b-8107-4d53c20d793f", "title": "What are the rules when it comes to rescuing hostages ? ", "date": "2024-06-13 04:30", "url": "https://www.yahoo.com/news/rules-comes-rescuing-hostages-030000356.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "What are the rules when it comes to rescuing hostages?\nIsrael says it has rescued four hostages in Gaza who were kidnapped in a Hamas-led attack on Oct. 7.\nBut the mission is being questioned, and cannot be seen as an unqualified success — perhaps even by the former hostages and their families.\nIsrael is also under pressure from its own citizens, and Jews around the world, to bring the hostages home.\n“The really hard calculation is, if there’s no way you can (rescue hostages) without excessive loss of civilian life, are you prepared to sacrifice hostages or not?” Cook said."}, {"id": "b6ae7558-ac7b-4f42-a5b7-e589270e0af2", "title": "Boston students meet with Netanyahu on campus antisemitism", "date": "2024-06-13 00:00", "url": "https://www.bostonglobe.com/2024/06/12/metro/boston-students-meet-with-netanyahu-campus-antisemitism/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Netanyahu “definitely cares about and understands and is concerned about what’s going on on campuses.”The meeting was an initiative of Olami, an organization that offers Jewish students international travel opportunities and on-campus programming.\nSix students from MIT, Harvard, and Boston University met with Israeli Prime Minister Benjamin Netanyahu last week as part of a delegation of American college students to discuss antisemitism at US universities, according to Netanyahu’s office and the meeting’s nonprofit organizer.\nJewish students on many campuses, particularly those who support Israel, have reported an uptick in antisemitic incidents and their own social isolation.\nThe Jewish student delegation’s meeting with Netanyahu provoked a harsh rebuke from pro-Palestinian protesters on MIT’s campus.\n“There is antisemitism on campus, there always has been, and it’s not like it suddenly disappeared,” Perian said."}, {"id": "74de3cd3-ce72-464a-b2d0-63de74cb5b1b", "title": "88th Air Base Wing at Wright - Patterson installs new command chief", "date": "2024-06-13 00:00", "url": "https://www.yahoo.com/news/88th-air-wing-wright-patterson-232134972.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The command chief of the Special Warfare Training Wing at Joint Base San Antonio-Lackland, Texas, is the new command chief of the 88th Air Base Wing at Wright-Patterson Air Force Base.\nCol. Dustin Richards, 88th Air Base Wing and installation commander, welcomed his new senior enlisted leader and wingman.\nThe 88th Air Base Wing command chief position was established in 2005.\nFrom 1992-2005, the position of command chief master sergeant was originally at the Aeronautical Systems Center level before coming to the Air Base Wing.\nThe wing provides support and services to the base, which includes a major acquisition center, research and development labs, major command headquarters, airlift wing and the world’s largest military air museum."}, {"id": "ceb53b79-d69b-40c9-83fa-7515cf182444", "title": "Russia Combat Losses In Ukraine Up To 522 , 810", "date": "2024-06-13 07:00", "url": "https://menafn.com/1108327507/Russias-Combat-Losses-In-Ukraine-Up-To-522810", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia's total combat losses since the invasion have reached 522,810.\nThese include 980 Russian and officers killed and wounded in the past 24 hours, Ukrinform reports with reference to the General Staff of Ukraine's Armed Forces.\nUkraine's Defense Forces have also destroyed 7,928 Russian tanks (+17 in the past day), 15,208 (+21) armored fighting vehicles, 13,770 (+34) artillery systems, 1,099 multiple rocket launchers, 846 (+2) air defense systems, 359 warplanes, 326 helicopters, 11,075 (+33) UAVs, 2,285 (+5) missiles, 28 warships/cutters, a submarine, 18,794 (+58) vehicles and fuel tankers, and 2,294 (+4) units of specialized equipment.\nThere were 89 combat engagements in frontline today, enemy is attacking in seven sectorsThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, air defenses for Ukraine will be on top agenda at 23rd Ramstein meeting, according to the Pentagon."}, {"id": "4151f735-ded4-489f-8397-57a053c8bd2d", "title": "Decorated Army officer from New York comes out as gay in obituary :  Ill forever rest in peace  ", "date": "2024-06-13 05:30", "url": "https://www.yahoo.com/news/decorated-army-officer-york-comes-224650864.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Decorated Army officer from New York comes out as gay in obituary: ‘I’ll forever rest in peace’After a lifetime spent in secrecy, a decorated Army veteran from New York has come out as gay in his obituary.\n“He was a private person,” Joseph Ryan, 68, of Rensselaer, told The Post.\nSeeing how people like me were treated, I just could not do it,” Col. Ryan wrote in his obituary.\n“He was quiet, but he was bold,” Joseph Ryan said of his uncle.\nWhen asked whether his uncle’s final message to the world was shocking to his family, Joseph Ryan said it was a long time coming."}, {"id": "8583999c-6133-43ba-84b5-0b9946e4a8d8", "title": "Russian submarine deployment to Cuba worries Pentagon that Moscow will stalk US coasts", "date": "2024-06-13 06:45", "url": "https://www.scmp.com/news/world/americas/article/3266433/russian-submarine-deployment-cuba-worries-pentagon-moscow-will-stalk-us-coasts", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "US officials are now assessing whether the current Russian deployment, which will culminate in military exercises in the Caribbean, could be the beginning of a pattern of Russian submarine activity that will require a more sustained change in US force posture.\nThe threat “is absolutely increasing,” General Glen VanHerck told lawmakers, referring to the Russian submarine deployments, “now not only the Atlantic, but we also have them in the Pacific”.\nRussia’s nuclear-powered Kazan submarine docks at Havana’s harbour.\nPhoto: AFP“The threat will only become more acute later in the decade when [Russian submarines] are armed with the Tsirkon hypersonic missile,” Guillot said.\nWhile the Russian ships were entering Cuban waters Wednesday morning, Cuban Foreign Minister Bruno Rodriguez was meeting his Russian counterpart, Sergey Lavrov, in Moscow."}, {"id": "4c5d818d-099c-4bc1-ab60-8a61f520d35c", "title": "Battle Creek man gets 10 years for meth trafficking and illegal firearm possession", "date": "2024-06-13 02:45", "url": "https://wwmt.com/news/local/battle-creek-man-gets-10-years-meth-trafficking-illegal-firearm-possession-adderall-pill-presser-travon-deshaun-roderick-mansker-machineguns", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "A Battle Creek man will be serving the next 10 years in prison after he was sentenced for possessing more than four kilograms of methamphetamine and several firearms as a felon, U.S. Attorney for the Western District Mark Totten announced Wednesday.\nAnd he was trafficking illegal firearms calibrated to cause maximum harm.\nBased on evidence found during the investigation, Mansker sold four machine gun conversion devices designed to turn AR-style firearms into fully-automatic machine guns in March and April of 2023, Totten said.\nAdditionally, the evidence also revealed that five of the firearms were \"ghost guns\" designed to be untraceable to law enforcement, according to authorities.\nThe Drug Enforcement Administration, the Bureau of Alcohol, Tobacco, Firearms and Explosives, Homeland Security Investigations, and Battle Creek Police Department, and the FBI assisted in this case."}, {"id": "75a3e58e-bd3b-4d06-a0fd-769fd696a53d", "title": "Czech Republic approves plan to buy upto 77 Leopard tanks from Germany", "date": "2024-06-13 04:30", "url": "https://www.prokerala.com/news/articles/a1539085.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Prague, June 13 : The Czech Republic has added the purchase of up to 77 Leopard 2A8 modern battle tanks from German production to its list of strategic defence projects.\nAccording to the Czech Defence Ministry, this is a critical interim step.\nIn May 2023, Germany signed a framework agreement with the manufacturer Krauss-Maffei Wegmann (KMW) to procure up to 123 Leopard 2A8 tanks.\nThe Bundeswehr will initially receive 18 brand-new main battle tanks by 2026.\nThe Czech Republic wants to order 61 Leopard 2 A8s in six different versions, for example as a main battle tank, command vehicle, bridge-laying and driving school tank."}, {"id": "350a9e94-ec03-485f-b354-af9fb8452c5b", "title": "Dragon Age : The Veilguard for Xbox Series - Sales , Wiki , Release Dates , Review , Cheats , Walkthrough", "date": "2024-06-13 02:45", "url": "https://www.vgchartz.com/game/234273/dragon-age-the-veilguard/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Enter the world of Thedas, a vibrant land of rugged wilderness, treacherous labyrinths, and glittering cities – steeped in savage combat and secret magics.\nNow, the fate of this world teeters on a knife's edge."}, {"id": "9beb5cad-8fb5-4ffd-896e-9971fdbf7502", "title": "Dragon Age : The Veilguard for PlayStation 5 - Sales , Wiki , Release Dates , Review , Cheats , Walkthrough", "date": "2024-06-13 02:45", "url": "https://www.vgchartz.com/game/234274/dragon-age-the-veilguard/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Enter the world of Thedas, a vibrant land of rugged wilderness, treacherous labyrinths, and glittering cities – steeped in savage combat and secret magics.\nNow, the fate of this world teeters on a knife's edge."}, {"id": "26edb135-0cc1-49ec-b91b-d6d27760165b", "title": "Dragon Age : The Veilguard for Microsoft Windows - Sales , Wiki , Release Dates , Review , Cheats , Walkthrough", "date": "2024-06-13 02:45", "url": "https://www.vgchartz.com/game/234275/dragon-age-the-veilguard/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Enter the world of Thedas, a vibrant land of rugged wilderness, treacherous labyrinths, and glittering cities – steeped in savage combat and secret magics.\nNow, the fate of this world teeters on a knife's edge."}, {"id": "aed3ef9b-e0f8-42ba-be90-312c8f42ed34", "title": "Czech Republic approves plan to buy upto 77 Leopard tanks from Germany", "date": "2024-06-13 07:30", "url": "https://www.thestatesman.com/world/czech-republic-approves-plan-to-buy-upto-77-leopard-tanks-from-germany-1503309562.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "The Czech Republic has added the purchase of up to 77 Leopard 2A8 modern battle tanks from German production to its list of strategic defence projects.\nAccording to the Czech Defence Ministry, this is a critical interim step.\nIn May 2023, Germany signed a framework agreement with the manufacturer Krauss-Maffei Wegmann (KMW) to procure up to 123 Leopard 2A8 tanks.\nThe Bundeswehr will initially receive 18 brand-new main battle tanks by 2026.\nThe Czech Republic wants to order 61 Leopard 2 A8s in six different versions, for example as a main battle tank, command vehicle, bridge-laying and driving school tank."}, {"id": "8bc0dfae-9e21-4815-b4af-a09b45472c74", "title": "<em>Fallout< / em> : Amazon atomic disaster series falters badly", "date": "2024-06-13 03:30", "url": "https://www.wsws.org/en/articles/2024/06/13/hcgd-j13.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Often in the last 30 years, the aftermath of nuclear war has simply been a trope to show humanity at its worst, suffused with savagery and violence.\nJonathan Nolan (HBO’s Westworld [2016]) is one of the series’ executive producers and directed the first three episodes.\nFallout opens in 2077, in a “retrofuture” world where clothing and technology resemble their equivalents from the early 1960s in the US.\nNolan and the other creator-directors avoid addressing big political questions and moral dilemmas found in the original games, or how they might translate to the contemporary real world.\nIt is striking that Jonathan Nolan was working on the series while his brother Christopher was directing Oppenheimer."}, {"id": "da164dc9-9423-4bdb-af51-f5354c0d5dce", "title": "  Glimpses of Glory  | News , Sports , Jobs - The Times Leader", "date": "2024-06-13 07:30", "url": "https://www.timesleaderonline.com/news/local-news/2024/06/glimpses-of-glory/", "domain": "timesleaderonline.com", "domain_classification": "Unknown", "message": "ST. CLAIRSVILLE — The Belmont County Heritage Museum’s newest exhibit, “Glimpses of Glory: Belmont County Civil War Heroes,” is on display now through July 6.\nIn addition to the “Glimpses of Glory: Belmont County Civil War Heroes” exhibit, visitors will find displays about the county’s sheriffs and artifacts from Belmont County communities representing their industries, landmarks and important historical figures.\nThe Belmont County Heritage Museum is open 10 a.m. to 4 p.m. Thursday through Saturday and admission is free.\nThe “Glimpses of Glory: Belmont County Civil War Heroes” exhibit will be on display through July 6.\nFor more information about this exhibit and the Belmont County Heritage Museum, visit belmontcountyheritagemuseum.org or call Stanley at 740-298-7020."}, {"id": "4c7f7686-66db-4005-a34d-11556206ce2a", "title": "More Canada - built armoured vehicles heading to Ukraine", "date": "2024-06-13 00:15", "url": "https://article.wn.com/view/2024/06/12/More_Canadabuilt_armoured_vehicles_heading_to_Ukraine_w/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "OTTAWA, June 12 (Xinhua) -- The first four of 50 new Armoured Combat Support Vehicles (ACSVs) built in Canada for donation to Ukraine are departing for Europe, the Department of National Defence announced on Wednesday.\nThese state-of-the-art armoured vehicles will fulfil a wide variety of roles on the battlefield,... read full story"}, {"id": "18fda8b9-8ff7-428f-a100-98d5ea0cf9d3", "title": "How G - 7 Nations Hope to Counter Russia and China Axis of Resistance", "date": "2024-06-13 05:30", "url": "https://www.yahoo.com/news/g-7-nations-hope-counter-040018031.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Faced with two brutal wars, can the G-7 muster enough economic, military and persuasive power to stave off the biggest threats to the democratic-led global order since World War II?\nFor the G-7, defending Ukraine is a matter of principle and a defense of democracy itself.\nSanctions initially united the G-7 around severing their bilateral trade with Russia, but diverting goods through third countries still allows Moscow to wage war.\nAlso, China has filled in the gaps Russia needs by boosting their bilateral trade.\nTradeComing out of the Second World War, free trade was seen as the path to prosperity."}, {"id": "0ba46e2d-ffd2-4c6e-9333-1d25c029f807", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-06-13 01:15", "url": "https://www.tvguide.co.uk/schedule/0648bae8-840e-552f-b815-50d70fe1357c/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "7:00 AM to 7:30 AMThursday 13 June"}, {"id": "ec8257c1-812a-4c0c-a940-c38ffd47e850", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-06-13 01:15", "url": "https://www.tvguide.co.uk/schedule/7d1f7a42-4d23-55d4-8e38-36b9992ba3ea/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "7:30 AM to 8:00 AMThursday 13 June"}]