[{"id": "1a716123-687f-4550-bf5f-fbec40800bfb", "title": "Antisemitic Incident at Jackson - Reed High School International Cultural Night Part of Larger Issue", "date": "2024-06-12 17:45", "url": "http://www.washingtonjewishweek.com/antisemitic-incident-at-jackson-reed-high-schools-international-cultural-night-part-of-larger-issue/", "domain": "washingtonjewishweek.com", "domain_classification": "Unknown", "message": "The Jewish Community Relations Council of Greater Washington said the incident and lackluster response is another example of problematic behavior exhibited by the school going back several years.\nJCRC has tracked incidents going back months, saying that there are multiple decisions by administrators that are biased against Jewish students, including several denials to create programs and clubs in support of Israel.\nAfter parents raised concerns about the film, which is highly critical of Israel and is said to be filled with antisemitic tropes, Jackson-Reed Principal Sah Brown halted its showing.\nFriedberg added that her son was one of the students harassed by a protester on May 29.\n“Be honest about what happened [on May 29], do a thorough investigation and, if it’s warranted, hand out any disciplinary consequences.”[email protected]"}, {"id": "23f0cf21-3d49-45be-a18b-6fc981c06d18", "title": "Warwick and Palestine : The Importance of On - Campus Advocacy", "date": "2024-06-12 16:45", "url": "https://theboar.org/2024/06/warwick-and-palestine-the-importance-of-on-campus-advocacy/", "domain": "theboar.org", "domain_classification": "Unknown", "message": "But Warwick University does not only represent a platform for healthy debate and challenging global injustices.\nThe NGO Campaign Against Arms Trade named both Rolls Royce and BAE among the companies profiting from the war in Gaza.\nWe spoke to a representative of the ‘Warwick Stands With Palestine’ coalition, who explained the nature of the group’s activism in the current national and international context.\nJSoc also argued that the presence of masked protestors, often shouting slogans that they view as antisemitic, has created an intimidating environment for both current and prospective Jewish students.\nStudent advocacy must be protected on campus, and we should be wary of attempts to silence voices for peace and liberation."}, {"id": "bcc611a3-07cf-4a85-b40d-592a5a77b6c4", "title": "AfD success sparks panic among European Jews - The Jerusalem Post", "date": "2024-06-12 03:30", "url": "https://www.jpost.com/international/article-805927", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The success of German extremists in Sunday’s European Parliament election has mainstream Jewish leaders and politicians worried.\nThe strong showing for far-right parties reflects worries about increasing numbers of Muslim refugees since 2015 in Germany.\nThe Alternative for Germany Party stresses isolationism, takes an anti-EU and pro-Russian stance, and is accused of fomenting anti-Muslim sentiment.\nItaly, France and Germany saw significant gains for far-right parties; such parties came in first in five out of the 27 member countries and second or third in five other countries.\nAfD second to CDUIn Sunday’s election, the AfD came in second to Germany’s center-right Christian Democratic Union and its more conservative Bavarian sister party, the Christian Social Union."}, {"id": "dec14c4b-2b59-4dc3-89bc-a186b6c0294b", "title": "Success of German far - right party in EU election has many Jews hearing echoes of Nazi past", "date": "2024-06-12 00:30", "url": "https://forward.com/fast-forward/621871/success-of-german-far-right-party-in-eu-election-has-many-jews-hearing-echoes-of-nazi-past/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Toby Axelrod June 11, 2024BERLIN — The success of German extremists in Sunday’s European Parliament election has mainstream Jewish leaders and politicians worried.\nThe strong showing for far-right parties reflects worries about increasing numbers of Muslim refugees since 2015 in Germany.\nThe Alternative for Germany Party stresses isolationism, takes an anti-EU and pro-Russian stance, and is accused of fomenting anti-Muslim sentiment.\nItaly, France and Germany saw significant gains for far-right parties; such parties came in first in five out of the 27 member countries and second or third in five other countries.\nIn Sunday’s election, the AfD came in second to Germany’s center-right Christian Democratic Union and its more conservative Bavarian sister party, the Christian Social Union."}, {"id": "1b235c27-77ad-4424-83a6-35babe2f9457", "title": "NYC Mayor Adams calls pro - Palestinian protest that turned violent  despicable  ", "date": "2024-06-12 00:00", "url": "https://www.amny.com/news/nyc-pols-pro-palestine-violent-protest-lower-manhattan/", "domain": "amny.com", "domain_classification": "Unknown", "message": "“You can not state you are calling for peace and then wave flags of Hamas and Hezbollah,” the mayor said.\n“I believe the strategies that we used were properly used and just the level of enforcement that was needed,” Adams said.\nThe Nova Music Festival Exhibition — “October 7th 06:29am – The Moment the Music Stood Still” — memorializes the victims of the attacks.\nIn light of Monday’s protest, exhibit organizers announced that the exhibit would remain open through June 22.\nIt is more important than ever that we fight for our shared humanity.”Adams toured the Nova exhibit, and other New York politicians took to Twitter (formerly X) to condemn the protest."}, {"id": "a8eb5223-fa4d-4bca-80bf-98b01d14c9ab", "title": "  War on white America : Influential Texas group hosting pro - Christian nationalism conference – The Gilmer Mirror", "date": "2024-06-12 13:15", "url": "https://www.gilmermirror.com/2024/06/12/war-on-white-america-influential-texas-group-hosting-pro-christian-nationalism-conference/", "domain": "gilmermirror.com", "domain_classification": "Unknown", "message": "“War on white America”: Influential Texas group hosting pro-Christian nationalism conference By Editor | |By Robert Downen and Juan Salinas II, The Texas Tribune June 12, 2024““War on white America”: Influential Texas group hosting pro-Christian nationalism conference” was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, government and statewide issues.\n“It’s absolutely vital we remember that when they say ‘white supremacy’ or ‘white nationalism’ or whatever the most recent scare phrase is, they literally just mean your heritage and historical way of life,” reads the description for a session on “Multiculturalism & The War on White America.” “It’s a culture war, simple as that.\n“This is not the version of Christian nationalism that wants to make change through votes and prayer,” she said of the conference lineup.\n“This is the version of Christian nationalism that wants to do it by force.\n“By tying the Great Replacement Theory to white-nationalist and anti-Semetic violence, the establishment condemns any recognition of ongoing demographic transformation as racist,” the session’s description reads."}, {"id": "0b5ea6d7-407a-4771-875c-d375a8624e32", "title": "  War on white America : Influential Texas group hosting pro - Christian nationalism conference", "date": "2024-06-12 13:15", "url": "https://www.keranews.org/texas-news/2024-06-12/war-on-white-america-influential-texas-group-hosting-pro-christian-nationalism-conference", "domain": "keranews.org", "domain_classification": "Unknown", "message": "True Texas Project did not respond to a request for comment about the conference or some of the speakers' collaboration with far-right extremists.\n“This is not the version of Christian nationalism that wants to make change through votes and prayer,” she said of the conference lineup.\n(The Center for Immigration Studies is designated as a hate group by the Southern Poverty Law Center because of its amplification of white nationalists, though the group disputes that label).\n“By tying the Great Replacement Theory to white-nationalist and anti-Semetic violence, the establishment condemns any recognition of ongoing demographic transformation as racist,” the session's description reads.\nIn an email to the Tribune this week, Gottfried downplayed concerns about the conference, its embrace of Great Replacement Theory and the comments by True Texas Project’s leaders in the wake of the El Paso WalMart massacre."}, {"id": "5f3bc620-76c8-4d83-b421-b05021ca33ed", "title": "Latest Articles", "date": "2024-06-12 19:15", "url": "https://freerepublic.com/tag/*/index?more=4243867", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Daily Readings from the USCCBJesus said to his disciples: “Do not think that I have come to abolish the law or the prophets.\nI have come not to abolish but to fulfill.\nAmen, I say to you, until heaven and earth pass away, not the smallest letter or the smallest part of a letter will pass from the law, until all things have taken place.” Matthew 5:17–18The law and the prophets, as found in the Old Testament, consists of three types.\nFirst, there are the moral laws, such as the Ten Commandments, that are primarily based on the natural law..."}]