[{"id": "5a389c47-4f07-4af1-8665-f7604034c3b1", "title": "Iran Denies NYT Claim Hidden Bomb Killed Hamas Chief , Claims  Projectile  Hit Lodging", "date": "2024-08-06 02:00", "url": "https://www.breitbart.com/politics/2024/08/05/iran-denies-nyt-claim-hidden-bomb-killed-hamas-chief-claims-projectile-hit-lodging/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Both Pezeshkian and Ayatollah Ali Khamenei were seen embracing Haniyeh at the inaugural ceremonies hours before Iranian authorities confirmed his death.\nWhile no individual or group has taken responsibility for the explosion that killed Haniyeh, Iranian authorities immediately blamed the Israeli government and claimed the United States abetted the alleged attack.\nLeftist American President Joe Biden lamented the terrorist’s death, expressing irritation with Israel for not accepting a ceasefire negotiation with Hamas (Hamas has repeatedly refused reasonable terms for an end to Israeli self-defense operations in Gaza).\nRezaei did not address the Times reported directly.\nThe incident reported targeted Haniyeh precisely enough that only one other death, that of his bodyguard, has been reported."}, {"id": "79b545b9-2cd1-4885-849f-b6319c134509", "title": "Proxy forces armed by Iran could take part in retaliation against Israel over Hamas leader killing", "date": "2024-08-06 03:15", "url": "https://www.news-gazette.com/news/nation-world/proxy-forces-armed-by-iran-could-take-part-in-retaliation-against-israel-over-hamas-leaders/article_3a81db4e-ab7b-51b5-9294-73bf9f906d3d.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Proxy forces armed by Iran could take part in retaliation against Israel over Hamas leader's killingAs Iran threatens to respond to the suspected Israeli assassination of Hamas leader Ismail Haniyeh in Tehran, the regional militias that the Islamic Republic has armed for decades could play a role in any attack"}, {"id": "0b81d0d4-ea4f-4f04-9227-fbd2b7290232", "title": "US personnel wounded in attack against base in Iraq , officials say", "date": "2024-08-06 04:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380035.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Two Katyusha rockets were fired at al Asad airbase in western Iraq, two Iraqi security sources said.\nOne Iraqi security source said the rockets fell inside the base.\nThe U.S. officials, who spoke to Reuters on condition of anonymity, said one of the wounded Americans was seriously injured.\nA rare ally of both the U.S. and Iran, Iraq hosts 2,500 U.S. troops and has Iran-backed militias linked to its security forces.\nU.S. Army General Michael \"Erik\" Kurilla, head of U.S. Central Command, is currently in the Middle East."}, {"id": "b38f70ca-ed9b-483f-a8ab-0bd1606f1d4b", "title": "Senior Ayatollah Warns Iran Can Strike U . S . in  Less Than Half a Day  ", "date": "2024-08-06 02:00", "url": "https://www.breitbart.com/politics/2024/08/05/senior-iranian-ayatollah-threatens-blood-vengeance-against-u-s-can-strike-major-american-targets-less-than-half-day/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Iran has “domination” over American interests in the region and can strike the U.S. in “less than half a day,” according to a senior Iranian Ayatollah who called for “blood vengeance” against the United States for numerous “American crimes,” following Hamas terrorist leader Ismail Haniyeh’s assassination in the heart of Tehran last week.\n“The largest American military base is the Al-Asad Airbase in Al-Anbar, in Iraq.\nWe showed, with just eight missiles following the martyrdom of Hajj Qassem Soleimani, that this base is in our crosshairs,” he said.\n“Iran must fight America like a goat fights off wolves with its horns,” he stated.\nIn response to the Israeli airstrike on Tehran, Iran’s capital city, that killed Haniyeh, the so-called “Supreme Leader” called for a direct attack on Israel."}, {"id": "1032d298-a10b-414e-bf03-6d1202ad7b4f", "title": "Proxy Forces Armed By Iran Could Take Part In Its Expected Attack On Israel", "date": "2024-08-06 03:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2302690/proxy-forces-armed-by-iran-could-take-part-in-its-expected-attack-on-israel.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "WHY HAS IRAN ARMED PROXY FORCES?\nInternational sanctions on Iran, including over its nuclear program, also have kept it from receiving new arms while Israel and Gulf Arab states allied with the U.S. have received advanced weapons.\nWhile developing its own missile program, Iran can’t match those sophisticated weapons.\nIran’s arming began in earnest in the 1980s with Shiite forces in Lebanon fighting against Israel.\nThose state-sanctioned, mainly Shiite militias, known as the Popular Mobilization Forces, have grown into a powerful political faction, armed with rockets, drones and other weaponry."}, {"id": "a80b9274-9cf1-4b9c-b934-78d411ae7d65", "title": "Israel Hamas War Live Updates : Iran could attack Israel within next 24 to 48 hours , says report", "date": "2024-08-06 02:30", "url": "https://timesofindia.indiatimes.com/%20https:/timesofindia.indiatimes.com/world/middle-east/israel-hamas-war-live-updates-beirut-iran-hezbollah-ismail-haniyeh-benjamin-netanyahu-gaza-war/liveblog/112270382.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "08:02 (IST) Aug 06Kobbi Shoshani, the Consul General of Israel to Midwest India in Mumbai, shared his views on the ongoing conflict between Tel Aviv and Hamas.\nHe emphasized that anyone who poses a threat to Israeli and Jewish people must understand that they are putting themselves at risk.\nShoshani stressed that any terrorist attempting to harm Israeli and Jewish people should know they are risking their safety.\nAddressing the issue of hostages, Shoshani noted that it is a significant concern for Israel.\nEarlier, the Israel Defense Forces (IDF) announced that they had killed Hamas minister Abed Al-Zeriei in an airstrike in Gaza."}, {"id": "1f078d3b-ce14-4884-af78-a69f5f7ce43e", "title": "US personnel wounded in attack against base in Iraq , officials say", "date": "2024-08-06 03:00", "url": "https://www.rappler.com/world/middle-east/united-states-personnel-wounded-attack-against-base-in-iraq/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Two Katyusha rockets were fired at al-Asad airbase in western Iraq, two Iraqi security sources say.\nIt is unclear whether the attack was linked to threats by Iran to retaliate over the killings.\nTwo Katyusha rockets were fired at al Asad airbase in western Iraq, two Iraqi security sources said.\nOne Iraqi security source said the rockets fell inside the base.\nA rare ally of both the US and Iran, Iraq hosts 2,500 US troops and has Iran-backed militias linked to its security forces."}, {"id": "66978bc0-2662-45b2-a9e7-0f6c352437a4", "title": "US personnel wounded in attack against base in Iraq , officials say", "date": "2024-08-06 02:00", "url": "https://www.moneycontrol.com/news/world/us-personnel-wounded-in-attack-against-base-in-iraq-officials-say-12787877.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:US personnel wounded in attack against base in Iraq, officials say"}, {"id": "f131eba6-24c4-42f2-8a2e-c90834b9a0a2", "title": "John Bolton Says Biden  Refusal To See That Iran Has Already Launched A Wider War ... Imperils American After Rockets Wound US Soldiers In Iraq", "date": "2024-08-06 02:15", "url": "https://www.benzinga.com/news/24/08/40176792/john-bolton-says-bidens-refusal-to-see-that-iran-has-already-launched-a-wider-war-imperils-americans", "domain": "benzinga.com", "domain_classification": "Unknown", "message": "What Happened: Bolton took to X on Monday, to voice his concerns about the escalating situation in the Middle East.\n“Joe Biden’s refusal to see that Iran has already launched a wider war in the Middle East imperils Americans and our allies.\nJoe Biden's refusal to see that Iran has already launched a wider war in the Middle East imperils Americans and our allies.\nThe Pentagon planned to deploy additional military resources to the Middle East.\nA potential Iranian attack on Israel could disrupt global markets, similar to the impact of Russia’s invasion of Ukraine in 2022."}, {"id": "a092851e-8824-433e-8a00-422d71bab11e", "title": "US troops injured in rocket attack on Ain al - Asad Air Base in Iraq", "date": "2024-08-06 02:00", "url": "https://timesofindia.indiatimes.com/world/us/us-troops-injured-in-rocket-attack-on-ain-al-asad-air-base-in-iraq/articleshow/112302361.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Regional tensions escalateUS response and ongoing negotiationsSeveral American troops were injured late Monday when a rocket attack targeted the Ain al-Asad Air Base in Iraq ’s western desert, according to US defense officials.\nWhile no group has yet claimed responsibility, the strike bears the hallmarks of previous operations by Iran-backed militias in Iraq, whose goal is to force the withdrawal of US forces from the region.The attack on Ain al-Asad Air Base occurred against a backdrop of escalating regional tensions.\nLast week, a Hamas leader, Ismail Haniyeh, was killed in Tehran, and Hezbollah leader Fouad Shukur was killed in Beirut.\nA statement from the administration emphasized that any retaliatory action would be carried out \"in a manner and place of our choosing.\n\"The attack has also highlighted ongoing negotiations between US and Iraqi officials over the future of American military presence in the country."}, {"id": "bd56fb82-ced6-456f-a316-f431280c4e28", "title": "Biden convenes national security team as fears of Iran attack grow", "date": "2024-08-06 03:00", "url": "https://www.yahoo.com/news/biden-convenes-national-security-team-022208372.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US President Joe Biden met his senior national security team on Monday as concerns of a possible Iranian retaliatory attack on Israel grew.\nDuring Monday's briefing, Mr Biden was told the timing and nature of an Iranian attack remained unclear, according to US news site Axios.\nA day earlier, Mr Blinken reportedly told his G7 counterparts that Iran and Hezbollah could attack Israel within 24 to 48 hours.\nOn Monday, several US personnel were injured in a suspected rocket attack on a US military base in western Iraq.\nEarlier in the day, Mr Biden spoke to King Abdullah II of Jordan about \"efforts to de-escalate regional tensions, including through an immediate ceasefire and hostage release deal\", a statement from the White House said."}, {"id": "0abf149c-7b57-4e47-a62d-163a7d6155cc", "title": "Biden convenes national security team as fears of Iran attack grow", "date": "2024-08-06 04:30", "url": "https://www.myjoyonline.com/biden-convenes-national-security-team-as-fears-of-iran-attack-grow/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "US President Joe Biden met his senior national security team on Monday as concerns grew of a possible Iranian retaliatory attack on Israel.\nTensions have risen over the last week following the assassination of Hamas' political leader Ismail Haniyeh, for which Iran has blamed Israel and vowed “severe” retaliation.\nOn Monday evening, Mr Biden said he and Vice President Kamala Harris met senior security officials to discuss the situation.\nDays later, Fuad Shukr, a senior Hezbollah military commander, was killed in an Israeli airstrike on a suburb of the Lebanese capital, Beirut.\nOn Monday, several US personnel were injured in a suspected rocket attack on an American military base in western Iraq."}, {"id": "db37cafd-19e1-44fd-8e46-cdee32acdd38", "title": "Israel - Gaza live updates : Nine UN employees fired for ties to Oct . 7 attack", "date": "2024-08-06 02:45", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1577521", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\n“To say I buried him, but I couldn’t find him.”-ABC News’ Dia Ostaz9 UN employees fired after investigation into ties to Oct. 7 attackThe U.N. has fired nine employees following a lengthy investigation into ties to the Oct. 7 attacks, the organization said.\nAt least 7 Hezbollah attacks MondayIn another active day on the northern Israeli border, Hezbollah launched at least seven attacks on Monday.\n“Israel Fire Services are currently operating to extinguish a fire that was ignited in the area as a result of the attack,” the IDF said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "8c616b47-8517-493a-bf57-8a8de0172924", "title": "US personnel injured in attack on Al Asad airbase in Iraq", "date": "2024-08-06 02:30", "url": "https://www.bbc.co.uk/news/articles/cq5dd33egeqo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "“We can confirm that there was a suspected rocket attack today against US and Coalition forces at Al Asad Airbase, Iraq,” said a Department of Defence spokesperson.\nBase personnel are conducting a post-attack damage assessment,” the spokesperson added.\nPresident Joe Biden was briefed on the suspected attack, a White House official said.\nAlso last week, Israel said it killed a top Hezbollah commander in an air strike on a southern suburb of Beirut, Lebanon’s capital.\nA number of US personnel were assessed for traumatic brain injuries after the attack, while at least one Iraqi service member was wounded."}, {"id": "0a47d5ef-237a-4277-aac2-c4543149e17f", "title": "U . S . personnel wounded in attack against base in Iraq , officials say", "date": "2024-08-06 03:00", "url": "https://www.japantimes.co.jp/news/2024/08/06/world/us-personnel-attack-base-iraq/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "At least five U.S. personnel were injured in an attack against a military base in Iraq on Monday, U.S. officials said, as the Middle East braces for a possible new wave of attacks from Iran and its allies following last week's killing of senior members of militant groups Hamas and Hezbollah.\nTwo Katyusha rockets were fired at the Ain al-Asad air base in western Iraq, two Iraqi security sources said.\nOne Iraqi security source said the rockets fell inside the base."}, {"id": "f5a0c7de-9fef-46cd-9461-a9f8842be928", "title": "Bangkok Post - Netanyahu  s game crossing all the red lines", "date": "2024-08-06 03:00", "url": "https://www.bangkokpost.com/opinion/opinion/2842102/netanyahus-game-crossing-all-the-red-lines", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "What Israel's Prime Minister Benjamin Netanyahu is doing at the moment is systematically crossing the \"red lines\" laid down by Israel's most dangerous enemies, Iran and its proxy in Lebanon, Hezbollah.\nHonour was satisfied, Mr Netanyahu was thwarted, and nobody died.\nOn the night of July 30-31, missiles flew to Beirut, Hezbollah's red line, to kill Fuad Shukr, Hezbollah's second-in-command.\nYet chose to do so in Tehran during the inauguration of the new president ... Israel left Tehran no alternative but to retaliate.\"\nMr Netanyahu."}, {"id": "10d0c060-540e-4d51-acae-ddcb479d68d6", "title": "Multiple US Soldiers Injured In Rocket Attack On Iraq Base", "date": "2024-08-06 04:15", "url": "https://www.ndtv.com/world-news/several-us-personnel-injured-in-rocket-attack-on-iraq-base-6272401", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "A rocket attack on a base in Iraq wounded multiple US personnel on Monday, officials said, adding to already heightened regional tensions over an expected Iranian counterattack on Israel.\n\"There was a suspected rocket attack today against US and coalition forces\" at the base, a US defense spokesperson said.\n\"Base personnel are conducting a post-attack damage assessment\" and updates will be provided as more information becomes available, the spokesperson added.\nThe strike, which Iraqi sources said left four killed, was the first by American forces in Iraq since February.\nThere have been two recent attacks targeting bases hosting US and allied forces in Iraq -- on July 16 and 25."}, {"id": "3ebfba4d-f73c-45a6-9601-1394ca0e0b80", "title": "Location , Location , Location ! ", "date": "2024-08-06 04:30", "url": "https://townhall.com/columnists/alanjosephbauer/2024/08/06/location-location-location-n2642987", "domain": "townhall.com", "domain_classification": "Unknown", "message": "The old adage that location is everything has taken on a new meaning during warfare here in Israel.\nAdvertisementBut location also has a different meaning in Israel.\nIf it is an empty area, no Iron Dome missile is expended on the incoming projectile.\nIsrael has developed aerial defense systems that take into account the expected impact point of a missile.\nThe first round of Iranian projectiles led to most being destroyed prior to reaching Israel or by Israel’s own systems."}, {"id": "0008a99e-d3bf-45ae-943a-e4bbf7b90d11", "title": "US personnel injured in rocket attack on Iraq base", "date": "2024-08-06 03:45", "url": "https://punchng.com/us-personnel-injured-in-rocket-attack-on-iraq-base-2/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Several US personnel were injured in a suspected rocket attack on Monday against US and coalition forces at Al-Asad Airbase in Iraq, a US defence official said.\n“We can confirm that there was a suspected rocket attack today against US and coalition forces at Al-Asad Airbase, Iraq,” the official said.\nWhile it’s unclear who carried out the rocket attack on Monday, US officials have long blamed attacks on troops in Iraq and Syria on Iran-backed militia groups.\nDeputy Pentagon Press Secretary, Sabrina Singh, said last month after a drone attack on Al-Asad that it was “most likely” carried out by Iranian-supported groups.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "7ab263b9-690d-4170-9612-abdabc6f8c3a", "title": "  Several  US personnel injured in rocket attack on Iraq base - Boston News , Weather , Sports", "date": "2024-08-06 03:00", "url": "https://whdh.com/news/several-us-personnel-injured-in-rocket-attack-on-iraq-base/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(CNN) — Several US personnel were injured in a suspected rocket attack Monday against US and coalition forces at Al-Asad Airbase in Iraq, a US defense official said.\n“We can confirm that there was a suspected rocket attack today against US and Coalition forces at Al-Asad Airbase, Iraq,” the official said.\nWhile it’s unclear who carried out the rocket attack on Monday, US officials have long blamed attacks on troops in Iraq and Syria on Iran-backed militia groups.\nDeputy Pentagon Press Secretary Sabrina Singh said last month after a drone attack on Al-Asad that it was “most likely” carried out by Iranian-supported groups.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "66632fc8-f395-4b17-bb20-ae02b49d9188", "title": "Israel Hamas conflict : Biden holds national security meeting as US watches for Iranian retaliation", "date": "2024-08-06 00:00", "url": "https://www.9news.com.au/world/israel-hamas-conflict-joe-biden-holds-national-security-meeting-iranian-retaliation/9beee49d-85a5-44fb-9f7a-9a032e925196", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "(AP Photo) (AP)Officials are relying on multiple streams of intelligence, and there are divisions among national security officials on how and when Iran's response might unfold.\nA man smokes at a beach cafe in Haifa, Israel, as tensions in the Middle East escalate.\nUS destroyers helped shoot down ballistic missiles and drones launched by Iran at Israel in April.\nBiden and Vice President Kamala Harris also met with the administration's national security team in the White House Situation Room later on Monday.\nThis time, according to officials who spoke to CNN on the condition of anonymity, the American intelligence picture is much murkier."}, {"id": "bd36efe4-49ef-425b-97c0-ecd194fa1797", "title": "Editorial : Middle East is now stuck in dangerous cul - de - sac of violence", "date": "2024-08-06 03:45", "url": "https://www.independent.ie/opinion/editorial/editorial-middle-east-is-now-stuck-in-dangerous-cul-de-sac-of-violence/a638340067.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "There are moments when the will of a handful of free men breaks through determinism and opens up new roads,” said Charles de Gaulle.\nTragically there is no sign of those eagerly awaited “free men” or the “new roads” when it comes to getting the Middle East out of the lethal cul-de-sac it has entered.\nTaoiseach Simon Harris is advising Irish citizens not to travel to Israel due to growing instability in the region.\nThe last seven days have virtually obliterated prospects of avoiding a catastrophic regional war.\nJust as conflict entraps those who relentlessly pursue it, violence multiplies violence."}, {"id": "fc8c70c2-4ef8-489d-b662-3f33494cb554", "title": "Rockets fired at Iraq Ain al - Asad air base , which houses US forces - 06 - Aug - 2024", "date": "2024-08-06 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404053&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Two Katyusha rockets were fired at al-Asad air base in western Iraq, two Iraqi security sources said.\n\"Base personnel are conducting a post-attack damage assessment,\" one of the officials said.\nThey also received details about the attack on al-Asad air base.\nHezbollah attack wounds Israeli troopsLebanese militant group Hezbollah said it launched a drone attack early on Monday on northern Israel that the Israeli military said wounded two Israeli troops.\n\"It will have a negative impact on the ongoing negotiations to end the aggression and withdraw Israeli troops from Gaza.\""}, {"id": "3cb55cb9-e0b6-4c77-af70-bfafea090ada", "title": "US personnel injured after rocket attack on military base in Iraq", "date": "2024-08-06 00:45", "url": "https://www.dailysabah.com/world/mid-east/us-personnel-injured-after-rocket-attack-on-military-base-in-iraq", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "A rocket attack on a military base in Iraq left several U.S. personnel injured on Monday, U.S. officials said.\nThe attack comes as tensions across the Middle East are spiking following the killings last week of a senior Hezbollah commander in Lebanon and Hamas’ top political leader in Iran.\nThe U.S. defense officials said troops at al-Asad air base were still assessing the damage.\nEarlier Monday, Iraqi security officials confirmed the attack, but no group has claimed responsibility.\nThe U.S. is bracing for Iran to make good on its vow to respond to the assassination of Hamas leader Ismail Haniyeh two days ago in Tehran."}, {"id": "88d0515e-de72-49f5-8a87-28aa11d8555c", "title": "Several U . S . personnel injured in suspected rocket attack at Al Asad air base : officials", "date": "2024-08-06 00:00", "url": "https://www.fox32chicago.com/news/al-asad-air-base-attack-us-injuries", "domain": "fox32chicago.com", "domain_classification": "Unknown", "message": "Several U.S. personnel were injured in a suspected rocket attack at the Ain al-Asad air base in western Iraq, according to U.S. defense officials.\nA U.S. defense official confirmed the suspected rocket attack to Fox News on Monday afternoon.\nSpeaking to Fox News, the official said that \"several\" U.S. personnel were injured during the incident.\n\"Base personnel are conducting a post-attack damage assessment,\" the official added.\nBIDEN TO MEET WITH NATIONAL SECURITY TEAM AHEAD OF ANTICIPATED IRANIAN ATTACK AGAINST ISRAELThe Ain al-Asad military airbase pictured on January 13, 2020."}, {"id": "062a9bb0-0f05-41ba-a08e-792306d98944", "title": "US troops injured in attack in Iraq as tensions in region increase", "date": "2024-08-06 02:15", "url": "https://www.yahoo.com/news/us-troops-injured-attack-iraq-013400308.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Several U.S. personnel were injured in a suspected rocket attack Monday against Al-Asad Airbase in Iraq, which houses American and coalition troops, a U.S. defense official said.\nThe attack comes as Israel and the U.S. are shifting forces in the region while awaiting an expected Iranian attack on Israel, which U.S. officials have said could also target American bases and assets in the region.\n“We can confirm that there was a suspected rocket attack today against U.S. and Coalition forces at Al-Asad Airbase, Iraq,” the official said.\n“Initial indications are that several U.S. personnel were injured.” An assessment of the damage was being conducted.\nFrom October to January, American and coalition troops endured more than 150 attacks, culminating in a January strike on a U.S. outpost in Jordan that killed three U.S. troops."}, {"id": "3977f524-58e1-44ca-9488-27bd10637022", "title": "Rockets fired at Iraq al - Asad air base , injuring US personnel - 06 - Aug - 2024", "date": "2024-08-06 03:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404053", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Two Katyusha rockets were fired at al-Asad air base in western Iraq, two Iraqi security sources said.\n\"Base personnel are conducting a post-attack damage assessment,\" one of the officials said.\nThey also received details about the attack on al-Asad air base.\nHezbollah attack wounds Israeli troopsLebanese militant group Hezbollah said it launched a drone attack early on Monday on northern Israel that the Israeli military said wounded two Israeli troops.\n\"It will have a negative impact on the ongoing negotiations to end the aggression and withdraw Israeli troops from Gaza.\""}, {"id": "6865e628-a061-4621-94df-ca271590591f", "title": "Israeli Drone Targets And Kills Elite Hezbollah Unit Commander", "date": "2024-08-06 02:15", "url": "https://dailycaller.com/2024/08/05/israeli-drone-strike-targets-kills-elite-hezbollah-unit-commander-ali-jamal-al-din-jawad/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Israel Defense Forces (IDF) executed a targeted strike Monday against a senior member of Hezbollah in southern Lebanon, New York Post reported.\nAli Jamal al-Din Jawad, a commander of Hezbollah’s elite Radwan unit, was killed when an Israeli drone targeted his vehicle in the village of Aabba.\nIsrael takes out commander of elite Hezbollah unit in drone strike https://t.co/wXLYlee3ht pic.twitter.com/jY4fp0rC2F — New York Post (@nypost) August 5, 2024This operation follows a series of drone attacks by Hezbollah on northern Israel, one of which wounded two IDF soldiers and caused a fire.\nIn response to these attacks, the IDF also struck a Hezbollah facility in Kafr Kila with fighter jets, the outlet reported.\nThis escalation began following Hamas’ attacks on Israel starting Oct. 7, according to the New York Post."}, {"id": "0ab76b38-17d6-4476-844e-a52cf5c1fba3", "title": "Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attack", "date": "2024-08-06 03:15", "url": "https://www.citizen.co.za/news/news-world/flurry-of-diplomacy-to-ease-mideast-tensions-as-israel-awaits-iran-attack/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attackDiplomatic pressure mounts to prevent escalation between Iran and Israel amid high-profile killings.\n– Fallout from the Gaza war is regularly felt on the Israel-Lebanon frontier, where deadly cross-border exchanges have escalated between Israeli troops and mainly Hezbollah fighters.\n‘Path of dialogue’Experts and diplomats fear that the expected attack on Israel could rapidly spiral into a regional war.\nTurkey on Monday joined multiple Western and other nations calling on their citizens to leave Lebanon, where Hezbollah is based.\nThe Israeli military said around 15 rockets had crossed from the southern Gaza Strip into Israel on Monday, with medics saying they were treating an injured man."}, {"id": "db471cc5-3b1d-4c58-8e5c-1d96d9691959", "title": "Hiroshima Day 2024 : Know Date , History , Significance , Facts , Impacts", "date": "2024-08-06 03:15", "url": "https://menafn.com/1108520347/Hiroshima-Day-2024-Know-Date-History-Significance-Facts-Impacts", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- AsiaNet News) Hiroshima Day, observed annually on August 6th, marks the anniversary of the atomic bomb drop on Hiroshima in 1945.\nThis pivotal event reshaped global history, bringing the destructive power of nuclear weapons into sharp focus and highlighting the urgent need for peaceAugust 6th commemorates Hiroshima Day, marking the 1945 atomic bombing that changed world history.\nIt underscores the importance of preventing future nuclear conflictsThe Hiroshima Peace Memorial Museum and the Hiroshima Peace Memorial Park are dedicated to preserving the memory of the victims and educating visitors about the horrorsAnnual ceremonies and events on Hiroshima Day honor the memory of those who perished and reaffirm the global commitment to preventing the use of nuclear weaponsThe legacy of Hiroshima Day extends beyond remembrance.\nIt inspires ongoing efforts toward nuclear disarmament, international cooperationVarious countries and organizations use Hiroshima Day as an opportunity to renew their commitment to arms control agreements and to advocate for policiesHiroshima Day also prompts reflection on the broader impact of war and the importance of humanitarian efforts.\nIt serves as a call to action for promoting peace, justice"}, {"id": "1bbe771a-111a-40b7-80f1-4ef09583c1f9", "title": "Armageddon notwithstanding * WorldNetDaily * by Jonathan Feldstein", "date": "2024-08-06 02:15", "url": "https://www.wnd.com/2024/08/armageddon-notwithstanding/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "I’d be lying if I told you that things are not tense in Israel right now, nationally and personally.\nAs always, one of the ways to get through it is with humor, even when the situation is far from funny.\nGet the hottest, most important news stories on the internet – delivered FREE to your inbox as soon as they break!\nIf anything happened, packing 12 people into a one-room bomb shelter might be stressful, as much as it would be important that we are all together, especially since four of our children live in buildings without bomb shelters.\n“I’d rather go out getting great video and hope my phone survived.”He was concerned by that, told me it was unsafe, and I should go to my bomb shelter."}, {"id": "f2ea0153-f7c7-4722-bd50-55168db0f523", "title": "Polish man to stand trial over assault on Denmark prime minister", "date": "2024-08-06 02:45", "url": "https://www.thestar.com.my/news/world/2024/08/06/polish-man-to-stand-trial-over-assault-on-denmark039s-prime-minister", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "COPENHAGEN (Reuters) - A Polish man will stand trial in Denmark on Tuesday over an attack on Prime Minister Mette Frederiksen in central Copenhagen in early June, facing charges of assaulting a public official.\nThe attack in Denmark happened three weeks after Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt and just over a month before the shooting of U.S. presidential contender Donald Trump.\nThe 39-year-old man who is accused of punching Frederiksen said in preliminary questioning that he was not guilty of the offence.\nInvestigators have said he was under the influence of alcohol and drugs at the time, and was believed to be unaware that the victim was Denmark's prime minister.\nFrederiksen, who was accompanied by security guards, sustained a minor whiplash injury in the assault, which occurred in a square in Copenhagen's centre, her office has said."}, {"id": "840b7631-4484-4538-8897-7a259d048492", "title": "Polish man to stand trial over assault on Denmark prime minister", "date": "2024-08-06 02:45", "url": "https://www.swissinfo.ch/eng/polish-man-to-stand-trial-over-assault-on-denmark", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Polish man to stand trial over assault on Denmark’s prime ministerreuters_tickers2 minutesBy Isabelle Yr CarlssonCOPENHAGEN (Reuters) – A Polish man will stand trial in Denmark on Tuesday over an attack on Prime Minister Mette Frederiksen in central Copenhagen in early June, facing charges of assaulting a public official.\nThe attack in Denmark happened three weeks after Slovakia’s Prime Minister Robert Fico was seriously injured in an assassination attempt and just over a month before the shooting of U.S. presidential contender Donald Trump.\nThe 39-year-old man who is accused of punching Frederiksen said in preliminary questioning that he was not guilty of the offence.\nInvestigators have said he was under the influence of alcohol and drugs at the time, and was believed to be unaware that the victim was Denmark’s prime minister.\nThe suspect’s lawyer was not available for comment, and the public prosecutor declined to comment."}, {"id": "a67343a8-4fa2-4cf0-903c-95b11d30ef8e", "title": "Bangladesh Prime Minister Sheikh Hasina Resigns ; Caretaker Government to Form", "date": "2024-08-06 01:30", "url": "https://foreignpolicy.com/2024/08/05/bangladesh-prime-minister-sheikh-hasina-resigns-protests/?tpcc=recirc_trending062921", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "Hasina Steps DownBangladeshi Prime Minister Sheikh Hasina resigned on Monday after weeks of deadly mass protests over the country’s controversial job quota system.\nAmid high inflation rates—and with nearly one-third of youth unemployed—many young people in Bangladesh felt that the quota system favored allies of Hasina’s ruling Awami League.\nHasina held power for 20 of the last 30 years, making her one of the world’s longest-ruling female leaders.\nOn Monday, the country’s president ordered the release of jailed former prime minister and opposition leader Khaleda Zia.\nBritish Prime Minister Keir Starmer convened an emergency cabinet meeting on Monday to address violent far-right protests."}, {"id": "5e411f02-b63c-40cd-9b4b-87a789ccb738", "title": "Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attack", "date": "2024-08-06 04:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380033.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Diplomatic pressure mounted Monday to avert an escalation between Iran and Israel following high-profile killings that have sent regional tensions soaring.\nThe killing came hours after an Israeli strike on Beirut killed the military chief of Lebanon's Hezbollah movement, Fuad Shuk.\nU.S. news site Axios earlier reported that Blinken told his counterparts from the G7 nations that any attack by Iran and Hezbollah could happen as early as Monday.\nTehran has said it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nFar from the Lebanese border, the Israeli military said around 15 rockets had crossed from the southern Gaza Strip into Israel on Monday, with medics reporting one injury."}, {"id": "14d8608c-2a03-4793-8220-2c6c92c2c091", "title": "Biden Holds  Around - The - Clock  Crisis Talks To Prevent Israel - Iran War", "date": "2024-08-06 02:45", "url": "https://www.india.com/news/world/biden-holds-around-the-clock-crisis-talks-to-prevent-israel-iran-war-7142631/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNewsBiden Holds ‘Around-The-Clock’ Crisis Talks To Prevent Israel-Iran WarBiden Holds ‘Around-The-Clock’ Crisis Talks To Prevent Israel-Iran WarPresident Biden contacted King Abdullah II of Jordan, who assisted in shooting down Iranian drones and missiles during an earlier confrontation in April.\nBiden Holds 'Around-The-Clock' Crisis Talks To Prevent Israel-Iran WarWashington: US President Joe Biden has held crisis talks on a potential Iranian retaliation against Israel as his administration said it was working around the clock to avoid a full-scale war in the Middle East.\n“It’s also critical that we break this cycle by reaching a ceasefire in Gaza,” Blinken stated.\nPresident Biden contacted King Abdullah II of Jordan, who assisted in shooting down Iranian drones and missiles during an earlier confrontation in April.\nBiden had hoped to end the Gaza war and negotiate a landmark deal between Israel and Saudi Arabia during his final months in office."}, {"id": "e1399daf-99b5-4213-9132-70928b185b52", "title": "Polish man to stand trial over assault on Denmark prime minister", "date": "2024-08-06 01:30", "url": "https://www.yahoo.com/news/polish-man-stand-trial-over-010650575.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Mette Frederiksen speaks to the media after the Social Democrats' party leader speech on the Main Stage during the People's Meeting 2024By Isabelle Yr CarlssonCOPENHAGEN (Reuters) - A Polish man will stand trial in Denmark on Tuesday over an attack on Prime Minister Mette Frederiksen in central Copenhagen in early June, facing charges of assaulting a public official.\nThe attack in Denmark happened three weeks after Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt and just over a month before the shooting of U.S. presidential contender Donald Trump.\nThe 39-year-old man who is accused of punching Frederiksen said in preliminary questioning that he was not guilty of the offence.\nInvestigators have said he was under the influence of alcohol and drugs at the time, and was believed to be unaware that the victim was Denmark's prime minister.\n(Reporting by Isabelle Yr Carlsson, additional reporting by Louise Rasmussen; Editing by Terje Solsvik and Ros Russell)"}, {"id": "c5a3318f-2d35-485e-a729-d11f6aa3b3c2", "title": "Breaking News Live Updates August 6 : Mali cuts diplomatic ties with Ukraine", "date": "2024-08-06 02:00", "url": "https://timesofindia.indiatimes.com/india/breaking-news-live-updates-august-6/liveblog/112302666.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "06:36 (IST) Aug 06Venezuela's opposition leaders on Monday appealed to the army, the main pillar of support for President Nicolas Maduro, to \"take the side of the people\" after his disputed reelection -- a call swiftly met with a criminal probe.\nProsecutors said they had opened an investigation targeting opposition leader Maria Corina Machado and presidential candidate Edmundo Gonzalez Urrutia for announcing an election winner other than Maduro, instigating disobedience and insurrection.\nWhile under public pressure to release detailed, precinct-level records backing up its assertion that Maduro won, the National Electoral Council said Monday it had presented all these records to the Supreme Court for certification, as requested by Maduro -- but not publicly.\nThe opposition insists Gonzalez Urrutia was the rightful victor of the July 28 presidential election, which has plunged the oil-rich nation into political crisis."}, {"id": "3f5c3a8b-0cb7-4bb7-95de-474ad7e12c19", "title": "Several US personnel injured in rocket attack on Ain al - Asad base in Iraq", "date": "2024-08-06 02:45", "url": "http://www.israelnationalnews.com/news/394165", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Several US personnel were injured in a suspected rocket attack at the Ain al-Asad air base in western Iraq on Monday, Fox News reported, citing US defense officials.\n\"Base personnel are conducting a post-attack damage assessment,\" the official added.\nMonday’s attack marks the third time in recent weeks that the base has come under attack, but the first time that any injuries have been reported.\nIn late July, multiple rockets were launched at Ain al-Asad airbase.\nThe Ain al-Asad base had come under attack by two armed drones the previous week as well, but that attack was the first one against US forces in Iraq since early February, when Iranian-backed groups in Iraq announced they would stop their attacks against US troops."}, {"id": "0b9e3283-f7ea-4e30-ae66-307e399db49d", "title": "US , Allies Make Frantic Push to Avert Possible Mideast War", "date": "2024-08-06 04:15", "url": "https://finance.yahoo.com/news/impatient-israelis-want-preempt-iran-171201304.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "Jordan’s foreign minister Ayman Safadi made a rare trip to Iran over the weekend, meeting Iran’s acting foreign minister Ali Bagheri Kani.\nThe carrier is accompanied by three destroyers capable of land attack and air defense — the USS Daniel Inouye, USS Michael Murphy and USS Russell.\nThe US is pressing Netanyahu to redouble efforts to reach a cease-fire deal with Hamas over their war in Gaza.\nKurilla “held a joint situational assessment on security and strategic issues, as well as joint preparations in the region,” according to the Israel Defense Forces.\nIsrael is in a “multi-front war against Iran’s axis of evil,” Netanyahu said on Sunday."}, {"id": "b5037640-ff6c-47af-9c74-be983ed7f26a", "title": "Five Killed In Israeli West Bank Air Strike", "date": "2024-08-06 04:00", "url": "https://menafn.com/1108520448/Five-Killed-In-Israeli-West-Bank-Air-Strike", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Above, the Israeli settlement of Givat Zeev, near the Palestinian city of Ramallah in the occupied West Bank (AFP photo)Above, the Israeli settlement of Givat Zeev, near the Palestinian city of Ramallah in the occupied West Bank (AFP photo)(MENAFN- Jordan Times) TULKAREM, Palestinian Territories - An Israeli drone strike killed five people in the occupied West on Saturday, the Palestinian press agency Wafa reported, while the Israeli military said it struck \"five terrorists\" on their way to carry out an attack.\nAlongside the Israel-Hamas war that began last October in the Gaza Strip, violence has intensified in the West Bank.\nThe total -- 30,682 settler units in both the West Bank and east Jerusalem -- is the highest since 2012, it added.\nAll of Israel's settlements in the West Bank, occupied since 1967, are considered illegal under international law, regardless of whether they have Israeli planning permission.\nExcluding east Jerusalem, some 490,000 Israeli settlers now live in the West Bank alongside some three million Palestinians."}, {"id": "2b9a8daa-d7da-4b88-a567-8c7cb6a74e36", "title": "Rocket attack on U Ain al - Assad base in Iraq leaves multiple US personnel wounded – Firstpost", "date": "2024-08-06 02:15", "url": "https://www.firstpost.com/world/us-iraq-ain-al-assad-rocket-attack-soldiers-wounded-13801337.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AFPA rocket attack on the Ain al-Assad base in western Iraq injured several US personnel on Monday (Sugust 5), officials reported, as regional tensions escalate with an anticipated Iranian counterattack on Israel.\n“Initial indications are that several US personnel were injured.”AdvertisementThe spokesperson added that base personnel are conducting a post-attack damage assessment and will provide updates as more information becomes available.\nPresident Joe Biden and Vice President Kamala Harris have been briefed on the incident, the White House stated.\nPresident Joe Biden, too, posted about the same on X (formerly Twitter).\nWe also… pic.twitter.com/kbRcVkW3ex — President Biden (@POTUS) August 5, 2024Earlier Monday, Iraqi security officials confirmed the attack, but no group has claimed responsibility."}, {"id": "65e76008-1cb7-4b5b-9fc6-8145aa2f1832", "title": "Crew of USS Mason Adapted to Demands of Intense Red Sea Deployment , Sailors Say", "date": "2024-08-06 02:30", "url": "https://news.usni.org/2024/08/05/crew-of-uss-mason-adapted-to-demands-of-intense-red-sea-deployment-sailors-say", "domain": "news.usni.org", "domain_classification": "Unknown", "message": "ABOARD GUIDED-MISSILE DESTROYER USS MASON – When sailors assigned to USS Mason (DDG-87) were in workups last year, many expected a standard Mediterranean Sea deployment.\nFor months, Mason’s sailors kept up with a consistent barrage of Houthi firings by shooting down unmanned aerial vehicles and missiles.\nOn Nov. 26, the sailors saved the crew of MV Central Park from pirates who had boarded the merchant tanker in the southern Red Sea.\nIt was a landmark deployment for a U.S. naval warship, one that spurred the Navy to issue Mason sailors Combat Action Ribbons to the crew for multiple incidents between December 2023 and April 2024.\n“Everywhere you went, everyone had a story like that,” Franchetti said of the ships deployed to the Red Sea for the last 10 months."}, {"id": "eca5e199-d7a2-4b16-9c1c-14735262a649", "title": "US personnel injured in attack on airbase in Iraq", "date": "2024-08-06 02:30", "url": "https://www.rnz.co.nz/news/world/524303/us-personnel-injured-in-attack-on-airbase-in-iraq", "domain": "rnz.co.nz", "domain_classification": "Unknown", "message": "By Nadine Yousif, BBC NewsPhoto: AFP / Ayman HennaSeveral US personnel have been injured after a suspected rocket attack on an American military base in Iraq, US officials have said.\nOfficials told the BBC's partner CBS News the Al Asad airbase in western Iraq was attacked and that they are still assessing the damage.\n\"We can confirm that there was a suspected rocket attack today against US and Coalition forces at Al Asad Airbase, Iraq,\" said a Department of Defence spokesperson.\nBase personnel are conducting a post-attack damage assessment,\" the spokesperson added.\nPresident Joe Biden was briefed on the suspected attack, a White House official said."}, {"id": "07cbc20d-14ca-41ac-9a04-5509e881e6ef", "title": "Iraq", "date": "2024-08-06 03:00", "url": "https://www.rappler.com/world/middle-east/n58372492-iraq/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Two Katyusha rockets were fired at al-Asad airbase in western Iraq, two Iraqi security sources say.\nIt is unclear whether the attack was linked to threats by Iran to retaliate over the killings."}, {"id": "1812e55a-9c0d-4326-b8b9-8cc25a4b2deb", "title": "Managed | Philstar . com", "date": "2024-08-06 03:15", "url": "https://www.philstar.com/opinion/2024/08/06/2375846/managed", "domain": "philstar.com", "domain_classification": "Unknown", "message": "ManagedAny moment now, we should be witnessing the Great Middle East Missile Show, a furious exchange of missile fire between Iran and Israel.\nThe Iranians brag about their new hypersonic missile force.\nAs it was last April, whatever missile attack Iran and its proxy militias have planned is widely expected.\nBeyond a brief show of force, Iran risks exposing itself to the destruction of its strategic military facilities.\nThis will be a managed show with only marginal opportunities for miscalculation."}, {"id": "a1aa6704-e254-47f1-8267-a4addd113930", "title": "Several US personnel injured in suspected rocket attack at Iraqi military base : Officials", "date": "2024-08-06 02:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/several-us-personnel-injured-in-rocket-attack-at-iraqi-military-base-officials/articleshow/112299472.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "(With inputs from agencies)Several US military personnel sustained injuries on Monday in a suspected rocket strike on an Iraqi military base, according to US defense officials.The strike occurs amidst escalating tensions throughout the Middle East, following the recent assassinations of a high-ranking Hezbollah commander in Lebanon and the top political leader of Hamas in Iran last week.The Ain al-Assad base , situated in western Iraq, has been the target of a recent spate of rocket attacks, this base is home to American troops and personnel from the US-led coalition fighting against the Islamic State jihadist group .The attack on al-Asad air base in Iraq was confirmed by Iraqi security officials, but no group has claimed responsibility.\nUS defense officials stated that the troops stationed at the base are currently evaluating the extent of the damage caused by the attack.\n\"There was a suspected rocket attack today against US and coalition forces\" at the base, a US defense spokesperson said.\n\"Initial indications are that several US personnel were injured.\n\"\"Base personnel are conducting a post-attack damage assessment\" and updates will be provided as more information becomes available, the spokesperson added.Iranian-backed militias in Iraq have recently renewed their assaults on US military bases in Iraq and Syria after a period of several months.The attacks resumed following a strike on a base in Jordan in late January, which resulted in the deaths of three US soldiers and triggered a series of retaliatory strikes by American forces.From October to January, a coalition known as the Islamic Resistance in Iraq had consistently claimed responsibility for attacks, stating that they were carried out in response to \"Washington's support of Israel in its war against Hamas in Gaza\" and with the goal of forcing American troops to withdraw from the region."}, {"id": "5faa80c5-009d-48ad-a9fd-cfb2a082c6ca", "title": "Iraq Al - Assad Air Base : US personnel possibly injured in rocket attack , a Department of Defense spokesperson says", "date": "2024-08-06 02:15", "url": "https://abc30.com/post/iraq-al-assad-air-base-us-personnel-possibly-injured-rocket-attack-department-defense-spokesperson-says/15147615/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "US personnel possibly injured in rocket attack on Iraqi base: DODSeveral U.S. personnel were possibly injured following a suspected rocket attack Monday against U.S. and Coalition forces at Al-Assad Air Base in western Iraq, a Department of Defense spokesperson told ABC News.\nSeveral U.S. personnel were possibly injured following a suspected rocket attack Monday against U.S. and Coalition forces at Al-Assad Air Base in western Iraq, a Department of Defense spokesperson told ABC News.\nSeveral U.S. personnel were possibly injured following a suspected rocket attack Monday against U.S. and Coalition forces at Al-Assad Air Base in western Iraq, a Department of Defense spokesperson told ABC News.\nSeveral U.S. personnel were possibly injured following a suspected rocket attack Monday against U.S. and Coalition forces at Al-Assad Air Base in western Iraq, a Department of Defense spokesperson told ABC News.\nSeveral U.S. personnel were injured following a suspected rocket attack Monday against U.S. and Coalition forces at Al-Assad Air Base in western Iraq, a Department of Defense spokesperson told ABC News."}, {"id": "7e103c46-44bb-436a-ae57-46783fb7d804", "title": "US And Allies Make Last - Minute Push To Avert All - Out Mideast War", "date": "2024-08-06 04:30", "url": "https://menafn.com/1108519977/US-And-Allies-Make-Last-Minute-Push-To-Avert-All-Out-Mideast-War", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The US push was only one element of a broader effort by officials who sought to head off tit-for-tat escalation between Iran and Israel that could push the region into all-out regional war.\nJordan's foreign minister Ayman Safadi made a rare trip to Iran over the weekend, meeting Iran's acting foreign minister Ali Bagheri Kani.\nThe US is pressing Netanyahu to redouble efforts to reach a cease-fire deal with Hamas over their war in Gaza.\nNasser Kanaani, the spokesperson for Iran's foreign ministry, warned of“consequences” for any country supporting Israel, a message apparently aimed at the US and its allies as they rally to defend the Jewish state.\nIsrael is in a“multi-front war against Iran's axis of evil,” Netanyahu said on Sunday.“We are striking every one of its arms with great force."}, {"id": "21b22cfb-15db-45db-b965-91ef4a918192", "title": "U . S . says several troops hurt rocket attack at Iraqi military base", "date": "2024-08-06 00:45", "url": "https://www.adn.com/nation-world/2024/08/05/us-says-several-troops-hurt-rocket-attack-at-iraqi-military-base/", "domain": "adn.com", "domain_classification": "Unknown", "message": "The incident occurred at Al Asad air base, an installation in western Iraq, officials said in a statement.\nIraqi troops, who share the facility with the Americans, reported hearing ambulance sirens and alarms.\nADVERTISEMENTMonday’s violence follows a U.S. airstrike near Baghdad on Tuesday that targeted militants as they prepared to launch an attack on American personnel, officials have said.\nA Yemeni drone specialist who had traveled to Iraq to train other Iranian-backed fighters was among those killed, according to U.S. and Iraqi officials.\nU.S. and Iraqi officials have discussed a possible withdrawal of at least some of the approximately 2,500 U.S. troops in Iraq."}, {"id": "37ef17d7-7a18-4a1b-9a2d-2c3ae78a5a68", "title": "Latest Articles", "date": "2024-08-06 02:45", "url": "https://freerepublic.com/tag/*/index?more=4256494", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Tulsi Gabbard is a politician, military veteran, and former U.S. Representative.\nOur elected officials are supposed to be in charge of the country we live in.\nBut the more we learn about the inner workings of government, the less that seems to be true.\nSo, who is really running the show, and what will the future of America look like for those who truly hold the power?\nExpect to learn what Joe Biden is actually like behind the scenes, why RFK Jr’s campaign didn't succeed, the reason that Elon Musk’s X platform was so important during Trump's assassination attempt, the..."}, {"id": "93550925-5611-4d34-8dd6-e83733bf9183", "title": "EA - 18G Growlers With New Jamming Pods Onboard Carrier Heading To Middle East", "date": "2024-08-06 04:30", "url": "https://www.yahoo.com/news/ea-18g-growlers-jamming-pods-020602457.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The U.S. Navy supercarrier USS Abraham Lincoln is heading toward the Middle East with an air wing that includes EA-18G Growlers equipped with new AN/ALQ-249(V)1 Next Generation Jammer-Mid Band (NGJ-MB) electronic warfare pods.\nThe U.S. Navy supercarrier USS Abraham Lincoln is heading toward the Middle East with an air wing that includes EA-18G Growlers equipped with new AN/ALQ-249(V)1 Next Generation Jammer-Mid Band (NGJ-MB) electronic warfare pods.\nA VAQ-133 Growler assigned to the USS Abraham Lincoln with AN/ALQ-249(V)1 Next Generation Jammer-Mid Band (NGJ-MB) pods under its wings.\nUSNIt is important to note that as its name indicates, the NGJ-MB pods are only designed to work in certain frequency bands.\nA VAQ-133 EA-18G with NGJ-MB pods lands on board the USS Abraham Lincoln."}, {"id": "e1666e7c-d52d-40f4-9e35-b003548dfed9", "title": "Iran Pledged to Attack Israel Days Ago ;  Peace - Loving West  Said / Did Nothing | The Jewish Press - JewishPress . com | Elder of Ziyon | 2 Av 5784 – Tuesday , August 6 , 2024", "date": "2024-08-06 03:45", "url": "https://www.jewishpress.com/?p=701787", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Sefl defense has to be against an ongoing threat, and there is no ongoing threat from Israel unless Iran attacks.\nOnly after Iran organized a large attack on Israel from multiple directions – that everyone was expecting – were there condemnations.\n– Eliminating the Tee Jetty, Sea Island, and petrochemical piers that support Iran’s key oil export facility at Kharg Island, as a warning.\nWithout serious deterrence from the West towards Iran, in the face of a planned imminent attack , Israel is alone.\nThe silence, and inaction, in response to a direct Iranian threat to attack Israel speaks far louder than their pro-forma statements in April did."}, {"id": "2f172613-ed82-40be-9460-46b30423e3ca", "title": "Latest Articles", "date": "2024-08-06 03:45", "url": "https://freerepublic.com/tag/*/index?more=4256503", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Tulsi Gabbard is a politician, military veteran, and former U.S. Representative.\nOur elected officials are supposed to be in charge of the country we live in.\nBut the more we learn about the inner workings of government, the less that seems to be true.\nSo, who is really running the show, and what will the future of America look like for those who truly hold the power?\nExpect to learn what Joe Biden is actually like behind the scenes, why RFK Jr’s campaign didn't succeed, the reason that Elon Musk’s X platform was so important during Trump's assassination attempt, the..."}, {"id": "cc018c5f-90ce-4112-9e61-0792d2f54c1d", "title": "Several U . S . personnel injured in suspected rocket attack at Al Asad air base : officials", "date": "2024-08-06 02:45", "url": "https://www.fox35orlando.com/news/al-asad-air-base-attack-us-injuries", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Several U.S. personnel were injured in a suspected rocket attack at the Ain al-Asad air base in western Iraq, according to U.S. defense officials.\nA U.S. defense official confirmed the suspected rocket attack to Fox News on Monday afternoon.\nSpeaking to Fox News, the official said that \"several\" U.S. personnel were injured during the incident.\n\"Base personnel are conducting a post-attack damage assessment,\" the official added.\nBIDEN TO MEET WITH NATIONAL SECURITY TEAM AHEAD OF ANTICIPATED IRANIAN ATTACK AGAINST ISRAELThe Ain al-Asad military airbase pictured on January 13, 2020."}, {"id": "223f83f3-791a-4ab7-9b1d-6eb803a86b00", "title": "US mounts pressure campaign aimed at limiting Iranian retaliation", "date": "2024-08-06 00:00", "url": "https://www.mycentraloregon.com/2024/08/05/us-mounts-pressure-campaign-aimed-at-limiting-iranian-retaliation/", "domain": "mycentraloregon.com", "domain_classification": "Unknown", "message": "simon2579/Getty Images(WASHINGTON) — As the Middle East braces for potential escalation of hostilities, diplomats at the State Department are trying to rally allies and partners to pressure Tehran into containing the scope of its retaliation against Israel that U.S. officials now view as inevitable.\nHowever, they added that the U.S. doesn’t have a clear picture of Iran’s plan and that an attack could happen outside that window, as well.\nFouad Shukr, a Hezbollah commander, and Ismail Haniyeh, a top Hamas political leader, were killed last week in separate incidents.\nIsrael took responsibility for the strike that killed Shukr but has not said if it was also behind the attack that killed Haniyeh in Tehran, which Iran has blamed on Israel.\nCopyright © 2024, ABC Audio."}, {"id": "278b9ce2-6230-4626-8fd5-bad84266bee6", "title": "Lucas : Secret Service failures continue", "date": "2024-08-06 02:30", "url": "https://www.canoncitydailyrecord.com/2024/08/05/lucas-secret-service-failures-continue/", "domain": "canoncitydailyrecord.com", "domain_classification": "Unknown", "message": "Donald Trump ought to fire the Secret Service and hire Mossad, Israel’s outstanding intelligence and special operations agency.\nHe would not even tell the Senate who oversaw the Secret Service protection detail that day, or how many agents were involved.\nSurely the reaction of the Biden administration and the Secret Service would have been quite different if it were Kamala Harris who was shot rather than Trump.\nWhat is disheartening about the incident is how the Secret Service and the FBI had no prior intelligence about Crooks, or how the Secret Service failed to respond when people called out about “a man with a gun” heading toward his perch on the roof where he had clear sight of Trump.\nNot only did Israel kill them, but Israeli intelligence was able to first track them and find out where they were."}, {"id": "4c170c5c-02dd-469c-a92f-3e0ad12630b4", "title": "  Several  US personnel injured in rocket attack on Iraq base", "date": "2024-08-06 01:30", "url": "https://kvia.com/news/us-world/2024/08/05/several-us-personnel-injured-in-rocket-attack-on-iraq-base-2/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "‘Several’ US personnel injured in rocket attack on Iraq baseOriginally Published: 05 AUG 24 17:26 ET(CNN) — Several US personnel were injured in a suspected rocket attack Monday against US and coalition forces at Al-Asad Airbase in Iraq, a US defense official said.\n“We can confirm that there was a suspected rocket attack today against US and Coalition forces at Al-Asad Airbase, Iraq,” the official said.\n“Initial indications are that several US personnel were injured.\nBase personnel are conducting a post-attack damage assessment.”The attack comes amid extremely high tensions in the Middle East, as the US has been bracing for Iranian retaliation against Israel.\nIt also comes just days after Defense Secretary Lloyd Austin ordered additional military assets to the region, sending a carrier strike group, a fighter squadron and additional warships to the Middle East."}, {"id": "db2a50ce-528d-42ae-9cb7-5001a3e87a62", "title": "US passes message to Iran not to escalate at  critical moment  for Middle East", "date": "2024-08-06 02:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/us-passes-message-to-iran-not-to-escalate-at-critical-moment-for-middle-east/articleshow/112302630.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"All parties must take steps to ease tensions.\nIt will only lead to more conflict, more violence, more insecurity.\"\nPresident Joe Biden and Vice President Kamala Harris were briefed by their national security team on the situation in the Middle East, including threats posed by Iran and its proxies to Israel and U.S. servicemembers, the White House said.\n\"What it comes down to really is all parties finding ways to come to an agreement, not look for reasons to delay or to say no,\" Blinken said.\n\"It is urgent that all parties make the right choices in the hours and days ahead.\""}, {"id": "d78b3dd1-d453-4e05-9744-3a390c22f3df", "title": "US passes message to Iran not to escalate at  critical moment  for Middle East", "date": "2024-08-06 03:00", "url": "https://www.rappler.com/world/us-canada/united-states-message-iran-not-escalate-critical-moment-middle-east/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "US Secretary of State Antony Blinken speaks during the 2024 Australia-US Ministerial Consultations at the State Department in Washington, USA, on August 5, 2024.\n“All parties must refrain from escalation,” Blinken said during a signing ceremony with his Australian counterpart in Washington.\nIran has blamed Israel and said it will “punish” it; Israeli officials have not claimed responsibility for the killing.\nIt was unclear whether the attack was linked to threats by Iran to retaliate over Haniyeh’s killing, in which the US said it had no involvement.\n“I would expect that some of them would pass that message along and impress that point upon the government of Iran,” he added."}, {"id": "70a4df7d-a175-4071-8b2b-50785269000e", "title": "Australians advised to exercise caution in the United Kingdom  due to the threat of terrorism  amid riots", "date": "2024-08-06 04:30", "url": "https://www.skynews.com.au/australia-news/australians-advised-to-exercise-caution-in-the-united-kingdom-due-to-the-threat-of-terrorism-amid-violent-riots/news-story/84b8a8b9eba2ca40dc3a4832be4ed67d?nk=4be1bfc1b2181b0eaa11a84a5f320f94-1722917802", "domain": "skynews.com.au", "domain_classification": "Unknown", "message": "The Australian government had warned Aussies travelling to the United Kingdom to “exercise a high degree of caution” as the country faces the worst acts of civil unrest it has seen in 13 years.\nAustralians travelling to the United Kingdom have been urged by the government to “exercise a high degree of caution in the UK due to the threat of terrorism”.\nUnited Kingdom Prime Minister Keir Starmer rebuffed claims the violent attacks were acts of protest.\n“We will not tolerate attacks on mosques or on Muslim communities.”United Kingdom Prime Minister Keir Starmer rebuffed claims the violent attacks were acts of protest.\nThe violent mob targeted a mosque in Southport, hours after a peaceful vigil to mourn the victims of the attack was held in the tragedy-stricken town."}, {"id": "6ca7589c-1ad5-4326-a2c7-1d0658cbe7af", "title": "Anti - Muslim riots in united kingdom cause fear , security boosts", "date": "2024-08-06 02:15", "url": "https://religionnews.com/2024/08/05/anti-muslim-riots-in-uk-cause-fear-security-boosts/", "domain": "religionnews.com", "domain_classification": "Unknown", "message": "The riots have exposed divisions across the country over immigration and renewed concerns about the ability of far-right groups on social media to stoke unrest through misinformation.\nMeanwhile, British Muslims are increasingly concerned for their safety, with some staying home more for fear of being attacked.\n“False claims surrounding the attack quickly garnered millions of views online, galvanised by anti-Muslim and anti-migrant activists and promoted by platforms’ recommender systems,” the institute reported.\nOne of the far-right voices stoking the riots is Stephen Yaxley-Lennon, who uses the alias Tommy Robinson.\n“We shook hands with people, we hugged people, we gave out food to people,” Imam Adam Kelwick told Metro, a U.K. news outlet."}, {"id": "6656b315-5926-4f21-b3e9-f673fb296698", "title": "War fears and flight cancellations in Lebanon send travelers and residents scrambling", "date": "2024-08-06 02:15", "url": "https://www.kalw.org/npr-news/2024-08-05/war-fears-and-flight-cancellations-in-lebanon-send-travelers-and-residents-scrambling", "domain": "kalw.org", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah has also vowed retaliation after an Israeli airstrike killed the Lebanese group’s second in command in Beirut’s southern suburbs.\nFears rose after a report by a British newspaper that Hezbollah was stockpiling missiles at the airport, that it could be targeted again.\nBecause of successive wars and financial crises, Lebanon has more citizens living abroad than in Lebanon.\n‎ / AFP via Getty Images / AFP via Getty Images Workers unload medical supplies delivered by the World Health Organization as a prevention of any potential health crisis that might result from a major conflict in Lebanon, at Beirut International Airport Monday.\nAnwar Amro / AFP via Getty Images / AFP via Getty Images A passenger pushes a loaded trolley outside the departures' terminal at Rafic Hariri International Airport in Beirut on July 29."}, {"id": "79252f5c-78a5-4c48-97ce-e559568a88ae", "title": "Jordan FM makes rare visit to Iran as fears of a wider regional war soar – Ya Libnan", "date": "2024-08-06 03:15", "url": "https://yalibnan.com/2024/08/06/jordans-fm-makes-rare-visit-to-iran-as-fears-of-a-wider-regional-war-soar/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Ayman Safadi is the first senior Jordanian official to pay an official visit to Iran in over 20 years.\nJordan is a close Western ally and helped intercept scores of missiles and drones fired by Iran toward Israel in April.\nIran said it was retaliating for the killing of its generals in an Israeli strike in Syria.\nThe foreign minister will later meet the newly elected Iranian president, according to Iran’s state TV.\nThe last time a senior Jordanian official traveled to Iran on an official visit was in 2004 when then-Prime Minister Faisal al-Fayez went to Tehran."}, {"id": "91f4a64f-7ed5-4a26-b453-52b4e56cbf61", "title": "Texas Ranger reinstated after 2 years of suspension for role in Uvalde school shooting", "date": "2024-08-06 02:15", "url": "https://www.yahoo.com/news/texas-ranger-reinstated-2-years-232840881.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "UVALDE (Nexstar/KXAN) — After previous plans for termination, the Texas Department of Public Safety has reinstated a Texas Ranger who was suspended for more than a year over his response to the Robb Elementary School shooting in Uvalde.\nIn May 2022, a lone gunman killed 19 children and two teachers in conjoined classrooms at Robb Elementary in Uvalde.\nBACKGROUND: DPS to fire Texas Ranger for ‘inaction’ during Uvalde school shooting“I have decided to alter my preliminary decision based upon a review of the completed Texas Ranger criminal investigation,” McCraw wrote.\nINVESTIGATION: Internal memos find ‘no fault’ in suspended Texas Ranger’s Uvalde responseAccording to the OIG report, Kindell contacted Uvalde Police Department Sgt.\nOf the 91 DPS officers who responded to Robb Elementary on May 24, seven were put under investigation for their response to the shooting."}, {"id": "2f059ab5-36bc-4255-853f-9417fdf1f860", "title": "U . S . forces destroy multiple Houthi weapons , vehicles in past 24 hours : CENTCOM", "date": "2024-08-06 03:00", "url": "https://www.yahoo.com/news/u-forces-destroy-multiple-houthi-002650635.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The U.S. Central Command (CENTCOM) announced on Monday that American forces recently destroyed three uncrewed aerial systems (UAS) belonging to Houthis.\nCENTCOM added that U.S. forces also destroyed three other weapons and vessels belonging to the Houthis within the past 24 hours.\n\"Separately, USCENTCOM forces successfully destroyed one Houthi uncrewed surface vessel (USV), one Houthi uncrewed aerial vehicle (UAV) and one Houthi anti-ship ballistic missile (ASBM) in the Red Sea,\" the press release continued.\nCENTCOM said that the weapons \"presented a clear and imminent threat to U.S. and coalition forces, and merchant vessels in the region.\"\nOriginal article source: U.S. forces destroy multiple Houthi weapons, vehicles in past 24 hours: CENTCOM"}, {"id": "d5c83458-b534-49af-aa3a-0dfc03cf425e", "title": "America Choice in a Dangerous Age : Lead or Follow", "date": "2024-08-06 01:30", "url": "https://www.heritage.org/defense/report/americas-choice-dangerous-age-lead-or-follow", "domain": "heritage.org", "domain_classification": "Unknown", "message": "It’s my sense that White House defense decisions are putting this great Republic on the fast track for decline.\nThe logic has been simply baffling to me: Expand our military commitments while cutting funding for our armed forces.\nWe have flinched from positions of responsibility as the global order trembles with the forces of hope and change.\nGIs liberated Europe from a fascist tyrant and kept watch over Western European democracies while staring down the Soviet Empire.\nYou know, there’s a great story from World War II on what our acquisition strategy should be."}, {"id": "1d3bb160-6511-4e48-a537-e74b5c22da94", "title": "Furious Iran General Salami Vows  Holy Wrath  Against Israel", "date": "2024-08-06 02:00", "url": "https://www.breitbart.com/politics/2024/08/05/furious-iran-general-salami-vows-holy-wrath-against-israel/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "“Holy wrath” is coming against Israel, the furious head of Iran’s Islamic Revolutionary Guard Corps (IRGC), Major General Hossein Salami, declared Saturday.\nSalami spoke just hours before Israel said it is “counting the minutes until an Iranian attack,” according to Israel’s Army Radio, broadcasting at 7:00 a.m. Monday, local time.\nWe're in one of the most dead-serious, brink-of-war news cycles ever, and here one of the major players is a dude named \"General Salami.\"\nSalami declared, “The enemies of the Islamic nation, especially the criminal and terrorist Zionist gang, should await holy wrath and inevitable, severe revenge,” according to the semi-official Mehr News Agency.\nAs Breitbart News reported, the Israel Defense Forces (IDF) last week confirmed it had killed Hezbollah’s second-in-command, Fuad Shukr “Sayyid Muhsan,” who was also wanted for his role in the 1983 U.S. Marines barracks bombing in Beirut."}, {"id": "95d92bfb-7856-4abe-a10f-5a2f6f834791", "title": "Iran Likely The Culprit As Rocket Attack At Iraqi Military Base Injures Multiple US Personnel", "date": "2024-08-06 03:30", "url": "https://www.theyeshivaworld.com/news/general/2302977/iran-likely-the-culprit-as-rocket-attack-at-iraqi-military-base-injures-multiple-us-personnel.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Several U.S. personnel were injured in a suspected rocket attack at a military base in Iraq, U.S. defense officials said Monday, in what has been a recent uptick in strikes on American forces by Iranian-backed militias.\nThe attack comes as tensions across the Middle East are spiking following the killings last week of a senior Hezbollah commander in Lebanon and Hamas’ top political leader in Iran, in suspected Israeli strikes.\nThe U.S. defense officials said troops at al-Asad air base were still assessing the injuries and damage, and it appeared that as many as seven military troops and civilians were injured.\nEarlier Monday, Iraqi security officials confirmed the attack, but no group has claimed responsibility.\nThe American officials said the U.S. looked into reports of a possible second attack at the base but determined there had not been another one."}, {"id": "c89d268e-6460-43eb-85d1-0d676df84f12", "title": "US message to Iran not to escalate at  critical moment  ", "date": "2024-08-06 04:30", "url": "https://www.illawarramercury.com.au/story/8719994/us-message-to-iran-not-to-escalate-at-critical-moment/?cs=7479", "domain": "illawarramercury.com.au", "domain_classification": "Unknown", "message": "\"One of the points of the engagements that we have had is to urge countries to pass messages to Iran and urge countries to make clear to Iran that it is very much not in their interests to escalate this conflict, that it is very much not in their interest to launch another attack on Israel,\" said State Department spokesperson Matthew Miller."}, {"id": "e2a97c4d-94e4-417f-9684-26fc71eee22c", "title": "Memorial Ceremony for Nuclear Bombing Victims Begins in Hiroshima", "date": "2024-08-06 02:45", "url": "https://sputnikglobe.com/20240806/memorial-ceremony-for-nuclear-bombing-victims-begins-in-hiroshima-1119653126.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240806/memorial-ceremony-for-nuclear-bombing-victims-begins-in-hiroshima-1119653126.htmlMemorial Ceremony for Nuclear Bombing Victims Begins in HiroshimaMemorial Ceremony for Nuclear Bombing Victims Begins in HiroshimaSputnik InternationalA memorial ceremony for nuclear bombing victims began in the Peace Park in Hiroshima, the city that was the first in the world to experience the horror of the use of nuclear weapons, on the 79th anniversary of the tragedy.\nIt begins at 8:00 (23:00 GMT on Monday) with the laying of lists of those killed in the atomic bombing and its consequences at the monument.\nThe vast majority of victims of the atomic bombing were civilians.\nThe area of ​​the epicenter now houses a memorial Peace Park and a museum that contains documents and exhibits related to the atomic bombing of Hiroshima.\nhttps://sputnikglobe.com/20240519/japans-hiroshima-nagasaki-lodge-protest-over-recent-us-subcritical-nuclear-test-1118529426.htmlhttps://sputnikglobe.com/20230807/shadows-of-death-grim-reminders-of-atomic-bombing-in-hiroshima-1112434765.htmlhiroshimanagasakijapanSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik Internationalhiroshima remembrance ceremony, hiroshima memorial, hiroshima bombing tragedy, hiroshima memorial 2024"}, {"id": "b62dcb51-4bf8-4ad8-901f-153b3ede1982", "title": "A rocket attack at an Iraqi military base injures US personnel , officials tell AP", "date": "2024-08-06 00:45", "url": "https://www.clickondetroit.com/news/world/2024/08/05/a-rocket-attack-at-an-iraqi-military-base-injures-us-personnel-officials-tell-ap/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Alex Brandon)WASHINGTON – Several U.S. personnel were injured in a suspected rocket attack at a military base in Iraq, U.S. defense officials said Monday, in what has been a recent uptick in strikes on American forces by Iranian-backed militias.\nRecommended VideosThe U.S. defense officials said troops at al-Asad air base were still assessing the injuries and damage, and it appeared that as many as seven military troops and civilians were injured.\nEarlier Monday, Iraqi security officials confirmed the attack, but no group has claimed responsibility.\nThe American officials said the U.S. looked into reports of a possible second attack at the base but determined there had not been another one.\nThe officials spoke on condition of anonymity to discuss military operations."}, {"id": "07e2b8e5-3057-4e85-a369-d3e53e37d2d4", "title": "US urges North Korea to halt unproductive actions following tactical missile launcher transfer event", "date": "2024-08-06 04:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380024.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The United States called on North Korea Monday to stop \"provocative\" and \"unproductive\" steps and return to dialogue after Pyongyang said it held a ceremony over the weekend for transferring 250 new tactical missile launchers to frontline military units.\n\"We would encourage North Korea to discontinue taking provocative and unproductive steps and return to the negotiating table,\" he told a press briefing.\nMiller also expressed hope that humanitarian concerns involving North Korean people will be addressed following reports about heavy damage from recent downpours in the reclusive state.\n\"Obviously, our thoughts are always with the people of North Korea as they are with the people of any country around the world when they suffer humanitarian disaster,\" he said.\nSo we would hope to see the humanitarian needs of the North Korean people addressed.\""}, {"id": "32040345-d2da-4f70-bc28-45d8305ba617", "title": "Romans were terrified by war elephants at first – but eventually found a way to defeat them in battle", "date": "2024-08-06 03:30", "url": "https://theconversation.com/romans-were-terrified-by-war-elephants-at-first-but-eventually-found-a-way-to-defeat-them-in-battle-234484", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "Roman soldiers were reportedly terrified the first time they faced war elephants on the battlefield.\nAlexander encountered war elephants in IndiaAlexander the Great brought elephants back to the Mediterranean world after campaigning in northern India, where elephants had been used for centuries in warfare – and would be used for centuries to come.\nSo began the ancient Mediterranean world’s (rather misguided) fascination with war elephants.\nOne Greek leader who equipped his army with war elephants was King Pyrrhus of Epirus, who eventually went to war with the then-emerging power of Rome – and reportedly introduced them to war elephants.\nElephants are a double-edged swordOverall, war elephants in the ancient Mediterranean world could be useful against infantry – and especially horses – that had not experienced them before."}, {"id": "97b54266-30ce-4ffa-8e22-558f59a0bcf3", "title": "10 Filibusters And Military Adventurers From History", "date": "2024-08-06 02:30", "url": "https://listverse.com/2015/10/11/10-filibusters-and-military-adventurers-from-history/", "domain": "listverse.com", "domain_classification": "Unknown", "message": "These filibusters were frequently successful, and their military conquests helped to launch individual political careers.\nFlamboyant and always controversial, these filibusters and military adventurers left indelible marks on their epochs.\n7 Frederick Townsend WardUnlike most American military adventurers in the 19th century, Frederick Townsend Ward was not a Southern-born patrician.\nNot content to wallow in failure, Long regrouped and later joined a military expedition from Bolivar Point to Goliad, Texas.\nAt this point, Spanish Texas was ruled by Mexico and had been militarily strengthened due to continuous American agitation in the region."}, {"id": "d3473285-781a-4559-80bb-dd4693eea9f1", "title": "Large - scale military exercises across western US and eastern Pacific airspace to last until August 9", "date": "2024-08-06 03:15", "url": "https://keyt.com/news/california/2024/08/05/large-scale-military-exercises-across-western-us-airspace-to-last-until-august-9/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "SANTA BARBARA COUNTY, Calif. – Santa Barbara County residents may notice an increase in military aircraft in the local airspace from Aug. 5 to Aug. 9 as part of military exercises coordinated among western United States military installations.\n\"Bamboo Eagle provides a combat representative environment,\" explained Major General Christopher J. Niemi, commander of the U. S. Air Force Warfare Center.\n\"By honing our capabilities in dynamic and challenging environments, we strengthen our ability to deter aggression and safeguard our nation's interests.\"\nAccording to the Warfare Center, integrating training in the eastern Pacific Ocean and associated airspace is intended to give personnel \"combat representative training\" related to a marine environment.\nThe exercise includes augmenting command and control efforts with the Royal Air Force and Royal Australian Air Force from multiple basing locations in the western United States detailed the U.S. Air Force Warfare Center."}, {"id": "81cc98f5-5213-4696-9078-14ae3e8b84e0", "title": "General Dynamics Electric Boat Awarded $1 . 3 Billion Contract Modification For Long Lead Time Material For Virginia - Class Submarines", "date": "2024-08-06 02:45", "url": "https://menafn.com/1108519937/General-Dynamics-Electric-Boat-Awarded-13-Billion-Contract-Modification-For-Long-Lead-Time-Material-For-Virginia-Class-Submarines", "domain": "menafn.com", "domain_classification": "Unknown", "message": "General Dynamics Electric Boat was awarded $1.3 billion to purchase long lead time materials for Virginia-class Block VI submarines.\nGeneral Dynamics Electric Boat is the prime contractor and lead design yard for the Virginia class and constructs them in a teaming arrangement with HII's Newport News Shipbuilding in Virginia.\nGeneral Dynamics Electric Boat designs, builds, repairs and modernizes nuclear submarines for the U.S. Navy.\nMore information about General Dynamics Electric Boat is available at .\nSOURCE General Dynamics Electric Boat"}, {"id": "66be0432-270e-4d35-a13f-bc10a6018470", "title": "Lil Wayne Handwritten Lyric Notebook Up for $5 Million Auction", "date": "2024-08-06 02:30", "url": "https://www.billboard.com/music/rb-hip-hop/lil-waynes-handwritten-lyric-notebook-auction-1235747065/", "domain": "billboard.com", "domain_classification": "Unknown", "message": "Lil Wayne fans have the chance to add the ultimate artifact to their collection with Weezy’s 1999 notebook filled with handwritten lyrics heading to the auction desk.\nTrending on BillboardThe iconic notebook returns tot he auction block after a years-long legal battle when Wayne tried to claim ownership of the property in 2019.\nA Louisiana court ultimately sided with Moments in Time once Wayne reportedly didn’t respond to the lawsuit.\nThe person who found the notepad stored it in their garage, which was flooded by the storms of 2005’s devastating Hurricane Katrina.\nVisit Moment in Time to bid on Wayne’s notebook."}, {"id": "823ce665-eaa9-4223-8d9e-776d1739817b", "title": "House of the Dragon Showrunner Explains Why Season 2 Finale Skipped That Major Battle", "date": "2024-08-06 02:45", "url": "https://comicbook.com/tv-shows/news/house-of-the-dragon-season-2-finale-ending-skip-battle-gullet-showrunner/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "WARNING: This article contains MAJOR SPOILERS for House of the Dragon Season 2!\nContinue reading at your own risk... House of the Dragon's second season ended in surprising fashion on Sunday night.\nHouse of the Dragon's season finale cut to black just as both sides were making their way to the war, pushing the battle to next season.\nSpeaking at a post-season press conference (per Variety), House of the Dragon co-creator and showrunner Ryan Condal opened up about the situation.\nMartin's \"Fire & Blood\" book, House of the Dragon is set 200 years before the events of Game of Thrones."}, {"id": "32b07a53-5afd-4d35-a7af-6a5543238fcc", "title": "  The Battle for the Sky Rages On  – Ukraine at War Update for Aug . 6", "date": "2024-08-06 04:30", "url": "https://www.kyivpost.com/post/36935", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Later, he assessed: “The enemy carried out a missile attack in the [sector] of Kyiv and its outskirts,” Popko wrote.\nAccording to preliminary data, enemy missiles were hit,” he said.\nBritain was the first to give Ukraine cruise missiles when it sent the first Storm Shadows in May 2023.\nThe commander of the Ukraine Air Force, Lt. Gen. Mykola Oleshchuk, commented Monday: “The battle for the sky rages on.\nThe Air Force, side by side with the air defense of the entire Ukrainian defense forces, has been repelling the attacks."}, {"id": "0906423a-964e-4789-8d65-31917f93d578", "title": "News & Politics Thread ( Part 7 ) ", "date": "2024-08-06 04:30", "url": "https://www.goldderby.com/forum/general-discussion/news-politics-thread-part-7/page/4/", "domain": "goldderby.com", "domain_classification": "Unknown", "message": "The left wing of the Democratic Party is increasingly pushing for Minnesota Gov.\nThe vice presidential battle, some strategists say, is starting to resemble a Democratic primary fight.\nThe normal voter is not paying attention to this,” said Keith Edwards, a digital Democratic strategist.\nOne Democratic strategist predicted that the backlash particularly from progressives likely wouldn’t play a major role in Harris’s decision, pointing to her moderated stances on issues like “Medicare for All” and fracking.\nEdwards also questioned how long voters will stay fixated on the veepstakes news cycle given the chaotic nature of politics over the past month."}, {"id": "24ef14fd-d0b6-4cbd-b302-f4c97ed23bf1", "title": "Nassau County Republicans pass mask ban after raucous debate", "date": "2024-08-06 04:30", "url": "https://gothamist.com/news/nassau-county-republicans-pass-mask-ban-after-raucous-debate", "domain": "gothamist.com", "domain_classification": "Unknown", "message": "Nassau County Republicans approved a sweeping ban on the public use of face coverings after a raucous debate on Monday.\nIt makes exceptions for religious and health reasons, but broadly bars groups from wearing masks in public, regardless of criminal activity.\n“This puts the police of this county in a very dangerous, difficult position,” Democratic Legislator Arnold Drucker said during the debate Monday.\n“Our bill respects individual freedoms by not imposing blanket prohibitions on wearing masks in public.\nDuring the COVID-19 pandemic’s health emergency in 2020, state lawmakers lifted a ban on wearing masks in public."}, {"id": "f28e1f82-9ab3-4204-bd13-b4466add4de7", "title": "Man wanted , suspected of abandoning dog on road in Edgecombe County", "date": "2024-08-06 04:30", "url": "https://www.yahoo.com/news/man-wanted-suspected-abandoning-dog-025325657.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROCKY MOUNT, N.C. (WNCT) — A man is wanted in Edgecombe County after the sheriff’s office got a call about a dog being dumped out of a vehicle near Rocky Mount.\nBattle was told animal control was unavailable until Monday since the dog was not a threat to the community.\nBattle is suspected of carrying the dog out into the county and abandoning him the same day.\nBattle is wanted for abandonment of an animal, a misdemeanor.\nAnyone with information on Battle’s location is asked to call the Edgecombe County Sheriff’s Office at 252-641-7911Copyright 2024 Nexstar Media, Inc. All rights reserved."}, {"id": "6d92b548-86f3-4b49-8e22-f3a6ce48f3ce", "title": "House of the Dragon Season 2 Ending , Explained", "date": "2024-08-06 01:30", "url": "https://www.cosmopolitan.com/entertainment/tv/a61774552/house-of-the-dragon-season-2-ending-explained/", "domain": "cosmopolitan.com", "domain_classification": "Unknown", "message": "The House of the Dragon season 2 finale may not have ended on a major death or battle, but the characters are scattered all over Westeros in a way that they haven't really been before on the Game of Thrones spin-off.\nTo help you prepare and get your bearings, let's explain everything that happened in the Season 2 finale of House of the Dragon and what it means.\nThe problem with House of the Dragon, if you see it as a problem, is that nothing really happened in the penultimate episode of season 2 either.\nBut Rhaenyra insists that to take the throne, she has to kill Alicent's sons (at least the \"king,\" Aegon).\nCourtesy of HBOThe former hand of the king and foot enthusiast proposed that he take King Aegon II to Braavos for his own safety until the war blows over."}, {"id": "faf30cae-9bf6-408c-8756-a07100238b18", "title": "US Lawmakers Honor Milwaukee Sikh Massacre Victims , Recommit to Fighting Hate", "date": "2024-08-06 03:30", "url": "https://www.devdiscourse.com/article/politics/3043125-us-lawmakers-honor-milwaukee-sikh-massacre-victims-recommit-to-fighting-hate", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "On August 5, 2012, Wade Michael Page (40) entered the gurdwara in Oak Creek and opened fire, as members of the congregation had gathered to prepare for Sunday service.\nThe victims of the massacre were Suveg Singh Khattra (84), Satwant Singh Kaleka (65), Ranjit Singh (49), Sita Singh (41), Paramjit Kaur (41), Prakash Singh (39) and Baba Punjab Singh (72).\nRepresentative Ro Khanna of California said that the Sikh community was devastated by a senseless act of hate, bigotry and violence.\nThere is no place for the mass violence and religious intolerance that took place in Oak Creek.\nWisconsin Governor Tony Evers proclaimed August 5 2024 as '12th Anniversary of the Oak Creek Sikh Temple Shooting' throughout the state."}, {"id": "b70949a8-1488-49a7-9058-87698dbf2a6b", "title": "Forum honors Flying Tiger lasting legacy", "date": "2024-08-06 03:45", "url": "http://africa.chinadaily.com.cn/a/202408/06/WS66b17933a3104e74fddb89e5.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Calloway recalled her grandfather's story at a recent gathering of the new generation of Flying Tigers, formerly known as the American Volunteer Group, during the 45th Anniversary of US-China Diplomatic Relations Forum hosted by Flying Tigers-friendly organizations.\nThe legacy of the Flying Tigers shows how much the United States and China can accomplish together over the course of history, said US Representative Judy Chu of California.\nThe Flying Tigers produced 39 US aces during their brief combat history.\nHundreds of Flying Tigers were saved, at the cost of thousands of Chinese soldiers and civilians who sacrificed their lives.\nLocal schools, especially the alma maters of Flying Tigers veterans, have joined the Flying Tigers Friendship School program."}, {"id": "60ef9c64-1478-4cfb-bb7d-5dd2d95786c1", "title": "Bangladesh Bans Militant Jamaat - e - Islami", "date": "2024-08-06 02:45", "url": "https://www.dailyexcelsior.com/bangladesh-bans-militant-jamaat-e-islami/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "By Tajul IslamOn August 1, 2024, Bangladesh took a decisive step in its fight against terrorism and extremism by officially banning the Jamaat-e-Islami (JeI) party and its student wing, Islami Chhatra Shibir.\nThe history of Jamaat-e-Islami in Bangladesh is marked by its contentious role during the 1971 war of independence.\nFollowing the announcement of the ban, Jamaat-e-Islami (JeI) activists attempted to mobilize protests across the country.\nThe reaction from Jamaat-e-Islami (JeI) was swift and defiant.\nThe decision to ban Jamaat-e-Islami (JeI) and its affiliates Islami Chhatra Shibir has been met with mixed reactions."}, {"id": "4dcda0f2-5303-4fe8-89a7-4cb5f71ff858", "title": "Bleach : Rebirth of Souls introduces Byakuya Kuchiki in new trailer", "date": "2024-08-06 01:00", "url": "https://nichegamer.com/bleach-rebirth-of-souls-introduces-byakuya-kuchiki-in-new-trailer/", "domain": "nichegamer.com", "domain_classification": "Unknown", "message": "Publisher Bandai Namco and developer Tamsoft shared a new character trailer for Bleach: Rebirth of Souls introducing Byakuya Kuchiki, the head of the Kuchiki clan.\nHere’s a rundown on the game, plus the new character trailer for Byakuya Kuchiki:Awaken the blade within you and reverse your fate in Bleach: Rebirth of Souls!\nFeatures Unleash Your Sword – Choose your favorite character and unleash their unique sword abilities!\nDefeat Enemies with a Single Strike – In Bleach: Rebirth of Souls, a single strike can spell defeat for your opponent.\n﻿Bleach: Rebirth of Souls is in development for Windows PC (via Steam), Xbox Series X|S, PlayStation 4, and PlayStation 5."}, {"id": "9af371fa-810b-4873-b810-7199abf9f28a", "title": "House of the Dragon Showrunner Defends Season 2 Finale :  We Dont Do Any of This Stuff Lightly . Is It Too Little , Too Late ? ", "date": "2024-08-06 03:00", "url": "https://www.tvfanatic.com/house-of-the-dragon-showrunner-defends-season-2-finale/", "domain": "tvfanatic.com", "domain_classification": "Unknown", "message": "If you were disappointed by the House of the Dragon Season 2 finale, you were not alone.\nNow that reviewers (myself included) and fans have voiced disappointment with the House of the Dragon Season 2 finale, a defense campaign has begun.\nWe waited two years for House of the Dragon Season 2, and there’s no telling when Season 3 will arrive.\nHouse of the Dragon Season 2 Episode 4 gave fans the most action we saw all season.\nWe all figured that with a midseason episode that incredible, the season finale should have been epic."}, {"id": "738d7f2a-e35f-4029-a81d-dd296184e3f8", "title": "NDC will win 2024 election – Ofosu - Ampofo", "date": "2024-08-06 03:15", "url": "https://www.ghanaweb.com/GhanaHomePage/politics/NDC-will-win-2024-election-Ofosu-Ampofo-1944084", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "Politics of Tuesday, 6 August 2024Source: starrfm.com.ghThe National Democratic Congress (NDC) is ready to take power in the 2024 elections, Dr. Samuel Ofosu-Ampofo, the party’s former National Chairman, has said.\nIn an interview on Star Chat with Bola Ray, Dr. Ofosu-Ampofo expressed confidence in the party’s preparations for the upcoming elections.\n“I believe that the NDC is very ready to take power,” Dr. Ofosu Ampofo said, citing the party’s reorganization efforts after the 2020 election loss.\nWhen asked about the contest between him and former General Secretary Asiedu Nketia, Dr. Ofosu-Ampofo stated, “I think that it was my right to contest.\n“I can assure you that the NDC is battle-ready to win the 2024 elections,” he said."}, {"id": "c5b02448-d266-4c1b-8cb4-8f62fb5ea8d1", "title": "Zionism and the  Last Days War  for Israel * WorldNetDaily * by Scott Lively", "date": "2024-08-06 02:15", "url": "https://www.wnd.com/2024/08/zionism-and-the-last-days-war-for-israel/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "This is the first in a series of articles explaining why the battle over “Zionism” that underlies all the wars of modern Israel is unfixable by anyone but Jesus Christ.\nFor the purposes of this article, the validity of the BI doctrine is totally irrelevant.\nGet the hottest, most important news stories on the internet – delivered FREE to your inbox as soon as they break!\nThe war in Christendom was whether to oppose or support one-house Jewish nationalism was engaged: Christian Zionism vs Anti-Zionism.\nHis father and all his brothers ended up there too, under his domination in fulfilment of Joseph’s prophetic dreams (Gens 37:3-11)."}, {"id": "5a703085-c091-4533-b163-3426659b090e", "title": "OnMilwaukee", "date": "2024-08-06 02:15", "url": "https://onmilwaukee.com/by/barnes-rush-nns", "domain": "onmilwaukee.com", "domain_classification": "Unknown", "message": "The latestMore than basketball: Cream Skills teaches kids how to succeed in business, lifeDriven by a personal tragedy and a vow to help combat violence in the community, Nigel Harvey founded a basketball league with a mission that goes beyond the court, Milwaukee Neighborhood News Service reports."}, {"id": "98336a8d-2db7-4bda-b93c-c6979d4e52ef", "title": "Tunisia court jails potential presidential candidates and bars them from upcoming election", "date": "2024-08-06 02:15", "url": "https://www.theguardian.com/world/article/2024/aug/06/tunisia-presidential-candidates-jailed-election", "domain": "theguardian.com", "domain_classification": "International", "message": "All four were sentenced to eight months in prison and banned from running for office on a charge of vote buying.\nLast month, a court sentenced Lotfi Mraihi, a potential presidential election candidate and fierce critic of Saied, to eight months in prison on a charge of vote buying.\nOn Monday morning, Tunisian president, Kais Saied, submitted his official candidacy for the election October election.\nUpon registering his candidacy, Saied, 66, told reporters in the capital Tunis that his candidacy was part of “a war of liberation and self-determination” aiming to “establish a new republic”.\nView image in fullscreen Tunisian President Kais Saied in Beijing, China 31 May 2024."}, {"id": "d04441fc-7240-4061-a1f9-7be8d177ba18", "title": "CA lawmakers back to work", "date": "2024-08-06 02:15", "url": "https://laist.com/brief/news/politics/california-legislature-is-back-to-decide-1300-bills", "domain": "laist.com", "domain_classification": "Unknown", "message": "Another contentious bill is AB 3027 , which would create a training program for law enforcement to identify and address “transnational repression,” writes CalMatters news intern Shaanth Nanguneri .\nRead the full storyThe California Legislature gets back to work today, starting a one-month sprint to adjournment on Aug. 31.\nLawmakers have a lot to finish up: More than 1,300 bills are still in play, though many will not reach Gov.\nThe measure lists Russia, China, Iran and India as governments that “increasingly rely” on transnational repression to control dissidents abroad.\nRead more about the transnational repression bill in Shaanth’s story."}, {"id": "4538ba03-ed21-410f-bec8-f995947f416b", "title": "Scooby - Doo and Guess Who ? - ITV2", "date": "2024-08-06 02:45", "url": "https://www.tvguide.co.uk/schedule/b63e186e-548b-5c9a-a163-cd87c435adec/scooby-doo-and-guess-who", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Scooby-Doo and Guess Who?\nITV2 8:35 AM to 9:00 AM Tuesday 6 August Share Add toCalendar +The Scooby of a Thousand Faces!\nSeason 1 Episode 6 of 26 S SubtitlesWhile on holiday in Greece, Mystery Inc. gets caught in a one-on-one battle between a Minotaur and Wonder WomanScooby-Doo and Guess Who?\nairs on ITV2 at 8:35 AM, Tuesday 6 August .\n(Subtitles.)"}, {"id": "a8ce1a35-90b0-4921-abd1-81e575f10c26", "title": "The Farmer Country Showdown - BBC Two HD", "date": "2024-08-06 04:15", "url": "https://www.tvguide.co.uk/schedule/0154b4f9-8b18-5a93-b916-15254e370693/the-farmers-country-showdown", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "The Farmers' Country ShowdownBBC Two HD 10:45 AM to 11:15 AM Tuesday 6 August Share Add toCalendar +Northumberland - Sheepdogs (Shortened) Season 4 of 20 Repeat S SubtitlesInternational sheepdog breeder David and farmer Brenda battle the temperamental British weather with their pedigree dogs by their sides, competing in Powburn, Northumberland, at one of Britain's oldest sheepdog trialsThe Farmers' Country Showdown airs on BBC Two HD at 10:45 AM, Tuesday 6 August .\n(Subtitles, repeat.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "bd5a809c-18d9-4572-99b4-3549eb153adc", "title": "  House of The Dragon  Might Give Us the Answers Weve Been Waiting For", "date": "2024-08-06 03:15", "url": "https://www.themarysue.com/house-of-the-dragon-might-give-us-the-answers-weve-been-waiting-for/", "domain": "themarysue.com", "domain_classification": "Unknown", "message": "House of The Dragon season 2 finale has as many supporters as haters.\nWhat did Daemon see in the House of The Dragon season 2 finale?\nA stark difference between the two shows is how Game of Thrones shied away from magic and prophecy while House of The Dragon leans into it.\nMost of these theories remained rather unclear by the time Game of Thrones season 8 finale aired, with factions fighting for both Jon and Dany to be the prophesied savior.\nAnd while I get that knowing the end of Game of Thrones makes this an even bleaker prospect, we’ve got to stick with it."}, {"id": "ec2f84b2-63ab-41e9-892b-ce2e12f70876", "title": "Austal united states launches future USS Pierre", "date": "2024-08-06 04:30", "url": "https://www.yahoo.com/news/austal-usa-launches-future-uss-022146483.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MOBILE, Ala. (WKRG) — Austal USA launched the future USS Pierre or LCS 38 as the last ship of the United States Navy’s Independence-variant Littoral Combat Ship program.\n“Meeting this ship milestone in such a safe and timely manner demonstrates how well our Austal USA launch team, transporter operators and tug pilots have learned to work together over the last 13 years, seamlessly executing this technical launch process,” Austal USA Vice President of New Construction Dave Growden said.\n“Our industry teams work methodically alongside our Navy partners to improve this innovative process with each launch evolution, guaranteeing the Navy a quality product delivered on time and on budget.”The future USS Pierre was christened in May.\nFrito-Lay distribution center coming to PrichardThe Austal USA release said the ship would deploy in the Pacific fleet area and would be responsible for supporting forward presence, maritime security, sea control, and deterrence.\nThis is the second ship Austal USA has launched for the U.S. Navy in 2024."}, {"id": "022e72b1-b365-4492-8667-6e9bf437162d", "title": "Bask in Ben Affleck Haircuts Through the Years", "date": "2024-08-06 01:00", "url": "https://www.usmagazine.com/stylish/pictures/bask-in-ben-afflecks-haircuts-through-the-years/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Ben Affleck has experimented with a number of hairstyles through the years.\nFrom buzz cuts and manicured coiffures and soft waves, Affleck can easily pull off any style.\nIn August 2024, he surprised Us with a new cut featuring shaved sides and a short tuft of hair on top of his head.\nThrough the years, Affleck has been known for maintaining a manicured look featuring clipped sides and slightly longer strands on top.\nAt the time, his brunette bangs were loosely curled while the sides of his head were pushed back."}, {"id": "156fd68a-71e9-49ec-a2ae-87a585c13a2d", "title": "New Mexican wildland firefighters helping combat Oregon wildfires", "date": "2024-08-06 01:30", "url": "https://kvia.com/news/new-mexico/2024/08/05/new-mexican-wildland-firefighters-helping-combat-oregon-wildfires/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "New Mexico (KVIA) -- Over 80 wildland firefighters and six wildland fire engines from New Mexico are now in Oregon to help combat the numerous wildfires raging across the state.\nThe firefighters were sent by the New Mexico Energy, Minerals and Natural Resources Department's Forestry Division.\n“Sadly, Oregon is currently overwhelmed by wildfire demands, and we’re grateful to be in a position to offer our support,” said State Forester Laura McCarthy.\nNew Mexico state wildfire crews will complete a 14-day assignment assisting the Oregon Department of Forestry in combating these fires.\nIn June, wildfire crews from the Oregon Department of Forestry traveled south to support suppression efforts during the devastating South Fork and Salt fires in Ruidoso."}, {"id": "5024fa85-6aa1-4d7a-b051-055dc4430b80", "title": "Brazil Battle with Amazon Degradation : Beyond Deforestation", "date": "2024-08-06 02:45", "url": "https://www.devdiscourse.com/article/science-environment/3043111-brazils-battle-with-amazon-degradation-beyond-deforestation", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Brazil's President Luiz Inacio Lula da Silva began his term in 2023 with a pledge to combat Amazon deforestation and reclaim his country's leadership in climate action.\nEnhanced enforcement measures have led to a more than 50% reduction in deforestation rates, aligning with Lula's goal to end deforestation by 2030.\nUsing advanced airborne laser scanning, researchers found that human-induced degradation and natural disturbances release far more carbon dioxide than clear-cut deforestation, accounting for 83% of emissions.\nThe research highlights that despite forests' natural ability to absorb carbon dioxide, the Amazon is currently emitting more carbon than it absorbs due to ongoing degradation.\nThe study's lead author, Ovidiu Csillik of Wake Forest University, stated the findings offer unprecedented insights into forest degradation."}, {"id": "a78bdcc3-f722-4c1e-9f7c-7776e2c2bfb3", "title": "House of the Dragon will end with season 4", "date": "2024-08-06 02:30", "url": "https://www.joblo.com/house-of-the-dragon-season-4-end/", "domain": "joblo.com", "domain_classification": "Unknown", "message": "The second season of House of the Dragon wrapped up on Sunday, bringing the Game of Thrones prequel series to its halfway point.\nThat’s right, series showrunner Ryan Condal has confirmed that House of the Dragon will likely end with season 4.\nAs with the second season, the third is also expected to consist of eight episodes.\nMartin’s Fire & Blood, House of the Dragon is set 200 years before the events of Game of Thrones and tells the story of House Targaryen.\nYou can check out a review of the second season from our own Alex Maidy right here."}, {"id": "86bdf51c-61c6-4d7c-af7f-8d75220a62f3", "title": "UK Government Adviser Suggests Covid - Style Lockdowns to Suppress Anti - Migrant Protests", "date": "2024-08-06 03:15", "url": "https://pjmedia.com/bryan-s-jung/2024/08/05/uk-government-adviser-suggests-covid-style-lockdowns-to-suppress-anti-migrant-protests-n4931343", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "Baron Walney, John Woodcock, the UK Government’s adviser on political violence, is now arguing that the government consider a COVID-style lockdown using the 2023 Public Order Act to stop all protests against open borders and migrant violence if the unrest continues.\nHe once described the BLM supporters who terrorized cities across the UK as “people rightly demanding justice” in his own thread on X.\nMeanwhile, UK Antifa groups are organizing to join the Muslim and leftist coalition to brawl with the protesters,\" warned journalist Andy Ngô in a tweet.\nMeanwhile, Nigel Farage, the leader of Reform UK, attacked Starmer for his failure to address the mass migration problem that has caused the latest crisis.\n“Ever since the soft policing of the Black Lives Matter protests, the impression of two-tier policing has become widespread."}, {"id": "2a970d2d-2120-454d-9406-fa580cf5588a", "title": "Memorial wall for Ethiopian Korean War veterans unveiled in Addis Ababa", "date": "2024-08-06 04:30", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/120_380036.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "A memorial wall engraved with the names of Ethiopian veterans of the 1950-53 Korean War has been established in Addis Ababa to honor their service in supporting South Korea, Seoul's veterans ministry said Tuesday.\nAn unveiling ceremony for the wall, bearing the names of 2,482 veterans, took place at the Korean War memorial in the Ethiopian capital Monday, attended by Veterans Minister Kang Jung-ai, according to the ministry.\nThe ministry said the wall was belatedly installed at the existing memorial site due to the loss of records of the veterans under Ethiopia's past communist regime.\nIn July last year, the governments of Ethiopia and South Korea, alongside the Ethiopian veterans association of the Korean War, began compiling and verifying records to confirm a list of 2,482 veterans.\nThe ministry plans to conduct further research to add more names to the wall as the Ethiopian veterans association has said more than 3,500 troops took part in the war."}, {"id": "5d684bef-ebf1-4981-af9d-0409d6969f4f", "title": "International students Australia : Labor migration crackdown to cost 14 , 000 jobs , universities say", "date": "2024-08-06 04:30", "url": "https://www.brisbanetimes.com.au/national/universities-say-14-000-jobs-to-be-slashed-as-labor-s-poll-driven-crackdown-bites-20240806-p5jzwq.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Universities are warning that 14,000 jobs could go as the government pushes ahead with its plan to cap international student numbers, a policy institutions say will have a catastrophic effect on institutions.\nUniversities Australia chief executive Luke Sheehy told a parliamentary inquiry the government was using students as “cannon fodder” and unfairly blaming them for the housing crisis.\nUniversities are warning of a $4.3 billion hit to the economy under government plans.\nCredit: Oscar ColmanHe said proposed legislation to cap international student numbers was poll-driven and a political smokescreen as the Labor government tries to gain an upper hand in the migration battle ahead of the next election.\nSheehy said that even without the proposed student caps, the government had already taken a sledgehammer to the international education sector, with visa grant rates down 23 per cent – or almost 60,000 students – over the past year."}, {"id": "40c8ac46-c3b5-4e8d-b031-3d2d1f7ceac1", "title": "Blue : Art for the Ocean - Blue Marine Foundation and Christie unite to auction artist - donated works", "date": "2024-08-06 04:30", "url": "https://artdaily.com/news/172762/Blue--Art-for-the-Ocean---Blue-Marine-Foundation-and-Christie-s-unite-to-auction-artist-donated-works", "domain": "artdaily.com", "domain_classification": "Unknown", "message": "More than 20 world leading artists are donating works to be auctioned within Christie\u0092s 20th/21st Century Art sales to benefit Blue Marine\u0092s projects around the world.\nFilmed on Fire Island in New York, Performance for the Oceans (2024) is the result of a collaboration between the Serbian conceptual and performance artist and Blue Marine.\n\"My Performance for the Oceans artwork for Blue: Art for the Ocean blends my artistic vision with environmental consciousness.\nBlue: Art for the Ocean highlights Christie\u0092s ongoing efforts to leverage its influence in the art market for promoting sustainability and driving positive change.\nClare Brook, CEO, Blue Marine Foundation: \u0093We are thrilled to present these wonderful works of art, donated so generously by leading artists from around the world."}, {"id": "181552cb-65af-49db-9a15-6af26ccc0c1c", "title": "Fast - moving California wildfire destroys homes and burns at least 100 acres", "date": "2024-08-06 03:15", "url": "https://www.theguardian.com/us-news/article/2024/aug/05/california-edgehill-wildfire-san-bernardino", "domain": "theguardian.com", "domain_classification": "International", "message": "A fast-moving wildfire burning in southern California’s San Bernardino county has burned at least 100 acres since it started this afternoon and destroyed several homes.\nThe Edgehill fire started about 3pm in the Shandin Hills area of San Bernardino and spread rapidly through the neighborhood, burning homes and forcing evacuations, according to San Bernardino county fire department.\nAs engines were pulling up, people were already evacuating out of this area.”News outlets showed video of homes burned to the foundation as the fire spread.\nFirefighters are battling a hillside blaze in San Bernardino that is burning homes as it spreads to more than 5 acres.\nIn northern California, the Park fire, which started 24 July and has destroyed hundreds of homes in Tehama and Butte counties, has burned more than 400,000 acres as of Monday evening."}, {"id": "46e0bc53-64a4-44e2-9d12-983c59828362", "title": "69th Bomb Squad Reunion : Honoring the Legacy at Loring Air Force Base", "date": "2024-08-06 02:30", "url": "https://www.wagmtv.com/2024/08/05/69th-bomb-squad-reunion-honoring-legacy-loring-air-force-base/", "domain": "wagmtv.com", "domain_classification": "Unknown", "message": "PRESQUE ISLE, Maine (WAGM) - The current 69th Bomb Squadron, which is stationed in North Dakota, flew to Loring Airforce Base which housed the 69th Bomb Squadron from 1953 to 1993.\nRaymond W Hildebrand, Former Captain for Loring’s 69th Bomb Squad said, “It’s a reunion between the old 69th bomb squadron and the new one.\nflying this very same machine, an earlier model.”Thomas Goetz, Former Pilot for Loring’s 69th Bomb Squad said, “I was here for 14 years as a pilot.\nI think it’s going to be super cool to be able to see, you know, where we did this 30 years ago.”Matthew Siebert, Weapons System Officer of the 69th Bomb Squad added, “It was pretty cool.\nReally cool to pay homage.” The B52 Bomber was on display all weekend for folks to come by for a tour."}, {"id": "bb0218a2-ee5f-49eb-8465-2d33038235c9", "title": "Selma Blair Shares Her Latest MS Treatment :  It Been Amazing  ", "date": "2024-08-06 01:00", "url": "https://www.usmagazine.com/celebrity-news/news/selma-blair-shares-her-latest-ms-treatment-its-been-amazing/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Selma Blair is revealing her latest treatment for multiple sclerosis.\nIt’s called Mavenclad.”Related: Everything Selma Blair Has Said About Her Multiple Sclerosis Battle Selma Blair has been candid about navigating her new normal since being diagnosed with multiple sclerosis in 2018.\nBlair — who shares son Arthur with ex Jason Bleick — gave fans an inside look at her health ups and downs in the 2021 documentary Introducing, Selma Blair.\nBye.”Since Blair announced her MS diagnosis in October 2018, she has been candid about the ups and downs of her illness — and her treatment.\n“It saved my life.”Related: Stars Battling Multiple Sclerosis Christina Applegate, Selma Blair, Jamie-Lynn Sigler, Jack Osbourne and many other celebrities have opened up about dealing with multiple sclerosis, an autoimmune disease."}, {"id": "3355e6ab-11fe-49f8-a71d-351f4aa7ed8d", "title": "St Andrew mechanic sentenced for drug trafficking , financial crimes", "date": "2024-08-06 02:45", "url": "https://www.jamaicaobserver.com/2024/08/05/st-andrew-mechanic-sentenced-drug-trafficking-financial-crimes/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica – The Financial Investigations Division (FID) says it has successfully secured a Pecuniary Penalty Order in the Supreme Court against a St Andrew mechanic for his involvement in drug trafficking activities.\nFernando Roye reportedly benefited financially to the tune of approximately J$2 million.\nRoye was subsequently charged with possession of cocaine, dealing in cocaine, trafficking cocaine, and conspiracy to traffic cocaine.\nOn July 24, Justice C. Tie Powell issued a Pecuniary Penalty Order under Section 5(3)(b) of the Proceeds of Crime Act, 2007, requiring Roye to pay J$2 million as a penalty.\nThe payment schedule includes an initial payment of J$250,000 in July 2024, another J$250,000 by August 30, 2024, and monthly instalments of J$41,666 until the full amount is settled."}, {"id": "e47d82d6-782b-403a-96bd-caf4594c62eb", "title": "Lord Of The Rings : The Rings Of Power Creator Says Glorfindel Could Show Up", "date": "2024-08-06 02:45", "url": "https://www.slashfilm.com/1636846/lord-of-the-rings-forgotten-character-the-rings-of-power-glorfindel/", "domain": "slashfilm.com", "domain_classification": "Unknown", "message": "\"The Rings of Power\" has had a busy lead-up to the premiere of its second season.\n\"Do you think that maybe in 'The Rings of Power,' there's an opportunity for Glorfindel to exist beyond the pages of Tolkien?\"\nThat last comment is in reference to the fact that the showrunners have already mapped out a five-season story arc for \"The Rings of Power.\"\nThat also means there's no guarantee that Glorfindel will show up this season — and that's okay.\nStill, just the fact that Glorfindel is remotely in the mix is exciting for diehard fans of Tolkien's \"The Lord of the Rings\" trilogy."}, {"id": "1dfbe4d5-4b2e-45c2-8b9b-d78a77a30150", "title": "New Zealand faces triple - dip recession , Westpac predicts", "date": "2024-08-06 02:30", "url": "https://www.businesstimes.com.sg/international/new-zealand-faces-triple-dip-recession-westpac-predicts", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "NEW Zealand faces a triple-dip recession as high interest rates curb spending and investment, according to Westpac Banking.\nThat would be the third instance of two consecutive quarterly contractions since the end of 2022.\nNew Zealand’s economy has stalled after the Reserve Bank of New Zealand (RBNZ) rapidly raised interest rates to combat inflation.\nWestpac yesterday brought forward its forecast for the start of monetary easing to October from November, predicting the Official Cash Rate (OCR) will fall from 5.5 per cent currently to 5 per cent by the end of 2024.\n“We now find ourselves with a noticeably weaker economy and labour market that looks much more likely to push inflation back towards 2 per cent given time,” said Kelly Eckhold, chief New Zealand economist at Westpac in Auckland."}, {"id": "32d1f0e0-a8b2-4f26-a25c-015d4a567a38", "title": "UPDATED : Missing 28 - year - old man located", "date": "2024-08-06 04:30", "url": "https://www.guampdn.com/news/updated-missing-28-year-old-man-located/article_198e2a68-5304-11ef-9364-e7d940527a6f.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Guam Fire Department spokesman Lt. Nick Garrido said a 28-year-old missing man was located at 9:54 a.m. Tuesday.\nHe said two volunteers and two GFD rescue personnel were able to locate the missing surveyor.\nThe search for the missing man resumed at 7 a.m. Tuesday after it was temporarily suspended at midnight.\nThe temporary suspension took into account the \"terrain, visibility and the safety of personnel and volunteers,\" Garrido said.\nGFD search and rescue units were activated and searched the area, Garrido said at about 6:20 p.m.\"We have utilized our GFD drones and have requested assistance from HSC25."}, {"id": "360c7055-e424-4b00-a90c-70e23cc5b127", "title": "Cole Sands thriving for Twins bullpen in second season as full - time reliever", "date": "2024-08-06 03:15", "url": "https://www.startribune.com/cole-sands-minnesota-twins-bullpen-pitching/600824416", "domain": "startribune.com", "domain_classification": "Unknown", "message": "“I wouldn’t say there was really too much debate over what we were going to do,” Baldelli said.\n“We’re not going to rearrange everything we have going on right now because of a series that we have coming up.\nI don’t think that’s the right thing to do.\nThis is not the last week of the season.\nWe have a long way to go, and a ton of games to play against good teams coming up.”"}, {"id": "903bede3-a0bc-41ae-8293-06bf03edc96f", "title": "Hiroshima Day 2024 : A Solemn Remembrance of the World First Atomic Bomb", "date": "2024-08-06 02:15", "url": "https://www.news18.com/lifestyle/hiroshima-day-2024-a-solemn-remembrance-of-the-worlds-first-atomic-bomb-8988007.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Since then, 79 years have elapsed and the world remembers August 6 Hiroshima Day every year.\nHiroshima Day: HistoryIn Japan, the city of Hiroshima used to be a major hub of industrial and military activities.\nHiroshima Day: SignificanceWhile Japan did manage to recover from the nuclear attacks over some time, the shadow of a nuclear war continues to haunt the country.\nEvery year, Hiroshima Day is marked as a plea for peace to all world powers to avoid repeating such mistakes.\nObserved at the Hiroshima Peace Memorial Park in Japan, this day highlights the effects of nuclear wars and pays tribute to the ones who were killed."}, {"id": "9600dddb-deeb-4aa6-91f6-7d630487a777", "title": "Election 2024 : What to know about potential texting scams targeting Bay Area , California voters", "date": "2024-08-06 03:45", "url": "https://abc7news.com/post/election-2024-voting-scams-ca-bay-area-voter-registration-kamala-harris-donald-trump/15147997/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "What to know about potential texting scams targeting Bay Area, CA votersAs the 2024 election season gets underway, Bay Area counties are sending out a warning about potential scams targeting voters.\nAs the 2024 election season gets underway, Bay Area counties are sending out a warning about potential scams targeting voters.\nAs the 2024 election season gets underway, Bay Area counties are sending out a warning about potential scams targeting voters.\nAs the 2024 election season gets underway, Bay Area counties are sending out a warning about potential scams targeting voters.\nSAN FRANCISCO (KGO) -- If you're gearing up to make sure your vote counts this November, be aware, potential scams are surfacing across California."}]