[{"id": "a8e96e73-ec6a-42dd-89bf-346441711fc7", "title": "Time to show some solidarity : Why Toronto mayor should attend this weekend Walk with Israel", "date": "2024-06-07 22:00", "url": "https://www.theglobeandmail.com/canada/toronto/article-time-to-show-some-solidarity-why-torontos-mayor-should-attend-this/", "message": "The mayor, Olivia Chow, should walk alongside them.\nThat sent a terrible message to Toronto Jews, many of whom have deep connections to Israel.\nThe Walk with Israel is an annual event intended to express backing for the Jewish state and celebrate the strength of the Jewish community.\nDoing so would illustrate, more powerfully than any statement or speech, that she understands what Toronto Jews are enduring.\nThat is just what the Walk with Israel is meant to be."}, {"id": "8cb89ce0-1438-4e44-a799-dda50eb3f5b8", "title": "Outrageous Antisemitic Incident at New Jersey High School Shows Lack of Leadership", "date": "2024-06-07 19:30", "url": "https://www.algemeiner.com/2024/06/07/outrageous-antisemitic-incident-at-new-jersey-high-school-shows-lack-of-leadership/", "message": "“Hate has no place in East Brunswick and antisemitism will not be tolerated,” he said in a Facebook post.\n“East Brunswick Public Schools has been a pillar educational organization, thriving on our diversity.\nIn East Brunswick, it means recognizing that what happened in the yearbook was not a mistake — it was deliberate.\nFor the East Brunswick school community in the wake of this controversy, true leadership would involve a thorough investigation, transparency in findings, and concrete actions to prevent such mistakes in the future.\nThe East Brunswick incident is a stark reminder of the need for such leadership today — leadership that does not just offer apologies but takes definitive action to uphold the values of inclusivity, respect, and justice."}, {"id": "b1386294-88f9-4d83-a151-9cb3eb00e61e", "title": "Student groups at Baruch College stage protest against Hillel – The Forward", "date": "2024-06-07 21:00", "url": "https://forward.com/fast-forward/620395/student-groups-at-baruch-college-stage-protest-against-hillel-adding-to-growing-trend/", "message": "The pro-Palestinian protesters at Baruch appeared to be mostly college-age, but it wasn’t clear how many were Baruch students.\nThe protest was organized by pro-Palestinian student groups, including Baruch’s Students for Justice in Palestine and Muslim Student Association.\nIn response to an inquiry ahead of the protest, Baruch condemned it but noted that the protest site, in a campus plaza, was public property.\nThe school did not respond to questions about whether official clubs were allowed to target other student groups.\nOther Pro-Palestinian student groups in New York City have also embraced support for terror groups in recent weeks."}, {"id": "6031f88a-0c39-4d99-9381-93f2d2ca4aeb", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | The Canberra Times", "date": "2024-06-07 03:15", "url": "https://www.canberratimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The right-wing senators came armed with images and stories of antisemitic behaviour and offensive slogans on campus.\nJewish students, some of whom were sitting in the back of the room to observe the hearing, were feeling unsafe and unwelcome in the place where they lived and studied, the politicians said."}, {"id": "72237705-3287-453e-a3fa-7c39b8ed33af", "title": "A night for hope", "date": "2024-06-07 17:00", "url": "https://www.jpost.com/israel-news/article-805380", "message": "‘What a night,” wrote Zvika Klein, Editor-in-Chief of The Jerusalem Post, on Facebook.\nRONIT FARKASH, Director of Strategic Partnerships at IDSF, said that her son is among the soldiers fighting Hamas in Gaza.\nYaron Buskila, who served in the Gaza war, described the chaos he witnessed on Oct. 7, when people were calling him for help.\n“Have no doubt – the Jewish people are under attack.”Lion described the difficult war that Israel is waging against its enemies.\nThe reception ended with the singing of “Hatikvah.”This article was written in cooperation with the Israel Defense and Security Forum."}, {"id": "d8e76345-0db0-4de6-b821-16475d677ff1", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | Braidwood Times", "date": "2024-06-07 05:30", "url": "https://www.braidwoodtimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The right-wing senators came armed with images and stories of antisemitic behaviour and offensive slogans on campus.\nJewish students, some of whom were sitting in the back of the room to observe the hearing, were feeling unsafe and unwelcome in the place where they lived and studied, the politicians said."}, {"id": "6b115382-fbeb-47e9-b751-190686ca5688", "title": "Genesis Prize Marks Tenth Anniversary by Honoring Barbra Streisand", "date": "2024-06-07 07:30", "url": "https://www.prnewswire.com/news-releases/genesis-prize-marks-tenth-anniversary-by-honoring-barbra-streisand-302166892.html", "message": "10th Anniversary Genesis Prize Laureate Barbra Streisand receives a glass sculpture of a shofar from Genesis Prize Foundation co-founder Stan Polovets.\n(Photo by Kevin Mazur/Getty Images for Genesis Prize Foundation)The Genesis Prize was established in 2014 when New York City Mayor, businessman and philanthropist Michael R. Bloomberg was announced as its inaugural laureate.\nBarbra Streisand stated: \"I am delighted to be honored by the special 10th Anniversary Genesis Prize and to work with The Genesis Prize Foundation to support organizations that acknowledge our shared humanity and seek to better our society.\nShe founded the Barbra Streisand Women's Heart Center at Cedars-Sinai to support research and raise awareness about women's heart disease.\nAbout The Genesis Prize FoundationThe Genesis Prize is a global award that celebrates Jewish achievement and contribution to humanity."}, {"id": "f02ecd13-0ea4-4f44-a304-34702e257d3e", "title": "Miriam Adelson  wants West Bank annexation  in return for $100M donation to Trump – NaturalNews . com", "date": "2024-06-07 10:30", "url": "https://www.naturalnews.com/2024-06-06-miriam-adelson-wants-west-bank-annexation.html", "message": "Miriam Adelson ‘wants West Bank annexation’ in return for $100M donation to TrumpMiriam Adelson, the wife of the late Israel First GOP megadonor Sheldon Adelson , is reportedly donating at least $100 million to Donald Trump and wants his support for Israel annexing the West Bank in return.\nHer Condition: West Bank Annexation\" (Archive):After five months during which he refused to make clear his position on the Israel-Hamas war, instead sniping at Prime Minister Benjamin Netanyahu, thanks to [pressure from Miriam] Adelson [withhold donations], Trump finally expressed unequivocal support for Israel.\nHowever, according to [New York Magazine's Elizabeth Weil's recent article on Miriam Adelson], Trump made a tactical error that distanced him from the money he so desperately wants.\nAdelson, a resident of Herzliya and a megadonor for settlement development in the West Bank, did not wish to hear Trump yearning for peace.\nJust as Miriam Adelson announced her $100+ million campaign spend on Trump https://t.co/ht3NqBuiYB — Michael Tracey (@mtracey) June 5, 2024?"}]