[{"id": "4bd823e9-b5b8-4d9e-bbab-5a813ec8bf5b", "title": "Hawaii could be threatened by tropical cyclone in Pacific Ocean", "date": "2024-08-21 00:45", "url": "http://www.sfchronicle.com/weather/article/hawaii-could-be-threatened-by-tropical-storm-19667371.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "Weather satellite imagery captured a disorganized area of showers and thunderstorms in the Pacific Ocean on Tuesday afternoon, the beginnings of a likely tropical storm that may impact Hawaii this weekend.\nThere is a much lower probability of reaching Category 1 hurricane strength, with sustained winds of at least 74 mph.\nAdvertisement Article continues below this adThe storm’s name will depend on exactly where in the Pacific it reaches tropical storm strength.\nThe National Hurricane Center previously predicted 1-4 named storms in the central Pacific this year, down from the usual 4-5.\nThe most recent tropical storm to make landfall on the Big Island was Tropical Storm Darby in 2016."}, {"id": "fb6a4b71-e89f-407a-8d7d-8ea8e44e37d5", "title": "One year since Hilary : Here what happened when the storm hit", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/one-since-hilary-happened-storm-232100686.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One year since Hilary: Here’s what happened when the storm hitOne year since Hilary: Here’s what happened when the storm hitSAN DIEGO (FOX 5/KUSI) — Tuesday marks one year since remnants of Tropical Storm Hilary unleashed historic torrential downpours on Southern California.\nFor the first time ever for California, the National Hurricane Center issued a tropical storm watch, and later a tropical storm warning.\nPHOTOS: Tropical Storm Hilary moves through San DiegoNonetheless, it dropped significant rain on Southern California, notably in desert and mountain areas.\nMeanwhile, peak wind gusts in San Diego County reached speeds of around 70 miles per hour to 84 miles per hour, according to NWS.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "3172efc5-5b44-49e6-856a-59ef080d1643", "title": "Disaster declaration approved for Vermont for July flooding from remnants of Beryl - LocalNews8 . com", "date": "2024-08-21 04:00", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/20/disaster-declaration-approved-for-vermont-for-july-flooding-from-remnants-of-beryl/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "MONTPELIER, Vt. (AP) — President Biden has approved a major disaster declaration for Vermont that makes federal funding available to help people and communities affected by flooding from July 9 through July 11 caused by the remnants of Hurricane Beryl.\nThe storm dumped more than 6 inches of rain in just a few hours on parts of Vermont.\nVermont’s governor has made a separate disaster declaration request for flooding from storms on July 30.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "6dff8fc2-1dad-483d-91d9-64e6fb266288", "title": "Debby by the Numbers : Floods , Rain , Tornadoes And More", "date": "2024-08-21 03:15", "url": "https://www.wuft.org/weather/2024-08-20/debby-by-the-numbers-floods-rain-tornadoes-and-more", "domain": "wuft.org", "domain_classification": "Unknown", "message": "It's been more than 2 weeks since Debby smashed into Florida's Big Bend and triggered a life threatening storm surge, widespread flash floods, massive power outages and spawned multiple tornadoes.\nTropical Storm Debby pushed into southern Georgia on Monday after making landfall on Florida’s Big Bend coast and killing at least one person.\nDebby is expected to move offshore into the Atlantic Ocean, with winds pushing surf back toward the shoreline.\npic.twitter.com/3FHPT0YLJG — Jonathan Erdman (@wxjerdman) August 5, 2024Debby was the second hurricane of the 2024 Atlantic hurricane season, following the deadly and devastating Hurricane Beryl.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico - the 4th named storm of the 2024 Atlantic #hurricane season."}, {"id": "7c40a524-98ab-4c9a-95b4-a3a4995b03ac", "title": "Could Hawaii be impacted by developing tropical cyclones in the Pacific ? ", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/could-hawaii-impacted-developing-tropical-214048998.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Could Hawaii be impacted by developing tropical cyclones in the Pacific?\nDirect strikes on the archipelago are rare, but periods of increased waves and wind are more common with passing tropical cyclones.\nIn nearly all cases, these features act as barriers to tropical cyclones approaching the islands, rapidly leading to their weakening or dissipation.\nNOAA’s Central Pacific Hurricane Center, in coordination with the agency’s Climate Prediction Center, expects between one and four tropical cyclones to traverse the ocean, which is below the typical four to five tropical depressions, tropical storms and hurricanes.\nOriginal article source: Could Hawaii be impacted by developing tropical cyclones in the Pacific?"}, {"id": "67c0378a-c57b-4779-af9f-bfe3c9d50297", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/western-alaska-yupik-village-floods-234629059.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "20e32a21-445e-4846-b979-3bec3ece8328", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:30", "url": "https://www.kob.com/news/us-and-world-news/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms/", "domain": "kob.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "d0dc9da8-078a-4c7a-b967-1a1bd6ba4b15", "title": "Western Alaska Yupik village floods as river rises from a series of storms – Winnipeg Free Press", "date": "2024-08-21 00:15", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024.\n(Job Hale via AP)It caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river."}, {"id": "cea75411-c27e-4210-b092-d9428eeafdc4", "title": "Valley fever cases rise to record high in California in 2023 : CDPH", "date": "2024-08-21 02:00", "url": "http://www.sfchronicle.com/health/article/valley-fever-cases-rise-record-high-california-19667254.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "California is on track to surpass last year’s record-high cases of valley fever, a potentially debilitating infection caused by inhaling fungal spores in dirt or dust.\nBrontë Wittpenn/The ChronicleCalifornia in 2023 reported a record-high number of valley fever cases — a potentially debilitating infection caused by inhaling fungal spores in dirt or dust — and 2024 is on track to surpass that, state health officials said Tuesday.\nIn 2023, nearly 9,300 cases of valley fever were reported statewide, about triple the number from a decade ago, according to state data.\n“These were the highest first and second quarter for valley fever that we’ve ever had in the state of California,” Cooksey said.\nBut California health officials have noted surges in valley fever roughly two years after major droughts — followed by a wet winter — since the early 2000s."}, {"id": "4ad6f53b-15f8-47be-92a8-48db4e1353af", "title": "Experts warn 2024 could be hottest year on record", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/experts-warn-2024-could-hottest-212720636.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Experts warn 2024 could be hottest year on recordWASHINGTON (NEXSTAR) — Climate scientists warn this year is likely to be the hottest on record, according to a briefing by the National Oceanic and Atmospheric Administration.\nLast year, 2023, was the hottest year on record.\nThose include Hurricane Beryl, the earliest Category 5 hurricane on record, hailstorms in Colorado and wildfires in New Mexico.\n“We have instruments on the space station that are measuring what is happening to the Earth,” Nelson said.\nNOAA estimates, because of near record sea temperatures and the La Nina, the Atlantic could see eight to 13 hurricanes this year."}, {"id": "a5c5ac10-56a7-4c0f-804f-cf0f7cfbfde3", "title": "Q & A : How advanced geocoding and PUIDS are revolutionizing peril risk assessment in insurance", "date": "2024-08-21 00:45", "url": "https://www.digitaljournal.com/business/qa-how-advanced-geocoding-and-puids-are-revolutionizing-peril-risk-assessment-in-insurance/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Charlton outlines the role that geocoding and PUIDs play in revolutionizing peril risk assessment for insurers.\nDigital Journal: How is rooftop geocoding essential for insurance companies to accurately price risk in areas prone to significant perils like hurricanes and wildfires?\nUnderwriters will be able to quickly and accurately price policies to risk data already linked to a PUID, eliminating operational overhead and increasing accuracy.\nWhat other tools are available to insurance carriers to improve risk assessment?\nFuture innovations in address technology and geocoding could significantly transform risk assessment in the insurance industry."}, {"id": "4babaf15-7021-4017-8767-6b549a156aeb", "title": "Oxford schools address potential delays due to flooding", "date": "2024-08-21 02:30", "url": "https://www.wfsb.com/2024/08/20/oxford-schools-address-potential-delays-due-flooding/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "OXFORD, CT (WFSB) - As the new school year approaches, parents and students in Oxford are concerned about potential delays due to damage from Sunday’s storm.\nThe storm caused significant flooding, leaving many families, like AJ Powell’s, facing severe losses.\nThe storm caused significant flooding, leaving many families, like AJ Powell’s, facing severe losses.\nThe situation is further complicated by inaccessible long driveways, which are common in Oxford and essential for school bus routes.\nOxford has a lot of long driveways as well that are somewhat mini roads and those driveways are compromised,” said Oxford’s superintendent Dr. Robert Miller."}, {"id": "81236cd7-8493-4ec0-af6a-210e3503ea25", "title": "Storm system tracking north , could bring heavy rain Saturday", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/storm-system-tracking-north-could-013503726.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "They are expected to merge Tuesday night and when they do a tropical depression or tropical storm will form the next day.\nThe storm is expected to strengthen as it moves into the central Pacific.\nThere is a possibility for strong winds and heavy rain when the storm approaches the islands during the weekend.\nHurricane hunters in NOAAʻs Gulfstream could be deployed Thursday, with the Air Force C-130s possibly flying through the system on Friday.\nThe storm has the potential to be named Hector if it develops into a tropical storm and east of 140W, and it would be named Hone if it forms west of 140W."}, {"id": "08f9c000-1b6b-4b21-821e-00b9e86ac5b8", "title": "Conway residents still dealing with river flooding after Debby", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/conway-residents-still-dealing-river-221926742.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CONWAY, S.C. (WBTW) — Waccamaw River flooding caused by Tropical Storm Debby forced many Conway residents to move their cars, call out of work, temporarily move or a combination of all three.\nThe entrances to Pitch Landing Road and Lees Landing Circle are currently blocked off by police cars.\nSome families trying to get to Conway’s Riverfront Park had to turn around after realizing how bad the flooding was.\nAlthough the river level is slowly falling, it’s still at major flood stage and will remain that way until about Friday.\nThe Stonebraker family is from Aynor and came to check out the flooding for themselves."}, {"id": "e5b71f7c-c97e-492d-88b2-a2cbdb63fe79", "title": "Railroads hunker down as Hurricane Rita nears Texas , Louisiana ( 9 / 23 / 2005 ) - RailPrime | ProgressiveRailroading", "date": "2024-08-21 04:15", "url": "https://www.progressiverailroading.com/railPrime/details/Railroads-hunker-down-as-Hurricane-Rita-nears-Texas-Louisiana-9232005--67572", "domain": "progressiverailroading.com", "domain_classification": "Unknown", "message": "With Hurricane Rita bearing down on parts of Texas and Louisiana, ready to come ashore early tomorrow, freight and passenger railroads have been scrambling the past two days to batten down the hatches and prepare for the storm’s wrath.\nHowever, the railroad relocated all freight cars from Galveston Island, and moved inland other locomotives and cars threatened by potential flooding.\nComprising two TRE locomotives and six passenger cars, the train will be operated by a TRE crew provided by Herzog Transit Services Inc.\nKansas City Southern also is repositioning locomotives and cars away from points in Houston, Beaumont, Corpus Christi and Port Arthur, Texas.\nKCS also has embargoed traffic to Beaumont, Port Arthur, Port Neches and Chaison, Texas."}, {"id": "752d1210-7c48-477e-867e-01244a121ac5", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:00", "url": "https://www.yahoo.com/news/tropical-depression-dumps-heavy-rain-012746455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Seaweed is washed up on Gwangalli Beach in the aftermath of Tropical Storm Jongdari in Busan, South Korea, Wednesday, Aug, 21, 2024.\n(Gang Son-bae/Yonhap via AP)SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nAbout 20 vehicles were damaged by floods in the southern town of Ulju, the nearby city of Ulsan and the central city of Seosan, according to South Korea’s Ministry of the Interior and Safety."}, {"id": "5c6f52ea-39e2-4756-8298-243ceae65c31", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://abcnews.go.com/International/wireStory/tropical-depression-dumps-heavy-rain-southern-south-korea-113003758", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A tropical depression is dumping heavy rain in southern South Korea and the populous Seoul region after weakening from a tropical stormSEOUL, South Korea -- A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain as of Wednesday morning.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nGovernment officials had urged public vigilance and monitoring of areas like underground passageways and basement dwellings that are at high risk of flooding."}, {"id": "7a5ff540-dc18-4925-b658-6a49b96d5855", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://www.independent.co.uk/news/seoul-ap-south-korea-jeju-b2599284.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Sign up to the Independent Climate email for the latest advice on saving the planet Get our free Climate email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent.\nRead our privacy policy Thanks for signing up to theIndependent Climate email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region on Wednesday after weakening from a tropical storm.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday and South Korea’s weather agency said the system was expected to dissipate soon.\nThe Korean Peninsula, which includes South Korea, is often impacted by typhoons, especially between July and September when the heat is at its peak."}, {"id": "193f08fa-3607-4fe0-a660-3468e15e7701", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area – Winnipeg Free Press", "date": "2024-08-21 02:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/tropical-depression-dumps-heavy-rain-in-southern-south-korea-and-seoul-area", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nFishing boats are anchored at a port as Typhoon Jongdari approaches Jeju Island, South Korea, Tuesday, Aug. 20, 2024.\nAbout 20 vehicles were damaged by floods in the southern town of Ulju, the nearby city of Ulsan and the central city of Seosan, according to South Korea’s Ministry of the Interior and Safety."}, {"id": "e259abf7-b75d-4087-bf51-99b2fc58c0e3", "title": "HECO prepares for potential stormy weather", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/heco-prepares-potential-stormy-weather-014551335.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HONOLULU (KHON2) — Hawai’i may face severe weather this weekend, prompting Hawaiian Electric (HECO) to brace for potential impacts on its services.\nDownload the free KHON2 app for iOS or Android to stay informed on the latest newsHECO warns that strong winds and flooding could damage power lines and cause outages.\nHECO advises customers to review their emergency plans, stock up on necessary supplies, and monitor storm’s progress closely.\nIf you plan to use a ladder while preparing your home for the storm, note the location of power lines before you begin.\nFor the latest news, weather, sports, and streaming video, head to KHON2."}, {"id": "c865c7ff-6b6f-45ac-a8e3-9297eb00d58b", "title": "12 Home Insurance Exclusions You Need to Know About", "date": "2024-08-21 00:30", "url": "https://www.insidermonkey.com/blog/12-home-insurance-exclusions-you-need-to-know-about-1337467/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We will also cover the 12 major home insurance exclusions you need to know about.\nSupported by the primary house insurance market in the United States, North America is expected to hold the largest chunk of the global home insurance market over this period.\nWhile the state’s insurance market remains troubled, the firm is seeking home insurance rate rises.\nSimilar to State Farm, Farmers Insurance decided to limit new homeowners insurance policies in California.\nNow that we have looked at the global home insurance industry, let’s take a look at the home insurance exclusions you need to know about."}, {"id": "91c379f9-839d-4e07-82e1-88b899979f9c", "title": "Long Island storm damage : Mill Pond , Blydenburgh Park and more", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/suffolk/long-island-storm-damage-bxsnqwvs", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Harbor Road, Stony BrookHeavy rainfall took out a dam under Harbor Road in Stony Brook and emptied Mill Pond.\nStony Brook Grist Mill, Stony BrookThe Stony Brook Grist Mill, which is located on Harbor Road near Mill Pond, sustained flooding from the storm.\nStony Brook University, Stony BrookStony Brook University dealt with flooding at the Mendelsohn Center Monday.\nCredit: Newsday/James CarboneStony Brook University evacuated scores of students from dorms and postponed the move-in day for others Monday morning following the storm.\nUniversity officials also were offering students up to $5,000 if they canceled their housing assignment for the academic year."}, {"id": "c930664e-dcd2-44ca-85ae-cf63c2543dc9", "title": "Is Houston still the  Energy Capital of the World ? Doesnt seem like it", "date": "2024-08-21 00:30", "url": "https://www.click2houston.com/news/local/2024/08/20/is-houston-still-the-energy-capital-of-the-world-doesnt-seem-like-it/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "How is it that a city known as the “Energy Capital of the World” struggles to keep the lights on?\nTexas launches new investigation into Houston’s power utility following deadly outages after BerylWith all of these issues in mind, one might wonder: what exactly makes Houston the “Energy Capital of the World”?\nAbundance of Energy Companies: Houston is home to more than 600 exploration and production firms, as well as 1,100 oilfield service companies.\nConcentration of Expertise: The city has a high density of energy professionals, including petroleum, automation, and electrical engineers.\nEnergy Diversity: While historically known for oil and gas, Houston has also become a leader in renewable energy, including wind and solar power."}, {"id": "7a3623b8-bf27-4185-921e-01290bc6dfc6", "title": "Sunday massive rainfall may have been most in Connecticut history : NWS", "date": "2024-08-21 02:45", "url": "https://www.nbcnewyork.com/news/national-international/sundays-massive-rainfall-may-have-been-most-in-connecticut-history-nws/5722907/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The National Weather Service is looking at the possibility that Sunday's historic rain event set a record for the most rainfall ever in Connecticut over a 24-hour period.\nA State Climate Extremes Committee, including representatives from the National Weather Service in New York and National Weather Service climate experts will be reviewing two 24-hour rainfall measurements from Sunday.\nThe two totals were reported by private home weather stations in Oxford.\nOne measured 14.83\" of rain and the other measured 13.5\", according to the National Weather Service.\nThe NWS experts will examine the home weather stations at both locations to determine if they are in compliance with National Weather Service measurement guidelines and specifications."}, {"id": "5961a5b1-7648-40e9-9d31-7b58eabd8506", "title": "7 Vermont counties receive FEMA major disaster declaration for early July storm", "date": "2024-08-21 00:15", "url": "https://vtdigger.org/2024/08/20/7-vermont-counties-receive-fema-major-disaster-declaration-for-early-july-storm/", "domain": "vtdigger.org", "domain_classification": "Unknown", "message": "Phil Scott’s request for a major disaster declaration from the Federal Emergency Management Agency for seven Vermont counties, according to a Tuesday press release from the governor’s office.\nThe disaster declaration does not apply to damage caused by storms on July 30, according to the press release.\nState officials have requested that Orange County be added to the declaration, according to the press release.\nOrange County was examined alongside the other seven counties when FEMA officials visited Vermont last month.\nThe Scott administration continues to work on a separate FEMA major disaster declaration request for damages related to the July 30 storm, the release said."}, {"id": "0fca6ea3-449d-4c61-944f-1e55d1abcc8e", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 00:15", "url": "https://mix931fm.com/on-august-20-this-texas-city-was-erased-by-a-massive-hurricane/", "domain": "mix931fm.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "c5bc9901-c7a0-410c-a86f-53b8dde9d8d3", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 03:30", "url": "https://q1077.com/ixp/151/p/hurricane-destroys-indianola-texas/", "domain": "q1077.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "bc16321d-45b7-416a-b1e7-e608d4817bec", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.clickondetroit.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "394a454d-a058-4610-992a-41023ee97924", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.local10.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "a27395ad-8069-4c13-82d1-7c25e1f3f2f0", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:00", "url": "https://www.news4jax.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "c6ce85fe-23ea-48d2-b198-90ea3a1c5382", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:00", "url": "https://www.clickorlando.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "57cf444c-99a7-4397-ab41-2cc675b35c7a", "title": "Flooding closes two residence halls at Stony Brook University , forcing a housing reshuffle", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/education/flooding-closes-stony-brook-university-dorms-gsep0fyi", "domain": "newsday.com", "domain_classification": "Unknown", "message": "All students from two residence halls at Stony Brook University will be relocated after their dorms were badly damaged in a flash flood early Monday that took Suffolk County by surprise and caused millions of dollars in destruction across the region.\nAmmann and Gray residence halls \"will need extensive repairs and cannot be safely occupied,\" the university said on its website.\nBut the same residence halls flooded in September 2021 during the remnants of Hurricane Ida, displacing nearly 400 students.\nThe university also is offering a $5,000 incentive for any students who will cancel their housing for the 2024-25 academic year.\nStony Brook has 33 residence halls with nearly 9,000 undergraduates living on campus."}, {"id": "b3cbbea6-b927-4689-bdd6-bb85fd45fc1e", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/as-south-korea-weather/cp817316219", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Tropical depression dumps heavy rain in southern South Korea and Seoul areaSeaweed is washed up on Gwangalli Beach in the aftermath of Tropical Storm Jongdari in Busan, South Korea, Wednesday, Aug, 21, 2024.\n(Gang Son-bae/Yonhap via AP)Original Publication Date August 20, 2024 - 6:31 PMSEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain as of Wednesday morning.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken."}, {"id": "5a64768b-ef5c-4077-a541-31fbf4cdadd9", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 02:30", "url": "https://www.theglobeandmail.com/canada/british-columbia/article-bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: British Columbia's wildfire service says southern parts of the province are benefitting from rain and cooler weather, a reprieve for the southeast in particular.\nThe BC Wildfire Service says two of those fires are classified as “being held,” meaning they’re expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey’re among about 110 out-of-control blazes representing 30 per cent of the province’s roughly 370 active wildfires.\nThe territory’s wildfire information website says the Snag Lake fire was “quiet” Monday after displaying “extreme” behaviour the day before."}, {"id": "eae7d7a8-90e1-4422-96a5-c1da4168d192", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.independent.co.uk/news/puerto-rico-ap-san-juan-national-weather-service-rio-grande-b2599131.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "2d292208-100d-4595-89a8-616ebd45667d", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/world/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "40486a7f-afff-4006-ab26-8e8037285218", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "5033f56c-cd8f-471b-a547-ab5ca515fa15", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 01:45", "url": "https://www.timescolonist.com/bc-news/bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of-control-9376725", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "9f0eac09-0671-4388-81dd-7d7aed743cac", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 03:00", "url": "https://www.wbal.com/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm .\nThe northeast coastal town of Luquillo, popular with tourists, reported the highest number of outages, with 30% of clients without power.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico’s grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "1a804d5d-e485-4bc4-81b6-16e5d633d513", "title": "British billionaire among missing people after storm in Italy sinks superyacht", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/british-billionaire-among-missing-people-005930240.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "| Italian Coast GuardBritish billionaire Mike Lynch is among the six missing passengers of the Bayesian, Lynch’s 184-foot superyacht, which sank off the coast of Sicily, Italy on Monday, according to multiple media reports.\nLynch has been known in UK media as the “British Bill Gates” for his influence in the technology world, as well as for his wealth.\nThe ship sank during a violent storm after a gust of wind that nearby ship captain Karsten Borner described as a “strong hurricane gust,” according to CNBC.\nHe added that he had been careful not to let his boat contact the yacht during the storm, but after the gust of wind concluded, the yacht was gone.\nLynch’s wife, Angela Bacares, is among the survivors, but Lynch’s 18-year-old daughter, Hannah, is among those missing."}, {"id": "6196099c-7ec8-47fa-a2f1-0ecc075521f0", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/wildfires-bc/cp1969590317", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "wildfires holding under 370 with 30 per cent classified as 'out of control'Smoke from the Calcite Creek wildfire is shown in this July 26 handout photo.\nThe BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "c1e029b4-68da-4cdd-9321-dddf5d73dc65", "title": "President Biden approves Vermont major disaster declaration request", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/president-biden-approves-vermont-major-220549152.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Montpelier VT. – President Joe Biden approved Governor Phil Scott’s request for a FEMA major disaster declaration, which will assist Vermonters recovering from flooding that happened from July 9 to 11, 2024.\nThis FEMA declaration provides funding to individuals in Addison, Orleans, Washington, Caledonia, Chittenden, Lamoille, and Essex counties.\nThe Individual Assistance program can cover eligible expenses like rental assistance, home repair, home replacement, lodging, and more.\nIndividuals and municipalities that suffered damage in all recent storms should continue to clean up and document damage.\nThe State will continue to provide updates, including the availability of Disaster Recovery Centers for more support."}, {"id": "5d2cc0af-f96e-4faa-975e-b46adeffa634", "title": "Natural disasters and insurance : Some homes becoming uninsurable , but all may not be lost - Christopher Whitehead", "date": "2024-08-21 03:30", "url": "https://www.nzherald.co.nz/nz/natural-disasters-and-insurance-some-homes-becoming-uninsurable-but-all-may-not-be-lost-christopher-whitehead/3R7IDJZ3KJDCJAUAQC5AU3SGTQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Cautious insurersThere’s no general requirement in New Zealand that insurers cover anyone’s home, or that anyone’s home actually be insured.\nWhen homeowners do get insurance, the risk of certain losses from natural disasters is automatically covered by the Natural Hazards Commission (previously known as the Earthquake Commission).\nThe insurer may even offer “parametric” insurance, which pays out less than traditional insurance, but faster.\nWhile parametric insurance is relatively new worldwide, it’s an efficient solution for managing the risk of natural disaster damage.\nNatural disaster wouldn’t have to mean financial disaster as much as it does today."}, {"id": "073283e3-affb-412a-a948-10530b00f01f", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 01:30", "url": "https://www.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "3ed5aca7-4dcb-42f3-92f2-4aaca9c6075c", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 03:00", "url": "https://us.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "b17dafc2-0e1d-42e5-a6d3-dec36b0c97c9", "title": "Naugatuck businesses begin cleanup process in wake of historic storm", "date": "2024-08-21 01:00", "url": "https://www.nbcconnecticut.com/news/local/naugatuck-businesses-cleanup-historic-storm/3367386/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "“I had to stand out in the middle of the road and just watch this all get flooded,” Water Street Pub and Barber Shop owner Anthony Mongillo said.\n“The next morning I came in and I was just speechless.”Mongillo, of Naugatuck, had recently celebrated one year since opening Water Street Pub and Water Street Barber Shop right next door.\nHe said momentum was building for both businesses, only to have a storm tear everything apart this past weekend.\nI put my blood, sweat and tears into both these places the past year, nonstop work,” Mongillo said.\nNumerous businesses in Naugatuck and the surrounding area continue to recoil after the damages brought on from Sunday's storm."}, {"id": "7d2ea7c5-62a1-4ecd-b352-7df2ab6c4fa6", "title": "Kaktovik and Wales precincts fail to open for Alaska primary , Division of Elections says", "date": "2024-08-21 04:00", "url": "https://www.adn.com/politics/2024/08/20/kaktovik-and-wales-precincts-fail-to-open-for-alaska-primary-division-of-elections-says/", "domain": "adn.com", "domain_classification": "Unknown", "message": "The Alaska Division of Elections said that two precincts in rural Alaska failed to open for in-person voting on primary election day.\nCarol Beecher, director of the Division of Elections, said polling places in Wales and Kaktovik were unable to open on Tuesday.\nForty-three Kaktovik residents voted in the 2022 Alaska primary, along with 280 residents of Anaktuvuk Pass and 10 people from Wales.\nADVERTISEMENTAccording to Beecher, 399 of 402 Alaska precincts were open and operating by Tuesday afternoon for the primary election.\nIn 2022, precincts in Tununak and Atmautluak did not open on election day for that year’s primary and special congressional election."}, {"id": "388c2676-353b-447e-a2f8-07d1b05b8a18", "title": "Tricky time for farmers - survey", "date": "2024-08-21 01:00", "url": "https://www.odt.co.nz/rural-life/red-meat/tricky-time-farmers-survey", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "Beef + Lamb New Zealand has released its annual stock number survey which showed a notable decline in both sheep and cattle numbers as of June 30.\nSheep numbers were estimated to have decreased by 4.3%, down to 23.31 million, with breeding ewe numbers falling by 2.9% and trading sheep stock numbers down 7.9%.\nBeef cattle numbers dropped 6.6% in Otago and increased 5.1% in Southland.\nThe number of beef cattle might recover more quickly as prices have remained strong for beef and farmers have been switching from sheep to cattle.\nWhile sheep numbers had been declining slowly, afforestation had accelerated that sharply and also driven down cattle numbers."}, {"id": "d8b28081-3e10-498c-986e-c84d33b347f9", "title": "A tornado sank a luxury sailing boat off the coast of Sicily . Here what we know", "date": "2024-08-21 01:30", "url": "https://krdo.com/news/2024/08/20/a-tornado-sank-a-luxury-sailing-boat-off-the-coast-of-sicily-heres-what-we-know/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "A small waterspout – a type of tornado – spun over the Mediterranean island early Monday, likely capsizing the sailing boat amid lashings of rain and strong thunderstorms.\nThe British-flagged yacht, called the “Bayesian,” was anchored about a half a mile from the port of Porticello, on Sicily’s northern coast.\nThe vessel sank after its mast broke in half in the storm, Salvatore Cocina, head of Sicily’s Civil Protection, told CNN on Tuesday.\nBacares told Italian daily newspaper La Repubblica that she woke up at 4 a.m. local time, as the boat tilted.\nBloomer, the finance tycoon, and Morvillo, a prominent lawyer – and both their wives – are also among the missing, according to Salvatore Cocina, head of Sicily’s Civil Protection."}, {"id": "d8fbfa11-14b9-4fb1-8b2c-ce4526d9c45e", "title": "Modular Homes For Fire Survivors | News Radio 1190 KEX", "date": "2024-08-21 01:45", "url": "https://1190kex.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "5463677f-7248-41dd-af5d-312571538b13", "title": "Modular Homes For Fire Survivors | K103 Portland", "date": "2024-08-21 02:30", "url": "https://k103.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "k103.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "379aceea-c370-40d8-bb77-cdc317526a3c", "title": "Modular Homes For Fire Survivors", "date": "2024-08-21 03:30", "url": "https://jamn1075.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "jamn1075.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "bbe77540-2b5f-443e-86cb-f58aa914d29b", "title": "Modular Homes For Fire Survivors | Z100 Portland", "date": "2024-08-21 02:45", "url": "https://z100portland.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "z100portland.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "fc512d0f-4aff-45c0-bd72-93e980740c2f", "title": "Modular Homes For Fire Survivors | 106 . 7 The Eagle", "date": "2024-08-21 03:00", "url": "https://1067theeagle.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1067theeagle.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "1f6bba32-53f3-42b9-bab6-b8026a0449cc", "title": "Modular Homes For Fire Survivors | 105 . 9 The Brew", "date": "2024-08-21 03:30", "url": "https://1059thebrew.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1059thebrew.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}, {"id": "0d245ab9-7ab8-4947-9d9e-36fffc302cb1", "title": "Uttarakhand : Heavy rain triggers landslides and flooding in Uttarakhand | Dehradun News", "date": "2024-08-21 00:30", "url": "https://timesofindia.indiatimes.com/city/dehradun/heavy-rain-triggers-landslides-and-flooding-in-uttarakhand/articleshow/112666439.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Authorities rescued the remaining trekkers but continue searching for the missing woman despite challenges from adverse weather conditions.\nAustria battles major flooding after record downpoursHeavy rains caused significant flooding in Alpine regions of Austria, disrupting transportation and damaging property.\nRain triggers landslides in Tripura: 7 dead, 2 go missingContinuous rain in Tripura led to landslides that caused seven deaths and left two people missing, while over 5,600 residents became homeless.\nDehradun : Uttarakhand experienced intense rainfall on the intervening night of Monday and Tuesday, causing landslides in the hilly regions and flooding in the plain areas.\nThe worst-affected areas in Haldwani include Krishna Vihar, Devi Vihar, Shiwalik Vihar and Gayatri Colony, where water and slush entered over 300 houses."}, {"id": "1a278021-54e6-4c35-9295-5281853ff4a3", "title": "Climate change is already reshaping PNW shorelines . Tribal nations are showing how to adapt", "date": "2024-08-21 04:00", "url": "https://www.adn.com/nation-world/2024/08/20/climate-change-is-already-reshaping-pnw-shorelines-tribal-nations-are-showing-how-to-adapt/", "domain": "adn.com", "domain_classification": "Unknown", "message": "(Ivy Ceballo/The Seattle Times/TNS)SHORES OF THE SALISH SEA, Tulalip, Wash. — Keeley Chiasson plodded through the steep, sandy sediment near the base of the bluff.\nBut coastal tribes in the Pacific Northwest often hit bureaucratic hurdles to access the money, workforce and collaboration needed to adapt, according to a new report by the Northwest Climate Resilience Collaborative.\nSome coastal tribes in the Pacific Northwest have uprooted entire villages to move to higher ground.\nThese issues were among those highlighted in the new report by the Northwest Climate Resilience Collaborative.\nTulalip and other tribal nations across the Pacific Northwest have developed climate solutions rooted in nature."}, {"id": "51f0b638-6930-4dc8-842a-5735cb80177a", "title": "Several Bay Area counties receive CAL FIRE grant for wildfire prevention", "date": "2024-08-21 02:00", "url": "https://abc7news.com/post/several-bay-area-counties-receive-cal-fire-grant-wildfire-prevention/15210472/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Several Bay Area counties receive CAL FIRE grant for wildfire preventionEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nEvery year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients.\nSAN FRANCISCO (KGO) -- Every year, CAL FIRE hands out grants for wildfire prevention projects -- and this year, several Bay Area agencies are recipients."}, {"id": "19bc0586-8415-4865-a03b-c422dba9d87b", "title": "What is known about the sinking of a luxury yacht off the coast of Sicily and those aboard", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/news/nation/yacht-bayesian-lynch-sicily-waterspout-missing-sinking-j38994", "domain": "newsday.com", "domain_classification": "Unknown", "message": "They took them aboard their yacht and alerted the coast guard.\nAmong the missing is 59-year-old tech tycoon Mike Lynch, sometimes described as the British Bill Gates.\nIn this picture released by the Italian Firefighters Tuesday, Aug. 20, 2024, Scuba divers study a map of the sailing yacht Bayesian at the Porticello harbor.\nThe Bayesian was a luxury yacht built in 2008 by the Italian firm Perini Nav.\nAs the search for the missing continues, authorities already have begun trying to piece together exactly what happened."}, {"id": "fdd3682d-50c1-4ce6-8cc1-e31d92109184", "title": "WATCH : Agriculture Ministry hands out supplies to fisherfolk in Parottee , St Elizabeth", "date": "2024-08-21 02:15", "url": "https://www.jamaicaobserver.com/2024/08/20/agriculture-ministry-hands-supplies-fisherfolk-parottee-st-elizabeth/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica — Minister of Agriculture, Fisheries and Mining, Floyd Green on Friday handed out supplies to fisherfolk in Parottee, St Elizabeth as part of the ministry’s Hurricane Beryl Fisheries Recovery Programme.\nParottee is one of the communities that remains without electricity since the passing of Hurricane Beryl on July 3.\nSpeaking at the voucher handover ceremony at the Parottee Seventh-day Adventist Church, Green said, “This is a part of our overarching response programme.\n“The people who have not yet been reached please visit our offices, leave your information, we will do our verification processes and we will try to help.\nWe will build back quickly and we will build back stronger,” Green said."}, {"id": "0760c466-7db3-4757-bfcb-b1d23e532ecb", "title": "Residents left in limbo for 2nd day after flooding impacts  critical infrastructure  at Winnipeg highrise", "date": "2024-08-21 02:45", "url": "https://www.cbc.ca/news/canada/manitoba/flooding-winnipeg-holiday-towers-evacuations-1.7300185", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Water spewing out of the pipe quickly started flooding the 25-storey residential highrise at 170 Hargrave St., part of the Holiday Towers complex.\nShaw said the city registered and assessed 230 residents who were forced out of their homes on Monday.\nDiana Putte was among 230 tenants who were evacuated from the Holiday Towers complex.\n'Raining in the hallway': tenantRamona Hope, who has been living at Holiday Towers for 19 years, was in her fifth-floor unit when the flooding began.\nWRE Development, the management company that oversees Holiday Towers, did not respond to CBC's requests for comment before deadline on Monday and Tuesday."}, {"id": "ce71bb77-ae10-47f1-aa14-da5f624570b1", "title": "Residents evacuate after apartment flood – Winnipeg Free Press", "date": "2024-08-21 04:30", "url": "https://www.winnipegfreepress.com/this-just-in/residents-evacuate-after-apartment-flood", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Flooding has forced the evacuation of tenants living in a downtown apartment building.\nIn a post on its website, WRE Development said the Winnipeg Fire Paramedic Service ordered all tenants of 170 Hargrave St. to vacate their suites after a “significant flooding incident” Monday.\n“We haven’t been given a time frame when tenants can return,” WRE said.\n“We need to assess the damage and have the proper contractors complete the repairs.”WRE said it was working to have the issue fixed “as quickly as possible,” advising tenants to reach out to their insurance companies for assistance."}, {"id": "396ffab8-0be6-47ef-b83e-b4461bfc66e9", "title": "China reels as officials navigate record - breaking weather event :  Deviated from the norm  ", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/china-reels-officials-navigate-record-230000778.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "China has been breaking records in utility-scale solar and wind projects, but it's also been struggling with flooding and intense heat this year.\nThe country's push toward sustainable projects is admirable, but rising global temperatures and severe weather have been hitting hard.\nAs The Guardian reported, rainfall in China was 13.3% higher than average, leading to more significant flooding than in any year since record keeping began in 1998.\nChina has already pledged to peak emissions by 2030 and get down to net zero by 2060, as The Guardian shared.\nTo address rising water levels, we can support efforts to restore wetlands and other natural barriers that help curb rampant flooding."}, {"id": "d35da839-dcbf-4b21-bc0b-94c02fcaefc1", "title": "Multi - million dollar Mexico Beach re - nourishment project has been approved", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/multi-million-dollar-mexico-beach-213856162.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "BAY COUNTY, Fla. (WMBB) – Bay County Commissioners have approved a multi-million dollar beach re-nourishment project for Mexico Beach.\nTuesday morning, Bay County commissioners awarded the beach renourishment contract to Weeks Marine.\nMexico Beach already has about a mile that has been considered or critically eroded by the state.\nMexico Beach renourishment projectMexico Beach Community Development officials said they began addressing the eroding shoreline in 2016, 2-years before Hurricane Michael.\nThe cost per mile of the beach is much more expensive than Panama City Beach’s last renourishment project."}, {"id": "ea895c96-c41a-4a84-a9bc-6d200453c681", "title": "Annual USFWS Duck Survey Counts More Mallards Than Last Year", "date": "2024-08-21 02:00", "url": "https://www.outdoorlife.com/hunting/annual-duck-population-survey/", "domain": "outdoorlife.com", "domain_classification": "Unknown", "message": "Most duck hunters will be happy to hear that breeding ducks increased 5 percent this year compared to 2023, according to the annual duck counts published Tuesday by the U.S.\nWith 34 million breeding ducks accounted for in 2024, this year’s survey marks the first overall increase in breeding ducks that has been documented since 2015.\nThat’s the good news at a glance, and it’s particularly notable given the overall decline in habitat conditions compared to 2023 (more on that in a minute).\nThe study’s authors also included a snapshot of Eastern survey numbers, which reflected a small dip in mallards (about 4 percent compared to 2023).\nAlaska, British Columbia, and other northern survey areas also experienced improved habitat and substantial breeding numbers."}, {"id": "b9ae911d-35e4-4021-98a2-87ece414e235", "title": "How San Diegans can apply to California wildfire home protection program – NBC 7 San Diego", "date": "2024-08-21 03:15", "url": "https://www.nbcsandiego.com/news/local/san-diego-county-will-help-some-residents-protect-their-home-from-wildfires-heres-how-to-apply/3602023/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "A pilot program to help residents protect their homes from wildfires has started in the Dulzura area, according to San Diego County officials.\nThe California Wildfire Mitigation Program identified high-fire risk areas and places with vulnerable populations to provide defensible space and retrofits to harden homes against wildfires, a county statement said.\nDulzura residents can currently apply for the program here and applications will open in the future for residents in Potrero and Campo.\nGet top local stories in San Diego delivered to you every morning.\nIn some cases, the work done could help lower your insurance, according to the county."}, {"id": "78e6ceee-cbe9-45ff-899d-54ac69146e41", "title": "Alvvays Review : A Dream In Blue at the Fox Theater – KALX 90 . 7FM Berkeley", "date": "2024-08-21 02:45", "url": "https://kalx.berkeley.edu/alvvays-review-a-dream-in-blue-at-the-fox-theater/", "domain": "kalx.berkeley.edu", "domain_classification": "Unknown", "message": "You could feel the buzzing excitement in the air while millennial hipsters and indie kids from all around the Bay Area lined up to see dream pop darlings Alvvays (pronounced ‘always’) at downtown Oakland’s legendary Fox Theater.\nTouring off the back of the two year old record Blue Rev, released to critical acclaim, that earned Alvvays their first Grammy nomination.\nOnce getting into the venue, my party and I stationed ourselves promptly towards the back of the pit on the right side.\nWe had the pleasure of watching New Zealand based indie-rock band The Beths open (who, coincidentally, we also heard at Outside Lands).\nFloating from song to song while the audience takes it all in can be described with the all encompassing: it was a vibe."}]