[{"id": "14b4aa6b-9098-4ee6-bbdc-54033b8bcb4e", "title": "How Tropical Storm Debby could impact NJ this week : 3 scenarios", "date": "2024-08-05 01:00", "url": "https://nj1015.com/how-tropical-storm-debby-could-impact-nj-this-week-3-scenarios/", "domain": "nj1015.com", "domain_classification": "Unknown", "message": "By now, you may have heard that the Atlantic basin's fourth named tropical storm of the 2024 season has formed.\nAnd Tropical Storm Debby has been soaking the west coast of Florida this weekend.\n(NOAA / NHC) Forecast update for Tropical Storm Debby, as of 5 p.m. Sunday.\nLongwave IR satellite image of Tropical Storm Debby, as of about 6 p.m. Sunday.\n(Tropical Tidbits) Longwave IR satellite image of Tropical Storm Debby, as of about 6 p.m. Sunday."}, {"id": "3f7ee944-456f-4510-874c-6e96b9fab736", "title": "Tropical Storm Debby may bring  catastrophic  flooding to South Carolina amid  multiday deluge  ", "date": "2024-08-05 18:45", "url": "https://www.wbtv.com/2024/08/05/multiday-deluge-debby-drop-potentially-historic-rainfall-parts-sc/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "SOUTH CAROLINA (WBTV) - The South Carolina Emergency Management Division is monitoring Tropical Storm Debby as forecasters predict the storm will move “very slowly” across the state this week, leading to potentially historic rainfall.\nKey local and state agencies have been notified to be ready to respond if the need arises, SCEMD officials announced Monday.\nOur experts with the National Hurricane Center believe flooding to be catastrophic for many parts of South Carolina.\nTake no chances with this storm.”According to the National Hurricane Center, up to 30 inches of rain is expected through Saturday morning across the coastal plain of South Carolina and southeast of North Carolina, possibly resulting in “catastrophic” flooding.\nStick with WBTV by downloading the free WBTV Weather app and the National Hurricane Center for the latest developments of the storm."}, {"id": "759473ac-6978-4de5-9697-1891b716ce64", "title": "Hurricane Debby makes landfall over Florida Big Bend coast", "date": "2024-08-05 13:15", "url": "https://www.cbsnews.com/news/hurricane-debby-florida-landfall/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm hurricane near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents.\nThe storm came ashore in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn dangerous flooding.\nView of flooding caused by wind-driven rain from Hurricane Debby in Fort Myers, Florida, U.S., August 4, 2024 in this picture obtained from social media video.\nGabbi Ray via REUTERSThe small community where Hurricane Debby made landfall is roughly 20 miles from where Hurricane Idalia crashed ashore less than a year ago.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "1c6620e7-c0bf-46d5-8b67-5eef506c3818", "title": "Hurricane Debby hits Florida , threatens major flooding", "date": "2024-08-05 12:45", "url": "https://www.canberratimes.com.au/story/8718516/hurricane-debby-hits-florida-threatens-major-flooding/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"Right now, we are to trying secure everything from floating away,\" said Sheryl Horne, whose family owns the Shell Island Fish Camp along the Wakulla River in St. Marks, Florida, where some customers moved their boats inland."}, {"id": "90eb5e07-bca8-4e38-95ec-f46ad82435fc", "title": "Hurricane Debby makes landfall on Florida coast", "date": "2024-08-05 12:15", "url": "https://www.yahoo.com/news/hurricane-debby-makes-landfall-florida-112229262.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The fourth named storm of the season is also forecast to soak Georgia and South Carolina in the days ahead.\nAlready the storm's strong winds are impacting Florida residents - some 242,000 homes and businesses are without power in the state, according to PowerOutage.com.\n[BBC]Forecasters predicted this hurricane season, which runs from 1 June to 30 November, would be a busy one.\nForecasters said there could be up to 25 named storms in 2024.\nHurricane Debby marks the fourth named storm of the year after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris."}, {"id": "a2c7ed82-4c77-412a-8af3-0f3d5c502340", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:15", "url": "https://www.yahoo.com/news/hurricane-debby-bring-heavy-rains-052628023.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby hits Florida with floods, threat of record rain in Georgia and the CarolinasHORSESHOE BEACH, Fla. (AP) — Tropical Storm Debby slammed Florida with torrential rain and high winds, contributing to at least four deaths as it turned menacingly toward the Eastern Seaboard’s low-lying regions and threatened to flood some of America’s most historic Southern cities.\nThe potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "c56f0ac4-9887-46df-bdee-f7e2341b2b73", "title": "Opinion : Why there is no such thing as a  natural  disaster", "date": "2024-08-05 03:30", "url": "https://au.news.yahoo.com/opinion-why-no-thing-natural-223637621.html", "domain": "au.news.yahoo.com", "domain_classification": "Unknown", "message": "Charting a safer, more resilient course means first acknowledging that there is no such thing as a “natural disaster.” The word “natural” implies these events are entirely out of our control, thereby absolving us of the responsibility to prepare and reduce risk from natural hazards.\nWhen we destroy and degrade much of the natural world, we make communities more vulnerable to disasters.\nWithout the storage capacity these natural systems provide, the risk of devastating floods and landslides increases.\nAnita van Breda - WWFNature is fundamental to supporting life on Earth, adapting to a changing climate and reducing disaster risk.\nIn the wake of Hurricane Stan in 2005, Guatemala and Mexico diversified their farming systems to improve resilience and reduce future disaster risk."}, {"id": "11328c3d-b04f-4c62-b10b-9d1861d91c23", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:00", "url": "https://www.clickondetroit.com/news/national/2024/08/05/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\n“It is a very saturating, wet storm,” he said during an afternoon briefing at the state’s emergency operations center.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage.\nIn 2016, flooding from Hurricane Matthew caused 24 deaths in the two states and rivers set record crests."}, {"id": "2b0f5a7d-7478-46a2-8429-4fb239f4be3d", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:15", "url": "https://www.local10.com/news/national/2024/08/05/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "local10.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\n“It is a very saturating, wet storm,” he said during an afternoon briefing at the state’s emergency operations center.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "514f407a-c900-412d-9842-f73d6e2b1bdb", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida", "date": "2024-08-05 05:15", "url": "https://www.adn.com/nation-world/2024/08/04/tropical-storm-debby-now-expected-to-slam-floridas-big-bend-as-a-category-1-hurricane/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Storm surge breaks over a small sea wall near boat docks, Monday, Aug. 5, 2024, in Horseshoe Beach, Fla. Hurricane Debby made landfall early this morning.\nDebby made landfall early Monday as a Category 1 hurricane over the gulf coast of Florida.\nThe tropical storm was moving slowly, covering roads with water and contributing to at least four deaths.\nForecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nVice President Kamala Harris has postponed a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby."}, {"id": "14e6258b-3dc4-45bb-8a02-ba8dc4436123", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida", "date": "2024-08-05 03:45", "url": "https://www.ajc.com/news/nation-world/tropical-storm-debby-barrels-toward-florida-with-potential-record-setting-rains-farther-north/KXLLXP7ASVDWBPCS4ME2SVDCAU/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "c44c005d-ac45-493a-bb13-f62af513dacd", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:00", "url": "https://www.kob.com/news/us-and-world-news/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "kob.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nThis National Oceanic and Atmospheric Administration satellite image taken at 11:11pm ET shows Hurricane Debby approaching Florida on Sunday, Aug. 4, 2024.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "b605bc90-012d-48ee-864e-9f87028da5b4", "title": "Hurricane Debby to bring heavy rains and catastrophic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:30", "url": "https://www.clickorlando.com/news/national/2024/08/05/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Record-setting rain was expected to cause flash flooding, with up to 30 inches (76 centimeters) possible in some areas, the National Hurricane Center said.\nThe potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage.\nIn 2016, flooding from Hurricane Matthew caused 24 deaths in the two states and rivers set record crests."}, {"id": "762c6647-ff9b-4a4d-a111-5ef3a01a9f54", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida", "date": "2024-08-05 04:00", "url": "https://www.whsv.com/2024/08/04/tropical-storm-debby-predicted-reach-hurricane-strength-before-hitting-florida/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nHeavy rain and flooding in Florida's Captiva Island as Tropical Storm Debby set to strengthen to a Category 1 hurricane.\nEnglewood Beach, Florida residents share their reaction to the impending severe weather as Tropical Storm Debby nears landfall.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "94e07966-6522-4cfa-93d4-7c591aed80a0", "title": "Hurricane Debby is set to rip through TEN US states after making landfall in Florida , terrifying new forecast shows", "date": "2024-08-05 13:45", "url": "https://www.dailymail.co.uk/news/article-13710145/hurricane-debby-tracker-landfall-states-florida-forecast.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A teenage boy has been killed after devastating winds from Hurricane Debby knocked down a tree which then collapsed on top of his mobile home.\nThe fatal weather system is predicted to rip through 10 US states after making landfall in Florida, according to one terrifying model.\nMore than 220,000 homes were left without power Monday morning as the 80mph Category 1 storm made landfall in Florida’s Big Bend region.\nDramatic photographs show parts of Florida being hammered by torrential rain and gale-force winds as the hurricane made landfall Monday morning.\nHurricane Debby has the potential top bring record-setting rainfall, catastrophic flooding and life-threatening storm surges as it moves across northern Florida."}, {"id": "149a004e-9a8a-4e8d-9837-78ef2cdc9e4b", "title": "Hurricane Debby could bring record - setting flooding to Florida , Georgia , South Carolina", "date": "2024-08-05 13:45", "url": "https://www.al.com/news/2024/08/hurricane-debby-could-bring-record-setting-flooding-to-florida-georgia-south-carolina.html", "domain": "al.com", "domain_classification": "Unknown", "message": "Forecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby was expected to move eastward over northern Florida and then stall over the coastal regions of Georgia and South Carolina, thrashing the region with potential record-setting rains totaling up to 30 inches (76 centimeters) beginning Tuesday.\nDebby’s outer bands grazed the west coast of Florida, flooding streets and bringing power outages.\nThe hurricane center had predicted the system would strengthen as it curved off the southwest Florida coast, where the water has been extremely warm.\nBrian Kemp and South Carolina Gov."}, {"id": "14b8aafc-ca78-445a-bddc-977bda47cecc", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding", "date": "2024-08-05 17:00", "url": "https://www.wwaytv3.com/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nDebby made landfall as a category 1 hurricane near Steinhatchee, a tiny community of less than 1,000 residents.\nVice President Harris postpones trip to GeorgiaVice President Kamala Harris is postponing a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nHarris’ campaign said her stop planned in Savannah, Georgia, on Thursday, was being put off due to the storm.\nHundreds of thousands without powerMore than 350,000 customers were without power in Florida and Georgia on Monday, according to PowerOutage.com."}, {"id": "36898689-4a91-4b13-b81d-5e998e68a34d", "title": "Tropical storm Debby expected to intensify into hurricane , poses threat to Florida gulf coast", "date": "2024-08-05 03:00", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debby-expected-to-intensify-into-hurricane-poses-threat-to-florida-gulf-coast/articleshow/112274706.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tropical Storm Debby is anticipated to intensify into a hurricane before reaching the Big Bend area of Florida's Gulf Coast by Monday afternoon, according to the US National Hurricane Center (NHC).\nThe NHC has cautioned about the potential for life-threatening storm surges.As of Sunday evening, Debby had sustained winds of 70 mph (112 km/h), just shy of hurricane status.\nThe storm is expected to bring storm surges of up to 10 feet (3 meters) in certain areas.As it slowly progresses northward throughout the week, Debby may bring \"potentially historic rainfall\" of 10 to 20 inches (25 to 50 cm) and devastating flooding to Georgia and South Carolina , with some local areas possibly receiving up to 30 inches of rain by Friday morning.Jamie Rhome, the deputy director of the hurricane centre, emphasised that the slow-moving nature of the storm will result in historic rainfall amounts and catastrophic flooding.\nDeSantis also said that more than 17,000 linemen and other electric workers are ready to restore power if needed.\nThe governors of Georgia and South Carolina have also declared states of emergency in anticipation of the storm."}, {"id": "96cb6d28-0efe-4de7-8461-22f3422ee4ad", "title": "Tropical Storm Debby barrels toward Florida , with potential record - setting rains farther north", "date": "2024-08-05 00:30", "url": "https://www.pressherald.com/2024/08/04/tropical-storm-debby-barrels-toward-florida-with-potential-record-setting-rains-farther-north/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Debby’s outer bands grazed the west coast of Florida, flooding streets and bringing power outages.\nThe hurricane center predicted the system would strengthen as it curved off the southwest Florida coast, where the water has been extremely warm.\nWe are going to see much more inundation.”Debby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nA tropical storm watch extended farther west into the Panhandle.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "abc079e0-5346-4082-8c3c-a0daa2958c46", "title": "Hurricane Debby 2024 : Storm makes landfall near Steinhatchee , Florida at Category 1 ; threatens catastrophic flooding", "date": "2024-08-05 13:15", "url": "https://6abc.com/post/hurricane-debby-2024-storm-landfall-florida-bring-heavy-rains-catastrophic-flooding/15145630/", "domain": "6abc.com", "domain_classification": "Unknown", "message": "Hurricane Debby kills 4, weakens to tropical storm as it spirals east towards Atlantic coastHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "e0c760be-a3cd-4487-ad82-f10d2678bda0", "title": "Hurricane Debby 2024 : Storm makes landfall near Steinhatchee , Florida at Category 1 ; threatens catastrophic flooding", "date": "2024-08-05 13:15", "url": "https://abc13.com/post/hurricane-debby-2024-storm-landfall-florida-bring-heavy-rains-catastrophic-flooding/15145630/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Hurricane Debby kills 4, weakens to tropical storm as it spirals east towards Atlantic coastHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "c96837d4-583e-4302-ab9f-a713ecf73de7", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:45", "url": "https://www.wsbradio.com/news/hurricane-debby/YARYDGTYEZFMZDVHXADOBI3UJ4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "0182c04e-f039-4200-882b-5955c2128e94", "title": "Hurricane Debby 2024 : Storm makes landfall near Steinhatchee , Florida at Category 1 ; threatens catastrophic flooding", "date": "2024-08-05 12:30", "url": "https://abc7.com/post/hurricane-debby-2024-storm-landfall-florida-bring-heavy-rains-catastrophic-flooding/15145630/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "Hurricane Debby kills 4, weakens to tropical storm as it spirals east towards Atlantic coastHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nHurricane Debby has been downgraded to a tropical storm, with 70 mph winds, after making landfall early Monday morning as a Category 1 storm.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "88617f49-0e38-45e8-a184-bcbeafed3847", "title": "Hurricane Debby to bring heavy rains and catastrophic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 11:00", "url": "https://wtop.com/national/2024/08/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "A driver negotiates a flooded street as Tropical Storm Debby passes just to the west of the Tampa Bay, Fla., region, Sunday, Aug. 4, 2024.\n(Max Chesnes/Tampa Bay Times via AP)(AP/Max Chesnes) A driver negotiates a flooded street as Tropical Storm Debby passes just to the west of the Tampa Bay, Fla., region, Sunday, Aug. 4, 2024.\nThe tropical storm was moving slowly, covering roads with water and contributing to at least four deaths.\nVice President Kamala Harris has postponed a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "1ca3a702-dbb1-4c1e-9be8-0d03dbd3d344", "title": "Tropical Storm Debby barrels toward Florida , with potential record - setting rains farther north", "date": "2024-08-05 03:30", "url": "https://www.pennlive.com/weather/2024/08/tropical-storm-debby-barrels-toward-florida-with-potential-record-setting-rains-farther-north.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "Tropical storm force winds extended up to 140 miles (225 kilometers) from the center.\nWe are going to see much more inundation.”Debby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nA tropical storm watch extended farther west into the Panhandle.\nA pedestrian wades across a flooded street as a result of Tropical Storm Debby in the Shore Acres area of St. Petersburg, Fla., on Sunday, Aug. 4, 2024.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "01fc73ae-4c03-4ebd-b0c9-4753328af814", "title": "Tropical Storm Debby lashes Florida coast with potentially  catastrophic  flooding predicted", "date": "2024-08-05 18:15", "url": "https://www.thejournal.ie/storm-debby-florida-flooding-6455693-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "AT LEAST ONE person was killed as Tropical Storm Debby began lashing the US state of Florida today, with officials warning there could be historic levels of rain and potentially “catastrophic” flooding.\n“This is going to result in a prolonged extreme rainfall event with potential for catastrophic flooding across coastal portions of Georgia, South Carolina, even extending up into North Carolina,” he said.\nLife-threatening storm surge expected in portions of Florida and major flooding is forecast for the southeastern U.S.\nStorm surge and floodingThe NHC has warned of life-threatening storm surges along the Gulf coast, with up to 1.8 meters of inundation above ground level in some areas.\nThe storm will probably cause catastrophic flooding with “potentially historic heavy rainfall” when Debby moves northeast across Georgia and South Carolina over the next few days, the NHC said."}, {"id": "9f034c0d-e72a-42d9-a80f-7b73123071f9", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm", "date": "2024-08-05 13:15", "url": "https://www.pressherald.com/2024/08/05/hurricane-debby-makes-landfall-in-florida-as-category-1-storm/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Debby made landfall early Monday as a Category 1 hurricane over the Gulf Coast of Florida.\nThe tropical storm was moving slowly across the northern part of the state, covering roads with water and contributing to at least four deaths.\nBiden approved an emergency declaration for Florida on Saturday, and federal emergency staff have been deployed to Florida, Georgia and the Carolinas.\nIn South Carolina, Charleston County interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nAdvertisementNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "76636250-dd2d-44b1-83ae-eadcb9ee10ff", "title": "Hurricane Debby Makes Landfall In Florida As Category 1 Storm And Threatens Catastrophic Flooding", "date": "2024-08-05 13:00", "url": "https://www.theyeshivaworld.com/news/general/2302677/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nDebby’s outer bands earlier grazed the west coast of Florida, flooding streets and bringing power outages.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "e3c66cc2-222b-4c77-a219-2837380cf1a0", "title": "Tropical Storm Debby barrels toward Florida , with potential record - setting rains farther north", "date": "2024-08-05 01:00", "url": "https://www.centralmaine.com/2024/08/04/tropical-storm-debby-barrels-toward-florida-with-potential-record-setting-rains-farther-north/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "Debby’s outer bands grazed the west coast of Florida, flooding streets and bringing power outages.\nThe hurricane center predicted the system would strengthen as it curved off the southwest Florida coast, where the water has been extremely warm.\nWe are going to see much more inundation.”Debby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nA tropical storm watch extended farther west into the Panhandle.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "67d64961-3ede-407c-a7ed-665974e6fb43", "title": "Hurricane Debby to bring heavy rains and catastrophic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 11:00", "url": "https://www.theday.com/nation/20240805/hurricane-debby-to-bring-heavy-rains-and-catastrophic-flooding-to-florida-georgia-and-s-carolina/", "domain": "theday.com", "domain_classification": "Unknown", "message": "A driver negotiates a flooded street as Tropical Storm Debby passes just to the west of the Tampa Bay, Fla., region, Sunday, Aug. 4, 2024.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said.\nThis National Oceanic and Atmospheric Administration satellite image taken at 11:11pm ET shows Hurricane Debby approaching Florida on Sunday, Aug. 4, 2024."}, {"id": "8d86e60a-1093-4945-8dd4-19246bb1e67f", "title": "Hurricane Debby makes landfall at Florida Big Bend region", "date": "2024-08-05 13:45", "url": "https://www.bbc.co.uk/news/articles/cj4xxdknr94o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "At least four people have been killed after Hurricane Debby made landfall in the Big Bend region of Florida's Gulf Coast, leaving residents coping with flooding, power outages and treacherous roads.\nThe weather system strengthened into a Category One hurricane late on Sunday and came ashore near Steinhatchee on Monday morning, said the National Hurricane Center (NHC).\nIt is now expected to move slowly across the state, packing 80mph winds and dumping as much as 30in (76cm) of rain as it moves north.\nThe fourth named storm of the season is also forecast to soak Georgia and South Carolina in the days ahead."}, {"id": "00b12618-6fe0-4053-a2b8-c710bfff8afc", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding", "date": "2024-08-05 13:15", "url": "https://www.theweek.in/wire-updates/international/2024/08/05/fgn46-us-3rdld-storm.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida's Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nDebby's outer bands earlier grazed the west coast of Florida, flooding streets and bringing power outages.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "80e9b3dc-24ae-4de6-be5d-aef2b6951292", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding - WSVN 7News | Miami News , Weather , Sports", "date": "2024-08-05 13:15", "url": "https://wsvn.com/news/us-world/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nVice President Kamala Harris has postponed a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "65b1454f-5a87-4df9-a672-496984a0466b", "title": "Hurricane Debby makes landfall in northern Florida bringing life - threating storm surge , rain – NBC Connecticut", "date": "2024-08-05 13:15", "url": "https://www.nbcconnecticut.com/news/national-international/hurricane-debby-makes-landfall-in-northern-florida/3354317/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "Debby made landfall in northern Florida Monday morning as a Category 1 hurricane, bringing heavy rain, flooding and \"life-threatening\" storm surge, forecasters said.\nForecasters had warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nStorm surge warnings are in play across the #BigBend of #Florida south to #Tampa.\nStay with @nbc6https://t.co/PKdbgxwLAa pic.twitter.com/b2IsboFoKo — Adam Berg (@AdamBergNBC6) August 5, 2024\"This rainfall will likely result in areas of locally considerable flash and urban flooding, with river flooding expected,\" the NHC said.\nHurricane Debby has also caused significant travel delays in South Florida."}, {"id": "75160b18-c01a-49da-bc1e-a4eb39a28a1e", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 05:45", "url": "https://www.bournemouthecho.co.uk/news/national/24496958.storm-debby-strengthens-hurricane-en-route-florida/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "Forecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida.\nMr DeSantis declared a state of emergency for 61 of Florida’s 67 counties, with the National Guard activating 3,000 guard members."}, {"id": "62edc272-a708-476c-a4fa-00593699206d", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm", "date": "2024-08-05 15:00", "url": "https://www.centralmaine.com/2024/08/05/hurricane-debby-makes-landfall-in-florida-as-category-1-storm/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "Debby made landfall early Monday as a Category 1 hurricane over the Gulf Coast of Florida.\nThe tropical storm was moving slowly across the northern part of the state, covering roads with water and contributing to at least four deaths.\nBiden approved an emergency declaration for Florida on Saturday, and federal emergency staff have been deployed to Florida, Georgia and the Carolinas.\nIn South Carolina, Charleston County interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nAdvertisementNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "3da3ed4f-5738-4cb7-b243-c5560f135dda", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida", "date": "2024-08-05 06:15", "url": "https://www.walb.com/2024/08/04/tropical-storm-debby-predicted-reach-hurricane-strength-before-hitting-florida/", "domain": "walb.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nHeavy rain and flooding in Florida's Captiva Island as Tropical Storm Debby set to strengthen to a Category 1 hurricane.\nEnglewood Beach, Florida residents share their reaction to the impending severe weather as Tropical Storm Debby nears landfall.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "ef8d67d1-ffac-4b51-ac6b-f0cecc30fec6", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 06:15", "url": "https://www.echo-news.co.uk/news/national/24496958.storm-debby-strengthens-hurricane-en-route-florida/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Forecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida.\nMr DeSantis declared a state of emergency for 61 of Florida’s 67 counties, with the National Guard activating 3,000 guard members."}, {"id": "9a84d86c-6537-4937-8b66-644e3b8a3ba9", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 05:45", "url": "https://www.eadt.co.uk/news/national/24496958.storm-debby-strengthens-hurricane-en-route-florida/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "Forecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida.\nMr DeSantis declared a state of emergency for 61 of Florida’s 67 counties, with the National Guard activating 3,000 guard members."}, {"id": "33a99707-0868-4a4b-a68b-57b27997181f", "title": "Storm Debby to turn into hurricane before hitting Florida – DW – 08 / 05 / 2024", "date": "2024-08-05 03:45", "url": "https://www.dw.com/en/storm-debby-to-turn-into-hurricane-before-hitting-florida/a-69855585", "domain": "dw.com", "domain_classification": "International", "message": "Storm Debby, which turned into a Category 1 hurricane, is likely to bring historic rainfall levels and catastrophic flooding in the states of Florida, Georgia and South Carolina.\nTropical Storm Debby rapidly strengthened into a full-fledged hurricane late Sunday and made landfall in the Big Bend region of Florida's Gulf Coast on Monday.\nThe US National Hurricane Center (NHC) warned of record-setting rainfall and storm surges.\nDebby turned into the second hurricane originating from the Atlantic in 2024 Image: NOAA/AP/picture allianceOnce it makes landfall, Debby will likely slowly move north through the week, the NHC said.\n\"It's slow motion is going to dump historic amounts of rainfall — potentially over 20 inches (50.8 cms)."}, {"id": "f52876f5-5b76-4eb2-804f-4ff31cc870bb", "title": "Tropical Storm Debby barrels toward Florida , with potential record - setting rains further north", "date": "2024-08-05 02:00", "url": "https://www.wsfa.com/2024/08/04/tropical-storm-debby-predicted-reach-hurricane-strength-before-hitting-florida/", "domain": "wsfa.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nHeavy rain and flooding in Florida's Captiva Island as Tropical Storm Debby set to strengthen to a Category 1 hurricane.\nEnglewood Beach, Florida residents share their reaction to the impending severe weather as Tropical Storm Debby nears landfall.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "46a9702c-6f84-49ae-b922-8cd1945a34d4", "title": "Tropical Storm Debby barrels toward Florida , with potential record - setting rains farther north", "date": "2024-08-05 02:45", "url": "https://isp.netscape.com/news/story/0001/20240805/4307498f4276fa9d96b96c763567a9a8", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward FloridaTAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nA tropical storm watch extended farther west into the Panhandle.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "7123943d-f03c-48ec-95e4-225bd258830e", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 05:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/05/storm-debby-strengthens-to-hurricane-en-route-for-florida/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has strengthened into a Category 1 hurricane as it approaches Florida.\nForecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida."}, {"id": "577a9675-680b-4e07-96c1-5c64148f6562", "title": "Debby makes landfall in northern Florida as Category 1 hurricane", "date": "2024-08-05 12:15", "url": "https://wishtv.com/weather/weather-stories/debby-makes-landfall-in-northern-florida-as-category-1-hurricane/", "domain": "wishtv.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nHurricane Debby has officially made landfall in Steinhatchee, Florida as a Category 1 storm with max winds of 80 mph.\nRainfall will become a major story in the coming days, with its slow movement up the Carolina coast."}, {"id": "4279dc6f-22f9-4e73-9c5b-02db7b80e09a", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 06:45", "url": "https://www.yorkpress.co.uk/news/national/24496958.storm-debby-strengthens-hurricane-en-route-florida/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "Forecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida.\nMr DeSantis declared a state of emergency for 61 of Florida’s 67 counties, with the National Guard activating 3,000 guard members."}, {"id": "3419ac39-f767-4872-9c3c-cfb9f2c2541a", "title": "Hurricane Debby roars ashore in Florida", "date": "2024-08-05 13:45", "url": "https://www.guampdn.com/news/national/hurricane-debby-roars-ashore-in-florida/article_7c429faa-57a4-5b00-b60d-13cebec5a753.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "At least one person was killed as Tropical Storm Debby began dumping what could become historic levels of rain over Florida Monday, with the southeastern United States braced for potentially \"catastrophic\" flooding.\nAuthorities say the danger remains high as the storm moves over the state and into Georgia and South Carolina, despite the downgrade by the National Hurricane Center.\n\"This is going to result in a prolonged extreme rainfall event with potential for catastrophic flooding across coastal portions of Georgia, South Carolina, even extending up into North Carolina,\" he said.\nFlorida governor Ron DeSantis also warned of \"significant\" flooding over the coming days, and said the state had already seen storm surge and some water rising.\nThe storm will probably cause catastrophic flooding with \"potentially historic heavy rainfall\" when Debby moves northeast across Georgia and South Carolina over the next few days, the NHC said."}, {"id": "52ce770e-8f64-43ad-aa6c-38b95277e7c1", "title": "FIRST ALERT : Debby now a hurricane ,  catastrophic  flooding possible in parts of SC", "date": "2024-08-05 05:00", "url": "https://www.wmbfnews.com/2024/08/05/first-alert-tropical-storm-debby-will-bring-dangerous-rainfall-flooding-our-area-next-week/", "domain": "wmbfnews.com", "domain_classification": "Unknown", "message": "FIRST ALERT: South Carolina is now under a State of Emergency from the impacts we will see from Debby.\nDebby will meander through South Carolina this week.\nThat’s the highest risk issued in South Carolina since Hurricane Florence in 2018.\nHurricane conditions are expected in the hurricane warningarea by early Monday, with tropical storm conditions beginningovernight.\nTropical storm conditions are expected along the coast ofSouth Carolina within the tropical storm warning area lateMonday night."}, {"id": "5fc790b6-7399-4943-aa62-dc85741fd9f2", "title": "Hurricane Debby makes landfall along Florida coast as Category 1 storm", "date": "2024-08-05 15:00", "url": "https://upnorthlive.com/news/nation-world/hurricane-debby-threatens-catastrophic-flooding-in-big-bend-florida-panhandle-savannah-georgia-and-hilton-head-charleston-south-carolina-storm-surge-record-setting-rains-governor-ron-desantis-state-of-emergency", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "Debby turned deadly as it continues to roar across Florida after it made landfall as a Category 1 hurricane Monday morning.\nHurricane Debby made landfall near Steinhatchee on the Florida coast early Monday morning bringing with it the potential for record-setting rains, and life-threatening storm surge.\nHurricane Debby is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nBrian Kemp and South Carolina Gov."}, {"id": "102836d2-76e6-4333-a400-4052cd7b010f", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida | News , Sports , Jobs", "date": "2024-08-05 14:00", "url": "https://www.mauinews.com/wire/?category=5186&ID=336431", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "By KIMBERLY CHANDLER and CHRISTOPHER O’MEARA Associated PressTAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nA tropical storm watch extended farther west into the Panhandle.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "95541eb7-d3fa-41c1-a9d8-660d204c85a2", "title": "Debby strengthens to a Category 1 hurricane ahead of Florida landfall", "date": "2024-08-05 04:45", "url": "https://www.9news.com.au/world/usa-news-hurricane-debby-strengthens-to-category-1-hurricane-ahead-of-florida-landfall/29a1e97e-0568-4712-b085-36f1d25c7ecf", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Hurricane Debby, the fourth named storm of the Atlantic hurricane season and the second named hurricane, has become a Category 1 storm, according to the National Hurricane Centre in the US.\nDAY 9 WRAP: All the action from a medal-packed night in ParisTropical Storm Debby moves through the Gulf of Mexico.\nTropical storm and storm surge watches and warnings have also been issued for parts of Florida, coastal Georgia and parts of South Carolina.\nVisitors to the Tarpon Springs Sponge Docks navigate a flooded street on Sunday, Aug 4, 2024 in Tarpon Springs, Fla., as Tropical Storm Debby stirs moisture offshore in the Gulf of Mexico.\nDeSantis also urged Florida residents to avoid floodwaters ahead of the storm's potentially significant flooding impacts, particularly in North Central Florida."}, {"id": "360ec3d6-1d56-453c-bb71-4ff003a7c218", "title": "Hurricane Debby makes landfall in northern Florida as Category 1 storm", "date": "2024-08-05 12:15", "url": "https://www.breakingnews.ie/world/hurricane-debby-makes-landfall-in-northern-florida-as-category-1-storm-1658129.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Hurricane Debby has made landfall in northern Florida as a Category 1 storm.\nAdvertisementThe storm made landfall in Steinhatchee, a tiny community of less than 1,000 residents in the Big Bend area of Florida’s Gulf Coast.\nForecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nAdvertisement5 am EDT: Hurricane #Debby very near landfall in the Florida Big Bend.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane."}, {"id": "85235d99-86c3-4b6e-bf1e-c7187d58ae49", "title": "Tracking Debby", "date": "2024-08-05 21:00", "url": "https://mynews13.com:443/fl/orlando/weather/2024/07/31/tracking-debby", "domain": "mynews13.com", "domain_classification": "Unknown", "message": "Debby has weakened into a tropical storm again as it continues to push inland over the Florida Panhandle.\nIt formed into a tropical storm on Saturday, Aug. 3, and became a hurricane on Sunday, Aug. 4.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season.\nIt's a tropical storm with max winds of 50 mph and is slowly moving northeast.\nIt looks to stall along the Southeast coast for several days, bringing inches to possibly feet of rain to the region."}, {"id": "ff6927e0-04ff-4df4-b1cd-049afba52d4e", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:00", "url": "https://knst.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "knst.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "fb319e4d-dd38-40fb-bb88-2b8897e1be9a", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:00", "url": "https://stevefmvirginia.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "stevefmvirginia.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "648f5b31-8561-4b65-abd2-6d241a2d0ad0", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:00", "url": "https://wtkg.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wtkg.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "231b8574-b81f-4bbf-bb84-5ea53b813390", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:00", "url": "https://wwnc.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wwnc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "c40bbe54-fda4-43e5-b598-49d56378503a", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding", "date": "2024-08-05 16:00", "url": "https://www.startribune.com/hurricane-debby-to-bring-heavy-rains-and-catastrophic-flooding-to-florida-georgia-and-s-carolina/600795260", "domain": "startribune.com", "domain_classification": "Unknown", "message": "''It is a very saturating, wet storm,'' he said during an afternoon briefing at the state's emergency operations center.\n''When they crest and the water that's going to come down from Georgia, it's just something that we're going to be on alert for not just throughout today, but for the next week.''"}, {"id": "0861f8ee-7916-408b-a003-74529e75ddbe", "title": "Aiken to receive 6 - 12 inches of rain from Hurricane Debby . | Hurricane Wire", "date": "2024-08-05 15:15", "url": "https://www.postandcourier.com/aikenstandard/hurricanewire/aiken-tropical-storm-debby/article_3c920108-5280-11ef-92a9-d7b0c12422f4.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "Aiken Standard reporterMatthew Christian is a reporter for the Aiken Standard.\nHe covers the Savannah River Site, city of Aiken and politics.\nMatthew previously covered government and politics for the Morning News in Florence.\nHe is a graduate of the University of South Carolina School of Law and the University of Charleston in West Virginia.\nTo support local journalism, sign up for a subscription."}, {"id": "0384490b-b067-4bac-9195-998417304a9d", "title": "Storm Debby strengthens to hurricane en route for Florida", "date": "2024-08-05 05:15", "url": "https://www.eveningnews24.co.uk/news/national/24496958.storm-debby-strengthens-hurricane-en-route-florida/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "Forecasters at the National Hurricane Center in Miami said on Sunday evening the storm had maximum sustained winds of 75mph.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned that heavy amounts of rain could bring catastrophic flooding in Florida, South Carolina and Georgia.\nA vehicle drives through a flooded street as Tropical Storm Debby approaches Florida.\nMr DeSantis declared a state of emergency for 61 of Florida’s 67 counties, with the National Guard activating 3,000 guard members."}, {"id": "28a5897c-5233-4c5b-89e3-13ab3be2e986", "title": "Hurricane Slams Florida After Gaining Fury in Warm Waters", "date": "2024-08-05 16:00", "url": "https://www.insurancejournal.com/news/southeast/2024/08/05/787028.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Hurricane Debby slammed into Florida southeast of Tallahassee as a Category 1 storm after intensifying over warm waters, the latest evidence that this will be a robust season for tropical cyclones.\nMonths of record warm water across the Atlantic has raised alarm that 2024 would be a very hurricane active season.\nDebby is already the second storm to make landfall in the US this year following Beryl, which struck eastern Texas last month and caused a massive power outage.\nA year ago, Hurricane Idalia made landfall in the Big Bend area as a Category 3 hurricane.\nPhoto: Protective measures at a business ahead of Hurricane Debby in Cedar Key, Florida, US, on Aug. 4."}, {"id": "9418a822-b933-4420-9fb1-8ff75e47fa75", "title": "As storm Debby strengthens , US southeast braces for  historic  rainfall", "date": "2024-08-05 00:45", "url": "https://www.yahoo.com/news/storm-debby-strengthens-us-southeast-000843826.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Florida Governor Ron DeSantis said that some 250,000 residents in his state were without power as of Monday morning (JOE RAEDLE)At least four people were killed as Tropical Storm Debby drenched Florida on Monday, threatening southeastern US states with heavy rainfall and catastrophic flooding.\nThe storm is expected to move into Georgia overnight, before moving offshore and approaching the South Carolina coast on Thursday, according to the National Hurricane Center (NHC).\nStorm surge warnings -- signalling a life-threatening inundation from rising water -- are in effect in parts of Georgia, South Carolina and North Carolina.\nThe governors of Georgia and South Carolina have declared a state of emergency ahead of the storm's arrival.\nMeanwhile, the US Border Patrol announced that Debby had washed up 25 packages of cocaine to the coast of the Florida Keys, where they were seized."}, {"id": "6b1c217f-0a8f-4f27-b225-b970e3cb75f5", "title": "Major flooding possible in SC as Hurricane Debby is forecast to drench Columbia area", "date": "2024-08-05 13:15", "url": "https://www.yahoo.com/news/major-flooding-possible-sc-hurricane-124619039.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Major flooding possible in SC as Tropical Storm Debby is forecast to drench Columbia areaTropical Storm Debby made landfall in the U.S. on Monday, and will move north toward the Columbia area of South Carolina, where a flood watch has been issued, according to the National Weather Service.\nThe storm was expected to affect the Midlands area Monday night and continue through Tuesday and Wednesday, National Weather Service meteorologists said in a morning briefing.\nExcessive runoff could result in flooding of rivers, creeks, streams, and other low-lying and flood-prone locations, according to the National Weather Service.\nAs of Sunday night, Debby’s winds are not expected to be a major threat to the Columbia area, the National Weather Service said.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, according to the National Weather Service."}, {"id": "afdb74be-7b34-4f1d-8350-9dbb9f997191", "title": "Major flooding possible in SC as Hurricane Debby is forecast to drench Columbia area", "date": "2024-08-05 14:30", "url": "https://www.yahoo.com/news/major-flooding-possible-sc-hurricane-124619530.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Major flooding possible in SC as Tropical Storm Debby is forecast to drench Columbia areaTropical Storm Debby made landfall in the U.S. on Monday, and will move north toward the Columbia area of South Carolina, where a flood watch has been issued, according to the National Weather Service.\nThe storm was expected to affect the Midlands area Monday night and continue through Tuesday and Wednesday, National Weather Service meteorologists said in a morning briefing.\nExcessive runoff could result in flooding of rivers, creeks, streams, and other low-lying and flood-prone locations, according to the National Weather Service.\nAs of Sunday night, Debby’s winds are not expected to be a major threat to the Columbia area, the National Weather Service said.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, according to the National Weather Service."}, {"id": "15994cbe-380e-4034-9d57-0c53b2984d87", "title": "Major flooding possible in SC as Hurricane Debby is forecast to drench Columbia area", "date": "2024-08-05 13:15", "url": "https://www.yahoo.com/news/major-flooding-possible-sc-hurricane-124619338.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Major flooding possible in SC as Tropical Storm Debby is forecast to drench Columbia areaTropical Storm Debby made landfall in the U.S. on Monday, and will move north toward the Columbia area of South Carolina, where a flood watch has been issued, according to the National Weather Service.\nThe storm was expected to affect the Midlands area Monday night and continue through Tuesday and Wednesday, National Weather Service meteorologists said in a morning briefing.\nExcessive runoff could result in flooding of rivers, creeks, streams, and other low-lying and flood-prone locations, according to the National Weather Service.\nAs of Sunday night, Debby’s winds are not expected to be a major threat to the Columbia area, the National Weather Service said.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, according to the National Weather Service."}, {"id": "5e0dfa03-c4f1-4b9a-bfb8-2461d475153c", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:30", "url": "https://970kfbx.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "3b7bc287-c849-40cd-96b0-9d241fbd1b3e", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:30", "url": "https://wiba.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wiba.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "fb621fc1-81eb-47a4-96bb-9aa57fee8a8a", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:30", "url": "https://kfab.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "kfab.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "877964e7-dfba-4088-b2f9-9c9ddd270d84", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 04:30", "url": "https://newcountry1079.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "newcountry1079.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "dddd4986-afcd-4e80-b167-53e139eff30d", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:15", "url": "https://wmrn.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wmrn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "6085bf27-12aa-44d7-8d2a-1717dcfd85bd", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:15", "url": "https://1190talkradio.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "1190talkradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "134eec3b-cc5b-451e-8b45-6d22674d0781", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:15", "url": "https://woc1420.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "e6d9ae7b-33c9-47a3-b67d-bb6d77d00bc8", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:15", "url": "https://1061fmtalk.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "4b4638a3-6d58-46cf-9d55-d426eb24e375", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:15", "url": "https://newsradio540.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "newsradio540.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "095c8e07-627f-44f3-b845-6f3255c421ac", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:15", "url": "https://talk1200boston.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "talk1200boston.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "212c3375-81ad-4cf5-9598-59c77f95e5e0", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:15", "url": "https://1360kktx.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "1360kktx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "18ffaf4f-9044-4ce5-b040-ab8380447fbe", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:00", "url": "https://whoradio.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "5534aa83-4991-47d2-b2ef-533de4b6ef49", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast | 96 . 3", "date": "2024-08-05 05:00", "url": "https://wflapanamacity.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wflapanamacity.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "6aec3f7a-3af6-4ac9-98d7-fb56ab12db48", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:30", "url": "https://talkradio1059.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "talkradio1059.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "915b608d-aa1b-417c-98b1-6d1fa766c2f0", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:00", "url": "https://wsfcam.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wsfcam.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "4ff612de-c8d8-4bdf-84e9-92f5e66c0e01", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast | WJBO Newsradio 1150 AM & 98 . 7 FM", "date": "2024-08-05 05:45", "url": "https://wjbo.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wjbo.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "d66d6df4-d5c8-45ad-b1ad-e8068ec1c681", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:45", "url": "https://720thevoice.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "720thevoice.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "78060a51-c0fa-4c98-82fe-4744734dc60a", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:45", "url": "https://1019bigwaax.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "1019bigwaax.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "2710049f-8c5a-42c4-865f-92ea1a42cf3a", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:45", "url": "https://patriotla.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "patriotla.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "27dacd2c-b7c9-43c9-bd3d-9a08244099eb", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 05:45", "url": "https://wflafm.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wflafm.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "29c21778-69f7-49a9-b0ab-726266e73ce6", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:45", "url": "https://wbhpam.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wbhpam.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "df72d2fc-2eda-44a9-822c-2f23599aa14e", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:45", "url": "https://newsradio967.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "newsradio967.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "8eaf1bc7-0596-4eee-92b0-e1085b4131e0", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast | News Radio 103 . 1 and 810 WGY", "date": "2024-08-05 06:45", "url": "https://wgy.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "wgy.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "2c4daf3e-d2b5-4499-8c74-d69bba495057", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:45", "url": "https://khow.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "khow.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "e66ad91e-e9d3-4a28-a2c0-8d84d6b5492c", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:45", "url": "https://newstalk1230.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "newstalk1230.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "f692227a-eacb-4aff-9f39-3d48cbad95f8", "title": "Debby Intensifies Into Hurricane , Moves Toward Florida Gulf Coast", "date": "2024-08-05 06:45", "url": "https://kogo.iheart.com/content/2024-08-04-debby-intensifies-into-hurricane-moves-toward-floridas-gulf-coast/", "domain": "kogo.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby intensified into a Category 1 hurricane as it continues to move toward the Big Bend stretch of Florida's Gulf Coast ahead of expected landfall Monday (August 5) morning, CBS News reports.\nDebby is the fourth named storm reported during Atlantic hurricane season, the National Hurricane Center announced on Saturday (August 3).\nThe agency predicted Debby would bring drenching rain and coastal flooding, which would begin Sunday (August 4) night.\n\"There is a danger of life-threatening storm surge along portions of the Gulf Coast of Florida, with 6 to 10 feet of inundation above ground level expected somewhere between Ochlockonee River to Yankeetown late tonight and Monday morning,\" the National Hurricane Center wrote at around 11:00 p.m.\n\"Residents in the Storm Surge Warning area should follow any advice given by local officials.\""}, {"id": "96cb1e08-41c0-4a0c-8d4b-b64921c9f238", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding | News , Sports , Jobs", "date": "2024-08-05 15:45", "url": "https://www.heraldextra.com/top-headlines/2024/aug/05/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding/", "domain": "heraldextra.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nPerez, the director of the town’s tourism department, said she has a new roof after Hurricane Idalia tore it apart in August 2023."}, {"id": "5091b34a-4472-4031-afcc-346323bca499", "title": "Hurricane Debby makes landfall along Florida coast as Category 1 storm", "date": "2024-08-05 13:15", "url": "https://kfdm.com/news/nation-world/hurricane-debby-threatens-catastrophic-flooding-in-big-bend-florida-panhandle-savannah-georgia-and-hilton-head-charleston-south-carolina-storm-surge-record-setting-rains-governor-ron-desantis-state-of-emergency", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "Debby turned deadly as it continues to roar across Florida after it made landfall as a Category 1 hurricane Monday morning.\nHurricane Debby made landfall near Steinhatchee on the Florida coast early Monday morning bringing with it the potential for record-setting rains, and life-threatening storm surge.\nHurricane Debby is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nBrian Kemp and South Carolina Gov."}, {"id": "25c4cfb3-2974-4fd4-a9f1-c7b12ff6ed53", "title": "Hurricane Debby makes landfall in northern Florida as Category 1 storm", "date": "2024-08-05 13:45", "url": "https://www.kctv5.com/2024/08/05/hurricane-debby-bring-heavy-rains-catastrophic-flooding-florida-georgia-s-carolina/", "domain": "kctv5.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\n“It is a very saturating, wet storm,” he said during an afternoon briefing at the state’s emergency operations center.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "bea34db5-2627-4a23-ad5d-4e46e76cf773", "title": "Hurricane Debby makes landfall along Florida coast as Category 1 storm", "date": "2024-08-05 14:45", "url": "https://news3lv.com/news/nation-world/hurricane-debby-threatens-catastrophic-flooding-in-big-bend-florida-panhandle-savannah-georgia-and-hilton-head-charleston-south-carolina-storm-surge-record-setting-rains-governor-ron-desantis-state-of-emergency", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "Debby turned deadly as it continues to roar across Florida after it made landfall as a Category 1 hurricane Monday morning.\nHurricane Debby made landfall near Steinhatchee on the Florida coast early Monday morning bringing with it the potential for record-setting rains, and life-threatening storm surge.\nHurricane Debby is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nBrian Kemp and South Carolina Gov."}, {"id": "9ee9e470-b3fe-4677-ae34-52d7c8963c78", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding", "date": "2024-08-05 16:00", "url": "https://www.ktbs.com/news/national/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding/article_c0169f0c-4872-5b20-b123-217ee7b62207.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "3b5c4017-9728-4f02-8b70-58f6b83c9c45", "title": "Week of extreme rains expected after Debby slams Florida coast", "date": "2024-08-05 21:00", "url": "https://www.theweathernetwork.com/en/news/weather/severe/debby-slams-floridas-gulf-coast-threatening-southeast-with-a-week-of-rain", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "The storm had lost some of its windspeed after slamming Florida's Gulf Coast around 7 a.m. on Monday morning as a Category 1 hurricane.\nIt made landfall near Steinhatchee, in the Big Bend region about 70 miles (115 km) southeast of Tallahassee, delivering winds of up to 80 mph (130 kph), the National Hurricane Center said.\nThe hurricane center predicted Debby would move offshore into the Atlantic by Tuesday night, then re-strengthen and come back inland to drench the coasts of Georgia and South Carolina later in the week.\nThe governors of Georgia and South Carolina have declared states of emergency in anticipation of Debby's damage.\nBy midday Monday, Debby had already dumped eight to 16 inches of rain in some parts of central Florida, according to local weather reports."}, {"id": "50af1211-8a12-4517-ad31-1ad1c4aa1a4c", "title": "US coast braces for impact as tropical storm strengthens into a hurricane with urgent storm surge warning issued - here where itll make landfall", "date": "2024-08-05 04:30", "url": "https://www.dailymail.co.uk/news/article-13708889/US-coast-braces-impact-debby-strengthens-hurricane.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Maps have revealed that Hurricane Debby is due to slam into Florida today, with forecasters predicting there will be 'historic rainfall' causing catastrophic flooding.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nBy the middle of the week, the hurricane is expected to dump nearly two feet of rain on parts of Georgia and South Carolina.\n'That would be record-breaking rainfall associated with a tropical cyclone for both the states of Georgia and South Carolina if we got up to the 30-inch level.'\nIt isn't yet clear if Biden will do the same for Georgia and South Carolina, both soon-to-be targets of the impending system."}, {"id": "cd87b909-7173-43b3-8711-364ac0c08973", "title": "Hurricane Debby makes landfall in Florida as Category 1 storm and threatens catastrophic flooding", "date": "2024-08-05 14:00", "url": "https://gazette.com/ap/national/hurricane-debby-makes-landfall-in-florida-as-category-1-storm-and-threatens-catastrophic-flooding/article_2798124c-bced-58ce-9389-353f706b272e.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby hits Florida with floods, threat of record rain in Georgia and the CarolinasTropical Storm Debby slammed Florida with torrential rain and high winds, contributing to at least four deaths as it turned menacingly toward the Eastern Seaboard’s low-lying regions and threatened to flood some of America’s most historic Southern cities"}, {"id": "5b5a7060-3f48-41db-90ab-7c065191903a", "title": "Tropical Storm Debby likely to bring  catastrophic flooding  inland", "date": "2024-08-05 00:30", "url": "https://www.katc.com/weather/officials-say-tropical-storm-debby-likely-to-bring-catastrophic-flooding-inland", "domain": "katc.com", "domain_classification": "Unknown", "message": "The storm is expected to strengthen into a hurricane overnight before making landfall in Florida on Monday.\nA hurricane warning was issued for the Big Bend of Florida.\nIn addition, members of the Florida National Guard are already positioned in areas expected to be hardest hit.\n\"Tropical Storm Debby is likely to become a Category 1 hurricane before making landfall in the Big Bend region of Florida,\" DeSantis said at a Sunday news conference.\nMeanwhile, Georgia and South Carolina residents should be ready for \"historic heavy rainfall\" for much of the week, the National Hurricane Center said."}, {"id": "6eb6a3e2-8290-47b0-9f6f-a84f0f26805f", "title": "Debby grounds flights , knocks out power to hundreds of thousands in Florida , Georgia", "date": "2024-08-05 19:00", "url": "https://www.dallasnews.com/news/2024/08/05/debby-grounds-flights-knocks-out-power-to-hundreds-of-thousands-in-florida-georgia/", "domain": "dallasnews.com", "domain_classification": "Unknown", "message": "Tropical storm Debby made landfall as a hurricane in one of the least populated areas of Florida.\nAbout 350,000 customers were without power in Florida and Georgia on Monday, according to PowerOutage.com.\nAdvertisementHarris postpones trip to GeorgiaVice President Kamala Harris is postponing a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nHarris’ campaign said her stop planned in Savannah, Georgia, on Thursday, was being put off due to the storm.\n(AP Photo/Christopher O'Meara) (Chris O'Meara / AP)Hundreds of thousands without powerAbout 350,000 customers were without power in Florida and Georgia on Monday, according to PowerOutage.com."}, {"id": "d6cc5f5c-1ae8-4661-b266-57f731fe2b84", "title": "Debby to become a hurricane before hitting Florida", "date": "2024-08-05 03:30", "url": "https://www.marketscreener.com/news/latest/Debby-to-become-a-hurricane-before-hitting-Florida-47552577/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: ::Tropical Storm Debby expected to become a hurricaneand make landfall on Florida's Gulf Coast Monday:: August 4, 2024:: NOAA:: Michael Brennan, Director, National Hurricane Center\"There's going to be multiple hazards that are going to play out in association with Debby.\nOver the next 24 hours, we're going to focus on the Florida Big Bend coastline, where we're going to see the life threatening storm surge inundation, as well as hurricane force winds near where the landfall occurs.\nThe National Hurricane Center (NHC) forecast life-threatening conditions, including storm surges up to 7 feet (2 meters).\nDebby became a tropical storm late on Saturday.\nA tropical storm warning is in effect for the Florida and Georgia coasts from Ponte Verde Beach to the Savannah River, including the Fort Myers area, which was crushed by Hurricane Ian in 2022."}, {"id": "6df153b4-840c-48e0-bce6-2320761d13fd", "title": "Debby becomes Category 1 hurricane ahead of expected landfall in Florida", "date": "2024-08-05 13:15", "url": "https://www.fox5ny.com/news/tropical-storm-debby-expected-become-hurricane-sets-sights-florida", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby strengthened into a Category 1 hurricane on Sunday night, with a landfall expected in the Florida Big Bend area on Monday.\nHurricane Debby is expected to produce hurricane conditions on Monday in the Big Bend area where a hurricane warning is in effect, but tropical storm conditions began Sunday evening.\nA hurricane warning is in effect for the Florida coast from the Suwannee River to Indian Pass, along with the Valdosta area in south Georgia.\nA hurricane watch is in effect for the Florida coast south of the Suwannee River to Yankeetown.\nHurricane Debby is expected to bring heavy rainfall as well as flash and urban flooding to portions of northern Florida."}, {"id": "38d97756-6297-49fb-a5a6-2db3c67121fb", "title": "5 PM Sun : Debby Aims For Tally , Storm Surge And Tornadoes Over Peninsula | Newsradio WFLA Orlando", "date": "2024-08-05 00:30", "url": "https://wflaorlando.iheart.com/featured/florida-news/content/2024-08-04-5-pm-sun-debby-aims-for-tally-storm-surge-and-tornadoes-over-peninsula/", "domain": "wflaorlando.iheart.com", "domain_classification": "Unknown", "message": "The Tropical Storm Watch from west of Indian Pass to Mexico BeachFlorida has been changed to a Tropical Storm Warning.\nA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from thecoastline.\nSTORM SURGE: The combination of storm surge and tide will causenormally dry areas near the coast to be flooded by rising watersmoving inland from the shoreline."}, {"id": "979f1158-b1f6-4704-aa36-09163ff71390", "title": "5 PM Sun : Debby Aims For Tally , Storm Surge And Tornadoes Over Peninsula", "date": "2024-08-05 00:30", "url": "https://979kissfm.iheart.com/content/2024-08-04-5-pm-sun-debby-aims-for-tally-storm-surge-and-tornadoes-over-peninsula/", "domain": "979kissfm.iheart.com", "domain_classification": "Unknown", "message": "The Tropical Storm Watch from west of Indian Pass to Mexico BeachFlorida has been changed to a Tropical Storm Warning.\nA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from thecoastline.\nSTORM SURGE: The combination of storm surge and tide will causenormally dry areas near the coast to be flooded by rising watersmoving inland from the shoreline."}, {"id": "97b82399-db78-4af4-81c2-a2b2dc6595cc", "title": "5 PM Sun : Debby Aims For Tally , Storm Surge And Tornadoes Over Peninsula", "date": "2024-08-05 01:00", "url": "https://literock993.iheart.com/content/2024-08-04-5-pm-sun-debby-aims-for-tally-storm-surge-and-tornadoes-over-peninsula/", "domain": "literock993.iheart.com", "domain_classification": "Unknown", "message": "The Tropical Storm Watch from west of Indian Pass to Mexico BeachFlorida has been changed to a Tropical Storm Warning.\nA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from thecoastline.\nSTORM SURGE: The combination of storm surge and tide will causenormally dry areas near the coast to be flooded by rising watersmoving inland from the shoreline."}, {"id": "185b2a58-7b1d-4833-ab8c-288e73817712", "title": "5 PM Sun : Debby Aims For Tally , Storm Surge And Tornadoes Over Peninsula | 96 . 3 | 102 . 5 NewsRadio WFLA", "date": "2024-08-05 00:00", "url": "https://wflapanamacity.iheart.com/featured/florida-news/content/2024-08-04-5-pm-sun-debby-aims-for-tally-storm-surge-and-tornadoes-over-peninsula/", "domain": "wflapanamacity.iheart.com", "domain_classification": "Unknown", "message": "The Tropical Storm Watch from west of Indian Pass to Mexico BeachFlorida has been changed to a Tropical Storm Warning.\nA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from thecoastline.\nSTORM SURGE: The combination of storm surge and tide will causenormally dry areas near the coast to be flooded by rising watersmoving inland from the shoreline."}, {"id": "2e413144-9679-44e1-b566-fb3cd9e2c4fb", "title": "  Catfish in driveway  as Hurricane Debby slams Florida ; video", "date": "2024-08-05 17:45", "url": "https://www.yahoo.com/news/catfish-driveway-hurricane-debby-slams-165652378.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A St. Petersburg, Fla., resident on Sunday shared footage showing catfish floundering in his yard during extensive flooding caused by Hurricane Debby.\nAs of Monday morning, Hurricane Debby hade made landfall along the Gulf Coast and was causing extensive flooding that seemed to flush fish from area waterways.\nx.comCiarletta posted two videos showing catfish wriggling in shallow water outside his home.\nCiarletta assumed that the catfish were flushed onto his neighborhood streets via flooded storm drains.\nThis article originally appeared on For The Win: 'Catfish in driveway' as Hurricane Debby slams Florida; video"}, {"id": "bafd1832-59a8-4b1b-9177-e7d14b2f94af", "title": "Tropical storm Debby threatens Florida Gulf Coast with historic rainfall and major flooding", "date": "2024-08-05 03:00", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debby-threatens-floridas-gulf-coast-with-historic-rainfall-and-major-flooding/articleshow/112274490.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tropical Storm Debby intensified rapidly on Sunday as it approached Florida's Gulf Coast , with meteorologists warning that it could soon escalate to hurricane strength.\n\"We are looking at potentially really, really significant flooding, particularly in north-central Florida,\" he said.\n\"Take the situation seriously,\" advised Paul Hasenmeier, Hernando County fire chief and public safety director.\n\"We know the water's going to come up as the storm passes.\nThe coordinated response aims to mitigate the impact of what could be a historic weather event.Residents along the Gulf Coast and the southeastern US are urged to remain vigilant and follow local advisories as Tropical Storm Debby continues its perilous path."}, {"id": "4a385984-b091-4138-b9d2-5d96bc9bcc1c", "title": "Hurricane Debby makes landfall in Florida with 99 - mph wind gusts and a 6 - foot storm surge", "date": "2024-08-05 14:30", "url": "https://www.yahoo.com/news/hurricane-debby-makes-landfall-florida-131250749.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Over 20 inches of rain fell near Sarasota, Florida, during the storm, with more than a foot of rain around Live Oak, Florida, where the warnings were in effect.\nDebby, now a tropical storm, continues to spread flooding into the Florida Panhandle, with rain spreading northward into South Carolina.\nMillions were under flood watches and warnings from Tampa, Florida, through Charleston, South Carolina.\nUp to 6 feet of storm surge flooding occurred at Cedar Key, Florida, early Monday morning.\nOn Sunday, a significant overwash occurred in St. Petersburg, Florida, as a 4-foot storm surge hit Tampa Bay."}, {"id": "05bad79a-170a-436d-a3ff-7d03001ce225", "title": "Heat wave / 100° temps for Acadiana this week ; Debby to become a hurricane", "date": "2024-08-05 00:30", "url": "https://www.katc.com/weather/heat-wave-100-temperatures-for-acadiana-this-week-debby-expected-to-become-a-hurricane-prior-to-landfall", "domain": "katc.com", "domain_classification": "Unknown", "message": "A heat wave, somewhat reminiscent of August 2023, is in the forecast for Acadiana this week with temperatures expected to reach the 100° mark by mid-week...if not, sooner.\nMeanwhile, Tropical Storm Debby is expected to become a hurricane prior to landfall Monday morning near the Big Bend of Florida.\nRob Perillo/KATCIn the tropics, Tropical Storm Debbyis expected to become a hurricane overnight prior to landfall across the Big Bend of Florida in the extreme Northeastern Gulf of Mexico.\nAcross portions of southeast Georgia and South Carolina, 10 to 20 inches of rainfall, with local amounts to 30 inches, are expected through Friday morning.\nRob Perillo/KATCThis wave will run pretty close to South America and head for the Western Caribbean later this week."}, {"id": "1445fda9-cbab-43bc-862f-245d75f26efa", "title": "Aiken to receive 6 - 12 inches of rain from Hurricane Debby . | Hurricane Wire", "date": "2024-08-05 17:15", "url": "https://www.postandcourier.com/hurricanewire/aiken-tropical-storm-debby/article_3c920108-5280-11ef-92a9-d7b0c12422f4.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "Charleston, SC (29403)TodayShowers and thunderstorms likely.\nWinds ESE at 10 to 20 mph.\nChance of rain 100%.\n1 to 2 inches of rain expected..TonightBecoming windy with showers and thunderstorms likely.\nChance of rain 100%."}, {"id": "c7282fb7-f7ed-4934-935f-0d029984e960", "title": "Hurricane Debby live updates : Storm makes landfall in Big Bend Area", "date": "2024-08-05 14:45", "url": "https://www.fox10phoenix.com/news/hurricane-debby-make-landfall-big-bend-area-bringing-life-threatening-storm-surge-florida", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "After making landfall as a hurricane in the Big Bend Area near Steinhatchee, Florida, Debby has been downgraded to a tropical storm.\nThe 5 p.m. report from the National Hurricane Center puts the storm at 30.5 N 82.9W, moving at 6 mph.\nRon DeSantis said the storm is being blamed for four deaths in Florida.\nHe said Debby will spend three days over the Carolinas, which could create ‘catastrophic’ flooding for South Carolina, which may get 20 inches of rain.\nWind gusts in the Bay Area, which were about 50 miles an hour early Monday morning, have subsided."}, {"id": "5320f1fe-979d-4479-9dd4-f0111699ff80", "title": "Hurricane Debby live updates : Storm makes landfall in Big Bend Area", "date": "2024-08-05 13:15", "url": "https://www.fox5ny.com/news/hurricane-debby-make-landfall-big-bend-area-bringing-life-threatening-storm-surge-florida", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "After making landfall as a hurricane in the Big Bend Area near Steinhatchee, Florida, Debby has been downgraded to a tropical storm.\nThe 5 p.m. report from the National Hurricane Center puts the storm at 30.5 N 82.9W, moving at 6 mph.\nRon DeSantis said the storm is being blamed for four deaths in Florida.\nHe said Debby will spend three days over the Carolinas, which could create ‘catastrophic’ flooding for South Carolina, which may get 20 inches of rain.\nWind gusts in the Bay Area, which were about 50 miles an hour early Monday morning, have subsided."}, {"id": "6adc3534-049d-4e75-bd70-07fcae64df9e", "title": "Hurricane Debby live updates : Storm makes landfall in Big Bend Area", "date": "2024-08-05 14:45", "url": "https://www.fox29.com/news/hurricane-debby-make-landfall-big-bend-area-bringing-life-threatening-storm-surge-florida", "domain": "fox29.com", "domain_classification": "Unknown", "message": "After making landfall as a hurricane in the Big Bend Area near Steinhatchee, Florida, Debby has been downgraded to a tropical storm.\nThe 5 p.m. report from the National Hurricane Center puts the storm at 30.5 N 82.9W, moving at 6 mph.\nRon DeSantis said the storm is being blamed for four deaths in Florida.\nHe said Debby will spend three days over the Carolinas, which could create ‘catastrophic’ flooding for South Carolina, which may get 20 inches of rain.\nWind gusts in the Bay Area, which were about 50 miles an hour early Monday morning, have subsided."}, {"id": "e2388c0a-d134-4de8-a29e-5d32ce0e270e", "title": "Where is Hurricane Debby ? Follow the storms path and how it could affect Tennessee", "date": "2024-08-05 16:00", "url": "https://www.yahoo.com/news/where-hurricane-debby-storms-path-151425007.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Where is Hurricane Debby?\nWill Hurricane Debby impact Tennessee?\nThe Weather Channel's intrepid meteorologist setup station in Charleston, South Carolina, as Hurricane Debby made landfall on Monday.\nThis article originally appeared on Nashville Tennessean: Where is Hurricane Debby?\nThe storms path, Tennessee impact"}, {"id": "bd05fef0-82f0-41e5-8f71-2945e2e1c97c", "title": "Debby impacts Florida", "date": "2024-08-05 16:00", "url": "https://www.yahoo.com/news/debby-impacts-florida-151303776.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is 35 miles west of Lake City Florida and 120 miles south of Valdosta Georgia, with maximum sustained wind of 70 mph.\nYESTERDAY (Sunday):Yesterday, Debby found new strength and evolved from a tropical storm into a Category 1 hurricane with sustained winds of 70 miles per hour.\nCHANGES WITH THIS ADVISORY:The Storm Surge Warning from west of the Ochlockonee River, Florida to Indian Pass, Florida is discontinued.\nThe Hurricane Warning from Yankeetown to Indian Pass, Florida is changed to a Tropical Storm Warning.\nHAZARDS AFFECTING LAND:WIND: Tropical storm conditions will continue over portions of the tropical storm warning area along the Florida Gulf coast today, and begin along portions of the tropical storm warning area along the Atlantic coast this afternoon."}, {"id": "366d50e1-00ad-425d-8e75-8dd606d2c21d", "title": "Debby impacts Florida", "date": "2024-08-05 16:45", "url": "https://www.yahoo.com/news/debby-impacts-florida-151303281.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is 30 miles southeast of Valdosta Georgia, with maximum sustained wind of 50 mph.\n\"On the forecast track, the center will move across southeastern Georgia tonight and Tuesday, move offshore of the South Carolina coast by late Tuesday and Wednesday, and approach the South Carolina coast on Thursday.\"\nCHANGES WITH THIS ADVISORY:The Storm Surge Warning along the Florida Gulf Coast from the Aucilla River to Aripeka is discontinued.\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nHAZARDS AFFECTING LAND:WIND: Tropical storm conditions are expected over portions of the tropical storm warning area along the Florida and Georgia Atlantic coast through tonight."}, {"id": "1cf6d01f-9a16-4647-a78a-6943b0f4c679", "title": "Hurricane Debby : Storm makes landfall", "date": "2024-08-05 14:00", "url": "https://www.kiro7.com/news/trending/hurricane-debby-storm-makes-landfall/BZFV2DER5VG2NCEFOJSQHTRP7A/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "06b6d49e-8dc2-44bf-9363-49f3e4598eec", "title": "Hurricane Debby makes landfall on Florida Big Bend ; tornadoes still a threat across state", "date": "2024-08-05 14:30", "url": "https://www.yahoo.com/news/hurricane-debby-makes-landfall-florida-093400522.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Debby made landfall on Florida’s Big Bend early Monday before dropping back to a tropical storm as it moved inland, according to the National Hurricane Center.\nThe system had grown since becoming Tropical Depression Four late Friday and developing into a tropical storm on Saturday.\nIf it were to form into a named storm, it could take on the name Tropical Storm Ernesto.\nTropical Storm Debby became the fourth official system of the 2024 Atlantic hurricane season.\nThe others were Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris."}, {"id": "d508a9f2-b885-46eb-853e-16e5a3b026b8", "title": "Tropical Storm Debby Hits Florida With Floods , Threat Of Record Rain In Georgia And The Carolinas", "date": "2024-08-05 22:30", "url": "https://www.theyeshivaworld.com/news/general/2302889/tropical-storm-debby-hits-florida-with-floods-threat-of-record-rain-in-georgia-and-the-carolinas.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby slammed Florida with catastrophic flooding and was blamed for at least four deaths, with Georgia and South Carolina next in line as the system rips across the southeastern United States.\nDebby made landfall early Monday as a Category 1 hurricane over the gulf coast of Florida.\nVice President Kamala Harris has postponed a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "e3a651ab-ef5b-46eb-9919-c57f674eac4b", "title": "Debby downgrades to tropical storm , but significant flood risk remains high for coastal South Carolina", "date": "2024-08-05 17:45", "url": "https://www.yahoo.com/news/debby-downgrades-tropical-storm-significant-152050523.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. (WCBD) – Hurricane Debby was downgraded to a tropical storm Monday after making landfall near Florida’s Big Bend region as a category 1 storm.\nThe storm will trek across Florida and into southeast Georgia where Debby will reemerge over the Atlantic and off the South Carolina coast at a slow pace.\n“Extremely heavy rain, gusty wind, isolated tornadoes, and potentially severe flooding are threat,” said Storm Team 2 Meteorologist Josh Marthers.\nWith heavy rain and wet ground, there will be an increased threat of downed trees and power outages.\nSTORM SURGEThreat Level: ElevatedHeavy rain and elevated tides will combine to increase the risk of flooding along the coast."}, {"id": "0f52849a-3c1d-4221-8ae7-d6db10aef54b", "title": "Hurricane Debby Moves Inland , Starts Slow Crawl to Carolinas", "date": "2024-08-05 15:45", "url": "https://www.theepochtimes.com/us/floridians-told-to-expect-possible-10-day-rain-event-5699914", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Ron DeSantis has warned of expected flooding in northern Florida as former Hurricane Debby passes out of the state.\nPower companies across Florida, such as Duke Energy, had linemen staged to respond to the storm.\nshow moreDebby reduced to Tropical Storm, turns to Georgia, South Carolina T.J. Muscaro By 7 hours ago Debby is once again a Tropical Storm as it moves deeper into the Florida Panhandle, according to the National Hurricane Center’s (NHC) 11 a.m. advisory.\nEven before it evolved from a tropical storm, Hurricane Debby delivered immense amounts of rain and wind across the Florida Gulf Coast and inland counties over the past few days.\nshow morePeople look out at the gathering storm before the possible arrival of Tropical Storm Debby, which is strengthening as it moves through the Gulf of Mexico on August 04, 2024 in Cedar Key, Florida."}, {"id": "17272e1e-cddc-440d-9870-b375bbba3d7b", "title": "Hurricane Debby live updates : Storm makes landfall in Big Bend Area", "date": "2024-08-05 14:45", "url": "https://www.fox32chicago.com/news/hurricane-debby-make-landfall-big-bend-area-bringing-life-threatening-storm-surge-florida", "domain": "fox32chicago.com", "domain_classification": "Unknown", "message": "After making landfall as a hurricane in the Big Bend Area near Steinhatchee, Florida, Debby has been downgraded to a tropical storm.\nThe 5 p.m. report from the National Hurricane Center puts the storm at 30.5 N 82.9W, moving at 6 mph.\nRon DeSantis said the storm is being blamed for four deaths in Florida.\nHe said Debby will spend three days over the Carolinas, which could create ‘catastrophic’ flooding for South Carolina, which may get 20 inches of rain.\nWind gusts in the Bay Area, which were about 50 miles an hour early Monday morning, have subsided."}, {"id": "e2f872ff-0434-43f6-a1a7-c10b595b081d", "title": "Hurricane Debby : Tropical Storm Debby becomes a hurricane", "date": "2024-08-05 04:30", "url": "https://www.yahoo.com/news/hurricane-debby-tropical-storm-debby-033724576.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has now become a hurricane.\nAccording to the National Hurricane Center, as of 11 p.m., Debby has become a hurricane as it approaches the northeastern Gulf Coast.\nAccording to Severe Weather Team 2 Chief Meteorologist Brad Nitz, Debby is expected to cause historic flooding.\nOn Sunday morning, Debby was about 155 miles southwest of Tampa, Florida, and about 205 miles south-southwest of Cedar Key, Florida.\nFor some, the name Debby summons bad memories of a 2012 tropical storm of the same name that caused $250 million in losses and eight deaths, including seven in the Sunshine State."}, {"id": "505c0668-60cb-4df2-9620-43377383b2e9", "title": "Ohio Task Force 1 mobilizing in preparation for Hurricane Debby", "date": "2024-08-05 02:45", "url": "https://www.wsaz.com/2024/08/05/ohio-task-force-1-mobilizing-preparation-hurricane-debby/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "(WSAZ) -Ohio Task Force 1 deployed Sunday evening as Tropical Storm Debby barrels towards Flordia’s gulf coast.\nForecasters expect the tropical storm to strengthen rapidly to a Category 1 Hurricane before making landfall on Monday morning.\nThe National Hurricane Center expects the weather system to drench Florida, estimating more than a foot of rain and flash flooding through Wednesday morning.\nDebby is the fourth named storm of the North Atlantic hurricane season.\n47 members were deployed with skillsets in various search and rescue operations, as well as HazMat, medical, logistics and safety, communications, and planning."}, {"id": "834f74c4-8fb9-4f8c-ac82-fc3aecd40dee", "title": "  Catfish in driveway  as Hurricane Debby slams Florida ; video", "date": "2024-08-05 21:30", "url": "https://ftw.usatoday.com/2024/08/catfish-in-driveway-hurricane-debby-slams-florida", "domain": "ftw.usatoday.com", "domain_classification": "Unknown", "message": "A St. Petersburg, Fla., resident on Sunday shared footage showing catfish floundering in his yard during extensive flooding caused by Hurricane Debby.\n“Catfish in my driveway as streets turn into rivers!” Dan Ciarletta described via X.\nAs of Monday morning, Hurricane Debby hade made landfall along the Gulf Coast and was causing extensive flooding that seemed to flush fish from area waterways.\nCiarletta posted two videos showing catfish wriggling in shallow water outside his home.\nCiarletta assumed that the catfish were flushed onto his neighborhood streets via flooded storm drains."}, {"id": "f5d4707f-2049-45d1-b3c9-d583efb444f5", "title": "Debby impacts Florida", "date": "2024-08-05 16:00", "url": "https://www.yahoo.com/news/debby-impacts-florida-151303241.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "With sustained winds of 50 miles per hour, Debby has downgraded from a Category 1 hurricane to a tropical storm.\nTropical Storm Debby is 30 miles southeast of Valdosta Georgia, with maximum sustained wind of 50 mph.\n\"On the forecast track, the center will move across southeastern Georgia tonight and Tuesday, move offshore of the South Carolina coast by late Tuesday and Wednesday, and approach the South Carolina coast on Thursday.\"\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nHAZARDS AFFECTING LAND:WIND: Tropical storm conditions are expected over portions of the tropical storm warning area along the Florida and Georgia Atlantic coast through tonight."}, {"id": "0397d4e9-206f-4edf-b687-cbeb67d783c7", "title": "Debby blamed for four deaths in Florida ; storm moving over northern part of state", "date": "2024-08-05 22:15", "url": "https://www.foxla.com/news/hurricane-debby-make-landfall-big-bend-area-bringing-life-threatening-storm-surge-florida", "domain": "foxla.com", "domain_classification": "Unknown", "message": "After making landfall as a hurricane in the Big Bend Area near Steinhatchee, Florida, Debby has been downgraded to a tropical storm.\nThe 5 p.m. report from the National Hurricane Center puts the storm at 30.5 N 82.9W, moving at 6 mph.\nRon DeSantis said the storm is being blamed for four deaths in Florida.\nHe said Debby will spend three days over the Carolinas, which could create ‘catastrophic’ flooding for South Carolina, which may get 20 inches of rain.\nWind gusts in the Bay Area, which were about 50 miles an hour early Monday morning, have subsided."}, {"id": "898239a9-cd54-4c42-b6d5-845fd54f55a3", "title": "As storm Debby strengthens , US southeast braces for  historic  rainfall", "date": "2024-08-05 02:30", "url": "https://www.mtdemocrat.com/news/national/as-storm-debby-strengthens-us-southeast-braces-for-historic-rainfall/article_a1e92537-e4ff-5756-9aae-9127b75ad6db.html", "domain": "mtdemocrat.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "a2e0f493-b8df-4ba2-a4c1-281c50acf8ca", "title": "Ron DeSantis Says This Is What You Should Do If Your Power Goes Out As Florida Braces For Tropical Storm Debby - Duke Energy ( NYSE : DUK ) ", "date": "2024-08-05 03:00", "url": "https://www.benzinga.com/news/24/08/40151756/ron-desantis-says-this-is-what-you-should-do-if-your-power-goes-out-as-florida-braces-for-tropical-s", "domain": "benzinga.com", "domain_classification": "Unknown", "message": "Florida Governor Ron DeSantis (R) has expressed gratitude to utility linemen, both local and out-of-state, for their readiness to respond to Tropical Storm Debby.\nWhat Happened: On Tuesday, DeSantis took to X to appreciate the efforts of utility linemen who are prepared to work tirelessly to restore power in the wake of Tropical Storm Debby.\nWe appreciate all the utility linemen, from Florida and out-of-state, who are staged and ready to respond to Tropical Storm Debby.\nAuthorities in Florida, Georgia, and South Carolina urged residents to prepare for heavy rain and possible flooding.\nEvacuation orders were issued, and tropical storm warnings extended to parts of Florida, coastal Georgia, and South Carolina."}, {"id": "45ba1a57-6c16-4b00-9fda-4ba4c4ec36ae", "title": "Tropical Storm Debby hits Florida with floods , threat of record rain in Georgia and the Carolinas - WSVN 7News | Miami News , Weather , Sports", "date": "2024-08-05 23:00", "url": "https://wsvn.com/news/us-world/tropical-storm-debby-hits-florida-with-floods-threat-of-record-rain-in-georgia-and-the-carolinas/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nVice President Kamala Harris has postponed a scheduled trip to Georgia amid the ongoing effects of Tropical Storm Debby.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "b048bac1-f577-467a-83a3-4c6a39956704", "title": "Debby morphs into a hurricane , landfall expected in Florida | Hurricane Wire", "date": "2024-08-05 13:00", "url": "https://www.postandcourier.com/hurricanewire/hurricane-debby-catastrophic-storm/article_1b7f0152-530f-11ef-8b6e-8329f4094d4e.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "From there, Debby is following a northeast track over Florida and into Georgia and South Carolina.\nTropical storm and storm surge warnings are posted along the coast of South Carolina.\nIt's off the charts,\" said Ron Morales with the Charleston-based office of the National Weather Service.\nDebby has lost some strength as it moves over land, reverting to a tropical storm in the late morning of Aug. 5.\nThe National Weather Service is warning that potentially historic levels of rainfall could result in severe and catastrophic flooding."}, {"id": "7972c824-40b9-4219-8e8e-a9ef92b1168d", "title": "Maps show Hurricane Debby path and forecast", "date": "2024-08-05 14:00", "url": "https://www.cbsnews.com/news/hurricane-debby-path-map-forecast-florida-georgia-south-carolina/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby was barreling across northern Florida on Monday after making landfall over the state's Big Bend coast as a Category 1 hurricane.\nEven with the slight dip in intensity, Debby was forecast to bring dangerous storm surge to parts of the Gulf Coast of Florida through Monday afternoon.\nStorm surge threats gradually lessened as the hours passed after Debby's landfall, with forecasters saying by the afternoon that peak surge in that region would look more like 3 to 5 feet.\nThe National Hurricane Center published maps on Monday illustrating the storm surge forecast.\nCoastal places as far south as Bonita Beach could see heavy rainfall coupled with storm surge for the next several days as a result of the tropical storm."}, {"id": "bbee3f31-7a64-45c2-bf68-a12484a96886", "title": "Georgia power outage map : See where the power is out as Hurricane Debby nears", "date": "2024-08-05 13:45", "url": "https://www.yahoo.com/news/georgia-power-outage-map-see-130801347.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Georgia power outage map: See where the power is out as Hurricane Debby nearsHurricane Debby was just inland in Florida's Bid Bend Region as of 8 a.m. Monday, according to the National Hurricane Center.\nA hurricane warning is in effect for the Florida coast from the Yankeetown to Indian Pass, and there are storm surge warnings in effect for other parts of Florida, Georgia, and South Carolina.\nWhile the center is not over Georgia yet, there are storm clouds over the southern cities already and power outages have been reported.\nGeorgia Power also provides an outage map at https://outagemap.georgiapower.com/Hurricane Debby: As storm approaches, these tech tips can help your home from floodsThe center of Hurricane Debby will slowly move across northern Florida and southern Georgia on Monday and Tuesday, and be near the Georgia coast by Tuesday night.\nThis article originally appeared on Augusta Chronicle: Hurricane Debby: Map out Georgia's power outages as storm nears"}, {"id": "1e1db742-4718-474c-b024-fbd9dbd331f6", "title": "Hurricane Debby makes landfall in Florida , but it not done", "date": "2024-08-05 13:45", "url": "https://www.al.com/hurricane/2024/08/hurricane-debby-makes-landfall-in-florida-but-its-not-done.html", "domain": "al.com", "domain_classification": "Unknown", "message": "Hurricane Debby made landfall in Florida on Monday morning and continued to track inland while weakening to a tropical storm on Monday afternoon.\nThe National Hurricane Center said Debby, the second hurricane of 2024 in the Atlantic, moved onshore around 6 a.m. CDT Monday near Steinhatchee, Fla., in the Big Bend region.\nThe hurricane center estimated Debby’s winds to be around 80 mph at the time of landfall.\nDebby’s winds had fallen to 50 mph as of Monday afternoon, the hurricane center said.\n* A Tropical Storm Watch is in effect from north of the South Santee River, S.C., to Cape Fear, N.C."}, {"id": "b496d20a-bcc6-4168-b55b-f29108884c1b", "title": "Hurricane Debby makes landfall in northern Florida as Category 1 storm with major flooding expected in Southeast US", "date": "2024-08-05 13:15", "url": "https://abcnews.go.com/US/wireStory/hurricane-debby-makes-landfall-northern-florida-category-1-112571797", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Hurricane Debby makes landfall in northern Florida as Category 1 storm with major flooding expected in Southeast USHurricane Debby makes landfall in northern Florida as Category 1 storm with major flooding expected in Southeast US"}, {"id": "5216ff17-27b2-405e-a3a3-69ecf872f678", "title": "Storm Debby Seen Strengthening As It Heads To Florida", "date": "2024-08-05 03:30", "url": "https://menafn.com/1108516055/Storm-Debby-Seen-Strengthening-As-It-Heads-To-Florida", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Mike Brennan, an NHC briefer, said yesterday that the entire west coast of Florida is being placed under tropical storm warning.\nHe urged locals, particularly on the northwestern coast and Florida panhandle, to“find a safe place to be in by nightfall”.\nThe centre of Tropical Storm Debby will move across the eastern Gulf of Mexico and reach the Florida Big Bend coast this morning, it added.\nDebby is then expected to move slowly across northern Florida and southern Georgia today and tomorrow, it said.\nA tropical storm warning is in effect for extreme southern Florida, stretching as far north as the Fort Myers area crushed by Hurricane Ian in 2022."}, {"id": "1e510630-0495-455b-94a0-7607a3625608", "title": "Debby approaches South Carolina , threatening  historic  rain", "date": "2024-08-05 20:00", "url": "https://www.postandcourier.com/aikenstandard/hurricanewire/hurricane-debby-south-carolina-charleston-flooding/article_1b7f0152-530f-11ef-8b6e-8329f4094d4e.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "Areas from Savannah to Charleston could see 10-20 inches of rain across the region, with localized amounts as high as 30 inches, over the next few days.\nThe National Weather Service is warning that the potentially historic levels of rainfall could result in severe and catastrophic flooding.\nThe heaviest rain is expected to last at least until Aug. 8, though it could extend beyond that.\nOfficials said that some areas of the state could experience rainfall amounts they've never experienced, especially in the Lowcountry.\nA similar effect happened with an October 2015 storm system, resulting in what would become known as the \"thousand-year flood.\""}, {"id": "2e9b4604-af41-43bd-9663-1e2d18299ff3", "title": "Maps show Hurricane Debby path and forecast", "date": "2024-08-05 15:45", "url": "https://www.aol.com/maps-show-hurricane-debbys-path-132357326.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby was barreling across northern Florida on Monday after making landfall over the state's Big Bend coast as a Category 1 hurricane.\nEven with the slight dip in intensity, Debby was forecast to bring dangerous storm surge to parts of the Gulf Coast of Florida through Monday afternoon.\nStorm surge threats gradually lessened as the hours passed after Debby's landfall, with forecasters saying by the afternoon that peak surge in that region would look more like 3 to 5 feet.\nThe National Hurricane Center published maps on Monday illustrating the storm surge forecast.\nCoastal places as far south as Bonita Beach could see heavy rainfall coupled with storm surge for the next several days as a result of the tropical storm."}, {"id": "301d0f98-d87f-46b0-8ccf-c3835ecb52cb", "title": "The Latest : Debby knocks out power to hundreds of thousands in Florida , Georgia", "date": "2024-08-05 20:30", "url": "https://www.clickondetroit.com/news/national/2024/08/05/the-latest-debby-knocks-out-power-to-hundreds-of-thousands-in-florida-georgia/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "No evacuations planned for now in South Carolina, officials sayState officials don’t plan any evacuations in South Carolina for now as Tropical Storm Debby slowly spins toward the state.\nBiden approves request from South Carolina's governor for emergency declarationThe White House said Monday that President Joe Biden has approved a request from South Carolina Gov.\nFlooding and power outages are expected to start Tuesday and continue through the rest of the week, according to North Carolina Emergency Management officials.\nDebby made landfall in Florida on Monday as a Category 1 hurricane and was expected to bring potentially record-setting rainfall to Georgia and South Carolina as it heads east.\nForecasters are still warning that heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia."}, {"id": "26156f34-f546-4ed7-98e6-5405a3c4b949", "title": "Debby strengthens to Category 1 hurricane , expected to make landfall in Florida", "date": "2024-08-05 05:15", "url": "https://www.nbcnews.com/news/weather/debby-strengthens-category-1-hurricane-expected-make-landfall-florida-rcna165099", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Hurricane Debby made landfall as a Category 1 hurricane on Monday morning, with winds of 80mph and after forecasters had warned of life-threatening storm surges and widespread flooding.\nA hurricane warning is in place for Florida's Gulf Coast, from Yankeetown to Indian Pass, while large parts of the state's coastline are under a tropical storm warning and storm surge watches.\nJoe Raedle / Getty ImagesThe hurricane is forecast to bring a storm surge of 2 to 10 feet in certain areas, and heavy rain through Friday morning.\nThe University of South Florida in St. Petersberg and the University of Florida in Gainesville, in the northern half of the state, said they would be closed Monday.\nDeSantis compared Debby’s path to that of Hurricane Idalia, the Category 4 storm that caused significant damage in north Florida last year."}, {"id": "9ea88e28-d129-43db-8bbd-186c4f33d353", "title": "Hurricane Debby Makes Landfall In Florida | News Radio 1200 WOAI", "date": "2024-08-05 13:15", "url": "https://woai.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "woai.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "6998a13a-1cb4-46a8-9ab4-4a81ad0b3a0f", "title": "Hurricane Debby Makes Landfall In Florida | News / Talk 1130 WISN", "date": "2024-08-05 13:15", "url": "https://newstalk1130.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "newstalk1130.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "7fc0deb8-0f8e-4df5-90a2-18b5fb3f8a81", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 16:00", "url": "https://600kcol.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "600kcol.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "617c00a8-346e-47f5-aa1e-793194d5e30a", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 16:00", "url": "https://kfiam640.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "e828c9d2-151c-489a-ad81-982833774894", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 17:30", "url": "https://newstalk1049.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "newstalk1049.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "eeb2e433-2fd5-4cb3-a366-8137e8e53a91", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 15:00", "url": "https://talkradio1059.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "talkradio1059.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "dd15a64f-c34c-4a59-99bc-6ae9469b68ed", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 15:00", "url": "https://wjjs.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "wjjs.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "dc7f8ce6-a1ea-4bf8-a633-cfc3839f26aa", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 17:45", "url": "https://1440wgig.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "1440wgig.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "f1ae2339-c7eb-420e-9f10-84e34f1384c5", "title": "Hurricane Debby Makes Landfall In Florida | NewsTalk WMEQ", "date": "2024-08-05 17:45", "url": "https://wmeq.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "wmeq.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "061c234e-9b6a-4319-a339-0028739a615c", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 17:45", "url": "https://newsradio710.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "newsradio710.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "c3ef6425-dd98-4794-901a-947b3f52dd48", "title": "Hurricane Debby Makes Landfall In Florida | News Talk 1090 WKBZ - AM", "date": "2024-08-05 17:15", "url": "https://newstalk1090.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "newstalk1090.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "1f2aeb19-b6ef-42c1-80f7-3c9aed337d06", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 13:15", "url": "https://kprcradio.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "kprcradio.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "53dcaace-819a-4603-a076-ba1a3668e27f", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 14:45", "url": "https://945wpti.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "945wpti.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "cb0a490a-6a0a-4a4a-b801-714d00163276", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 14:45", "url": "https://jetradio1400.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/?pname=www.jetradio1400.com&sc=dnsredirect", "domain": "jetradio1400.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "da92dc8b-b2bc-49a9-b528-e42d2ec30ad0", "title": "Hurricane Debby Makes Landfall In Florida | NEWSRADIO 1040 WHO", "date": "2024-08-05 14:45", "url": "https://whoradio.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "397bfdea-4f55-4aa7-a011-560f38506566", "title": "Hurricane Debby could bring heavy rain to much of NC this week . Here when and where . ", "date": "2024-08-05 16:00", "url": "https://www.yahoo.com/news/hurricane-debby-could-bring-heavy-140827494.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby could bring heavy rain to much of NC this week.\nUpdate: Debby, which was first categorized as a hurricane, weakened to a tropical storm around 11 a.m. Monday.\nFrom there it’s expected to move north into North Carolina, still a tropical storm.\nFlash flooding is possible in all but extreme western North Carolina this week as what becomes Tropical Storm Debby moves slowly over the Southeast.\nAlong the coast, dangerous storm surge and wind impacts are expected from Florida all the way to North Carolina through midweek."}, {"id": "86bb8628-ae37-4c3e-aa44-b65e59ee9ea0", "title": "Cooper declares state of emergency ahead of Debby", "date": "2024-08-05 23:00", "url": "https://www.witn.com/2024/08/05/cooper-declares-state-emergency-ahead-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "RALEIGH, N.C. (WITN) - Governor Roy Cooper last this afternoon declared a state of emergency ahead of the remnants of Hurricane Debby hitting the state.\nCooper said the storm has the potential for life-threatening flash flooding, river flooding, wind gusts up to 40 miles per hour, and coastal impacts.\n“This weather has the potential to bring intense rain and flooding to North Carolina and we are preparing for it,” said Governor Cooper.\n“As the weather becomes more severe, I urge everyone to take precautions and stay safe.”The executive order activates the State Emergency Operations Plan and allows state agencies to take action that ensures the movement of utility vehicles and those carrying essential supplies to get where they need to be.\nCopyright 2024 WITN."}, {"id": "f544c16b-5d16-4930-81f3-d0255dddad50", "title": "Hurricane Debby makes landfall in northern Florida as Category 1 storm with major flooding expected in Southeast US", "date": "2024-08-05 12:45", "url": "https://www.gjsentinel.com/news/us/hurricane-debby-makes-landfall-in-northern-florida-as-category-1-storm-with-major-flooding-expected/article_7324a931-7834-506e-9973-d2623f7acf6d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "1b64487d-0e9d-4820-aad0-82776baf5e2c", "title": "Hurricane Debby Makes Landfall In Florida | Talk Radio 98 . 3 WLAC", "date": "2024-08-05 13:15", "url": "https://wlac.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "wlac.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "937a38d2-de3e-44f9-85ef-1273403bf08b", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 17:30", "url": "https://wtkg.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "wtkg.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "9fd7257f-f5b4-4839-8fde-3138f82f5bff", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 16:15", "url": "https://960weli.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "960weli.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "5e64786b-68e3-462b-9118-ad4d6e27c181", "title": "Hurricane Debby Makes Landfall In Florida | News Radio 94 . 3 WSC", "date": "2024-08-05 13:45", "url": "https://943wsc.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "943wsc.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "2d469b60-a884-4279-8db5-e6d126da04de", "title": "Hurricane Debby Makes Landfall In Florida", "date": "2024-08-05 13:45", "url": "https://wgiram.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "wgiram.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "f3cdab20-a229-4833-ab4d-ad1397113e42", "title": "Hurricane Debby Makes Landfall In Florida | Newsradio 970 KFBX - AM", "date": "2024-08-05 13:45", "url": "https://970kfbx.iheart.com/content/2024-08-05-hurricane-debby-makes-landfall-in-florida/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Debby downgraded to a tropical storm at around 11:00 a.m. local time, according to the National Weather Center.\n---Debby made landfall as a Category 1 hurricane with sustained wind speeds up to 80 MPH on the Big Bend stretch of Florida's Gulf Coast at 7:00 a.m.\nET on Monday (August 5), the National Hurricane Center announced.\n\"Hurricane #Debby Advisory 12A: Debby Just Inland in the Florida Big Bend Region.\n\"Latest on Hurricane Debby for #Pinellas: Some breaks in the rainfall now, but more rain bands expected throughout the day."}, {"id": "b06c8ad7-ef7e-4725-b7b2-26f59b3ae497", "title": "How did Tropical Storm Debby affect Naples , Fort Myers , Southwest Florida area ? ", "date": "2024-08-05 13:45", "url": "https://www.yahoo.com/news/did-tropical-storm-debby-affect-122402268.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Scenes from Fort Myers Beach on Sunday, Aug. 4, 2024.\nThe outer portions of Tropical Storm Debby flooded coastal streets and other areas including Estero Boulevard on Fort Myers Beach.\nHeavy rains and storm surge from Tropical Storm Debby have caused flooding on Fort Myers Beach properties, including Nervous Nellie's, on Sunday.\nScenes from clean up efforts on Fort Myers Beach on Monday, Aug. 5, 2024.\nContributing: Mark H. Bickel, J. Kyle Foster, Liz Freeman, Mickenzie Hannon, Laura Layden, Cindy McCurry Ross, Andrew West,This article originally appeared on Fort Myers News-Press: Tropical Storm Debby's impact on Naples, Fort Myers, Sanibel, islands"}, {"id": "8b561271-ec28-462d-a664-5e82b9296cb8", "title": "East Coast prepares for Hurricane Debby ;  Deadpool & Wolverine  sets record", "date": "2024-08-05 14:00", "url": "https://www.stltoday.com/news/nation-world/east-coast-prepares-for-hurricane-debby-deadpool-wolverine-sets-record-hot-off-the-wire-podcast/article_a8e1721a-1664-5714-a1a6-662286dad3b5.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The National Hurricane Center of Miami says Debby is located about 60 miles northwest of Cedar Key, Florida, with maximum sustained winds of 80 mph.\nThe hurricane center says Debby is expected to make landfall Monday morning.\nBANGKOK (AP) — Japan's benchmark Nikkei 225 stock index has lost 12.4% in the latest bout of sell-offs that are jolting world markets.\nWASHINGTON (AP) — The hospitality workers’ union UNITE HERE has endorsed Vice President Kamala Harris for president.\nWith a $97M second weekend, 'Deadpool & Wolverine' sets a new high mark for R-rated films."}, {"id": "85efe785-e478-47ce-9432-d00aa35c208f", "title": "Staying prepared for hurricane season", "date": "2024-08-05 14:45", "url": "https://www.postandcourier.com/kingstree/kingstree/community-news/staying-prepared-for-hurricane-season/article_358193c4-532a-11ef-8d1d-2f77b7b98234.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "Kingstree, SC (29556)TodayThundershowers overnight following a period of rain early.\nWinds ENE at 5 to 10 mph.\nRainfall may reach one inch..TonightThundershowers overnight following a period of rain early.\nWinds ENE at 5 to 10 mph.\nRainfall may reach one inch."}, {"id": "74885c66-326b-4d9f-9f69-854f8ff84da3", "title": "Heavy rain from Debby expected to begin in Savannah area Monday ; 10 - 20 inches possible", "date": "2024-08-05 13:45", "url": "https://www.yahoo.com/news/heavy-rain-debby-expected-begin-130227912.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Heavy rain from Debby expected to begin in Savannah area Monday; 10-20 inches possibleHeavy rain is expected to begin in the Savannah area as early as Monday morning with tropical-force winds of 40 mph or more likely moving into the area sometime Monday night, forecasters warned Monday.\n'It scares me': Savannah Mayor Van Johnson, CEMA address public ahead of Tropical Storm DebbyHeavy rain is expected in the Savannah area through Thursday as Debby loses speed after moving over Florida and into Georgia.\nAs of early Monday, the Savannah area is under tropical storm and storm surge warnings, and flood and tornado watches.\nAs much as 7 inches of rain is possible in some areas by Tuesday morning, with another 6 inches following on Tuesday and into Tuesday night, NWS said.\nThis article originally appeared on Savannah Morning News: Rain from Debby to move into Savannah area Monday followed by wind"}, {"id": "09c087fd-ac56-44ce-b4df-71a7f2aab8e0", "title": "East Coast prepares for Hurricane Debby ;  Deadpool & Wolverine  sets record", "date": "2024-08-05 13:45", "url": "https://journalstar.com/news/nation-world/east-coast-prepares-for-hurricane-debby-deadpool-wolverine-sets-record-hot-off-the-wire-podcast/article_5026f6be-dd05-5954-93c2-9b35040a3140.html", "domain": "journalstar.com", "domain_classification": "Unknown", "message": "The National Hurricane Center of Miami says Debby is located about 60 miles northwest of Cedar Key, Florida, with maximum sustained winds of 80 mph.\nThe hurricane center says Debby is expected to make landfall Monday morning.\nBANGKOK (AP) — Japan's benchmark Nikkei 225 stock index has lost 12.4% in the latest bout of sell-offs that are jolting world markets.\nWASHINGTON (AP) — The hospitality workers’ union UNITE HERE has endorsed Vice President Kamala Harris for president.\nWith a $97M second weekend, 'Deadpool & Wolverine' sets a new high mark for R-rated films."}, {"id": "f937172f-9f30-4aad-ba8b-49c874ef2673", "title": "Excessive heat returns", "date": "2024-08-05 12:45", "url": "https://www.newschannel5.com/weather/excessive-heat-returns-this-week-8-5-24", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "Scorching WorkweekForecast:Tonight: Clear Sky, Patchy Fog | Low: 73 | LightTomorrow: Mostly Sunny | High: 97 | N 5-10In-Depth:Hot and humid conditions return this week.\nHighs for your Monday will climb well above average into the mid 90s.\nWTVFThe other big story is Hurricane Debby.\nThe latest track keeps impacts from the storm east of the NewsChannel 5 coverage area.\nBut, those areas will see concerns for flooding."}, {"id": "4197353b-0975-4d0b-8c61-0ea75ea31094", "title": "Tropical Storm Debby blew $1 million worth of cocaine onto Florida Keys beach , Border Patrol says", "date": "2024-08-05 19:30", "url": "https://abc11.com/post/tropical-storm-debby-blew-1-million-worth-cocaine-florida-keys-beach-border-patrol-says/15146883/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby blew $1 million worth of cocaine onto Florida Keys beach, Border Patrol saysAs thousands of Floridians braced for the impact of Tropical Storm Debby on Monday, Border Patrol seized dozens of packages of cocaine.\nThe storm's outer skirt brought high winds and storms to the Florida Keys Monday morning.\nAuthorities received a call from a Good Samaritan saying he found drug packages on a Florida Keys beach.\nBorder Patrol officers seized 70 pounds of cocaine on the beach that had blown out by Tropical Storm Debby.\n@USBPChiefMIPREAD ALSO | Hurricane Debby downgraded to tropical storm after making landfall in Florida as Category 1 storm"}, {"id": "18a078f2-20fc-4f5c-9fed-6a816425292f", "title": "Travel impacted by Debby as deadly storm forces thousands of flight cancellations , delays", "date": "2024-08-05 20:45", "url": "https://www.fox13news.com/news/travel-impacted-debby-deadly-storm-forces-thousands-flight-cancellations-delays", "domain": "fox13news.com", "domain_classification": "Unknown", "message": "Debby, which was downgraded from a hurricane to tropical storm after making landfall along Florida's Big Bend, was impacting travel across the U.S. starting over the weekend.\nIs my flight to Florida canceled because of Debby?\n(FOX Weather)With now-Troical Storm Debby continuing to funnel in damaging winds and flooding rain to Florida and the Southeast, thousands of flights have once again been impacted.\nAnd as deadly Tropical Storm Debby slowly creeps farther north, flights are now being impacted at Charlotte Douglas International Airport (CLT) in the mid-Atlantic.\nAt least 4 dead as Debby weakens to tropical stormAt least four deaths have been attributed to Hurricane Debby."}, {"id": "50c29c45-e4c4-42d2-83ee-9eaccdc429b0", "title": "Images of flooding from Topical Storm Debby", "date": "2024-08-05 03:45", "url": "https://winknews.com/2024/08/04/images-of-flooding-from-tropical-storm-debby/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "While it will hit North Florida, it left serious flooding in its wake as it passed Southwest Florida as a tropical storm.\nThe storm moved up the Gulf of Mexico Sunday, and though the center of the storm’s circulation was off land, Southwest Florida received several inches of rainfall.\nThe county saw numerous road closures throughout the day.\nTo the south, Collier County saw bridges closed in Marco Island and Naples.\nBy nighttime, the worst of the storm had passed, but forecasters caution that’s not to rule out powerful cells of rain and wind from the outer bands of the storm as it continues moving northward."}, {"id": "1686e573-8d2a-48b0-80a7-b528b12a5597", "title": "East Coast prepares for Hurricane Debby ;  Deadpool & Wolverine  sets record", "date": "2024-08-05 13:45", "url": "https://pressofatlanticcity.com/news/nation-world/east-coast-prepares-for-hurricane-debby-deadpool-wolverine-sets-record-hot-off-the-wire-podcast/article_a1a33f4f-e6e8-5ebd-b623-f5efaad3ee84.html", "domain": "pressofatlanticcity.com", "domain_classification": "Unknown", "message": "The National Hurricane Center of Miami says Debby is located about 60 miles northwest of Cedar Key, Florida, with maximum sustained winds of 80 mph.\nThe hurricane center says Debby is expected to make landfall Monday morning.\nBANGKOK (AP) — Japan's benchmark Nikkei 225 stock index has lost 12.4% in the latest bout of sell-offs that are jolting world markets.\nWASHINGTON (AP) — The hospitality workers’ union UNITE HERE has endorsed Vice President Kamala Harris for president.\nWith a $97M second weekend, 'Deadpool & Wolverine' sets a new high mark for R-rated films."}, {"id": "16234352-f584-42c5-812a-ac9966f62db0", "title": "13 - year - old killed after tree falls into mobile home during Hurricane Debby", "date": "2024-08-05 18:45", "url": "https://ktul.com/news/nation-world/13-year-old-killed-after-tree-falls-into-mobile-home-during-hurricane-debby-levy-county-sheriffs-office-florida-department-of-public-safety-clean-up-damage-hazards-flooding-storm-surge", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A teenager is dead after a tree fell into a mobile home as Hurricane Debby hit the coast of Florida.\nThe said deputies responded around 8 a.m. and found the 13-year-old crushed inside the home.\nOur thoughts and prayers are with this family as they deal with this tragedy,\" a news release stated.\nThe storm is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season."}, {"id": "6637d2df-dd31-4c98-a8b5-cf7d7a2c4334", "title": "Hurricane Debby hits Florida , threatens major flooding", "date": "2024-08-05 14:00", "url": "https://www.batemansbaypost.com.au/story/8718516/hurricane-debby-hits-florida-threatens-major-flooding/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "\"Right now, we are to trying secure everything from floating away,\" said Sheryl Horne, whose family owns the Shell Island Fish Camp along the Wakulla River in St. Marks, Florida, where some customers moved their boats inland."}, {"id": "e353fcc1-da4b-4896-9119-a186406050bf", "title": "Hurricane Debby hits Florida , threatens major flooding", "date": "2024-08-05 12:45", "url": "https://www.newcastleherald.com.au/story/8718516/hurricane-debby-hits-florida-threatens-major-flooding/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "\"Right now, we are to trying secure everything from floating away,\" said Sheryl Horne, whose family owns the Shell Island Fish Camp along the Wakulla River in St. Marks, Florida, where some customers moved their boats inland."}, {"id": "07ee5488-33f9-44bd-b2f8-a17bc2b613d2", "title": "East Coast prepares for Hurricane Debby ;  Deadpool & Wolverine  sets record", "date": "2024-08-05 14:45", "url": "https://helenair.com/news/nation-world/east-coast-prepares-for-hurricane-debby-deadpool-wolverine-sets-record-hot-off-the-wire-podcast/article_3f0ff3ae-513a-5226-847b-d6cf9dd2f904.html", "domain": "helenair.com", "domain_classification": "Unknown", "message": "The National Hurricane Center of Miami says Debby is located about 60 miles northwest of Cedar Key, Florida, with maximum sustained winds of 80 mph.\nThe hurricane center says Debby is expected to make landfall Monday morning.\nBANGKOK (AP) — Japan's benchmark Nikkei 225 stock index has lost 12.4% in the latest bout of sell-offs that are jolting world markets.\nWASHINGTON (AP) — The hospitality workers’ union UNITE HERE has endorsed Vice President Kamala Harris for president.\nWith a $97M second weekend, 'Deadpool & Wolverine' sets a new high mark for R-rated films."}, {"id": "0f0afbd3-e227-441c-b00e-170ab487408c", "title": "East Coast prepares for Hurricane Debby ;  Deadpool & Wolverine  sets record", "date": "2024-08-05 17:30", "url": "https://journaltimes.com/news/nation-world/east-coast-prepares-for-hurricane-debby-deadpool-wolverine-sets-record-hot-off-the-wire-podcast/article_20a293c6-88b1-52e9-89dc-3eef5f12b016.html", "domain": "journaltimes.com", "domain_classification": "Unknown", "message": "The National Hurricane Center of Miami says Debby is located about 60 miles northwest of Cedar Key, Florida, with maximum sustained winds of 80 mph.\nThe hurricane center says Debby is expected to make landfall Monday morning.\nBANGKOK (AP) — Japan's benchmark Nikkei 225 stock index has lost 12.4% in the latest bout of sell-offs that are jolting world markets.\nWASHINGTON (AP) — The hospitality workers’ union UNITE HERE has endorsed Vice President Kamala Harris for president.\nWith a $97M second weekend, 'Deadpool & Wolverine' sets a new high mark for R-rated films."}, {"id": "8a735c3a-0aa3-44b1-845e-eba4ca9aa215", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend", "date": "2024-08-05 14:00", "url": "https://tampabaysmix.iheart.com/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "tampabaysmix.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "e211bd38-f63f-4290-b11e-7cc844364f73", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend", "date": "2024-08-05 13:00", "url": "https://wccfradio.iheart.com/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "wccfradio.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "609f99ed-c7a3-4f1e-8f9d-10272b13e34d", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend | 98 . 7 The Gator", "date": "2024-08-05 18:45", "url": "https://gatorrocks.iheart.com/featured/operation-stormwatch-916/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "gatorrocks.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "221eae9a-2dfc-4c92-bdb6-cb5dcfa4be1b", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend | Real Radio 104 . 1", "date": "2024-08-05 12:30", "url": "https://realradio.iheart.com/featured/florida-news/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "realradio.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "e10e9bd5-9f4c-4b63-8b35-64accf87bb1b", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend", "date": "2024-08-05 12:45", "url": "https://beat1053.iheart.com/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "beat1053.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "72f1286f-af11-4c8a-be74-d108573f72f9", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend", "date": "2024-08-05 13:45", "url": "https://991wqik.iheart.com/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "991wqik.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "e63e20aa-3e49-4240-8e66-50aa81fd1c44", "title": "Hurricane Debby Nearing Landfall In Florida Big Bend | Magic 107 . 7", "date": "2024-08-05 13:45", "url": "https://magic107.iheart.com/content/2024-08-05-hurricane-debby-nearing-landfall-in-floridas-big-bend/", "domain": "magic107.iheart.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Storm Surge Warning means there is a danger of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov.\nA Storm Surge Watch means there is a possibility of life-threatening inundation, from rising water moving inland from the coastline.\nFor a depiction of areas at risk, please see the National Weather Service Storm Surge Watch/Warning Graphic, available at hurricanes.gov."}, {"id": "1fc64c53-c56c-46d4-9c0f-bb987a0bb3c5", "title": "Horry County moves to OPCON2 in preparation for Debby", "date": "2024-08-05 18:30", "url": "https://wpde.com/news/local/horry-county-hurricane-debby-opcon-2-tropical-storm-rain-flooding-abc15-weather-authority-team-emergency-management-wind-tornado-risk-monday-august-5-2024", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Horry County moved to OPCON2 Monday ahead of Hurricane Debby's arrival in the Carolinas.\nThe move means the county is operating in a \"heightened state of awareness with emergency plans beginning to be implemented.\"\nThe Horry County Emergency Operations Center is not currently activated, however, action will be taken as necessary.\nREAD MORE:In anticipation of possible impacts, Horry Emergency Management reminds all residents to prepare by:Surveying your property to mitigate potential flooding, such as making sure storm drains and gutters are clear of debris.\nFor the latest Debby update from the ABC15 Weather Authority Team,"}, {"id": "2596fddb-4dad-457a-9f29-d90d2fdda0cf", "title": "Hurricane Debby takes aim at Florida Gulf Coast , expected to slog up East Coast", "date": "2024-08-05 06:00", "url": "https://www.timeslive.co.za/news/world/2024-08-05-hurricane-debby-takes-aim-at-floridas-gulf-coast-expected-to-slog-up-east-coast/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "85fbcf5c-8376-4dcf-a1d6-30c5863f1094", "title": "Weather Evacuations : Tropical Storm Debby to Become Hurricane , Make Florida Landfall by Monday", "date": "2024-08-05 02:00", "url": "https://www.breitbart.com/weather/2024/08/04/weather-evacuations-tropical-storm-debby-to-become-hurricane-make-florida-landfall-by-monday/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby could be upgraded to hurricane status by Monday as it heads toward Florida from the Gulf of Mexico, weather officials have predicted.\nPortions of Southwest Florida are already feeling the storm’s impact even before it makes it to land, with officials issuing tornado warnings, watches, and evacuations as the wind and rainfall pick up, FOX Weather reported.\nAccording to the National Hurricane Center (NHC), there is danger of a “life-threatening storm surge” along parts of Florida’s Gulf Coast, with six to ten feet of flooding expected between the Ochlockonee and Suwanee Rivers.\n“You have a few more hours to get to a safe place before conditions begin to deteriorate by this evening,” Brennan warned, before explaining that Debby is set to flood other parts of the southeastern U.S. after Florida.\nThe NHC is “especially concerned” about the area from Savannah, Georgia, and up through Charleston, South Carolina, to Myrtle Beach due to “excessive rainfall,” the weather expert added."}, {"id": "3c570361-064c-471c-8e97-1a522d42acb1", "title": "Hurricane Debby makes landfall in northern Florida as Category 1 storm – Times News Online", "date": "2024-08-05 16:00", "url": "https://www.tnonline.com/20240805/hurricane-debby-makes-landfall-in-northern-florida-as-category-1-storm/", "domain": "tnonline.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Hurricane Debby has made landfall Monday in northern Florida as a Category 1 storm.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nFloodwaters cover parts of the Shore Acres neighborhood of St. Petersburg, Fla., as a result of Tropical Storm Debby Sunday afternoon, Aug. 4, 2024."}, {"id": "6e81ca8b-c422-4361-a450-1c51cfc19a97", "title": "Ohio Task Force 1 activated ahead of Hurricane Debby landfall", "date": "2024-08-05 05:15", "url": "https://www.whio.com/news/local/ohio-task-force-1-members-activated-ahead-tropical-storm-debby-landfall/KNM4YT44GVAWTN25TKLCXID6UI/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "9e552940-0b6b-4294-b1f0-e690d6550e1f", "title": "Debby strengthens into hurricane heading to Florida", "date": "2024-08-05 04:30", "url": "https://www.juneesoutherncross.com.au/story/8718516/debby-strengthens-into-hurricane-heading-to-florida/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "\"Right now, we are to trying secure everything from floating away,\" said Sheryl Horne, whose family owns the Shell Island Fish Camp along the Wakulla River in St. Marks, Florida, where some customers moved their boats inland."}, {"id": "d1d7a049-0806-4e3c-95df-82fddaa4f0ef", "title": "Debby strengthens into hurricane heading to Florida", "date": "2024-08-05 05:00", "url": "https://www.newcastleherald.com.au/story/8718516/debby-strengthens-into-hurricane-heading-to-florida/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "\"Right now, we are to trying secure everything from floating away,\" said Sheryl Horne, whose family owns the Shell Island Fish Camp along the Wakulla River in St. Marks, Florida, where some customers moved their boats inland."}, {"id": "024a4726-faa6-4471-b165-899eaf0c153e", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida", "date": "2024-08-05 04:00", "url": "https://www.fitzhugh.ca/world-news/tropical-storm-debby-strengthens-into-a-category-1-hurricane-as-it-heads-toward-florida-9311002", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nTAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "27650399-db60-45a3-84f8-c126d8670a77", "title": "Hurricane Debby makes landfall along Florida coast as Category 1 storm", "date": "2024-08-05 11:45", "url": "https://keprtv.com/news/nation-world/hurricane-debby-threatens-catastrophic-flooding-in-big-bend-florida-panhandle-savannah-georgia-and-hilton-head-charleston-south-carolina-storm-surge-record-setting-rains-governor-ron-desantis-state-of-emergency", "domain": "keprtv.com", "domain_classification": "Unknown", "message": "Hurricane Debby made landfall near Steinhatchee on the Florida coast early Monday morning bringing with it the potential for record-setting rains, and life-threatening storm surge.\nHurricane Debby is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nFlooding could last through Friday and is expected to be especially severe in low-lying areas near the coast, including Savannah, Georgia; Hilton Head, South Carolina; and Charleston, South Carolina.\n“This is going to a significant storm,” Savannah Mayor Van.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June."}, {"id": "6b18a80c-9382-47f7-b09e-a619227986bb", "title": "Hurricane Debby makes landfall along Florida coast as Category 1 storm", "date": "2024-08-05 14:45", "url": "https://kfoxtv.com/news/nation-world/hurricane-debby-threatens-catastrophic-flooding-in-big-bend-florida-panhandle-savannah-georgia-and-hilton-head-charleston-south-carolina-storm-surge-record-setting-rains-governor-ron-desantis-state-of-emergency", "domain": "kfoxtv.com", "domain_classification": "Unknown", "message": "Debby turned deadly as it continues to roar across Florida after it made landfall as a Category 1 hurricane Monday morning.\nHurricane Debby made landfall near Steinhatchee on the Florida coast early Monday morning bringing with it the potential for record-setting rains, and life-threatening storm surge.\nHurricane Debby is likely to stall off the coast of South Carolina on Wednesday, creating a major flooding issue for the state.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nBrian Kemp and South Carolina Gov."}, {"id": "461f5599-6723-41a2-be36-dc488fdb7d2b", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:30", "url": "https://www.wdio.com/front-page/world-national/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "The potential for high water threatened Savannah, Georgia, and Charleston, South Carolina.\n“It is a very saturating, wet storm,” he said during an afternoon briefing at the state’s emergency operations center.\nIt has since weakened to a tropical storm and is moving slowly, covering roads with water and contributing to at least four deaths.\nIn South Carolina, Charleston County Interim Emergency Director Ben Webster called Debby a “historic and potentially unprecedented event” three times in a 90-second briefing Monday morning.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "d8449195-1fee-4571-91a2-e778fd196658", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:00", "url": "https://www.thereminder.ca/world-news/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina-9311088", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\n___This story has been updated to correct that the Big Bend area is north of Tampa, not south of Tampa."}, {"id": "d3a82e7e-a0f7-48a8-a9c9-f946f4516bf1", "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 06:45", "url": "https://www.coastreporter.net/world-news/hurricane-debby-to-bring-heavy-rains-and-catastropic-flooding-to-florida-georgia-and-s-carolina-9311088", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\n___This story has been updated to correct that the Big Bend area is north of Tampa, not south of Tampa."}, {"id": "44dceadd-a85c-4471-a0a2-3140385bc7b0", "title": "Hurricane Debby to bring heavy rains and catastrophic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 11:00", "url": "https://www.tricitynews.com/world-news/hurricane-debby-to-bring-heavy-rains-and-catastrophic-flooding-to-florida-georgia-and-s-carolina-9311088", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\n___This story has been updated to correct that the Big Bend area is north of Tampa, not south of Tampa."}, {"id": "773efe88-8ad7-4fa4-9510-93e22f960213", "title": "Hurricane Debby to bring heavy rains and catastrophic flooding to Florida , Georgia and S . Carolina", "date": "2024-08-05 11:00", "url": "https://www.coastreporter.net/world-news/hurricane-debby-to-bring-heavy-rains-and-catastrophic-flooding-to-florida-georgia-and-s-carolina-9311088", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "The storm made landfall as a Category 1 storm near Steinhatchee, a tiny community in northern Florida of less than 1,000 residents on Florida’s Gulf Coast.\nThe storm made landfall in one of the least populated areas of Florida, but forecasters warned heavy rain could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nThe sparsely populated Big Bend region in the Florida Panhandle also was hit last year by Hurricane Idalia, which made landfall as a Category 3 hurricane.\n___This story has been updated to correct that the Big Bend area is north of Tampa, not south of Tampa."}, {"id": "68f78d68-1e56-4a32-9ac1-f3d75e1ecd6b", "title": "Tropical Storm Debby sending storms , increased flood risk for the Carolinas", "date": "2024-08-05 05:00", "url": "https://www.yahoo.com/news/tropical-storm-debby-sending-storms-023402586.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "After seeing mostly sunny skies during the day we have seen a couple of isolated thunderstorms this evening.\nThe focus though of the upcoming week will be Tropical Storm Debby and the track of the storm.\nAs for tonight and Monday, isolated thunderstorms this evening will fade overnight with lows in the low 70s.\nFrom there the storm is expected to move slowly northward along the Georgia and Carolina coast and potentially stall.\nThe storm should finally clear out Friday night with drier weather expected over the week along with warmer temperatures rebounding back toward the low 90s."}, {"id": "624569c1-3e69-4e1c-8462-e6081f8fd55e", "title": "Tropical Storm Debby strengthens into a Category 1 hurricane as it heads toward Florida – Brandon Sun", "date": "2024-08-05 05:00", "url": "https://www.brandonsun.com/world/2024/08/04/tropical-storm-debby-strengthens-into-a-category-1-hurricane-as-it-heads-toward-florida", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (AP) — Tropical Storm Debby strengthened into a Category 1 hurricane as it approached Florida on Sunday evening, according to the national weather service.\nDebby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nA tropical storm watch extended farther west into the Panhandle.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "80ea951f-bfec-4295-b2b8-742fad24ac34", "title": "Officials urge Georgians to prepare for Tropical Storm Debby as it barrels toward Florida", "date": "2024-08-05 03:15", "url": "https://www.wtvm.com/2024/08/05/officials-urge-georgians-prepare-tropical-storm-debby-it-barrels-toward-florida/", "domain": "wtvm.com", "domain_classification": "Unknown", "message": "Debby is the fourth named storm of the 2024 Atlantic hurricane season after Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris, all of which formed in June.\nForecasters warned heavy amounts of rain from Debby could spawn catastrophic flooding in Florida, South Carolina and Georgia.\nThe 5 p.m. track from the National Hurricane Center brings Debby into south Georgia as a Tropical Storm Monday evening.\nWidespread flooding is the greater concern across south Georgia, the Georgia Coastal Empire and South Carolina Lowcountry.\nWe’re doing everything that we need to be prepared to face a tropical storm,” Tampa Mayor Jane Castor said."}, {"id": "076948a7-2d16-4e62-9fa6-8bde93b51723", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 14:00", "url": "https://www.kanw.com/npr-news/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "kanw.com", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}, {"id": "82d41588-bf5a-47ee-a089-0da3bcc94df1", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 14:00", "url": "https://www.kwbu.org/latest-from-npr/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "kwbu.org", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}, {"id": "6911e7ec-e6b1-4eb2-9479-c37b37b2b916", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 16:00", "url": "https://www.kasu.org/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "kasu.org", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}, {"id": "08c25cd6-8fa1-4f0e-b6a1-b9cb8d1de1ba", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 15:00", "url": "https://www.kjzz.org/npr-top-stories/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "kjzz.org", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}, {"id": "67b15017-8cf2-4661-9bf8-c5006c4685f2", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 15:00", "url": "https://www.upr.org/npr-news/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "upr.org", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}, {"id": "f056825e-93ee-4e88-a40b-6572cf2f97d1", "title": "Debby , now a Category 1 hurricane , makes landfall in Florida", "date": "2024-08-05 15:15", "url": "https://www.kedm.org/npr-news/2024-08-05/debby-now-a-category-1-hurricane-makes-landfall-in-florida", "domain": "kedm.org", "domain_classification": "Unknown", "message": "“Now that Hurricane Debby is making landfall, the most important thing to do is to just protect yourself and protect your family,” Florida Gov.\nDebby gained strength over abnormally warm water in the Gulf of Mexico before it made landfall in Florida.\n/ National Weather Service / National Weather Service Hurricane Debby is expected to bring heavy rainfall this week as it crosses Florida, where it made landfall early Monday, into Georgia and South Carolina.\nThe storm's remnants expected to finally reach North Carolina early Saturday.\nDebby's path after FloridaRainfall amounts could reach between 6 and 18 inches in pockets of central and northern Florida, up to North Carolina through Saturday morning."}]