[{"id": "6b846cef-d6cf-4f25-a212-eb2b9974ace0", "title": "Israeli airstrike on a Gaza school used as a shelter kills at least 80 , Palestinian officials say | News , Sports , Jobs", "date": "2024-08-11 04:00", "url": "https://www.mauinews.com/wire/?category=5187&ID=337418", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "The Israeli military acknowledged it targeted the Tabeen school in central Gaza City, claiming it hit a Hamas command center within the school.\n“There were people praying, there were people washing and there were people upstairs sleeping, including children, women and old people,” he said.\nIsrael said the targeted school was located next to a mosque serving as a shelter for Gaza City residents.\nLate Friday, two separate airstrikes in central Gaza killed at least 13 people including three children and seven women, hospital authorities said.\nOne strike hit a house in the Nuseirat refugee camp, killing seven people, all but one of them women, hospital officials said."}, {"id": "c287dff4-d313-41c6-9125-a53d4f393296", "title": "Is Iran still plotting revenge ? * WorldNetDaily * by David Brummer", "date": "2024-08-11 14:30", "url": "https://www.wnd.com/2024/08/is-iran-still-plotting-revenge/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "Get the hottest, most important news stories on the Internet – delivered FREE to your inbox as soon as they break!\nIran has continued to ratchet up the pressure through a series of carefully cultivated leaks of information to the world’s media over the last few days.\nThis would suggest at least an Iranian attack could begin on Wednesday.\nIt is unclear how much damage Israel is willing to absorb in the event Iran and/or its proxies attack the Jewish state.\nAlmost immediately, Hamas counter-claimed, alleging the strike killed some 90-100 people – the majority non-combatants."}, {"id": "7878d7ef-aaf2-4e1b-90dc-2e383c665b08", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 02:45", "url": "https://us.cnn.com/2024/08/10/politics/us-troops-drone-attack-syria/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "2fa61373-5203-4d1f-96e4-53e95bf12667", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 05:30", "url": "https://edition.cnn.com/2024/08/10/politics/us-troops-drone-attack-syria/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "e1306d21-a45f-4b42-9cc6-7b10cd84bbe1", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 04:15", "url": "https://www.cnn.com/2024/08/10/politics/us-troops-drone-attack-syria/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "59a65dc5-08d1-4235-bb6c-94ef19b6cb3c", "title": "Long - range missiles key to Israel response to attacks abroad - opinion", "date": "2024-08-11 02:45", "url": "https://www.jpost.com/opinion/article-814128", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Recent advancements have led to the development of Hypersonic Cruise Missiles, which possess high speed and maneuverability, enabling them to evade aerial detection and interception systems effectively.\nFor instance, researcher Gregory Engel explored this issue in an article titled “The Politics of Naval Innovation: Cruise Missiles and the Tomahawk.” Engel analyzed the origins and development of modern cruise missiles, focusing on the American Tomahawk cruise missile.\nEngel notes that air-launched and sea-launched cruise missiles (ALCM/SLCM) began differently but neither would have reached full production and operation without intervention from the highest civilian levels.\nThe Israel Navy and Israel Aircraft Industry (IAI) have been developing sea-to-sea missiles, including the latest Gabriel 5 type, designed to target naval threats.\nThe Navy has stated that these advanced missiles ensure their relative advantage and help maintain the IDF’s naval superiority."}, {"id": "6991672d-7924-4bca-9cee-3560d54e71db", "title": "Palestinians say Israeli strike on Gaza school kills 80", "date": "2024-08-11 02:45", "url": "https://www.stltoday.com/news/nation-world/government-politics/war-middle-east-conflict-united-nations/article_f2e09bd1-e941-521c-b724-21671b1e2b63.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip — An Israeli airstrike hit a school-turned-shelter in Gaza early Saturday, killing at least 80 people and wounding nearly 50 others, Palestinian health authorities said, in one of the deadliest attacks of the 10-month Israel-Hamas war.\nThe strike hit without warning before sunrise, according to witness Abu Anas.\nEgypt, which borders Gaza, said the strike on the school showed that Israel had no intention of reaching a cease-fire deal.\nLate Friday, two separate airstrikes in central Gaza killed at least 13 people, including three children and seven women, hospital authorities said.\nOne strike hit a house in the Nuseirat refugee camp, killing seven people, all but one of them women, hospital officials said."}, {"id": "f2127af2-23d7-428f-974a-a4f64a2c5269", "title": "Israel Names 19 It Claims To Have Killed In Gaza School Strike Amid Global Outcry", "date": "2024-08-11 07:30", "url": "https://www.news18.com/world/israel-names-19-it-claims-to-have-killed-in-gaza-school-strike-amid-global-criticism-9012148.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Israeli military on Saturday said that it killed 19 Hamas and Palestinian Islamic Jihad operatives in a strike on a command room within a Gaza school complex, which has drawn widespread condemnation.\nThe Hamas-run civil defence agency claimed that over 90 people were killed in the attack that sparked outrage among world leaders and rights groups.\nToday, the IDF and ISA struck terrorists operating in a Hamas command and control center, which was embedded inside a mosque in the Al-Taba’een school compound.\nHagari explained that Hamas has increasingly used school buildings as military facilities, which has raised significant concerns about civilian safety.\nThe ongoing conflict, which reignited on October 7 when Hamas launched a surprise attack on Israel, has resulted in significant casualties on both sides."}, {"id": "36a3a4e2-05f5-4acc-94e3-7cae7764cf3f", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 02:15", "url": "https://ktvz.com/politics/cnn-us-politics/2024/08/10/us-and-coalition-personnel-sustained-minor-injuries-in-friday-drone-attack-in-syria-official-says/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "032d94a7-1c58-4237-9e02-99ae577c9e8d", "title": "US  deeply concerned  about deadly Israeli strike on Gaza school", "date": "2024-08-11 07:00", "url": "https://tribune.com.pk/story/2487196/us-deeply-concerned-about-deadly-israeli-strike-on-gaza-school", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinians look at the damage at the site of an Israeli strike on a school sheltering displaced people, amid the Israel-Hamas conflict, in Gaza City August 10, 2024.\nPHOTO:REUTERS/The White House said it was \"deeply concerned\" about an Israeli airstrike on a Gaza City school compound on Saturday that local civil defence officials say killed around 100 people, adding to condemnation of the attack from several Arab states, Turkey, Britain and the European Union's foreign policy chief.\nThe school compound in Gaza City housed displaced Palestinian families.\nThe Gaza Civil Emergency Service, which has a credible record stating casualty numbers, said about 100 people were killed in Saturday's strike.\nIn the rubble of this school in Gaza City, empty food tins, burnt mattresses, and a child's doll."}, {"id": "b93e13c2-ccbd-4d7a-af7f-9ccb42d3d035", "title": "Father , 4 - year - old son killed in Russian air strike on Kyiv region", "date": "2024-08-11 13:45", "url": "https://www.swissinfo.ch/eng/father,-4-year-old-son-killed-in-russian-air-strike-on-kyiv-region/86577695", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Father, 4-year-old son killed in Russian air strike on Kyiv region2 minutesBy Sergiy Karazy and Valentyn OgirenkoKYIV (Reuters) -A 4-year-old boy and his 35-year-old father were killed in an overnight Russian air strike outside of Kyiv, Ukrainian officials said on Sunday.\nThree other people, including a teenage boy, were wounded in the attack just east of the capital, which President Volodymyr Zelenskiy said involved a North Korean-made missile.\nHe did not offer further detail but Ukrainian emergency services earlier said the victims’ home in the Brovary district was struck by debris from a downed Russian missile.\nMoscow’s overnight strike also included 57 Iranian-made attack drones that were launched across Ukraine, 53 of which were destroyed by air defences, Kyiv’s air force said.\nZelenskiy, in his statement, called for “a full-fledged air shield” from Ukraine’s partners and permission to strike deep inside Russia with Western-provided weapons."}, {"id": "0805e5c5-f0b6-4547-91c1-62637aef2133", "title": "Israeli strike on Gaza school : US  deeply concerned  about deadly attack", "date": "2024-08-11 06:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/israeli-strike-on-gaza-school-us-deeply-concerned-about-deadly-attack/articleshow/112438777.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelWASHINGTON: The White House said it was \"deeply concerned\" about an Israeli airstrike on a Gaza City school compound on Saturday that local civil defence officials say killed around 100 people, adding to condemnation of the attack from several Arab states, Turkey, Britain and the European Union's foreign policy chief.The school compound in Gaza City housed displaced Palestinian families.\nThe Gaza Civil Emergency Service, which has a credible record stating casualty numbers, said about 100 people were killed in Saturday's strike.\nIsrael said around 20 militants had been operating at the compound.Video from the site showed body parts scattered among rubble and more bodies being carried away and covered in blankets.\n\"Yet again, far too many civilians have been killed,\" Vice President and Democratic presidential candidate Kamala Harris told reporters separately on Saturday while also reiterating calls for a Gaza ceasefire.\nSaturday's airstrike came a day after a State Department spokesperson said the U.S. will provide Israel $3.5 billion to spend on U.S. weapons and military equipment after Congress appropriated the funds in April."}, {"id": "836bceca-5c79-4ca1-bda4-62e4c72e7b03", "title": "GLOBAL OUTCRY : 90 People Killed As IDF Claims Precision Strike on Hamas - Linked School Complex Kills 19 Terror Operatives", "date": "2024-08-11 03:00", "url": "https://www.theyeshivaworld.com/news/israel-news/2304573/global-outcry-90-people-killed-as-idf-claims-precision-strike-on-hamas-linked-school-complex-kills-19-terror-operatives.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The IDF later announced that the strike successfully eliminated 19 operatives from the two terror groups.\nThe White House expressed deep concern over the high civilian death toll in the ongoing conflict and called for more details about the strike.\nAccording to the IDF, the operation targeted a command room embedded within a mosque at the school complex using three precision munitions.\nEgypt, which borders Gaza, said that the strike on the school showed that Israel had no intention of reaching a cease-fire deal.\nThe deal needs to get done and it needs to get done now.”(YWN World Headquarters – NYC / AP)"}, {"id": "d45d6f6d-6e62-46de-8b54-308413ee021d", "title": "Israeli airstrike on a Gaza school used as a shelter kills at least 80 , Palestinian officials say | News , Sports , Jobs", "date": "2024-08-11 04:00", "url": "http://www.vindy.com/wire/?category=6&ID=337418", "domain": "vindy.com", "domain_classification": "Unknown", "message": "The Israeli military acknowledged it targeted the Tabeen school in central Gaza City, claiming it hit a Hamas command center within the school.\n“There were people praying, there were people washing and there were people upstairs sleeping, including children, women and old people,” he said.\nIsrael said the targeted school was located next to a mosque serving as a shelter for Gaza City residents.\nLate Friday, two separate airstrikes in central Gaza killed at least 13 people including three children and seven women, hospital authorities said.\nOne strike hit a house in the Nuseirat refugee camp, killing seven people, all but one of them women, hospital officials said."}, {"id": "7a3afe22-6d88-4775-80b4-25404cafbf85", "title": "US , coalition personnel injured in Syria attack", "date": "2024-08-11 03:15", "url": "https://www.illawarramercury.com.au/story/8725720/us-coalition-personnel-injured-in-syria-attack/?cs=7484", "domain": "illawarramercury.com.au", "domain_classification": "Unknown", "message": "Ismail Haniyeh, the political leader of Iran-backed Hamas, was assassinated in the Iranian capital Tehran on July 31, an attack that drew threats of revenge by Iran against Israel, which is fighting the Palestinian Islamist group in Gaza.\nIran blamed Israel for the killing.\nIsrael has not claimed responsibility."}, {"id": "902d35ae-3c51-4c0a-8123-6af0303091ee", "title": "Israel broadens its evacuation orders after deadly strike on Gaza school - turned - shelter", "date": "2024-08-11 08:00", "url": "https://www.yahoo.com/news/israel-broadens-evacuation-orders-deadly-071449611.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This image made from a video, shows the yard of a school after being hit by an Israeli airstrike in Gaza City Saturday, Aug. 10, 2024.\n(AP Photo)DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\nIsrael has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIt was the fourth displacement for the 42-year-old widow, whose husband was killed when an Israeli airstrike hit their neighbors’ house in March.\nThe Israeli military disputed the toll and said that it killed 19 Hamas and Islamic Jihad militants."}, {"id": "4c5db3f3-280b-4283-bbf1-e73e92c1b5c2", "title": "Jordan Will Not Be A Battlefield For Iran Or Israel , Foreign Minister Warns", "date": "2024-08-11 05:15", "url": "https://menafn.com/1108540434/Jordan-Will-Not-Be-A-Battlefield-For-Iran-Or-Israel-Foreign-Minister-Warns", "domain": "menafn.com", "domain_classification": "Unknown", "message": "\"We will not be a battlefield for Iran or Israel.\nIn April, Jordan, which lies between Iran and Israel, said it intercepted flying objects that entered its airspace as Tehran launched explosive drones and fired missiles at Israel in the first direct retaliatory attack of its kind.\nIran has repeatedly vowed to \"punish\" Israel since the assassination of Ismail Haniyeh, the political leader of Iran-backed Palestinian Islamist group Hamas, in Tehran on July 31.\nIran and Hamas blamed Israel for the killing.\nThose concerns have also been stoked by the killing of Lebanese armed group Hezbollah's top military commander, Fuad Shukr, in an Israeli strike in Beirut's southern suburbs hours before the assassination of Haniyeh."}, {"id": "bb2ea2a7-4950-4ed3-8e75-b128d366cd67", "title": "Israel broadens its evacuation orders after deadly strike on Gaza school - turned - shelter", "date": "2024-08-11 07:45", "url": "https://www.wsls.com/news/world/2024/08/11/israel-broadens-its-evacuation-orders-after-deadly-strike-on-gaza-school-turned-shelter/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Palestinians mourn for relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital in Deir al-Balah, Saturday, Aug. 10, 2024.\n(AP Photo/Abdel Kareem Hana)DEIR EL-BALAH – The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nThe Israeli military disputed the toll and said that it killed 19 Hamas and Islamic Jihad militants."}, {"id": "096e7564-4d9d-40af-9816-8d5ce5d70d3d", "title": "Hezbollah launches  squadrons of drones , retaliates for Israeli Sidon attack", "date": "2024-08-11 08:00", "url": "https://www.albawaba.com/news/hezbollah-launches-squadrons-drones-1580898", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Following the Israeli attack that killed a Hamas commander in Sidon, Lebanon, Hezbollah announced launching \"squadrons of explosive-laden drones\" at the Michve Alon base near the Galilee town of Safed.\nHezbollah said in a statement that the strikes were \"in response to the attack and assassination carried out by the Israeli enemy in the city of Sidon\".\nOn Friday, an Israeli attack on a car in the south Lebanon city of Sidon killed a Hamas leader, according to the Palestinian group and the Israeli military.\nThe Israeli military said that its aircraft hit the Sidon region and \"eliminated\" Hajj, whom it characterized as \"a senior commander\" for Hamas in Lebanon.\nThousands were killed, and dozens of thousands of others were injured in the Israeli attacks on the Gaza Strip."}, {"id": "c2daa6d4-ecf9-41ea-9ff7-d4420f778f08", "title": "Israel broadens its evacuation orders after deadly strike on Gaza school - turned - shelter", "date": "2024-08-11 08:00", "url": "https://www.kob.com/news/us-and-world-news/israel-broadens-its-evacuation-orders-after-deadly-strike-on-gaza-school-turned-shelter/", "domain": "kob.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\nIsrael has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nThe Israeli military disputed the toll and said that it killed 19 Hamas and Islamic Jihad militants.\n___Follow AP’s coverage of the war in Gaza at https://apnews.com/hub/israel-hamas-warCopyright 2024 The Associated Press."}, {"id": "189084b1-2224-48e1-94fe-46012e7f0e43", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 12:45", "url": "https://www.egyptindependent.com/us-and-coalition-personnel-sustained-minor-injuries-in-friday-drone-attack-in-syria-official-says/", "domain": "egyptindependent.com", "domain_classification": "Unknown", "message": "CNN —Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "3422d30a-7dce-4583-94b9-5808b07e2deb", "title": "Jordan will not be a battlefield for Iran or Israel , foreign minister warns", "date": "2024-08-11 08:15", "url": "https://www.stabroeknews.com/2024/08/11/news/world/jordan-will-not-be-a-battlefield-for-iran-or-israel-foreign-minister-warns/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "CAIRO, (Reuters) – Jordan’s Foreign Minister Ayman Safadi said yesterday that the kingdom would not be a battlefield for Iran or Israel, as the region braces for a possible new wave of attacks by Tehran and its allies following last week’s killing of senior members of militant groups Hamas and Hezbollah.\n“We will not be a battlefield for Iran or Israel.\nIran has repeatedly vowed to “punish” Israel since the assassination of Ismail Haniyeh, the political leader of Iran-backed Palestinian Islamist group Hamas, in Tehran on July 31.\nIran and Hamas blamed Israel for the killing.\nIsrael has not claimed or denied responsibility for the killing, which has fuelled concerns that the war between Israel and Hamas in the Gaza Strip could spill into a wider Middle East conflict."}, {"id": "b358fc31-5a30-4fe5-b50c-71a9ebec450e", "title": "US and coalition personnel sustained minor injuries in Friday drone attack in Syria , official says", "date": "2024-08-11 02:45", "url": "https://abc17news.com/politics/national-politics/cnn-us-politics/2024/08/10/us-and-coalition-personnel-sustained-minor-injuries-in-friday-drone-attack-in-syria-official-says/", "domain": "abc17news.com", "domain_classification": "Unknown", "message": "By Haley Britzky, CNN(CNN) — Several United States and coalition personnel were treated for minor injuries after a drone attack in Syria on Friday, a US defense official said, amid heightened tensions in the Middle East.\nPersonnel were treated for minor injuries, including smoke inhalation, but none were “seriously hurt,” the official said Saturday.\nAll were stable as of Tuesday, a defense official said.\nUS officials have long blamed Iran-backed militia groups for attacks on troops in Iraq and Syria.\nBetween October 17 and January 29, there were more than 150 attacks on US personnel in Iraq and Syria."}, {"id": "2c513cb4-5259-45fd-baaf-2dd1be2908a6", "title": "UAVs vs Helicopters War Continues With Mi - 8 Hit By Drone And Another Drone Hit By Ka - 52", "date": "2024-08-11 01:00", "url": "https://theaviationist.com/2024/08/11/drones-vs-helicopters-war/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "A new video shows a Ukrainian FPV drone attacking a Russian Mi-8 transport helicopter, apparently hitting its tail assembly.\nA second video shows a Russian Ka-52 helicopter shooting down a Ukrainian drone with an anti-tank missile.\n💥 Russia: Ukrainian drone operated by the SBU struck a $15 million Russian Mi-8 helicopter in Kursk region.\nRussian Mi-8 helicopters have been known to be able to carry EW suites for some time, albeit originally designed to counter MANPADS (Man-Portable Air-Defense Systems) and radar-guided missiles.\nFor first time in history, a Ka-52 attack helicopter of the #Russian Aerospace Forces shot down a drone using 9K121 Vikhr anti-tank missile."}, {"id": "17350af5-81a7-4943-97a5-58483bfe0ac9", "title": "Israel faces anger over Gaza school strike rescuers say killed 93", "date": "2024-08-11 07:00", "url": "https://www.euractiv.com/section/global-europe/news/israel-faces-anger-over-gaza-school-strike-rescuers-say-killed-93/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Rescuers in Gaza said an Israeli air strike on a religious school housing displaced Palestinians killed 93 people on Saturday (10 August), sparking international condemnation despite Israel’s insistence that it was targeting militants.\nThe White House said it was “deeply concerned” about the Israeli airstrike on the Gaza City school compound, adding Washington was in touch with Israel to seek more information.\nIsrael has made similar accusations of armed activities after strikes on school shelters, while Hamas has denied using civilian facilities for military aims.\nPalestinian militants seized 251 hostages, 111 of whom are still held in Gaza, including 39 the Israeli military says are dead.\nFrancesca Albanese, the United Nations special rapporteur on the rights situation in Palestinian territories, again accused Israel of “genociding” Palestinians."}, {"id": "8ffb7485-4829-408c-b5c7-1ec9e67e6988", "title": "Israel broadens its evacuation orders after deadly strike on Gaza school - turned - shelter | iNFOnews", "date": "2024-08-11 10:45", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp1794964470", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Israel has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nThe Israeli military disputed the toll and said that it killed 19 Hamas and Islamic Jihad militants.\nEuropean leaders and neighbors of Israel condemned the strike, while the U.S. said that it was concerned about the reports of civilian casualties."}, {"id": "03384f5c-dc95-49c0-a6d5-a7814b5f6ba1", "title": "Hezbollah attacks Israeli base with swarms of suicide drones", "date": "2024-08-11 02:00", "url": "https://www.prokerala.com/news/articles/a1554957.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, Aug 11 : Hezbollah has attacked an Israeli base located southwest of Safed city in northern Israel with successive swarms of suicide drones, causing injuries among its members.\n\"On Saturday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones on the Michve Allon base,\" Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, on Friday at the eastern entrance to the city of Sidon, Xinhua news agency reported.\nMeanwhile, the Lebanese military sources, who spoke anonymously, told the news agency that Israeli drones and warplanes carried out 10 airstrikes on six villages and towns during the day in the border area of southern Lebanon, injuring three civilians and destroying 18 homes.\nA state of anticipation and caution prevails in Lebanon following Israel's attack on Dahieh in Beirut's southern suburbs, killing Hezbollah senior military commander Fouad Shokor."}, {"id": "9fa625c9-9073-4b3d-afa4-74047a3d82f1", "title": "Around 10 Shahed UAVs shot down over Kyiv , no damage reported in city", "date": "2024-08-11 06:45", "url": "https://www.yahoo.com/news/around-10-shahed-uavs-shot-053843142.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Around 10 Shahed UAVs shot down over Kyiv, no damage reported in cityThe aftermath of the Russian attack on Kyiv Oblast.\nSource: Kyiv City Military Administration (KCMA)Quote: \"The enemy has launched airstrikes on Kyiv for the second time since the beginning of August.\nSeveral dozen Shahed attack UAVs were known to have been launched on Ukraine.\nAfter elaborate manoeuvres, about a dozen of them attempted to attack Kyiv.\nHowever, all the enemy UAVs have been shot down in the airspace of the Ukrainian capital by air defence assets and personnel.\""}, {"id": "e4e332e8-ad47-479e-9963-41cf862a5741", "title": "Hezbollah attacks Israeli base with swarms of suicide drones", "date": "2024-08-11 02:45", "url": "https://www.siasat.com/hezbollah-attacks-israeli-base-with-swarms-of-suicide-drones-3077095/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Beirut: Hezbollah has attacked an Israeli base located southwest of Safed city in northern Israel with successive swarms of suicide drones, causing injuries among its members.\n“On Saturday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones on the Michve Allon base,” Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, on Friday at the eastern entrance to the city of Sidon, Xinhua news agency reported.\nMeanwhile, the Lebanese military sources, who spoke anonymously, told the news agency that Israeli drones and warplanes carried out 10 airstrikes on six villages and towns during the day in the border area of southern Lebanon, injuring three civilians and destroying 18 homes.\nA state of anticipation and caution prevails in Lebanon following Israel’s attack on Dahieh in Beirut’s southern suburbs, killing Hezbollah senior military commander Fouad Shokor."}, {"id": "e59757a4-b01a-4fd3-b6f9-8fcb76440d0a", "title": "Hezbollah Attacks Israeli Base With Swarms Of Suicide Drones", "date": "2024-08-11 04:00", "url": "https://menafn.com/1108540609/Hezbollah-Attacks-Israeli-Base-With-Swarms-Of-Suicide-Drones", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, Aug 11 (IANS) Hezbollah has attacked an Israeli base located southwest of Safed city in northern Israel with successive swarms of drones, causing injuries among its members.\n\"On Saturday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones on the Michve Allon base,\" Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, on Friday at the eastern entrance to the city of Sidon, Xinhua news agency reported.\nMeanwhile, the Lebanese military sources, who spoke anonymously, told the news agency that Israeli drones and warplanes carried out 10 airstrikes on six villages and towns during the day in the border area of southern Lebanon, injuring three civilians and destroying 18 homes.\nA state of anticipation and caution prevails in Lebanon following Israel's attack on Dahieh in Beirut's southern suburbs, killing Hezbollah senior military commander Fouad Shokor."}, {"id": "284c131e-07e2-4cf1-b2e9-037b1ba322bc", "title": "Hezbollah Attacked Israeli Base With Swarms Of Suicide Drones", "date": "2024-08-11 05:00", "url": "https://menafn.com/1108540855/Hezbollah-Attacked-Israeli-Base-With-Swarms-Of-Suicide-Drones", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT, Aug 11 (NNN-NNA) – Hezbollah, yesterday, attacked a Zionist base, located south-west of Safed city, in northern Israel, with successive swarms of drones, causing injuries among its members.\n“Yesterday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones, on the Michve Allon base,” Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, on Friday, at the eastern entrance to the city of Sidon, deep in southern Lebanon.\nA state of anticipation and caution prevails in Lebanon, following Israel's attack on Dahieh, in Beirut's southern suburbs, killing Hezbollah senior military commander, Fouad Shokor.\nHezbollah Secretary-General, Hassan Nasrallah, threatened retaliation.– NNN-NNA"}, {"id": "d9b193ad-27d4-4efe-bfbd-8c59a2b12f89", "title": "Hezbollah attacks Israeli base with swarms of suicide drones", "date": "2024-08-11 00:00", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-08/11/content_117360821.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器BEIRUT, Aug. 10 (Xinhua) -- Hezbollah attacked on Saturday an Israeli base located southwest of Safed city in northern Israel with successive swarms of suicide drones, causing injuries among its members.\n\"On Saturday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones on the Michve Allon base,\" Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, on Friday at the eastern entrance to the city of Sidon, deep in southern Lebanon.\nMeanwhile, the Lebanese military sources, who spoke anonymously, told Xinhua that Israeli drones and warplanes carried out ten airstrikes on six villages and towns during the day in the border area of southern Lebanon, injuring three civilians and destroying 18 homes.\nA state of anticipation and caution prevails in Lebanon following Israel's attack on Dahieh in Beirut's southern suburbs, killing Hezbollah senior military commander Fouad Shokor."}, {"id": "67ae8eaf-a5d6-4f58-b15a-445bca3daa45", "title": "Kamala Harris says  too many  civilian deaths in Gaza", "date": "2024-08-11 05:45", "url": "https://www.yahoo.com/news/kamala-harris-says-too-many-045014446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kamala Harris says 'too many' civilian deaths in GazaUS Vice-President Kamala Harris has condemned the loss of civilian life in an Israeli air strike against a school building in Gaza on Saturday.\nAn Israeli military spokesman said al-Taba’een school \"served as an active Hamas and Islamic Jihad military facility\", which Hamas denies.\nThe building also served as a mosque and the Israeli strike hit during dawn prayers, witnesses said.\n[Reuters]Hamas-led gunmen killed about 1,200 people in an attack on Israel on 7 October, taking 251 others back to Gaza as hostages.\nThat attack triggered a massive Israeli military offensive against Gaza and the current war."}, {"id": "adba82d2-2c1c-465b-804f-70b0d91b74b9", "title": "Iranian President Nominates Abbas Araghchi As Foreign Minister", "date": "2024-08-11 12:45", "url": "https://www.rferl.org/a/iran-abbas-araghchi-nominated-foreign-minister/33074354.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "Russia and Iran have both seen their international standing diminish in recent years.\nAnd as each seeks a way to boost their military and diplomatic influence, Africa looks like a land of opportunity.\nTehran and Moscow are notably active in places of conflict, such as West Africa and the Sahel, where juntas have made clear that Western forces are not welcome.\nIn West Africa, Iran has reached out to the trio of juntas in Burkina Faso, Mali, and Niger.\nBoth Karr and Hudson say there are no clear signs that Russia and Iran are coordinating their strategies in Africa."}, {"id": "0adc5454-f315-419c-b9ce-ac6d08e1094a", "title": "International Outcry Follows Israeli Airstrike on Gaza School , Leaving Nearly 100 Dead ! - Novinite . com", "date": "2024-08-11 07:45", "url": "https://www.novinite.com/articles/227674/International+Outcry+Follows+Israeli+Airstrike+on+Gaza+School,+Leaving+Nearly+100+Dead!", "domain": "novinite.com", "domain_classification": "Unknown", "message": "At least 93 people were killed in an Israeli airstrike on a school and mosque in Gaza that was sheltering displaced Palestinians, according to local officials cited by CNN.\nThe Gaza Civil Defense reported that the strike occurred during dawn prayers at the Al-Tabi'in compound in Gaza City's Al-Daraj neighborhood.\nAccording to the IDF, an Israeli airstrike targeted a Hamas command center inside a mosque located in a Gaza City school compound, killing 19 terrorists.\nInternational condemnation of the Israeli strike has been widespread, with several countries, including Arab states, Turkey, France, and the European Union, denouncing the attack.\nIsrael, however, maintained that the strike targeted militants and that the reported death toll was exaggerated."}, {"id": "5153c9c9-492d-40b0-b0ad-b5af97984663", "title": "Australia joins other nations to condemn deadly Israeli air strike on Gaza school", "date": "2024-08-11 05:30", "url": "https://www.sbs.com.au/news/article/australia-joins-other-nations-to-condemn-deadly-israeli-air-strike-on-school/p5tq4dnoo", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "Australian Foreign Minister Penny Wong has condemned the deaths of dozens of civilians in an Israeli air strike in a school compound housing displaced Palestinians in Gaza City.\nPalestinians mourn their dead following an Israeli strike on the Al-Taba'een school in the Daraj Tuffah neighborhood of Gaza, 10 August 2024.\nVideo from the site showed body parts scattered among rubble and more bodies being carried away and covered by blankets.\nIsrael says death toll inflatedIsrael said the toll was inflated and 19 militants were among the dead.\nIt added that no severe damage was caused to the compound, and provided aerial photos and videos which it said proved this."}, {"id": "4cb239db-7d39-448e-8e62-a6c1c8012e86", "title": "Turkey announces  Steel Dome  missile defense system", "date": "2024-08-11 13:15", "url": "https://www.israelnationalnews.com/news/394444", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Turkish government is developing its own multi-layered air defense system similar to Israel's Iron Dome, David's Sling, and Arrow multilayered missile defense system, the Istanbul-based Daily Sabah newspaper reported.\nThe new system is called 'Steel Dome' in an apparent reference to Israel's Iron Dome system.\nSteel Dome reportedly does not include Russia's S-400 missile system, which Turkey signed a deal to purchase in 2017, angering its NATO allies.\nIsrael's air defense system, in which Iron Dome eliminates short-range threats, David's Sling eliminates medium-range threats, and Arrow eliminates long-range threats, has been battle tested many times in the last two decades.\nIron Dome is noted for its success rate in shooting down over 90% of projectiles fired at Israel's population centers."}, {"id": "0f2a4c34-1cc6-4c28-a16e-c6c61e7e63b8", "title": "Israel - Hamas War Day 310 | IDF Orders Some Residents of Gaza Khan Yunis to Evacuate Ahead of Operation - Israel News", "date": "2024-08-11 06:30", "url": "https://www.haaretz.com/israel-news/2024-08-11/ty-article-live/drone-explodes-in-israels-north-report-arab-envoys-ask-hezbollah-to-delay-retaliation/00000191-3f83-de1f-abd7-3fcb0e790000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "China supports Iran in defending its \"sovereignty, security and national dignity\", Chinese foreign minister Wang Yi told Iran's acting foreign minister in a phone call on Sunday, according to a statement by China's foreign ministry.\nIn the phone call, Wang repeated Beijing's denunciation of the assassination of Hamas chief Ismail Haniyeh in Tehran on July 31, saying the strike had violated Iran's sovereignty and threatened regional stability.\nWang told Ali Bagheri Kani, Iran's Acting Foreign Minister, that the killing of Haniyeh had \"directly undermined the Gaza cease-fire negotiation process and undermined regional peace and stability,\" China's foreign ministry said.\n\"China supports Iran in defending its sovereignty, security and national dignity in accordance with the law, and in its efforts to maintain regional peace and stability, and stands ready to maintain close communication with Iran,\" Wang was quoted as saying."}, {"id": "ae550ec8-6234-4291-9d76-aa76e69bda9e", "title": "  Children torn apart : Israel striking Gaza schools becoming a pattern in war", "date": "2024-08-11 08:15", "url": "https://www.scmp.com/news/world/middle-east/article/3274054/children-torn-apart-israel-striking-gaza-schools-becoming-pattern-war", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Gaza’s civil defence agency said at least 93 people were killed, 17 of them women and children, making it one of the war’s deadliest strikes.\n“Peaceful people – women, children, and youths – were performing the Fajr prayer as usual when suddenly a missile hit them,” said Abu Wassim, who lives nearby and came to survey the scene.\nWe found bodies of children scattered in the street.”Women mourn the Palestinians killed in an Israeli strike on a school in Gaza.\nIsraeli military spokesperson Lieutenant-Colonel Nadav Shoshani said that about 20 Hamas and Islamic militants were operating from the Al-Tabieen complex.\nPalestinian militants seized 251 hostages, 111 of whom are still held in Gaza, including 39 the Israeli military says are dead."}, {"id": "0cbef1d2-d57c-403a-bb86-dc78b52a052c", "title": "US , coalition personnel injured in Syria attack", "date": "2024-08-11 00:00", "url": "https://www.maitlandmercury.com.au/story/8725720/us-coalition-personnel-injured-in-syria-attack/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "Ismail Haniyeh, the political leader of Iran-backed Hamas, was assassinated in the Iranian capital Tehran on July 31, an attack that drew threats of revenge by Iran against Israel, which is fighting the Palestinian Islamist group in Gaza.\nIran blamed Israel for the killing.\nIsrael has not claimed responsibility."}, {"id": "07646812-a73d-4b9f-b121-f24ff7154f85", "title": "Gaza school attack : Israel denies civilian killings , claims strike at Hamas fighters", "date": "2024-08-11 10:45", "url": "https://www.siasat.com/gaza-school-attack-israel-denies-civilian-killings-claims-strike-at-hamas-fighters-3077246/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "In the aftermath of a devastating airstrike on a Tabeen school which served as a shelter for displaced people in the Al-Daraj neighbourhood, east of Gaza City, the Israel Defense Forces (IDF) denied Palestinian claims of a high civilian death toll, insisting that its strike targeted and killed 19 Hamas fighters.\nThey claimed that 19 militants confirmed killed were affiliated with Hamas and Palestinian Islamic Jihad.\nThe IDF released an infographic identifying each of the 19 killed and their affiliations.\n20 Hamas and Islamic Jihad militants, including senior commanders, were operating from the compound struck at the Al-Tabaeen school, using it to carry out terrorist attacks.\nThe Israeli warplanes targeted the Al-Tabi’in School in the Al-Daraj neighbourhood where displaced people were performing the Fajr prayer, Xinhua news agency reported."}, {"id": "7776297c-7a86-43d4-b433-4bc0e30de082", "title": "Cuban FM Condemns Israeli Government Genocidal Statements", "date": "2024-08-11 05:45", "url": "https://menafn.com/1108540883/Cuban-FM-Condemns-Israeli-Governments-Genocidal-Statements", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network)HAVANA, Aug 11 (NNN-PRENSA LATINA) - Cuban Foreign Bruno Rodriguez condemned some statements by the Israeli calling for the starvation of the Gaza Strip population as evidence of the genocide being committed in Palestine.\nTurk's office called on Israeli authorities to monitor public officials whose statements on the ongoing conflict in Gaza may promote war crimes.\nThe Israeli minister's statements raised alarms just when his country's military forces launched a new airstrike on a school in Gaza, leaving more than 100 dead and dozens injured, in the latest episode of the Israeli regime's indiscriminate bombardment of Palestinian civilian infrastructure.\nThe Cuban authorities maintain their firm position of systematic rejection of the war in that nation occupied by Israel and reaffirm that the Government of Prime Minister Benjamin Netanyahu is committing genocide against the Palestinian people.\n- NNN-PRENSA LATINA"}, {"id": "b1c701e0-f486-4d2e-8165-81948956c6bc", "title": "Israel faces anger over Gaza school strike rescuers say killed 93", "date": "2024-08-11 07:00", "url": "https://dailytimes.com.pk/1216408/israel-faces-anger-over-gaza-school-strike-rescuers-say-killed-93/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Rescuers in Gaza said an Israeli air strike on a religious school housing displaced Palestinians killed 93 people on Saturday, sparking international condemnation despite Israel’s insistence that it was targeting militants.\nCivil defence rescuers in the Hamas-ruled territory said three Israeli missiles hit the complex in Gaza City while people were performing dawn prayers.\nIsrael has made similar accusations of armed activities after strikes on school shelters, while Hamas has denied using civilian facilities for military aims.\nBassal told a press conference that 11 children and six women were among those killed at the school shelter, “and there are many unidentified body parts”.\nJordan’s foreign ministry said the timing was an indication of Israel’s efforts to “obstruct and thwart” the latest mediation effort."}, {"id": "88fb27ea-93aa-4af5-9798-186cc8630e37", "title": "Israel confirms killing 19 terrorists in airstrike , denies wider casualty claims", "date": "2024-08-11 01:00", "url": "https://news.webindia123.com/news/Articles/World/20240811/4224053.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Jerusalem [Israel], August 11 (ANI/TPS): An Israeli airstrike killed 19 terrorists in a Hamas command centre inside a mosque located in a Gaza City school compound the Israel Defense Forces said on Saturday night.\nThe army also pushed back against unverified claims of widespread collateral damage from the strike.\nThe 19 terrorists confirmed killed were affiliated with Hamas and Palestinian Islamic Jihad.\nThe IDF released an infographic identifying each of the 19 killed and their affiliations.\nIsrael struck two Gaza City schools on Thursday used by Hamas for carrying out attacks."}, {"id": "25bc3eb8-5afc-4289-a853-5994ae202c4c", "title": "Escalation with Iran can be avoided with credible threats to its assets", "date": "2024-08-11 02:45", "url": "https://www.jpost.com/opinion/article-814123", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "America’s current approach to the threat of a large-scale Iranian attack against Israel is misguided and will not prevent regional war.\nThis approach by the US will not deter Iran or prevent a regional war.\nThe Iranian regime is much more vulnerable than it would like to appear.\nIran's Supreme Leader Ayatollah Ali Khamenei meets with Palestinian group Hamas's top leader Ismail Haniyeh in Tehran, Iran July 30, 2024.\nCountering a future attack by Iran and its proxies against US or Israeli interests will be much more dangerous if that attack takes place under an Iranian nuclear umbrella."}, {"id": "843eb2de-d9c3-4348-87bc-344f6c426ff5", "title": "Egypt Condemns Israeli Bombing Of School In Gaza", "date": "2024-08-11 04:00", "url": "https://menafn.com/1108540629/Egypt-Condemns-Israeli-Bombing-Of-School-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Daily News Egypt) Egypt on Saturday condemned Israel's bombing of a school sheltering displaced Palestinians in Gaza City, an attack that killed more than 100 people, including children.\nThe“Al-Tabeen” school in the Al-Daraj neighbourhood, east of Gaza City, was struck early Saturday morning, according to Palestinian officials.\nThe Hamas-run office said the strikes hit when people sheltering at the school were performing dawn prayers, leading to many casualties.\nThe attack on the school comes amidst a wider conflict between Israel and Hamas, with Israel continuing its offensive in Gaza.\nIn June, an Israeli strike on a school sheltering displaced Palestinians in central Gaza killed at least 33 people, including 12 women and children, according to local health officials."}, {"id": "80ecc40c-6a2b-4556-aa05-9461b35f1a8b", "title": "100 Palestinians killed in Israeli attack on Gaza school", "date": "2024-08-11 02:45", "url": "https://www.dailyfinland.fi/worldwide/38972/100-Palestinians-killed-in-Israeli-attack-on-Gaza-school", "domain": "dailyfinland.fi", "domain_classification": "Unknown", "message": "100 Palestinians killed in Israeli attack on Gaza schoolMore than 100 Palestinians were killed and dozens of others injured in an Israeli bombing of a school in the Gaza City in the early hours of Saturday, the Hamas-run Gaza government media office said, reported Xinhua.\nIsraeli warplanes bombed the school in the east of Gaza City, northern Gaza Strip, with three rockets and most of the injured that were transferred to the Ahli Arab Hospital in the city are in a very serious condition, the Palestinian official news agency WAFA reported.\nHamas condemned \"in the strongest terms\" the killings and held Israel and the U.S. administration fully responsible for this attack, its media office added in the statement.\nIsrael has been launching a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and about 250 taken hostage.\nThe Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to 39,699, Gaza-based health authorities said in a statement on Thursday."}, {"id": "c564cfb2-ebf7-444d-b2e9-039bf38d20ac", "title": "Ukraine president indirectly confirms daring military incursion onto Russian soil", "date": "2024-08-11 10:45", "url": "https://www.local10.com/news/world/2024/08/11/2-killed-in-kyiv-region-including-four-year-old-boy-in-russian-attacks/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Residents of an apartment building damaged after shelling by the Ukrainian side leave the area in Kursk, Russia, Sunday, Aug. 11, 2024.\nIt's the largest such attack since the Moscow launched its full-scale invasion on Feb. 24, 2022 and is unprecedented for its use of Ukrainian military units on Russian soil.\nUkraine's raid into Russia caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear, and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nRussia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine's air force said."}, {"id": "59fbf17e-4f49-4aff-b9a6-50c0ad288667", "title": "Israel faces anger over Gaza school strike rescuers say killed 93", "date": "2024-08-11 07:15", "url": "https://www.ewn.co.za/2024/08/11/israel-faces-anger-over-gaza-school-strike-rescuers-say-killed-93", "domain": "ewn.co.za", "domain_classification": "Unknown", "message": "GAZA CITY, PALESTINIAN TERRITORIES - Rescuers in Gaza said an Israeli air strike on a school housing displaced Palestinians killed 93 people on Saturday, sparking international condemnation despite Israel's insistence that it was targeting militants.\nCivil defence rescuers in the Hamas-ruled territory said three Israeli missiles hit the complex in Gaza City while people were performing dawn prayers.\nPalestinian militants seized 251 hostages, 111 of whom are still held in Gaza, including 39 the Israeli military says are dead.\nThe European Union's foreign policy chief Josep Borrell said the school strike left him \"horrified\".\nSavett, the US spokesman, said the Gaza City strike \"underscores the urgency of a ceasefire and hostage deal\"."}, {"id": "a712fc39-bbad-4e24-af41-50bd223e385c", "title": "Ron Johnson suggests FBI leaving Congress out of Trump shooting probe", "date": "2024-08-11 12:30", "url": "https://www.yahoo.com/news/ron-johnson-suggests-fbi-leaving-100000127.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wisconsin Sen. Ron Johnson (R) suggested the FBI is leaving Congress out of its probe into the assassination attempt on former President Trump.\n“Unfortunately, I think our congressional investigations will pretty well end up in an investigation of the FBI and Secret Service investigations.\nJohnson said that Congress has tried to interview local, state, and federal law enforcement about the failed July assassination attempt where a 20-year-old gunman struck Trump in the ear with a bullet.\nJohnson added that Congress had not received results of the autopsy of the shooter or much cooperation from federal authorities about the assassination attempt.\nRepublicans attacked former Secret Service Director Kimberly Cheatle almost immediately after the shooting, and she resigned in the wake of a Congressional hearing where she failed to give answers to most questions from lawmakers."}, {"id": "be0fca4f-80a9-4fbf-8d52-51fd97f8b578", "title": "Iran Update , August 10 , 2024 | Institute for the Study of War", "date": "2024-08-11 03:00", "url": "https://www.understandingwar.org/backgrounder/iran-update-august-10-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, August 10, 2024Annika Ganzeveld, Johanna Moore, Siddhant Kishore, and Brian CarterInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nIt also covers events and trends that affect the stability and decision-making of the Iranian regime.\nCTP-ISW previously assessed that Iran likely seeks to restore deterrence after its unsuccessful April 2024 attack while simultaneously trying to avoid a large-scale war with Israel.\n[5] Iran and its allies fired around 170 one-way attack drones, 30 cruise missiles, and 120 ballistic missiles at Israel in the April 2024 attack.\n[26] The al Aqsa Martyrs’ Brigades—the self-proclaimed militant wing of Fatah—mortared Israeli forces near Yabna camp south of Rafah city."}, {"id": "b2c5b294-e432-4874-bca6-e08f29249afd", "title": "Ukraine president indirectly confirms daring military incursion onto Russian soil", "date": "2024-08-11 14:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380367.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "In Russia, Kursk's regional governor said that a Ukrainian missile shot down by Russian air defenses fell on a residential building, wounding 13 people.\nRussia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine's Air Force said.\nSerhii Popko, head of the Kyiv City Military Administration said the it was the second time this month Kyiv was targeted.\nThe largest such attack since the full-scale invasion and unprecedented for its use of Ukrainian military units on Russian soil, it caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success."}, {"id": "1248e49b-b7f7-48b7-bf31-6736d3238bf7", "title": "Iranian MP claims : Attack on Israel will last several days", "date": "2024-08-11 05:30", "url": "https://www.israelnationalnews.com/news/394429", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A member of Iran's Parliament warned that the expected Iranian attack against Israel could last multiple days, Iranian opposition news source Iran International reported.\nAhmad Bakhshayesh Ardestani, who serves on the Iranian Parliament's National Security Commission, said on Saturday night in an interview with Iran Watch that \"Iran's aerial operations against Israel could last three to four days.\"\nArdestani added that Iran \"is certainly prepared for the consequences of such an attack and will be ready for any subsequent developments.\"\nHis comments come as US President Joe Biden was asked on Saturday night what his message is to Iran, who has threatened to attack Israel in retaliation for the elimination of Hamas political bureau chief Ismail Haniyeh in Tehran.\nIran has vowed to attack Israel in retaliation for the assassination of Hamas leader Ismail Haniyeh in Tehran a week and a half ago, an assassination for which Israel has not claimed responsibility."}, {"id": "121b7f71-0fef-44a2-84fb-3714026f0c0c", "title": "Anti - tank missile impacts in Netua , damage reported", "date": "2024-08-11 10:30", "url": "https://www.jpost.com/breaking-news/article-814216", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An anti-tank missile that crossed into northern Israel from Lebanon crashed in Netua, Army Radio reported on Sunday.\nThroughout Sunday, the IDF struck several Hezbollah military structures in the area of Odaisseh in southern Lebanon, the IDF reported Sunday afternoon.\nIAF strikes Hezbollah military structures in the area of Odaisseh, August 11, 2024.\n(credit: IDF Spokesperson's Unit)The hit caused damage to the community, but no casualties were reported.\nAnti-tank missiles seldom trigger alarms, and the IDF has trouble shooting them down due to their low-altitude flight trajectory."}, {"id": "9da94ad9-7171-4af1-ad8f-d1b835dde339", "title": "Israel faces anger over Gaza school strike rescuers say killed 93", "date": "2024-08-11 05:45", "url": "https://www.deccanchronicle.com/world/middle-east/israel-faces-anger-over-gaza-school-strike-rescuers-say-killed-93-1815586", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "The military confirmed it had used \"three precise munitions\".Mahmud Bassal, spokesman for the civil defence agency, said 11 children and six women were among the 93 who died at the school shelter, \"and there are many unidentified body parts\".\n\"Those who were inside the mosque were all killed,\" said local resident Abu Wassim.\n\"Even the floor above, where women and children were sleeping, was completely burned.\nIran and Hamas blamed Israel, which has not directly commented.Iran's mission to the United Nations on Saturday said the Islamic republic has \"the legitimate right to self-defence\" after its sovereignty was \"violated\".\n\"However, we hope that our response will be timed and conducted in a manner not to the detriment of the potential ceasefire,\" it said."}, {"id": "2918671e-5c1b-4903-bde7-7ac27c2bf8c7", "title": "World pours scorn on Israel for  horrifying and barbaric  bombing of Gaza school , rescuers say 93 killed", "date": "2024-08-11 02:45", "url": "https://www.malaymail.com/news/world/2024/08/11/world-pours-scorn-on-israel-for-horrifying-and-barbaric-bombing-of-gaza-school-rescuers-say-93-killed/146637", "domain": "malaymail.com", "domain_classification": "Unknown", "message": "GAZA CITY, Aug 10 — Rescuers in Gaza said an Israeli air strike on a school housing displaced Palestinians killed 93 people on Saturday, sparking international condemnation despite Israel’s insistence that it was targeting militants.\nCivil defence rescuers in the Hamas-ruled territory said three Israeli missiles hit the complex in Gaza City while people were performing dawn prayers.\nPalestinian militants seized 251 hostages, 111 of whom are still held in Gaza, including 39 the Israeli military says are dead.\nThe European Union’s foreign policy chief Josep Borrell said the school strike left him “horrified”.\nSavett, the US spokesman, said the Gaza City strike “underscores the urgency of a ceasefire and hostage deal”."}, {"id": "e040bfd1-5adf-48ad-9fb2-105bf442ddb7", "title": "Woman injured after argument leads to stabbing on North Side", "date": "2024-08-11 02:45", "url": "https://www.yahoo.com/news/woman-injured-argument-leads-stabbing-001227115.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Woman injured after argument leads to stabbing on North SideWoman injured after argument leads to stabbing on North SideCHICAGO — Police are searching for two people who stabbed a woman during an argument on the city’s North Side early Saturday morning.\nAccording to Chicago police, the incident unfolded around 3 a.m. in the 4400 block of North DuSable Lake Shore Drive, near Montrose Beach in Uptown.\nRead more: Latest Chicago news headlinesOfficers said a 20-year-old woman got into an argument with two other people before the altercation turned physical.\nThe two people then battered the woman and stabbed her in the back several times.\nLATEST CASES: Missing people in ChicagolandOfficers say no arrests have been made and an investigation into the stabbing is now underway."}, {"id": "0b62735f-eb8c-4b65-a68a-c24e78792d44", "title": "Hezbollah stages unprecedented strike on Israeli forces after Hamas cmdr . assassination", "date": "2024-08-11 03:15", "url": "https://www.presstv.ir/Detail/2024/08/10/731126/Lebanon-Israel-Hezbollah-strike-retaliation-Hamas-commander-assassination", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The Lebanese resistance movement Hezbollah has staged an unprecedented retaliatory strike on Israeli forces stationed in the northern part of the occupied Palestinian territories after an Israeli attack that assassinated a senior Hamas’ commander in Lebanon.\nOn Saturday, Hezbollah reported targeting the Michve Alon base, which it identified as a gathering and mobilization site for Israeli troops and an emergency storage facility near the town of Safad, for the first time.\nThe Palestinian resistance movement has acknowledged losing al-Hajj to “a treacherous Zionist strike.”Late Hamas' commander Samer al-HajjThe Israeli regime has been conducting near-daily attacks against the southern parts of Lebanon since October 7, when it launched a genocidal war on Gaza.\nHezbollah has been responding with strikes aimed both at retaliating against the regime and supporting the war-hit Gazans.\nHezbollah has vowed to defend the Lebanese soil with all its resources."}, {"id": "6ed66c0c-5e38-483c-9990-a8b07a0cef2c", "title": "DRDO MPATGM Successfully Tested in Pokhran – Indian Defence Research Wing", "date": "2024-08-11 05:00", "url": "https://idrw.org/drdos-mpatgm-successfully-tested-in-pokhran/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "DRDO’s MPATGM Successfully Tested in Pokhran| BySOURCE: AFIIn a significant milestone for India’s defense capabilities, the Defence Research and Development Laboratory (DRDO) and the Indian Army successfully conducted two validation trials of the Man Portable Anti-Tank Guided Missile (MPATGM) on July 2nd at the Pokhran test range.\nThe trials were a resounding success, with live warheads accurately destroying thermal target systems that simulated Main Battle Tanks (MBTs).\nThe missile demonstrated its precision by meeting the Army’s stringent requirements, including a maximum range of 2.5 kilometers for top attack mode and a minimum range of 200 meters for direct attack mode.\nWith the successful completion of these validation trials, Bharat Dynamics Limited (BDL) will now commence the production of MPATGM for user trials.\nThis indigenously developed missile system is set to provide a substantial boost to the Indian Army’s firepower and enhance its capabilities in the modern battlefield."}, {"id": "ccf95c5f-0c2a-4e45-a27b-e3f112311cb2", "title": "  This has to stop : plea by survivors of deadly IDF strike on school in Gaza | Israel - Gaza war", "date": "2024-08-11 14:30", "url": "https://www.theguardian.com/world/article/2024/aug/11/this-has-to-stop-plea-survivor-israel-strike-gaza-tabeen", "domain": "theguardian.com", "domain_classification": "International", "message": "View image in fullscreen The yard of the school after being hit by an Israeli strike on Saturday.\nIsrael has again faced international outrage for targeting civilian infrastructure in its campaign against Hamas in Gaza.\nIt has said the school was being used as a command centre by Hamas and its smaller ally, Islamic Jihad.\nIsrael blames Hamas for civilian casualties, saying its fighters use the civilian population as cover, which makes buildings such as schools and hospitals valid targets.\n“This has to stop.”Even having endured such loss in Saturday’s attack, Jabari said her family would not be leaving Gaza City to seek shelter elsewhere."}, {"id": "17e002a5-4202-4324-87b8-2a3935f0f9d5", "title": "Russian Missiles Target Kyiv Overnight , Killing At Least 2", "date": "2024-08-11 08:00", "url": "https://www.rferl.org/a/ukraine-russia-missile-attack-kyiv-kursk-belgorod/33074310.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "The cross-border action in Russia's Kursk region has been described as the biggest attack on Russian soil since Russian President Vladimir Putin launched his country's unprovoked, full-scale invasion of Ukraine in February 2022.\nWATCH: Scenes of destruction in Russia's Kursk region continue to be shared online following a surprise cross-border incursion.\nIn the video, which was posted on Ukrainian media, one of the soldiers says that Sudzha and the Gazprom facility is controlled by Ukrainian forces.\nEarlier on August 9 the Ukrainian military said it had hit the airfield in Russia's southern Lipetsk region overnight, damaging guided-bomb stockpiles.\nElsewhere, unconfirmed reports spoke of a Russian column having been destroyed in the Kursk region with many casualties."}, {"id": "38f2afea-7369-47c2-b843-b5fa9befcb3b", "title": "Man in custody after double stabbing at rehab facility in Somerton neighborhood of Philadelphia", "date": "2024-08-11 00:15", "url": "https://6abc.com/post/man-custody-after-double-stabbing-rehab-facility-somerton-neighborhood-philadelphia/15170199/", "domain": "6abc.com", "domain_classification": "Unknown", "message": "Man in custody after double stabbing at rehab facility in PhiladelphiaMan in custody after double stabbing at rehab facility in PhiladelphiaMan in custody after double stabbing at rehab facility in PhiladelphiaMan in custody after double stabbing at rehab facility in PhiladelphiaMan in custody after double stabbing at rehab facility in PhiladelphiaPHILADELPHIA (WPVI) -- A man is in custody after two people were stabbed at a rehab facility in Philadelphia's Somerton neighborhood on Saturday.\nThe double stabbing happened just after noon on the 600 block of Edison Avenue.\nDamon told Action News that his wife and son were stabbed while in the back of the rehab building where they work.\nNow, Damon says his wife and son, 47-year-old Shanelle May and 20-year-old Damon Butts Jr., are recovering at Jefferson Torresdale Hospital.\nDamon says he's thankful his wife and son are alive, but it's going to be a long healing process."}, {"id": "2141a80c-e22a-459c-aa08-8a66cb4518f3", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 02:45", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/violent-rioters-could-face-up-to-10-years-in-jail-top-prosecutor-warns/a1533636437.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson reportedly said charging violent protesters with rioting was under consideration (Aaron Chown/PA)The director of public prosecutions has reportedly warned that the worst offending protesters could face up to 10 years in prison if they are charged with rioting.\nStephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "e6ebffa3-f359-4c5d-96f3-c472c49dd389", "title": "Middle East : Nearly 100 Dead After Israel Strikes Gaza School ; US Troops In Syria Injured After Drone Attack", "date": "2024-08-11 04:00", "url": "https://www.outlookindia.com/international/middle-east-iran-israel-gaza-school-strike-al-tabin-anti-netanyahu-protest-us-troops-syria-drone-attack", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "Israel-Hamas War Day 310Israeli strikes on al-Tabin school in Gaza's Daraj has killed at least 100 civilians.\nAs per local reports and the Gaza Hea;the Ministry, the over 93 people were killed in Saturday's strike.\n\"So far, there are more than 93 martyrs, including 11 children and six women.\nThe latest school strike added to the frustration amongst Israelis who once again poured into the streets calling for a ceasefire and urgent hostage deal.\nProtestors in Tel Aviv and Haifa held up signs of \"Bibi stop wasting time\" as they called for urgent action from the Israeli government to end the war."}, {"id": "bdd38078-1c8f-42ec-8821-4b24cc927fd7", "title": "AP News in Brief at 6 : 04 a . m . EDT | iNFOnews | Thompson - Okanagan News Source", "date": "2024-08-11 10:45", "url": "https://infotel.ca/newsitem/world-briefly/cp1671530890", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "The vast majority of Gaza's population of 2.3 million people have been displaced by the 10-month old war, often multiple times.\nThe Associated Press and other news organizations brought a lawsuit after the officials initially refused to publicly release the information.\nThe massacre, which left 19 students and two teachers dead, was one of the worst school shootings in U.S. history.\nIran’s mission to the United Nations, when asked about the claim of the Trump campaign, denied being involved.\n___Paris and the Olympics have changed each other during their summer flingPARIS (AP) — In French, there are no goodbyes."}, {"id": "ec2901b5-101b-4258-af10-0b8c9c12108c", "title": "More than 90 Palestinians killed in Israeli strike on school and mosque sheltering displaced people , Gaza officials say", "date": "2024-08-11 00:15", "url": "https://www.cbs58.com/news/more-than-90-palestinians-killed-in-israeli-strike-on-school-and-mosque-sheltering-displaced-people-gaza-officials-say", "domain": "cbs58.com", "domain_classification": "Unknown", "message": "Israeli strike on mosque and school in Gaza kills scores, sparking international outrageOmar al-Qatta/AFP/Getty Images via CNN NewsourceBy Irene Nasser, Abeer Salman, Ibrahim Dahman, Mohammed Tawfeeq, Lex Harvey and Allegra Goodwin(CNN) — At least 93 Palestinians have been killed in an Israeli strike on a school and mosque in Gaza sheltering displaced people, according to local officials, sparking international outrage.\nIsrael confirmed it carried out the strike, saying it had targeted a Hamas command post and killed several fighters.\nSaturday’s strike is the fifth on a school in Gaza by the Israeli military since last Sunday, according to CNN’s previous reporting.\nUm Ahmed told CNN the mosque was full of young people who were “all in pieces and dismembered” in the aftermath of the strike.\nPalestinian officials told CNN that Israel did not give civilians any warning before the airstrikes occurred."}, {"id": "bac45e28-1690-41dc-990c-d424299f32b8", "title": "Russian missile attack kills 2 in Kyiv", "date": "2024-08-11 07:30", "url": "https://www.albawaba.com/news/russian-missile-attack-kills-2-kyiv-1580882", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - An overnight Russian missile attack on Kyiv killed 2 people, with explosions ringing out across the Ukrainian capital.\nA missile fragment fell on residential buildings in Kyiv's neighboring Brovary district, according to Ukraine's State Emergency Service on Telegram.\nThe defense ministry also added that the Russian drones were attacking five other regions simultaneously.\n⚠️🔞A 4-year-old boy and his father died in the Kyiv region as a result of a Russian missile attack.\nMany Ukrainians have grown concerned in recent days that Moscow may start air assaults in reaction to Kyiv's recent incursion into Russian territory."}, {"id": "9240eed6-1c9c-41ac-828e-c0b966a32bf6", "title": "Antisemitic attack on Jewish man in New York - The Jerusalem Post", "date": "2024-08-11 06:30", "url": "https://www.jpost.com/breaking-news/article-814188", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A young Jewish man was stabbed by a stranger shouting \"free Palestine\" close to the Chabad Headquarters in Crown Heights on Saturday, Chabad Lubavitch confirmed.\nAccording to COLlive, a Chabad publication, the attack happened at around 2am local time, near Eastern Parkway and Kingston Avenue.\nThe perpetrator, reportedly a black male in his early 20s, asked the victim, \"Do you want to die?\"\nCrown Heights Brooklyn - 22 year old antisemite Vincent Sumpter goes on stabbing spree screaming “Free Palestine”, injures one Jewish man.\nAccording to Yaacov Behrman, who runs PR for Chabad, local residents were able to detain the attacker until the police arrived and arrested him."}, {"id": "d4d22279-bd33-4a6c-a9a7-834a6ebfa85d", "title": "HATE IN CROWN HEIGHTS : Lubavitch Bochur Stabbed On Shabbos By Man Shouting  Free Palestine  – The Yeshiva World", "date": "2024-08-11 03:00", "url": "https://www.theyeshivaworld.com/news/general/2304586/hate-in-crown-heights-lubavitch-bochur-stabbed-on-shabbos-by-man-shouting-free-palestine.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "A chilling hate crime occurred in Crown Heights at around 2 AM Shabbos morning, when a Lubavitch bochur was stabbed near Eastern Parkway and Kingston Avenue, close to Chabad Headquarters, by a man shouting “Free Palestine!”The perpetrator, a black male in his early 20s, also asked the victim if he wanted to die before the attack.\nLocals quickly responded to the stabbing, detaining the attacker until police arrived to make an arrest a few blocks away.\nThe victim was transported to the hospital and is expected to recover thanks to the swift response of paramedics.\nThe incident is being investigated by the NYPD’s Hate Crimes unit.\n(YWN World Headquarters – NYC)"}, {"id": "6bdf9de5-5bc8-42a1-99e8-dab9737eaaf9", "title": "Russia launches airstrike on Ukraine capital Kyiv", "date": "2024-08-11 07:15", "url": "https://tribune.com.pk/story/2487195/russia-launches-airstrike-on-ukraines-capital-kyiv", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Ukrainian service personnel use a searchlight as they search for drones in the sky over the city during a Russian drone strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine July 31, 2024.\nPHOTO:REUTERSRussia launched an air attack on Kyiv, with air defence systems engaged on the outskirts of the city in repelling the strikes, the mayor of the Ukrainian capital and military administration officials said early on Sunday.\n\"Air defence units operating, air raid alert continues,\" Kyiv Mayor Vitali Klitschko wrote on the Telegram messaging app.\nReuters witnesses said they heard at least two explosions in what sounded like air defence units at work.\nKyiv, its surrounding region and all of eastern Ukraine were under air raid alerts, Ukraine's air force said on Telegram."}, {"id": "ee334be5-0d99-41db-b51f-dcea7b15df56", "title": "Hezbollah attacks Israeli base with swarms of suicide drones", "date": "2024-08-11 07:00", "url": "https://www.orissapost.com/hezbollah-attacks-israeli-base-with-swarms-of-suicide-drones/", "domain": "orissapost.com", "domain_classification": "Unknown", "message": "Beirut: Hezbollah has attacked an Israeli base located southwest of Safed city in northern Israel with successive swarms of suicide drones, causing injuries among its members.\n“On Saturday, the Islamic Resistance fighters launched an air attack with swarms of suicide drones on the Michve Allon base,” Hezbollah said in a statement.\nAn Israeli drone strike killed the Hamas official, Samer al-Hajj, Friday at the eastern entrance to the city of Sidon, Xinhua news agency reported.\nMeanwhile, the Lebanese military sources, who spoke anonymously, told the news agency that Israeli drones and warplanes carried out 10 airstrikes on six villages and towns during the day in the border area of southern Lebanon, injuring three civilians and destroying 18 homes.\nA state of anticipation and caution prevails in Lebanon following Israel’s attack on Dahieh in Beirut’s southern suburbs, killing Hezbollah senior military commander Fouad Shokor."}, {"id": "8d698acd-a6ab-403d-8039-7d5ec6f3eba0", "title": "2 killed in Russian attacks on Kyiv region , including 4 - year old boy", "date": "2024-08-11 08:00", "url": "https://www.yahoo.com/news/2-killed-kyiv-region-including-070009003.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Residents of an apartment building damaged after shelling by the Ukrainian side leave the area in Kursk, Russia, Sunday, Aug. 11, 2024.\nIt's the largest such attack since the Moscow launched its full-scale invasion on Feb. 24, 2022 and is unprecedented for its use of Ukrainian military units on Russian soil.\nUkraine's raid into Russia caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear, and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nRussia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine's air force said."}, {"id": "0b6d9e89-41a9-40f4-844e-74db05fdc931", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 03:00", "url": "https://www.thetelegraphandargus.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "dece3554-03c2-4d78-a821-dc7085854740", "title": "Israel - Gaza war : Kamala Harris condemns civilian deaths in school strike", "date": "2024-08-11 07:30", "url": "https://www.bbc.co.uk/news/articles/cn0lx2xgn55o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Israel's military said it had \"precisely struck Hamas terrorists operating within a Hamas command and control centre embedded in the al-Taba'een school\".\nA statement by the Israel Defense Forces (IDF) and the Israeli Security Agency said \"at least 19 Hamas and Islamic Jihad terrorists\" were \"eliminated\" in the attack.\nHamas described the attack as a \"horrific crime and a dangerous escalation\" in Israel's \"war of extermination against the Palestinian people\".\nUS National Security Council spokesman Sean Savett said Hamas had been using schools \"as locations to gather and operate out of\".\n\"But we have also said repeatedly and consistently that Israel must take measures to minimise civilian harm,\" he added."}, {"id": "823eea64-496c-48d0-add1-39efd2be52da", "title": "2 killed in Kyiv region , including four - year old boy , in Russian attacks", "date": "2024-08-11 07:30", "url": "https://www.clickorlando.com/news/world/2024/08/11/2-killed-in-kyiv-region-including-four-year-old-boy-in-russian-attacks/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Residents of an apartment building damaged after shelling by the Ukrainian side leave the area in Kursk, Russia, Sunday, Aug. 11, 2024.\nIt's the largest such attack since the Moscow launched its full-scale invasion on Feb. 24, 2022 and is unprecedented for its use of Ukrainian military units on Russian soil.\nUkraine's raid into Russia caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear, and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nRussia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine's air force said."}, {"id": "8429d7b5-cf2c-4013-bfd5-c86cbbda1d94", "title": "Webster man convicted of stabbing Shreveport woman", "date": "2024-08-11 02:45", "url": "https://www.yahoo.com/news/webster-man-convicted-stabbing-shreveport-004945855.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SHREVEPORT, La.\n(KTAL/KMSS) — A Webster Parish man was convicted on Friday of a stabbing that left a Shreveport woman critically wounded in her home.\n“While bleeding profusely from the neck, the victim locked herself inside her home and called 911.\n“In recovery, the victim identified Mosley, who had been captured within hours of the attack, as her assailant, from a six-person photographic lineup,” detailed the news release.\nIn a different case, the district attorney’s office confirmed, two years prior, on August 29, 2020, Mosely pleaded his attempted second-degree murder case down to aggravated battery for stabbing a 40-year-old man in North Shreveport."}, {"id": "21166b04-0751-4705-a5b6-d474dda999c7", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 02:45", "url": "https://www.ipswichstar.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "4f35f205-4f8d-4a85-934c-fd8f025588ba", "title": "Two killed in Russian attacks on Kyiv region , including 4 - year old boy", "date": "2024-08-11 07:45", "url": "https://www.bostonglobe.com/2024/08/11/world/two-killed-kyiv-region-including-four-year-old-boy-russian-attacks/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Russia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine’s Air Force said.\nOvernight into Sunday, a Russian drone and missile barrage on Kyiv killed two people including a 4-year-old boy.\nIn Russia, Kursk’s regional governor said that a Ukrainian missile shot down by Russian air defenses fell on a residential building, wounding 13 people.\nThe largest such attack since the full-scale invasion and unprecedented for its use of Ukrainian military units on Russian soil, it caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success."}, {"id": "47cee6ab-dddf-4f04-af22-f9a52abc6235", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 03:00", "url": "https://www.thenorthernecho.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "60d0914d-3852-4589-980c-d304c49c063f", "title": "World leaders  appalled  by deadly Israeli strike on Gaza school", "date": "2024-08-11 02:45", "url": "https://www.lemonde.fr/en/international/article/2024/08/11/world-leaders-appalled-by-deadly-israeli-strike-on-gaza-school_6712632_4.html", "domain": "lemonde.fr", "domain_classification": "Local - Europe", "message": "Palestinians look at the damage at the site of an Israeli strike on a school sheltering displaced people, amid the Israel-Hamas conflict, in Gaza City August 10, 2024.\nMAHMOUD ISSA / REUTERSFriends and foes of Israel on Saturday denounced the August, 10, Israeli strike that killed scores of displaced civilians in a Gaza school, renewing calls for an immediate ceasefire.\nThe strike \"underscores the urgency of a ceasefire and hostage deal, which we continue to work tirelessly to achieve\", the statement added.\nVice president Kamala Harris, speaking to reporters traveling with her in Phoenix, Arizona, on Saturday, said of the Israeli strike in Gaza: \"Yet again, far too many civilians have been killed.\"\nThe European Union foreign policy chief Josep Borrell said he was \"horrified by images from a sheltering school in Gaza hit by an Israeli strike."}, {"id": "fea8d771-4ec8-4d9b-b11e-bb8dacbabe76", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 03:00", "url": "https://www.bucksfreepress.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "f4f48320-febc-45e9-9cdb-5bd65a8347cd", "title": "2 killed in Russian attacks on Kyiv region , including 4 - year old boy", "date": "2024-08-11 07:45", "url": "https://www.wsls.com/news/world/2024/08/11/2-killed-in-kyiv-region-including-four-year-old-boy-in-russian-attacks/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Residents of an apartment building damaged after shelling by the Ukrainian side leave the area in Kursk, Russia, Sunday, Aug. 11, 2024.\nIt's the largest such attack since the Moscow launched its full-scale invasion on Feb. 24, 2022 and is unprecedented for its use of Ukrainian military units on Russian soil.\nUkraine's raid into Russia caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\nThe exact aims of the operation remain unclear, and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nRussia attacked Ukraine with four ballistic missiles and 57 Shahed drones, Ukraine's air force said."}, {"id": "f50302ad-09b6-4234-aaf7-da1b9f53d604", "title": "Iran is accelerating cyber activity that appears meant to influence the US election , Microsoft says - New Delhi Times - India Only International Newspaper", "date": "2024-08-11 06:15", "url": "https://www.newdelhitimes.com/iran-is-accelerating-cyber-activity-that-appears-meant-to-influence-the-us-election-microsoft-says/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Iran is accelerating online activity that appears intended to influence the U.S. election, in one case targeting a presidential campaign with an email phishing attack, Microsoft said Friday.\nIran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election.\nMicrosoft’s report identified four examples of recent Iranian activity that the company expects to increase as November’s election draws closer.\nDays later, the Iranian group tried to log into an account that belonged to a former presidential candidate, but wasn’t successful, Microsoft’s report said.\nA third example Microsoft cited found that Iranian groups are impersonating U.S. activists, potentially laying the groundwork for influence operations closer to the election."}, {"id": "f1766b0e-050c-4ecf-9b57-1954ca4d2805", "title": "Apocalypse draws near", "date": "2024-08-11 03:00", "url": "https://trinidadexpress.com/opinion/columnists/apocalypse-draws-near/article_fe3eeddc-5778-11ef-8e46-d70891cd9db1.html", "domain": "trinidadexpress.com", "domain_classification": "Unknown", "message": "As the country continues down the dangerous path we’re on, we have become desensitised to the most terrible things.\nBut as we look at everything with jaded eyes, one crucial thing has slipped from national consciousness: the fate of our children who are languishing in refu­gee camps in the Middle East."}, {"id": "618f81d5-e39b-4553-b8c2-9f0182dc5a4f", "title": "Israel appeasement of terror attacks is leading to all - out war", "date": "2024-08-11 06:30", "url": "https://www.jpost.com/opinion/article-814130", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In the realm of military strategy, Sun Tzu’s The Art of War has stood the test of time.\nIsrael’s targeted strike eliminating Fuad Shukr is not putting an end to their war against us.\nBACK IN 2006, the United Nations decided upon UN Resolution 1701, which ended the Second Lebanon War.\nThe failure of the international community to hold up international law thereby protecting Israel is directly responsible for the war against Israel from Lebanon today.\nThis irony will ultimately force Israel into a more comprehensive conflict resolution strategy, a full-out war with Israel’s full strength, to destroy Hezbollah’s military capabilities in southern Lebanon."}, {"id": "6ae241f1-a11f-4efa-91b5-592878fee747", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 00:00", "url": "https://www.theboltonnews.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "47bb3d41-4360-4c29-a5eb-98b9043589fa", "title": "Powerful Explosions In Kursk , Kurchatov And Voronezh", "date": "2024-08-11 10:30", "url": "https://charter97.org/en/news/2024/8/11/606280/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Powerful Explosions In Kursk, Kurchatov And Voronezh 17 11.08.2024, 8:1831,120Russians reported a massive attack.\nOn the night of Sunday, August 11, the Kursk region of the Russian Federation was restless.\nThe residents reported a massive missile attack, and explosions in Kursk and Kurchatov, a fire broke out in the regional center due to the work of Russian air defence, Obozrevatel.\nActing Governor of the Kursk region Alexey Smirnov reported \"the work of air defence\".\nThe operational situation is under control,\" the Voronezh governor wrote."}, {"id": "c7021526-3f70-470d-8dbe-cd800f1112f7", "title": "Israel widens evacuation order after deadly strike on Gaza school - turned - shelter", "date": "2024-08-11 08:00", "url": "https://www.edp24.co.uk/news/national/24510899.israel-widens-evacuation-order-deadly-strike-gaza-school-turned-shelter/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Israel has repeatedly ordered mass evacuations as its troops have returned to heavily destroyed areas where they had previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\n“This is my fourth displacement,” said the 42-year-old widow, whose husband was killed when an Israeli air strike hit their neighbours’ house in March.\nThe conflict has meanwhile threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nThe strike on Saturday hit a mosque inside a school in Gaza City where thousands of people were sheltering."}, {"id": "061fc339-7f26-4415-b7c7-c6bbceaf791f", "title": "Several Americans wounded in attack on US forces in Syria", "date": "2024-08-11 05:15", "url": "https://www.israelnationalnews.com/news/394423", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Several US and coalition personnel were wounded in a drone attack on Friday in Syria, a US official told Reuters on Saturday.\nSeveral troops were moved to a different location for further evaluation, the official told Reuters.\nNo group has claimed responsibility for the attack, the official said, but similar attacks in the past have been carried out by Iranian-backed militia.\nAnother rocket attack on the Ain al-Asad base on Monday wounded seven US personnel.\nFriday's attack took place at Rumalyn Landing Zone, which hosts US troops along with those from the US-led coalition, according to Reuters."}, {"id": "6f3cc9ae-c3d5-4f93-94a7-d7fed79321b3", "title": "Several Americans wounded in attack on US forces in Syria", "date": "2024-08-11 06:45", "url": "http://www.israelnationalnews.com/news/394423", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Several US and coalition personnel were wounded in a drone attack on Friday in Syria, a US official told Reuters on Saturday.\nSeveral troops were moved to a different location for further evaluation, the official told Reuters.\nNo group has claimed responsibility for the attack, the official said, but similar attacks in the past have been carried out by Iranian-backed militia.\nAnother rocket attack on the Ain al-Asad base on Monday wounded seven US personnel.\nFriday's attack took place at Rumalyn Landing Zone, which hosts US troops along with those from the US-led coalition, according to Reuters."}, {"id": "40f93e6c-cd53-4a95-ac89-3367bdecd66a", "title": "Violent rioters could face up to 10 years in jail , top prosecutor warns", "date": "2024-08-11 04:15", "url": "https://www.eveningnews24.co.uk/news/national/24510850.violent-rioters-face-10-years-jail-top-prosecutor-warns/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "Stephen Parkinson, head of the Crown Prosecution Service (CPS), said hundreds of violent rioters will continue appearing in courts across the country in the coming days, the Sunday Times said.\nMr Parkinson reportedly told of a “new phase” of cases which will include “more serious charges with stiffer penalties”.\nMany charged so far have been prosecuted for violent disorder, which carries a maximum sentence of five years.\n“It’s not about exacting revenge, it’s about delivering justice.”It comes as the parents of a “precious” six-year-old girl killed in the Southport attack said that their older daughter saw and escaped the stabbing.\nThe National Police Chiefs’ Council (NPCC) said 779 people have been arrested over rioting, of whom 349 have been charged."}, {"id": "fceb9fd5-29f2-4124-80d0-d663e9747511", "title": "2 killed in Russian attacks on Kyiv region , including 4 - year old boy – Winnipeg Free Press", "date": "2024-08-11 08:00", "url": "https://www.winnipegfreepress.com/world/2024/08/11/2-killed-in-kyiv-region-including-four-year-old-boy-in-russian-attacks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "It’s the largest such attack since the Moscow launched its full-scale invasion on Feb. 24, 2022 and is unprecedented for its use of Ukrainian military units on Russian soil.\nUkraine’s raid into Russia caught Moscow unaware and was an embarrassment to Russian military leaders who have scrambled to contain the breach.\n(AP Photo)The exact aims of the operation remain unclear, and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nOvernight into Sunday, a Russian drone and missile barrage on Kyiv killed two people, including a 4-year-old boy.\nResidents of the apartment building damaged after shelling by the Ukrainian side leave an area in Kursk, Russia, Sunday, Aug. 11, 2024."}, {"id": "26ab846f-11c6-44af-96f7-8ecaaad586a8", "title": "Khushi calls working with Dhairya Karwa in  Gyaarah Gyaarah  a great experience", "date": "2024-08-11 07:00", "url": "https://www.siasat.com/khushi-calls-working-with-dhairya-karwa-in-gyaarah-gyaarah-a-great-experience-3077176/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Mumbai: Actress Khushi Bhardwaj, who is gearing up for the release of her upcoming thriller series ‘Gyaarah Gyaarah’, has opened up about working with Dhairya Karwa and portraying a character with shades.\nThe series is a thriller which was one major reason for me to take it up,” added the 16-year-old actress.\nPraising director Umesh Bist, Khushi said he was one of the other reasons why she said yes to the project.\nI have also noticed that the production house has a lot of females and that’s really something which I am happy with.”In the series, Khushi has most of her scenes with ‘Gehraiyaan’ actor Dhairya Karwa.\nWorking with Dhairya Karwa was a great experience.”Asked about the challenging parts of shooting ‘Gyaarah Gyaarah’, she said: “We were shooting in February in the hills and the temperature was freezing."}, {"id": "ebd22f28-15db-4aca-810a-a99d45f3694a", "title": "Israel - Hamas War day 309 : What happening in Israel and Iran ? ", "date": "2024-08-11 07:00", "url": "https://www.jpost.com/israel-hamas-war/2024-08-11/live-updates-814190", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "breaking news (photo credit: JPOST STAFF)Mustafa Barghouti, a member of the Palestinian Legislative Council, claimed on X, formerly Twitter, on Sunday that the IDF was being dishonest about the 19 terrorists eliminated on Saturday during a strike on a Hamas HQ embedded in a Gazan school.\n“Exposing the lies of the Israeli army: Among the names of what the Israeli army claimed were Hamas fighters in the Tabein school that was bombarded yesterday were Muntaser Daher and yousef al Wadia,” Barghouti wrote.\n“It turned out that both of these people were already killed by the Israeli army in a completely different place 24 hours before the bombardment of Altabein School where 100 Palestinian civilians were killed.\n“Other names on the Israeli list were names of children who could not be fighters.”Exposing the lies of the Israeli army: Among the names of what the Israeli army claimed were Hamas fighters in the Tabein school that was bombarded yesterday were Muntaser Daher and yousef al Wadia.\nIt turned out that both of these people were already killed by the Israeli army… pic.twitter.com/XAJSRoWq69 — Mustafa Barghouti @Mustafa_Barghouti (@MustafaBarghou1) August 11, 2024Barghouti did not cite the source of his claims but included screenshots of Facebook posts."}, {"id": "6af3d432-7e2e-496f-8964-643bf6aa438b", "title": "Two killed in Russian missile attack on Kyiv", "date": "2024-08-11 05:15", "url": "https://www.thehindu.com/news/international/two-killed-in-russian-missile-attack-on-kyiv/article68512102.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "A man and his four-year-old son were killed in an overnight Russian missile attack near the Ukrainian capital Kyiv, the emergency service said Sunday (August 11, 2024).\nExplosions rang out Saturday (August 10, 2024) night in the center and east of Kyiv, as Ukraine's Air Force said two Russian missiles were headed towards the city.\nUkraine's air force said five other regions were being attacked by drones.\nFragments of a missile fell on residential buildings in Brovary district, neighbouring Kyiv, the State Emergency Service of Ukraine said on Telegram.\nUkraine has been regularly hit by deadly Russian air strikes from missiles and drones."}, {"id": "853a5cbc-7ad8-4746-8f79-551c7fa5852d", "title": "Israel widens evacuation order after deadly strike on Gaza school - turned - shelter", "date": "2024-08-11 08:30", "url": "https://www.lbc.co.uk/world-news/400324c440584a4085ee264f32954468/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Israel said it had targeted a militant command post, killing at least 19 Hamas and Islamic Jihad militants.\nThe Israeli military ordered more evacuations in southern Gaza early on Sunday after a deadly air strike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\nPeople inspect the dome at a school hit by an Israeli air strike in Gaza City Saturday (AP)Hundreds of thousands have crammed into squalid tent camps with few public services or sought shelter in schools like the one struck on Saturday.\n“This is my fourth displacement,” said the 42-year-old widow, whose husband was killed when an Israeli air strike hit their neighbours’ house in March.\nThe strike on Saturday hit a mosque inside a school in Gaza City where thousands of people were sheltering."}, {"id": "e49e4e0d-fe96-4ce2-899b-94f4de40fb55", "title": "US  deeply concerned  about Israel deadly school hit", "date": "2024-08-11 00:00", "url": "https://www.nzherald.co.nz/world/us-deeply-concerned-about-israels-deadly-school-hit/NMFIDNXZPRGOBAPHHQK52DX47E/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Washington has faced mounting domestic and international criticism, including from human rights groups, for its military support for Israel.\nThe statement also said “far too many civilians continue to be killed and wounded” in the Gaza war and reiterated calls for a ceasefire.\nThe US comments followed condemnation of the attack from Egypt, Qatar, the United Arab Emirates, Saudi Arabia, and Turkey.\nTens of thousands of displaced Palestinians have sought shelter in Gaza’s schools, most of which have been closed since the war began 10 months ago.\nWashington and regional mediators have tried to nail the Gaza ceasefire-for-hostages deal but have run into repeated obstacles."}, {"id": "3f562339-d145-4920-a856-832804083b77", "title": "Russia Shells Kyiv Region - There Are Dead And Wounded", "date": "2024-08-11 07:45", "url": "https://menafn.com/1108541020/Russia-Shells-Kyiv-Region-There-Are-Dead-And-Wounded", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- AzerNews) Two people died as a result of shell debris falling on private houses during a rocket attack by the Russian on the Brovary district of the Kyiv region of Ukraine.\nAccording to Azernews , the country's State Service for Emergency Situations said in a telegram channel.\n\"Tonight, rocket fragments fell on private residential buildings in Brovary district.\n\"Unfortunately, they were found dead during search and rescue operations,\" the State Service pointed out.\nIt should be noted that the Russian Armed Forces launched a ballistic missile and drone attack on various areas of Ukraine on the night of August 10-11."}, {"id": "0bd0b622-ac6a-41d2-a3d4-3c15c8cd52cf", "title": "Israeli strike on sheltering Gaza school , mosque leaves heartbreaking carnage", "date": "2024-08-11 01:15", "url": "https://www.hngn.com/articles/262664/20240810/heartbreaking-carnage-in-wake-of-israeli-strike-on-gaza-school.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "(Photo : EYAD BABA/AFP via Getty Images)An injured child cries in the yard of the Al-Aqsa Martyrs hospital in Deir el-Balah in the central Gaza Strip, following an overnight Israeli strike Friday.\nDawn prayers were shattered by the early morning triple air strike from Israeli warplanes, which gutted Al-Tabieen religious school and mosque in Gaza City.\nIsraeli military spokesperson Lieutenant-Colonel Nadav Shoshani said that about 20 Hamas and Islamic militants were operating from the Al-Tabieen complex.\nLater on Saturday, Gaza civil defense agency spokesman Mahmud Bassal told journalists that the strike \"directly targeted\" two floors of the school.\nPalestinian militants seized 251 hostages, 111 of whom are still held in Gaza, including 39 the Israeli military says are dead."}, {"id": "e9a037a4-b002-489f-9885-e90818ad412a", "title": "Israeli air strike on school in Gaza City kills more than 70 people", "date": "2024-08-11 03:00", "url": "https://www.fijivillage.com/news/Israeli-air-strike-on-school-in-Gaza-City-kills-more-than-70-people-8x4r5f/", "domain": "fijivillage.com", "domain_classification": "Unknown", "message": "Israeli air strike on school in Gaza City kills more than 70 peopleIsraeli air strike on school in Gaza City kills more than 70 people[Image: bbc]An Israeli air strike on a school building sheltering displaced Palestinians in Gaza City has killed more than 70 people.\nAn Israeli military spokesman says al-Taba’een school served as an active Hamas and Islamic Jihad military facility, which the Hamas denied.\nAccording to the United Nations, 477 out of 564 school buildings in Gaza had been directly hit or damaged as of 6 July, with more than a dozen targeted since.\nIsrael's military says it had precisely struck Hamas terrorists operating within a Hamas command and control centre embedded in the al-Taba'een school.\nA statement by the Israel Defense Forces (IDF) and the Israeli Security Agency stated that at least 19 Hamas and Islamic Jihad terrorists were eliminated in the attack."}, {"id": "2e9d1829-719c-49cd-b4dc-2a26533691e9", "title": "Four - year - old boy and father killed in Russian attacks in Kyiv region", "date": "2024-08-11 07:45", "url": "https://www.belfasttelegraph.co.uk/news/world-news/four-year-old-boy-and-father-killed-in-russian-attacks-in-kyiv-region/a340033756.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "A four-year-old boy and his father have been killed in an overnight Russian drone and missile barrage in the Kyiv region of Ukraine (AP)A four-year-old boy and his father have been killed in an overnight Russian drone and missile barrage in the Kyiv region of Ukraine, while in Russia the regional governor of Kursk said 13 people were injured when a Ukrainian missile shot down by Russian air defences fell on a residential building.\nThe attacks come as Ukraine’s surprise military incursion into Russia’s Kursk border region entered its sixth day.\nThe exact aims of the operation remain unclear and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nSerhii Popko, head of the Kyiv City Military Administration, said it was the second time this month that Kyiv has been targeted.\nUkraine has not commented on the attack inside Russia, but has increased the pace of attacks targeting Russian territory in recent weeks."}, {"id": "88277181-0a24-4927-94df-42a545381324", "title": "Israel - Gaza war : Kamala Harris condemns civilian deaths in school strike", "date": "2024-08-11 05:00", "url": "https://www.bbc.com/news/articles/cn0lx2xgn55o", "domain": "bbc.com", "domain_classification": "International", "message": "Kamala Harris says 'too many' civilian deaths in GazaMAHMOUD ZAKI/EPA-EFE/REX/ShutterstockUS Vice-President Kamala Harris has condemned the loss of civilian life in an Israeli air strike against a school building in Gaza on Saturday.\nAn Israeli military spokesman said al-Taba’een school \"served as an active Hamas and Islamic Jihad military facility\", which Hamas denies.\nIsrael's military said it had \"precisely struck Hamas terrorists operating within a Hamas command and control centre embedded in the al-Taba'een school\".\nAftermath of Israeli strike on Gaza City schoolIsrael has attacked several such shelters in Gaza in the past few weeks.\nThe building also served as a mosque and the Israeli strike hit during dawn prayers, witnesses said."}, {"id": "33cb9065-b221-4345-9990-14988d68f437", "title": "Gaza closer to  grisly milestone  of 40 , 000 deaths , as Taoiseach condemns strike", "date": "2024-08-11 07:30", "url": "https://www.kentonline.co.uk/news/national/gaza-closer-to-grisly-milestone-of-40-000-deaths-as-taoiseach-condemns-strike-125149/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "The Irish premier has said that this weekend brings the “grisly milestone” of 40,000 deaths in Gaza “a step closer”, as he condemned an Israeli airstrike on a school-turned-shelter.\nAround 80 people were killed in the strike on the school in central Gaza City, which also left another 47 people injured, Gaza’s health ministry said.\n“The United Nations has also assessed that more than 80% of the Gaza Strip has been placed under evacuation orders since October of last year.\n“We have all been horrified by the many undoubted war crimes that have been committed in Gaza.\n“Ireland calls for an immediate ceasefire, the unconditional release of Israeli hostages, and for aid trucks to flow unimpeded.”"}, {"id": "429b2512-b7f3-41b1-b61d-175ec8190466", "title": "Mourners line streets for funeral of Southport victim Alice DaSilva Aguiar", "date": "2024-08-11 13:45", "url": "https://www.aol.co.uk/news/mourners-line-streets-funeral-southport-131750499.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Members of the procession wore white - ANDY KELVIN/EPA-EFE/ShutterstockHundreds of mourners have lined the streets of Southport for the funeral of one of the victims of the Southport stabbing.\nAlice DaSilva Aguiar, nine, was killed alongside two other young girls during a Taylor Swift-themed dance class.\nMourners lined the streets as the procession passed - Scott HeppellThe coffin is carried into the funeral - Christopher FurlongEight other children and two adults were also wounded.\nA funeral for Alice took place in Southport’s St Patrick’s Catholic Church on Marshside Road on Sunday at 2pm.\nTributes left in Southport - ANNABEL LEE-ELLISMourners blew bubbles into the air as songs were sung, in a heartfelt moment of solidarity."}, {"id": "bfed419f-bec7-4b98-adf3-8fe85b8d6e19", "title": "Four - year - old boy and father killed in Russian attacks in Kyiv region", "date": "2024-08-11 08:00", "url": "https://www.edp24.co.uk/news/national/24510891.four-year-old-boy-father-killed-russian-attacks-kyiv-region/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "The attacks come as Ukraine’s surprise military incursion into Russia’s Kursk border region entered its sixth day.\nThe exact aims of the operation remain unclear and Ukrainian military officials have adopted a policy of secrecy, presumably to ensure its success.\nSerhii Popko, head of the Kyiv City Military Administration, said it was the second time this month that Kyiv has been targeted.\nIn Russia, the Defence Ministry said 35 drones were shot down overnight over the Kursk, Voronezh, Belgorod, Bryansk and Oryol regions.\nUkraine has not commented on the attack inside Russia, but has increased the pace of attacks targeting Russian territory in recent weeks."}, {"id": "879d5ee7-fd6d-4a6d-b9e8-c1f7a3f81a7d", "title": "Three former NBA players who impressed at the Olympics", "date": "2024-08-11 02:30", "url": "https://www.yardbarker.com/olympics/articles/three_former_nba_players_who_impressed_at_the_olympics/s1_13132_40729613", "domain": "yardbarker.com", "domain_classification": "Unknown", "message": "Here are three former NBA talents to impress during the Olympics.\nGuerschon Yabusele - FranceGuerschon Yabusele was last seen in the NBA in 2019, where he played for the Boston Celtics.\nAfter his strong showing, it wouldn't be a shock if he landed a deal with an NBA team ahead of the new season.\nUnfortunately for Jones, that production may be based on too small a sample size for an NBA team to come knocking.\nHe shot 59% from the field and 55% from three-point range, proving that he could fit with an NBA team as a potential three-and-D wing."}, {"id": "226647c7-e3e7-4c7f-b72b-77e01f16b6d7", "title": "US forces in Syria on high alert after attack on military base", "date": "2024-08-11 09:15", "url": "https://www.thestatesman.com/world/us-forces-in-syria-on-high-alert-after-attack-on-military-base-1503330417.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "US forces across Syria have been placed on high alert following a midnight attack by Iranian-backed militias on one of its bases in the northeastern province of Hasakah, a war monitor reported on Saturday.\nThe attack has prompted the US-led International Coalition to bolster both logistical and military support to its bases across Syria, according to the Britain-based Syrian Observatory for Human Rights.\nAdvertisementAccording to the observatory, US bases in Syria have been subjected to 135 attacks by Iranian-backed militias since October 19, 2023.\nThe recent escalation comes amid heightened tensions in northeastern Syria, with the US-backed Syrian Democratic Forces (SDF) engaged in clashes with pro-Syrian government forces, leading to the SDF effectively chocking all routes to the government-controlled areas in Hasakah.\nIt also comes as Iran is expected to respond to Israel following the assassination of senior Hamas leader Ismail Haniyeh."}, {"id": "ea9fae6b-e905-4419-adcb-789fdfccd384", "title": "SC should take note of allegations levelled by Hindenburg against SEBI chief : AAP", "date": "2024-08-11 07:30", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/sc-should-take-note-of-allegations-levelled-by-hindenburg-against-sebi-chief-aap/articleshow/112440442.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe AAP on Sunday demanded that the Supreme Court take note of the allegations levelled by US short seller Hindenburg against SEBI chief Madhabi Puri Buch .\n\"SEBI chief and her husband's money was invested in shell companies.\nWhy were these facts hidden from the Supreme Court?\n\"Our life and finances are an open book,\" they said.\n\"It is unfortunate that Hindenburg Research against whom SEBI has taken an enforcement action and issued a show cause notice has chosen to attempt character assassination in response to the same.\""}, {"id": "a3f217c5-2b2d-40e9-843a-49e830adfb7c", "title": "Ukraine foray into Russia border region embarrasses Putin . How will it affect the course of war ? - Boston News , Weather , Sports", "date": "2024-08-11 02:15", "url": "https://whdh.com/news/ukraines-foray-into-russias-border-region-embarrasses-putin-how-will-it-affect-the-course-of-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "The surprise foray has prompted thousands of civilians to flee the region as the Russian military struggles to repel the attack.\nThe Ukrainian forces have widely used drones to strike Russian military vehicles and deployed electronic warfare assets to suppress Russian drones and derail military communications.\nThe Russian units along the frontier consisted mostly of poorly trained conscript soldiers, who were easily overcome by elite Ukrainian units.\nAt least one Russian helicopter was downed and another one was damaged by the advancing Ukrainian forces, according to Russian military bloggers.\nRussia has declared a federal emergency in the Kursk region, giving local authorities more powers to quickly coordinate an emergency response."}, {"id": "28b5e934-53dd-4ac6-bfc3-99693b5d2945", "title": "Ukraine Foray Into Russia Border Region Embarrasses Putin . How Will It Affect the Course of War ? – The Yeshiva World", "date": "2024-08-11 03:00", "url": "https://www.theyeshivaworld.com/news/general/2304527/ukraines-foray-into-russias-border-region-embarrasses-putin-how-will-it-affect-the-course-of-war.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The surprise foray has prompted thousands of civilians to flee the region as the Russian military struggles to repel the attack.\nThe Ukrainian forces have widely used drones to strike Russian military vehicles and deployed electronic warfare assets to suppress Russian drones and derail military communications.\nThe Russian units along the frontier consisted mostly of poorly trained conscript soldiers, who were easily overcome by elite Ukrainian units.\nAt least one Russian helicopter was downed and another one was damaged by the advancing Ukrainian forces, according to Russian military bloggers.\nRussia has declared a federal emergency in the Kursk region, giving local authorities more powers to quickly coordinate an emergency response."}, {"id": "17f6ea77-7a26-4c40-8fda-2e609bef46e0", "title": "The unsung saga of Rani Avanti Bai - The Statesman", "date": "2024-08-11 04:15", "url": "https://www.thestatesman.com/opinion/the-unsung-saga-of-rani-avanti-bai-1503330441.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Don’t forget this.” In 2011, the HRD ministry made a suggestion to the NCERT to consider the inclusion of Rani Avantibai in school textbooks.\nWhen the British appointed an administrator for Ramgarh, Avantibai took charge of the administration throwing out the administrator.\nRather than succumbing to grief and despair, Rani Avantibai channeled her sorrow into a fierce determination to continue the fight against the British.\nUnwilling to fall prey to the British onslaught, Rani Avanti moved to the hills of Devharigarh for safety.\nNow called the Rani Avanti Bai Lodhi Sagar, it is a multi-purpose irrigation and hydro-electric project across the Narmada river in Madhya Pradesh."}, {"id": "f1e21455-3053-47e2-879a-f29555010e93", "title": "Walz hits back at Team Trump : He  knows nothing about service  ", "date": "2024-08-11 05:45", "url": "https://www.yahoo.com/news/walz-hits-back-team-trump-025449130.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tim Walz (D-Minn.) criticized former President Trump, saying he knows “nothing about service,” as the campaign trail debate over Walz’s military record continues.\n“Each of you talk about service, Donald Trump knows nothing about service,” he said.\nTrump, in a post on TruthSocial earlier this week, slammed Walz as a “disgrace” when commenting on an opinion piece that criticized Walz over his military career.\nThe former president’s new running mate, Sen. JD Vance (R-Ohio), has criticized Walz for leaving the military before his unit was deployed.\nOn the campaign trail this week, Walz has criticized both Trump and Vance."}, {"id": "5dc1fe23-c3a8-464f-a132-9103c775bfc3", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:45", "url": "https://local12.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "local12.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "0d12b40a-7d70-4d02-92bd-f472b7ab2c59", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:15", "url": "https://wpde.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "5325b5ca-bc56-4c4a-acf2-3a7887189a06", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:45", "url": "https://wset.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wset.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "b02beeb4-d4de-459e-bbec-ed3c2f99042b", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:15", "url": "https://wjla.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wjla.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "47331156-46a6-490d-a617-d68717357924", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says", "date": "2024-08-11 00:15", "url": "https://kvia.com/news/2024/08/10/walz-misspoke-in-2018-reference-to-weapons-of-war-that-i-carried-in-war-harris-campaign-says/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday.\nRepublicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n“In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added."}, {"id": "b72b426a-8e2b-4cc0-9ca0-b63aa0938fb6", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says", "date": "2024-08-11 02:15", "url": "https://www.mprnews.org/story/2024/08/10/walz-misspoke-in-2018-reference-to-weapons-of-war-that-i-carried-in-war-harris-campaign-says", "domain": "mprnews.org", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday.\nRepublicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n“In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added."}, {"id": "09200159-6630-472f-b4f2-85c1b5653b63", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:45", "url": "https://wwmt.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "f4446ad5-2f29-451f-bc33-47367be1db38", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:00", "url": "https://abc6onyourside.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "483a3ff7-8eec-4104-8b2e-118c1246373d", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 03:15", "url": "https://www.wcyb.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "08be7291-777f-4f55-8f48-3c5252c851f2", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:15", "url": "https://turnto10.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "d2c78481-5e15-4abe-aeec-6c6ba232b2bb", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:45", "url": "https://wsbt.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "fc26dd74-dd2b-4e72-94fc-4e40dcbda5d4", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:15", "url": "https://kfdm.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "e980df83-eddd-4533-b3fe-00b4af1408f1", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://newschannel20.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "newschannel20.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "afbae345-4950-4296-8cd2-a017a4fc88eb", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:00", "url": "https://fox11online.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "a5f9d9e5-8b5e-4f90-a1d9-eab478d8d6c0", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:15", "url": "https://fox17.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "353c4d0c-23b0-41d2-b502-cfc591f04481", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 03:15", "url": "https://kval.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "kval.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "4eeda52d-3759-4698-a53e-6766a3996df9", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://khqa.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "khqa.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "44d7eb23-80af-4ecf-8455-9f3d2b1e00be", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says | News , Sports , Jobs", "date": "2024-08-11 04:00", "url": "https://www.mauinews.com/wire/?category=5186&ID=337509", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday.\nRepublicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n“In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added."}, {"id": "8a7d9564-a2ac-49d9-9d73-7fba6f004763", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://www.nbcmontana.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "2b2ee41a-fbe0-44ec-8d3e-4fe5aa640a2b", "title": "Kremlin downplays scale of events in Kursk Oblast – ISW", "date": "2024-08-11 05:45", "url": "https://www.yahoo.com/news/kremlin-downplays-scale-events-kursk-023712596.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Kremlin has likely opted to declare a counterterrorism operation (CTO) regime instead of martial law to downplay the scale of the incursion into Kursk Oblast and to avoid causing panic or backlash domestically.\nMap depicting areas in Russia's Kursk Oblast under Ukrainian control.\nGeolocated footage and Russian reporting from 10 August indicates that Ukrainian forces largely maintain previously reported positions in Kursk Oblast and have advanced slightly further than their previously confirmed positions.\nUkraine’s cross-border operation into Kursk Oblast threatens the Kremlin with a potential political crisis regarding casualties among Russian conscripts, whom the Kremlin has increasingly relied upon to defend the Russian state border with Ukraine.\nRussian forces recently advanced near Kreminna, Toretsk, Pokrovsk, and Donetsk City."}, {"id": "300ad416-d3b7-4605-97f2-abc57b963c27", "title": "Here are 10 Bollywood movies to watch with family", "date": "2024-08-11 05:30", "url": "https://www.livemint.com/web-stories/here-are-10-bollywood-movies-to-watch-with-family-11723268524022.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Border (1997)Based on the real-life events of the Battle of Longewala during the Indo-Pakistani War of 1971, this film showcases the bravery and sacrifice of Indian soldiers."}, {"id": "342f81f1-372e-4a04-90b0-a6d8992eaea2", "title": "WATCH :  Noxiou CNN Host Brianna Keilar Has to Walk Back Comments Critical of JD Vance Service Record", "date": "2024-08-11 00:45", "url": "https://redstate.com/bobhoge/2024/08/10/watch-noxious-cnn-host-brianna-keilar-has-to-walk-back-comments-critical-of-jd-vances-service-record-n2177974", "domain": "redstate.com", "domain_classification": "Unknown", "message": "As we reported, CNN’s “noxious” anchor Brianna Keilar took a swipe at GOP vice presidential nominee JD Vance’s military career, implying that he had somehow embellished his record.\nHer discomfort is palpable as she says, “Attacks on JD Vance's service are also offensive”:Brianna Keilar @brikeilarcnn: “The Trump campaign is swift boating Tim Walz.\nAttacks on JD Vance’s service are also offensive.\n\"In a country where so few shoulder the burden, military service should not be a liability, it should be an asset,\" she continued.\nIn fact, she said, not having experienced combat \"doesn't make them or their service less admirable, or less necessary."}, {"id": "c02d6548-e76b-4212-9ef4-ae146e902b5d", "title": "Tech Bros Are Betting They Can Help Win a War With China", "date": "2024-08-11 02:45", "url": "https://biztoc.com/x/c92cfef0c28ac4c6", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "Tech Bros Are Betting They Can Help Win a War With China The Wall Street JournalWeapons startup Anduril hits $14-billion valuation, plans huge new facility Los Angeles TimesWhy the future of warfare is in AI software: Expert Yahoo FinanceDefense tech start-up Anduril Industries raises…This story appeared on wsj.com , 2024-08-11."}, {"id": "1bdf0ff0-69cc-40af-b13c-d3737be2b790", "title": "North Korea flies more trash - filled balloons towards South , says Seoul", "date": "2024-08-11 02:30", "url": "https://www.indiatoday.in/world/story/north-korea-has-flown-more-trash-filled-balloons-toward-south-korea-seoul-2580445-2024-08-11", "domain": "indiatoday.in", "domain_classification": "Unknown", "message": "South Korea’s military says North Korea is again flying balloons likely carrying trash toward the South, adding to a bizarre psychological warfare campaign amid growing tensions between the war-divided rivals.\nSouth Korea’s Joint Chiefs of Staff said Saturday that the winds could carry the balloons to regions north of the South Korean capital, Seoul.\nNorth Korea last flew balloons toward the South on July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nThe balloon contained no dangerous material and no one was hurt, South Korea’s presidential security service said.\nExperts say North Korea hates such broadcasts because it fears it could demoralize front-line troops and residents."}, {"id": "34a4b041-3c91-4911-8225-e1d949cedd64", "title": "IDF increases GPS disruptions amid tensions Iranian , Hezbollah threats", "date": "2024-08-11 07:00", "url": "https://www.jpost.com/israel-hamas-war/article-814196", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF has increased the use of GPS jammers in Eilat, on the Jordanian border, and near the northern Lebanese border, amid the possibility that Hezbollah and Iran would launch precision missiles and unmanned aircraft toward Israel.\nThey showed users as being in Iran or Lebanon.\nSince October 7, the IDF has operated proactive disruptions mainly in the northern and southern regions of the country.\nThe disruptions are supposed to interfere with hostile aircrafts and drones that use GPS systems for navigation.\nThe Electronic Warfare Unit is a mixed tactical unit that operates in enemy territory to disrupt activity in the spectrum space and enable uninterrupted activity for IDF fighters on all fronts."}, {"id": "9dfbaeff-2c81-4a7b-a7dd-d42237afa97c", "title": "Zelensky Acknowledges Operations Inside Russia for the First Time", "date": "2024-08-11 06:45", "url": "https://www.kyivpost.com/post/37206", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "In the first official word from the government in Kyiv, President Volodymyr Zelensky during his nightly address on Saturday acknowledged Ukraine’s push onto Russian soil, five days after Ukraine began its operation, which took not only Russia by surprise, but seemingly Ukraine’s allies also.\nEvery direction, every point of combat engagement,” he then mentioned the regions of fighting everywhere except inside Russia.\n“Well done, guys!” Zelensky said, congratulating troops fighting within Ukraine over the week.\nHe listed various AFU units engaged in combat operations on Ukrainian soil, both in occupied and non-occupied.\nAnd the decisions to achieve this must be one hundred percent effective – they must really work."}, {"id": "c8819d7e-50f5-410e-b77c-1e7778b34b03", "title": "Harris campaign says Walz  misspoke  in 2018 reference to carrying weapons in war", "date": "2024-08-11 05:00", "url": "https://www.fox10phoenix.com/news/harris-campaign-walz-misspoke-2018-carrying-weapons-war", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "Tim Walz, Vice President Kamala Harris' running mate, \"misspoke\" in a video from 2018 where Walz said he handled weapons \"in war,\" a Harris-Walz campaign spokesperson told the Associated Press (AP) Saturday.\nThe 2018 video was circulated on social media by the Harris campaign, according to AP.\nIn the video, Walz speaks out against gun violence saying, \"We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.\"\nWhat the Harris-Walz campaign is sayingA spokesperson for the Harris-Walz campaign, Lauren Hitt, told AP in a statement Saturday that Walz had \"misspoke\" in the video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt continued."}, {"id": "5e8c0c42-b08e-4372-90d4-2584189284cc", "title": "Harris campaign says Walz  misspoke  in 2018 reference to carrying weapons in war", "date": "2024-08-11 03:15", "url": "https://www.fox2detroit.com/news/harris-campaign-walz-misspoke-2018-carrying-weapons-war", "domain": "fox2detroit.com", "domain_classification": "Unknown", "message": "Tim Walz, Vice President Kamala Harris' running mate, \"misspoke\" in a video from 2018 where Walz said he handled weapons \"in war,\" a Harris-Walz campaign spokesperson told the Associated Press (AP) Saturday.\nThe 2018 video was circulated on social media by the Harris campaign, according to AP.\nIn the video, Walz speaks out against gun violence saying, \"We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.\"\nWhat the Harris-Walz campaign is sayingA spokesperson for the Harris-Walz campaign, Lauren Hitt, told AP in a statement Saturday that Walz had \"misspoke\" in the video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt continued."}, {"id": "2a798df2-36e4-41b2-afff-ae9227cf7961", "title": "iCarly - Nickelodeon HD", "date": "2024-08-11 07:15", "url": "https://www.tvguide.co.uk/schedule/652ed63d-92b7-546c-a1ed-5f7b94028cfa/icarly", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "iCarlyNickelodeon HD 1:00 PM to 1:31 PM Sunday 11 August Share Add toCalendar +iStart a Fan War - Part One Season 3 Episode 8 of 13 S SubtitlesPart one of two.\nThe guys attend an internet convention, where Carly has to deal with personal questions from her fans and Spencer does battle with a costumed nemesisiCarly airs on Nickelodeon HD at 1:00 PM, Sunday 11 August .\n(Subtitles.)\nTopics Children's ➝ Youth Programmes Comedy"}, {"id": "04cd71e4-d41a-4fc3-bd94-2995f57df1c2", "title": "Iran Revolutionary Guards hold military drill in western Iran - IRNA", "date": "2024-08-11 10:30", "url": "https://www.jpost.com/breaking-news/article-814229", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Iran's elite Revolutionary Guards are holding military drills in the western parts of the country that will continue until Tuesday, Iran's official news agency announced on Sunday.\nThe drills, which started on Friday, are ongoing in the western province of Kermanshah, close to the border with Iraq, to \"enhance combat readiness and vigilance,\" an armed forces official told IRNA.\nThe drills are taking place as Iran has vowed to retaliate against Israel after the killing of Hamas chief Ismail Haniyeh on July 31 in Tehran.\nIran and Palestinian Islamist group Hamas accuse Israel of carrying out Haniyeh's assassination on July 31.\nCited by Iranian media, Revolutionary Guards deputy commander Ali Fadavi said on Friday that the Iranian supreme leader's orders regarding the harsh punishment of Israel and revenge for Haniyeh are clear and will be implemented in the \"best possible way.\""}, {"id": "baa93a6f-048e-4952-b378-820967ce05de", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 03:00", "url": "https://news4sanantonio.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "434f6276-e69f-4ee2-93f9-2798947421cd", "title": "Ukraine Bold Incursion into Russia : Intense Battles Continue in Kursk Region", "date": "2024-08-11 08:00", "url": "https://www.devdiscourse.com/article/law-order/3048719-ukraines-bold-incursion-into-russia-intense-battles-continue-in-kursk-region", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "President Volodymyr Zelenskiy acknowledged on Saturday that Ukrainian forces are engaged in combat in Russia's Kursk region, marking Kyiv's largest incursion into Russian territory since the war began.\nIn his nightly address, Zelenskiy vowed to restore justice amid Russia's aggression, which began in February 2022.\nRussian President Vladimir Putin has described the Ukrainian offensive as a major provocation.\nOn Sunday, debris from a destroyed Ukraine-launched missile injured 13 people in a residential area in Kursk, leading officials to expedite civilian evacuations.\nAlthough both Kyiv and Moscow deny targeting civilians, the ongoing war has resulted in thousands of deaths and significant displacement."}, {"id": "b0ce9cf1-f379-47e6-be83-b3786a69afa4", "title": "Harris campaign says Walz  misspoke  in 2018 reference to carrying weapons in war", "date": "2024-08-11 01:15", "url": "https://www.foxla.com/news/harris-campaign-walz-misspoke-2018-carrying-weapons-war", "domain": "foxla.com", "domain_classification": "Unknown", "message": "Tim Walz, Vice President Kamala Harris' running mate, \"misspoke\" in a video from 2018 where Walz said he handled weapons \"in war,\" a Harris-Walz campaign spokesperson told the Associated Press (AP) Saturday.\nThe 2018 video was circulated on social media by the Harris campaign, according to AP.\nIn the video, Walz speaks out against gun violence saying, \"We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.\"\nWhat the Harris-Walz campaign is sayingA spokesperson for the Harris-Walz campaign, Lauren Hitt, told AP in a statement Saturday that Walz had \"misspoke\" in the video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt continued."}, {"id": "ec1c1e22-6aee-4962-8550-f8602a176b60", "title": "Seoul says North Korea has flown more trash balloons toward South Korea | News , Sports , Jobs", "date": "2024-08-11 04:00", "url": "https://www.mauinews.com/wire/?category=5187&ID=337419", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "By KIM TONG-HYUNG Associated PressSEOUL, South Korea (AP) — South Korea’s military says North Korea is again flying balloons likely carrying trash toward the South, adding to a bizarre psychological warfare campaign amid growing tensions between the war-divided rivals.\nSouth Korea’s Joint Chiefs of Staff said Saturday that the winds could carry the balloons to regions north of the South Korean capital, Seoul.\nNorth Korea last flew balloons toward the South on July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nThe balloon contained no dangerous material and no one was hurt, South Korea’s presidential security service said.\nExperts say North Korea hates such broadcasts because it fears it could demoralize front-line troops and residents."}, {"id": "95448b02-19b6-4fe9-92de-901e8f3ed461", "title": "Russian Army Loses 1 , 220 Soldiers In Ukraine Over Past 24 Hours", "date": "2024-08-11 06:45", "url": "https://menafn.com/1108540963/Russian-Army-Loses-1220-Soldiers-In-Ukraine-Over-Past-24-Hours", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia lost about 590,920 in Ukraine between February 24, 2022 and August 11, 2024, including 1,220 killed or wounded in action in the past 24 hours.\nThe General Staff of the of Ukraine said this in a post on , Ukrinform reports.\nIn addition, Ukraine's defense forces destroyed 8,447 (+6) Russian tanks, 16,363 (+13) armored fighting vehicles, 16,663 (+58) artillery systems, 1,143 multiple rocket launchers, 918 anti-aircraft warfare systems, and 2,425 missiles.\nThe Russian also lost 366 warplanes, 328 (+1) helicopters, 13,399 (+27) tactical unmanned aerial systems, 28 warships/cutters, 1 submarine, 22,524 (+71) vehicles and fuel tankers, and 2,800 (+11) pieces of special equipment."}, {"id": "795fd361-f8f5-40f2-becb-767722f474a0", "title": "Walz  misspoke  in saying he served  in war , Harris campaign says", "date": "2024-08-11 00:15", "url": "https://kvia.com/your-voice-your-vote/politics/cnn-us-politics/2024/08/10/walz-misspoke-in-saying-he-served-in-war-harris-campaign-says-2/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "Tim Walz “misspoke” in a newly resurfaced video from 2018 in which he said he handled assault weapons “in war,” a Harris campaign spokesperson told CNN on Saturday.\n“We can make sure those weapons of war, that I carried in war, are only carried in war,” Walz said in the video.\nLauren Hitt, a Harris campaign spokesperson, said in a statement the governor misspoke in the clip.\nThe clarification from the Harris campaign comes as the Trump campaign has sought to discredit Walz’s military service in the days since he joined the Democratic ticket.\n“What bothers me about Tim Walz is the stolen valor garbage,” Vance said."}, {"id": "916158c7-8d1f-4f87-92ab-1bbaa5d9815a", "title": "Zelenskyy advance : Battle of Kursk may have profound significance", "date": "2024-08-11 05:45", "url": "https://www.heraldscotland.com/politics/24510770.zelenskyys-advance-battle-kursk-may-profound-significance/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "According to The Institute for the Study of War (ISW), a Washington-based think tank, Ukrainian forces managed to push up to 20 miles deep into the region.\nAnalysts of the Ukrainian operation, however, say it remains unclear what control of that station could bring Ukraine.\nThere Russian forces have pressed offensives in several sectors and made slow but steady gains, relying on their edge in firepower.\nRussia has already moved extra tanks, artillery and rocket systems to its southern Kursk region to battle the shock incursion.\nOne must certainly be wary of making overt comparisons, but this second battle of Kursk could also yet prove to have profound significance for the current conflict between Russia and Ukraine."}, {"id": "a8ad607f-85d7-4e31-96f3-8c1a8ebc8be0", "title": "  Despicable : Jesse Ventura Criticizes JD Vance For Accusing Tim Walz Of  Stolen Valor  ", "date": "2024-08-11 00:15", "url": "https://dailycaller.com/2024/08/10/jesse-ventura-jd-vance-tim-walz-stolen-valor/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Former Minnesota Gov.\nVance for his comments on Democratic Minnesota Gov.\nDuring an appearance on CNN’s “Laura Coates Live,” he referred to Vance’s claim of stolen valor against Walz as “despicable” and accused him of disrespecting a fellow veteran.\nSo what George Bush did was sign an executive order sending the National Guard into foreign deployment,” Ventura added.\nWalz’s military service centers on his decision to retire from the Minnesota National Guard in 2005, just before his battalion was set to deploy to Iraq."}, {"id": "3f15cef4-eb01-414c-b5b9-a5513f792ea0", "title": "Kyiv daring move needs Western support", "date": "2024-08-11 05:45", "url": "https://www.yahoo.com/news/kyiv-daring-move-needs-western-050000232.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It serves as an important reminder that President Zelensky’s forces have much left in the tank.\nGiven this marks the first time regular Ukrainian forces have been used in this way, it is widely suspected they are doing so with some sort of approval from the Western alliance.\nBut the move has turned the tables of this war on Putin, and will act as a significant boost to Kyiv’s morale.\nEarlier this week President Zelensky promised a “just peace through just force”.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more."}, {"id": "c19bdda5-b57d-40ef-b88b-68563a8b31f4", "title": "Kyiv daring move needs Western support", "date": "2024-08-11 07:45", "url": "https://www.telegraph.co.uk/news/2024/08/11/kyiv-daring-move-needs-western-support/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Live Biden says pressure from Nancy Pelosi led him to drop out of race"}, {"id": "8021e2ef-ded3-4a6a-88e9-e4fce74fba19", "title": "Kyiv daring move needs Western support", "date": "2024-08-11 05:30", "url": "https://www.aol.co.uk/news/kyiv-daring-move-needs-western-050000946.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "It serves as an important reminder that President Zelensky’s forces have much left in the tank.\nGiven this marks the first time regular Ukrainian forces have been used in this way, it is widely suspected they are doing so with some sort of approval from the Western alliance.\nBut the move has turned the tables of this war on Putin, and will act as a significant boost to Kyiv’s morale.\nEarlier this week President Zelensky promised a “just peace through just force”.\nThe West must allow it to achieve just that, regardless of who wins the race for the White House in November."}, {"id": "69ff1c4b-584e-44a7-a483-f94a2c0d7e18", "title": "Record US$20 billion Taiwan defence budget to  mostly cover existing expenses  ", "date": "2024-08-11 02:15", "url": "https://www.scmp.com/news/china/politics/article/3273907/record-us20-billion-taiwan-defence-budget-mostly-cover-existing-expenses", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The unprecedented defence spending, out of a total expenditure of NT$3.13 trillion, is almost double the NT$359 billion listed during the first year of Lai’s predecessor Tsai Ing-wen’s term in 2016.\n“Our goal is to build a formidable military force capable of ensuring our survival and development, as well as safeguarding the lives and property of our people,” he said.\nHowever, Washington opposes any unilateral change to the status quo and is committed to supplying weapons for the island’s defence.\nThe mainland’s defence budget for 2024 stands at 1.67 trillion yuan (US$232 billion), up 7.2 per cent from last year and at least 16.5 times larger than Taiwan’s.\n“After all, sharply increasing our defence spending will crowd out other budget allocations,” he said."}, {"id": "3a4566e0-60c7-4e9a-a718-3a9030edd470", "title": "Italian Navy carrier strike group arrives on Guam", "date": "2024-08-11 04:15", "url": "https://www.guampdn.com/news/italian-navy-carrier-strike-group-arrives-on-guam/article_34bc9cee-56f5-11ef-9e8d-03c73a325ef2.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "The Italian Navy Carrier Strike Group Cavour arrived on Guam Sunday morning after participating in multi-nation military exercises in Darwin, Australia, before heading to Japan.\nThe Italian carrier strike group, consisting of the aircraft carrier Cavour and the frigate Alpino, participated in the \"Pitch Black 2024\" air exercise.\nThe activity is part of the strategic objectives of the Italian Carrier Strike Group's campaign for increasing interoperability and cooperation with the navies of allied and partner countries.\nThe Italian carrier strike group is commanded by Rear Admiral Giancarlo Ciappina, while Cavour's commander is Captain Milos Argenton and the frigate Alpino is commanded by Salvatore Santangelo.\nThe Italian carrier strike group's visit comes days after Nimitz-class aircraft carrier USS Abraham Lincoln also arrived at U.S."}, {"id": "5f2d0be6-87a6-48e9-9647-7b3c2a80809a", "title": "Russia pushes back at Ukraine cross - border assault , but Kyiv presses on", "date": "2024-08-11 00:15", "url": "https://www.bostonglobe.com/2024/08/10/world/russia-pushes-back-ukraines-cross-border-assault-kyiv-presses/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "KYIV — Russia is pushing back against Ukraine’s largest assault into Russian territory since the start of the war, sending troop reinforcements, establishing strict security measures in border areas and conducting airstrikes, according to the Russian Defense Ministry.\nOne of the strikes on Ukrainian troops involved a thermobaric missile that causes a blast wave and suffocates those in its path, the ministry said.\nBelarus’ defense minister said on Telegram that the country’s air defense forces had destroyed several Ukrainian drones that violated Belarusian airspace Friday.\nIt would also relieve pressure on Ukrainian troops who are outnumbered and have been losing ground in eastern and southern Ukraine.\nSo far, Russian forces have not let up in their front-line pushes."}, {"id": "662454cb-58b2-4d64-953d-52db7a73a026", "title": "JD Vance isnt the first . These 4 presidential elections also had Cincinnati candidates", "date": "2024-08-11 03:00", "url": "https://www.yahoo.com/news/jd-vance-isnt-first-4-021027934.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Vance is, however, the first candidate from Greater Cincinnati on the ballot since James M. Cox ran for president in 1920.\nHere are four memorable elections that featured candidates from Greater Cincinnati.\nA campaign poster for Democratic candidates George B. McClellan and George Hunt Pendleton for the 1864 presidential election.\nWilliam Howard Taft spent election day in CincinnatiWilliam Howard Taft was the only president born in Cincinnati, rather than in the region.\nThis article originally appeared on Cincinnati Enquirer: How other Cincinnati candidates fared in past presidential elections"}, {"id": "c2b18f17-ea6b-44f1-b51e-cba0a013233e", "title": "Toyota Yaris Cross vs Hyundai Venue : Spec battle", "date": "2024-08-11 00:45", "url": "https://www.canberratimes.com.au/story/8725685/toyota-yaris-cross-vs-hyundai-venue-spec-battle/?cs=34616", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Toyota Yaris Cross stacks up as the more fuel efficient of the two vehicles on paper, with a claimed fuel economy figure of 3.8L/100km as opposed to the Venue which uses 7.0L/100km."}, {"id": "e7fc7244-f5ed-48a5-a90d-18d2332ddb2e", "title": "Netflix  Robot Apocalypse Movie  Uses Real Mariupol Battle Footage", "date": "2024-08-11 06:45", "url": "https://www.kyivpost.com/post/37177", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "However, it's a real video clip filmed by Azov during the Mariupol battles,” he wrote.\n“@netflix Is it okay for you to use real footage of a tragic event in Ukraine, during war and genocide?\nI can't believe you have permission to include real video in a feature film.”“Thank you, now I definitely won’t watch it.\nTo compare so many deaths and family tragedies to entertainment content, especially in a context unrelated to the war in Ukraine,” writes another user, Natali.\nCurrently, neither Netflix nor Ukrainian officials have commented on the incident but UNITED24 Media also commented on the broadcast."}, {"id": "42a322be-e128-4ec5-a065-800eb8c4a72a", "title": "On This Day : Creation Of Union Territory Dadra And Nagar Haveli , First Olympics After World War 2 And More", "date": "2024-08-11 04:15", "url": "https://menafn.com/1108540721/On-This-Day-Creation-Of-Union-Territory-Dadra-And-Nagar-Haveli-First-Olympics-After-World-War-2-And-More", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Live Mint) On this day: The day is celebrated, observed, and remembered for various political, economic and other reasons in Indian and World History.\nOn this day, notable figures in Indian history mark their birth anniversary, including Sadashiv Kanoji Patil, Lalmani Mishra, Madireddy Venkat Narasimha Rao and Sunil Shetty.\nMadireddy Venkat Narasimha Rao, a former Indian cricketer, was born in 1954 and is renowned for his contributions in promoting the sport.\nThe first Olympic Games after the Second World War took place in 1948 in London after the 1936 Berlin Olympics.\nEvents in World History| On this day: What happened on August 5, from quashing of Article 370, and..."}, {"id": "f347bd8b-96eb-4a9f-bde3-9bee740c33e8", "title": "Special Operations : Russia Switches to Assassination and Sabotage", "date": "2024-08-11 06:45", "url": "http://www.strategypage.com/htmw/htsf/articles/2024081101138.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 11, 2024: Russia views the combat zone as much larger than the areas in Ukraine where fighting is currently underway.\nRussia has admitted that they consider NATO nations supporting Ukraine to be full of legitimate targets.\nRussia does not issue press releases about its sabotage and assassination campaign in NATO countries supporting the Ukrainians.\nAmericans and European intelligence nations detected these plans and did so early enough to disrupt Russian efforts to implement their plans.\nThis information was shared with other NATO nations and Ukraine, which will become a NATO member when the war is over."}, {"id": "7df79221-ba68-4c04-8618-33c24eea2931", "title": "I protested Vietnam War at DNC 1968 . This year , Ill rally for our nation future . ", "date": "2024-08-11 02:15", "url": "https://chicago.suntimes.com/other-views/2024/08/10/democratic-national-convention-dnc-1968-vietnam-war-protest-democracy-terry-ratner", "domain": "chicago.suntimes.com", "domain_classification": "Unknown", "message": "The last time I was at a political rally was in 1968 in downtown Chicago to protest the Vietnam War.\nMy long flowing hair, held in place by a blue and white bandanna, touched the middle of my back.\nI wore a string of green and yellow beads around my neck and a short red and white summer dress.\nAnother deep political divideIn 2024, I find myself, once again, tired of the political division and discourse that is being played.\nI’m primed, eager and stoked to march once again in Chicago during the 2024 Democratic National Convention."}, {"id": "a7b89f8a-99cc-4e1f-9efc-d778e18b6356", "title": "Fraudie Murphy : Tim Walz Owes America An Explanation And An Apology", "date": "2024-08-11 05:15", "url": "https://townhall.com/columnists/derekhunter/2024/08/11/fraudie-murphy-tim-walz-owes-america-an-explanation-and-an-apology-n2643232", "domain": "townhall.com", "domain_classification": "Unknown", "message": "I have to be honest; I’d never heard of a “CommandSergeantMajor” before Kamala Harris chose Minnesota Governor Tim Walz as her running mate.\nSince 2005 and deciding to run for Congress, every single time Tim Walz has spoken or written about his military career he has lied about.\nAdvertisementThere doesn’t seem to be any consequence for Democrats who lie about their military service, explicitly or implicitly.\nAt some point, and let it be with Tim Walz, a line must be drawn or responsibility exacted, doesn’t it?\nFraudie Murphy should be commended for his service, but condemned for exaggerating and lying about it, and ultimately stealing the valor of those who actually did what Tim Walz only pretended to have done."}, {"id": "ece39dad-405c-4720-9e27-5669e5171b0d", "title": "Tens of thousands evacuated from Russia Kursk region - World", "date": "2024-08-11 06:45", "url": "https://www.dawn.com/news/1851552/tens-of-thousands-evacuated-from-russias-kursk-region", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "MOSCOW: Struggling to put down a major Ukrainian incursion for a fifth day, Russia on Saturday said it had evacuated tens of thousands of people from its border region, launched a “counter-terror operation” and warned that the fighting was endangering a nuclear power plant.\nUkrainian units stormed into Russia’s western Kursk region on Tuesday morning in a shock attack, the largest and most successful cross-border offensive by Kyiv of the two-and-a-half-year conflict.\nKyiv has maintained a strict operational silence on the offensive and is yet publicly to confirm it is even behind the attack.\nRussia’s nuclear agency on Saturday warned of a “direct threat” to the nearby Kursk nuclear power station, and local officials detailed the scale of civilian evacuations from towns and villages close to the combat zone.\nRussia’s army on Saturday confirmed it was still fighting the Ukrainian incursion for a fifth day."}, {"id": "526bb209-2e89-4c8d-9d35-45ff690f5355", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:15", "url": "https://nbc24.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "nbc24.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "de35fafc-39c6-4b44-9264-003adff3f080", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 00:00", "url": "https://fox56.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "fox56.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "28f5948f-f251-4f35-bcb1-f833a7bea2dc", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:00", "url": "https://ktvl.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "ktvl.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "9d4323ce-421b-419d-b528-ee23cd5db9c9", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:00", "url": "https://abc3340.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "abc3340.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "2a6f0d03-7e2f-4406-b4b5-224d3257512b", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:00", "url": "https://fox42kptm.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "fox42kptm.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "83faf1e1-3c3c-4227-8a7e-c08eb6305381", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:15", "url": "https://wgme.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wgme.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "96fe8827-7663-4217-861d-6a6658290797", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 01:15", "url": "https://abc7amarillo.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "abc7amarillo.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "5ab61258-901e-4cca-9dee-3092daca7594", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:45", "url": "https://kcby.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "kcby.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "6bac3c27-bf32-43ce-b2d1-b7c99ab258fd", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:45", "url": "https://foxsanantonio.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "foxsanantonio.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "5e324008-65ee-416c-8b6c-2b03cbf3038f", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:45", "url": "https://klewtv.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "klewtv.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "20f5a840-03b0-48ec-a152-337ffa71c126", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 03:15", "url": "https://cbs6albany.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "cbs6albany.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "0a4c5e46-bd83-45ae-aa9b-814c221349f0", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:30", "url": "https://wjactv.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "wjactv.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "b1076b4d-ee8f-4b38-a8c5-7b6d6315003f", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:30", "url": "https://local21news.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "local21news.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "dacc0db7-083d-427c-a376-f9309225c397", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://cbs2iowa.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "d5b16278-c2c1-4245-8486-420a47242821", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://fox4beaumont.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "fox4beaumont.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "b055b363-54eb-4835-a674-a89cd8526875", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 02:15", "url": "https://kpic.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "kpic.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "9a192ce7-a4e4-42fb-992b-081f9f128e7d", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says | News , Sports , Jobs", "date": "2024-08-11 04:00", "url": "https://www.vindy.com/wire/?category=5&ID=337509", "domain": "vindy.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday.\nRepublicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n“In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added."}, {"id": "c26bbe4f-6f09-4f60-a7f3-5f9909533eae", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says", "date": "2024-08-11 05:15", "url": "https://www.telegraphherald.com/news/national_world/article_a6fc0425-8011-5f3b-a0fe-e5cb70c54a5c.html", "domain": "telegraphherald.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "796a8555-cb25-44b8-9086-729155474e03", "title": "Walz  misspoke  in reference to  weapons of war , that I carried in war , campaign says", "date": "2024-08-11 07:30", "url": "https://www.ktxs.com/news/nation-world/walz-misspoke-in-reference-to-weapons-of-war-that-i-carried-in-war-campaign-says-military-service-2024-election-politics", "domain": "ktxs.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, \"misspoke\" in a 2018 video about \"weapons of war that I carried in war,\" a Harris-Walz campaign spokesperson said Saturday.\nThe comment suggests that Walz portrayed himself as someone who spent time in a combat zone.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n\"In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,\" Hitt added."}, {"id": "b9e4d649-855f-49bb-ab9c-b060e2788462", "title": "Walz  misspoke  in 2018 reference to  weapons of war , that I carried in war , Harris campaign says | News , Sports , Jobs", "date": "2024-08-11 13:45", "url": "http://www.vindy.com/wire/?category=5&ID=337509", "domain": "vindy.com", "domain_classification": "Unknown", "message": "Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday.\nRepublicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday.\nWalz served 24 years in various Army National Guard units but he was never in a combat zone.\nLauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video.\n“In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added."}, {"id": "6de69d39-7844-46ee-bff8-84b632586e0e", "title": "Former Israeli hostage medical conditions upon leaving Gaza revealed", "date": "2024-08-11 06:30", "url": "https://www.jpost.com/israel-hamas-war/article-814189", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The brutal attack led to the death of over 1,250 Israelis and the hostage-taking of 250 men, women, children, babies, and elderly people.\nSignificant attention was paid to anticipating potential medical problems, taking into account the patient's medical history while maintaining medical confidentiality.\nAll patients underwent a medical evaluation that included a medical admission questionnaire, a basic physical examination, blood tests, fecal tests, and urine tests.\nAll reported psychological terrorism, with various psychological warfare strategies, including isolation, intimidation, food and water restriction, and psychological abuse.\nSome of the hostages suffered immediate anxiety disorders and began psychiatric medication."}, {"id": "46bc2b53-24a0-4b11-80aa-949d0670b446", "title": "Thousands Evacuated In Russia Amid Ongoing Ukrainian Offensive", "date": "2024-08-11 02:30", "url": "https://www.newsx.com/world/thousands-evacuated-in-russia-amid-ongoing-ukrainian-offensive/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "Moscow also raised concerns that the ongoing conflict in Russia’s western Kursk region might pose a risk to a nearby nuclear power plant.\nUkrainian forces launched a major offensive early Tuesday, marking the largest and most successful such operation by Kyiv in the two-and-a-half-year conflict.\nUkrainian troops have made several kilometers of advancement, prompting Russia to deploy additional reserves and equipment.\nRussia’s military confirmed on Saturday that the fighting with Ukrainian forces had continued for a fifth day.\nIn response, Russia launched a missile strike on a supermarket in Kostyantynivka, eastern Ukraine, on Friday, killing at least 14 people."}, {"id": "89339d48-950c-4e19-9aaa-63af77551cda", "title": "Even Walz Former Chaplain Is Speaking Out Against Him", "date": "2024-08-11 06:30", "url": "https://pjmedia.com/graysonbakich/2024/08/10/even-walzs-former-chaplain-is-speaking-against-him-n4931529", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "The good governor, of course, just said he \"misspoke\" about his service, as Margolis wrote earlier today.\nI am pretty sure there is a big difference between misspeaking and lying, but what do I know?\nWalz's own former chaplain for his unit, Capt.\nBecoming a PJ Media VIP gets you access to exclusive articles and columns written by your favorite writers, as well as fun stuff like live streams, liveblogs, and podcasts.\nAnd because this article is about Tim Walz, we have introduced a new promo code for those considering a subscription: COMMIEWALZ."}, {"id": "cba2e7ef-0239-4865-8da9-183d745cf52d", "title": "A matter of taste | Drinks of Independence", "date": "2024-08-11 07:00", "url": "https://www.thehindu.com/food/features/a-matter-of-taste-drinks-of-independence/article68506233.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "We rarely associate drinks with independence.\nThe someone will mention Winston Churchill and his penchant for all drinks French during the Second World War.\nBut that’s pretty much all we hear as it goes for the role of drinks in the larger independence movements in history.\nTea: Rum may have been the precursor, but tea was real catalyst that finally led to American revolution and their eventual independence.\nThis happened in Havana, Cuba, sometime circa 1901 and the delicious drink became a symbol of Cuban independence."}, {"id": "cb334941-c9ac-4c56-a6a0-14f998961f2b", "title": "Stirling recognised as most historically important area in Scotland for battles", "date": "2024-08-11 06:15", "url": "https://www.thenational.scot/news/24507826.stirling-recognised-historically-important-area-scotland/", "domain": "thenational.scot", "domain_classification": "Unknown", "message": "Dr Cook, who is an archaeologist for Stirling, Falkirk and Clackmannanshire councils, explained that the area is the most strategically important location in Scottish history due to the Forth crossings.\n“Everybody that wanted to invade Scotland had to cross the Forth and the only place to do that is at the lowest land crossing, and that is at Stirling.\nIf you wanted to stop an invasion, you had to do it at Stirling.\n“There are more battles fought around this area than anywhere else in Britain, far less Scotland.\n“This is one of the reasons people come to Scotland, to find out about our amazing past,” he said."}, {"id": "284669b9-9a8f-4196-a77a-93d244c8c80a", "title": "What my insight on far right reveals about unrest that sparked riots", "date": "2024-08-11 05:45", "url": "https://www.heraldscotland.com/politics/24510748.insight-far-right-reveals-unrest-sparked-riots/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "For me, it’s the Northern Ireland conflict, political extremism, the far right, and social evils like poverty.\nI’ve been a reporter for more than 30 years, and dedicated huge amounts of time to unmasking the far right at home and abroad.\nSadly, I’ve sometimes endured TV commissioners and newspaper executives who refused to understand the “newsworthiness” of investigating the far right.\nAnders Breivik Image: PAThe far right often depends more on the “virus of influence”, than direct organisational connection.\nI began exploring the rise of the far right globally, travelling all across Britain, France, Italy, Germany, Sweden, Russia and America."}, {"id": "2dff67d2-1526-4e06-b257-ef38980ed9fa", "title": "Russian army loses more than 1 , 200 soldiers over past day", "date": "2024-08-11 06:45", "url": "https://www.yahoo.com/news/russian-army-loses-more-1-051944799.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian army loses more than 1,200 soldiers over past dayThe Russian military lost 1,220 people, six tanks and 58 artillery systems on Saturday.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 11 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:Approximately 590,920 (+1220) military personnel;8,447 (+6) tanks;16,363 (+13) armoured combat vehicles;16,663 (+58) artillery systems;1,143 (+0) multiple-launch rocket systems;918 (+0) air defence systems;366 (+0) fixed-wing aircraft;328 (+1) helicopters;13,399 (+27) strategic and tactical UAVs;2,425 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,524 (+71) vehicles and tankers;2,800 (+11) special vehicles and other equipment.\nThe data is being ascertained.\nSupport UP or become our patron!"}, {"id": "cf17d8ff-2b66-4724-8e4c-3d7016fbc879", "title": "Procurement : Desperate Times Lead to Improvised Weapons", "date": "2024-08-11 06:45", "url": "http://www.strategypage.com/htmw/htproc/articles/2024081101045.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "The fighting has led to the destruction of most modern Russian weapons.\nAll this transportation disruption left Russian soldiers short of weapons and munitions, or at least munitions that could be used in the weapons they did have.\nDuring the last year Russian soldiers have often been defending and mobile artillery was not as essential.\nAll these improvised weapons still had to deal with an unexpected innovation: UAVs (Unmanned Aerial Vehicles) that fly low, slow and seek out targets.\nRussian soldiers could improvise in the combat zone, which Russian military production officials rarely visited."}, {"id": "be20c110-c1db-4a22-bcfd-0f88ed5b3b0a", "title": "How the culture wars poisoned American politics and how to fix it", "date": "2024-08-11 06:15", "url": "https://www.wbur.org/onpoint/2024/08/09/culture-wars-james-davison-hunter-politics", "domain": "wbur.org", "domain_classification": "Unknown", "message": "Today, On Point: How the culture wars poisoned American politics — and how to fix it.\nAdvertisementAmerica's culture wars have metastasized so that many groups believe they are in a maximalist battle against their own extinction.\nHunter says that culture wars have so completely poisoned American politics that they've made authoritarianism dangerously attractive to too many.\nSo in the context of these culture wars, how would you define what culture is?\nAnd those boundaries and the contestation of those boundaries are what defined so much of the American culture wars today."}, {"id": "92e15024-1b99-4df4-a17a-4907b140b45e", "title": "Toyota Yaris Cross vs Hyundai Venue : Spec battle", "date": "2024-08-11 00:15", "url": "https://www.theadvocate.com.au/story/8725685/toyota-yaris-cross-vs-hyundai-venue-spec-battle/?cs=34616", "domain": "theadvocate.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "3c7992be-79fd-4639-a72e-e03dea4abb59", "title": "KOHLMA MOON OF THE DEAD addon - Star Wars Battlefront", "date": "2024-08-11 00:00", "url": "https://www.moddb.com/games/star-wars-battlefront/addons/kohlma-moon-of-the-dead1", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Star Wars Battlefront gives you the chance to play as a soldier in intense multiplayer battles with up to 32 people.\nFight on ten legendary planets and use a variety of weapons and vehicles, including X-wings, snowspeeders and AT-ST's.\nExperience the chaos of battle as you fight the greatest wars in the Star Wars universe.\nIn addition to the single-player and various multiplayer modes offered in Star Wars Battlefront, a unique \"Conquest\" mode adds an innovative and strategic gameplay element to the action.\nAfter each battle is completed and the planet is conquered, the winning team will be rewarded with a special \"bonus\" ability that can be deployed in future battles in an attempt to take over the Star Wars galaxy planet-by-planet."}, {"id": "63d89336-5a58-4161-9490-1ece2a4c00e1", "title": "Russia ukraine war : Russia tightens security in Kursk region after Ukraine surprise incursion", "date": "2024-08-11 06:45", "url": "https://www.9news.com.au/world/russia-ukraine-war-tightens-security-kursk-region-as-fight-continues/b1af6e9f-ca68-47e1-a9c1-98c0ea5f5623", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Russia has announced increased security measures in the border region of Kursk where an incursion this week by Ukrainian forces caught Russian troops off guard and exposed its military vulnerabilities in the nearly two-and-a-half-year-old war.\nZelenskyy commended Ukrainian combat brigades across the front line, including the Sumy region, which lies adjacent to Kursk.\nA view of the column of Russian Army trucks damaged by shelling by the Ukrainian Armed Forces on the highway in the Sudzhansky district in the Kursk region of Russia on August 9.\nIn this photo taken from video released by the Russian Defence Ministry on August 10, Russian Army tanks take a position at an area of Kursk region of Russia.\nIn another video, Ukrainian soldiers from the 252 Battalion claim to be standing in the village of Poroz in Russia’s Belgorod region, about three kilometres from the border."}, {"id": "dc34f6cf-80c3-4801-a252-0b5e5bf6438b", "title": "For Israel progressive elites , the real war is against the enemy within | Israel National News", "date": "2024-08-11 05:30", "url": "https://www.israelnationalnews.com/news/394428", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It felt like the war had only increased their desperation and sense of urgency in fighting Israel’s right-wing government.\nThe real war, explained another Never-Bibi activist, is not against Hamas, it is against the enemy within—Netanyahu and his government.\nBecause though the birth rate among Israel’s progressive elites far exceeds that of their counterparts in other Western democracies, it still falls short of the birth rate among Bressler’s “Them.”“Us” are already a minority.\n***While Bressler may be on the level when she says she is a Zionist, her Zionism, which she shares with many in Israel’s progressive elites, is only very minimally Jewish.\nEven if Israel’s elites try to pull a two-state rabbit out of an American hat, they will ultimately run up against the same Palestinian Arab recalcitrance."}, {"id": "605cdfd0-44cb-4530-b2cd-3dc655f99c9b", "title": "For Israel progressive elites , the real war is against the enemy within | Israel National News", "date": "2024-08-11 06:45", "url": "http://www.israelnationalnews.com/news/394428", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It felt like the war had only increased their desperation and sense of urgency in fighting Israel’s right-wing government.\nThe real war, explained another Never-Bibi activist, is not against Hamas, it is against the enemy within—Netanyahu and his government.\nBecause though the birth rate among Israel’s progressive elites far exceeds that of their counterparts in other Western democracies, it still falls short of the birth rate among Bressler’s “Them.”“Us” are already a minority.\n***While Bressler may be on the level when she says she is a Zionist, her Zionism, which she shares with many in Israel’s progressive elites, is only very minimally Jewish.\nEven if Israel’s elites try to pull a two-state rabbit out of an American hat, they will ultimately run up against the same Palestinian Arab recalcitrance."}, {"id": "5692f061-600a-4148-9143-f99add57baad", "title": "Chess club for kids thrives in Congo refugee camp", "date": "2024-08-11 07:45", "url": "https://www.voanews.com/a/chess-club-for-kids-thrives-in-congo-refugee-camp/7737521.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "The Soga Chess Club for children doesn't have enough tables and chairs.\nHundreds of thousands of people forced to escape the attacks that destroy their towns and villages have ended up in vast displacement camps like Kanyaruchinya, where the Soga Chess Club operates.\nSome of the children in the chess club have been living in the Kanyaruchinya camp for almost two years, their lives in limbo.\nAkili Bashige, president of the Soga Chess Club, said parts of the camp have been transformed into sites of optimism by children playing chess.\n\"Before Soga chess, they were idle because of the war and a lack of schooling,\" said Feza Twambaze, Arusi’s mom."}, {"id": "b13a664c-d0ff-41b6-ac40-b268b9fd3356", "title": "Goulburn RSL Sub Branch to host Vietnam Veterans Day at park | Goulburn Post", "date": "2024-08-11 08:30", "url": "https://www.goulburnpost.com.au/story/8726107/goulburn-rsl-sub-branch-to-host-vietnam-veterans-day-at-park/?cs=2650", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "The day was originally called Long Tan Day to commemorate the epic battle in the Long Tan rubber plantation in South Vietnam on August 18, 1966, when 108 Australians from D Company 6 Battalion Royal Australian Regiment engaged in a brutal and bloody battle against a 2500 strong force of North Vietnamese and Viet Cong.\nThe Australians emerged victorious but at the cost of 18 lives and 24 wounded."}, {"id": "c65deb3a-f211-4434-bd33-8f0faeef9ba5", "title": "Fort - 12 Fix addon - Radiophobia 3 mod for S . T . A . L . K . E . R . Shadow of Chernobyl", "date": "2024-08-11 00:00", "url": "https://www.moddb.com/mods/radiophobia/addons/fort-12-fix", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Radiophobia is a mod focusing primarily on combat realism and immersion.\nThe main features are: a revamped arsenal of HQ weapons, graphical improvements and much more additional content.\nIt's time to explore the Zone once again..."}, {"id": "5d8fd541-987f-473c-bdc4-647681a2e861", "title": "Olympics : Japan hopeful Shigekix misses podium in men breaking", "date": "2024-08-11 00:15", "url": "https://english.kyodonews.net:443/news/2024/08/c23aa8264b63-olympics-japan-hopeful-shigekix-misses-podium-in-mens-breaking.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 17 hours ago - 06:54 | Sports, OlympicsJapan's Shigeyuki Nakarai missed out on the podium at the inaugural Olympics men's breaking competition in Paris on Saturday, finishing fourth in the 16-man competition.\nShigekix was beaten 20-7 in the bronze medal battle by American Victor.\n\"The road to Paris, and the Paris Olympics itself, have been a really valuable time for me, and a challenge that I definitely needed,\" Nakarai said.\n\"I'm sure I'm stronger for standing on this stage and matured both as a man and dancer.\"\nRelated coverage:Olympics: Japanese B-girl Ami becomes 1st breaking gold medalist"}, {"id": "7e9908e6-e8ac-4285-875b-2a8da6c45084", "title": "Jesse Ventura Praises Tim Walz For Legalizing Marijuana", "date": "2024-08-11 02:15", "url": "https://www.thewrap.com/jesse-ventura-tim-walz-legalized-marijuana/", "domain": "thewrap.com", "domain_classification": "Unknown", "message": "Former Minnesota Gov.\nJesse Ventura praised current Minnesota Gov.\nThat is ridiculous.”Sharpton and Ventura also spoke about the elephant in the room: Donald Trump, and their own past friendships with him.\n“Back then he was much more liberal, but you need to understand, Donald Trump is for Donald Trump, and Donald Trump is going to do whatever it is that supports Donald Trump.”“So he looked the situation over.\n“And Donald Trump hardly lives it."}, {"id": "f6ac3fac-36a8-4427-b457-b58bde2afbef", "title": "Navy to boost capability after long - range missile test", "date": "2024-08-11 00:00", "url": "https://citynews.com.au/2024/navy-to-boost-capability-after-long-range-missile-test/", "domain": "citynews.com.au", "domain_classification": "Unknown", "message": "By Caitlin Powell in CanberraAustralia’s navy has hit a significant milestone in boosting the lethal nature of its national defence strategy following a long-range missile test.\nHMAS Sydney successfully fired a Standard Missile 6 during Exercise Pacific Dragon 2024, which was recently held near Hawaii.\nIt was the second test on the cruiser in less than a month after the vessel fired a Naval Strike Missile during Exercise RIMPAC 2024, the world’s largest international maritime exercise, in July.\nThe missiles, which are being acquired from the US, will improve the navy’s long-range capability once rolled out to its surface combatant fleet.\nThe federal government’s $50.3 billion National Defence Strategy announced in April laid down plans to transform the defence force in coming years."}, {"id": "7dc54902-d0c0-4e37-86f9-55072e17f93f", "title": "Stree 2 bumper advance sets Independence Day battle ablaze ; grabs 50 % showcasing in multiplexes leaving balance for Khel Khel Mein and Vedaa : Bollywood Box Office", "date": "2024-08-11 07:00", "url": "https://www.bollywoodhungama.com/news/box-office-special-features/stree-2s-bumper-advance-sets-independence-day-battle-ablaze-grabs-50-showcasing-multiplexes-leaving-balance-khel-khel-mein-vedaa/", "domain": "bollywoodhungama.com", "domain_classification": "Unknown", "message": "A trade source shares, \"Stree 2 will lead the Independence Day battle with 50% share in showcasing at multiplexes.\nIts deserving for this horror comedy to dominate over Khel Khel Mein and Vedaa due to tremendous demand among the cinema going audience.\nThe shows between Khel Khel Mein and Vedaa will be divided in the ratio of 50:50,\" the trade source shared.\nIt's time to grab some popcorn as the fight between Khel Khel Mein and Vedaa is expected to be intense.\nMore Pages: Khel Khel Mein Box Office Collection"}, {"id": "0afcaf83-3ee7-4358-a727-9c2e6493c379", "title": "Team Liquid remains unbeaten at LCS Summer Split", "date": "2024-08-11 07:45", "url": "https://article.wn.com/view/2024/08/11/Team_Liquid_remains_unbeaten_at_LCS_Summer_Split/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "(Photo credit: Kelley L Cox-USA TODAY Sports) Team Liquid swept NRG 2-0 on Saturday to remain undefeated as teams continue to battle for playoff positions in the League Championship Series Summer Split.\nTeam Liquid won both matches on red, in 28 minutes and 23 minutes, to improve to 7-0.\nAlso on... read full story"}]