[{"id": "7956bc3c-7b6e-44b1-af54-7803e5b89b94", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 02:00", "url": "https://www.journal-news.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "journal-news.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "6d83d63f-3c8f-4dfe-8179-c0d9a2c4ba56", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 01:45", "url": "https://www.springfieldnewssun.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "springfieldnewssun.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "f1e59f7a-3a86-44d7-b48d-e257d5f5ea41", "title": "Fires break out on abandoned Greek - flagged oil tanker S ... ", "date": "2024-08-24 03:45", "url": "https://accesswdun.com/article/2024/8/1258853", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "e65f104c-c976-42ed-9575-1fe7d70307b4", "title": "Israeli shelling claims lives of 9 Palestinians in Gaza", "date": "2024-08-24 03:00", "url": "https://tribune.com.pk/story/2490587/israeli-shelling-claims-lives-of-9-palestinians-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises following an Israeli strike on a residential building, amid the ongoing conflict between Israel and Hamas, in Khan Younis, in the southern Gaza Strip, on August 16, 2024.\nFile Photo ReutersAt least nine Palestinians, including two children and a woman, were killed early on Saturday by Israeli shelling in Gaza's Khan Younis and the Al-Nuseirat camp area, according to the Palestinian news agency Wafa.\nThe shelling targeted two houses in southern Khan Younis, leading to the reported casualties.\nIn related news, Israeli airstrikes across southern Lebanon on Friday killed at least eight Hezbollah fighters and a child, as Hezbollah responded with artillery and rockets.\nA separate strike in Aita, a village approximately 14 km north of Israel's border, claimed the lives of a Hezbollah fighter and a child."}, {"id": "8d5aa518-1e97-4912-ad40-3c45128816f4", "title": "On This Day In 1986 : Operation El Dorado Canyon , The F - 111 Shining Moment . ", "date": "2024-08-24 00:15", "url": "https://theaviationist.com/2020/04/15/on-this-day-in-1986-operation-el-dorado-canyon-the-f-111s-shining-moment/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "These were the beginnings of the Tuesday, April 15, 1986 Operation El Dorado Canyon, the U.S. retaliatory strikes on Libya.\nThe rehearsal confirmed the mission template for the actual Operation El Dorado Canyon as viable.\nOperation El Dorado Canyon was the shining moment of the F-111’s legacy.\nFinally, the F-111 ended its career in U.S. service in December 1998 as the EF-111 Raven electronic countermeasures variant used in Operation El Dorado Canyon.\nQaddafi’s despotic, and dramatic, reign was finally over, 25 years after the Operation El Dorado Canyon raids that happened on this day in 1986."}, {"id": "05024ee3-88b2-49d8-bee6-518b4389b528", "title": "3 Killed , Several Injured In Stabbing Attack At Festival In Germany Solingen", "date": "2024-08-24 04:30", "url": "https://www.india.com/news/world/3-killed-several-injured-in-stabbing-attack-at-festival-in-germanys-solingen-7189676/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNews3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s Solingen3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenAt least three people were killed during a stabbing attack during a festival in the western German city of Solingen on Friday.\n3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenSolingen: in a tragic incident, three people were killed and several others sustained injuries in a stabbing attack during a festival in the western German city of Solingen, CNN reported.\nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram.\nRead more on Latest World News on India.com."}, {"id": "49d4f735-b988-4397-bac2-9bbf2de48ec8", "title": "Maryland police officer convicted of tossing smoke bomb at police during Capitol riot", "date": "2024-08-24 00:15", "url": "https://www.nbcwashington.com/news/local/maryland-police-officer-convicted-of-tossing-smoke-bomb-at-police-during-capitol-riot/3701325/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "A Maryland police officer was convicted on Friday of charges that he joined a mob's Jan. 6, 2021, attack on the U.S. Capitol and hurled a smoke bomb and other objects at police officers guarding a tunnel entrance.\nThe device struck a police officer's riot shield and filled the mouth of the tunnel with a large plume of smoke, prosecutors said.\n“The actions of one individual do not define the entire department,” the department said in a statement last year.\nLee, of Rockville, Maryland, applied to be a Montgomery County police officer in July 2021 — six months after the riot.\nMoving to the Lower West Terrace, Lee tossed the smoke bomb and three other “rock-like objects\" at officers guarding the tunnel, the judge found."}, {"id": "fb26ec45-bdb7-48c7-81b7-548979aa700e", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "606286f1-955b-4742-9b25-41d044ed72ed", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "ae35cf10-576c-4d93-99f6-6b1411300416", "title": "Germany : Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/three-dead-after-stabbing-attack-at-festival-in-western-germany/articleshow/112753072.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThree people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen police said.They said that at around 10 p.m. (2000 GMT) a single, unidentified man attacked multiple people and that the perpetrator was still at large.\n\"It tears my heart apart that there was an attack on our city.\nI have tears in my eyes when I think of those we have lost,\" Solingen Mayor Tim-Oliver Kurzbach said in a statement.\n\"I pray for all those who are still fighting for their lives.\n\"Fatal stabbings and shootings in Germany are relatively uncommon.The police said the attack occurred at a festival to honour the town's 650th anniversary.Solingen is in North Rhine-Westphalia state, Germany's most populous and bordering the Netherlands.The state's interior minister, Herbert Reul, visited the scene, telling reporters it was a targeted attack on human life but declining to speculate on the motive.The attack occurred at the Fronhof , the mayor's statement said, a market square where live bands were playing.The German government has been aiming to toughen rules on knives that can be carried in public by reducing the length allowed.In June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.There was a stabbing attack on a train in 2021, injuring several."}, {"id": "dd2ff99a-b149-48f0-b260-a0a8a17d2b2a", "title": "Knifeman kills three , injures three in nighttime assault in western Germany", "date": "2024-08-24 01:15", "url": "https://tribune.com.pk/story/2490583/knifeman-kills-three-injures-three-in-nighttime-assault-in-western-germany", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Photo ReutersThree people were killed and three others seriously injured in a stabbing attack at a festival on Friday night in Solingen, western Germany, according to police.\nThe incident occurred around 10pm (2100 CET) when an unidentified man attacked several people.\nMayor Tim-Oliver Kurzbach expressed his anguish, stating, \"It tears my heart apart that there was an attack on our city.\nA similar stabbing occurred in June, resulting in the death of a 29-year-old policeman in Mannheim during a right-wing demonstration.\nThe German government is currently working to tighten regulations on public knife carrying by reducing the permissible length of blades."}, {"id": "1e593abd-82a9-490a-b347-f12cffb6527e", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 01:15", "url": "https://www.channelnewsasia.com/world/solingen-germany-stabbing-three-dead-after-attack-festival-4564961", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany: Three people were killed and three others seriously wounded in a stabbing attack at a festival on Friday (Aug 23) night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "29099730-abe3-4a22-bfeb-3a29f53091b0", "title": "3 dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.asiaone.com/world/3-dead-after-stabbing-attack-festival-western-germany", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany - Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday (Aug 23) night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "042d4d77-3153-461a-a770-6f73976d01e6", "title": "Deadly Stabbing Attack at Solingen Festival Leaves Multiple Victims", "date": "2024-08-24 00:00", "url": "https://www.devdiscourse.com/article/business/3062305-deadly-stabbing-attack-at-solingen-festival-leaves-multiple-victims", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A tragic stabbing attack at a festival in Solingen, Germany, on Friday night resulted in multiple fatalities and injuries, according to police.\nSolingen Mayor Tim-Oliver Kurzbach confirmed the casualties and injuries but withheld further details.\nHe expressed his profound grief, saying, \"It tears my heart apart that there was an attack on our city.\nThe attack took place during celebrations for the town's 650th anniversary at the Fronhof market square, where live bands were performing.\nGermany has seen sporadic instances of fatal stabbings and shootings, including the stabbing of a policeman in Mannheim in June and an attack on a train in 2021."}, {"id": "3a8d7eba-cf2a-4f6e-bf8b-b99f163088ba", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.swissinfo.ch/eng/three-dead-after-stabbing-attack-at-festival-in-western-germany/87430985", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Three dead after stabbing attack at festival in western Germanyreuters_tickers2 minutesBy Petra WischgollSOLINGEN, Germany (Reuters) -Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\n“It tears my heart apart that there was an attack on our city.\nThe police said the attack occurred at a festival to honour the town’s 650th anniversary.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "c1285917-7290-45b8-9e3b-4649e404d592", "title": "3 killed in Germany festival knife incident ; attacker reportedly on the run", "date": "2024-08-24 02:30", "url": "https://www.straitstimes.com/world/europe/multiple-dead-others-injured-after-stabbing-attack-at-festival-in-western-germany", "domain": "straitstimes.com", "domain_classification": "Local - Asia", "message": "FRANKFURT/SOLINGEN, Germany - German police said on Aug 24 that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen.\nThe police said in a statement early on Aug 24 that eight were injured, five of them seriously.\nThe attack occurred at around 9.40pm (1940 GMT) on Aug 23, when the man attacked multiple people with a knife, the police said.\nThe mayor of the city confirmed there were dead and injured due to an attack, but did not go into details.\nThe police said the attack occurred at a festival to honour the town’s 650th anniversary."}, {"id": "992ca0a3-e026-497b-951a-1bcb04f4d388", "title": "Do Aircraft Carriers Travel Alone ? ", "date": "2024-08-24 00:30", "url": "https://www.slashgear.com/1645746/do-aircraft-carriers-travel-alone/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The U.S. has 11 aircraft carriers at the moment, and each one is a powerful asset that's a big target for enemy forces.\nBig is the key word here, since despite being faster than you might think, aircraft carriers aren't exactly the most lithe, stealthy ships on the water, and quite vulnerable to attacks.\nThey typically consist of the aircraft carrier, two guided missile cruisers, two anti-aircraft warships, and one to two anti-submarine destroyers or frigates.\nCarrier groups are rarely alike, depending on the nature of the mission.\nSometimes there are also other types of ships, including supply ships, mine sweepers, troop ships, and cargo ships carrying tanks and other equipment."}, {"id": "3aea5156-b57e-4994-9590-53b045bf534e", "title": "Germany festival : Several dead and wounded in stabbing attack", "date": "2024-08-24 00:15", "url": "https://www.nzherald.co.nz/world/germany-festival-several-dead-and-wounded-in-stabbing-attack/BJSG72YO3FDEBPV2WNNLAZQD2M/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Several people have been killed and others wounded when a man knifed passers-by at random at a festival in the western German city of Solingen, newspaper Bild reports.\nVideo / BBCSeveral people have been killed and others wounded after a man knifed passers-by at random at a festival in the western German city of Solingen today, newspaper Bild reports.\nBild said the incident occurred at about 9.45pm on Friday (local time) and that at least three people were dead and several were wounded.\nWitnesses said the perpetrator was at large.\nThe local newspaper Solingen Tageblatt reported on its website that the attack occurred at a festival to honour the city’s 650 years."}, {"id": "6b9632c5-f7fd-42cd-9f1c-8bfec189aa6a", "title": "Trump assassination attempt : At least 5 Secret Service agents placed on leave", "date": "2024-08-24 02:30", "url": "https://www.bostonherald.com/2024/08/23/at-least-5-secret-service-agents-placed-on-leave/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nThe agents are on administrative leave, meaning they cannot do investigative or protective work.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”"}, {"id": "88769ddd-416d-45f4-ba7d-b3ea7c240655", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:15", "url": "https://www.local10.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "local10.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "ee6981d2-4fa7-4aaa-b1da-2c89ac0558ee", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:30", "url": "https://www.news4jax.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "05d08518-6a4c-472d-8cef-0e9b98d2e480", "title": "FBI probing drive - by attack on Sikh separatist in California", "date": "2024-08-24 04:30", "url": "https://economictimes.indiatimes.com/news/international/world-news/fbi-probing-drive-by-attack-on-sikh-separatist-in-california/articleshow/112754353.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "He said he immediately thought of Nijjar, saying \"this is how Hardeep Singh Nijjar had been assassinated and the whole picture of the scene went through my mind.\n\"As they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, said Raju.\nHe and his two friends fled into a nearby field and hid behind a haystack while they called 911.\n\"They want to stop the Khalistan referendum,\" he said.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "3e30b629-a8cf-447b-83f9-540e737c36f4", "title": "Sikh separatist attacked in drive - by in California , FBI probing", "date": "2024-08-24 00:30", "url": "https://www.ctvnews.ca/world/fbi-probing-drive-by-attack-on-sikh-separatist-in-california-1.7012634", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Nijjar was killed in June 2023 outside his gurdwara, a Sikh place of worship, in Surrey, British Columbia.\nThe FBI's Sacramento office confirmed it is collaborating with the California Highway Patrol \"in support of the investigation\" into the shooting.\nIn the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nThe Indian Embassy in Washington did not respond to a request for comment on Friday about the recent shooting in California.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "800e02e4-3143-465e-a62e-024a600ef1ac", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:00", "url": "https://www.lowellsun.com/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt-2/", "domain": "lowellsun.com", "domain_classification": "Unknown", "message": "By MICHAEL BALSAMOAt least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nOne of the five agents was assigned to Trump’s protective detail, the official said.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "2976c9ba-4a21-457f-88cf-1eceb4a9319e", "title": "Secret Service quietly puts five officers on leave , as campaigns move on from Trump shooting", "date": "2024-08-24 00:15", "url": "https://www.salon.com/2024/08/23/secret-quietly-puts-five-officers-on-leave-as-campaigns-move-on-from/", "domain": "salon.com", "domain_classification": "Unknown", "message": "In addition to the Pittsburgh field office head, at least three officers from that office and one member of the former president’s personal detail were also placed on leave, according to CBS News.\nThe decision, which was not confirmed to be a disciplinary action, comes as the shooting — once thought to be election-defining — moves to the back burner on the campaign trail.\nThe shooting at the Butler, Pennsylvania rally was called a massive security breakdown, with the FBI later taking the reins of the investigation as the Secret Service’s own ​​internal affairs division continues its inquiry.\nThough Secret Service spokesperson Anthony Guglielmi didn’t confirm the suspensions, telling CBS they wouldn’t comment on individuals, he confirmed that agents were being held to “the highest professional standards” and that disciplinary action could occur if a policy violation was found.\nTrump, who returned on Wednesday for his first outdoor rally since the shooting, made no mention of the conspicuous newly added bulletproof glass standing between him and the crowd."}, {"id": "08368e4d-66e1-4682-aa41-46de81c4ec2e", "title": "FBI probing attack on Sikh separatist with ties to Nijjar", "date": "2024-08-24 00:30", "url": "https://www.cbc.ca/news/canada/british-columbia/fbi-probe-attack-on-sikh-separatist-1.7303991", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Speaking through an interpreter, Raju told Reuters that a white car pulled up to the left of their truck, then fell back behind them before pulling up alongside them again.\nAs they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, Raju told Reuters.\n(CBC)In the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nRaju told Reuters he was not among those who received such calls.\nA look at the movement for an independent Sikh state Duration 13:38 Some Sikhs have historically been seeking an independent Sikh homeland in northern India called Khalistan."}, {"id": "18f238de-579f-4ebd-b51e-0ac21153a4a0", "title": "As threats rise , Israelis turn to home bomb shelters", "date": "2024-08-24 03:30", "url": "https://www.al-monitor.com/originals/2024/08/threats-rise-israelis-turn-home-bomb-shelters", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Israeli couple Aviva Pertzov and Jeff Lederer put off building a bomb shelter for years.\nWhen it is finished, this \"safe room\" will have white-painted walls, a sofa and a tiled floor, and a single window with a heavy metal shutter that closes across it with a clang.\nHe added: \"Those (safe) rooms save lives.\nThe cost of building such a safe room varies approximately between $30,500 and $56,000.\nHowever, about 55 percent of Israeli households do not have safe rooms, according to official estimates, because of either cost, lack of space, fatalism or obstinacy."}, {"id": "f7387ab5-12bc-4b14-b4be-0d30c053844c", "title": "Ukraine prioritising holding on to Russian territory", "date": "2024-08-24 01:30", "url": "https://www.dailymail.co.uk/news/article-13775063/Ukraine-prioritising-holding-Russian-territory-seized-following-daring-mini-invasion-Zelensky-trade-Kursk-recover-land-captured-illegally-Putins-army.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine's daring 'mini-invasion' of southern Russia is not expected to push any further into the country, Western officials have said.\nSpeaking for the first time about the surprise incursion, they suggested that the Kyiv regime will chiefly aim to hold on to the territory it has already seized.\nOfficials indicated that the area of the Kursk region involved could be used in a potential trade-off by president Volodymyr Zelensky to recover Ukrainian land captured illegally by Moscow.\nThere are fresh hopes that negotiations could end the war after India's prime minister Narendra Modi visited Kyiv yesterday.\nWestern officials said five brigades of Russian troops were being reassigned to reinforce Kursk."}, {"id": "df193775-7e07-4339-80b7-b43ae4d0af93", "title": "Germany : At Least 3 Dead And Others Injured In Festival Stabbing , Assailant On The Run", "date": "2024-08-24 03:15", "url": "https://www.oann.com/newsroom/germany-at-least-3-dead-and-others-injured-in-festival-stabbing-assailant-on-the-run/", "domain": "oann.com", "domain_classification": "Unknown", "message": "(Photo by INA FASSBENDER/AFP via Getty Images)OAN Staff Abril Elfi5:12 PM – Friday, August 23, 2024At least three people have been killed and several others were injured after a stabbing attack took place at a Festival of Diversity in Germany.\nAdvertisementAccording to the newspaper Bild, an unidentified man began randomly stabbing bystanders on Friday night in Solingen, Germany.\nIt was unclear at first how many people had died, but the newspaper reported that the incident at a city festival at around 9.45 p.m. local time had resulted in at least three fatalities and several injuries.\nOther outlets have reported that at least four individuals were badly injured in addition to the three that died.\nCommemorating the city’s 650th anniversary, the “Festival of Diversity” commenced on Friday and was scheduled to continue through Sunday."}, {"id": "415f3bd9-db9d-466d-9c5f-7435cbbf6e38", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 04:00", "url": "https://www.geo.tv/latest/560709-three-dead-after-stabbing-attack-at-festival-in-western-germany", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Police officers secure the area of an incident, after several individuals were killed on Friday night when a man randomly stabbed passers-by with a knife, at a city festival in Solingen, Germany, August 23, 2024.\n—ReutersSOLINGEN: Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration."}, {"id": "6ecdd201-914f-4d70-96e8-d2b7840fca49", "title": "Trump three - word warning to police association president as he hogged the microphone at explosive Arizona rally", "date": "2024-08-24 03:30", "url": "https://www.dailymail.co.uk/news/article-13775141/Trump-warning-police-association-president-Arizona-rally.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Former President Donald Trump booted the president of the Arizona Police Association off the stage at his rally telling him 'you gotta go.'\nJustin Harris, the president of the Arizona Police Association, joined Trump on stage at the Desert Diamond Arena in Glendale Friday night.\nThe police association president endorsed the Republican presidential nominee and slammed Kamala Harris for her comments on 'reimagining' public safety.\nHarris looked at Trump standing behind him and the former president told him to wrap it up, saying 'you gotta go.'\nI will establish a new independent commission on assassination attempts,' Trump - an assassination survivor himself - said."}, {"id": "c0e358f3-cf5e-4daf-aeb4-71e2ed67257c", "title": "Solingen : German stabbing attack leaves three dead", "date": "2024-08-24 00:00", "url": "https://us.cnn.com/2024/08/23/europe/germany-solingen-stabbing-attack-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded several others at a festival Friday in the western German city of Solingen, police told CNN.\nThe lone male suspect is on the run and special police forces have been deployed to the active manhunt, police added.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "927c773a-10fb-426c-b03d-2d187ea82687", "title": "Police arrest Arizona man for threatening to kill Donald Trump", "date": "2024-08-24 02:15", "url": "https://www.jpost.com/international/article-816097", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Thursday, the Cochise County Sheriff's Office said.\nDonald Trump, the Republican nominee for president, was in Cochise County on Thursday when he visited the US border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff's office said.\nSyvrud was subsequently booked into the Cochise County Jail on a felony warrant from Graham County in Arizona for \"failure to register as a sex offender and two counts of threatening for this case,\" the sheriff's office added.\nAssassination attemptIn early August, a Virginia man was charged with threatening Vice President Kamala Harris, Trump's Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates."}, {"id": "604d3525-df34-443d-bf6d-954cd8e180bb", "title": "Okaloosa deputy charged in airman death , high school football returns , Baker High School vandalized", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/okaloosa-deputy-charged-airman-death-222018587.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Simone and Gerhard will bring you highlights tonight at 10 on our weekly high school football show: 5th Quarter.\nBaker High School vandalizedA high school football rivalry goes too far.\nGraffiti was discovered at Baker High School on the day the season kicks off.\nPoll of the DayThe 2024 high school football season has finally arrived!\nWe asked, “Are you attending the high school football games or just watching the recaps?”Here are your responses."}, {"id": "bc607c7e-ffa4-4324-98f1-9ce0dc2b5d0c", "title": "Solingen : German stabbing attack leaves three dead", "date": "2024-08-24 01:45", "url": "https://edition.cnn.com/2024/08/23/europe/germany-solingen-stabbing-attack-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded several others at a festival Friday in the western German city of Solingen, police told CNN.\nThe lone male suspect is on the run and special police forces have been deployed to the active manhunt, police added.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "b8056b00-2b68-44be-9197-527427a41df3", "title": "Manhunt in Germany after deadly stabbing attack at festival - Boston News , Weather , Sports", "date": "2024-08-24 01:30", "url": "https://whdh.com/news/manhunt-in-germany-after-deadly-stabbing-attack-at-festival/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(CNN) — A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded four others at a festival Friday in the western German city of Solingen, police told CNN.\nThe lone male suspect is on the run and special police forces have been deployed to the active manhunt, police added.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "351679fb-cf15-4707-821a-2bc4d85a8bb1", "title": "Michigan School Bombing Among Largest Mass Murder in U . S . History", "date": "2024-08-24 01:45", "url": "https://wmmq.com/ixp/689/p/bath-school-massacre/", "domain": "wmmq.com", "domain_classification": "Unknown", "message": "The largest U.S. Death Toll in a School tragedy was the Bath School Massacre and it was heartbreaking.\nThe bombing took the lives of 58 people in and around Bath School.\nThis horrific event that took place in 1927 was the largest mass murder in U.S. history up until the Oklahoma City bombing in 1995.\nMany are surprised that the two biggest mass killings in the U.S. are bombings, not mass shootings.\nGet our free mobile appThe people who lost their lives in the tragic bombing in 1927 are remembered at the Bath School Massacre Memorial in Bath Township, Michigan."}, {"id": "75bf5bd0-de3c-404e-8be4-664ba0412132", "title": "How global media reported PM Modi visit to Ukraine as Russia continues its war", "date": "2024-08-24 04:30", "url": "https://www.livemint.com/news/how-global-media-looked-at-pm-modi-visit-to-ukraine-as-russia-continues-its-invasion-of-kyiv-11724468449873.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Prime Minister Narendra Modi on Friday, August 23, visited Ukraine and met President Volodymyr Zelensky as the Russian military continues to invade the country.\nArriving for talks in Kyiv, PM Modi embraced Zelensky with a hug and held a minute of silence at a memorial commemorating children killed in Russia's invasion.\nPM Modi's visit to Ukraine, which has not explicitly condemned Russia's invasion of Kyiv, was closely watched by the West.\nNews agency Associated Press (AP) said PM Narendra Modi's visit to war-torn Ukraine could be seen as India casting itself as a peace mediator as New Delhi offered “as a friend” to help bring peace to the country.\nThe Moscow Times listed how India has continued its trade with Russia when the West was imposing sanctions on Moscow for its invasion of Ukraine."}, {"id": "2e4a80bd-dca1-4144-9480-af4b86876c73", "title": "Secret Service faces continued scrutiny after assassination attempt on Trump , agents placed on leave", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/secret-faces-continued-scrutiny-assassination-231137475.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Secret Service faces continued scrutiny after assassination attempt on Trump, agents placed on leaveRepublican presidential candidate former President Donald Trump is surrounded by U.S. Secret Service agents as he leaves the stage at a campaign rally, Saturday, July 13, 2024, in Butler, Pa. At least five members of the Secret Service have been placed on administrative leave following the assassination attempt on Trump.\nIn the aftermath, Secret Service Director Kimberly Cheatle resigned and was replaced by Acting Director Ronald Rowe.\nA breakdown in communication between local police and the Secret Service contributed to the failure to apprehend Crooks before the shooting, per CNN.\n“I can confirm that the Butler County ESU team made radios available to the Secret Service and that they were not utilized by the Secret Service,” Butler County District Attorney Richard Goldinger said in a statement to CNN.\n“This was a Secret Service failure,” Rowe told reporters during a conference earlier this month, per CNN."}, {"id": "7dd261ad-79f7-4efe-943b-6e4a8726e1d6", "title": "Tensions mount in Lebanon as those in border areas prepare for the worst in Israel - Hezbollah conflict", "date": "2024-08-24 04:00", "url": "https://www.independent.ie/world-news/middle-east/tensions-mount-in-lebanon-as-those-in-border-areas-prepare-for-the-worst-in-israel-hezbollah-conflict/a231096996.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Tensions mount in Lebanon as those in border areas prepare for the worst in Israel-Hezbollah conflictCitizens say they feel trapped between warring parties in the regionA man works next to a destroyed home in the Israeli-annexed Golan Heights.\nPhoto: AP/Ariel SchalitSusannah George © Washington Post Today at 03:30For weeks, the Middle East has been on edge, waiting for a retaliatory Iranian attack on Israel that many fear could trigger all-out war.\nWhile Tehran has signalled it will bide its time, daily violence continues to rage along the Israel-Lebanon border."}, {"id": "9a14f59a-52c7-4ab1-b1cc-dc6b0137dc6f", "title": "Multiple Secret Service agents on leave after assassination attempt on Trump", "date": "2024-08-24 00:00", "url": "https://www.wtvr.com/politics/trump-indictments/secret-service-places-multiple-agents-on-administrative-leave-following-assassination-attempt-on-trump", "domain": "wtvr.com", "domain_classification": "Unknown", "message": "A source familiar with the situation confirmed to Scripps News that several Secret Service agents, including the special agent in charge of the Pittsburgh field office, have been placed on administrative leave in the wake of the July 13 assassination attempt against former President Donald Trump.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptKimberly Cheatle told Congress one day before resigning as Secret Service director that the incident was the Secret Service's \"most significant operational failure\" in decades.\n\"The U.S. Secret Service is committed to investigating the decisions and actions of personnel related to the event in Butler, Pennsylvania and the attempted assassination of former President Donald Trump,\" said Anthony Guglielmi, U.S. Secret Service chief of communications.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe Department of Homeland Security said that it would conduct an independent 45-day review of the July 13 incident that left Trump wounded."}, {"id": "8e517a5c-8121-4028-9b06-bf503acfc883", "title": "Donald Trump Fundraises on Return to Site of Assassination Attempt in Pennsylvania , Promoting  Rally of the Century  ", "date": "2024-08-24 03:00", "url": "http://www.econotimes.com/Donald-Trump-Fundraises-on-Return-to-Site-of-Assassination-Attempt-in-Pennsylvania-Promoting-Rally-of-the-Century-1684948", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "Former President Donald Trump is making a dramatic return to Butler County, Pennsylvania, the very location where he survived an assassination attempt earlier this year.\nThis visit, billed as the \"Rally of the Century,\" has been turned into a fundraising opportunity by the Trump campaign, capitalizing on the heightened emotions and symbolism surrounding the event.\nIn a message sent to supporters, Trump announced his upcoming rally with characteristic flair, urging his base to join him at the site of the near-tragic incident.\nThe assassination attempt took place in July when 20-year-old Thomas Matthew Crooks opened fire on a crowd during one of Trump's rallies.\nIn the wake of the assassination attempt, Trump's campaign became more cautious in selecting venues for rallies, prioritizing enclosed spaces with stringent security measures."}, {"id": "50e8c6dc-98e5-4f71-b06d-2afa74684ee3", "title": "Germany : Several killed in stabbing attack at festival in Solingen", "date": "2024-08-24 00:30", "url": "https://news.webindia123.com/news/Articles/World/20240824/4228151.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The attack happened on a central square, the Fronhof, according to Euro News.\n\"Festival of Diversity\" being held in the city over the weekend to mark the 650th anniversary of its founding, CNN reported, citing police.\nSolingen has about 160,000 inhabitants and is located near the bigger cities of Cologne and Dusseldorf.\n\"This evening, all of us in Solingen are experiencing shock, horror, and great sadness,\" city mayor, Tim Kurzbach, wrote on Solingen's Facebook page.\nThe three-day \"Festival of Diversity,\" started on Friday, according to the festival's website and it was supposed to include music, food, performances, and family-friendly entertainment."}, {"id": "262f38eb-6988-4098-969b-1e18b6452834", "title": "Russell Westbrook Posts Instagram Story Message For Kobe Bryant", "date": "2024-08-24 02:30", "url": "https://www.si.com/fannation/nba/fastbreak/russell-westbrook-posts-instagram-story-message-for-kobe-bryant", "domain": "si.com", "domain_classification": "Unknown", "message": "Kobe said he sees 'a ton' of similarities between he and Westbrook pic.twitter.com/8uJPdLVKkI"}, {"id": "207be143-59eb-4d5f-bcc1-9465e5871a84", "title": "Russo - Ukraine War - 23 August 2024", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-23.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe General Staff of the Armed Forces of Ukraine reported that Defense Forces of Ukraine continue to repel attacks.\nIn the Kharkiv direction, Russian terrorists are trying to appease Ukrainian units in the areas of Vovchansk and Glybokoye.\nIn the Kramators Краkomu direction, Ukrainian soldiers repelled 20 Russian attempts to advance near the Chasovoye Yar, Kalinivka and Ivanivsky."}, {"id": "5762e13b-405d-42d2-9be8-bfebc5bee95a", "title": "Trump Complains That Biden Had More Secret Service Than Him", "date": "2024-08-24 00:15", "url": "https://www.mediaite.com/tv/trump-complains-there-are-too-few-secret-service-agents-at-his-rallies-while-biden-was-loaded-up-with-them/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "Former President Donald Trump complained he has too few Secret Service agents at his rallies while claiming President Joe Biden “was loaded up” with protection.\n“They never gave us the number of people in terms of Secret Service people that were necessary,” Trump told reporters.\n“And yet Biden, who would have ten people are rally was loaded up with with Secret Service.\nSo I’ve complained about that for a long time.”Moreover, at least five Secret Service members have been placed on administrative leave after the July 13 assassination attempt on Trump’s life.\nA bullet struck Trump’s right ear, while firefighter Corey Comperatore was fatally struck by the sniper."}, {"id": "1b264014-32e4-43b3-a09c-95455bc27f4f", "title": "Multiple Secret Service agents on leave after assassination attempt on Trump", "date": "2024-08-24 02:30", "url": "https://www.ksby.com/politics/trump-indictments/secret-service-places-multiple-agents-on-administrative-leave-following-assassination-attempt-on-trump", "domain": "ksby.com", "domain_classification": "Unknown", "message": "A source familiar with the situation confirmed to Scripps News that several Secret Service agents, including the special agent in charge of the Pittsburgh field office, have been placed on administrative leave in the wake of the July 13 assassination attempt against former President Donald Trump.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptKimberly Cheatle told Congress one day before resigning as Secret Service director that the incident was the Secret Service's \"most significant operational failure\" in decades.\n\"The U.S. Secret Service is committed to investigating the decisions and actions of personnel related to the event in Butler, Pennsylvania and the attempted assassination of former President Donald Trump,\" said Anthony Guglielmi, U.S. Secret Service chief of communications.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe Department of Homeland Security said that it would conduct an independent 45-day review of the July 13 incident that left Trump wounded."}, {"id": "9f4aa57c-b484-4863-bd58-2ec411b73003", "title": "Manhunt in Germany after deadly stabbing attack at festival", "date": "2024-08-24 00:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/08/23/manhunt-in-germany-after-deadly-stabbing-attack-at-festival/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded four others at a festival Friday in the western German city of Solingen, police told CNN.\nThe lone male suspect is on the run and special police forces have been deployed to the active manhunt, police added.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "3e7e0f95-407d-4914-b570-ffd9409d86b4", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:15", "url": "https://www.crookwellgazette.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "8f2823d3-e821-49bb-b263-cc161fa47916", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:00", "url": "https://www.edenmagnet.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "edenmagnet.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "fea4c026-afaf-4e04-b3f7-4252a59101f9", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:30", "url": "https://www.queanbeyanage.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "d5f7c2dc-4521-4ef2-9146-cba1c872db82", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 01:15", "url": "https://www.newcastleherald.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "575fd625-f83f-4d53-9b4b-fb16d8ed2409", "title": "Phoenix police seek public assistance in locating drive - by suspect who injured a teenage girl", "date": "2024-08-24 03:15", "url": "https://www.yahoo.com/news/phoenix-police-seek-publics-assistance-001622884.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police are asking for the public's help locating the shooter responsible for injuring a teenage girl Thursday night near Seventh Avenue and Dr. Martin Luther King Boulevard, according to the Phoenix Police Department.\nAt about 11 p.m., officers responded to reports of a shooting in a neighborhood south of Hayden Park where a teenage girl was found with a gunshot wound.\nThe girl was taken to the hospital with non-life-threatening injuries, according to Phoenix police Sgt.\nAnyone with information was asked to call Silent Witness at 480-WITNESS (948-6377) or 480-TESTIGO (837-8446) to provide an anonymous tip.\nThis article originally appeared on Arizona Republic: Phoenix teenager injured in shooting, police search for suspect"}, {"id": "df7ea7a0-424e-4d48-bf4b-d9e795287332", "title": "Man arrested after threatening to kill Trump via social media", "date": "2024-08-24 03:00", "url": "https://tribune.com.pk/story/2490585/man-arrested-after-threatening-to-kill-trump-via-social-media", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Photo ReutersAn Arizona man, Ronald Lee Syvrud, 66, was arrested on Thursday after threatening to kill former President Donald Trump via social media, according to the Cochise County Sheriff's Office statement on Friday.\nTrump, the Republican presidential nominee, was in Cochise County that day, visiting the US-Mexico border as part of his campaign.\nIn August, a Virginia man was charged with threatening Vice President Kamala Harris, and in December, a New Hampshire man was arrested for threatening Republican presidential candidates.\nThe US Secret Service faced heavy criticism following the attack, leading to the resignation of its director.\nDespite the new threats, Trump expressed his \"great respect\" for the Secret Service, acknowledging their mistakes but stating that they will learn from them."}, {"id": "d908e529-ea1b-4b75-b274-cee7ef60e50e", "title": "Three killed in Germany festival knife attack", "date": "2024-08-24 03:00", "url": "https://www.myjoyonline.com/three-killed-in-germany-festival-knife-attack/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Police have now sealed off the scene of the attackThree people have been killed and another four seriously injured in a knife attack in the western German city of Solingen, police say.\nThe attack happened during a festival in the city centre on Friday evening.\nA huge manhunt is now under way, with police helicopters seen hovering above the city.\nPhilipp Müller, one of the festival organisers, said the emergency crews were fighting for the lives of nine people, the Solinger Tageblatt newspaper reports.\nSolingen - a city in North Rhineland-Westphalia famous for its steel industry - has about 160,000 inhabitants."}, {"id": "7555e613-af12-4d48-bf35-5aa3f669227e", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 03:15", "url": "https://www.singletonargus.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "b5739935-eb33-4540-bee6-047685f04d2d", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 03:00", "url": "https://www.maitlandmercury.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "30272f79-5333-449b-9c4d-f1d39ecd3ec5", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 03:00", "url": "https://www.batemansbaypost.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "da40873f-f5bb-4faf-adf4-089dc5209f78", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 04:00", "url": "https://www.naroomanewsonline.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "naroomanewsonline.com.au", "domain_classification": "Unknown", "message": "At least one helicopter was seen in the air, while many police and emergency vehicles with flashing blue lights were on the road and several streets were closed off."}, {"id": "2c1eda9a-e4d8-4d46-a5f5-80254d8b417f", "title": "3 Killed , Several Injured In Knife Attack In German City : Report", "date": "2024-08-24 03:30", "url": "https://menafn.com/1108595572/3-Killed-Several-Injured-In-Knife-Attack-In-German-City-Report", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Berlin, Aug 24 (IANS) At least three people have been killed and several others in a knife attack in Germany's Solingen city, local reported.\nThe attack took place on Friday night as a festival was underway to mark the 650th anniversary of the city's founding, Xinhua news agency reported, citing German media.\nAt present, rescue workers are working on those injured.\nAt about 10 p.m. local time, a man with a knife attacked people attending the event.\nPolice then issued a major alert and a shooting alert."}, {"id": "7be3a495-bc6b-4957-ad68-baee144641a6", "title": "Man accused of threatening to kill Trump arrested in Arizona", "date": "2024-08-24 01:45", "url": "https://www.theguardian.com/us-news/article/2024/aug/23/donald-trump-man-arrested-threat", "domain": "theguardian.com", "domain_classification": "International", "message": "An Arizona man who was wanted after threatening over social media to kill Donald Trump was arrested on Thursday, the Cochise county sheriff’s office said.\nDonald Trump, the Republican nominee for president, was in Cochise county on Thursday when he visited the US border with Mexico as part of his campaign.\nThe man, Ronald Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff’s office said.\nIn early August, a Virginia man was charged with threatening Kamala Harris, Trump’s Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates.\nDespite this and new threats, Trump said on Thursday he has “great respect” for the Secret Service and “the job they do”."}, {"id": "41cae608-cdf7-40e9-8ac1-c5d19626a37f", "title": "Arizona man arrested after threatening to kill Trump , sheriff office says", "date": "2024-08-24 02:30", "url": "https://www.aol.com/arizona-man-arrested-threatening-kill-002415113.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Kanishka SinghWASHINGTON (Reuters) - An Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Thursday, the Cochise County Sheriff's Office said.\nDonald Trump, the Republican nominee for president, was in Cochise County on Thursday when he visited the U.S. border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff's office said.\nIn early August, a Virginia man was charged with threatening Vice President Kamala Harris, Trump's Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates.\nDespite this and new threats, Trump said on Thursday he has \"great respect\" for the Secret Service and \"the job they do,\" while adding they made mistakes from which they will learn."}, {"id": "64928ef3-7ed5-444c-81c5-c66e7ab48104", "title": "Arizona man arrested after threatening to kill Trump , sheriff office says", "date": "2024-08-24 01:45", "url": "https://www.theglobeandmail.com/world/us-politics/article-arizona-man-arrested-after-threatening-to-kill-trump-sheriffs-office/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Attendees react during Republican presidential nominee and former U.S. president Donald Trump's rally in Glendale, Arizona, on Aug. 23.Go Nakamura/ReutersAn Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Thursday, the Cochise County Sheriff’s Office said.\nDonald Trump, the Republican nominee for president, was in Cochise County on Thursday when he visited the U.S. border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff’s office said.\nSyvrud was subsequently booked into the Cochise County Jail on a felony warrant from Graham County in Arizona for “failure to register as a sex offender and two counts of threatening for this case,” the sheriff’s office added.\nIn early August, a Virginia man was charged with threatening Vice President Kamala Harris, Trump’s Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates."}, {"id": "7ab0676f-a9a4-42b8-9be0-a1e8e1c8a4f5", "title": "Arizona man arrested after threatening to kill Trump , sheriff office says", "date": "2024-08-24 03:00", "url": "https://www.asiaone.com/world/arizona-man-arrested-after-threatening-kill-trump-sheriffs-office-says", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "WASHINGTON - An Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Aug 22, the Cochise County Sheriff's Office said.\nTrump, the Republican nominee for president, was in Cochise County on Aug 22 when he visited the US border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff's office said.\nHe was taken into custody on Aug 22 afternoon, authorities said on Aug 23.\n[[nid:694986]]In early August, a Virginia man was charged with threatening Vice-President Kamala Harris, Trump's Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates."}, {"id": "194709ec-4cde-43ce-9002-c5ad845b645c", "title": "Great Board Games To Play If you Like Risk", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/great-board-games-like-risk/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "As this is my favorite genre of board game, I gladly present to you some of the best board games to play if you like Risk.\nRecommended VideosImage: Academy Games878 Vikings is a lesser-known board game set during the Viking invasions of England.\nIf you’ve ever wanted your Risk games to have more of a narrative, then Inis is the perfect board game for you to try.\nHowever, for those who enjoy Risk and also love more complex and dramatic board games, you can’t get much better than Twilight Imperium.\nWith these excellent suggestions of Risk-adjacent board games, you can start your next game night with your new favorite."}, {"id": "1cde84e1-ab8b-478c-9960-7feb18eb2df0", "title": "Russo - Ukraine War", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-kursk.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Ukrainian forces used at least three German Marder fighting vehicles in the Kursk Region, the first German armor advance onto Russian soil since the Great Patriotic War.\nThe first Battle of Kursk, fought between July 5 and August 23, 1943, was one of the largest and most significant battles of World War II.\nv There was fighting 06 August 2024 in the Sudzhansky and Korneevsky districts of Kursk Region.\nThe most important factor in the war right now is Russia's manpower and force availability advantage, in particular with infantry.\n\"Offensive operations also risk taking higher casualties than in defense at a time when Ukrainian forces are stretched thin."}, {"id": "908a040b-007e-4f0d-9d1d-b3288b549125", "title": "Army for  Viksit Bharat  by 2047 - Daily Excelsior", "date": "2024-08-24 00:30", "url": "https://www.dailyexcelsior.com/army-for-viksit-bharat-by-2047/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The focus of the meeting was squarely on the Government’s vision of ‘Viksit Bharat’ by 2047, which coincides with the centenary of the country’s independence.\nThis strategic alignment of the Army’s transformation is essential for the realisation of ‘Viksit Bharat’.\nBy encouraging the development of indigenous equipment, platforms, and weapons, the Army also supports the growth of Indian defence industries.\nChange is never easy, especially in a large and tradition-bound organisation like the Indian Army.\nA modern, agile, and technology-enabled Indian Army will not only enhance national security but also contribute to India’s standing as a global power."}, {"id": "d18b52f7-b5d3-47e4-84b6-2200b5fc729d", "title": "US approves sale of Anti - Submarine Warfare Sonobuoys to India", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/defence/us-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india/articleshow/112753344.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelWashington DC: The United States Secretary of State, Antony Blinken , has approved a possible foreign military sale of anti-submarine warfare Sonobuoys and related equipment to India at an estimated cost of USD 52.8 million.The Defence Security Cooperation Agency delivered the required certification, notifying Congress of this possible sale today, the US Defence Security Cooperation Agency said in a release.Notably, the Defence Security Cooperation Agency is an agency within the United States Department of Defence.\n\"The Government of India has requested to buy AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys; AN/SSQ-62F HAASW sonobuoys; AN/SSQ-36 sonobuoys; technical and publications and data documentation; US Government and contractor engineering and technical support; and other related elements of logistics and program services and support.\nThe estimated total cost is USD 52.8 million,\" the agency stated.This proposed sale will support US' foreign policy and national security objectives by helping to strengthen the United States-India strategic relationship and improving the security of a major defence partner that continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions.The proposed sale will also improve India's capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nIndia will have no difficulty absorbing this equipment into its armed forces.The agency further added that the proposed sale of this equipment and support will not alter the basic military balance in the region.The principal contractor(s) will be Sparton Corporation, located in De Leon Springs, FL, or Undersea Sensor Systems Inc. (USSI), located in Columbia City, IN, or a combination of both.\nThere are no known offset agreements proposed in connection with this potential sale, it added."}, {"id": "fe0e44ad-fa9e-4ead-83f4-00113981a3af", "title": "Revenge of the Kennedys : RFK Jr . Takes a Flame Thrower to the Entire System", "date": "2024-08-24 03:00", "url": "https://pjmedia.com/kevindowneyjr/2024/08/23/revenge-of-the-kennedys-rfk-jr-takes-a-blowtorch-to-the-entire-system-n4931932", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "\"It had become the party of war, censorship, corruption, big pharma, big tech, big AG, and big money.\nHe spoke of \"DNC-aligned judges\" whose job was to throw Kennedy and \"other candidates off the ballot and to throw President Trump in jail.\"\nAnd President Trump says that he will reopen negotiations with President Putin and end the war overnight as soon as he becomes president.\"\nRobert F. Kennedy Jr.\nAddress to the Nation https://t.co/Wf4xt12GSX — Robert F. Kennedy Jr (@RobertKennedyJr) August 23, 2024FACT-O-RAMA!"}, {"id": "f074281a-178b-4104-b5f4-1490439e9382", "title": "Sabotage Confirmed At Norwegian Air Base", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/sabotage-confirmed-norwegian-air-232318518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Norway has revealed that one of its most strategic air bases has been the target of sabotage.\nSuspected sabotage against Air Force Base in Northern Norway.\nIt is one of two Royal Norwegian Air Force (RNoAF) bases hosting permanent F-35A stealth fighter units and it is also receiving the service’s fleet of P-8A maritime patrol aircraft.\nF-35As from 332 Squadron of the Royal Norwegian Air Force (RNoAF).\nOperations continue as planned.”Roughly, 24 hours later, in another post on X, NATO said: “The security level at NATO air base Geilenkirchen has returned to Bravo."}, {"id": "6ff7540e-33fb-4f79-adf9-7e214b3399e9", "title": "New book tells story of K - 9 World War II hero from Wisconsin", "date": "2024-08-24 03:30", "url": "https://www.tmj4.com/news/state-capitol/new-book-tells-story-of-k-9-world-war-ii-hero-from-wisconsin", "domain": "tmj4.com", "domain_classification": "Unknown", "message": "MADISON, Wis. — Families and their dogs took to downtown Madison on Thursday to celebrate the story of a K-9 World War II hero from Wisconsin.\n‘Brownie the War Dog,’ a new book from the Wisconsin Historical Society Press, tells the tale of Oren Kendley and his dog Brownie.\nHarm Venhuizen Attendees listen to author Kelly Nelson reading her new book, 'Brownie the War Dog.'\nHer subsequent research led her to the Wisconsin Veterans Museum and Joan Yohr, Kendley’s niece, who had kept close records of the family’s history.\nHarm Venhuizen Author Kelly Nelson signs a copy of 'Brownie the War Dog.'"}, {"id": "b89b3f42-9f4a-43c7-a204-6f8a3e3c900f", "title": "US says it killed senior militant group leader in Syria", "date": "2024-08-24 02:00", "url": "https://www.businesstimes.com.sg/international/us-says-it-killed-senior-militant-group-leader-syria", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "AMERICAN forces killed a senior leader of an Al-Qaeda-affiliated militant group in a strike in Syria on Friday (Aug 23), the US military said.\nThe strike targeted Abu Abdul Rahman al-Makki, who was “a Hurras al-Din Shura Council member and senior leader responsible for overseeing terrorist operations from Syria,” the US Central Command (Centcom) said in a social media post.\n“Hurras al-Din is an Al-Qaeda-associated force based in Syria that shares Al-Qaeda’s global aspirations to conduct attacks against US and Western interests,” Centcom said.\nThe US military has around 900 troops in Syria as part of the international coalition against the Islamic State group.\nThe coalition was established in 2014 to help combat the jihadists, who had taken over vast swathes of Iraq and Syria."}, {"id": "ac5e255a-fc24-44b2-b233-9aa6e0bcc06d", "title": "MARKET REPORT : Melrose shares tumble after double downgrade", "date": "2024-08-24 01:45", "url": "https://www.dailymail.co.uk/money/markets/article-13773949/MARKET-REPORT-Melrose-shares-tumble-double-downgrade.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Nearly £500m was wiped off the value of Melrose following a double downgrade.\nWhile most analysts reckon the stock is worth buying, UBS broke ranks by advising clients to sell shares in the owner of the GKN aerospace business.\nDowngrade: Melrose fell 7.1 per cent, or 36.3p, to 474.7p, reducing its value by £471mBut that is less than half of the £5.7billion valuation cited by Melrose.\nMelrose bought GKN, which made cannonballs used at the Battle of Waterloo and Spitfires for the Battle of Britain, for £8billion in a controversial deal in 2018.\nADF, which rents out costume and make-up trailers to the UK film and TV industry, raised £10m through placing 20m shares at 50p each."}, {"id": "786b2eb9-f268-40df-8d75-98546e90587b", "title": "Gov . Evers Orders Flags to Half - Staff in Honor of Sergeant Jack Hohlfeld Who Lost His Life in World War II", "date": "2024-08-24 00:00", "url": "https://urbanmilwaukee.com/pressrelease/gov-evers-orders-flags-to-half-staff-in-honor-of-sergeant-jack-hohlfeld-who-lost-his-life-in-world-war-ii/", "domain": "urbanmilwaukee.com", "domain_classification": "Unknown", "message": "“Sergeant Jack Hohlfeld was a decorated military hero who selflessly answered the call to serve and gave his life defending the values and freedoms we as a nation hold most dear,” said Gov.\nOn Dec. 8, 1941, Sergeant Hohlfeld and members of the 24th Pursuit Group were engaged in combat and were soon overtaken by Japanese forces and forced to surrender as prisoners of war.\nSergeant Hohlfeld will be buried on Mon., Aug. 26, 2024, in La Crosse.\nNOTE: This press release was submitted to Urban Milwaukee and was not written by an Urban Milwaukee writer.\nWhile it is believed to be reliable, Urban Milwaukee does not guarantee its accuracy or completeness."}, {"id": "fae79926-7600-409b-8f8c-50a1283c01ab", "title": "COD : Modern Warfare 3 Details Leaked !! ", "date": "2024-08-24 03:00", "url": "https://www.thfire.com/entertainment/cod-modern-warfare-3-details-leaked-11793", "domain": "thfire.com", "domain_classification": "Unknown", "message": "Call of Duty: Modern Warfare 3 the most awaited game of the year and is set to be released on Nov 8th 2011 now has some details leaked.\nThese leaked details offers you some sneak-peak of the way the game is going to work and some interesting pictures!\nHere’s what we know: Modern Warfare 3 will span the globe, much like the previous game.\nModern Warfare 3 will also reportedly tie up a number of loose ends from the previous two games that left players hanging, and pick up almost immediately after the cliffhanger ending of Modern Warfare 2.\nMultiplayer also makes a strong comeback in Modern Warfare 3, and even includes new game types and tons of new maps in addition to some of the older, more familiar multiplayer modes."}, {"id": "b6494b09-ab36-4d45-96b3-ccb6f2614b9d", "title": "The Bachelor : How a double amputee became Ukraine most desirable man", "date": "2024-08-24 02:15", "url": "https://www.bbc.co.uk/news/articles/clywj08d89no", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "In the years before Russia's full-scale invasion, he was working as a barista in a Kyiv restaurant while studying graphic design.\nIn August 2022, he was stationed near Izyum, an occupied city on the front lines of the Russian advance.\nThe city was liberated by Kyiv just a month after Oleksandr was seriously injured while defending the nearby Ukrainian position.\nI felt a terrible pain in my legs and realised that it would mean the amputation of my legs,\" he said.\nAt the time, authorities said they had found more than 400 bodies in graves near the city."}, {"id": "0428aafb-f309-426c-8742-27189b57e9cb", "title": "McClain Cellars Unveils the Black Heroes Collection : A Tribute to American Icons", "date": "2024-08-24 03:00", "url": "https://www.pr.com/press-release/918752", "domain": "pr.com", "domain_classification": "Unknown", "message": "Irvine, CA, August 23, 2024 --( PR.com )-- McClain Cellars, Southern California’s only Black-owned winery, is proud to announce the launch of the Black Heroes Collection, a series of five extraordinary wines dedicated to celebrating the legacies of some of America’s most revered Black heroes.\n\"At McClain Cellars, we believe in the power of storytelling through wine,\" said Jason McClain, founder and proprietor.\n\"As one of very few black owned wineries in the US., the Black Heroes Collection is our way of paying tribute to the incredible men and women who have paved the way for future generations.\n\"The Black Heroes Collection is available now for purchase online and in McClain Cellars' tasting rooms located in Irvine, Solvang, and two locations in Laguna Beach, California.\nFor more information about the Black Heroes Collection or to schedule a tasting, please visit www.mcclaincellars.com or call 949-484-4459."}, {"id": "da26981a-a80c-4e55-8cd3-d1861c54043d", "title": "Bangkok Post - Kyiv looks to foster bilateral cooperation in Asia", "date": "2024-08-24 00:15", "url": "https://www.bangkokpost.com/opinion/opinion/2852862/kyiv-looks-to-foster-bilateral-cooperation-in-asia", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Kyiv looks to foster bilateral cooperation in AsiaToday, Ukraine celebrates the 33rd Anniversary of Independence -- a fight for which is still ongoing, as the people of Ukraine are determined to win this battle.\nDespite the ongoing aggression, Ukraine looks forward to continuing the strengthened cooperation with all peaceful countries in the world, including the Kingdom of Thailand.\nRemarkably, the Kingdom of Thailand was the first country in the region of Southeast Asia to recognise Ukraine as an independent state in December 1991.\nMany Thai high-level officials, including members of the parliament, visited Kyiv and held talks with their Ukrainian counterparts.\nUkraine and Thailand possess significant potential in promoting bilateral science and technological cooperation."}, {"id": "51785a26-2889-4ea4-b245-481d73c301b1", "title": "Kamala Harris Gaza stance : VP says bloodshed is devastating , hostage and cease - fire deals needed as Hamas - Israel war continues", "date": "2024-08-24 00:30", "url": "https://abc7news.com/post/kamala-harris-gaza-stance-vp-says-bloodshed-is-devastating-hostage-cease-fire-deals-needed-hamas-israel-war-continues/15222721/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Harris says bloodshed in Gaza is devastating, emphasizes support for hostage and cease-fire dealsKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nThe uncommitted delegates entered the venue for Harris' speech Thursday, effectively ending the sit-in, and her speech appeared to go off without interruption from pro-Palestinian protesters."}, {"id": "c77cffd8-1d87-485a-becc-2a382ce59a53", "title": "The pros and cons of a condensed campaign for Harris : From the Politics Desk", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/pros-cons-condensed-campaign-harris-232102331.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The pros and cons of a condensed campaign for Harris: From the Politics DeskThe pros and cons of a condensed campaign for Harris: From the Politics DeskWelcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\nPlus, we dive into Robert F. Kennedy's decision to suspend his third-party bid and back former President Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy added.\nBut it changed dramatically after Harris took over as the Democratic presidential candidate and the polling landscape shifted.\nFrom there, Trump Jr. and donor Omeed Malik served as go-betweens to help close the deal."}, {"id": "51221ebf-2b0b-4f04-b487-a883d43f9164", "title": "Robert F . Kennedy Jr . endorsement of Donald Trump is another bizarre twist , but the political consequences may be minimal", "date": "2024-08-24 00:30", "url": "https://www.theglobeandmail.com/world/us-politics/article-robert-f-kennedy-jrs-endorsement-of-donald-trump-is-another-bizarre/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The rump likely lean to Mr. Trump.\nThe groundwork for the alliance between Mr. Kennedy and Mr. Trump was laid months ago.\nAnd though the Kennedy campaign encountered problems getting their candidate’s name on state ballots for the November election, Mr. Kennedy either brushed aside or ignored these entreaties.\nThe Harris team refused to meet with the Kennedy campaign.\nEventually Mr. Kennedy saw that his only path was through an Independent candidacy, a conclusion buttressed by the fact that the preponderance of those who turned out to his events were Republicans who also liked Mr. Trump."}, {"id": "8d69c8ac-0c99-4a32-bdc8-5d8a1e8b40c8", "title": "All Call of Duty : Black Ops 6 Beta and Early Access dates", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/all-call-of-duty-black-ops-6-beta-and-early-access-dates/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Before Black Ops 6 officially launches in October, you can get a head start with the upcoming Open Beta period.\nIn this guide, we’ll show you all the Open Beta and Early Access dates for Call of Duty: Black Ops 6, including pre-load details.\nThe Open Beta, on the other hand, will be available for all platforms and is a separate event from Early Access.\nPre-loads for Black Ops 6 Beta have already begun with the Modern Warfare 3 and Warzone Season 5 Reloaded update.\nKeep in mind that Open Beta progress might not transfer over to Black Ops 6’s full launch."}, {"id": "cbdaa873-a476-4a99-b097-fb95c819fd55", "title": "  Everything is a fight and it shouldnt be  – parents tell of struggle to secure school places for children with additional needs", "date": "2024-08-24 03:15", "url": "https://www.independent.ie/irish-news/everything-is-a-fight-and-it-shouldnt-be-parents-tell-of-struggle-to-secure-school-places-for-children-with-additional-needs/a1183044534.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Parents of children with additional needs have spoken about how they are at their wits’ end trying to secure school places for this academic year.\nSpecial needs assistants (SNAs), activists, parents and their children marched to the Department of Education in Dublin yesterday to demand action so that vital school places are available for children with special needs.\n“This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.\n“This includes 290 new special classes at primary level and 118 at post-primary.\n“For the coming school year, there will be over 3,300 special classes operating in primary and post-primary schools across the country."}, {"id": "6fe7821e-8f90-4fc4-97b3-d5657437d4dc", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "cc92a48b-6b78-4120-9722-e6fa7a7969bd", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032905.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "4574c5e0-7339-42a7-b470-d4596bb7292e", "title": "RFK Jr . ends long - shot presidential campaign , which included series of bizarre comments about Jews", "date": "2024-08-24 00:00", "url": "https://www.jta.org/2024/08/23/politics/rfk-jr-ends-long-shot-presidential-campaign-which-included-series-of-bizarre-comments-about-jews", "domain": "jta.org", "domain_classification": "Unknown", "message": "Independent presidential candidate Robert F. Kennedy Jr., who injected outlandish comments about Jews into the national dialogue and also vocally supported Israel, suspended his campaign Friday and said he would support Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy said.\nEven amid such statements, Kennedy enjoyed support from some vocally pro-Israel Jews.\nMorton Klein, head of the right-wing Zionist Organization of America, was an Israel advisor to the campaign.\nKennedy, whom Trump has hinted could serve in his cabinet, would not be the first Trump ally to traffic in antisemitic conspiracy theories."}, {"id": "1c4bfbad-251f-4686-8aab-06ce4579905c", "title": "Jon Voight wishes his daughter Angelina Jolie bitter divorce battle with Brad Pitt would  be over  ", "date": "2024-08-24 02:00", "url": "https://www.femalefirst.co.uk/celebrity/jon-voight-wishes-daughter-angelina-jolies-bitter-divorce-battle-brad-pitt-1405093.html", "domain": "femalefirst.co.uk", "domain_classification": "Unknown", "message": "Jon Voight wishes his daughter Angelina Jolie’s bitter divorce battle with Brad Pitt would “be over”.\nJon Voight wishes his daughter Angelina Jolie’s bitter divorce battle with Brad Pitt would ‘be over’The ‘Midnight Cowboy’ actor, 85, spoke out about the former couple’s long-running disputes over custody of their six children and French vineyard – before issuing a public plea to actor Brad, 60, to put a stop to the disputes with 49-year-old Angelina.\nJon told Fox News Digital Friday: “I wish that would be over.\nA source told Page Six Brad was refusing to let go of the fight over the business as he sees it as an asset for his children.\nThe insider added: “It’s important that people realise that Brad’s motivation is to ensure that his kids can maximise the benefit of this asset."}, {"id": "76eeb988-621c-4b7a-9274-bb0e7cd2f8b1", "title": "Sinwar days of reckoning", "date": "2024-08-24 04:00", "url": "https://www.ynetnews.com/article/hklev6lir", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Suppose they are; how firmly can he control his forces throughout the Gaza Strip?\nIt also loses its only chance of survival in the Gaza Strip, and Sinwar apparently forfeits his head.\nIf there is a monitored and selective return into the northern Gaza Strip, only terrorists and hostages will remain in the Al-Muwasi zone.\nThe barring of armed Palestinians from the northern Gaza Strip is the other minefield facing Sinwar.\nDespite the strategic opportunity presented by regional war, Israel and the US have not made their offer insincerely."}, {"id": "4fb90c32-de54-47b8-8016-195fcdf42042", "title": "Green Cove Springs police issues warning against drinking and driving before Labor Day Weekend", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/green-cove-springs-police-issues-223902104.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Green Cove Springs police issues warning against drinking and driving before Labor Day WeekendThe Green Cove Springs Police Department is joining other law enforcement agencies nationwide to combat drunk driving through early September.\nThe campaign runs through Sept. 2, including Labor Dat weekend.\n>>> STREAM ACTION NEWS JAX LIVE <<<According to police, during the 2022 Labor Day holiday period, 490 crash fatalities occurred across the nation, with 39% involving a drunk driver.\nA quarter of the cases involved drivers with Blood Alcohol Content nearly twice the legal limit.\nGreen Cove Springs police say to “drive sober or face the consequences.”[DOWNLOAD: Free Action News Jax app for alerts as news breaks][SIGN UP: Action News Jax Daily Headlines Newsletter]Click here to download the free Action News Jax news and weather apps, click here to download the Action News Jax Now app for your smart TV and click here to stream Action News Jax live."}, {"id": "a4277ebe-92ee-4501-8c82-698ec4b2d681", "title": "Dozens of HBCUs to be represented at 10th Battle of the Bands at NRG Stadium – Houston Public Media", "date": "2024-08-24 00:00", "url": "https://www.houstonpublicmedia.org/articles/shows/houston-matters/2024/08/23/497623/battle-of-the-bands-at-nrg-stadium-this-weekend-will-have-two-houston-area-bands-competing/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Webber said about 37 HBCUs usually participate, and all participating bands receive $50,000 to go toward their institutions.\nListen Audio Embed PopupThe Pepsi Battle of the Bands is taking place this Sunday at NRG stadium.\nDerek Webber, the CEO of Webber Marketing and founder of the competition, was on Houston Matters on Friday.\nWebber said about 37 HBCUs usually participate, and all participating bands receive $50,000 to go toward their institutions.\nTwo of the bands participating are from the Houston area: Texas Southern University’s Ocean of Soul, and Prairie View A&M’s Marching Storm."}, {"id": "7121eae3-b44f-4334-a1b4-23da0dfe1d97", "title": "Comprehensive Market Forecast for Product Stewardship : Market", "date": "2024-08-24 02:00", "url": "https://www.openpr.com/news/3633449/comprehensive-market-forecast-for-product-stewardship-market", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Comprehensive Market Forecast for Product Stewardship: Market Analysis and Growth Trends (2024 - 2031)https://www.reportprime.com/product-stewardship-r14857https://www.reportprime.com/enquiry/request-sample/14857https://www.reportprime.com/enquiry/pre-order/14857https://www.reportprime.com/checkout?id=14857&price=3590https://www.reportprime.com/checkout?id=14857&price=3590https://www.linkedin.com/pulse/future-innovation-global-lithium-ion-batteries-tab-lead-market-vbdzf?trackingId=ETDrOjLAR26DPaGBpS1%2BgA%3D%3Dhttps://www.linkedin.com/pulse/deep-dive-aqueous-inkjet-pigment-dispersion-market-itstrends-dqrnf?trackingId=ewWFyQQCSgK7rGvDE8SeHw%3D%3Dhttps://www.linkedin.com/pulse/cmos-image-sensor-vehicle-mounted-camera-market-share-size-ywo7f?trackingId=RNQ3d68oSf6jZdwFNYoJNw%3D%3Dhttps://www.linkedin.com/pulse/market-dynamics-future-trends-global-roadway-stacker-sector-ghbnf?trackingId=LAIa8Dy%2BSYuaoii4zfhoFQ%3D%3Dhttps://www.linkedin.com/pulse/global-ev-battery-testing-service-industry-research-report-waytf?trackingId=ZtKfpmzRQzSKTWgenfPvbg%3D%3Dhttps://www.linkedin.com/pulse/insights-electric-vehicle-testing-service-market-share-dyuzf?trackingId=YuOSBbbaSFG%2B2FF%2BO8puDg%3D%3Dhttps://www.linkedin.com/pulse/global-household-explosive-gas-detector-market-landscape-ee5uf?trackingId=hZqPLWzRTWaOdMVsxaQsrQ%3D%3Dhttps://www.linkedin.com/pulse/anti-snore-pillow-market-trends-analysis-opportunities-uubyf?trackingId=s3PTkGFnSQeNQb9jXJRJiQ%3D%3Dhttps://www.linkedin.com/pulse/driving-factors-behind-5-axis-welding-robot-market-trends-cgaof?trackingId=2%2B1Qz2MoTb2j6Y%2FqhJWQGA%3D%3Dhttps://www.linkedin.com/pulse/water-waste-tanks-market-trends-detailed-study-its-1of3c?trackingId=dUgpvaScTTCdl6bNjTX7hg%3D%3Dhttps://www.linkedin.com/pulse/evaluating-global-liquid-car-care-products-market-trends-vg3df?trackingId=wyeBr63qQwe1h2b3T4wQCw%3D%3Dhttps://www.linkedin.com/pulse/reinforced-conveyor-belts-market-industry-trends-forecast-krllc?trackingId=a%2FjpMdPnRPuxfZ9WyW8XfA%3D%3Dhttps://www.linkedin.com/pulse/neonatal-critical-care-equipment-market-size-share-trends-analysis-ghgrf?trackingId=jw1PDlkGSPqrvBJhnMY%2Brw%3D%3Dhttps://www.linkedin.com/pulse/sa-son-seed-gum-market-segmentation-geographical-regions-forcast-dd6uf?trackingId=2g%2Bs%2FIaAT5mQqkSa9OH6jw%3D%3Dhttps://www.linkedin.com/pulse/global-calcium-l-threonate-industry-analysis-share-growth-trends-lzwdf?trackingId=MdC4fWFXT0%2By6ek0%2FQfZwQ%3D%3Dhttps://www.linkedin.com/pulse/lead-dioxide-coated-titanium-anode-market-size-share-competitive-oaupf?trackingId=YPdATujSR9%2BX4w6PM1he5A%3D%3Dhttps://www.linkedin.com/pulse/global-d-tartaric-acid-market-size-share-analysis-product-type-j7dnf?trackingId=k3hdZ3AST%2BSkRL0WqagrNw%3D%3Dhttps://www.linkedin.com/pulse/ruthenium-iridium-titanium-anode-market-size-growth-trends-bzyyf?trackingId=FOsRZCVlR1yqcu42WZ%2BT8A%3D%3Dhttps://www.linkedin.com/pulse/analyzing-l-tartaric-acid-market-dynamics-growth-drivers-forecasted-pkhlf?trackingId=3ZxhZK%2FlRsyrPCuFNZAH9w%3D%3Dhttps://www.linkedin.com/pulse/how-iridium-tantalum-coated-titanium-anode-market-changing-from-hhnzf?trackingId=5r5xkj4ZR%2BO2iol3dNKCRQ%3D%3Dhttps://www.linkedin.com/pulse/l-tartaric-acid-market-share-size-trends-industry-analysis-report-pvccf?trackingId=fc5ewTzWRoeJc4IVJf4lWA%3D%3Dhttps://www.linkedin.com/pulse/deep-dive-silicon-nitride-ceramics-roll-market-itstrends-segmentation-6qjjf?trackingId=2ZfvoLicSCayuT7A8mKB3g%3D%3Dhttps://www.linkedin.com/pulse/global-ev-motor-housing-market-focus-product-type-air-coolingwater-gsbef?trackingId=mjf6l%2BoFQJqQY0iqgn2VGg%3D%3Dhttps://www.linkedin.com/pulse/zirconia-ceramics-roll-market-forecast-global-trends-analysis-gcltf?trackingId=%2B1NTv6tIRKayyzwho1cE2g%3D%3Dhttps://www.linkedin.com/pulse/market-trends-global-graphite-polystyrene-foam-board-forecast-bak0f?trackingId=nFUgkWj%2BRdCbXySaIjS9pg%3D%3Dhttps://www.linkedin.com/pulse/global-special-probiotic-strains-market-projected-grow-cagr-pqumc?trackingId=jBqpzorJTmSRXyS2eGceRw%3D%3Dhttps://www.linkedin.com/pulse/driving-market-forces-niobium-targets-semiconductor-trends-future-rzjdf?trackingId=f2OygC%2FlRNix7FPqHFXEVw%3D%3Dhttps://www.linkedin.com/pulse/alpha-tocopheryl-acetate-market-global-insights-sales-trends-8ddvc?trackingId=1O9hloySR2WNI0CG0drbjw%3D%3Dhttps://www.linkedin.com/pulse/what-innovations-shaping-upe-guide-rail-market-application-types-p9sdf?trackingId=tHHtyd%2FrT9eD6Kq6kcDqVg%3D%3Dhttps://www.linkedin.com/pulse/insights-single-feed-check-scanners-market-size-which-expanding-rbkxf?trackingId=%2BuS%2FNg4ZSD66UcEwJZxEzw%3D%3Dhttps://www.linkedin.com/pulse/battery-dispersing-agent-market-global-regional-analysis-focus-mrkyf?trackingId=lgtRNe%2FzR9qmQU9Xo5urlA%3D%3Dhttps://www.linkedin.com/pulse/palm-oil-base-alkanolamide-market-share-size-trends-industry-analysis-zn09f?trackingId=nzSJTY7PTl6H7WbeOYbdhg%3D%3Dhttps://www.linkedin.com/pulse/industrial-water-deionizers-market-growth-outlook-from-2024-o1r4f?trackingId=2Qbp%2FvX0T1uFGa72NfL2rw%3D%3Dhttps://www.linkedin"}, {"id": "515ed031-5196-4bb5-a62c-e59648dd11f4", "title": "Pokémon Horizons", "date": "2024-08-24 01:15", "url": "https://www.tvguide.co.uk/schedule/243f82a5-a85c-552c-ab8c-7574073964e7/pok-mon-horizons", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Pokémon HorizonsBBC Two HD 7:20 AM to 7:40 AM Saturday 24 August Share Add toCalendar +The Bittersweet Truth Season 1 Episode 19 of 45 Repeat S Subtitles Audio DescriptionA stop at the Battle Café in Motostoke brings back painful memories for MurdockPokémon Horizons airs on BBC Two HD at 7:20 AM, Saturday 24 August .\n(Subtitles, repeat, audio description.)"}]