[{"id": "c13f518a-b7ed-4002-9e45-1b70f2bc642e", "title": "Police Detain Suspect in Connection to Explosion Outside of Synagogue in France", "date": "2024-08-25 06:30", "url": "https://sputnikglobe.com/20240825/police-detain-suspect-in-connection-to-explosion-outside-of-synagogue-in-southern-france-1119898747.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240825/police-detain-suspect-in-connection-to-explosion-outside-of-synagogue-in-southern-france-1119898747.htmlPolice Detain Suspect in Connection to Explosion Outside of Synagogue in Southern FrancePolice Detain Suspect in Connection to Explosion Outside of Synagogue in Southern FranceSputnik InternationalOn Saturday, two cars outside a synagogue in the French town of La Grande-Motte exploded, injuring a police officer and prompting an investigation into the event as a possible terrorist attack.\n2024-08-25T05:35+00002024-08-25T05:35+00002024-08-25T05:35+0000worldemmanuel macronfranceisraelgerald darmaninanti-semitismterrorist attacknord streamhttps://cdn1.img.sputnikglobe.com/img/07e8/08/19/1119900440_0:160:3072:1888_1920x0_80_0_0_e1f548b74fbeea71eb1bed15fa57b011.jpgOn Saturday, two cars outside a synagogue in the French town of La Grande-Motte exploded, injuring a police officer and prompting an investigation into the event as a possible terrorist attack.\nAccording to Interior Minister Gérald Darmanin, the suspect opened fire on police.“The alleged perpetrator of the arson attack on the synagogue has been detained.\nFour people and a rabbi were present at the time of the attack but according to officials they were not injured.\nhttps://sputnikglobe.com/20240824/israels-attacks-are-now-part-of-day-to-day-1119891617.htmlfranceisraelSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Mary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgMary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Mary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgfrance, anti-semitism, gerald darmanin, emmanuel macron, israel, southern france"}, {"id": "21957bb6-2b14-43c1-9a7a-1088ff79bfa4", "title": "Campuses Arent Ready for the Return of Encampments Leslie Lenkowsky", "date": "2024-08-25 10:45", "url": "https://www.ruthfullyyours.com/2024/08/25/campuses-arent-ready-for-the-return-of-encampments-leslie-lenkowsky/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "As students start returning to their colleges and universities this month, many will find new rules about protests, camping, signage, and other types of “expressive activity” on their campuses.\nAt its July meeting, Indiana University’s board of trustees adopted a new “expressive activity” policy, which went into effect on August 1.\nThe Cooley report blamed inconsistencies, gaps, and ambiguities in IU’s “expressive activity” policies for causing confusion about what protesters were permitted to do.\nLike those at other schools, IU’s rules had developed piecemeal over many years.\nLike policies that will be adopted at other schools this fall, IU’s new “expressive activity” rules strive to be neutral about what is being expressed."}, {"id": "9a7d79a7-607a-4547-b824-e007beb9a57c", "title": "Top ten moments from the 2024 Democratic National Convention", "date": "2024-08-25 13:45", "url": "https://www.bleedingheartland.com/2024/08/25/top-ten-moments-from-the-2024-democratic-national-convention/", "domain": "bleedingheartland.com", "domain_classification": "Unknown", "message": "I doubt either party has had a more successful convention in my lifetime than last week’s Democratic National Convention in Chicago.\nDoug EmhoffPolitical spouses have one job at a Republican or Democratic National Convention: help voters see a candidate’s personal qualities.\nDuncan reassured fellow Republicans, “If you vote for Kamala Harris in 2024, you’re not a Democrat.\nAbortion storytellersEvery night, the Democratic National Convention featured some “ordinary people” on stage as well as political leaders.\nDo something!”)Video, for those who missed it:Feel free to share your own favorite Democratic National Convention moments in the comments."}]