[{"id": "cc83f0aa-8e8e-40f2-bd28-f6500e2ad240", "title": "Hezbollah drones hit Gaaton ; Israel targets truck , orchard near Sidon", "date": "2024-05-17 10:00", "url": "https://dailystar.com.lb/hezbollah-drones-hit-gaaton/", "message": "On Friday, Israeli airstrikes targeted areas in southern Lebanon, well beyond the border, amid escalating clashes between Israel and Hezbollah.\nAccording to the National News Agency (NNA), “Israeli strikes targeted Najjariyeh and Addousiyeh,” two neighboring villages approximately 30 kilometers from the Israeli border, just south of the coastal city of Sidon.\nThe strikes targeted a pickup truck in Najjariyeh and an orchard, according to the photographer.\nHezbollah has ramped up its cross-border attacks recently, prompting deeper Israeli strikes into Lebanese territory.\nSince the Palestinian group’s October 7 attack on southern Israel, Israel and Hezbollah, an ally of Hamas, have been exchanging near-daily fire, contributing to the ongoing war in Gaza, now in its eighth month."}, {"id": "d5b5e6d1-ce9e-4568-9bf6-6b8395cd7089", "title": "Hezbollah Introduces New Weapons And Tactics Against Israel As War In Gaza Drags On", "date": "2024-05-17 08:30", "url": "https://menafn.com/1108225262/Hezbollah-Introduces-New-Weapons-And-Tactics-Against-Israel-As-War-In-Gaza-Drags-On", "message": "(MENAFN- Live Mint) \"The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe official spoke on condition of anonymity because he was not authorised to detail military information to the media Thursday afternoon attack by a drone carrying missiles came just days after Hezbollah launched three anti-tank guided missiles at an Israeli military post that controlled a surveillance balloon flying over the border released camera footage afterward to show they had hit their mark.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon night before, Hezbollah had carried out its deepest attack in Israel to date using explosive drones to strike at a base in Ilaniya near the city of Tiberias about 35 kilometers (22 miles) from the Lebanon border.\n\\\"We need to make sure that the Israelis living in the northern part of Israel are able to get back to their homes also.”Hezbollah's deputy leader Naim Kassim warned Israel in a speech over the weekend against opening an all-out war.“You have tried in the past and you were defeated and if you try again you will be defeated,” said Kassim, referring to the 2006 Israel-Hezbollah 34-day war that ended in a draw.\nMENAFN17052024007365015876ID1108225262"}, {"id": "d135a3a9-7e54-4eb7-ab29-043f87ed6d06", "title": "Hezbollah introduces new weapons , tactics against Israel as war in Gaza drags on", "date": "2024-05-17 12:45", "url": "https://www.pressherald.com/2024/05/17/hezbollah-introduces-new-weapons-tactics-against-israel-as-war-in-gaza-drags-on/", "message": "BEIRUT — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nThe group has stepped up its attacks on Israel in recent weeks, particularly since the Israeli incursion into the southern city of Rafah in the Gaza Strip.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone."}, {"id": "c868acad-a404-4aec-bb98-6f531629f7f3", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 08:30", "url": "https://www.sunstar.com.ph/network/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on", "message": "BEIRUT — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nIn the past two weeks, Hezbollah has escalated further in response to the Israeli incursion into the city of southern Rafah in the Gaza Strip, a Lebanese official familiar with the group’s operations said.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone."}, {"id": "8184ac4c-695d-40bc-a7fb-d4713fde541d", "title": "Hezbollah Introduces New Weapons and Tactics against Israel as war in Gaza Drags on", "date": "2024-05-17 06:30", "url": "https://www.newsmax.com/world/globaltalk/lebanon-israel-hezbollah-hamas-gaza-drone-missiles/2024/05/17/id/1165085/", "message": "BEIRUT (AP) — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nThe group has stepped up its attacks on Israel in recent weeks, particularly since the Israeli incursion into the southern city of Rafah in the Gaza Strip.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone."}, {"id": "7c5b1e1a-d8a7-40e0-948e-f903370970a2", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 08:30", "url": "https://www.news4jax.com/news/world/2024/05/17/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on/", "message": "FILE - The fence of an Israeli military position is seen damaged after Hezbollah targeted it by rockets, on an occupied hill of Kfar Chouba village, southeast Lebanon, Sunday, Oct. 8, 2023.\nLebanon's militant Hezbollah group is introducing new tactics and weapons against Israel as the war in Gaza drags on and Israeli troops enter parts of the southern city of Rafah.\n(AP Photo/Hussein Malla, File)BEIRUT – The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon."}, {"id": "5479a6c6-5248-47bc-b618-156b2ab1ab65", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 06:30", "url": "https://www.kob.com/news/us-and-world-news/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on/", "message": "BEIRUT (AP) — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nLebanon's militant Hezbollah group is introducing new tactics and weapons against Israel as the war in Gaza drags on and Israeli troops enter parts of the southern city of Rafah.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone."}, {"id": "143b51e7-af9b-4c15-8ae9-70eae6da847b", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 06:15", "url": "https://www.wsls.com/news/world/2024/05/17/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on/", "message": "FILE - The fence of an Israeli military position is seen damaged after Hezbollah targeted it by rockets, on an occupied hill of Kfar Chouba village, southeast Lebanon, Sunday, Oct. 8, 2023.\nLebanon's militant Hezbollah group is introducing new tactics and weapons against Israel as the war in Gaza drags on and Israeli troops enter parts of the southern city of Rafah.\n(AP Photo/Hussein Malla, File)BEIRUT – The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon."}, {"id": "e27c5089-ffab-4577-ae4b-a2db3d178978", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 06:30", "url": "https://toronto.citynews.ca/2024/05/17/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on/", "message": "BEIRUT (AP) — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles.\nThe attack wounded three soldiers, one of them seriously, according to the Israeli military.\nThe group has stepped up its attacks on Israel in recent weeks, particularly since the Israeli incursion into the southern city of Rafah in the Gaza Strip.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone."}, {"id": "38e8fe9a-381d-45d4-a797-f6890c2d6856", "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on", "date": "2024-05-17 06:15", "url": "https://kdhnews.com/news/world/hezbollah-introduces-new-weapons-and-tactics-against-israel-as-war-in-gaza-drags-on/article_8c4e0716-a8ad-50ea-8eb2-9d6aa7f9d068.html", "message": "The lakes are back up to normal levels, and are still rising.\nBell County is no longer exeperiencing drought conditions, according to one agency.\nWhile the recent rains are great, Texas summers can be brutal, and drought can return.\nThe overall drought pattern has eased, but it could return with a vengeance.\nTexas weather is so changable, especially in the springtime."}, {"id": "fe16fa4a-d990-4745-8f0f-1dab7a1273b8", "title": "Hezbollah launches new missile - firing UAV in Metulla attack", "date": "2024-05-17 08:30", "url": "https://www.jpost.com/breaking-news/article-801536", "message": "A senior official in the terrorist organization Hezbollah was killed in a retaliatory strike by the IAF, Arab media sources reported on Friday.\nAccording to Hezbollah, during the attack, the UAV (unmanned aerial vehicle) flew towards an IDF base near Metulla and targeted IDF soldiers.\nHezbollah published a video it said showed the attack, wherein a UAV launched two S5 missiles.\nHezbollah stated that the drone had been launched in a suicide attack and, after firing off the missiles, immediately exploded.\nA screenshot from a Hezbollah video allegedly showing a new missile-firing UAV target an Israeli position in northern Israel."}, {"id": "65f34d80-9a2e-4d68-91b3-fb3371d262c9", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Predator drone as footage shows wreckage", "date": "2024-05-17 09:45", "url": "https://www.clickondetroit.com/news/world/2024/05/17/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-predator-drone-as-footage-shows-wreckage/", "message": "DUBAI – Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nHe described the drone as “carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\n___This story has been corrected to give the name of the drone as Reaper, instead of Predator."}, {"id": "5eab8f45-94be-4c30-8ca8-b8e70d94e33c", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Predator drone as footage shows wreckage – Winnipeg Free Press", "date": "2024-05-17 08:45", "url": "https://www.winnipegfreepress.com/world/2024/05/17/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-predator-drone-as-footage-shows-wreckage", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nHe described the drone as “carrying out hostile actions” in Yemen’s Marib province, which remains held by allies of Yemen’s exiled, internationally recognized government.\n(AP Photo)The Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\n(AP Photo)Houthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\n___This story has been corrected to give the name of the drone as Reaper, instead of Predator."}, {"id": "3c504201-adae-43d0-a52e-c8fb71c5e2d0", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Predator drone as footage shows wreckage", "date": "2024-05-17 09:00", "url": "https://www.clickorlando.com/news/world/2024/05/17/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-predator-drone-as-footage-shows-wreckage/", "message": "DUBAI – Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nHe described the drone as “carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\n___This story has been corrected to give the name of the drone as Reaper, instead of Predator."}, {"id": "9683aba2-3189-44a9-b902-bfdaceab207e", "title": "IDF Finds Loaded Rocket Launchers in Rafah", "date": "2024-05-17 04:00", "url": "https://www.breitbart.com/middle-east/2024/05/16/idf-finds-loaded-rocket-launchers-in-rafah/", "message": "The Israel Defense Forces (IDF) has found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip, now in its second week.\nThese launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\nThe rocket launchers were destroyed by the IDF.\nIn another targeted raid, the soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched.\nThe fact that the IDF is discovering and destroying rocket launchers provides further justification for the ongoing Rafah operation, to which the Biden administration and much of the international community has objected."}, {"id": "c103a084-a848-4b1f-95f6-00b46a98e9a1", "title": "The Latest | Israel says it will send more troops to Rafah , as fighting also rages in Gaza north", "date": "2024-05-17 00:15", "url": "https://www.newsday.com/news/nation/israel-iran-hamas-latest-05-16-2024-x30540", "message": "Israel's defense minister said the military would send more troops into Rafah, a city along Gaza's southern border with Egypt, as fighting also rages in northern Gaza, where Hamas has regrouped.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nThe fighting began shortly after Israel launched its war against Hamas following the militant group’s attack on southern Israel.\nIn other violence, the Israeli military said Thursday a noncommissioned officer was moderately wounded in a stabbing attack in the West Bank.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "1cb61864-a3d2-4df0-bbcc-87d7e013fac8", "title": "Press Statement of DPRK Ambassador to Russian Federation", "date": "2024-05-17 12:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240516-kcna01.htm", "message": "Press Statement of DPRK Ambassador to Russian FederationKorean Central News Agency of DPRKPyongyang, May 16 (KCNA) -- DPRK Ambassador to the Russian Federation Sin Hong Chol Thursday released the following press statement titled \"Extreme unethical terrorism must be punished\":Recently, the Ukrainian forces' missile attack and shelling against Belgorod Region, the western border region of Russia, caused many civilian casualties, stunning the international community.\nThis is not the first time for the neo-Nazis of Ukraine, faithful to the U.S. and the West, to launch such terrorist attacks against innocent inhabitants.\nCan the Zelenskiy clique, a puppet of the U.S., turn the tide of war with the rotten stick- and tiger moth-like weapons given by the Western stakeholders?\nThe Zelenskiy clique is putting on airs, calling for defeating Russia, a country of compatriots, with the backing of the U.S. and the West, but it is nothing but a \"storm in a teacup.\"\nAnd nothing can ever stop the vigorous advance of the heroic Russian army and people armed with ardent spirit of national defence and patriotism."}, {"id": "4b4bcb55-4def-4df3-b615-28cd3e04f494", "title": "  Inevitable : NATO prepares to send troop trainers into Ukraine", "date": "2024-05-17 04:45", "url": "https://www.smh.com.au/world/europe/inevitable-nato-prepares-to-send-troop-trainers-into-ukraine-20240517-p5jei7.html", "message": "Brussels: NATO allies are inching closer to sending troops into Ukraine to train Ukrainian forces, a move that would be another blurring of a previous red line and could draw the United States and Europe more directly into the war.\nAs a result, Ukrainian officials have asked their US and NATO counterparts to help train 150,000 recruits closer to the front line for faster deployment.\nSo far, the US has said no, but General Charles Brown Jr, chair of the Joint Chiefs of Staff, said on Thursday that a NATO deployment of trainers appeared inevitable.\nBrown Jr. Credit: APFor now, he said, an effort inside Ukraine would put “a bunch of NATO trainers at risk” and would most likely mean deciding whether to use precious air defences to protect the trainers instead of critical Ukrainian infrastructure near the battlefield.\nBrown briefed reporters on his plane en route to a NATO meeting in Brussels."}, {"id": "175a2aac-2328-4171-b110-aacf66ff7952", "title": "Israel strikes on Lebanon kill three , says source close to Hezbollah", "date": "2024-05-17 11:30", "url": "https://www.al-monitor.com/originals/2024/05/israel-strikes-lebanon-kill-three-says-source-close-hezbollah", "message": "May 17, 2024 — Beirut (AFP)Israeli air strikes on Friday hit an area of southern Lebanon far from the border, with Hezbollah announcing one dead fighter and official media saying two Syrian children were killed.\nLebanon's state-run National News Agency said \"Israeli strikes targeted Najjariyeh and Addousiyeh\", two adjacent villages just south of the coastal city of Sidon, about 30 kilometres (19 miles) from the Israeli border.\nThe NNA said two Syrian children were killed in the Najjariyeh strike, identifying them as Osama and Hani al-Khaled.\nHezbollah said Thursday's attack was carried out with an \"attack drone carrying two S5 rockets\", which are normally launched from jets.\nIsrael says 14 soldiers and 10 civilians have been killed on its side of the border."}, {"id": "cffd5e6f-b063-4193-8c63-b67fac7cd9da", "title": "  Inevitable : NATO prepares to send troop trainers into Ukraine", "date": "2024-05-17 05:00", "url": "https://www.watoday.com.au/world/europe/inevitable-nato-prepares-to-send-troop-trainers-into-ukraine-20240517-p5jei7.html", "message": "Brussels: NATO allies are inching closer to sending troops into Ukraine to train Ukrainian forces, a move that would be another blurring of a previous red line and could draw the United States and Europe more directly into the war.\nAs a result, Ukrainian officials have asked their US and NATO counterparts to help train 150,000 recruits closer to the front line for faster deployment.\nSo far, the US has said no, but General Charles Brown Jr, chair of the Joint Chiefs of Staff, said on Thursday that a NATO deployment of trainers appeared inevitable.\nBrown Jr. Credit: APFor now, he said, an effort inside Ukraine would put “a bunch of NATO trainers at risk” and would most likely mean deciding whether to use precious air defences to protect the trainers instead of critical Ukrainian infrastructure near the battlefield.\nBrown briefed reporters on his plane en route to a NATO meeting in Brussels."}, {"id": "dc981a67-9148-4665-8ae1-0e34c109a383", "title": "  Inevitable : NATO prepares to send troop trainers into Ukraine", "date": "2024-05-17 04:45", "url": "https://www.brisbanetimes.com.au/world/europe/inevitable-nato-prepares-to-send-troop-trainers-into-ukraine-20240517-p5jei7.html", "message": "Brussels: NATO allies are inching closer to sending troops into Ukraine to train Ukrainian forces, a move that would be another blurring of a previous red line and could draw the United States and Europe more directly into the war.\nAs a result, Ukrainian officials have asked their US and NATO counterparts to help train 150,000 recruits closer to the front line for faster deployment.\nSo far, the US has said no, but General Charles Brown Jr, chair of the Joint Chiefs of Staff, said on Thursday that a NATO deployment of trainers appeared inevitable.\nBrown Jr. Credit: APFor now, he said, an effort inside Ukraine would put “a bunch of NATO trainers at risk” and would most likely mean deciding whether to use precious air defences to protect the trainers instead of critical Ukrainian infrastructure near the battlefield.\nBrown briefed reporters on his plane en route to a NATO meeting in Brussels."}, {"id": "33ff9779-902f-410c-8b46-a365a31eaccf", "title": "Kuwaiti held over planning attacks in Saudi Arabia", "date": "2024-05-17 10:30", "url": "https://gulfnews.com/world/gulf/kuwait/kuwaiti-held-over-planning-attacks-in-saudi-arabia-1.1715940578812", "message": "Cairo: Kuwaiti prosecutors have ordered the remand of a citizen charged with joining an outlawed group and planning terror attacks in Saudi Arabia, Kuwaiti media reported.\nThe man is also accused of promoting the ideology of the banned group on social media and pursuing activities harmful to the country’s national interests, the Kuwaiti newspaper Al Qabas said.\nMoreover, he had met with the group’s followers and planned terrorist acts in Saudi Arabia targeting the military forces and Shiites, it added.\nHe is kept in custody pending further interrogations, the report said without naming the group to which he is linked.\nThe bombing claimed by Daesh, was carried out by a suicide attacker during the congregation Friday prayers in Al Sadeq Mosque."}, {"id": "f517ff05-c405-4302-8030-e02976bd3236", "title": "Israel responds to Hezbollah attack , threatens to open new war front", "date": "2024-05-17 08:00", "url": "https://www.albawaba.com/news/israel-responds-hezbollah-attack-threatens-open-new-war-front-1567160", "message": "The airstrikes, which occurred in Sidon, southern Lebanon, represent a significant escalation in tensions between Israel and Hezbollah.\nThe drone was intercepted over the Mediterranean Sea by the Israeli military and it was said to have come from southern Lebanon.\nHezbollah fighters announced an air attack using drones targeted industrial facilities belonging to the Israeli Ministry of War.\nINTENSIVE ISRAELI AIRSTRIKES TARGETED HEZBOLLAH SITES IN SIDON, SOUTHERN LEBANON!\nJoin ISRAEL REALTIME — \"Connecting the World to Israel in Realtime\"🇮🇱 WhatsApp 👇… pic.twitter.com/o5UCJwzVep — Israel Realtime (@IsraelRealtime) May 17, 2024According to the Hezbollah Resistance, they successfully targeted spy equipment carried on a crane in Tallet Al-Tayhat with precise weapons, resulting in its destruction."}, {"id": "e7215acc-0e7a-43e8-9b43-a32cdb6bf993", "title": "Buried facts about the Gaza war", "date": "2024-05-17 08:30", "url": "https://www.israelnationalnews.com/news/390119", "message": "IDF in Gaza April 1 2024 IDF SpokespersonThe Biden administration has gone to great lengths to appease the genocidal and terrorist Iranian regime.\nIn response, the Biden administration dismissed these claims as “smears and slander.”Even more astonishingly, Tabatabai runs the office overseeing hostage negotiations.\nFrom the start of the war in the Gaza Strip, Israel has been accused of disproportionately killing Palestinian civilians.\n-The Biden administration is funding the P.A.\n-The Biden administration is trying to force Israel to accept a P.A.-run administration in Gaza after the war."}, {"id": "7f509b73-4986-4c06-9e3f-154fa8fde321", "title": "Operation Gladio : Is the NATO - CIA covert cocktail linked to Robert Fico assassination attempt and Turkish coup fears ? ", "date": "2024-05-17 11:30", "url": "https://www.firstpost.com/world/operation-gladio-is-the-nato-cia-covert-cocktail-linked-to-robert-ficos-assassination-attempt-and-turkish-coup-fears-13771935.html", "message": "As scrutiny intensifies following the assassination attempt on Robert Fico and renewed Turkish coup fears, questions arise about potential links to Operation Gladio read more(File) Slovakia's Prime Minister Robert Fico speaks during a press conference after the cabinet's away-from-home session in the town of Handlova, Slovakia, on 15 May, 2024.\nAPBoth US journalist Nebojsa Malic and Habertürk reporter Ozcan Tikit have referenced Operation Gladio in connection with the assassination attempt on Slovak Prime Minister Robert Fico on 15 May.\nOrigins and purpose of Operation GladioAdvertisementOperation Gladio was a clandestine operation involving a network of “stay-behind” armies established in Europe during the Cold War.\nManipulating European political affairsThe Sputnik report said that the CIA and NATO manipulated European political affairs through Gladio.\nOne declassified Gladio operation, “Piano Solo” (1964), envisaged kidnapping Italian prime minister Aldo Moro to prevent the formation of a left-leaning coalition."}, {"id": "f7316805-54e9-498d-ab44-e480cf93ce12", "title": "Army experiments with command structure for Guam missile - defense system", "date": "2024-05-17 06:45", "url": "https://www.stripes.com/theaters/asia_pacific/2024-05-16/army-guam-missile-defense-system-13882301.html", "message": "(Wyatt Olson/Stars and Stripes)HONOLULU — The Army remains on track to deliver a “composite” missile-defense battalion that will become part of an integrated defense system for Guam, the commander of 94th Army Air and Missile Defense Command said Wednesday.\nThe Army’s Guam defense system will also employ the not-yet-fielded Indirect Fire Protection Capability, or IFPC — a mobile, ground-based system used to defeat cruise missiles, drones, rockets and mortars.\nThe Army’s defense system will be just one part of the Pentagon’s integrated system planned for Guam.\nThe Army’s Rapid Capabilities and Critical Technologies Office is overseeing the effort to integrate this overall Guam missile defense system.\nEstablishing the Guam defense system will be “the first foray for the [Army] into organizing and operating as a composite organization,” Costello said."}, {"id": "6c3f2e4b-0bc7-43f2-89da-26c9f7cc9725", "title": "Alan Lundy gets bail in chief inspector Caldwell shooting case", "date": "2024-05-17 13:00", "url": "https://www.irishnews.com/news/northern-ireland/alan-lundy-gets-bail-in-chief-inspector-caldwell-shooting-case-PVWMSZTS3RHP5GN6A5AU7COK7E/", "message": "Prosecutors claim the vehicles were purchased, stored and then supplied to others involved in the gun attack on DCI John Caldwell on the directions of 45-year-old Alan Lundy.\nLundy, of Flax Street in the Ardoyne district, is one of eight men charged with the attempted murder in February last year.\nMr Justice O’Hara granted his application for bail on strict conditions, including a prohibition on attending any protests or meetings related to dissident republican activity.\n“Alan Lundy was integral to the acquisition, storage, transport and disposal of vehicles used in the attack on DCI Caldwell,” a prosecution barrister submitted.\nGranting bail, Mr Justice O’Hara ordered the defendant to live at an alternative address outside Belfast."}, {"id": "a7f0f458-87be-4b6f-a934-cc480ca3e760", "title": "Moroccan asylum seeker is jailed for life with a minimum term of 44 years after  terror attack  where he murdered a pensioner , 70 , at random and attempted to kill his Christian convert housemate in  revenge  for Israel - Hamas", "date": "2024-05-17 11:45", "url": "https://www.dailymail.co.uk/news/article-13429913/Moroccan-asylum-seeker-jailed-life-minimum-term-44-years-terror-attack-murdered-pensioner-70-random-attempted-kill-Christian-convert-housemate-revenge-Israel-Hamas.html", "message": "Self-radicalised Alid told police his attack was 'for the people of Gaza' and he had wanted to kill more victims.\nIt is the first example of a terrorist attack in Britain inspired by the Hamas atrocities on Israel.\nDoorbell camera footage showed Mr Carney, who was out walking in the town centre, cry out 'No, no' as he was stabbed by the stranger.\nIt is the first example of a terrorist attack in Britain inspired by the Hamas atrocities on Israel.\nMy intention was to kill more people, not only him,' he added, referring to Mr Carney."}, {"id": "7f5f37ba-e4c7-4f3e-b727-4727aab5697f", "title": "US Nazi hunter condemns Hamas , supports Israel - The Jerusalem Post", "date": "2024-05-17 05:00", "url": "https://www.jpost.com/israel-hamas-war/article-801461", "message": "“The treaty obligates all signatory nations not just not to commit genocide and punish it, but to prevent it,” said Rosenbaum.\n(credit: MARC ISRAEL SELLEM/THE JERUSALEM POST)Israel is not alone in its legal obligation to ensure that Hamas’s genocidal aspirations do not reach fruition.\n“If it were, then the allies would have committed genocide in the Battle of Manila with over 100,000 civilian deaths in World War II.\nIt was also a genocidal war, particularly against Jews and Roma, and they killed millions of people.\n“Israel is taking measures to protect civilian life in Gaza that no military has ever taken in any war,” said Rosenbaum."}, {"id": "4b1bf58c-3d33-49be-90d8-e71c12e93a90", "title": "US chairman of the Joint Chiefs of Staff says NATO will deploy troops to Ukraine", "date": "2024-05-17 05:30", "url": "https://www.wsws.org/en/articles/2024/05/17/smzs-m17.html", "message": "In a major escalation of the US-NATO war with Russia in Ukraine, US Chairman of the Joint Chiefs of Staff Charles Q.\nBrown told the New York Times Thursday that the NATO military alliance will “eventually” send significant numbers of active-duty NATO troops to Ukraine, which the newspaper said meant the deployment was “inevitable.”Chairman of the Joint Chiefs of Staff Gen. Charles Q.\nBrown Jr. [AP Photo/Kevin Wolf]In asserting that NATO sending troops is “inevitable,” the Times means the decision has already been made, and all that is being awaited is the determination on how best to announce the escalation to the public.\nHe should also explain clearly why the admission of Ukraine into NATO justifies risking such an outcome.\nIn fact, if there is anything the NATO war effort lacks, it is time."}, {"id": "a0136ea0-7556-4825-8990-239c6d7f978a", "title": "Kremlin says it will  retaliate for any nuclear threat and warns tensions could spill into WW3 - after warning that allowing Ukraine to strike Russian territory with US weapons could spark a  tragedy for humanity  ", "date": "2024-05-17 08:30", "url": "https://www.dailymail.co.uk/news/article-13429075/Kremlin-says-retaliate-nuclear-threats-warns-tensions-spill-WW3-warning-allowing-Ukraine-strike-Russian-territory-weapons-spark-tragedy-humanity.html", "message": "(The US) have long been in a state of proxy war with the Russian Federation.\nHe said that Ukrainian lawmakers were trying to convince the United States to allow Kyiv to use US-supplied weapons to strike Russian territory.\nUkraine says it has the right to attack Russian targets as it is being struck by Russian missiles on a daily basis.\n'David - you might want to be careful,' he said, before declining to specify exactly what would happen should British missiles strike Russian territory.\nHe is now Putin's deputy on the Russian Security Council, which now has ex-defence minister Sergei Shoigu as its secretary."}, {"id": "ebe26d0c-efb5-4a09-a34f-6ad7b44ae312", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-17 04:30", "url": "https://abcnews.go.com/Politics/wireStory/high-profile-political-assassinations-attempts-century-110313487", "message": "Slovakia’s Prime Minister Robert Fico was seriously wounded in an apparent assassination attempt just weeks before a Europe-wide election that has been deeply divisiveSlovakia’s Prime Minister Robert Fico was seriously wounded in an apparent assassination attempt just weeks before a Europe-wide election that has been deeply divisive.\nHere’s a global look at other notable assassinations and assassination attempts during the 21st century:— Sept. 1, 2022: Argentina's then-Vice President Cristina Fernández is targeted by a man who reportedly aimed a handgun at point-blank range toward the politician in what government ministers characterize as an assassination attempt.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "9ddda674-aa79-4bef-997c-50c8c6aebc19", "title": " 【 smarkets website soccer advice 1x2 】- top bet twitter ov25 fixed matches", "date": "2024-05-17 04:45", "url": "http://www.elwakt.com/Mujf", "message": "Will Cain: Whoever is responsible for Poland missile strike will get even richercloseVideoFox News host Will Cain reacts to the missile strike in Poland on 'Tucker Carlson Tonight.'\nIn other words, whoever was responsible for that missile strike in Poland, well, they're about to get even richer: Defense contractors.\nCLICK HERE TO GET THE FOX NEWS APPLook, we don't know what happened yet in Poland.\nWe don't know where those missiles came from.\nWe don't know what was the intended target."}, {"id": "3bbe2594-14ca-4d05-95ea-61a5c4ed237b", "title": "The ADVANCE Democracy Act : A Dose of Realism Needed", "date": "2024-05-17 02:00", "url": "https://www.heritage.org/defense/report/the-advance-democracy-act-dose-realism-needed", "message": "The promotion of democracy remains an important goal of U.S. foreign policy.\nEqually important, the U.S. should promote democracy without limiting the executive branch's ability to conduct foreign policy.\nThe ADVANCE Democracy Act serves the American public by emphasizing the role of democracy in U.S. foreign policy in general and at the State Department in particular.\nThe bill sets out to spread \"universal democracy\" worldwide, but its expansive legislative language sacrifices foreign policy flexibility and agility.\nIn particular, the ADVANCE Democracy Act dilutes the executive branch's constitutional role in conducting foreign policy by over-prescribing analytical frameworks and tools."}, {"id": "ee221b49-d9f0-41b6-a228-fb3f1570ff03", "title": "Reuters World News Summary", "date": "2024-05-17 02:15", "url": "https://www.devdiscourse.com/article/law-order/2941417-reuters-world-news-summary", "message": "Following is a summary of current world news briefs.\nThe Israel Security Assistance Support Act was approved 224 to 187, largely along party lines.\nSixteen Democrats joined most Republicans in voting yes, and three Republicans joined most Democrats in opposing the measure.\nPolitical analysts and lawmakers say it has exposed an increasingly febrile and polarised political climate both in Slovakia and across Europe.\nGeneral Christopher Cavoli, NATO's supreme allied commander Europe, said he was confident Ukrainian forces would hold their lines in the region."}, {"id": "a5daf3c1-fb45-4275-b620-6640fd2c53a7", "title": "Israeli Chief Rabbis Tell Celebrants to Not Visit Mount Meron on Lag BOmer Holiday | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 9 Iyyar 5784 – Friday , May 17 , 2024", "date": "2024-05-17 07:15", "url": "https://www.jewishpress.com/news/middle-east/hezbollah/israeli-chief-rabbis-tell-celebrants-to-not-visit-mount-meron-on-lag-bomer-holiday/2024/05/17/", "message": "Photo Credit: Telegram screenshotIsrael’s two chief rabbis instructed celebrants not to travel to a holy site on Mount Meron during the upcoming holiday of Lag B’Omer because of the war.\nThe Israeli military’s Home Front Command canceled this year’s traditional celebrations on Mount Meron following a security assessment.\nThe anniversary of Rabbi Shimon’s death, Lag B’Omer, is celebrated with bonfires and draws hundreds of thousands of visitors to his grave.\nThis year, Lag B’Omer begins at sundown on May 25.\nForty-five people were killed and 150 people were injured in a stampede at the grave during Lag B’Omer celebrations in 2021."}, {"id": "960bfc61-e64a-45b5-ac2a-e1ea7c074f02", "title": "Fatah terrorists attack Israeli forces in Gaza , Samaria - The 5 Towns Jewish Times", "date": "2024-05-17 12:45", "url": "https://www.5tjt.com/fatah-terrorists-attack-israeli-forces-in-gaza-samaria/", "message": "(May 17, 2024 / JNS)Palestinian Authority chief Mahmoud Abbas’s governing Fatah Party on Thursday published footage of its “military” wing carrying out terrorist attacks on Israel Defense Forces troops in Samaria and the Gaza Strip.\nOne of the videos shows Fatah operatives joining with Hamas terrorists in carrying out shooting attacks on IDF soldiers in Tulkarem, western Samaria.\nIn the second clip, Fatah terrorists in Gaza can be seen firing rockets towards Israeli military bases and civilian population centers.\nshould govern Gaza—a move Israeli Prime Minister Benjamin Netanyahu has rejected because of Ramallah’s overt involvement in terrorism.\nRamallah is “prepared to hold general elections, and if Hamas wins, the president will hand over the Authority,” spokesman Nabil Abu Rudeineh said."}, {"id": "0718928d-ce87-4cfa-b485-7a5f5ef86e42", "title": "Slovak prime minister Robert Fico shot in assassination attempt", "date": "2024-05-17 02:15", "url": "https://www.wsws.org/en/articles/2024/05/16/zpjr-m16.html", "message": "Yesterday afternoon, populist Slovak Prime Minister Robert Fico was shot while visiting the town of Handlova after a meeting of his government.\nDeputy Prime Minister and Defence Minister of Slovakia Robert Kalinak, speaks during a media briefing outside the F. D. Roosevelt University Hospital, where Slovak Prime Minister Robert Fico, who was shot and injured, is treated in Banska Bystrica, central Slovakia, Thursday, May 16, 2024.\nHe had an erratic but essentially far-right political trajectory, having criticized violence before recently sympathizing with the liberal, pro-NATO opposition party Progressive Slovakia (PS).\nSlovakia is “on the edge of civil war,” Slovak Interior Minister Matus Sutaj-Estok said last night, at a joint press conference on the shooting with Defense Minister Robert Kalinak.\nPelligrini won the presidential elections as a Fico ally, pledging not to let Slovakia be dragged into the Ukraine war."}, {"id": "23741f8b-ae15-4145-8fb8-4af7078f88a9", "title": "Russia Arrests in Absentia Feminist Activist Marshenkulova for  Justifying Terrorism  ", "date": "2024-05-17 11:00", "url": "https://www.themoscowtimes.com/2024/05/17/russia-arrests-in-absentia-feminist-activist-marshenkulova-for-justifying-terrorism-a85148", "message": "A Moscow court on Friday ordered the arrest in absentia of exiled feminist activist Zalina Marshenkulova for “justifying” the killing of a pro-war blogger.\nRussian investigators last month charged Marshenkulova with “justifying terrorism,” a crime punishable by up to seven years in prison, over an April 2023 Telegram post about the death of pro-war blogger Vladlen Tatarsky, who was killed in a St. Petersburg bomb attack.\nIn that post, she wrote that expressing condolences over Tatarsky’s death was “hypocritical.”Moscow’s Perovsky District Court ruled Friday to place Marshenkulova in pre-trial detention for two months once she is detained or extradited to Russia.\nState media previously reported that law enforcement authorities believe the activist currently resides in Germany.\nMarshenkulova responded to the news of her arrest in absentia on Friday by referencing a provocative 2019 Reebok ad that featured her and the quote: “Don’t sit around waiting for a man’s approval — sit on a man’s face.”“No thanks, I’ll sit on a face for now,” she wrote in response to a pro-war blogger’s crude prison-related joke."}, {"id": "c1ccf0cc-5056-453e-bd47-cbafa97c445c", "title": "Slovakia PM  is between life and death : Hungarian PM reveals health update as doctors prepare to assess Robert Fico two days after assassination attempt", "date": "2024-05-17 08:30", "url": "https://www.dailymail.co.uk/news/article-13429225/slovakia-prime-minister-robert-fico-health-update-hungarian-pm.html", "message": "Slovakia's Prime Minister Robert Fico is between life and death two days after an assassination attempt that sent shock waves across Europe, Hungarian Prime Minister Viktor Orban told public radio on Friday.\nRobert Fico is between life and death.'\nSlovakia's Prime Minister Robert Fico is between life and death two days after an assassination attempt that sent shock waves across Europe, Hungarian Prime Minister Viktor Orban told public radio on Friday.\nHungarian Prime Minister Viktor Orban (pictured speaking earlier this week) told public radio on Friday that Fico is 'between life and death'.\nAt the same news conference, Deputy Prime Minister Robert Kalinak also blamed the media for tensions in the country."}, {"id": "ba097d85-9282-4753-9651-4130fd0022ae", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 08:30", "url": "https://www.lbc.co.uk/world-news/6a62c5df0a76476eb1e19fab237c8a5d/", "message": "A massive Ukrainian drone attack on Crimea early on Friday caused power cutoffs in the city of Sevastopol and set a refinery ablaze in southern Russia, Russian authorities said.\nThe Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "7a5a85ab-4377-482c-b2f9-d7f9a5e76934", "title": "Zelenskyy : Ukrainian Armed Forces stabilised situation on battlefield in Kharkiv Oblast", "date": "2024-05-17 09:45", "url": "https://www.yahoo.com/news/zelenskyy-ukrainian-armed-forces-stabilised-070114357.html", "message": "The Defence Forces of Ukraine have managed to stabilise the situation on the battlefield as Russian troops are trying to advance in the northern part of Kharkiv Oblast.\nSource: Zelenskyy at a meeting with journalists; Ukrainska PravdaQuote: \"The main thing for today is that our defence forces have stabilised the situation.\nToday, our defence forces have stabilised the Russians where they are now.\nThe president said that \"highly combat-capable brigades\" are currently operating in Kharkiv Oblast, and separate battalions have been reinforced on several fronts.\nUkrainian soldiers repelled eight attacks in Lyptsi, Starytsia and Vovchansk (Kharkiv Oblast)."}, {"id": "01e7f259-cbcb-451b-b9e0-6ea82e716dd9", "title": "Buried facts about the Gaza war", "date": "2024-05-17 11:00", "url": "https://www.jwire.com.au/buried-facts-about-the-gaza-war/", "message": "Browse > Home Featured Articles / Buried facts about the Gaza war – J-WireBuried facts about the Gaza warRead on for articleThe extent to which the political class and the media are burying facts that undermine their poisonous narrative in order to defame and undermine Israel’s war of survival has become simply jaw-dropping.\nThe Biden administration has gone to great lengths to appease the genocidal and terrorist Iranian regime.\nIn response, the Biden administration dismissed these claims as “smears and slander.”Even more astonishingly, Tabatabai runs the office overseeing hostage negotiations.\nFrom the start of the war in the Gaza Strip, Israel has been accused of disproportionately killing Palestinian civilians.\nThe Biden administration is trying to force Israel to accept a P.A.-run administration in Gaza after the war."}, {"id": "55d19f53-c455-4a6c-9167-d135a13db79f", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 10:15", "url": "https://www.edp24.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "abd2914a-b55f-4bd5-aaac-9bc5cf798966", "title": "Israel Pursues  Critical  Rafah Battle , Defends against Legal Attack as Gaza Aid Pier Nears Completion", "date": "2024-05-17 10:00", "url": "https://www2.cbn.com/news/israel/israel-pursues-critical-rafah-battle-defends-against-legal-attack-gaza-aid-pier-nears", "message": "JERUSALEM, Israel – From the battleground in Gaza to the legal battles at The Hague, Israel is fighting on multiple fronts.\n\"The battle in Rafah is critical,\" Netanyahu stated.\nThis battle, of which you are an integral part, is a battle that decides many things in this campaign.\nIsrael's Defense Minister Yoav Gallant says more Israel Defense Forces troops will soon join the fighting in Rafah.\nThe first aid shipments from the newly-built U.S floating pier to bring humanitarian supplies from offshore into Gaza have arrived."}, {"id": "dbe87569-2f78-4de6-bc86-2a16ba44c058", "title": "Treasury Department Ramp Up Fight Against Illicit Finance", "date": "2024-05-17 03:45", "url": "https://www.pymnts.com/aml/2024/treasury-department-to-use-automation-and-innovation-to-fight-illicit-finance/", "message": "The Department of the Treasury has outlined the priorities it will pursue this year to step up the fight against illicit finance.\nA second priority is promoting a more effective and risk-focused AML/CFT regulatory and supervisory framework for financial institutions, the release said.\nThe Department will work to do so by providing clear compliance guidance, sharing information and providing resources for supervision and enforcement.\nThe Department also aims to enhance the operational effectiveness of law enforcement, other U.S. government agencies and international partnerships to combat illicit finance, per the release.\nThe fourth priority announced in the press release is realizing “the benefits of responsible technological innovation” by developing new payments technology, supporting the use of new mechanisms for compliance, and using automation and innovation to find new ways to fight illicit finance, the release said."}, {"id": "ed8ba0da-2e94-4cce-8ffb-a1127a3f5522", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 09:30", "url": "https://www.yorkpress.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "61fb59f7-d761-478f-9d8e-d5c951b93a2c", "title": "Hartlepool : Man who prowled streets before stabbing  defenceles grandfather  for people of Gaza  jailed", "date": "2024-05-17 11:45", "url": "https://www.originalfm.com/news/headlines/hartlepool-man-who-prowled-streets-before-stabbing-defenceless-grandfather-for-people-of-gaza-jailed/", "message": "Sentencing him, the judge said: \"You attacked and murdered Terence Carney in a terrorist act.\nAlid attacked two female officersAt the end of the interview, Alid attacked two female interviewing officers, grabbing one of them and wrestling her to the ground while yelling \"Palestine\" and \"Allahu Akbar [god is great]\", causing his solicitor to dial 999.\nCCTV footage showed Alid stabbing Mr Carney multiple times while his victim was \"effectively defenceless\" and crying out \"no, no,\" the court was told.\nThe judge said Alid showed Mr Carney \"no mercy\".\n(c) Sky News 2024: Hartlepool: Man who prowled streets before stabbing 'defenceless' grandfather 'for people"}, {"id": "c0a84628-df34-447c-8960-3f25e40c0c30", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 09:00", "url": "https://www.theargus.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "a002b98c-9c73-444d-8967-2527328e88f1", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 08:30", "url": "https://www.echo-news.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "ffd808b2-0781-4d47-8cd5-9a66a7e9c49a", "title": "The CIA and the strategy of tension in Europe", "date": "2024-05-17 03:30", "url": "https://www.pressenza.com/2024/05/the-cia-and-the-strategy-of-tension-in-europe/", "message": "This network was remotely controlled by the CIA and despite the disappearance of the danger of Soviet invasion, continued to act in Western countries to prevent communist parties from coming to power through democratic elections and were dedicated to sowing chaos through the doctrine known as “strategy of tension”.\nOperation Gladio affected virtually all of Europe, with particular virulence in Italy where it was investigated by Judge Guido Salvini, who concluded that far-right terrorist organizations such as Ordine Nuovo or the National Vanguard “were closely linked with the Italian state and the US CIA” and that” the CIA pointed out the objectives and encouraged them to act”.\nIs Operation Gladio 2.0 underway?\nTrump’s possible victory in November 2024 would represent the decline of the Atlantist strategy of Biden and Soros committed to defend Putin from power after the signing of a peace agreement in Ukraine and the return to the Doctrine of Peaceful Coexistence with Russia.\nAre new attacks being prepared?"}, {"id": "04660cdf-f6f4-4fbe-8f1f-c79f1a1aedc6", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 08:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "40dc1031-8d49-48a0-9907-c899e83f4bd8", "title": "Highlands County man kills suspected home intruder accused of shooting his wife", "date": "2024-05-17 13:00", "url": "https://www.fox13news.com/news/highlands-county-man-kills-suspected-home-intruder-accused-of-shooting-his-wife", "message": "Press play above to watch FOX 13 NewsA Highlands County man is being praised by the sheriff’s office for stabbing an accused home intruder to death with a garden knife after deputies say the suspect shot the man’s wife.\nAccording to the Highlands County Sheriff’s Office, deputies went to a home on Joe Hilton Street in Avon Park around 8:30 p.m. on Thursday to investigate a suspicious incident.\nAccording to Sheriff Paul Blackman, Glenn tricked the victims to get inside the home.\nDeputies say Lindsey Glenn was killed by a Highlands County man after shooting the man's wife during a home invasion Thursday night.\nImage is courtesy of the Highlands County Sheriff's Office."}, {"id": "f1f2d68d-fd0d-498c-9f0e-43381222d696", "title": "Malaysia probes possible JI terror group link to Johor attack that killed 2 police officers", "date": "2024-05-17 06:30", "url": "https://www.scmp.com/week-asia/politics/article/3263025/malaysia-probes-possible-ji-terror-groups-link-johor-attack-killed-2-police-officers", "message": "Two Malaysian police officers were killed in a predawn attack on a police station on the outskirts of Johor Bahru, police said on Friday, adding they were probing a possible link to the Jemaah Islamiah (JI) terror group behind the deadly incident.\nBuildings and cars burning down after a bomb blast in Kuta, Bali in 2002, which was allegedly orchestrated by two Malaysian leaders of JI.\nPhoto: EPAThe deadly Bali bombing in 2002, which killed over 200 people, was allegedly orchestrated by two Malaysian leaders of JI.\n“There is a likelihood the suspect was inspired to copy the modus operandi usually seen in police station attacks in Indonesia,” Munira told This Week in Asia.\nFormed in post-World War II Indonesia, JI has expanded over the decades to include cells in Malaysia, the Philippines and Singapore."}, {"id": "66a1181c-8225-4767-b0bc-8305fee57b79", "title": "Israeli hostage to UN : We cant normalise this unprecedented terror", "date": "2024-05-17 05:00", "url": "https://www.asiaone.com/world/israeli-hostage-un-we-cant-normalise-unprecedented-terror", "message": "UNITED NATIONS — Shoshan Haran, her daughter and two grandchildren were taken hostage by Hamas militants in Israel on Oct 7.\nShe wet the bed and had nightmares, too afraid she may be captured again,\" Haran told an informal UN Security Council meeting on Thursday, convened by the United States.\nHamas fighters attacked Israel on Oct 7, killing 1,200 people and seizing 253 hostages, according to Israeli tallies.\nThe US focused the meeting on \"condemning hostage-taking in Israel on Oct 7 as a psychological tool of terrorism.\"\nSo today, let us again demand Hamas release all remaining hostages,\" said US Ambassador Linda Thomas-Greenfield."}, {"id": "ca8dcb65-b9b9-4e2b-a25b-937715725547", "title": "Media : Ukrainian drones hit military facilities in Russia , Crimea overnight", "date": "2024-05-17 13:45", "url": "https://www.yahoo.com/news/media-ukrainian-drones-hit-military-122150317.html", "message": "Ukrainian drones attacked several military facilities in Russia and occupied Crimea overnight on May 17, a source from the Security Service of Ukraine (SBU) confirmed to the Kyiv Independent.\nThe source said that it was a joint operation carried out by the SBU and Ukraine's military intelligence agency.\nThe Russian Defense Ministry claimed earlier during the day that 102 aerial and six naval drones had been intercepted and destroyed and did not report any damage or casualties.\nThe next day, drones hit production facilities of the state-owned Russian weapons manufacturing company \"Basalt\" in the city of Tula, a military intelligence source told the Kyiv Independent.\nRead also: Opinion: Ukraine’s naval drones are taking over the Black SeaWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "805f8f2c-62ec-4166-b3a8-d80ad71461e8", "title": "French police shoot dead armed man suspected of planning synagogue attack", "date": "2024-05-17 13:15", "url": "https://www.edp24.co.uk/news/national/24326255.french-police-shoot-dead-armed-man-suspected-planning-synagogue-attack/", "message": "The French interior minister said the man was an Algerian national sought medical treatment in France and was not flagged as a suspected extremist.\n“In Rouen, national police officers neutralised early this morning an armed individual clearly wanting to set fire to the city’s synagogue.\n“When the Jewish community is attacked, it’s an attack on the national community, an attack on France, an attack on all French citizens,” he said.\nIn Paris, Yonathan Arfi, head of the main French Jewish umbrella group, expressed fury at what he described as the “climate of terror” facing Jews in France.\n“There’s a climate of fear because it feels like, anywhere in our country and at any time, an antisemitic attack can take place."}, {"id": "38a62589-a8bd-46e4-b3ca-4931fde04b6d", "title": "Major martyred in Zhob operation laid to rest", "date": "2024-05-17 06:30", "url": "https://tribune.com.pk/story/2466798/major-martyred-in-zhob-operation-laid-to-rest-1", "message": "The funeral prayer of Major Babar Niazi, army officer martyred in the Zhob operation, was offered at Zhob Cantt, stated the Inter-Services Public Relations (ISPR) on Wednesday.\n“The sacrifices of our brave sons strengthen our resolve to fight against the menace of terrorism.\nThe war against terrorism will be fought till the scourge is uprooted from the motherland,” the ISPR maintained.\nMajor Babar Niazi laid down his life while leading an intelligence-based operation in the Sambaza area of Balochistan’s Zhob district that eliminated three terrorists, the army’s media wing confirmed on Tuesday.\nAccording to a statement issued by the ISPR, the security forces conducted the operation in the general area of Sambaza, Zhob District."}, {"id": "a6c62180-b44e-4837-945f-481abd745c83", "title": "Rosa María Payá Condemns Biden Administration for Removing Cuba from Terrorism List :  Whitewashing the Regime  ", "date": "2024-05-17 03:15", "url": "https://www.cubaheadlines.com/articles/282077", "message": "Rosa María Payá, a prominent Cuban democracy activist, has sharply criticized the Joe Biden administration for its decision to remove Cuba from the list of countries that do not fully cooperate with U.S. counterterrorism efforts.\nThis action has been interpreted as the first step by Washington to potentially remove the Caribbean nation from the list of State Sponsors of Terrorism.\nHowever, the State Department clarified that the designation on the State Sponsors of Terrorism list, which includes Iran, Syria, North Korea, and Cuba, is managed independently.\nThe Cuban Ministry of Foreign Affairs recently requested that the U.S. government definitively exclude the country from the State Sponsors of Terrorism list, calling its inclusion arbitrary and unfounded.\nThe Cuban regime's statement was published on Wednesday following the Biden administration’s decision to remove Cuba from the list of countries not fully cooperating with counterterrorism efforts."}, {"id": "8c48567a-05a9-4e22-9727-7ecee76395ff", "title": "French police shoot dead armed man suspected of planning synagogue attack", "date": "2024-05-17 14:30", "url": "https://www.thenorthernecho.co.uk/news/national/24326255.french-police-shoot-dead-armed-man-suspected-planning-synagogue-attack/", "message": "The French interior minister said the man was an Algerian national sought medical treatment in France and was not flagged as a suspected extremist.\n“In Rouen, national police officers neutralised early this morning an armed individual clearly wanting to set fire to the city’s synagogue.\n“When the Jewish community is attacked, it’s an attack on the national community, an attack on France, an attack on all French citizens,” he said.\nIn Paris, Yonathan Arfi, head of the main French Jewish umbrella group, expressed fury at what he described as the “climate of terror” facing Jews in France.\n“There’s a climate of fear because it feels like, anywhere in our country and at any time, an antisemitic attack can take place."}, {"id": "9a4ca1e8-43aa-4996-a1f4-69840af944cc", "title": "Zimbabwe : Interpol Intensifies Money Laundering Fight", "date": "2024-05-17 12:45", "url": "https://allafrica.com/stories/202405170267.html", "message": "Action across all sectors and at the global level is needed now, and INTERPOL stands ready to provide whatever support necessary.\"\n\"It can only be achieved through the robust and effective implementation of money laundering and terrorist financing standards.\nUNODC executive director Ghada Waly said, \"Money laundering, terrorism financing, and their predicate offences are fuelling instability, violence, and exploitation worldwide.\nThey also recognised the positive impact of member countries increasingly working with the private sector and civil society to implement joint approaches to fighting financial crime.\nUNODC, FATF and INTERPOL will continue this call to action -- urging member states to improve their AML/CFT frameworks -- through the 2026 Crime Congress."}, {"id": "4000f4cb-8606-4e44-a597-67e06823ae3e", "title": "Old Syria explosion photo falsely portrayed as  Israel in May 2024  ", "date": "2024-05-17 05:30", "url": "https://www.yahoo.com/news/old-syria-explosion-photo-falsely-050532664.html", "message": "After reports emerged that an Iran-backed group said they launched a drone strike in southern Israel in May 2024, an old picture of a huge explosion resurfaced in a false context in Thai social media posts about the reported attack.\nThe picture was actually taken by an AFP photographer in March 2019 and shows an explosion in a province in eastern Syria.\n\"This airbase is located near Eilat in the southern part of Israel,\" it added citing \"Tasnim News\" its source.\nSyria explosionA reverse image search on Google, however, found the picture was taken by AFP photographer Delil Souleiman in eastern Syria on March 11, 2019.\n\"US-backed Syrian Democratic Forces pounded the last scrap of land held by the Islamic State group in eastern Syria after hundreds more people surrendered."}, {"id": "e19c6185-5eca-4287-831f-02302b23749b", "title": "Israel attacks Hezbollah strongholds in Northeast Lebanon", "date": "2024-05-17 08:15", "url": "https://www.sentinelassam.com/more-news/international/israel-attacks-hezbollah-strongholds-in-northeast-lebanon", "message": "Tel Aviv: Israel has carried out airstrikes in northeastern Lebanon’s Baalbek, considered a stronghold of the Hezbollah group.\nThe airstrike was in retaliation to the Hezbollah attack in northern Israel on Wednesday late night and Thursday early morning hours.\nThe Hezbollah had claimed that it had launched Kamikaze drones towards an IDF base in Tiberias in northern Israel.\nA top Hezbollah commander Hussain Mekki was killed by the IDF drone attack in southern Lebanon on Tuesday.\nMekki, according to Israel, was responsible for attacks on Israeli civilians since the ongoing war against Hamas commenced on October 7, 2023."}, {"id": "b5f181d2-42fe-4430-aa82-63524b5ec5e8", "title": "Azerbaijan Extends Arrest Term Of Former So - Called  President  Of Illegal Separatist Regime", "date": "2024-05-17 06:45", "url": "https://menafn.com/1108225013/Azerbaijan-Extends-Arrest-Term-Of-Former-So-CalledPresident-Of-Illegal-Separatist-Regime", "message": "(MENAFN- Trend News Agency) BAKU, Azerbaijan, May 14.\nThe term ofpreventive measure in the form of arrest against the formerso-called“president” of the illegal separatist regime in KarabakhArkady Ghukasyan has been extended, Trend reports.\nThe submission on the extension of the preventive measureagainst the accused was considered at the Binagadi District Courtof Baku.\nThe court extended the arrest period for 5 months.\nThe detained separatists are accused ofcrimes against peace and humanity, war crimes, terrorism, financingof terrorism, murders, the creation of illegal armed groups,etc."}, {"id": "3d83c436-9e43-4d02-8eeb-72b0a98d7c8e", "title": "UN body says aid delivery to Gaza  almost impossible  amid intensified fighting", "date": "2024-05-17 03:00", "url": "https://www.siasat.com/un-body-says-aid-delivery-to-gaza-almost-impossible-amid-intensified-fighting-3027632/", "message": "Gaza: The United Nations (UN) Office for the Coordination of Humanitarian Affairs (OCHA) has said that distributing humanitarian aid “is almost impossible” in Gaza, due to the irregular fuel supply and interrupted communications amid the ongoing intense war between Israel and Hamas.\n#Gaza:⚠️ Access to critical health services continues to shrink and displacement is on the rise as new evacuation orders are issued and military operations intensify.\nOCHA and other humanitarian organizations warned of the devastating impact of the crossings’ closure on over 2 million Palestinians in war-stricken Gaza, Xinhua news agency reported.\nOn Thursday, the Jordan Armed Forces said it conducted three airdrops of humanitarian aid over various locations in southern Gaza.\nThis is the first eyewitness report of an aid drop operation in Rafah since the Israeli army’s renewed attacks on the southernmost Gazan city last week."}, {"id": "c6e19698-030e-405c-91fd-5c39bc56c0de", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 08:15", "url": "https://www.oxfordmail.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "b849b909-bbd4-411d-a08b-3124f52902a0", "title": "French police fatally shoot a man suspected of setting fire to a synagogue", "date": "2024-05-17 11:30", "url": "https://www.clickorlando.com/news/world/2024/05/17/french-police-fatally-shoot-a-man-suspected-of-planning-to-set-fire-to-a-synagogue/", "message": "Journalists gather in front of the synagogue in Rouen, Friday, May 17, 2024.\nFrench police have shot and killed a man armed with a knife and a metal bar who is suspected of having set fire to a synagogue in the Normandy city of Rouen.\nFrench police said officers were alerted early Friday morning that smoke was rising from the synagogue and came face to face with the man when they got there.\nThe suspected arsonist was an Algerian national who wasn’t flagged as a suspected extremist, Interior Minister Gerald Darmanin said after inspecting the fire-damaged synagogue.\n“There’s a climate of fear because it feels like, anywhere in our country and at any time, an antisemitic attack can take place."}, {"id": "d3dfa08e-1ee3-4b55-b8fc-d9ee74de3a36", "title": "LANPAC 2024 Speech > U . S . Pacific Fleet > Speeches U . S . Pacific Fleet", "date": "2024-05-17 01:30", "url": "https://www.cpf.navy.mil/Newsroom/Speeches/Article/3778496/lanpac-2024-speech/", "message": "Here's how you knowAn official website of the United States government"}, {"id": "9757215b-251b-45f4-a801-a747ca6f433b", "title": "Fierce Battles Rage Across Gaza As US Calls For Post - War Plan", "date": "2024-05-17 04:45", "url": "https://menafn.com/1108224700/Fierce-Battles-Rage-Across-Gaza-As-US-Calls-For-Post-War-Plan", "message": "Clashes have rocked the densely crowded far-southern city of Rafah but also flared again in northern and central Gaza, months after troops and tanks first entered those areas.\nThe United States has urged Hamas to accept a Gaza truce plan and called on Israel to devise \"a strategic endgame\" and post-war plan, said White House National Security Adviser Jake Sullivan.\nRecent battles and heavy Israeli bombardments have been reported around Rafah as well as in Gaza City and Jabalia refugee camp in the north and Nuseirat camp in the centre.\nMore than seven months into the war, Israeli strikes and ground combat claimed another 82 lives in Gaza over the past 24 hours, the health ministry in the Hamas-run territory said.\nNearly 450,000 Palestinians have been newly displaced from Rafah in recent days, and around 100,000 from northern Gaza, UN agencies said."}, {"id": "af64f57c-faf5-4c2e-b129-2236f8c492cc", "title": "Hungarian PM says Slovakia PM Robert Fico is  between life and death  2 days after assassination attempt", "date": "2024-05-17 06:30", "url": "https://www.dnaindia.com/world/report-hungarian-pm-says-slovakia-s-pm-robert-fico-is-between-life-and-death-2-days-after-assassination-attempt-3089631", "message": "Slovakia's Prime Minister Robert Fico is between life and death two days after an assassination attempt that sent shock waves across Europe, Hungarian Prime Minister Viktor Orban told public radio on Friday.\n\"We are praying for the prime minister and root for Slovakia,\" Orban said.\nRobert Fico is between life and death.\"\nEarlier, Deputy Prime Minister Robert Kalinak said it was too early to say whether Fico would recover from the attack due to \"the extent of the injuries caused by four gunshot wounds\".\n\"This is a lone wolf who had radicalised himself in the latest period after the presidential election (in April),\" Sutaj Estok said."}, {"id": "5a542733-f57a-4644-b16e-0abca8d8e352", "title": "Biden Removes Hamas Ally Cuba from Blacklist of Countries That Dont Cooperate to Fight Terrorism", "date": "2024-05-17 03:00", "url": "https://www.breitbart.com/politics/2024/05/16/biden-removes-hamas-ally-cuba-from-blacklist-countries-that-dont-cooperate-fight-terrorism/", "message": "U.S. Secretary of State Antony Blinken on Wednesday removed Cuba’s communist regime from the State Department’s list of countries “not cooperating fully” against terrorism.\nThe communist Castro regime also maintains a relationship with the Sunni jihadist terrorist group Hamas.\nSimilar to other far-left Latin American regimes and governments, the Castro regime has accused Israel of commiting “genocide” in its self-defense operations against Hamas, but not condemned the explicitly genocidal Hamas goal of destroying the Israeli nation and its people.\n¡Basta de brutalidad, basta de abuso, basta de impunidad!#FreePalestine#ShutItDown4Palestine pic.twitter.com/UEiVhoxUah — Miguel Díaz-Canel Bermúdez (@DiazCanelB) March 1, 2024The Castro regime has held several pro-Hamas events in the past few months.\nAgradecemos esfuerzos de congresistas de EEUU que han instado al presidente Biden retirar a #Cuba de lista de Estados patrocinadores del terrorismo."}, {"id": "5e043a2e-54bf-488c-a577-b2d0ddd1b9d6", "title": "Early morning barrage : UAVs fired from Lebanon towards Nahariya", "date": "2024-05-17 05:00", "url": "http://www.israelnationalnews.com/news/390103", "message": "A series of sirens warning of the infiltration of hostile aircraft and of rocket fire were heard in Nahariya and the surrounding area early Friday morning.\nSubsequently, the Home Front Command announced that the incidents were over.\nThe IDF confirmed that a number of UAVs infiltrated from Lebanon into the Western Galilee.\nOne of them was intercepted over the sea, and another UAV exploded in the Ga’aton area.\nThroughout the day, IAF fighter jets struck and destroyed a series of Hezbollah terror targets in Lebanese territory."}, {"id": "8a0da9c2-271f-4e8e-92f6-9197578dc4b2", "title": "North Korea fires ballistic missile , South Korea military says", "date": "2024-05-17 10:00", "url": "https://www.devdiscourse.com/article/law-order/2941644-north-korea-fires-ballistic-missile-south-koreas-military-says", "message": "North Korea fired a ballistic missile towards the sea off its east coast, South Korea's military said on Friday.\nSouth Korea's Joint Chiefs of Staff did not immediately provide details of the projectile or its trajectory.\nNorth Korea has launched a range of ballistic and cruise missiles as well as tactical rockets in recent months, describing them as part of a program to upgrade its defensive capabilities.\nEarlier on Friday, the powerful sister of North Korea leader Kim Jong Un said its tactical rockets were intended solely as a deterrent against South Korean military aggression, while denying that Pyongyang was exporting the weapons.\nThe missile launch comes at the same time as a visit by Russian President Vladimir Putin to the Chinese northeastern city of Harbin."}, {"id": "88822376-fc14-49ba-af97-c65e58ba3984", "title": "EU conference vows to combat rising antisemitism - The Jerusalem Post", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-801522", "message": "(credit: Vatican Media/­Handout via REUTERS)After launching the conference on May 6, Bergé repeated her government's commitments to fight \"the scourge of antisemitism everywhere.\"\nI think Britain is trying to fight antisemitism very hard and we are implementing programs from other countries.\n\"Organizations are working together to create an effective reporting system that others can learn from that will create a more effective way to fight antisemitism.\nAs a former EU security chief, I can say that I think antisemitism is a threat to European security.\"\nI think we should also look into combating and providing intelligence on hate crimes such as antisemitism so that countries can fight the phenomenon."}, {"id": "241e2c04-5a52-43d0-9763-22f48ecaab7a", "title": "Slovak PM Fico between life and death after shooting , Hungary PM says", "date": "2024-05-17 06:45", "url": "https://www.yahoo.com/news/slovak-pm-fico-between-life-060817241.html", "message": "BUDAPEST (Reuters) - Slovakia's Prime Minister Robert Fico is between life and death two days after an assassination attempt that sent shock waves across Europe, Hungarian Prime Minister Viktor Orban told public radio on Friday.\nThe shooting was the first major assassination attempt on a European political leader for more than 20 years, and has drawn international condemnation.\n\"We are praying for the prime minister and root for Slovakia,\" Orban said.\nRobert Fico is between life and death.\"\n\"In that situation we would have badly needed Robert Fico and a pro-peace Slovakia."}, {"id": "89b1c2fc-77e3-4dc9-89d0-a1c4b4301006", "title": "  Heightened threat  of terrorism during Pride Month 2024 , FBI and DHS warn", "date": "2024-05-17 00:00", "url": "https://wfin.com/fox-national-news/heightened-threat-of-terrorism-during-pride-month-2024-fbi-and-dhs-warn/", "message": "​Join Fox News for access to this content You have reached your maximum number of articles.\nFederal intelligence agencies are warning that this year’s Pride Month may be targets for terrorist organizations.\nIt also noted that June 2024 will be the eighth anniversary of the Pulse Nightclub shooting in Orlando, Florida.\nIt was celebrated by Islamic terrorist organizations around the world.\nPride month begins on June 1 and runs until the end of the month."}, {"id": "09e93155-b055-4362-b864-09eea28f006a", "title": "Israel - Hamas War Day 224 : What is happening in Gaza , Lebanon ? ", "date": "2024-05-17 05:00", "url": "https://www.jpost.com/israel-hamas-war/2024-05-17/live-updates-801530", "message": "Hezbollah members parade during a rally marking al-Quds Day, (Jerusalem Day) in Beirut's southern suburbs, Lebanon April 5, 2024.\n(photo credit: MOHAMED AZAKIR/REUTERS)A senior official in the terrorist organization Hezbollah was killed in a retaliatory strike by the IAF, after the group claimed to use a new missile-launching drone to attack Israel Thursday night, Israeli media reported on Friday morning.\nAccording to Hezbollah, during the attack, the UAV (unmanned aerial vehicle) flew towards an IDF base near Metulla and targeted IDF soldiers."}, {"id": "f4137b0d-0a5f-4a18-8a4b-5cc9c223133e", "title": "Slovak PM Fico between life and death after shooting , Hungary PM says", "date": "2024-05-17 08:30", "url": "https://www.swissinfo.ch/eng/slovak-pm-fico-between-life-and-death-after-shooting%2c-hungary-pm-says/77779902", "message": "Slovak PM Fico between life and death after shooting, Hungary PM says1 minuteBUDAPEST (Reuters) – Slovakia’s Prime Minister Robert Fico is between life and death two days after an assassination attempt that sent shock waves across Europe, Hungarian Prime Minister Viktor Orban told public radio on Friday.\nThe shooting was the first major assassination attempt on a European political leader for more than 20 years, and has drawn international condemnation.\n“We are praying for the prime minister and root for Slovakia,” Orban said.\nRobert Fico is between life and death.”Orban said even if Fico recovers, he would be out of work for months at a critical time in the run-up to European Parliament elections due early next month.\n“In that situation we would have badly needed Robert Fico and a pro-peace Slovakia."}, {"id": "576b604f-bbe7-410a-aaa5-6b2b127700d6", "title": "Army will present Purple Heart to Minnesota veteran 73 years after he was wounded in Korean War", "date": "2024-05-17 05:45", "url": "https://www.yahoo.com/news/army-present-purple-heart-minnesota-050024279.html", "message": "(AP Photo/Abbie Parr, File)ST. PAUL, Minn. (AP) — After 73 years and a long fight with the U.S. Army, a Korean War veteran from Minnesota who was wounded in combat was set to finally get his Purple Heart medal on Friday.\nThe Army notified Earl Meyer, 96, of St. Peter, last month that it had granted him a Purple Heart, which honors service members wounded or killed in combat.\nAn Army review board had rejected Meyer’s application several times due to a lack of paperwork, but it reversed course after a campaign by his three daughters and attorney.\nA federal judge ordered the review board to take another look.\nWhen the Army denied Meyer’s first applications for the medal, it said his documentation was insufficient."}, {"id": "3a6333fc-ac89-4ab6-8c64-e503e648be9e", "title": "Army will present Purple Heart to veteran 73 years after he was wounded in Korean War", "date": "2024-05-17 08:30", "url": "https://abcnews.go.com/US/wireStory/army-present-purple-heart-minnesota-veteran-73-years-110328542", "message": "After 73 years and a long fight with the Army, a Korean War veteran from Minnesota who was wounded in combat is set to finally get his Purple HeartST. PAUL, Minn. -- After 73 years and a long fight with the U.S. Army, a Korean War veteran from Minnesota who was wounded in combat was set to finally get his Purple Heart medal on Friday.\nThe Army notified Earl Meyer, 96, of St. Peter, last month that it had granted him a Purple Heart, which honors service members wounded or killed in combat.\nAn Army review board had rejected Meyer’s application several times due to a lack of paperwork, but it reversed course after a campaign by his three daughters and attorney.\nA federal judge ordered the review board to take another look.\nWhen the Army denied Meyer’s first applications for the medal, it said his documentation was insufficient."}, {"id": "178e3e19-eb8a-4b09-bec9-b535f0f3e5e1", "title": "Media palestinesi ,  bombardata scuola a Gaza , quattro morti  ", "date": "2024-05-17 07:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/media-palestinesi-bombardata-scuola-a-gaza-quattro-morti-e8zmp8ld", "message": "ROMA, 17 MAG - Quattro persone sono state uccise e altre sono rimaste ferite dopo che un aereo israeliano ha bombardato una scuola che ospitava sfollati nel campo profughi di Nuseirat, nel centro di Gaza.\nLo riferisce l'agenzia di stampa statale palestinese Wafa, sottolineando che \"l'attacco all'alba alla scuola al-Jaouni ha fatto seguito a una serie di attacchi aerei e di artiglieria notturni da parte delle forze israeliane su case residenziali e rifugi da nord a sud di Gaza\"."}, {"id": "853bfd55-7c75-4abc-9ac2-cae404f4b6ae", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 08:45", "url": "https://www.dorsetecho.co.uk/news/national/24326283.massive-ukrainian-drone-attack-crimea-cuts-power-sevastopol/", "message": "The Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nUkrainian drones also attacked Novorossiysk, a major Black Sea port.\nA damaged house after a Russian airstrike in Vovchansk, Ukraine (Evgeniy Maloletka/AP)Belgorov governor Vyacheslav Gladkov said a Ukrainian drone struck a vehicle, killing a woman and her four-year-old child.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "fc7a5139-8067-4d84-ab0d-ce1ed8b5cdc0", "title": "Piers Morgan grills anti - Israel activists on Eurovision boycott ethics", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/bds-threat/article-801529", "message": "During the debate, Morgan asked the participants to justify why Israel should be banned from Eurovision.\nTurning to Mazzig, Morgan asked the same question.\n\"Both are absolutely terrible,\" Walker quickly answered.\nMorgan asked whether Walker was outraged about October 7 and what did he tweet about it?\nMorgan asked."}, {"id": "b4c4bb67-5ec6-4578-822c-479896e19b55", "title": "Will a US missile system in the Philippines make northern Luzon a  high value target  for China ? ", "date": "2024-05-17 04:45", "url": "https://www.scmp.com/week-asia/politics/article/3262964/will-us-missile-system-philippines-make-northern-luzon-high-value-target-china", "message": "Members of the newly formed leftist movement P1NAS (Filipinos United for Sovereignty) have called for President Ferdinand Marcos Jnr to reconsider the deployment of the US Army’s Typhon missile system in northern Luzon, arguing it could make the region a priority target for Beijing.\nThe Typhon was first deployed to the Philippines in April for use in the Balikatan , the annual US-Philippines joint military exercises.\nThe military has confirmed the system is still in Luzon but has not said how long it will remain there.\n“We denounce the Marcos Jnr administration for allowing the US to deploy its new missile system.\nEspeña noted that China could respond to the Typhon by deploying more of its vessels to the South China Sea to challenge the commitment of US-Philippine forces to utilise their anti-ship missile systems."}, {"id": "0fb34804-b7fa-4de1-b63f-975869afaf63", "title": "Lawyer for family of slain US Air Force airman says video and calls show deputy went to wrong home", "date": "2024-05-17 04:45", "url": "https://www.newsday.com/news/nation/airman-shot-florida-deputy-roger-fortson-y82391", "message": "Crump and Fortson’s family contend that the deputy went to the wrong apartment and the shooting was unjustified.\nA small shrine is pictured Monday, May 13, 2024, in Fort Walton Beach, Fla. at the door of an apartment where a Florida deputy shot and killed Senior Airman Roger Fortson.\nA small shrine is pictured Monday, May 13, 2024, in Fort Walton Beach, Fla. at the door of an apartment where a Florida deputy shot and killed Senior Airman Roger Fortson.\nThe video shows the deputy banging on the door and stepping aside, seemingly out of view of the door.\nThe deputy shouted, “Step back!” and then shot Fortson six times."}, {"id": "2a9cffea-32df-4eb5-b945-de288def066c", "title": "Israeli aggression has killed 70 percent of Zionist captives : Hamas", "date": "2024-05-17 03:15", "url": "https://www.presstv.ir/Detail/2024/05/17/725717/Palestine-Israel-Hamas-Israeli-captives-war-Gaza", "message": "Hamas says the Israeli regime’s bombing of the Gaza Strip, which is enduring a genocidal Israeli war, has killed 70 percent of the Zionist captives, who have been held by the Palestinian resistance movement since an October operation.\n“The Zionist enemy wants to recover the remaining captives by force, killing them by bombing,” he said.\nAt least 35,272 Palestinians have died in an Israeli war of genocide that began following the operation.\nHamas recently agreed to another truce proposal enabling cessation of the Israeli aggression and release of the rest of the captives.\n‘Victory is our ally’The Hamas’ official pointed to the Israeli regime’s failure to realize its war goals, including defeating the resistance."}, {"id": "b48226ab-80e0-4109-bd1b-bdea2d1835d1", "title": "Marcos says he wont allow destabilization", "date": "2024-05-17 06:45", "url": "https://www.sunstar.com.ph/manila/marcos-says-he-wont-allow-destabilization", "message": "PRESIDENT Ferdinand Marcos Jr. vowed on Thursday, May 16, 2024, to fend off destabilization plots, stressing the government’s focus is developing the countryside and to fight insurgency.\n“So, I urge all of you to continue to [demonstrate] your loyalty, patriotism, and service to your country.\nAnd let that love of country remain as your compass in your duty to our country and to our people,” Marcos told the Army’s 4th Infantry Division (4ID) personnel.\nMarcos also underscored the changing times and the new threats in the nation’s security.\n“Because of your efforts, these who we consider our adversaries before are now (helping to) build their communities instead of destroying those communities,” he told the troops."}, {"id": "a792d562-68d8-4464-97a3-0d2363cbefb2", "title": "N . Korea slams planned S . Korea - US military drills , warns of  catastrophic aftermath  ", "date": "2024-05-17 01:00", "url": "http://www.koreaherald.com/view.php?ud=20240517050125", "message": "(Gettyimages)North Korea on Friday denounced a plan by South Korea and the United States to stage their joint annual military drills in August, warning that they could face a \"catastrophic aftermath\" if they carry out the exercise.\nIn December 2023, South Korea and the US agreed to hold a discussion-based exercise simulating North Korea's use of a nuclear weapon in conjunction with the UFS.\n\"The joint military exercise slated for August aims to complete the US's nuclear war plan ... and fully implement it.\nIn a separate KCNA dispatch, the North also denounced the latest joint air combat drills between advanced South Korean and US stealth fighters.\nSouth Korea's unification ministry said the joint military exercise is defensive in nature and aimed at preventing war, stressing that North Korea should not use it as a pretext for further provocations."}, {"id": "3f890977-c9ad-4a02-991b-8ef616f1dd7a", "title": "N . Korea slams planned S . Korea - US military drills , warns of  catastrophic aftermath  ", "date": "2024-05-17 01:00", "url": "https://www.koreaherald.com/view.php?ud=20240517050125", "message": "(Gettyimages)North Korea on Friday denounced a plan by South Korea and the United States to stage their joint annual military drills in August, warning that they could face a \"catastrophic aftermath\" if they carry out the exercise.\nIn December 2023, South Korea and the US agreed to hold a discussion-based exercise simulating North Korea's use of a nuclear weapon in conjunction with the UFS.\n\"The joint military exercise slated for August aims to complete the US's nuclear war plan ... and fully implement it.\nIn a separate KCNA dispatch, the North also denounced the latest joint air combat drills between advanced South Korean and US stealth fighters.\nSouth Korea's unification ministry said the joint military exercise is defensive in nature and aimed at preventing war, stressing that North Korea should not use it as a pretext for further provocations."}, {"id": "b091a94e-b7e2-4c90-889b-913f0c236a91", "title": "Massive Ukrainian drone attack on Crimea cuts power in Sevastopol", "date": "2024-05-17 11:00", "url": "https://guernseypress.com/news/world-news/2024/05/17/massive-ukrainian-drone-attack-on-crimea-cuts-power-in-sevastopol/", "message": "A massive Ukrainian drone attack on Crimea early on Friday caused power cutoffs in the city of Sevastopol and set a refinery ablaze in southern Russia, Russian authorities said.\nThe Russian Defence Ministry said air defences downed 51 Ukrainian drones over Crimea, another 44 over the Krasnodar region and six over the Belgorod region.\nIt said Russian warplanes and patrol boats also destroyed six sea drones in the Black Sea.\nIn the Krasnodar region, the authorities said a drone attack early on Friday caused a fire at an oil refinery in Tuapse which was later contained.\nIn the Kharkiv region, Russian forces have advanced 10 kilometres from the border, President Volodymyr Zelensky told reporters on Friday."}, {"id": "a679435e-4776-4bbf-af78-360901dc28d8", "title": "Explained : How New Tejas Fighter Jet Variant Is Different From Its Predecessor", "date": "2024-05-17 14:30", "url": "https://www.ndtv.com/india-news/explained-how-new-tejas-fighter-jet-variant-is-different-from-its-predecessor-5685154", "message": "The Second Series Production (SP2) Tejas aircraft was given initial operational clearance in 2016.\nThe Tejas Mk1 version was inducted in the Air Force's No.\nHow Is Tejas Mk1A Different?\nOn March 28, Group Captain KK Venugopal (Retired), a test pilot, took the Tejas Mk1A to the skies and was airborne for 15 minutes.\nThe Tejas Mk1, Mk1A, and Mk2 variants will replace the MiG-21, MiG-29, and SEPECAT Jaguar of the Indian Air Force in the future."}, {"id": "e678280c-ebfb-46ab-8de5-90733f87ad8c", "title": "Hamas - UN Bull *** Blood Libel", "date": "2024-05-17 01:30", "url": "https://hotair.com/headlines/2024/05/16/hamas-un-bull-blood-libel-n3788534", "message": "...AdvertisementOn October 7, Hamas launched an unprovoked sneak attack on Israel, killing perhaps 1,400 people—including some of the hostages.\nBy Hamas’s numbers, Israel’s retaliation has killed 37,500 Gazans—27 Gazans killed for every Israeli killed in the initial attack (but not including IDF forces killed since then).\nOn December 7, 1941, the Empire of Japan launched an unprovoked sneak attack on Pearl Harbor, killing 2,403 Americans.\nBy this crude measure, then, America’s post-December 7 response was 46 times as “disproportionate” as Israel’s post-October 7 response.\nEven more telling, America contributed mightily to millions of German deaths, even though Nazi Germany had not even attacked the U.S. when America declared war."}, {"id": "73331e6b-3e75-48f4-be3d-34af30c7e386", "title": "Winning : What Hamas Planned To Do In Israel", "date": "2024-05-17 05:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtwin%5Carticles%5C202405160542.aspx", "message": "First, Palestinian occupied Israel would be divided up into several cantons, each ruled by a Hamas leader.\nIn 2007 Hamas ejected Fatah from Gaza and Israel blockaded Fatah in Gaza, not allowing Palestinians in Gaza to enter Israel without permission.\nHamas found refuge in some Arab Gulf oil states and that enabled Hamas to keep fighting.\nThat didn’t happen and one of the aftereffects of that failed offensive was the revelations of Hamas plans for Israel after they conquered it.\nHaaretz collected all the information needed to document Hamas plans and remind Israelis that Hamas was deadly serious about continuing its fight to destroy Israel."}, {"id": "d406fcdc-42b4-4023-b8ad-808fa3ac726c", "title": "Islamic terrorist jailed for Hartlepool pensioner murder", "date": "2024-05-17 14:30", "url": "https://www.thenorthernecho.co.uk/news/24327509.islamic-terrorist-jailed-hartlepool-pensioners-murder/", "message": "Teesside Crown Court heard how minutes later he came across the unsuspecting Hartlepool pensioner as he took his regular early morning stroll.\nCCTV footage of Ahmed Ali Alid wandering the streets of Hartlepool armed with a knife moments before murdering Terrence Carney.\nMrs Justice Cheema-Grubb DBE branded the asylum seeker a terrorist as she jailed him for life after he was convicted of the murder and attempted murder.\nSentencing him, she said: \"On October 15 last year, you attacked and murdered Terrence Carney in a terrorist act.\nThe judge heard how Mr Nouri had now left the region as he no longer felt safe."}, {"id": "dcf3ea6c-5c76-4054-b094-c411b0b7ad1e", "title": "How to add affixes with Tempering in Diablo 4", "date": "2024-05-17 01:30", "url": "https://www.polygon.com/diablo-4-guides/24158202/tempering-temper-manuals-list-all-affixes", "message": "How Tempering works in Diablo 4The Tempering system is a crafting system in Diablo 4 that gives you the chance to upgrade Rare and Legendary pieces of equipment by adding new affixes to them.\nIn the Tempering system, you have access to affixes that, in general, interact with the abilities of each class.\nFor example, the Natural Finesse recipe, which is of the Offensive type, always has the +% Damage, +% Damage to Crowd Controlled Enemies, +% Damage to Close Enemies, and +% Damage to Distant Enemies.\nBy tempering an item, you add one of the affixes listed in the recipe that you chose, a completely random process.\nHow to use the Tempering system in Diablo 4To use the Tempering system, first, you need to visit the Blacksmith NPC."}, {"id": "909e6868-34b7-44ca-89a5-c2ed76daf881", "title": "Defence Seeks Niger Republic Help To Arrest Wanted Terrorist", "date": "2024-05-17 02:15", "url": "https://leadership.ng/defence-seeks-niger-republics-help-to-arrest-wanted-terrorist/", "message": "Defence Headquarters (DHQ) has declared a foreign terror kingpin terrorising the people of Zamfara State, Halilu Buzu, wanted and called on the Nigerien authorities to help effect his arrest.\nThe director of Defence Media Operations Major General Edward Buba said the wanted terrorist leader hails from Buzu in Republic of Niger.\nThe military in November 2022 declared Halilu Buzu dead following airstrikes on his camp, however, less than two years later, he is still declared wanted.\n“He is a High Value Target and therefore declared wanted.\nHe said initial investigation revealed that the surrendered terrorists managed to escape from Sharama, located in the Lake Chad Islands."}, {"id": "7ac578fc-e8a2-4f0f-aa10-c0ca433f36e4", "title": "Israeli cabinet rifts over Gaza break out into the open", "date": "2024-05-17 13:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/israeli-cabinet-rifts-over-gaza-break-out-into-the-open/articleshow/110208466.cms", "message": "Guerrilla tacticsJERUSALEM: Israeli government splits over the war in Gaza broke open this week, after the defence minister demanded a clear strategy from Prime Minister Benjamin Netanyahu as troops returned to battle Hamas fighters in areas the army was fighting in months ago.The comments from Defence Minister Yoav Gallant, who said he would not agree to setting up a military government in the enclave, reflect growing unease in the security establishment at the lack of direction from Netanyahu over who will be left to run Gaza when the fighting stops.They also brought out the sharp split between the two centrist former army generals in the cabinet, Benny Gantz and Gadi Eisenkot, who both backed Gallant's call, and the hard right nationalist religious parties led by Finance Minister Bezalel Smotrich and Internal Security Minister Itamar Ben-Gvir, who condemned the comments.\n\"That's no way to run a war,\" the right-wing Israel Today tabloid headlined its Thursday edition over a photo of Netanyahu and Gallant facing in different directions.Apart from dismantling Hamas and returning some 130 hostages still held by the Islamist movement, Netanyahu has not articulated any clear strategic goal for the end of the campaign, which has killed some 35,000 Palestinians and left Israel increasingly isolated internationally.However, backed by Ben-Gvir and Smotrich, both close to the West Bank settler movement, he has rejected any involvement in running postwar Gaza by the Palestinian Authority, set up under the Oslo interim peace accords three decades ago and generally seen internationally as the most legitimate Palestinian governing body.Netanyahu, struggling to hold his fractious coalition together, has so far stuck to his pledge of total victory over Hamas.\nAfterwards, Gaza could be run by a \"non-Hamas civilian administration with an Israeli military responsibility, overall military responsibility\", he told CNBC television on Wednesday.Israeli officials have said that Palestinian clan leaders or others may be recruited to fill the void but there has been no evidence that any such leaders have been identified and no friendly Arab countries have stepped forward to help.\n\"From Israel the options are either they end the war, and they withdraw, or they establish for all intents and purposes a military government there, and they control the entire territory for who knows how long, because once they leave an area, Hamas will reappear,\" said Yossi Mekelberg, an associate fellow with the Middle East and North Africa Programme at Chatham House.Gallant's refusal to contemplate any form of permanent military government reflects the costs of an operation that could stretch the military and the economy painfully, reviving memories of Israel's years-long occupation of southern Lebanon after the 1982 war.Yedioth Ahronoth, Israel's biggest circulation newspaper, quoted a confidential assessment from the defence establishment on Friday which estimated the cost of maintaining a military government in the Gaza Strip at about 20 billion shekels ($5.43 billion) a year, in addition to the costs of reconstruction.\nThe additional troop requirements would draw forces away from the northern border with Lebanon as well as central Israel and mean a sharp increase in reserve duty requirements, it said.Taking full control of Gaza would require at least four divisions, or around 50,000 troops, said Michael Milshtein, a former intelligence officer and one of Israel's leading specialists on Hamas.While thousands of Hamas fighters have been killed in the campaign and Israeli commanders say most of the movement's organised battalions have been broken down, smaller groups have popped up in areas the army left in the early stages of the war.The likely cost to Israel of a prolonged insurgency was illustrated on Wednesday, when five Israeli soldiers were killed by an Israeli tank in \"friendly fire\" as Israeli troops fought in the Jabalia area north of Gaza City, where the army said in January that it had dismantled Hamas' military framework after weeks of fighting.At the time, it said militants were still present in Jabalia but they were operating \"without a framework and without commanders\".On Friday, the army said it was conducting a \"divisional level\" offensive in Jabalia, where troops were fighting in the urban centre."}, {"id": "dcb2ff67-aa3f-46ff-8ad3-a4f0170824dd", "title": "Israeli cabinet members clash over Gaza strategy", "date": "2024-05-17 11:30", "url": "https://in-cyprus.philenews.com/international/israeli-cabinet-members-clash-over-gaza/", "message": "Israeli government splits over the war in Gaza broke open this week, after the defence minister demanded a clear strategy from Prime Minister Benjamin Netanyahu as troops returned to battle Hamas fighters in areas the army was fighting in months ago.\n“That’s no way to run a war,” the right-wing Israel Today tabloid headlined its Thursday edition over a photo of Netanyahu and Gallant facing in different directions.\nNetanyahu, struggling to hold his fractious coalition together, has so far stuck to his pledge of total victory over Hamas.\nAfterwards, Gaza could be run by a “non-Hamas civilian administration with an Israeli military responsibility, overall military responsibility”, he told CNBC television on Wednesday.\nNetanyahu has so far managed to avoid a walk-out by either side that could potentially bring his government down."}, {"id": "16befdd0-4e67-41dd-b198-f819681a4e2f", "title": "Slovak doctors to discuss moving PM Fico to Bratislava on Monday , reports say", "date": "2024-05-17 08:30", "url": "https://www.swissinfo.ch/eng/slovak-doctors-to-discuss-moving-pm-fico-to-bratislava-on-monday%2c-reports-say/77780401", "message": "Slovakia’s PM Fico undergoes another operation, deputy PM says he is hopefulreuters_tickers3 minutesBy Ayhan Uyanik and Jan LopatkaBANSKA BYSTRICA, Slovakia (Reuters) -Slovakia’s Prime Minister Robert Fico underwent a two-hour operation on Friday that have increased hopes for his recovery, a deputy prime minister said, following an assassination attempt this week that sent shockwaves through Europe.\nFico also underwent hours of surgery on Wednesday soon after being shot five times at close range.\nFEBRILE POLITICSThe shooting was the first major assassination attempt on a European political leader for more than 20 years, and has drawn international condemnation.\nFico and Orban have both criticised the supply of Western weapons to Ukraine and the imposition of sanctions on Russia.\n(Reporting by Ayhan Uyanik, Jan Lopatka, Gergeley Szakacs, Pawel Florkiewicz; Writing by Alan Charlish and Michael Kahn; Editing by Gareth Jones)"}, {"id": "32f2f2b6-31c6-47e5-8699-6ebd8a4ca051", "title": "Ukrainians conduct clearing operations in northern Vovchansk , preventing Russians from gaining foothold", "date": "2024-05-17 09:45", "url": "https://www.yahoo.com/news/ukrainians-conduct-clearing-operations-northern-055719895.html", "message": "The Armed Forces of Ukraine are clearing the streets in the north of Vovchansk, preventing the Russians from gaining a foothold there.\nDefence forces are clearing the streets in the north of Vovchansk, preventing the Russians from gaining a foothold there.\nOn the Kupiansk front, the Russians launched 10 attacks on Ukrainian military positions.\nOn the Lyman front, the Armed Forces of Ukraine repelled 10 Russian attacks, including those in Serebrianka Forest in Luhansk Oblast.\nOn the Prydniprovske front, the Russians are continuing to try to force Ukrainian forces from the left bank of the Dnipro River."}]