[{"id": "a0f5799d-6efe-44f7-95e5-7adbae69b47f", "title": "Israel used US - made bomb in deadly Rafah strike , experts say", "date": "2024-05-30 03:45", "url": "https://www.stripes.com/theaters/middle_east/2024-05-29/israel-us-made-bomb-rafah-14023186.html", "message": "MUST CREDIT: Alam Sadeq (Alam Sadeq)Four weapons experts said the Israeli military used a U.S.-made precision bomb in a strike that killed at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post.\nThe findings do not contradict Israel’s assertion that it used a small munition, weapons experts said.\nSecretary of State Antony Blinken said Wednesday that the United States couldn’t confirm what weapons were used or how they were used in the strike.\nIsrael said the attack on the encampment in Rafah was a \"targeted\" strike against two Hamas militants and employed \"the smallest munition\" Israeli fighter jets can use.\nAn Israeli military spokesman reached Wednesday said he could not comment further on the munition used or what measures were taken to prevent civilian casualties."}, {"id": "26cede40-0584-4b29-99ac-e1d7fe9dd605", "title": "Syria reports young girl killed 10 other people hurt in alleged", "date": "2024-05-30 02:30", "url": "https://muslimnews.co.uk/news/syria/syria-reports-young-girl-killed-10-other-people-hurt-in-alleged/", "message": "Syria’s defense ministry said an Israeli airstrike Syria reports on Wednesday killed a girl and wounded 10 civilians.\nbvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvsA war monitor said a parallel strike in the same region killed three pro-Hezbollah Syrian fighters.\nThe alleged Israeli strikes targeted “at least one military site… in the eastern countryside of Homs, causing plumes of smoke to rise,” it added.\nIt said a second strike on central Syria killed three Syrian fighters working with Lebanon’s Hezbollah group.\nAccording to Syria reports, the strike was the 42nd apparent Israeli attack on Syria since the beginning of the year."}, {"id": "c0762ee1-80fa-4f9a-970c-f1a2ec2f75f2", "title": "Police : Stabbing at WeGo bus station sends victim to hospital , suspect in custody", "date": "2024-05-30 13:30", "url": "https://fox17.com/news/local/2024-nashville-tennessee-police-stabbing-at-wego-bus-station-sends-victim-to-hospital-suspect-in-custody-edgehill-middle-tn", "message": "One person is in custody and another is injured after a stabbing at a WeGo bus station in the Edgehill community.\nThe stabbing occurred at the bus stop at 12th Avenue South and Edgeville Avenue.\nOn May 16, a for allegedly shooting teen outside a WeGo bus station.\nThat same week, a man was charged with attempted homicide after a in downtown Nashville.\nALSO SEE |WeGo Public Transit's that the shooting and stabbing being such close proximity is unusual because the system carries about 30,000 riders each day."}, {"id": "09246bbb-68af-4029-9e49-826528636a99", "title": "Experts : Biden failure to enforce his  red line  could result in  worst of all possible outcomes  ", "date": "2024-05-30 14:00", "url": "https://www.salon.com/2024/05/30/experts-bidens-failure-to-enforce-his-red-line-could-result-in-worst-of-all-possible-outcomes/", "message": "\"By any objective measure I can think of, the red line that was laid out by this administration has been crossed,\" Parkinson said.\n\"So now if the Biden administration does not follow through with what it promised it would do if this red line was crossed, it's a loss of credibility.\nWhite House national security advisor Jake Sullivan had several hours of discussions with senior Israeli officials about the Rafah operation while in Israel last week.\nOn Tuesday, Kirby highlighted Netanyahu's comments and said the Biden administration would wait for the IDF to release the results of its investigation, according to The Post.\nBut Biden's approach, Walt warned, could result in the \"worst of all possible outcomes here\" when his administration eventually feels \"they have to really crack down\" on Israel."}, {"id": "9b64e07c-212a-4543-b391-69f93666e945", "title": "Russia told to light  demonstrative  nuclear explosion | World | News", "date": "2024-05-30 09:00", "url": "https://www.express.co.uk/news/world/1905221/world-war-3-russia-nuclear-weapons", "message": "The suggestion comes amid escalating tensions with the West over Ukraine use of Western-supplied arms against Russian targets.\nPutin cautioned that allowing Ukraine to use Western weapons for strikes inside Russia could ignite a global conflict, a sentiment he underscored with warnings of dire consequences.\nHowever, earlier this month, the Kremlin signaled its dissatisfaction with what it perceives as increasingly aggressive Western rhetoric by ordering tactical nuclear weapons drills.\nIn addition to the nuclear test proposal, Suslov recommended that Russia initiate strategic nuclear exercises and issue stern warnings.\nHe also hinted that Russia might consider using nuclear weapons if such a country retaliated conventionally."}, {"id": "9bb76034-6194-4797-a9dc-d68ca21dd16a", "title": "North Korea Fires Ballistic Missiles Days After Rocket Fails", "date": "2024-05-30 01:00", "url": "https://www.livemint.com/news/world/north-korea-fires-ballistic-missiles-days-after-rocket-fails-11717025291499.html", "message": "North Korea fired multiple suspected ballistic missiles on Thursday, just days after leader Kim Jong Un’s space program was dealt a blow when a rocket blew up soon after liftoff.\nJapan’s Coast Guard said what appears to have been a ballistic missile has fallen.\nNorth Korea typically does not comment on missile launches until the day after they take place.\nThis is the sixth test of ballistic missiles from Kim’s regime this year.\nNorth Korea’s last ballistic missile launch took place about two weeks ago when it fired multiple short-range rockets."}, {"id": "957044f6-f411-45ed-866e-b140fa02603f", "title": "In A 24 Hour News Cycle Speed Beats Accuracy When It Comes To News About Israel | Newstalk Florida", "date": "2024-05-30 06:00", "url": "https://www.newstalkflorida.com/featured/in-a-24-hour-news-cycle-speed-beats-accuracy-when-it-comes-to-news-about-israel/", "message": "On Wednesday morning, Tal Heinrich, the spokesperson for the Office of Prime Minister Benjamin Netanyahu, expressed frustration with the media’s coverage of the war between Israel and Hamas.\nOn May 27, 2024, an Israeli airstrike targeted two Hamas operatives in Rafah, southern Gaza, who were allegedly planning an attack on Israel.\nHeadlines worldwide have attributed the attack and resulting fatalities in Rafah to Israel, ahead of the IDF’s investigation, leading to widespread international condemnation.\nWhite House spokesman John Kirby stated on Tuesday that Israel had not initiated a “major ground operation” in the city.\nJim Williams, based in Washington, D.C., provides comprehensive written articles and video reports on the conflict between Israel and Hamas, among other Middle Eastern issues."}, {"id": "87454ac9-074d-4f0b-a1a2-cc31659be710", "title": "Blinken signals US may allow Ukraine to strike inside Russia with American weapons", "date": "2024-05-30 08:45", "url": "https://www.livemint.com/politics/blinken-signals-us-may-allow-ukraine-to-strike-inside-russia-with-american-weapons-11717053955333.html", "message": "Previously, the U.S. has said it wouldn’t allow Ukraine to attack targets on Russian territory with ATACMS missiles or other U.S. weapons.\nHe repeated earlier assertions that the U.S. has neither encouraged nor enabled strikes on Russian territory.\nAs Russia has been making territorial gains in northeast Ukraine, Kyiv has repeatedly asked for permission to strike targets with U.S. weapons on Russian territory.\nOn Tuesday, Russian President Vladimir Putin warned that the use of Western-supplied weapons to strike Russian territory could risk escalation and, he hinted, retaliation.\nEarlier this month, the U.K. suggested Ukraine had the right to use British-supplied weapons against targets in Russia."}, {"id": "50d1a98c-b55a-4805-a272-796a2347fbf8", "title": "Woman pleads guilty to stabbing , killing cousin in 2021 in York County", "date": "2024-05-30 01:15", "url": "https://www.yahoo.com/news/woman-pleads-guilty-stabbing-killing-222058569.html", "message": "Woman pleads guilty to stabbing, killing cousin in 2021 in York CountyYORK COUNTY, Pa. (WHTM) — A woman accused of stabbing and killing a relative in York County years ago pleaded guilty Tuesday.\nNinoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed.\nYork County babysitter claimed girl ‘seduced me’ during rape investigation, police sayJoselito Pagan-Ocasio, 36, was found dead at his home at the 300 block of E. King Street in York City.\nFirst responders were dispatched for a fatality that was originally reported from a shooting but turned out to be from a stabbing.\nAn autopsy found Pagan-Ocasio died from a stab wound to the chest and the manner was ruled a homicide."}, {"id": "9699e367-7a71-4b4d-9013-895aea5e789e", "title": "Chicago police shooting : Family says stabbing suspect Tracey Watson fatally shot in South Austin was defending himself from attack", "date": "2024-05-30 07:00", "url": "https://abc7chicago.com/post/south-austin-chicago-police-fatal-shooting-family-speaks-out/14889006/", "message": "Police say Tracey Watson was stabbing another man before officers ordered him to drop his weaponFamily claims man fatally shot by Chicago police in South Austin was defending himself from attackRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nChicago police say the suspect, Tracey Watson, attempted to stab a man on the street around 11 p.m. in the 300-block of South Cicero Avenue in South Austin."}, {"id": "024afb98-5c97-4a1e-991b-e3dfe2ddd018", "title": "US Treasury promises to tighten sanctions on Russia", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/05/russia-240529-voa01.htm", "message": "US Treasury promises to tighten sanctions on RussiaBy VOA News May 29, 2024U.S. Deputy Treasury Secretary Wally Adeyemo arrived in Kyiv on Wednesday to meet with Ukrainian officials for talks about tightening sanctions on Russia and financial support for Ukraine.\nWashington has sanctioned more than 4,000 individuals and businesses since Russia launched a full-scale invasion of Ukraine in February 2022.\nDaleep Singh, a senior White House official said this week that the language of the sanctions could be changed, which could open the door to secondary sanctions, according to Reuters.\nUkraine's military operationsUkraine's military said Wednesday it shot down Russian drones that targeted areas of western, central and southern Ukraine.\nThe Ukrainian air force said it intercepted 13 of 14 Russian drones used in overnight attacks against the Mykolaiv, Kirovohrad and Rivne regions."}, {"id": "ebe54e65-c83f-4bac-a801-a09b45ac74e7", "title": "Nasrallah : No future for Nazi - like Israel in region", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-isna03.htm", "message": "Nasrallah: No future for Nazi-like Israel in regionISNA - Iranian Students' News AgencyWed / 29 May 2024 / 11:41Hezbollah Secretary-General Sayyed Hassan Nasrallah condemned Tuesday the Rafah massacre, stating that it stripped away the false story that had been used to present the Israeli occupation as a \"civilized\" entity.\nHe pointed out that the \"horrific Rafah massacre should awaken all the oblivious and silent people in this world.\"\nAddressing countries normalizing relations with the Israeli occupation, Sayyed Nasrallah asked, \"Will you normalize with these treacherous betrayers whose brutality knows no bounds?\"\n\"Look at the international community, which is impotent and weak, content with issuing statements of concern and condemnation,\" Sayyed Nasrallah said.\nFurthermore, the Hezbollah Secretary-General asserted that the Rafah massacre and the overall reckless actions of the Israeli occupation \"will hasten the defeat, collapse, and disappearance of this entity,\" stressing that \"there is no future for this Nazi-like entity in our region.\""}, {"id": "8343bbc8-becc-43f5-b8b6-b125d8cbce9c", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 02:15", "url": "http://usa.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "05c3f04b-1e80-4eeb-97ce-424e40777e31", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 02:45", "url": "http://europe.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "e3f5e782-3a41-487c-8dc4-348e0dcfe92e", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 05:45", "url": "http://africa.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "ffb00bd5-c4b6-4d0e-a059-54c7a668f7f8", "title": "Paramore , Dua Lipa , more celebs call for ceasefire in Israel - Hamas war :  Cannot support a genocide  ", "date": "2024-05-30 02:15", "url": "https://www.yahoo.com/entertainment/paramore-dua-lipa-more-celebs-012749202.html", "message": "Paramore is speaking out on the ongoing violence in the Israel-Hamas war following a deadly airstrike in the Gaza region over the weekend.\nOther stars such as Dua Lipa, Katy Perry and John Legend are lending their voices to the humanitarian crisis.\nKaty Perry joins call for 'immediate ceasefire' in Israel-Hamas warOn Wednesday, Perry reposted a graphic from the humanitarian aid organization UNICEF on Instagram.\n\"A military besiegement and ground incursion in Rafah, Gaza, poses a catastrophic risk to the children sheltering there,\" the caption on Perry's repost read.\nContributing: Karissa Waddick, USA TODAY; Nidal Al-Mughrabi and Dan Williams, ReutersThis article originally appeared on USA TODAY: Paramore, Dua Lipa, more stars call for ceasefire in Israel-Hamas war"}, {"id": "a46cac3a-0880-462c-a566-55924bdea574", "title": "Ukraine war : influential Russian think tank proposes a  demonstrative  nuclear explosion", "date": "2024-05-30 06:00", "url": "https://www.scmp.com/news/world/russia-central-asia/article/3264672/ukraine-war-influential-russian-think-tank-proposes-demonstrative-nuclear-explosion", "message": "A senior member of a Russian think tank whose ideas sometimes become government policy has suggested Moscow consider a “demonstrative” nuclear explosion to cow the West into refusing to allow Ukraine to use its arms against targets inside Russia.\nRussia’s missile forces during tactical nuclear weapons drills.\nRussian diplomats said at the time that Russia, which has not carried out a post-Soviet nuclear test, would not resume nuclear testing unless Washington does.\nRussia warned Britain this month that it could strike British military installations and equipment both inside Ukraine and elsewhere if British weapons were used by Ukraine – with London’s blessing – to strike Russian territory.\nIt issued the warning after British Foreign Secretary David Cameron said Kyiv had the right to use UK-supplied weapons to strike targets inside Russia."}, {"id": "ad257c9c-7d1a-46a5-b241-1a75ec43b569", "title": "Street battles , Israeli strikes rock Gaza Rafah", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815140-Street-battles,-Israeli-strikes-rock-Gaza%5C", "message": "Street battles, Israeli strikes rock Gaza's RafahWorld World Street battles, Israeli strikes rock Gaza's RafahStreet fighting and Israeli bombardment rocked Gaza's far-southern Rafah on Wednesday.\nBut fighting again flared in Rafah, where an AFP reporter said street battles raged and an Israeli helicopter fired guns and missiles at targets in the city centre.\nIn the north, Israeli military vehicles unleashed intense gunfire east of Gaza City, an AFP reporter said, while residents reported air strikes on parts of Jabalia.\nUN SECURITY COUNCILNearly eight months into the deadliest Gaza war, Israel has faced ever louder opposition, as well as cases before two Netherlands-based international courts.\nTurkish President Recep Tayyip Erdogan meanwhile hit out at the United Nations after the latest deadly Israeli strikes in Rafah."}, {"id": "de212b0a-937f-4ccb-8794-839f3f369b70", "title": "Child killed in Israeli airstrike in northwest Syria", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/syria/2024/syria-240529-irna01.htm", "message": "Child killed in Israeli airstrike in northwest SyriaIRNA - Islamic Republic News AgencyMay 29, 2024Tehran, IRNA -- A Israeli airstrike has killed a child and injured at least ten more civilians in the city of Baniyas, northwest Syria.\nAccording to Syria's SANA news agency, the airstrike took place on Wednesday evening, targeting a residential building in Baniyas, a Mediterranean coastal city in Tartous Governorate.\nEarlier on Wednesday, Syrian media reported another Israeli airstrike, which they said targeted the western city of Homs.\nOnly material damage was caused, the media outlets said.\nThe Israeli regime has in the past several years continued airstrikes on different parts of Syria, especially the capital Damascus, despite repeated protests by the Syrian government at the UN."}, {"id": "1ce6dfa1-13be-41af-b2c9-6fb33e77a837", "title": "Israel Launches Airstrikes Deep Into Syria - Reports Of Civilians Dead & Wounded", "date": "2024-05-30 01:30", "url": "https://www.zerohedge.com/geopolitical/israel-launches-airstrikes-deep-syria-reports-civilians-dead-wounded", "message": "Israel's military on Wednesday launched a fresh attack on targets deep inside Syria, which reportedly left civilian casualties, according to state media.\nSyrian government sources said the Israeli strike killed a girl and wounded ten civilians.\n\"Syrian air defense intercepts enemy targets in the skies of the city of Homs,\" the official SANA news agency also reported.\nIsrael was also part of this covert campaign, which saw the anti-Assad axis arm, train, and fund various al-Qaeda and jihadist groups.\nIn the initial days and weeks after Oct.7, Syria had lobbed several rockets toward the Israeli-occupied Golan Heights, which left no casualties."}, {"id": "2b6745d0-9f7b-45d5-8c67-fbf6134c6d93", "title": "Russia Ukraine war live : Putin - backed think tank says Kremlin should consider nuclear blast to warn West", "date": "2024-05-30 06:00", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-news-putin-nuclear-war-latest-b2553638.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Russia is building up forces near northern Kharkiv where it launched an offensive this month, Ukraine‘s top commander has said.\nHowever, Colonel General Oleksandr Syrskyi said Moscow still lacks the troop numbers to stage a major push in the area.\n“These forces are currently insufficient for a large-scale offensive and breakthrough of our defence,” Syrskyi said in a statement on the Telegram messaging app.\nIt comes as Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package."}, {"id": "d8363c9e-8af4-4bea-a224-5cdeb2388c53", "title": "North Korea Flies Trash And Manure Balloons Into South As It Doubles Down On Satellite Ambitions", "date": "2024-05-30 03:15", "url": "https://www.theyeshivaworld.com/news/general/2286787/north-korea-flies-trash-and-manure-balloons-into-south-as-it-doubles-down-on-satellite-ambitions.html", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "2187f38f-3328-4467-9d36-4695222b13f1", "title": "Nikki Haley writes  finish them  on IDF shells during Israel visit", "date": "2024-05-30 03:30", "url": "https://www.nzherald.co.nz/world/nikki-haley-writes-finish-them-on-idf-shells-during-israel-visit/KOINBXCXXRAY3PSFUFE3DLOC5Y/", "message": "Former U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APFormer U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APNikki Haley wrote “finish them!” on the side of a fresh Israeli artillery shell during a visit to Israel.\nOn Tuesday, she visited an artillery post on the country’s northern border and wrote on a shell: “Finish them!\nDon’t let anybody make you feel wrong because Israel is not wrong in this,” Haley said in a press conference on Monday."}, {"id": "2003172e-a5bd-494a-be44-27b541cc9997", "title": "Israel Claims Control of Strategic Philadelphi Corridor Between Gaza , Egypt", "date": "2024-05-30 10:45", "url": "https://www2.cbn.com/news/israel/israel-claims-control-strategic-philadelphi-corridor-between-gaza-egypt", "message": "JERUSALEM, Israel – In a major breakthrough, Israel announced that it has gained control over the strategic Philadelphi Corridor, cutting off the Gaza-to-Egypt terror tunnels.\nHamas turned the Philadelphi route into a central Hamas hotbed of terror.\nWe have now gained operational control over the Philadelphi route in Rafah.\"\nInstead, Israel claims the corridor served as Hamas' lifeline, through which the terror group regularly smuggled weapons.\nLet's get the hostages home, let's beat Hamas, let's make sure Lebanon knows not to try or do anything.\""}, {"id": "5535649c-d550-48e1-ac63-a69433fc6319", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:15", "url": "https://www.10news.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "405ec282-20ed-4b81-ba34-6488bf3f0a1b", "title": "Missile attacks damage a ship in the Red Sea off Yemen coast near previous Houthi rebel assaults - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 01:30", "url": "https://www.newdelhitimes.com/missile-attacks-damage-a-ship-in-the-red-sea-off-yemens-coast-near-previous-houthi-rebel-assaults/", "message": "Missile attacks twice damaged a Marshall Islands-flagged, Greek-owned ship Tuesday in the Red Sea off the coast of Yemen, with a private security firm saying radio traffic suggested the vessel took on water after being struck.\nThe vessel reported being headed to Fujairah in the United Arab Emirates.\nCentral Command separately said it destroyed five Houthi drones over the Red Sea amid the attacks.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones."}, {"id": "89502e74-01e2-4c12-9e29-a581ca1b6a71", "title": "  All Eyes on Rafah  social media post shared by 44 million people on Instagram", "date": "2024-05-30 09:00", "url": "https://www.firstpost.com/world/all-eyes-on-rafah-instagram-post-israel-gaza-war-13776736.html", "message": "Thousands of Palestinians are currently living in refugee camps in Rafah to escape Israel’s bombardment read moreThe 'All Eyes on Rafah' image which has gone viral in the last 24 hours on Instagram.\nImage Courtesy: @insiderworld/X“All eyes on Rafah,” the post going viral on social media, specifically on Instagram, has been shared by 44 million accounts since Monday after Israel launched a deadly strike in an encampment in Rafah.\nThe AI-generated image was shared widely on Instagram including celebrities like Gigi Hadid, Bella Hadid, and Pedro Pascal.\nIn India, the post was shared by actors like Alia Bhatt, Priyanka Chopra and Kareena Kapoor.\nThousands of Palestinians are currently living in refugee camps in Rafah to escape Israel’s bombardment."}, {"id": "6fadcc95-066c-4f02-8785-295a04664a54", "title": "France Macron Backs Ukrainian Strikes Inside Russia", "date": "2024-05-30 06:45", "url": "https://www.zerohedge.com/geopolitical/frances-macron-backs-ukrainian-strikes-inside-russia", "message": "“That’s self-defense and they have the right to self-defense, and we should help them to uphold the right of self-defense.”Germany More Cautious About Russia StrikesMr. Scholz expressed reservations this weekend about encouraging Ukrainian strikes inside Russia.\nWhile standing beside his French counterpart on Tuesday, Mr. Scholz avoided expressing outright support or opposition to Ukrainian strikes inside Russia.\nBy contrast, Italian Prime Minister Giorgia Meloni and her government have distanced themselves from Mr. Stoltenberg’s calls for NATO to support Ukrainian strikes inside Russia.\nThe Biden administration’s overarching policy has been one of opposition to Ukrainian strikes inside Russia, but some have urged a policy change or suggested caveats.\nPutin Warns NATO MembersRussian President Vladimir Putin hasn’t remained silent regarding NATO’s discussion of Ukrainian strikes inside Russia."}, {"id": "05602b45-b7dc-4bfb-b406-42b7f081e3ec", "title": "Street battles , Israeli strikes rock Rafah - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836545/street-battles-israeli-strikes-rock-rafah", "message": "RAFAH: Street fighting and Israeli bombardment rocked Rafah in the Gaza Strip on Wednesday, residents and officials said, a day after Israeli tanks rolled into the centre of the city near the Egyptian border.\nIsrael’s National Security Adviser Tzachi Hanegbi said on Wednesday the war could go on until the year’s end.\nFighting has again flared in Rafah, where an AFP reporter said an Israeli helicopter fired guns and missiles at targets in the city centre.\nThe spirit of the United Nations is dead in Gaza,” Erdogan told lawmakers from his AKP party.\nThe Turkish leader also hit out at fellow Muslim-majority countries for failing to take common action over the Israeli strike."}, {"id": "f9faba9c-deea-4bc4-80e4-553e2541e96a", "title": "IDF intercepts cruise missile likely fired from Iraq", "date": "2024-05-30 14:00", "url": "https://www.ynetnews.com/article/b1emxjiva", "message": "This is not the first time that militias in Iraq have targeted Israel;they have claimed responsibility for several launchings of rockets, missiles and UAVs since October 7."}, {"id": "d24cd449-f49a-45d5-9378-e73082d6b6c2", "title": "Ocean City , New Jersey officials to announce new public safety measures following chaos during Memorial Day weekend", "date": "2024-05-30 07:15", "url": "https://6abc.com/ocean-city-new-jersey-officials-announce-new-public/14889198/", "message": "Ocean City to announce new public safety measures following weekend chaosCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreOCEAN CITY, New Jersey (WPVI) -- Cape May County officials are holding a press conference on Thursday in the aftermath of a chaotic Memorial Day weekend at the Jersey shore.\nThe press conference will be held at 4 p.m. outside the Ocean City Music Pier on the Ocean City Boardwalk at Moorlyn Terrace.\nCity officials are set to announce new measures being taken to protect public safety on the boardwalk and throughout the area.\nThis comes after numerous fights, disturbances, and the stabbing of a 15-year-old boy over the long weekend.\nOcean City Mayor Jay Gillian, Police Chief Bill Campbell, County Commission Director Lenny Desiderio, and State Assemblyman Antwan McClellan are set to attend the press conference on Thursday."}, {"id": "2e31b87c-bf32-476d-b4f0-548bfedb0896", "title": "Nikki Haley writes  Finish them ! on Israeli artillery days after Rafah strike", "date": "2024-05-30 02:45", "url": "https://www.10news.com/politics/nikki-haley-writes-finish-them-on-israeli-artillery-shell-days-after-rafah-airstrike", "message": "Nikki Haley, a former presidential candidate for the Republican party, wrote \"Finish them!\"\non an Israeli artillery shell, days after Israel drew heightened criticism for its airstrike that killed dozens and displaced hundreds of Palestinians.\nThere, Danon's office shared a photo of Haley writing on a munition on social media, with the caption, \"This is what my friend, the former ambassador Nikki Haley, wrote ...\nAlways, Nikki Haley.\"\n\"America needs to do whatever Israel needs and stop telling them how to fight this war."}, {"id": "0c56e810-aaf1-4482-a4e6-884d7812fd20", "title": "  All eyes on Rafah  social media trend explained as backlash grows over Israel airstrike", "date": "2024-05-30 01:00", "url": "https://www.independent.co.uk/news/world/middle-east/all-eyes-on-rafah-israel-gaza-b2553094.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}An image urging people to pay attention to Israel’s ongoing conflict in Gaza is getting shared by millions on social media following a deadly Israeli airstrike killing dozens of civilians.\nThe picture, which has rows of tents stretching into the distance and is emblazoned with the words “All eyes on Rafah”, has now been posted almost 40 million times on Instagram.\nIsrael said it had targeted two senior Hamas operatives and had not intended to cause civilian casualties.\nPrior to Israel’s ground invasion of Gaza in February, he said: “All eyes are on Rafah.” It is thought the artwork itself was created using Artificial Intelligence (AI)."}, {"id": "192c8e7c-7976-4211-a70a-f85a9d0c66f0", "title": "French MP says waving Palestinian flag was protest at  massacre  in Gaza - World", "date": "2024-05-30 10:45", "url": "https://www.brecorder.com/news/40306041/french-mp-says-waving-palestinian-flag-was-protest-at-massacre-in-gaza", "message": "LFI has positioned itself as a defender of the Palestinians, making the issue central to its campaign for the June 9 European Parliament election.\nDelogu raised the flag during a session of questions to the government, while another LFI deputy questioned a minister about the situation in Gaza.\n“I point the finger at France because they continue to sell arms (to Israel), which means they are complicit in this massacre,” he said.\nIn 2019, a lawmaker from Macron’s party held up a white flag with “France kills in Yemen” written in red.\nAnother LFI MP, David Guiraud, called a Jewish colleague a “pig” and a “pork” during a heated exchange shortly after the flag-waving incident."}, {"id": "23d3a004-89c9-4679-b35c-a808d5350054", "title": "  Some New US Missiles , You Cant Hear Them : Russians In Panic After Fly - Ins In Donetsk - Belarusian News", "date": "2024-05-30 14:00", "url": "https://charter97.org/en/news/2024/5/30/596973/", "message": "‘Some New US Missiles, You Can't Hear Them’: Russians In Panic After Fly-Ins In Donetsk 7 30.05.2024, 8:5015,838Z-war correspondents are at a loss.\nA successful strike by the AFU against a Russian Armed Forces base in occupied Donetsk has caused panic in Z-channels.\nThe Russians assure that the missiles that flew at the Russian military in Donetsk were allegedly completely silent.\n‘The strike on Kyiv district of Donetsk was carried out today by some new US missiles, the sound of the fly-in was not heard.\nIt is noteworthy that propagandists are silent about what was the target of the Ukrainian strike."}, {"id": "0d9cb24e-8d33-4a99-b072-db4751516517", "title": "NATO ally Erdogan blames US for Palestinian deaths in Gaza and denounces  vampire  Netanyahu", "date": "2024-05-30 05:00", "url": "https://www.washingtonexaminer.com/news/world/3021655/erdogan-blames-us-deaths-gaza-denounces-vampire-netanyahu/", "message": "Though several other NATO members have been critical of Israel during its war in Gaza, the Turkish president has perhaps topped them all, going so far as to show support for Hamas.\nHis Wednesday remarks denouncing Israel and Netanyahu are his strongest yet, comparing the prime minister with a supernatural monster.\n“The world is watching the barbarism of a sick man, a maniac, a psychopath, and a blood-feeding vampire called Netanyahu,” Erdogan said.\nIn March, Erdogan reaffirmed his support for the group while denouncing Israel as “Nazis.”“No one can make us qualify Hamas as a terrorist organization.\nNetanyahu issued a rare apology over the strike, calling it a “tragic mistake.”The strike has led to condemnations around the globe."}, {"id": "f1441c61-0e55-4a57-9743-a37594175125", "title": "Operation Iron Swords", "date": "2024-05-30 00:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-29.htm", "message": "Operation Iron Swords - Day 236 - 29 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nGaza war unit tracker @2023gazawar reported : \" Today the 98th Division left the Gaza Strip and ended the Jabaliya Raid.\nThe statement added that the second operation targeted the ship (MOREA) and the third operation targeted the ship (Sealady).\nTasnim reported that inspired by Iran, the Yemeni military forces have obtained the technology to manufacture anti-ship ballistic missiles.\nThese challenges are compounded by collapsed negotiations due to Israeli obstinacy and its military operation in Rafah."}, {"id": "cf473d29-9634-4ae1-af45-fbfad72d3836", "title": "One killed after hand grenade explodes during Japan SDF training", "date": "2024-05-30 10:45", "url": "https://www.prokerala.com/news/articles/a1535422.html", "message": "Tokyo, May 30 : A member of Japan's Self-Defense Forces (SDF) on Thursday died over a hand grenade explosion during a training session in Yamanashi Prefecture, immediately west of Tokyo, according to local media reports.\nThe accident took place around 8.45 a.m. local time at the Ground Self-Defense Force (GSDF)'s training ground Kitafuji Exercise Area, where a 29-year-old male soldier taking part in the training was hit by shrapnel from a hand grenade thrown by another SDF member, reports Xinhua news agency.\nIn recent years, the SDF has had frequent reports of training casualties.\nA shooting incident at a GSDF shooting range in Gifu Prefecture killed an SDF member and injured two others in June last year.\nTwo Maritime SDF helicopters in April collided and crashed during a night-time anti-submarine drill, killing one and leaving seven others missing."}, {"id": "1e5638f3-5b29-4be6-8832-e030516d91f2", "title": "Rafah massacre : Resistance says US statements prompt Israel to kill more Gazans", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-presstv08.htm", "message": "Rafah massacre: Resistance says US statements prompt Israel to kill more GazansIran Press TVWednesday, 29 May 2024 11:16 AMThe Palestinian resistance groups have condemned the recent statements made by the White House spokesman regarding Rafah carnage, saying the remarks prompt the Israeli regime to continue its aggression and acts of genocide in Gaza.\nMeanwhile, Israel has intensified its attacks on Rafah despite international condemnation.\nIsraeli forces targeted a tent camp in a designated \"safe zone\" west of Rafah and killed at least 21 people.\nThe invading forces pushed through Rafah on Wednesday as tanks were reported rolling into the centre of the city.\nGaza's Health Ministry said that at least 36,171 Palestinians have been killed and 81,420 wounded in Israeli attacks since October 7."}, {"id": "6d60cae1-4e4a-47e0-86c8-20e87729a778", "title": "  We Have Adapted and Adjusted  – Ukraine at War Update for May 30", "date": "2024-05-30 03:00", "url": "https://www.kyivpost.com/post/33480", "message": "Asked if he was supporting a change, Blinken was quoted by AFP as saying, “At every step along the way we’ve adapted and adjusted as necessary.\nSpecifically, Russian units recently marginally advanced north of Kharkiv, near Lyptsi amid continued ground assaults in the area on Wednesday.\nConfirmed footage posted that day seems to indicate that the invaders recently advanced within southeastern Hlyboke (north of Lyptsi and Kharkiv).\nRussian forces also recently made gains near Vovchansk, ISW continued.\nGeolocated footage published on Wednesday seems to show that Moscow’s troops have advanced within northeastern Starystya (northeast of Kharkiv)."}, {"id": "c4690bb8-0a1b-420b-b07d-c16960b31f07", "title": "NATO ally Erdogan blames US for Palestinian deaths in Gaza and denounces  vampire  Netanyahu | News", "date": "2024-05-30 02:45", "url": "https://gazette.com/news/wex/nato-ally-erdogan-blames-us-for-palestinian-deaths-in-gaza-and-denounces-vampire-netanyahu/article_3d9c67f8-6eb8-50a8-8707-4febaea3f845.html", "message": "Turkish President Recep Tayyip Erdogan, an important NATO ally, blamed the United States for a \"genocide\" in Gaza while labeling Israeli Prime Minister Benjamin Netanyahu a bloodthirsty \"vampire.\"\nErdogan made the comments in a speech to Turkey's parliament, speaking after a recent Israeli airstrike led to dozens of civilian deaths in Rafah.\nHis Wednesday remarks denouncing Israel and Netanyahu are his strongest yet, comparing the prime minister with a supernatural monster.\n\"The world is watching the barbarism of a sick man, a maniac, a psychopath, and a blood-feeding vampire called Netanyahu,\" Erdogan said.\n\"Israel is not just a threat to Gaza but to all of humanity,\" Erdogan said."}, {"id": "85920a7e-e89d-45aa-b328-c4a1e37127ff", "title": "N . Korea salvo might be part of sales pitch , South says", "date": "2024-05-30 11:15", "url": "https://www.illawarramercury.com.au/story/8646193/nkorea-salvo-might-be-part-of-sales-pitch-south-says/?cs=7484", "message": "The launches were the latest in a series of tests in 2024 by North Korea involving what analysts call \"theatre strike missiles\", or shorter-range weapons designed to hit targets within a region, as opposed to long-range missiles that might hit enemy cities on other continents."}, {"id": "74b4fd4e-e705-4a30-a743-706a90e34d22", "title": "Did Israel offer Iran a  compromise in Gaza  to avoid retaliation to embassy attack ? ", "date": "2024-05-30 13:15", "url": "https://www.theweek.in/news/world/2024/05/30/did-israel-offer-iran-a-compromise-in-gaza-to-avoid-retaliation-to-embassy-attack.html", "message": "Israel sent a message to Iran via Egypt that it was willing to compromise in Gaza if Tehran avoided a reaction to the attack on its embassy in Syria, according to Iran's semi-official media Tasnim news agency.\n\"Israel sent messages through Egypt's foreign minister that it will compromise in the war in Gaza to avoid Iran's retaliation\", Hajizadeh said, adding that Iran’s attack \"destroyed\" targeted Israeli military bases.\nIsrael's attack on the Iranian Embassy in Damascus, Syria, had pushed West Asia to the edge after Iran retaliated by sending explosive drones and missiles to Israel, its first direct attack on Israeli territory.\nHouthis get 'Ghadr'Tasnim said in another report that Tehran’s sea-launched ballistic missile 'Ghadr' has been made available to Yemen’s Houthis.\nInitially, after the attack, the Laax had listed its destination as Fujairah in the United Arab Emirates."}, {"id": "65b6db7b-33e4-49c3-b871-9ebd36a9b28e", "title": "Nana Oppong , one of the united kingdom most wanted fugitives arrested for murder . ", "date": "2024-05-30 09:30", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Nana-Oppong-one-of-the-UK-s-most-wanted-fugitives-arrested-for-murder-1933286", "message": "General News of Thursday, 30 May 2024Source: www.ghanaweb.comA high-level drug dealer and one of the UK's most wanted fugitives, Nana Oppong, was apprehended while attempting to enter Morocco, hidden in the back of a lorry.\nThe prosecution detailed how Oppong led a team of accomplices, including drivers and spotters, to carry out the murder.\nThe National Crime Agency named Oppong as one of the UK's most wanted fugitives.\nHis co-defendant, Israar Shah, 39, of Kelvedon Hatch, Essex, was also convicted of murder and firearm possession.\nThe court learned that other participants in the murder, including Temitope Adeyinka, known as 'Limo,' remain at large."}, {"id": "22f2a6af-6a36-448b-a81d-ba2e3375cffc", "title": "  All Eyes on Rafah : 44 Million Instagram Users , Global Celebrities Share AI Image To Draw Focus On Gaza Crisis", "date": "2024-05-30 06:00", "url": "https://www.news18.com/world/all-eyes-on-rafah-44-million-instagram-users-global-celebrities-share-ai-image-to-draw-focus-on-gaza-crisis-8909611.html", "message": "More than 44 million Instagram users have shared an AI-generated image with the caption “All eyes on Rafah” as of Thursday morning, according to a count by Instagram.\nThe area located near the Egyptian border Rafah has recently been subjected to bombing by Israeli forces.\nThe international community has criticised Israel for the deaths because Rafah was previously a humanitarian zone for civilians.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael’s retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory’s health ministry."}, {"id": "6e896d6d-eb64-4c18-a16b-15eeb29ecb3b", "title": "Woman arrested in stabbing at Emeryville Chick - fil - A", "date": "2024-05-30 00:30", "url": "http://www.sfchronicle.com/bayarea/article/woman-arrested-stabbing-emeryville-chick-fil-a-19485054.php", "message": "Jordan Parker is a breaking news reporter for The San Francisco Chronicle.\nHe graduated from Sacramento State University in May 2022 with a degree in journalism.\nDuring his time there, he spent three years as a reporter and editor for the university's award-winning student newspaper, The State Hornet.\nHe spent his senior year of college serving as The Hornet's first Black editor in chief, leading the organization to two Pacemaker awards and several other national honors from the Associated Collegiate Press.\nWhen he's not chasing down a story, he likes watching movies, traveling and trying new restaurants."}, {"id": "4662f518-8d72-42ff-82a1-24ac024e45e2", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 00:00", "url": "https://www.prokerala.com/news/articles/a1535334.html", "message": "Sanaa, May 30 : Houthi group has said it shot down an MQ-9 Reaper drone over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said on Wednesday in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months\".\nHe added that \"we will continue to develop our military defence capabilities to counter the US-British coalition aggression against our country\".\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone.\nIt has broadcasted videos of all previous operations, showing the debris of the drones."}, {"id": "5a5e45ba-2b70-4e01-be73-8e08f6800ef6", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 04:00", "url": "http://www.china.org.cn/world/2024-05/30/content_117223023.htm", "message": "视频播放位置 下载安装Flash播放器Houthi group said it shot down an MQ-9 Reaper drone on Wednesday over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months.\"\nHe added that \"we will continue to develop our military defense capabilities to counter the U.S.- British coalition aggression against our country.\"\n\"We will also continue to support the Palestine people against the Israeli aggression until the conflict and blockade stop,\" the spokesman stressed.\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone."}, {"id": "aab15087-6f60-446f-ba51-f042b755738e", "title": "Pier symbol of U dual approach to Gaza", "date": "2024-05-30 13:30", "url": "http://africa.chinadaily.com.cn/a/202405/30/WS66582d4ba31082fc043ca092.html", "message": "Paragliders pass above US troops working around vessels used for delivering aid to Palestinians via a new US-built pier in Gaza, May 25, 2024.\n[Photo/Agencies]A pier constructed by the Pentagon to deliver food to Gaza amid the Israel-Hamas war is a window on the United States' dual approach to the conflict — provide humanitarian aid to Palestinians and lethal weaponry to Israel.\nNow the $320 million pier has sustained severe weather damage and will need to be repaired.\nShe said the repairs will take \"at least over a week\", and then the pier will need to be anchored back into the beach in Gaza.\nAbout 1,000 American sailors and soldiers have been engaged in the pier mission, the Pentagon has said."}, {"id": "f4f23391-b000-42fb-8d06-0ee43e80af55", "title": "Israeli official expects war with Hamas to last until year end", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-voa01.htm", "message": "Israeli official expects war with Hamas to last until year's endBy VOA News May 29, 2024A top Israeli official said Wednesday that he expected Israel's war against Hamas in the Gaza Strip to last through the end of the year, amid continued calls for a cease-fire.\n\"We may have another seven months of fighting to consolidate our success and achieve what we have defined as the destruction of Hamas' power and military capabilities,\" national security adviser Tzachi Hanegbi told Israeli public radio.\nRafah violenceThe Israeli military said Wednesday that three of its soldiers were killed in the southern Gaza city of Rafah, where residents reported fresh Israeli attacks and Hamas said it fired rockets at the Israel Defense Forces, or IDF.\nIsraeli Prime Minister Benjamin Netanyahu has repeatedly said Israel needs to carry out the Rafah offensive to achieve its goal of ensuring Hamas cannot operate in Gaza and threaten Israel in the future.\nThe Israel-Hamas war was triggered by the October 7 Hamas terror attack on Israel that killed 1,200 people, according to Israeli officials, and led to the capture of about 250 hostages."}, {"id": "e2e0ffcd-a7a1-49a4-b7be-866e52169028", "title": "Man Pleads Guilty , Sentenced to 14 Years for DHS Hotel Stabbing", "date": "2024-05-30 04:00", "url": "https://mynewsla.com/crime/2024/05/29/man-pleads-guilty-sentenced-to-14-years-for-dhs-hotel-stabbing/", "message": "A man pleaded guilty Wednesday to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison.\nAnthony Rene Ayala, 30, pleaded guilty before Judge Jason Stone at the Larson Justice Center in Indio to assault causing great bodily injury and first-degree burglary, according to Riverside County District Attorney’s office spokesman John Hall.\nTwo other men charged in the case, 30-year-old Jose Luis Garcia and 32-year-old Moises Mazariegos, previously pleaded guilty to the same charges.\nThe stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department.\nAyala has two robbery convictions, Garcia has convictions for burglary and attempted robbery, and Reynaga and Mazariegos have convictions for burglary and robbery."}, {"id": "46558173-7185-4008-ac59-9576ac6b0c8a", "title": "Japan new super battlewagons set to be the most powerful surface warships in the world", "date": "2024-05-30 11:00", "url": "https://www.aol.co.uk/news/japan-super-battlewagons-set-most-102802451.html", "message": "The two ships could be huge – potentially the biggest surface warships in the Asia-Pacific region or even the world.\nAn Aegis Ashore can, in theory, knock down incoming ballistic missiles from hundreds of miles away.\nCommunities around the planned Japanese Aegis Ashore sites objected to spent SM-3 boosters raining down on their homes.\nWith protests intensifying, the Japanese government cancelled Aegis Ashore in June 2020 – and promptly pivoted to the ASEV project as an alternative.\nJapan had already spent $300 million on two SPY-7 radars for the ashore missile bases."}, {"id": "afbe07e2-e911-44a3-8123-f10445f4c046", "title": "Smotrich :  Israel must go to war in Judea and Samaria  ", "date": "2024-05-30 14:00", "url": "https://www.israelnationalnews.com/news/390807", "message": "Finance Minister Bezalel Smotrich visited the town of Bat Hefer following the Wednesday shooting there.\nDuring the visit, the Minister reached the point where the shooting occurred yesterday and spoke with the council heads and residents at the site.\nSmotrich said during the visit: \"Yesterday in the morning hours, terrorists from Tulkarm came not far from here and carried out a shooting.\nThe State of Israel must ensure the safety of the residents of Sharon and the safety of all citizens of Israel.\nHe addressed the residents and heads of the settlements and said: \"Tonight in the cabinet, I will put my full weight on this matter."}, {"id": "032fb1fa-8dfe-4b92-b29a-492dc16c97d4", "title": "Israel used U . S .- made bombs to kill dozens of civilians in Rafah , weapons experts reveal , after blast sparked international outcry", "date": "2024-05-30 06:45", "url": "https://www.dailymail.co.uk/news/article-13474831/Israel-used-bombs-kill-dozens-civilians-Rafah.html", "message": "The U.S. had been pushing for leaders in the Israeli military to use GBU-39 bombs more often because they are more precise and better suited to urban environments than larger bombs.\nEarlier this month, President Biden said the United States was pausing a delivery of the larger 2000-pound bombs that Israel often uses.\n'The strike was conducted using two munitions with small warheads suited for this targeted strike,' Rear Adm. Daniel Hagari, the Israeli military spokesman, said.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover."}, {"id": "334ef738-ea21-4485-bbb8-a4902ef6c6d4", "title": "US the big holdout in allowing Ukraine to hit Russia with Western weapons", "date": "2024-05-30 04:30", "url": "https://www.politico.eu/article/us-is-the-big-holdout-in-allowing-ukraine-to-hit-russia-with-western-weapons-zelenskyy-putin-biden-kharkiv-radars-missiles-macron-scholz/", "message": "“It is important that our partners have enough determination for preemptive protection against Russian terrorists, just as they would strike at any other terrorists — destroying them before they start taking lives,” President Volodymyr Zelenskyy said in a statement after Russian attacks on Kharkiv region last week.\nUkraine’s allies are listening.\nSo far, the U.K., Sweden, Finland, the Baltic countries, the Netherlands, Poland, the Czech Republic, Canada and others have said they have no problem with Ukraine's using their weapons to hit Russia.\nOn Tuesday, France and Germany also agreed — with caveats.\nNATO Secretary-General Jens Stoltenberg wants countries to reassess policies that “tie[] one hand of the Ukrainians on their back.”"}, {"id": "29757160-c01c-4d06-8089-1a4632b464f4", "title": "China defence ministry condemns US missile deployment in Philippines", "date": "2024-05-30 13:15", "url": "https://www.yahoo.com/news/chinas-defence-ministry-condemns-us-124912908.html", "message": "By Laurie Chen and Mikhail FloresBEIJING/MANILA (Reuters) - China's defence ministry on Thursday strongly condemned the deployment of a U.S. intermediate range missile system in the northern Philippines during military drills in April, saying it \"brought huge risks of war into the region\".\nDefence Ministry spokesperson Wu Qian told a press briefing in Beijing that China remained highly vigilant and opposed the deployment, the first in the Indo-Pacific region.\nThe U.S. said last month it had deployed its Typhon missile system to the Philippines as part of their Balikatan or \"shoulder-to-shoulder\" military drills.\nThe Philippines and U.S. military did not fire the missile system during the exercises, but Logico said it was shipped to test the feasibility of transporting the 40-ton weapon system by air.\nA Philippines military spokesperson could not be reached for comment on Thursday."}, {"id": "f4abefd6-5284-4f5f-9bd5-4ab43de7e008", "title": "Pop diva Dua Lipa condemns Israel for enabling genocide in Gaza", "date": "2024-05-30 03:30", "url": "https://economictimes.indiatimes.com/magazines/panache/pop-diva-dua-lipa-condemns-israel-for-enabling-genocide-in-gaza/articleshow/110548872.cms", "message": "London, May 29, 2024 -British-Albanian pop singer Dua Lipa has denounced Israel 's offensive in Gaza as a \" genocide \", after a new pro-Palestinian protest took place in London that saw dozens of people arrested.\n\"Burning children alive can never be justified.\nThe whole world is mobilising to stop the Israeli genocide\", the singer wrote on an Instagram story late Tuesday with the hashtag \"#AllEyesOnRafah\", which has been trending on social media.Israel's military operations in Gaza, concentrated now on Rafah , provoked a renewed backlash after Gaza officials said an Israeli strike this weekend set ablaze a crowded refugee camp, killing 45.American actor Pedro Pascal and model Bella Hadid also posted graphics with \"All eyes on Rafah\" on Instagram.\nShe had previously signed an open letter to US President Joe Biden calling for \"an end to the bombing of Gaza and the safe release of hostages\".Forty people were arrested on Tuesday night in London following a pro-Palestinian demonstration of up to 10,000 people, UK police said.Rock star Paul Weller, the rapper Stormzy and actor Tilda Swinton are among British celebrities who have previously called for a ceasefire in Gaza.\nHamas launched an unprecedented attack on October 7 that resulted in the deaths of 1,189 people, mostly civilians, according to an AFP tally based on Israeli official figures.Militants also took 252 hostages, 121 of whom remain in Gaza, including 37 the army says are dead.Israel's retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the territory's health ministry."}, {"id": "bb135217-41af-4c2c-9b34-7f0dd6d4fc79", "title": "North Korea missile salvo may be show for prospective customers , South says | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-30 10:45", "url": "https://www.asahi.com/ajw/articles/15286478", "message": "People watch a news program broadcasting a file image of a missile launch by North Korea, at the Seoul Railway Station in Seoul, South Korea, May 30, 2024.\nJapanese Prime Minister Fumio Kishida said North Korea had launched a ballistic missile that appeared to have landed outside Japan's exclusive economic zone.\nSouth Korea is sharing North Korean missile-related information with U.S. and Japanese officials, it added in the statement.\nNorth Korea has conducted several similar salvo launches of its KN-25 missile this year, including one test where it fired at least six missiles.\nThursday's launch came after North Korea failed on Monday at its attempt to put a second spy satellite into orbit when a newly developed rocket engine exploded in flight."}, {"id": "c675e3cb-ca6f-4a9e-b7e4-394bf6a3cf42", "title": "Mokwena : Ill never give up on Shalulile - Sport", "date": "2024-05-30 08:45", "url": "https://www.namibian.com.na/mokwena-ill-never-give-up-on-shalulile/", "message": "Sometime during the DStv Premiership campaign that has just ended, when many were declaring that Peter Shalulile had reached his sell-by date, coach Rulani Mokwena stood up for the striker.\nShalulile expressed his gratitude to coach and teammates as he looked ahead to Saturday’s Nedbank Cup final against Orlando Pirates at the Mbombela Stadium.\n“I had the support of my teammates, and the coach never gave up on me.\n“You know, I’ll say if you believe in yourself and if you know you are a good striker, you will never give up.\n“The best, CR7 (Cristiano Ronaldo), people thought he was done but he is breaking records and he still believes in himself."}, {"id": "36c9f48a-352a-4f0e-b31f-5e3069c54f5f", "title": "Day 237 of genocide : Dozens of civilians killed , others injured | World", "date": "2024-05-30 09:30", "url": "https://en.ammonnews.net/article/72958", "message": "Home WorldDay 237 of genocide: Dozens of civilians killed, others injuredAmmon News - At least seven civilians were killed and others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens’ homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire."}, {"id": "5ccf47fa-2f63-480e-a6c0-b8730e2e97d9", "title": "UN Security Council to convene this week over NK satellite launch : Seoul official", "date": "2024-05-30 03:30", "url": "https://www.koreaherald.com/view.php?ud=20240530050100", "message": "(Getty Images)The UN Security Council will convene an open meeting this week to discuss North Korea's recent launch of a military reconnaissance satellite that ended in failure, a Seoul official said Wednesday.\n\"The Security Council has a responsibility to protect global peace and security, defend the global nonproliferation regime, and uphold its resolutions,\" Evans said.\n\"The United States urges all Security Council members to take this responsibility seriously and unite in condemning the DPRK's dangerous and unlawful behavior.\"\nDPRK stands for the North's official name, the Democratic People's Republic of Korea.\nOn Tuesday, UN Secretary-General Antonio Guterres condemned the North's launch and called on Pyongyang to return to dialogue in a statement issued by his spokesperson, Stephane Dujarric."}, {"id": "7732d642-890f-4061-842e-920a6c7ec873", "title": "China Condemns U . S . Missile Deployment in Philippines Amid Military Drills", "date": "2024-05-30 14:00", "url": "https://www.devdiscourse.com/article/law-order/2955502-china-condemns-us-missile-deployment-in-philippines-amid-military-drills", "message": "China's defence ministry on Thursday strongly condemned the deployment of a U.S. intermediate range missile system in the northern Philippines during military drills in April, saying it \"brought huge risks of war into the region\".\nChina deploys its own advanced intermediate-range missiles as part of an extensive conventional ballistic missile arsenal.\nThe U.S. said last month it had deployed its Typhon missile system to the Philippines as part of their Balikatan or \"shoulder-to-shoulder\" military drills.\nThe Philippines and U.S. military did not fire the missile system during the exercises, but Logico said it was shipped to test the feasibility of transporting the 40-ton weapon system by air.\nA Philippines military spokesperson could not be reached for comment on Thursday."}, {"id": "724b33a7-6760-4b0b-8dd9-b15361496802", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 06:00", "url": "https://www.newdelhitimes.com/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions/", "message": "It advised civilians not to touch the objects flown from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nNorth Korea hasn’t commented on when it would be ready to attempt a satellite launch again, which some experts say could take months.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "df7eebac-4d97-4363-9004-a22eb7d46e82", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:00", "url": "https://www.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that."}, {"id": "76d8e47a-f940-4c46-b97b-3a579b1578be", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that."}, {"id": "36a385d5-43a8-42a3-b094-7f6b3fb168c4", "title": "Russia - Ukraine war : List of key events , day 825", "date": "2024-05-30 03:15", "url": "https://www.aljazeera.com/news/2024/5/30/russia-ukraine-war-list-of-key-events-day-825", "message": "Ukraine’s air force said its defence systems destroyed seven Russia-launched missiles and 32 drones overnight.\nThe commander said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details."}, {"id": "1dfc7429-dee0-48c1-879c-1baf42973cad", "title": "N . J . police union calls for  real consequence for rowdy teens on boardwalk", "date": "2024-05-30 02:15", "url": "https://www.pennlive.com/crime/2024/05/nj-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n“We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest."}, {"id": "ec4238b8-76dc-4ab7-89d0-6aa4b782726e", "title": "Syria says Israeli strike kills girl , wounds 10 civilians", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815135-Syria-says-Israeli-strike-kills-girl,-wounds-10-civilians", "message": "Syria says Israeli strike kills girl, wounds 10 civiliansWorld World Syria says Israeli strike kills girl, wounds 10 civiliansIsraeli air strike targeted a central site and a residential building in Baniyas city.\nThe Britain-based Observatory also said the Israeli strike on central Syria killed three Syrian fighters working with Lebanon's Iran-backed Hezbollah group and two other non-Syrian fighters working for the same movement.\nEarlier on Wednesday, state media said air defences intercepted Israeli \"targets\" over central Syria.\nThe Observatory said the Israeli strikes targeted \"at least one military site... in the eastern countryside of Homs, causing plumes of smoke to rise\".\nOn Saturday, an Israeli drone strike in central Syria, near the border with Lebanon, killed two Hezbollah fighters, the Observatory had said."}, {"id": "021766d2-9c37-4b79-9e88-12bf4d4a6dfd", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after Jersey Shore boardwalk unrest – NBC New York", "date": "2024-05-30 04:00", "url": "https://www.nbcnewyork.com/news/local/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-jersey-shore-boardwalk-unrest/5458273/", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest."}, {"id": "c99690c2-e924-4e58-9bc0-8178738b37d1", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 12:30", "url": "https://www.scmp.com/news/world/middle-east/article/3264749/rafah-battles-intensify-israel-takes-over-gaza-egypt-border-strip-cut-smuggling-tunnels", "message": "The Israeli military launched its incursion into Rafah in early May, despite international objections over the fate of Palestinian civilians sheltering there.\nRafah residents reported intense artillery shelling and gunfire on Thursday in Gaza’s far-southern city after Israel said it had seized a strategic corridor on the Palestinian territory’s border with Egypt.\nIsraeli soldiers during military operations in a border area in the southern Gaza Strip.\nPalestinians fleeing with their belongings ride atop their vehicle in Rafah in the southern Gaza Strip.\nThe United States has been among those nations urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians."}, {"id": "0bd703e0-03b7-4575-90e8-35d7b9e9c040", "title": "Western Leaders Depending on Putin To Avoid WWIII", "date": "2024-05-30 00:30", "url": "https://sputnikglobe.com/20240529/the-west-depends-on-putins-rationality-to-avoid-wwiii-1118692662.html", "message": "https://sputnikglobe.com/20240529/the-west-depends-on-putins-rationality-to-avoid-wwiii-1118692662.htmlThe West Depends on Putin’s Rationality to Avoid WWIIIThe West Depends on Putin’s Rationality to Avoid WWIIISputnik InternationalWestern countries are depending on Russian President Vladimir Putin's rationality to avoid World War III, as they continue to escalate in Ukraine.\n2024-05-29T22:40+00002024-05-29T22:40+00002024-05-30T04:29+0000analysisvladimir putinmark slebodarussiaukrainekievnatonuclear warworld war iiifault lineshttps://cdn1.img.sputnikglobe.com/img/07e8/05/1c/1118669563_0:0:3140:1767_1920x0_80_0_0_156d3dfce5937fb9b4a1e55b2e9ef887.jpgWhile Ukrainian military officials insisted they needed permission to strike inside Russia to counter coming Russian attacks in the Kharkov region, it has since used Western weapons to attack targets irrelevant to the special military operation.Over the past week, Ukraine claimed that it struck two Russian early warning radar systems designed to detect long-range ballistic missile attacks, including nuclear strikes.\nNeither system that was targeted was turned toward Ukrainian territory, which seems to implicate an alternative motive than affecting the Ukrainian theater.The attack represented a significant escalation of the conflict and came as NATO countries toyed with the idea of sending their troops to Ukraine to fill Kiev’s manpower shortage.Since Russia has proven more than capable of defeating NATO equipment and tactics on the battlefield, it has little reason to fear a conventional land war against NATO countries in Ukraine, but that could easily spiral into a nuclear war which forces any rational actor to behave with caution.“NATO representatives, especially in Europe, should be aware of what they are playing with,” Putin said at a press conference in Uzbekistan on Tuesday.Western countries don’t fear allowing Kiev to strike inside of Russia because they already have and those countries didn’t suffer any significant consequences, noted Sleboda.On Wednesday, the Head of the Delegation of the Russian Federation to the Vienna Negotiations on Military Security and Arms Control, Konstantin Gavrilov warned that “A potential aggressor needs to realize that, if attacked, we reserve the right to act ‘as the situation demands,’ so to speak, and use all our capabilities,” adding that any response to violating Russian redlines “may be truly devastating.”With its numerous successes on the battlefield over the past several months Russia has no reason to seek escalation, but Western countries continue to try to provoke Russia into a wider war despite the consequences it could hold for all of civilization.A recent study by Nature estimated that a nuclear war between the United States and Russia would result in around 5 billion deaths worldwide.\nhttps://sputnikglobe.com/20240528/poland-not-excluding-sending-troops-to-ukraine-in-future---foreign-ministry-1118662023.htmlrussiaukrainekievSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Ian DeMartinoIan DeMartinoNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Ian DeMartinoworld war iii, will ukraine cause world war 3, who wins world war 3, nato escalations in ukraine, nato troops in ukraine, french mercenaries in ukraine, russian early warning radar, ukraine strikes inside russia"}, {"id": "c0bf3525-bc69-42c5-98dd-df36a3f2dc45", "title": "NJ police union calls for  real consequence after Jersey Shore boardwalk unrest", "date": "2024-05-30 01:45", "url": "https://www.fox5ny.com/news/new-jersey-police-union-calls-real-consequences-drunk-rowdy-teens-after-boardwalk-unrest", "message": "Peter Andreyev, president of the New Jersey State Policemens' Benevolent Association, issued a statement calling for changes in laws and procedures governing how police interact with disorderly teens and young adults.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We wholeheartedly support the city of Wildwood Police Department in protecting this community from these nuisance crowds on our boardwalk and in the city.\""}, {"id": "86852d3b-73e4-4052-8b8b-a8965873df2a", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-warns-war-in-gaza-may-extend-seven-more-months/articleshow/110548309.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelTel Aviv [Israel]: An Israeli official cautioned Wednesday that the war in Gaza might persist until the year's end, casting doubt on hopes that the fighting would cease after the military operation against Hamas in Rafah CNN reported.Tzachi Hanegbi, Israel 's national security adviser, indicated that 2024 had been designated a \"year of combat \" by Israel's war cabinet.\n\"We are now in the fifth month of 2024, which means we expect another seven months of fighting to deepen our achievements and achieve our goal of destroying the military and governmental capabilities of Hamas and Islamic Jihad,\" Hanegbi stated.These remarks come as Israeli tanks, spotted in central Rafah for the first time since the operation commenced, continued to advance on the southern Gaza city on Wednesday.\nThis action persists despite mounting global pressure to halt the offensive , as reported by CNN.Initially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nHe urged patience and resilience, cautioning against setting ultimatums, according to CNN.Meanwhile, Israel persists with its military offensive despite growing global outrage, triggered by an Israeli airstrike on Sunday that killed at least 45 people and injured 200 others in Rafah at a camp for displaced people, previously designated as a safe zone.Footage from the Tal al-Sultan camp depicted scenes of horror, with charred bodies extracted from rubble and a man holding the headless body of a child amidst raging fires.Despite calls for reconsideration, US President Joe Biden has maintained his stance on Israel, indicating that the Rafah strike had not yet crossed a red line warranting alterations in American support.The strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported."}, {"id": "4da541dc-16a6-4c14-afad-c3978450b5c1", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:45", "url": "https://www.dnaindia.com/world/report-israel-warns-war-in-gaza-may-extend-seven-more-months-3091201", "message": "Israel warns war in Gaza may extend seven more monthsInitially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\nIn response, Israel launched a devastating offensive in Gaza, claiming the lives of over 36,000 people, according to Palestinian officials.\nThe strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported."}, {"id": "ec1ba005-cb34-46a6-bc85-3754047b7658", "title": "Russian Air Defense Downs Ukrainian Drone , 7 Grad Rockets Over Belgorod Region", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240529-sputnik05.htm", "message": "Russian Air Defense Downs Ukrainian Drone, 7 Grad Rockets Over Belgorod RegionSputnik News20240529MOSCOW (Sputnik) - Russian air defense systems destroyed a Ukrainian unmanned aerial vehicle (UAV) and seven Grad multiple rocket launcher system (MLRS) shells over the Belgorod Region, the Russian Defense Ministry said on Wednesday.\n\"Air defense systems on duty destroyed one UAV and seven Grad MLRS rockets over the territory of the Belgorod Region,\" the ministry said.\nThe ministry added that an attempted terrorist attack by Kiev regime \"against facilities on the territory of Russia was foiled.\"\nThe Russian air defense also destroyed a drone over Russia's Krasnodar Territory, the regional governor, Veniamin Kondratyev, said.\nA UAV was destroyed by air defense forces over [the city of] Armavir,\" Kondratyev said on Telegram."}, {"id": "94c13a8a-3259-4a0e-a2c4-6962355b5167", "title": "Pakistan : Terrorists torch girl  middle school in North Waziristan", "date": "2024-05-30 06:30", "url": "https://news.webindia123.com/news/Articles/Asia/20240530/4201651.html", "message": "Some unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan destroying furniture, computers and books, police said on Wednesday, Dawn reported.\nAbrar, a member of Shakhimar Welfare Organisation, told Dawn the school was constructed by an organisation along with Pakistan Army''s 7th Division in 2020.\nOn May 9, terrorists set fire to a girls'' private school in the Shawa area of South Waziristan.\nSimilarly, on May 17, unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan.\nAround 500 girls were enrolled in the two schools, Government Girls Middle School Noor Jannat and Government Girls Middle School Yunus Kot which were targeted by the attackers around midnight."}, {"id": "3ba9d60f-081a-4453-abe5-428dc7ad81de", "title": "Caledonia man indicted in stabbing investigation", "date": "2024-05-30 02:30", "url": "https://www.wcbi.com/caledonia-man-indicted-in-stabbing-investigation/", "message": "Caledonia man indicted in stabbing investigationLOWNDES COUNTY, Miss.\n(WCBI) – A Caledonia man was indicted in a stabbing investigation.\nA Lowndes County grand jury recently returned the indictment against him.\nProsecutors alleged Umfress stabbed the victim multiple times.\nFor 24/7 news and updates, follow us on Facebook and X"}, {"id": "8af4fc20-f1bb-489a-bfd7-337d7d587d66", "title": "Ukraine to Get Sweden AWACS in First Airborne Radar Donation", "date": "2024-05-30 01:30", "url": "https://theaviationist.com/2024/05/29/ukraine-to-get-swedish-awacs/", "message": "ASC890 Will Boost SurveillanceAccording to Jonson, the ASC (Airborne Surveillance Control) 890 will lend a “military capability” that will “strengthen Ukraine’s air defense.” Called “Package 16,” it will be the “largest Swedish military aid package at Euro 1.16 Billion.\nThe ASC890 Erieye is the name of the airborne radar system, mounted on the Saab 340B twin-engine turboprop aircraft.\nThe Swedish AWACS can fly from close to western and northwestern Ukraine to detect possible Russian land-strike missiles before the F-16s take off.\nThese aircraft help Ukraine collect a lot of data on Russian ground radar placements before its UAV and Storm Shadow ALCM strikes into Russia’s rear or in Crimea.\nFurthermore, Ukraine’s command and control capability will be strengthened in the package through a donation of terminals with subscriptions for satellite communications."}, {"id": "42b0fc46-ba7f-4408-992b-6afa398727b8", "title": "Israel undermines goals by harming civilians in Gaza , US tells UN - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836543/israel-undermines-goals-by-harming-civilians-in-gaza-us-tells-un", "message": "“The continued pattern of significant civilian harm resulting from incidents like Sunday’s airstrikes undermines Israel’s strategic goals in Gaza,” deputy US Ambassador to the UN Robert Wood told the 15-member council.\nAn airstrike on Sunday set off a blaze in a tent camp in Rafah in southern Gaza, killing at least 45 people.\nIsrael — a US ally — said it had targeted Hamas militants and had not intended to harm civilians.\nOn Wednesday, Wood told reporters that Washington was reviewing it, but UN action was unlikely to be helpful or change the situation on the ground.\nHamas chooses to exploit the civilians of Gaza as human shields,” he told the council."}, {"id": "66e5b405-3928-4ffd-888c-3dcd0db57b0e", "title": "London shooting : Four wounded , including child , in Hackney | united kingdom | News", "date": "2024-05-30 03:00", "url": "https://www.express.co.uk/news/uk/1905183/london-shooting-hackney-four-wounded-child", "message": "Police were called following an incident in London.\nThree adults and a child have suffered serious injuries following a shooting near to a restaurant in Hackney, London.\nA major police operation was launched following an incident on Kingsland High Street, Dalston just after 9.20pm on Wednesday.\nThe Metropolitan Police confirmed all four had suffered \"gunshot injuries\" and were rushed to an east London hospital.\nOfficers have not yet arrested anyone in connection with the attack."}, {"id": "0ac91e9d-87cb-4ca7-be21-9575968c0464", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 09:30", "url": "https://www.digitaljournal.com/world/rafah-battles-intensify-as-israel-takes-over-gaza-egypt-border-strip/article", "message": "The Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken “operational control” of the narrow border area, where he said troops had “discovered around 20 tunnels”.\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nThe United States has been among the countries urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nThe New York Times and CNN, citing weapons experts and analysis of video from the scene of the weekend Rafah strike, reported that the bomb believed to have started the fatal fire was a US-made GBU-39 guided munition."}, {"id": "75329eec-b65c-4df3-96ea-3aa28e743a51", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:00", "url": "https://www.koaa.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "448af431-416a-4b86-ae40-b809a964e5d7", "title": "AGM - 88 HARM Missile : Designed to Destroy Radar in a China or Russia War", "date": "2024-05-30 12:00", "url": "https://nationalinterest.org/blog/buzz/agm-88-harm-missile-designed-destroy-radar-china-or-russia-war-210817", "message": "-As adversaries like China rapidly modernize their military capabilities, the AGM-88 HARM becomes increasingly crucial for maintaining a tactical advantage, particularly in the Indo-Pacific region.\n-Its deployment on various aircraft ensures that U.S. forces can effectively counter advanced air defense threats and establish air superiority.\nAGM-88 HARM: America's Answer to Advanced Air Defense Systems\"In 2024, air power remains probably the most important aspect of modern, large-scale warfare.\nAGM-88 HARM: Radar, Here I ComeThe AGM-88 High-Speed Anti-Radiation Missile (HARM) is an air-to-ground munition designed to take out enemy air defenses.\nWhat makes the AGM-88 HARM particularly useful is its ability to detect, attack, and destroy a target with minimum interaction by the aircrew."}, {"id": "9d4b16aa-19dd-4768-810f-2b1a2dc8b7a0", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 10:45", "url": "https://www.al-monitor.com/originals/2024/05/rafah-battles-intensify-israel-takes-over-gaza-egypt-border-strip", "message": "May 30, 2024 — Rafah (Palestinian Territories) (AFP)Rafah residents reported intense artillery shelling and gunfire Thursday in Gaza's far-southern city after Israel said it had seized a strategic corridor on the Palestinian territory's border with Egypt.\nThe Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nA steady stream of civilians have fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts.\nThe United States has been among those nations urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nHowever, the White House said Tuesday that so far it had not seen Israel cross President Joe Biden's \"red lines\"."}, {"id": "b6fb7883-46df-4884-b007-1f1c6ad0fc8e", "title": "Hollywood Makeup Artist Allie Shehorn Allegedly Stabbed By Actor Ex Nick Pasqual", "date": "2024-05-30 14:00", "url": "https://www.etonline.com/hollywood-makeup-artist-allie-shehorn-allegedly-stabbed-by-actor-ex-nick-pasqual-226366", "message": "Actor Nick Pasqual has been charged in the brutal stabbing of Allie Shehorn, a Hollywood makeup artist and Pasqual's alleged ex-girlfriend.\nAccording to the Los Angeles County District Attorney's Office, Shehorn had previously filed a restraining order against Pasqual days before the alleged attack.\nPasqual allegedly broke into Shehorn's home early in the morning on May 23 and stabbed her multiple times.\n- YouTubeThe District Attorney's office claims that Pasqual allegedly \"fled the scene\" and was detained at the U.S./Mexico border in Texas.\n\"My thoughts and heartfelt sympathies are with the victim in this horrific incident,\" District Attorney Gascón said in a statement."}, {"id": "1c690092-6e75-4abb-a2fc-f51b5e222f3a", "title": "Job recruitment in Ireland is taking on some of the worst aspects of dating app culture", "date": "2024-05-30 09:30", "url": "https://www.irishtimes.com/business/work/2024/05/30/job-recruitment-in-ireland-is-taking-on-some-of-the-worst-aspects-of-dating-app-culture/", "message": "“It’s amazing that people have still not figured out that candidates’ number one complaint is that they never hear back; half of job seekers say that’s still happening,” he says.\n[ Here’s a cautionary tale from a seasoned senior manager’s recent job interview ]Employees want to move.\nAnother practice getting the thumbs down from job seekers is “baiting”, which attracts a candidate to take a job based on the advertised criteria.\nToday’s job seekers are more than willing to share their experiences on public forums.\nWhat was also eye-opening about the Greenhouse survey was that the mistakes don’t stop at the application stage."}, {"id": "24755765-6a87-4706-8541-01de04e3fe4f", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:15", "url": "https://www.smh.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "43c0f709-4e6f-4ef8-a86f-0e0f2a86d4c5", "title": "NATO countries will create a  drone wall  using thousands of UAVs", "date": "2024-05-30 13:30", "url": "https://www.dailymail.co.uk/news/article-13475551/NATO-countries-create-drone-wall-using-thousands-UAVs-patrol-alliances-eastern-border-monitor-threats-Russia-Belarus-Europe-warned-returned-darkest-days-Cold-War.html", "message": "The nation's protective umbrella of air defence is created using kit from all three military services.\nWithin the navy's fleet, high-end warships are equipped with Sea Viper and Sea Ceptor guided missile systems to destroy targets at range.\nThey are armed with the Sky Sabre missile system, which can simultaneously destroy 24 different targets travelling at supersonic speeds.\nSome 21 countries have signed up to the initiative, including non-NATO members, which is designed to build an integrated air and missile defence system across the continent.\nIt aims to cut costs for countries by coordinating their procurement of air and missile defence systems such as the Patriot missile system."}, {"id": "80fea252-b69f-41ce-a1f5-a1f1d31897c6", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:30", "url": "https://www.theage.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "21803d02-a499-49cd-b9a2-4ec948faf2f4", "title": "Married At First Sight star points out the major problem with All Eyes On Rafah social media campaign :  Dont kid yourselves  ", "date": "2024-05-30 06:00", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13474705/Married-Sight-star-points-major-problem-Eyes-Rafah-social-media-campaign-Dont-kid-yourselves.html", "message": "A Married At First Sight bride has pointed out a major problem with social media influencers urging people to pay attention to Israel's ongoing conflict in Gaza.\nHayley Vernon, who appeared on the Channel Nine dating show in 2020, took to her social media to weigh in with her views.\n'Everyone posting all eyes on Rafah - who is actually donating, helping offering any kind of support even on an international level - posting an Instagram post isn't doing anything.\nThe phrase 'All Eyes on Rafah' has gained momentum on social media throughout the last few months.\nMatt Navarra, a social media consultant and industry analyst, told NBC: 'The trend of posting 'All Eyes on Rafah' has been something that has been building for a little while."}, {"id": "05754e58-afa3-41bf-ad20-c7382554b520", "title": "Mexican Mayoral candidate shot dead at campaign rally days before election", "date": "2024-05-30 11:00", "url": "https://www.dailyexcelsior.com/mexican-mayoral-candidate-shot-dead-at-campaign-rally-days-before-election/", "message": "Mexico City , May 30 : As Mexico sees a rise in attacks ahead of elections”>general elections, a mayoral candidate has been shot dead at a campaign rally in Mexico’s southern Guerrero state, reported Al Jazeera.\nA video shared by local media showed a person approaching him at the campaign event and shooting him several times at point-blank range.\nEarlier on Tuesday, the Mexican government said that at least 22 people running for local office had been murdered since last September.\nA mayoral candidate in the central state of Morelos was murdered on Tuesday, while another one was shot and wounded in western Jalisco state, the authorities said.\nMoreover, about 27,000 soldiers and National Guard members will be deployed to reinforce security during Sunday’s elections, according to Al Jazeera."}, {"id": "5bb7a51e-c717-4497-8f90-eb8f5f25899e", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:15", "url": "https://www.watoday.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "139a4ed1-328b-4f42-b6b1-4b03ecfde79a", "title": "  Dozens killed in fresh Israeli attacks on Rafah  Says Palestinian medics", "date": "2024-05-30 08:45", "url": "https://www.sentinelassam.com/more-news/international/dozens-killed-in-fresh-israeli-attacks-on-rafah-says-palestinian-medics", "message": "Gaza: Palestinian medics have said dozens of people have died in fresh Israeli attacks on the southern Gaza city of Rafah on Tuesday, two days after 45 people were reportedly killed in an airstrike which sparked international condemnation.\nThe Israeli military said it was investigating reports of an attack on a shelter for displaced persons in western Rafah.\nEarlier on Tuesday, a spokesman for the Hamas-run health authority in Gaza said a further 18 people were killed overnight in separate Israeli attacks in Rafah.\nEyewitness reports from Rafah on Tuesday suggested the Israeli army has advanced into the city centre.\n(IANS)Also Read: Gaza: ‘All Eyes on Rafah’ Campaign Gains Momentum Amidst Israeli Offensive In RafaAlso Watch:"}, {"id": "6f459937-8442-4674-9784-dfad2d38647c", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 03:30", "url": "https://www.brisbanetimes.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "0846cbda-5196-42af-ae45-120f4558410e", "title": "Live updates : Israel - Hamas war in Gaza , Rafah offensive draws global outcry", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-30-24/", "message": "The Israeli military says it has established “operational control” over the Philadelphi Corridor, a 14-kilometer (8.7-mile) buffer zone on the Egypt-Gaza border.\n“In the last few days, Israel established operational control over the Philadelphi Corridor,” Israel Defense Forces (IDF) spokesperson Daniel Hagari said at a press briefing on Wednesday.\nThe official said the 20 tunnels crossed into Egypt, some of which are new, and Egypt has been informed.\nHagari said this route was used to transfer weapons and that the Israeli military found and destroyed weapons there.\nOn Monday, an Egyptian security personnel was killed on the border with Gaza in a shooting that involved Egyptian and Israeli soldiers."}, {"id": "089cf086-b2ef-4c97-9cf0-ee42898569a4", "title": "Hezbollah targets Israeli army position in northern occupied Palestine", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-irna03.htm", "message": "Hezbollah targets Israeli army position in northern occupied PalestineIRNA - Islamic Republic News AgencyMay 29, 2024Tehran, IRNA -- Lebanon's Hezbollah has once again targeted the gathering of the Zionist military in northern occupied Palestine.\nIn a statement on Wednesday, Hezbollah's war media confirmed the attack, which targeted the northern area of occupied Palestine.\nAccording to this statement, after monitoring the movements of the Zionist forces in ​​Beyaz Belida, Hezbollah fighters targeted them with artillery shells.\nLebanon's Hezbollah targeted another Zionist army base in northern occupied Palestine with a guided missile on Tuesday.\nHezbollah announced on Tuesday that it had targeted and damaged the Ramiya military base in northern occupied Palestine near the Lebanese border."}, {"id": "9923e3c9-554f-40e3-b549-ee250987dd93", "title": "  All eyes on Rafah  image shared 44 million times online", "date": "2024-05-30 03:30", "url": "https://economictimes.indiatimes.com/magazines/panache/all-eyes-on-rafah-image-shared-44-million-times-online/articleshow/110549015.cms", "message": "Paris, May 30, 2024 -An AI-generated image bearing the words \"All eyes on Rafah \" has been shared by more than 44 million Instagram accounts since Monday after a deadly Israeli strike at a camp for displaced Palestinians in the Gazan city.The image depicts densely packed rows of tents stretching endlessly across a desert landscape overshadowed by mountains, alluding to the hundreds of thousands of Palestinians who fled there during Israel's military campaign against Hamas Chilean-US actor Pedro Pascal, top models Bella and Gigi Hadid, who are of Palestinian descent, and French football star Ousmane Dembele are among the celebrities to have shared it on Instagram.The platform, formerly Twitter , has also seen 27.5 million messages published in three days about the attack on the southern Gazan city bordering Egypt that generated international outrage.\nGaza 's Hamas-run health ministry said an Israeli strike on the camp that sparked a fire on Sunday killed 45 people and injured 249.Israel's military said it had targeted and killed two senior Hamas militants, with Prime Minister Benjamin Netanyahu speaking of a \"tragic accident\" that his government was investigating.The deadliest Gaza war was sparked by Hamas's unprecedented October 7 attack on southern Israel which resulted in the deaths of 1,189 people, mostly civilians, according to an AFP tally based on Israeli official figures.Militants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.Israel's retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory's health ministry.bur-ac/imm/rlp"}, {"id": "6ae3fd54-264b-47dd-955d-85cec498230b", "title": "Filipino crew members in Houthi - attacked ship safe DMW", "date": "2024-05-30 01:30", "url": "https://www.philstar.com/headlines/2024/05/30/2358950/filipino-crew-members-houthi-attacked-ship-safe-dmw", "message": "Filipino crew members in Houthi-attacked ship safe — DMWForces loyal to the Huthi rebels in Yemen participate in a military parade on the occasion of the 34th National Day to commemorate Yemeni unity, in Sanaa, on May 22, 2024.\nMANILA, Philippines — Thirteen of the Filipino crew members of a vessel attacked by Yemen-based Houthi rebels are safe, the Department of Migrant Workers said on Wednesday.\nAmong the crew of the vessel aside from Filipinos is a Ukrainian, according to the agency.\n“The DMW is communicating with the shipping and manning agencies, monitoring the safety and condition of our Filipino seafarers,” DMW’s press release read.\n“The DMW is also contacting the crew members' families to provide any assistance they may need,” it added."}, {"id": "62ee687f-61e8-4fa9-bce0-c78bfbed6c82", "title": "At rally outside CT Capitol , pro - Palestinian groups pledge to keep fighting for Gaza", "date": "2024-05-30 14:30", "url": "https://www.nhpr.org/2024-05-29/ct-groups-say-they-will-flood-hartford-to-protest-israeli-air-strike-on-rafah", "message": "Hundreds of people gathered in front of Connecticut’s Capitol Wednesday night for what they said was “an emergency call to action” to end Israel’s military offensive in Gaza.\nThis comes after the Israeli Defense Forces' (IDF) latest attack on the city of Rafah, and the worsening humanitarian crisis in Gaza.\nThis is only going to lead to more and more violence.”Wednesday’s event follows another protest in support of Palestine held May 8 outside the state Capitol.\nThe next rally is planned for Saturday at 5 p.m. on the New Haven Green.\nMark Mirko / Connecticut Public A pro-Palestinian protestor waves a Palestinian flag during a rally outside Connecticut’s Capitol building, May 29, 2024."}, {"id": "0b373313-9d6e-462d-bd67-1a4153633682", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 13:00", "url": "https://uk.news.yahoo.com/israeli-airstrike-rafah-kills-12-123550696.html", "message": "Palestinians inspect the damages after Israeli forces withdrew from a part of Jabalia refugee camp, in the northern Gaza StripBy Dan WilliamsJERUSALEM (Reuters) - Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nGaza medical sources said the 12 Palestinians, whom it said were civilians, had been killed and an unspecified number of others wounded in an Israeli airstrike as they tried to recover the body of a civilian in the centre of Rafah.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of the densely populated enclave, the medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood."}, {"id": "e30811ef-59f9-4c30-8b76-28cc4cc72817", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after boardwalk unrest", "date": "2024-05-30 01:00", "url": "https://buffalonews.com/news/national/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest/article_b76a465d-d1ae-5e09-ac64-ca22a1d681dc.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest."}, {"id": "d174a5cc-187e-4726-b0d0-c43dda902a25", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 14:00", "url": "https://www.swissinfo.ch/eng/israeli-airstrike-on-rafah-kills-12-palestinians%2c-gaza-medics-say/79125594", "message": "Israeli airstrike on Rafah kills 12 Palestinians, Gaza medics sayreuters_tickers5 minutesBy Dan WilliamsJERUSALEM (Reuters) – Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nGaza medical sources said the 12 Palestinians, whom it said were civilians, had been killed and an unspecified number of others wounded in an Israeli airstrike as they tried to recover the body of a civilian in the centre of Rafah.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of the densely populated enclave, the medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood."}, {"id": "9c44f0d0-8c54-48e1-8c4c-e943fb47b2db", "title": "Academic workers on strike in support of Palestinians - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836544/academic-workers-on-strike-in-support-of-palestinians", "message": "This came as ‘academic workers’ staged a strike on campus, protesting UCLA’s response to the violence.\nThey were joined by fellow academic workers at two other University of California campuses’, UC Davis (near Sacramento) and UC Santa Cruz, where the protest strike began on the 20 of May.\nStrikers demand amnesty for graduate students and staffers facing disciplinary action for previous protestsThe strikers are demanding amnesty for graduate students and other academic workers, who were arrested and/or faced with disciplinary charges, for their involvement in the protests.\nThe UAW local includes about 6,400 academic workers at UCLA, 5,700 at Davis and about 2,000 at Santa Cruz.\nSeveral hundred people attended a march and a midday rally, within the UCLA campus on Tuesday."}, {"id": "d91b5743-c5aa-4b1e-81a8-6ab2efa65843", "title": "North Korea launches flurry of ballistic missiles into East Sea", "date": "2024-05-30 03:15", "url": "https://www.yahoo.com/news/north-korea-launches-flurry-ballistic-024529289.html", "message": "North Korea launched around 10 short-range ballistic missiles into the East Sea on Thursday morning, South Korea's military said.\nPhoto by YonhapMay 29 (UPI) -- North Korea fired around ten short-range ballistic missiles toward the East Sea early Thursday morning, Seoul's military said, one day after floating hundreds of balloons carrying trash and manure across the inter-Korean border.\nHawaii-based U.S. Indo-Pacific Command said it was aware of the launch and is consulting with South Korea and Japan.\nThe Democratic People's Republic of Korea is the official name of North Korea.\nNorth Korea also conducted a GPS jamming attack for a second day, the JCS said in a separate message."}, {"id": "70e6fb42-32a1-43ac-98fe-4ffa4bdb9635", "title": "North Korea launches flurry of ballistic missiles into East Sea", "date": "2024-05-30 04:00", "url": "https://www.upi.com/Top_News/World-News/2024/05/29/North-Korea-short-range-ballistic-missile-launch-East-Sea-JCS/1641717035896/", "message": "North Korea launched around 10 short-range ballistic missiles into the East Sea on Thursday morning, South Korea's military said.\nPhoto by YonhapMay 29 (UPI) -- North Korea fired around ten short-range ballistic missiles toward the East Sea early Thursday morning, Seoul's military said, one day after floating hundreds of balloons carrying trash and manure across the inter-Korean border.\nHawaii-based U.S. Indo-Pacific Command said it was aware of the launch and is consulting with South Korea and Japan.\nAdvertisementThe Democratic People's Republic of Korea is the official name of North Korea.\nNorth Korea also conducted a GPS jamming attack for a second day, the JCS said in a separate message."}, {"id": "0a000956-f02c-4f21-a678-69b5be1bdad0", "title": "Rio Grande City man pleads guilty in grandfather stabbing death", "date": "2024-05-30 03:15", "url": "https://www.krgv.com/news/rio-grande-city-man-pleads-guilty-in-grandfather-s-stabbing-death/", "message": "A 31-year-old Rio Grande City man faces a 40-year prison sentence after pleading guilty in connection with the stabbing death of his grandfather, according to Starr County District Attorney Gocha Ramirez.\nREAD MORE: Rio Grande City man accused in stabbing death of grandfatherOfficers responding to the scene found 81-year-old Joseph Seale dead inside the residence.\nAccording to Rio Grande City Police Chief Noe Castillo, Villalon stabbed Seale following an argument.\nVillalon pleaded guilty to the murder charge on Wednesday as part of a plea agreement, Ramirez said.\nThe defendant has agreed to plead guilty to the murder charge, with the State recommending a 40-year prison sentence.\""}, {"id": "f0ab4ca8-aeba-4658-aa76-dda81ee403f7", "title": "  All eyes on Rafah  image shared 44 mn times online", "date": "2024-05-30 01:45", "url": "https://www.al-monitor.com/originals/2024/05/all-eyes-rafah-image-shared-44-mn-times-online", "message": "May 29, 2024 — Paris (AFP)An AI-generated image bearing the words \"All eyes on Rafah\" has been shared by more than 44 million Instagram accounts since Monday after a deadly Israeli strike at a camp for displaced Palestinians in the Gazan city.\nThe slogan \"All eyes on Rafah\" has also been widely shared in other publications and social networks, especially X, where the hashtag #alleyesonrafah has attracted almost one million hits, according to online monitor Visibrain.\nGaza's Hamas-run health ministry said an Israeli strike on the camp that sparked a fire on Sunday killed 45 people and injured 249.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael's retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory's health ministry."}, {"id": "f51a3257-bb64-4f9b-84d3-e66cd28febf4", "title": "  All Eyes On Rafah  Pic Was Likely Generated By AI And 1st Shared By ... ", "date": "2024-05-30 07:15", "url": "https://www.ndtv.com/world-news/real-or-ai-generated-whats-the-truth-behind-all-eyes-on-rafah-image-5776694", "message": "The image shows the words \"All Eyes On Rafah\" spelt out in rows of white tents with a backdrop of mountains in the distance.\nReality of viral imageUnlike other graphic images and videos emerging from Gaza, the latest image is likely to have been generated with the help of AI, according to experts.\nOn social media, the image has even been criticised by some for replacing the \"fake\" one with the distressing footage of what has been happening in Gaza.\nMatt Navarra, a social media expert, noted that the uncontroversial nature of the post might be the reason behind its massive reach.\nHe further pointed out that the social media platform has not yet labelled the viral image to let users know it was produced with the help of AI."}, {"id": "464ddaf4-0b01-480c-8ede-6b26e2d8edaf", "title": "Montreal Jewish school hit by at least 1 bullet , police say - Montreal", "date": "2024-05-30 14:00", "url": "https://globalnews.ca/news/10533648/montreal-jewish-school-hit-by-bullet/", "message": "Send this page to someone via emailMontreal police are investigating after they say a Jewish school in the city’s most populous borough was hit by gunfire.\nPolice in Côte-des-Neiges–Notre-Dame-de-Grâce responded after they received information that projectile impacts were visible on the Jewish school located on Hillsdale Road near Van Horne Avenue.\nA police presence remained outside the school to reassure the community and the school was open to students.\nStory continues below advertisementTrudeau wrote: “disgusted that another Jewish school has been the target of a shooting.\nHe posted on X, “the second shooting at a Jewish school in a week."}, {"id": "8aad09a4-1ee2-4b90-8688-37d499f4667f", "title": "Highland Park shooting suspect Robert Crimo III appears in court as 2nd anniversary of attack approaches", "date": "2024-05-30 02:45", "url": "https://abc7chicago.com/post/highland-park-shooting-suspect-robert-crimo-iii-appears/14888455/", "message": "Highland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nRobert Crimo III is accused of killing seven people and wounding dozens at the parade on July 4, 2022."}, {"id": "2ead6197-3316-472b-a1b5-0ba1038ed31e", "title": "All Eyes on Rafah : Viral AI image sparks global outrage over Gaza camp strike", "date": "2024-05-30 03:15", "url": "https://www.thehindu.com/news/international/all-eyes-on-rafah-image-shared-44-mn-times-on-social-media/article68231212.ece", "message": "An AI-generated image bearing the words “All eyes on Rafah” has been shared by more than 44 million Instagram accounts since Monday after a deadly Israeli strike at a camp for displaced Palestinians in the Gazan city.\nThe slogan “All eyes on Rafah” has also been widely shared in other publications and social networks, especially X, where the hashtag #alleyesonrafah has attracted almost one million hits, according to online monitor Visibrain.\nGaza’s Hamas-run health ministry said an Israeli strike on the camp that sparked a fire on Sunday killed 45 people and injured 249.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael’s retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory’s health ministry."}, {"id": "4bda8ed2-06d1-4f9a-92dc-d14b0aca152d", "title": "Israeli Efforts to Weaken the Palestinian Authority Could Shatter the Limited Calm in the West Bank - Israel News", "date": "2024-05-30 03:45", "url": "https://www.haaretz.com/israel-news/2024-05-30/ty-article/.premium/israeli-efforts-to-weaken-the-pa-could-shatter-the-limited-calm-in-the-west-bank/0000018f-c5fe-d801-a3ef-fdfea0810000", "message": "Two Israelis were seriously injured Wednesday night at the southern entrance to Nablus when they were hit by a Palestinian vehicle.\nThe army believes that it was a ramming attack and began a manhunt for the driver.\nHowever, over the course of nearly eight months of war in the Gaza Strip, the West Bank has been relegated to a secondary front.\nThe Israel Defense Forces has deployed many reserve units there and has undertaken major operations in the Jenin, Nablus and Tulkarm areas.\nThere have been lots of shooting attacks and hundreds of Palestinians have been killed in clashes with troops, and it seems the West Bank has remained just short of the boiling point."}, {"id": "34d467a3-5d3b-4c13-9716-e35272954b32", "title": "  Several Sections Of The Crimean Bridge Will Fall Into The Sea  ", "date": "2024-05-30 14:00", "url": "https://charter97.org/en/news/2024/5/30/597013/", "message": "'Several Sections Of The Crimean Bridge Will Fall Into The Sea' 5 30.05.2024, 16:1417,996Colonel of the Armed Forces of Ukraine told how it is possible to attack a key object for the Russians.\nUkrainian intelligence attacked the Russian Tunets boats that guarded the Crimean Bridge.\nThis is a matter of prestige: Ukraine, which does not have a fleet, is dealing serious and painful blows to the Black Sea Fleet of the Russian Federation.\n— How vulnerable is the security of the Crimean Bridge now?\n— From the point of view of anti-aircraft missile cover, the Crimean Bridge is the densest on Earth, it is better protected than Moscow."}, {"id": "5adeb627-868f-45d6-b3c5-82558a444185", "title": "Ship attacked by Yemen Houthi rebels was full of grain bound for Iran , the group main benefactor", "date": "2024-05-30 13:00", "url": "https://indianexpress.com/article/world/ship-attacked-yemen-houthi-rebels-grain-iran-groups-benefactor-9361665/", "message": "A Greek-owned, Marshall Islands-flagged bulk carrier that came under attack by Yemen's Houthi rebels earlier this week had a cargo of grain bound for Iran, the group's main benefactor, authorities said Thursday.\nHowever, as shipping through that artery has dropped during the months of attacks, the rebels have struck vessels associated with Iran, as well as Tehran's economic lifelines of China and Russia.\nInitially after the attack, the Laax had listed its destination as Fujairah in the United Arab Emirates.\nTuesday's attack saw five missiles hit the Laax during the hourslong assault, the private security firm LSS-SAPU told The Associated Press.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage."}, {"id": "e1efef33-0384-4f92-9d48-89553a5ebccc", "title": "NIA charges ULFA - I leader , five associates in Tinsukia grenade attack case", "date": "2024-05-30 14:00", "url": "https://www.thestatesman.com/india/nia-charges-ulfa-i-leader-five-associates-in-tinsukia-grenade-attack-case-1503305318.html", "message": "The National Investigation Agency (NIA) has formally charged the leader of the outlawed militant group United Liberation Front of Asom (Independent), along with five associates, in connection with a grenade attack on a military base in Assam’s Tinsukia district last year.\nThe incident took place on November 22, 2023, targeting an Indian Army installation in Kakopathar, Tinsukia.\nThere were no casualties, but the NIA claims the attack was part of a broader plot to strike security forces throughout the region.\nThe chargesheet also points to Abhijit Gogoi as the coordinator of the Kakopathar attack’s planning and execution.\nThe NIA continues its investigation to uncover additional individuals involved and to dismantle the terrorist network."}, {"id": "0c5b9cd0-761c-4f60-b9f5-071c6f0e821d", "title": "As Gaza strike at University of California continues , evidence links defense plant near UCLA to Israeli bombing of tent camp", "date": "2024-05-30 05:15", "url": "https://www.wsws.org/en/articles/2024/05/30/ucst-m30.html", "message": "Academic workers from UCLA and UC Davis picketed for the second day since being called out on Tuesday.\nInitially, the UAW limited the strike to only a single campus, UC Santa Cruz, out of the 10-campus UC system.\n“I think the fact that Santa Cruz, UCLA and Davis are all out now is very promising, but we need all 48,000,” one UCLA student said.\nOn Wednesday, the WSWS urged pickets at UCLA to go to this facility and win the support of workers at the plant.\nWhen asked about the need to form rank-and-file committees, the UCLA student said:I think what you’re saying is ultimately what we’re going to need."}, {"id": "6e3a9441-b48f-479a-912c-4e7c0dc009b9", "title": "MW3 and Warzone : How to Unlock the Superi 46", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499849/article/mw3-and-warzone-how-to-unlock-the-superi-46/", "message": "One of those weapons belongs to the submachine gun category and it goes by the name of the Superi 46.\nIf you want to see what the Superi 46 is capable of in MW3 and Warzone, you’re going to have to spend some time unlocking it first.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?\nIf you’re too eager to wait, you can always purchase a bundle containing a Superi 46 blueprint."}, {"id": "06395198-9cb6-445c-8e64-5e161e74e0df", "title": "Drones Filling The Skies Over Ukraine Battlefields", "date": "2024-05-30 01:45", "url": "https://menafn.com/1108273441/Drones-Filling-The-Skies-Over-Ukraine-Battlefields", "message": "A recent report highlighted howUkraineneeded to pull US-provided M1A1 Abrams main battle tanks from the battlefield, due to their vulnerability to drones.\nAs a result, the battle between drones continues to shift toward whoever has the edge in electronic warfare.\nDrones' growing importance on the battlefield will continue whether it's by becoming more autonomous or playing a supporting role to other weapon systems.\nDrones alone won't determine who wins battles, but they will play a vital role for military planners in the future.\nMany of Russia's assaults on Ukrainian positions are thwarted by Ukrainian infantry supported by FPV drones."}, {"id": "d3081f27-ce0a-4495-8315-f971f98bb3e5", "title": "Türkiye starts mass production of domestic Altay tank : Official", "date": "2024-05-30 09:30", "url": "https://www.dailysabah.com/business/defense/turkiye-starts-mass-production-of-domestic-altay-tank-official", "message": "Türkiye has started mass production of the country's first domestically made main battle tank, the Altay, a top defense official said Wednesday.\n\"We have started the mass production of our national tank.\nThe new generation Altay tank, produced by BMC Defence under the project of the SSB, has been upgraded to meet the conditions of modern combat environments.\n\"Many subsystems have been localized, updated technologies and innovations have been added to enhance its combat capabilities,\" Görgün said.\nReflecting the experience gained from the recent operations of the Turkish Armed Forces (TSK), the Altay tank has been equipped with additional features."}, {"id": "01a4df92-0ba9-42b1-9c42-c2e6e97622c9", "title": "Veteran Salute : Serving in WWII with a legendary unit", "date": "2024-05-30 05:30", "url": "https://www.yahoo.com/news/veteran-salute-serving-wwii-legendary-032442612.html", "message": "LEROY (KSNT) – Fighting across Europe during World War II, Corporal Carl Otto served in an elite combat signal battalion and engaged in the Battle of the Bulge.\n“I went overseas with the 35th signal battalion,” he said, “and was stationed in Leominster, England, doing nothing.\nI was getting pretty bored, and the Battle of the Bulge started.”Veteran Salute: Serving in health and communications overseasVolunteering for infantry replacement, Otto made his way to Bastogne in Belgium.\nIf the conflict overseas wasn’t intense enough, even the terrain showed hostility to Otto and his unit.\nWe were all about to freeze to death, so that was my introduction into the combat area.”Otto served in a legendary unit, the 94th Signal Battalion."}, {"id": "c15a6d19-4abc-4122-b443-5050cc9ce92d", "title": "HYD : Two IDF Soldiers Murdered In Terror Attack Near Shechem – The Yeshiva World", "date": "2024-05-30 08:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2286929/hyd-three-idf-soldiers-killed-in-gaza.html", "message": "The IDF released for publication on Thursday morning that two IDF soldiers were killed in the ramming attack near Shechem on Wednesday evening and a third soldier was killed in battle in the northern Gaza Strip on Wednesday.\nThe ramming attack occurred at an IDF checkpoint near Shechem.\nAs IDF soldiers were checking cars, the terrorist sped to the front of the line and rammed into two soldiers.\nAccording to a preliminary investigation, the ramming attack occurred in seconds and the soldiers had no time to respond by opening fire.\nThe soldier who fell in battle in northern Gaza on Wednesday was identified as Staff Sgt."}, {"id": "d04f928f-0647-4edd-af52-f6a16612db00", "title": "MW3 and Warzone : How to Unlock the Kar98k", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499864/article/mw3-and-warzone-how-to-unlock-the-kar98k/", "message": "The Kar98k has returned to MW3 and Warzone to the joy of many players.\nBefore you can begin sniping through the opposition, you must unlock the weapon as you play MW3 and Warzone.\nMore Call of Duty guidesMW3 and Warzone: How to Unlock the Superi 46 | MW3 and Warzone: How to Unlock the JAK Harbinger Kit | Modern Warfare 3: How to get a DNA Bomb | Call of Duty: Modern Warfare 3 – How to Earn Weapon Prestige Camos | Call of Duty: Warzone – What is the Rebirth Infil Strikes Public Event?\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?"}, {"id": "9d12a001-dcf3-45a2-b3c8-2c16c26d12b8", "title": "Call of Duty : Modern Warfare III DLC Season 4 begins", "date": "2024-05-30 08:00", "url": "https://www.newgamenetwork.com/news/22326/call-of-duty-modern-warfare-iii-dlc-season-4-begins/", "message": "Call of Duty: Modern Warfare III DLC Season 4 beginsNew content for the shooter is biohazard-themedActivision has announced that Season 4 for Call of Duty: Modern Warfare III, Call of Duty: Warzone, and Call of Duty: Warzone Mobile, is now live.\nFor MWIII multiplayer, the season will bring three new core 6v6 maps - Tokyo (Launch), Paris (Launch), and Incline (Mid-Season) are medium sized, while Das Gross (Mid-Season), is small sized.\nThe season will also bring Demolition (Launch), Hyper Cranked (Launch), Headshots Only (Mid-Season), and Havoc (Mid-Season) modes.\nZombies will offer a new level Unstable Rift (Mid-Season), while Warzone will see a variety of changes to the map and Gulag.\nModern Warfare III is available worldwide now on PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, and PC on Battle.net, and on Steam."}, {"id": "9b786331-0043-4e9f-b25d-2366da9cf3ba", "title": "MW3 and Warzone : How to Unlock the JAK Harbinger Kit", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499833/article/mw3-and-warzone-how-to-unlock-the-jak-harbinger-kit/", "message": "Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4.\nWeekly challenges have been reset, meaning more Conversion Kits will roll out, with the first being the JAK Harbinger Kit for the M4.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?"}, {"id": "cb580440-7e49-4c87-a7b1-bd7ce4a3d23f", "title": "Opinion : Do we still understand how wars are won ? | Chattanooga Times Free Press", "date": "2024-05-30 02:15", "url": "https://www.timesfreepress.com/news/2024/may/29/do-we-still-understand-how-wars-are-won/", "message": "We won limited victories against Saddam Hussein in 1991 and Moammar Gadhafi in 2011, only to fumble the endgames.\nIf you're on the left, you'd probably say that most, if not all, of these wars were unnecessary, unwinnable or unworthy.\nEither way, none of these wars were about our very existence.\nNations, especially democracies, often have second thoughts about the means they use to win existential wars.\nBut the tragedy of America's recent battle history is that thousands of those soldiers died in wars we lacked the will to win."}, {"id": "65203849-cd26-41e7-9d80-1915b1098b84", "title": "Grand Words From the Gipper", "date": "2024-05-30 05:45", "url": "https://townhall.com/columnists/marklewis/2024/05/30/grand-words-from-the-gipper-n2639717", "message": "Almost all the world’s constitutions are documents in which governments tell the people what their privileges are.\nVery few countries have ever had such a system, which is what made America a unique, and grand, experiment in liberty.\nAlexander Hamilton wanted a national bank, a “Band of the United States,” which Thomas Jefferson argued was unconstitutional.\nOther matters became debated before the war—land grants to colleges, a protective tariff, the national bank.\nAdvertisementMr. Reagan’s words quoted at the beginning of this column are what the men who wrote our Constitution (perhaps Hamilton excluded) intended."}, {"id": "17f2bbff-d1af-44b8-aed8-d5e2aa6ece31", "title": "Russia says NATO is  provoking  Ukraine into prolonging the  senseless war ... which Putin started", "date": "2024-05-30 13:30", "url": "https://www.dailymail.co.uk/news/article-13476043/Russia-says-NATO-provoking-Ukraine-prolonging-senseless-war-Putin-started.html", "message": "The Kremlin on Thursday accused NATO of 'provoking' Kyiv into prolonging the conflict in Ukraine, whose officials have been appealing for permission from allies to target Russia with Western-supplied weapons.\n'They are provoking Ukraine in every possible way into continuing this senseless war,' Peskov told reporters during a daily briefing.\nRussia launched its invasion of Ukraine in February 2022, with Vladimir Putin claiming that his nation was 'fighting fiercely for its future, repelling the aggression of neo-Nazis and their masters', referring to Ukraine and the West.\nSince then, his brutal invasion - the bloodiest conflict on European soil in decades - has largely become a war of attrition.\nEarlier this week, French President Emmanuel Macron and NATO chief Jens Stoltenberg said that Western countries should not object if Ukraine needs to strike inside Russia to defend itself."}, {"id": "dac892f4-5546-4c6e-b130-1e86d661e88d", "title": "COD : Black Ops 6 Vault Edition and Pre - Order Bonus Leaks", "date": "2024-05-30 02:15", "url": "https://www.playstationlifestyle.net/2024/05/29/cod-black-ops-6-vault-edition-and-pre-order-bonus-leaks/", "message": "This previously included a blurred version of the box art, with a new leak revealing the game’s pre-order bonus, Vault Edition, and more.\nBlack Ops 6 pre-order bonus, Vault Edition, and Cross-Gen Bundle leakKnown leaker and data miner BobUK released several images, as MP1st reported.\nAccording to the leaks, The Frank Woods pre-order bonus is included in Black Ops 6’s Vault Edition.\nBlack Ops 6 now officially confirmed for last-genLogo for Black Ops 6 Cross-Gen Bundle found in files pic.twitter.com/WFNB1O0MGa — CharlieIntel (@charlieINTEL) May 29, 2024In addition to the leaks provided by BobUK, CharlieIntel also revealed the existence of a new Cross-Gen Bundle for Black Ops 6.\nSeemingly corroborating reports that Black Ops 6 is coming to PS4 and Xbox One, in addition to the newer consoles."}, {"id": "60ad41f6-a68b-4a7b-8695-fa4f01ff9e64", "title": "It hard to like the heroes of Wuthering Waves when they keep soiling you with dictionary vomit", "date": "2024-05-30 14:15", "url": "https://www.rockpapershotgun.com/wuthering-waves-dialogue-and-writing-is-kind-of-bad", "message": "Wuthering Waves has been this month's lightning rod for hype.\nImage credit: Rock Paper Shotgun / Kuro GamesThe whole plot seems to hang together with glue and duct tape.\nWuthering Wave's publisher famously splashed out on advertising by hiring every billboard in New York's Times Square.\nImage credit: Rock Paper Shotgun / Kuro GamesIt is hard to build a sense of motivation around that alone.\nThe main thing developers will take away from Wuthering Waves, I fear, is the confirmation that overwhelming advertising still works."}, {"id": "f634edd3-cbea-4195-9114-8d578a86fa8d", "title": "Gaza war may last till end of 2024 , warns Israel amid Rafah offensive", "date": "2024-05-30 11:45", "url": "https://article.wn.com/view/2024/05/30/Gaza_war_may_last_till_end_of_2024_warns_Israel_amid_Rafah_o/", "message": "An Israeli official cautioned Wednesday that the war with Hamas may last till the end of 2024 as military operations against Hamas continue, reported CNN.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\n\"We are now in the fifth... read full story\"We are now in the fifth month of 2024, which means we expect another seven months of fighting to deepen our achievements and achieve our goal of destroying the military and governmental capabilities of Hamas and Islamic Jihad,\""}, {"id": "ae25e472-f0dc-4b30-a9c3-bfe962f89afd", "title": "Mission Creep : New Push for NATO Troops in Ukraine | NewsRadio 740 KTRH | KTRH Local Houston and Texas News", "date": "2024-05-30 13:30", "url": "https://ktrh.iheart.com/featured/houston-texas-news/content/2024-05-29-mission-creep-new-push-for-nato-troops-in-ukraine/", "message": "More than two years and hundreds of billions of dollars into the war in Ukraine, there's a new push for non-Ukrainian boots on the ground.\nFrench President Emmanuel Macron has proposed sending NATO troops into Ukraine in a \"non-combat\" role to assist in the war with Russia.\nThis led a spokesman for Macron to tell Newsweek that momentum is 'clearly building' for NATO troops in Ukraine.\n\"I think (Russia's) ultimate fear is that eventually NATO forces would actually start fighting the war for Ukraine,\" he tells KTRH.\n\"That would essentially bring Russian and NATO forces into direct conflict, and literally be the start of World War III.\""}, {"id": "f4d5902e-6019-43d2-8a03-8cfdbdfc452f", "title": "Bangkok Post - Forces drill for border skirmish", "date": "2024-05-30 11:45", "url": "https://www.bangkokpost.com/thailand/general/2802399/forces-drill-for-border-skirmish", "message": "Army and air force teams gather in Sukhothai for live-fire exercisesA joint air force-army drill got under way in Sukhothai province on Thursday.\n(Photo supplied/Wassana Nanuam)A joint air force-army drill was under way in Sukhothai province on Thursday to harmonise ground force and air support in a simulated war to deal with a border conflict.\nThe drill, based on a strategy involving combined ground and air force operations, has been implemented in phases since November.\nThe ground forces included 30 Stingray light tanks, 16 M113 armoured personnel carriers, Scorpion light tanks, six 105-millimetre artillery pieces, six 120mm grenade launchers, as well as 600 soldierss.\nThere was no communication error between the ground and air forces during this exercise, he said."}, {"id": "48d1d566-717a-4451-aa7a-311e0023218f", "title": "Differentiating innovation : From performance art to production scale", "date": "2024-05-30 01:15", "url": "https://breakingdefense.com/2024/05/differentiating-innovation-from-performance-art-to-production-scale/", "message": "TOPGUN, initiated after the US Navy’s poor air-to-air performance in the Vietnam War, can be seen as a form of concept innovation.\nWhether process innovation saves money or improves speed to field, the silent partner in defense innovation must be silent no more.\nAn organization tasked with capability innovation is going to define its problem and build an empowered program team differently than an organization focused on process innovation.\nSimilarly, the types of leadership support needed for concept innovation are going to differ in kind, scale, and duration from those needed for process innovation.\nThe creation of innovation organizations that are fit for purpose and possess a clearly defined mission is already underway."}, {"id": "e007ed22-6da4-4e3a-b300-f00e334a0439", "title": "Tampa Bay WWII vets return to Normandy for D - Day ceremonies", "date": "2024-05-30 00:00", "url": "https://www.yahoo.com/news/tampa-bay-wwii-vets-return-220924783.html", "message": "TAMPA, Fla. (WFLA) — Five Tampa-area World War II veterans are heading to Normandy for the 80th anniversary of the D-Day invasion.\n“They got my baggage and put it on the Queen Mary and that’s where I stayed for three nights,” said Griep.\n(Handout)He remembers nights of combat and he remembers being there as the 42nd liberated Jewish prisoners at the Dachau Concentration camp.\nNow, thanks to the Elks Club of Florida, Griep will be traveling back to Normandy with members of his family.\n“The World War II vets and the Korean War vets thought their lives were over and nobody recognized, nobody remembered what they did."}, {"id": "fa00f39b-1e7d-490a-b238-6f16e4d355fa", "title": "Sudan : How El Fasher Went From Darfur Safe Haven to All - Out War", "date": "2024-05-30 05:30", "url": "https://allafrica.com/stories/202405300066.html", "message": "UN officials have called the situation in El Fasher \"Hell on Earth\" and are warning that genocide crimes may be committed.\nDaily interviews that I am doing with friends and human rights monitors in El Fasher suggest that neither claim is an understatement.\nThe battle for El Fasher - home to as many as two million people - started last month but had long been telegraphed.\nLocal volunteers from the Shaqra Emergency Response Room prepare food for displaced people camped just outside of El Fasher.\nThe camp is on the outskirts of El Fasher and is located close to conflict front lines."}, {"id": "330aaa2c-d44a-43b0-8a8b-6bbe50fc29ca", "title": "Links 5 / 29 / 2024 | naked capitalism", "date": "2024-05-30 11:15", "url": "https://www.nakedcapitalism.com/2024/05/links-5-29-2024-2.html", "message": "Something Strange Happens to Wolves Infected by an Infamous Mind-Altering Parasite Science AlertTaking Stock: Dollar Assets, Gold, and Official Foreign Exchange Reserves Federal Reserve Bank of New York, Liberty Street EconomicsWould Returning to the Gold Standard Resolve Our Most Pressing Monetary Problems?\nCharles Hugh Smith, Or Two Minds.\nCalPERS opposes Elon Musk’s $56 billion pay package amid shareholder discontent WIONThe CRE non-crisis rolls on FTClimateWaterSyndemicsChina?\nMyanmarVast concessions threaten Malaysia’s forests: Report Channel News AsiaIndiaSyraqistanEuropean DisunionWalking France: Avignon to Pont-Saint-Esprit Chris Arnade, Walking the WorldDear Old BlightyNew Not-So-Cold WarGlobal ElectionsSouth Africa counts ballots in most competitive election since apartheid France242024The SupremesSpook CountryThe BezzleDigital WatchBoeingFAA appears poised to grant Boeing extension on safety report Leeham News & AnalysisThe 420Imperial Collapse WatchClass WarfareAntidote du jour, via JB:“A little bird singing in the cold.”See yesterday’s Links and Antidote du Jour here."}, {"id": "5fff1bf2-d4e7-45d5-8979-0c0ff2b7fb8d", "title": "War Walks - BBC Four HD", "date": "2024-05-30 13:15", "url": "https://www.tvguide.co.uk/schedule/3559cde3-7bdb-574b-a5e8-c3244d527731/war-walks", "message": "War WalksBBC Four HD 7:30 PM to 8:00 PM Thursday 30 May Share Add toCalendar +Boyne Season 2 Episode 4 of 6 S SubtitlesRichard Holmes visits the site of the Battle of the Boyne in Co Louth, Ireland, where James II was defeated by the forces of William III in 1690.\nHe walks beside the river near Drogheda where the two armies clashed and learns how the conflict was almost over before it started - thanks to the poor aim of a Jacobite gunnerWar Walks airs on BBC Four HD at 7:30 PM, Thursday 30 May .\n(Subtitles.)\nLearn more about War Walks and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics General"}, {"id": "c5ceb962-d717-44ac-8de7-adadd637f8dd", "title": "Xbox Games Are Selling Gangbusters on PS5", "date": "2024-05-30 00:30", "url": "https://www.pushsquare.com/news/2024/05/xbox-games-are-selling-gangbusters-on-ps5", "message": "But yes i too agree that might just ruffle to many feathers for it’s own good.\nI included Jamie cause i know he feels similar without speaking for him.\nBut wish for Xbox to stop making hardware.i fish and hunt as my outdoor hobbies and sure there is brand loyalty in rods reels and lures.\nBut never online in chat forums and topic threads do i see other fisherman wish for other companies to go out of business.\nSorry for the rant but none of that makes any logical sense in business or otherwise."}, {"id": "38892fec-61d0-4aa2-9c36-8c18a7199352", "title": "Modern Warfare 3 : All Ranked Play Rewards | Season 4", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499881/article/modern-warfare-3-all-ranked-play-rewards-season-4/", "message": "Season 4 of Modern Warfare 3 and Warzone has arrived which means ranks have reset and there’s a whole season of competitive play to look forward to.\nIf you’re queuing into Ranked Play, the main goal is to beat your opposition to bank yourself as much SR as possible.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What is the Utility Box Field Upgrade?\n| Call of Duty: Modern Warfare 3 – Minefield Mode Explained | Call of Duty: Warzone – All Urzikstan Nuke Rewards | Call of Duty: Warzone – How to get a Nuke and Complete the Champion’s Quest in Urzikstan |Modern Warfare 3 Season 4 Ranked Play rewardsHere are the all the Modern Warfare 3 Season 4 competitor goodies."}, {"id": "1f80ab26-1edb-49bd-8ded-78572d877d25", "title": "Crestview World War II reenactors plan 80th anniversary observance for 2025", "date": "2024-05-30 04:30", "url": "https://www.yahoo.com/news/crestview-world-war-ii-reenactors-021641072.html", "message": "CRESTVIEW, Fla. (WKRG) — World War II reenactors are already planning how Crestview will observe the 80th anniversary of the end of World War II in Europe, and they decided on an event.\nThe event commemorating the 80th anniversary of the end of World War II is will be called “Race to Rhein: Victory in Europe.” It is scheduled for April 4 and April 5, 2025, according to a press release.\nWith education as a goal, April 4 will be student and Veterans Day with guided tours for classes and groups.\n“We have no tolerance for ‘farb’ by our reenactors,” Event Organizer Andrew Daigle said.\nFor the latest news, weather, sports, and streaming video, head to WKRG News 5."}, {"id": "4f16d18d-7f61-4928-a3bc-fd6c03546dae", "title": "Israel says it expects to continue war in Gaza for another 7 months", "date": "2024-05-30 01:00", "url": "https://www.kenyan-post.com/2024/05/israel-says-it-expects-to-continue-war.html", "message": "Wednesday, May 29, 2024 - Israel's head of national Security Council has said the country expects \"another seven months of fighting\" in Gaza to achieve the objective of destroying Hamas.\nThe war has elicited strong reactions worldwide, with more European countries now recognizing the state of Palestine and the International Criminal Court charging Israeli Prime Minister for war crimes.\n\"It is built on a staged basis, with the year 2024 defined as a year of combat.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.\nJust don't use a stopwatch on ourselves or set ultimatums,\" he said."}, {"id": "82369892-d7c7-48c5-8ae9-2dd5b5222c84", "title": "Call of Duty Crossover With Fallout Leaks Early", "date": "2024-05-30 03:30", "url": "https://www.kotaku.com.au/2024/05/call-of-dutys-crossover-with-fallout-leaks-early/", "message": "Unsurprisingly, some players have already started datamining it, and in so doing, have found what appears to be the first in-game look at an upcoming, still-unannounced Fallout crossover.\nThe image shows four Call of Duty characters, including Ghost and Price, wearing Fallout 4-style blue and gold Vault outfits.\nThe characters in the promo image are also sporting PipBoy computers on their wrists, and one soldier has a Vault-Tec assault rifle skin, too.\nThe promo image lists the outfits and cosmetic items as being part of a “Fallout: Vault Dweller” pack.\nOf course, until Activision or Bethesda officially announces a Fallout X Call of Duty crossover, this isn’t confirmed."}, {"id": "af1e898f-7b77-437a-8242-e8b5ca45e127", "title": "Smotrich Beats Gallant , Forces Public Commission to Examine Security Budget | The Jewish Press - JewishPress . com | David Israel | 22 Iyyar 5784 – Thursday , May 30 , 2024", "date": "2024-05-30 13:30", "url": "https://www.jewishpress.com/news/israel/idf/smotrich-beats-gallant-forces-public-commission-to-examine-security-budget/2024/05/30/", "message": "The commission will consist of two representatives each of the prime minister, defense minister, and finance minister, as well as representatives of the Bank of Israel, the IDF, the NSA, and the National Economic Council.\nThe new agreement was forwarded to the prime minister for signing, following which the commission will convene and begin its work.\nMinister Smotrich issued the following statement Wednesday night:“Establishing the commission to examine the defense budget is an important step for the economy and security.\nWe all have a lot to learn and correct since October 7, and the establishment of the commission is a first step in the right direction.”In early May, Defense Minister Gallant criticized Smotrich’s intention to limit the defense budget.\nThe State of Israel should invest twice as much in the defense budget – this is our main insurance policy and we received proof of this only a few weeks ago (by which he meant the Iranian missile attack – DI).”"}, {"id": "623a82c7-a8f9-41f9-8a49-8bce50b07040", "title": "IDF Announces Death Of Two Soldiers In West Bank Car Ramming Attack , One In Gaza Fighting", "date": "2024-05-30 09:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-announces-death-of-two-soldiers-in-west-bank-one-in-gaza", "message": "Eliya Hilel, 20 from Tel Zion, and Staff Sergeant Diego Shvisha Harsaj, 20 from Tel Aviv, were severely injured in a car-ramming attack near Shechem.\nYedidya Azugi, 20 from the settlement of Revava, fell in a battle in the north of the Gaza Strip.\nThe death toll in the Gaza Strip since the start of the ground offensive now stands at 287.\nIDF spokespersonSergeant Yedidia Azugi, 21, from the settlement of Revava, a fighter in the 101st Battalion, Paratroopers Brigade, fell in battle in the north of the Gaza Strip.\nThe entire Revava settlement is in deep mourning."}, {"id": "67b9f100-ea8e-426a-9107-bd1169e83be0", "title": "Poland bolsters border with Belarus after migrant stabs solider :  Hybrid warfare  ", "date": "2024-05-30 03:30", "url": "https://wjla.com/news/nation-world/poland-bolsters-belarus-border-after-migrant-stabs-solider-hybrid-warfare-european-union-border-security-russia-putin-ukraine-war-eastern-europe-united-nations-donald-tusk-", "message": "Poland will fortify its border with Belarus after a migrant stabbed a Polish soldier on Tuesday, according to the .\nThe migrant reached through the barrier to stab the soldier in the ribs, according to the Associated Press report.\nA 2021 U.S. Congressional Research Service suggested Belarus tried to create chaos and violence at its border with Poland to use in anti-European Union propaganda.\nFormer Polish Prime Minister Mateusz Morawiecki claimed Belarus was attacking Poland, according to the report.\nLast year, he warned Poland that any attack on Belarus would represent an attack on Russia."}, {"id": "68560100-f544-481f-83fb-6260243a789c", "title": "Asymmetrical Warfare | The Jewish Press - JewishPress . com | Michael Krampner | 22 Iyyar 5784 – Thursday , May 30 , 2024", "date": "2024-05-30 03:45", "url": "https://www.jewishpress.com/indepth/opinions/asymmetrical-warfare/2024/05/30/", "message": "Photo Credit: 123rf.comWhen asymmetrical warfare is discussed, the focus is usually what happens on the battlefield.\nBut I want to discuss some other aspects of the asymmetries – the inequalities – in the current Gaza/Hamas war against Israel.\nThere are only approximately seventeen million Jews in the world today and only one Jewish majority country.\nIf Israel had that result, it would be the end of the almost constant warfare that Israel has suffered these last seventy-six years.\nDifferent authorities in the field give different reasons for Arab and Muslim hatred of Jews and the little Jewish state (which Arabs and others try to disguise as “anti-Zionism”)."}, {"id": "dfc8c639-4145-4332-b400-39d38078355b", "title": "  He died for our country : Buffalo WWII Navy sailor sunken submarine located", "date": "2024-05-30 02:15", "url": "https://www.wkbw.com/news/local-news/he-died-for-our-country-buffalo-wwii-navy-sailors-sunken-submarine-located-after-80-years-missing", "message": "TOWN OF NIAGARA, N.Y. — A World War II Navy veteran from Buffalo was lost at sea when his crew’s submarine sank in battle.\nAfter 80 years lost to the bottom of the ocean, that local sailor’s ship has been found.\n“We wish he was still here, so we could talk to him, but that obviously wasn’t going to happen,” Dallessandro’s nephew Donald Mullen said.\nDallessandro, a Buffalo native, was a torpedoman's mate in the U.S. Navy, sailing aboard the USS Harder submarine.\n“I just couldn’t believe it, that’s 80 years ago,” another one of Dallessandro’s nephews, James Mullen, said."}, {"id": "b344787a-ee6b-419c-94a1-2917535006bc", "title": "Iran rules out sabotage , electronic warfare in crash of Raisi helicopter", "date": "2024-05-30 13:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/30/content_117224603.htm", "message": "You are here:视频播放位置 下载安装Flash播放器TEHRAN, May 29 (Xinhua) -- Iran has ruled out sabotage or electronic warfare as the cause of the helicopter crash that resulted in the deaths of President Ebrahim Raisi and his entourage, the General Staff of Iran's Armed Forces announced on Wednesday.\nThe report also dismissed the possibility of electronic warfare, citing an absence of evidence.\nNo defects related to the helicopter's overhaul and maintenance were found to have contributed to the crash.\nRecorded communications between the pilots indicated the last contact with the crashed helicopter occurred 69 seconds before the incident, with no emergency declared.\nForeign Minister Hossein Amir-Abdollahian and Mohammad Ali Ale-Hashem, representative of the Supreme Leader to East Azarbaijan, were also on board."}, {"id": "cbea819b-6e6c-4fc1-a2d5-06250d93250c", "title": "Shin Megami Tensei V : Vengeance The Ultimate Beginning trailer", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/shin-megami-tensei-v-vengeance-the-ultimate-beginning-trailer/", "message": "Atlus just published a new video for Shin Megami Tensei V: Vengeance titled “The Ultimate Beginning”.\nMassively expanded with new areas, demons, and music, Shin Megami Tensei V: Vengeance features more accessible gameplay, an improved battle system, new demon experiences, and greater field exploration.\nExperience a brand-new tale of revenge by the fallen or the original story of Shin Megami Tensei V, both filled with conflicting and tragic choices, forcing you to confront which ideologies you are willing to fight for.\nGet a look at the Shin Megami Tensei V: Vengeance “The Ultimate Beginning” trailer below.\nThe Ultimate Beginning TrailerShin Megami Tensei V: Vengeance will be out for Switch on June 14, 2024."}, {"id": "b724d0af-b4b2-4bc5-bda7-57056cc482ce", "title": "Israeli defense co Roboteam wins US Marines deal", "date": "2024-05-30 14:30", "url": "https://en.globes.co.il/en/article-israeli-defense-co-roboteam-wins-us-marines-deal-1001480200", "message": "This order represents part of a larger follow-up order to equip the Marines worth more than NIS 100 million overall.\nSupply of the military robot systems has already begun and the company expects to complete delivery of the entire order by the first quarter of 2025.\nThe MTGR is a lightweight combat-proven tactical robot with all-terrain maneuverability including in dense urban environments including within buildings and underground areas.\nThe robot carries advanced cameras, which transmit 360 degree video images and has various command and control systems.\nRoboteam, which was founded in 2009, specializes in robotic systems for advanced military and security uses."}, {"id": "0b04851c-c1b4-4bf0-8dad-a41e8ce5b7bf", "title": "Israeli national security adviser predicts war in Gaza will last to the end of the year", "date": "2024-05-30 05:00", "url": "https://www.jta.org/2024/05/29/politics/israeli-national-security-adviser-predicts-war-will-last-to-the-end-of-the-year", "message": "(JTA) — Tzachi Hanegbi, the national security adviser to Israeli Prime Minister Benjamin Netanyahu, predicted that Israel’s war with Hamas would last until the end of the year, raising the specter of further bloodshed in what would be one of Israel’s longest wars.\nThe war continuing until January would also increase tension with the Biden administration, which is pressing for a ceasefire.\nThe Biden administration has been seeking a temporary ceasefire that it hopes could lead to a more permanent end to hostilities..\nJohn Kirby, the spokesman for the White House National Security Council, declined in a call with reporters to comment on Israel’s war plans, but said the White House favored a resolution sooner rather than later.\nWe’ve got to get them home.”He said the hope was that a temporary ceasefire could become long-lasting."}, {"id": "a6e76312-e3d0-4cae-be87-da8dcae55a4b", "title": "Tacoma says it embraces anti - racism . Can it do that without also supporting Zionism ? ", "date": "2024-05-30 13:30", "url": "https://www.yahoo.com/news/tacoma-says-embraces-anti-racism-120000863.html", "message": "Tacoma says it embraces anti-racism.\n| OpinionThe city of Tacoma recently passed a resolution calling for a ceasefire in Israel’s War against Hamas.\nWhich begs several questions, including: Can a city truly commit to the principles of anti-racism and reject Zionism?\nIf not, how can Tacoma expect Israel to achieve a “durable peace” with an opponent whose founding creed is its total destruction?\nChris Van Vechten is an attorney and a former candidate for Tacoma City Council."}, {"id": "fd72037b-c8bf-491f-b460-361ad7582258", "title": "nelson - peltz - sells - disney - stock", "date": "2024-05-30 03:45", "url": "https://www.thewrap.com/nelson-peltz-sells-his-entire-1-billion-stake-in-disney-after-losing-proxy-battle-cnbc-reports/", "message": "Nelson Peltz has sold all of his shares in Disney, just weeks after his attempt to place himself and former Disney finance chief Jay Rasulo to the company’s board via a proxy battle waged by his company Trian Fund Management and Blackwells Capital, was resoundingly defeated.\nCNBC reported Wednesday that Peltz sold his stock at approximately $120 a share, higher than the company’s current price per share of approximately $101.00.\nIn mounting his challenge to the company board, Peltz cited business concerns such, including the lack of a succession plan for CEO Bob Iger, as well as the rough patch the company has had since 2020.\nIger won 94% of the vote, while Peltz came away with 31%.\nTrian dropped its first battle against the company in February 2023 after it said Disney made “plans to do everything we wanted them to do.”"}, {"id": "e6575fd5-f979-4cea-8e04-0d236bccf163", "title": "Trudeau must more publicly support ICC decisions : ex - ministers", "date": "2024-05-30 05:00", "url": "https://www.cp24.com/news/trudeau-must-more-publicly-support-icc-decisions-amid-israel-hamas-war-ex-ministers-1.6906057", "message": "\"That is a racist, dehumanizing and discriminatory approach to international justice which Canada cannot countenance in any way.\"\nThe ICC's chief prosecutor requested arrest warrants last week for Israeli Prime Minister Benjamin Netanyahu and his defence minister, as well as three senior Hamas leaders.\nJoly has recently avoided saying whether Canada would arrest Israeli officials if they did end up subject to an international arrest warrant and visited Canada.\n\"Strong support is vital at this time given that the prosecutor, ICC staff and the ICC as an institution are facing considerable political pressure, unfounded and inflammatory criticism (and) attacks on the Court’s independence,\" the letter reads.\nThe ICC prosecutor says Israel has been starving civilians as a method of warfare and intentionally directing attacks against civilians, which are war crimes."}, {"id": "fda2a9f7-d3d0-4b37-9a8a-d8419b57ac0e", "title": "Deaths of 3 more soldiers : 2 killed in West Bank car - ramming attack , 1 fell in battle", "date": "2024-05-30 07:15", "url": "https://www.ynetnews.com/article/b17hg5h4c", "message": "The IDF spokesman announced on Thursday morning the deaths of three IDF soldiers.\nYedidya Azugi, 21, from Revava, of the Paratrooper Brigade’s 101st Battalion, was killed in battle in the northern Gaza Strip.\nSince October 7, 642 IDF soldiers have been killed, including 291 in Gaza ground operation.\n1 View gallery Staff Sgt.\nAzugi, who fell in the northern Gaza Strip, lived in the West Bank settlement of Revava."}, {"id": "fe103fcb-e9cb-40f0-9db1-f4c3ef1ae0f8", "title": "Jake Paul has insisted his fight with Mike Tyson is still happening despite the boxing legend health scare . - 30 - May - 2024", "date": "2024-05-30 03:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399316&fm=psp,tst", "message": "Jake Paul has insisted his fight with Mike Tyson is still happening despite the boxing legend's health scare.\nTyson's rep told People magazine in a statement: \"He is appreciative to the medical staff that were there to help him.\"\nHe previously said: \"I'm very much looking forward to stepping into the ring with Jake Paul at the AT and T Stadium in Arlington, Texas.\nJake recently described facing Mike as the \"ultimate test of warfare\".\n\"This is my ultimate test of warfare and that excites me.\""}, {"id": "118c6b45-e974-4d61-adb8-7162ae5717e3", "title": "Blinken assails Russian misinformation after hinting US may allow Ukraine to strike inside Russia", "date": "2024-05-30 14:00", "url": "https://indianexpress.com/article/world/blinken-assails-russian-misinformation-us-may-allow-ukraine-strike-russia-9361985/", "message": "US Secretary of State Antony Blinken on Thursday assailed Russian attempts to sow discord in democracies with misinformation after hinting the Biden administration may soon allow Ukraine to use American-supplied munitions to strike inside Russia.\nIn Prague for a NATO foreign ministers meeting, Blinken hit out at Moscow’s use of misinformation and disinformation, calling it a “poison” and signing an agreement with the Czech government to combat it.\nLipavsky agreed, noting that Czech authorities had recently exposed a major Russian-backed misinformation campaign.\nAlthough US officials insist there is no formal ban, they have long made clear that they believe the use of American weapons to attack targets inside Russia could provoke an escalatory response from Moscow, something that Russian President Vladimir Putin has promised.\n“At every step along the way, we’ve adapted and adjusted as necessary, and so that’s exactly what we’ll do going forward,” he said."}, {"id": "eac25e49-de8b-4857-8c24-30ae8499c94b", "title": "Blinken assails Russian misinformation after hinting US may allow Ukraine to strike inside Russia", "date": "2024-05-30 13:00", "url": "https://www.startribune.com/blinken-assails-russian-misinformation-after-hinting-us-may-allow-ukraine-to-strike-inside-russia/600369669/", "message": "PRAGUE — U.S. Secretary of State Antony Blinken on Thursday assailed Russian attempts to sow discord in democracies with misinformation after hinting the Biden administration may soon allow Ukraine to use American-supplied munitions to strike inside Russia.\n\"The more we're able to do together both between our countries but also with other countries, the more effective we're going to be exposing it and dealing with it,'' Blinken told reporters at a signing ceremony with Czech Foreign Minister Minister Jan Lipavsky.\nLipavsky agreed, noting that Czech authorities had recently exposed a major Russian-backed misinformation campaign.\nNorway's foreign minister, Espen Barth Eide, told Norwegian broadcaster NRK that his country believes Ukraine ''has a crystal-clear right under international law to attack Russia inside Russia as part of the defense of its territory.''\nEarlier this week, French President Emmanuel Macron and NATO chief Jens Stoltenberg said that Western countries should not object if Ukraine needs to strike inside Russia to defend itself."}, {"id": "52ed4342-7ddc-4861-8459-55d8cf5657a3", "title": "  Taiwan independence  means war , Chinese military warns | World News", "date": "2024-05-30 14:00", "url": "https://indianexpress.com/article/world/taiwan-independce-chinese-military-taiwan-election-9362034/", "message": "The Chinese military on Thursday warned that \"Taiwan independence\" means war and said it was ready to take resolute actions to thwart foreign interference in support of \"separatist activities” in the estranged island.\nChina's reunification is an irreversible trend of history and the People's Liberation Army (PLA) is ready to take resolute actions to counter any \"Taiwan independence”, Chinese military spokesperson Sr. Col. Wu Qian told the media here.\nAlso Read | Chinese military ends biggest, closest drills around Taiwan\"Separatist activities seeking 'Taiwan independence' constitute the biggest real threat to peace across the Taiwan Strait,\" Wu said.\nIt is fully prepared, remains highly vigilant, and is ready to take resolute actions to counter any \"Taiwan independence\" separatist attempts and thwart foreign interference, Wu said.\nThe drills, which started early on May 16, happened all around the main island, including the Taiwan Strait to its west, and around the Taiwanese islands of Kinmen, Matsu, Wuqiu and Dongyin."}, {"id": "bde60f7c-f44c-46d1-ade6-cf7c691fedcf", "title": "S Korea accuses North of sending balloons with excrement across border", "date": "2024-05-30 02:30", "url": "https://japantoday.com/category/world/s.korea-accuses-north-of-sending-balloons-with-excrement-across-border", "message": "Yonhap via REUTERS/File photoBy Jack KimSouth Korea accused North Korea on Wednesday of sending a large number of balloons across their heavily fortified border to drop objects including trash and excrement, calling the act base and dangerous.\nPhotographs released by the South Korean military showed inflated balloons with plastic bags tethered to them.\nBalloons have regularly been sent the other way by South Korean activists, often led by North Korean defectors.\nNorth Korea also attempted to jam GPS signals in South Korea on early Wednesday morning, although no damage was reported, the Donga Ilbo newspaper said, citing multiple unnamed government sources.\nThe two Koreas' large militaries face off across the military border and North Korea routinely threatens to annihilate its neighbor."}, {"id": "b528622c-2644-4707-9c01-82d75e17e4d7", "title": "  Furiosa : A Mad Max  saga review : Representation in Hollywood", "date": "2024-05-30 14:30", "url": "https://www.dailysabah.com/arts/furiosa-a-mad-max-saga-review-representation-in-hollywood/news", "message": "With \"Furiosa: A Mad Max Saga,\" the turn has come for greater representation in one of the traditionally most macho and all-male franchises – that of Mad Max.\nIt explores the back story of Imperator Furiosa, one of the two lead characters in the 2015 Mad Max spinoff \"Mad Max: Fury Road.\"\nThis image released by Warner Bros. Pictures shows a scene from \"Furiosa: A Mad Max Saga.\"\nWith women’s roles defined in this way in the desert world, the converse is that men are expected to be warriors.\nThis image released by Warner Bros. Pictures shows Anya Taylor-Joy in a scene from \"Furiosa: A Mad Max Saga.\""}, {"id": "5e64b9e1-1427-4b4d-b369-ef48f9d92f02", "title": "Blinken condemns  poison  of Russian misinformation", "date": "2024-05-30 13:00", "url": "https://www.lbc.co.uk/world-news/70ce8830c4da43e9b30ca0b1ff9625ce/", "message": "The US Secretary of State hinted that the Biden administration may soon allow Ukraine to use American-supplied munitions to strike inside Russia.\nUS Secretary of State Antony Blinken has attacked Russian attempts to sow discord in democracies with misinformation after hinting that the Biden administration may soon allow Ukraine to use American-supplied munitions to strike inside Russia.\nIn Prague for a Nato foreign ministers meeting, Mr Blinken hit out at Moscow’s use of misinformation and disinformation, calling it a “poison”, and signing an agreement with the Czech government to combat it.\nMr Blinken said the agreement with the Czechs – the 17th such accord the US has signed with partner nations – will help “to effectively deal with misinformation and disinformation, which is a poison being injected into our democracies by our adversaries”.\nThat position appears to be being reconsidered, and Mr Blinken noted that it is a “hallmark” of the Biden administration’s stance on Ukraine to “adapt and adjust” as needed."}, {"id": "426ff9a1-6f0a-4e36-a4c4-3a818d8b124a", "title": " [ Bradford DeLong ] The threat of Trumpflation and a Fed war", "date": "2024-05-30 01:15", "url": "https://www.koreaherald.com/view.php?ud=20240529050716", "message": "In fact, the Bank War ultimately brought financial disruption, commercial bankruptcies, and deflation, thus destroying some share of national wealth and shifting the rest from entrepreneurial debtors to already-rich creditors.\nShould Trump return to the White House and launch a Fed War, the effect would be as economically damaging as Jackson’s Bank War.\nBut, like the Bank War, the effort would probably be popular with his base.\nFed governors and bank presidents who do not feel like spending $5,000 a day on security might be induced to resign.\nJ. Bradford DeLongJ. Bradford DeLong, a former deputy assistant US Treasury secretary, is a professor of economics at the University of California, Berkeley."}, {"id": "0cca3449-fd68-4d52-b676-6f8472c3d877", "title": "How America inadvertently created an  axis of evasion  led by China", "date": "2024-05-30 07:45", "url": "https://www.livemint.com/politics/how-america-inadvertently-created-an-axis-of-evasion-led-by-china-11717053847378.html", "message": "They have inadvertently birthed a global shadow economy tying together democracy’s chief foes, with Washington’s primary adversary, China, at the center.\nUnprecedented finance and trade restrictions on Russia, Iran, Venezuela, North Korea, China and other authoritarian regimes have squeezed those economies by curbing access to Western goods and markets.\nBut Beijing has increasingly foiled those U.S.-led efforts by bolstering trade ties, according to Western officials and customs data.\n“China carries out normal economic and trade exchanges with relevant countries on the basis of equality and mutual benefit,\" he said.\nThe governments of Russia, Iran, Venezuela and North Korea, contacted through their diplomatic offices in the U.S., didn’t respond to requests for comment."}, {"id": "1c3ab42d-02af-4524-9c40-705f9134e3ad", "title": "Taiwan says China is  nibbling away  at its space , trying to create a new normal", "date": "2024-05-30 03:00", "url": "https://www.yahoo.com/news/taiwan-says-china-nibbling-away-024047925.html", "message": "China's military says Taiwan drills met goals but it is ready for further actionA screen shows news footage of military drills conducted in areas around the island of Taiwan by the Eastern Theatre Command of the PLA in BeijingBy Laurie Chen and Ben BlanchardBEIJING/TAIPEI (Reuters) - China's military achieved its \"expected goals\" during two days of drills around Taiwan last week but is prepared for further action if provoked, a defence ministry spokesperson said on Thursday.\nWhile the drills have formally ended, China's military activities have not, with Taiwan saying on Wednesday that Chinese warplanes and warships carried out a \"joint combat readiness patrol\".\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Foreign Minister Lin Chia-lung told reporters at parliament.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said."}, {"id": "253a0e03-b062-494c-9c33-f720602aaf1f", "title": "  Taiwan independence  means war , warns Chinese military", "date": "2024-05-30 14:00", "url": "https://economictimes.indiatimes.com/news/defence/taiwan-independence-means-war-warns-chinese-military/articleshow/110567974.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe Chinese military on Thursday warned that \" Taiwan independence \" means war and said it was ready to take resolute actions to thwart foreign interference in support of \" separatist activities \" in the estranged island.\nChina 's reunification is an irreversible trend of history and the People's Liberation Army ( PLA ) is ready to take resolute actions to counter any \" Taiwan independence\", Chinese military spokesperson Sr. Col. Wu Qian told the media here.Wu was reacting to a question on Taiwan's new leader Lai Ching-te 's pro-independence speech during his swearing-in as the island's new President on May 20.Lai, 64, also known as William Lai, who succeeded his independence-leaning Democratic Progressive Party ( DPP ) colleague Tsai Ing-wen after winning the popular vote in the January Presidential election this year, was sworn in as the president at a ceremony held in Taipei on Monday.China views Taiwan as a rebel province that must be reunified with the mainland, even by force.Lai's DPP party does not seek independence from China but maintains that Taiwan is already a sovereign nation In his no-holds-barred inaugural speech, Lai called on China to stop threatening the island, promised to uphold the status quo in the Taiwan Strait, and called on Beijing to work jointly for peace.Lai's speech is a confession of his attempts to seek \"Taiwan independence\" by force and by relying on external forces, Col Wu said, adding that the PLA firmly opposes this and has responded with strong countermeasures.\n\"Separatist activities seeking 'Taiwan independence' constitute the biggest real threat to peace across the Taiwan Strait,\" Wu said.The PLA shoulders the mission of safeguarding national sovereignty and territorial integrity.\nIt is fully prepared, remains highly vigilant, and is ready to take resolute actions to counter any \"Taiwan independence\" separatist attempts and thwart foreign interference, Wu said.China held massive military exercises around Taiwan just three days after Lai was sworn in as the island's new president.A spokesperson for the Chinese People's Liberation Army (PLA) has called the drills a \"strong punishment\" for \"separatist acts\".The drills, which started early on May 16, happened all around the main island, including the Taiwan Strait to its west, and around the Taiwanese islands of Kinmen, Matsu, Wuqiu and Dongyin.The PLA said the focus of the massive drill was on joint sea-air combat-readiness patrols, precision strikes on key targets, and integrated operations inside and outside the island to test the \"joint real combat capabilities\" of its forces to \"seize\" Taiwan."}, {"id": "aebba860-7e01-488a-8d93-272ba875ab7b", "title": "Montrose Coastguard station moves from erosion - hit seafront", "date": "2024-05-30 06:00", "url": "https://www.thecourier.co.uk/fp/news/angus-mearns/4995221/montrose-coastguard-station-relocates/", "message": "Montrose Coastguard team has set up a new permanent base after storm damage forced it from the rapidly-shrinking town seafront.\nAnd sections of the seafront eventually fell “like a pack of cards” during further severe weather and high tides.\nBut the damage led to the road outside the Coastguard station being closed for weeks.\nThe lifesaving team relocated temporarily to Montrose fire station.\n“The new facility has ample garage space for rescue vehicles and the maintenance of vital rescue equipment."}, {"id": "db10d02d-1233-4cb3-af7c-45d9528c3b25", "title": "Ditching deportation deal a concern for New Zealand", "date": "2024-05-30 09:15", "url": "https://www.smh.com.au/politics/federal/ditching-deportation-deal-a-concern-for-new-zealand-20240530-p5jhwy.html", "message": "The moon that night set about an hour and a half before daylight.\nThis just gave time for the warships and transports of the covering force to steam in and land the troops before dawn.”Charles Bean, the Herald’s first war correspondent.\nLoadingAs the beleaguered Immigration Minister Andrew Giles scrambles to rewrite laws to make it easier to deport them, New Zealand does not want Australia to send Kiwi criminals with little connection to the country across the Tasman.\n“We accept that Australia has the right to determine what level of offending by non-citizens is unacceptable,” New Zealand Foreign Minister Winston Peters said in a statement.\n“But we do not want to see deportation of people with little or no connection to New Zealand, whose formative experiences were nearly all in Australia.”"}, {"id": "e8cda613-11f5-494b-a20c-de4c1fe4042d", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 10:30", "url": "https://www.newsday.com/news/nation/Andy-Negra-World-War-II-DDay-s81979", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nWorld War II veteran Andy Negra sits in his home in Helen, Ga., on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division."}, {"id": "a6011485-6214-4177-b1e0-52266f4a2b16", "title": "Speech Made by Respected Comrade Kim Jong Un on Congratulatory Visit to Academy of Defence Sciences", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/dprk/2024/dprk-240529-kcna02.htm", "message": "This is adding fuel to the military tension in the region and seriously destroying the balance of military forces.\nIn this way, it can implement the plans and intentions of the Party Central Committee thoroughly and perfectly in pushing forward with all the development projects.\nThe five-year strategy for defence development put forward by the Party is an initiative for achieving the best efficiency and radical defence development.\nYou must make redoubled efforts to attain without fail the goals of the five-year strategy for defence development advanced by the Party Central Committee.\nFor our defence scientists and technicians who are fighting death-defyingly for the state's dignity and the people's life, failure is always a prerequisite for success."}, {"id": "658e9643-3337-4ef4-b1c3-ddb1f21706ed", "title": "Belarus halts participation in European military treaty", "date": "2024-05-30 07:15", "url": "https://www.thehindu.com/news/international/belarus-halts-participation-in-european-military-treaty/article68228601.ece", "message": "President Alexander Lukashenko has signed a decree suspending Belarus' participation in a treaty that limits the deployment of conventional forces in Europe, matching a move already taken by ally Russia.\nAlthough not directly involved in the conflict in Ukraine, Belarus hosted Russian troops as Moscow readied to launch its special military operation against Kyiv in February 2022.\nIt said it was doing so after Western countries and NATO members refused to ratify a new version of the treaty that was amended in 1999.\nIn 2008, Russia sent troops into the Georgian regions of Abkhazia and South Ossetia.\nRussian President Vladimir Putin officially rubber stamped Russia's exit from the treaty in May 2023."}, {"id": "96c87ea3-954f-427c-be80-2a878c42801c", "title": "1 arrest after pro - Palestinian protesters block UBC intersection", "date": "2024-05-30 00:00", "url": "https://www.cbc.ca/news/canada/british-columbia/ubc-pro-palestinian-protest-1.7218456", "message": "On Wednesday morning the protesters moved to the road, with about 100 of them blocking the intersection of University Boulevard and Wesbrook Mall, about 250 metres east of the camp.\n\"Despite attempts to facilitate communication with protesters, police action was required to clear the intersection.\"\nA statement from UBC issued on Wednesday afternoon says classes, graduations and other events are proceeding as scheduled.\n\"Any protest actions must be conducted with respect for others and within the boundaries of UBC policy and the law.\"\nPolice block pro-Palestinian protesters from entering an area with recent graduates at the University of British Columbia in Vancouver."}, {"id": "d32acc12-43e8-441b-8884-9fa7e7c39cf3", "title": "Comic Review - It the Calm Before the Storm ( But Not Really ) in  Star Wars : The High Republic Adventures  ( 2023 ) # 6", "date": "2024-05-30 03:30", "url": "https://www.laughingplace.com/w/disney-entertainment/star-wars-high-republic-adventures-2023-6-comic-review/", "message": "Today saw the release of issue #6 in Phase III of Star Wars: The High Republic Adventures from Dark Horse Comics, and below are my brief recap and thoughts on this installment.\nThere, Lula Talisola, Zeen Mrala, and their Jedi friends have taken a bit of shore leave after the space-prison-break events of the past few issues.\nThis immediately makes me wonder how– or if, I suppose– this decision will be squared with the events of an upcoming The High Republic novel, but that’s not out yet so I won’t say why in this review.\nSo it seems like even though she’s leaving the Order, she and Zeen are going to stick around and help out anyway?\nStar Wars: The High Republic Adventures #6 is available now wherever comic books are sold."}, {"id": "3b1e1779-0adc-4a1a-a75a-2cde655eaf94", "title": "11  Bad  Games Well Die Defending", "date": "2024-05-30 03:30", "url": "https://www.kotaku.com.au/2024/05/11-bad-games-well-die-defending/", "message": "Final Fantasy XIII | Final Fantasy XIII-2 | Lightning Returns: Final Fantasy XIIIImage: Square EnixInitially, this was going to be an entry for the original Final Fantasy XIII, but actually, it’s an entry for the entire XIII trilogy, because it all whips.\nBut its sequels, Final Fantasy XIII-2 and Lightning Returns: Final Fantasy XIII are also really great.\nSome might even say Lightning Returns’ Majora’s Mask-style end-of-the-world time management makes for the best single-player Final Fantasy entry since the Final Fantasy X duology.\nZelda II: The Adventure of LinkImage: NintendoI’ve spent a lifetime hearing folks malign Zelda II: The Adventure of Link as “objectively the worst Zelda game” or making other similarly denigrating statements.\nZelda II is both a great game in its own right and one of the best Zelda games."}, {"id": "bc17f10d-fb08-4f96-9983-37051006bb02", "title": "Wichita U . S . Army Veteran built bridges during Vietnam", "date": "2024-05-30 03:15", "url": "https://www.yahoo.com/news/wichita-u-army-veteran-built-010000923.html", "message": "WICHITA, Kan. (KSNW) — Vernon Brooks was drafted while he was attending high school at Sedgwick.\nLike, we done construction of bridges like rope bridges, cable bridges, and log bridges to get our men and supplies across in our training and under fire,” said Brooks.\nHe trained and worked on building different kinds of bridges at the Army base for his entire two-year enlistment.\nU.S. Army Iraq War Veteran struggles with nightmares and PTSD“Well, if you love the country, it’s the thing to do.\nIf you want to nominate a veteran for our Veteran Salute, email KSN reporter Jason Lamb at jason.lamb@ksn.com."}, {"id": "a1971a00-bb7d-46bd-ab1a-fd54ec28a293", "title": "  Am I too fat to ride a horse ? - Horsetalk . co . nz", "date": "2024-05-30 04:00", "url": "https://horsetalk.co.nz/2015/08/18/too-fat-ride-horse/", "message": "This would mean 80 percent of the people riding horses today are too fat!\nAccording to The US Cavalry Manual of Horse Management (1941) a horse should not carry more than 20 percent of its own weight.\nFor most of the 5000 years men have been riding horses they have used them to go places to kill each other.\nAdd this to 200lb of an average armed warrior and the Roman warhorse carried 300lb, well over 30 percent of horse weight.\nBayard Fox, the owner of Equitours, sends people to dozens of countries to ride horses – but he has a weight limit of 200lb."}, {"id": "0817e251-8f9b-4683-abd4-2be8a1ce132b", "title": "Soldiers in Ukraine say US - supplied tanks have made them targets for Russian strikes", "date": "2024-05-30 13:15", "url": "https://www.egyptindependent.com/soldiers-in-ukraine-say-us-supplied-tanks-have-made-them-targets-for-russian-strikes/", "message": "Eastern Ukraine CNN — Ukrainian crews working on US-supplied Abrams tanks have told CNN of a series of the weaknesses and flaws with the armored vehicles, calling into doubt their utility on the war’s ever-changing frontlines.\nMuch of the Ukrainian frontline is now dominated by the use of self-destructing attack drones, tiny and accurate devices that can swarm infantry and even cause significant damage to tanks.\nMick Krever/CNNAmmunition is also a problem, like elsewhere on the Ukrainian frontline.\nNATO “would never” use the Abrams tank the way the Ukrainian military has to use it, a Ukrainian soldier who uses the moniker “Joker” said.\nMick Krever/CNNThe Ukrainian crew expressed frustration the tanks were made for a NATO style of warfare, in which air power and artillery prepare the battlefield before tanks and infantry advance."}, {"id": "8becea80-c8f9-4c49-8ac8-9e6f262f73df", "title": "Palantir Wins $480 Million AI Computer Vision Deal With US Army", "date": "2024-05-30 01:30", "url": "https://www.bnnbloomberg.ca/palantir-wins-480-million-ai-computer-vision-deal-with-us-army-1.2078871", "message": "(Bloomberg) -- The US Army awarded a $480 million contract to Palantir Technologies Inc. for work on a project called the Maven Smart System through 2029.\nThe Maven deal was disclosed Wednesday as part of the Defense Department’s daily contract announcements.\nThe deal further extends Palantir’s relationship with the military, and makes use of the company’s growing suite of artificial intelligence offerings.\nThe Maven project uses AI and computer vision to help soldiers more quickly and accurately identify targets.\nAs more companies have demanded AI tools, Palantir has expanded its commercial business, though government revenue still makes up the majority of sales."}, {"id": "6da49e0b-6b7c-4d16-b8c2-3fbf9a428814", "title": "Splatoon 3 update announced ( version 8 . 0 . 0 ), patch notes", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/splatoon-3-update-announced-version-8-0-0-patch-notes/", "message": "Splatoon 3 is gearing up for its next big update, which will be version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um’ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode."}, {"id": "e89bdcef-b8e9-4756-95ae-b9288430eb05", "title": "New Zealand Defence Force disposes of World War II - era mortar bomb in Whanganui", "date": "2024-05-30 00:00", "url": "https://www.nzherald.co.nz/whanganui-chronicle/news/new-zealand-defence-force-disposes-of-world-war-ii-era-mortar-bomb-in-whanganui/B2YCZ6TRTRFP5BNPCVAPXZHMOA/", "message": "Kyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyKyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyA three-inch drill mortar bomb found by the New Zealand Defence Force (NZDF) on Landguard Rd in Whanganui came from Word War II-era training exercises.\n“The mortar was replaced by the L16 81mm mortar in the 1960s but was likely used in training until the mid-1980s.\n“Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there."}, {"id": "9a805f9e-d86e-4ab0-9f71-9c9d2b911f30", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Winnipeg Free Press", "date": "2024-05-30 04:45", "url": "https://www.winnipegfreepress.com/world/2024/05/29/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nWorld War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division."}, {"id": "8c32e1e8-5a7c-4083-9526-91533ed3997a", "title": "Splatoon 3 Receives A Fresh New Update ( Version 8 . 0 . 0 ), Here Are The Full Patch Notes", "date": "2024-05-30 04:15", "url": "https://www.nintendolife.com/news/2024/05/splatoon-3-receives-a-fresh-new-update-version-8-0-0-here-are-the-full-patch-notes", "message": "Nintendo has announced its next major update for Splatoon 3, bumping the Switch title up to Version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um'ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode."}, {"id": "8cbb4fe4-33e1-450a-8144-1e00660fa6e5", "title": "Second U . S . congressional group in Taiwan since Lai inauguration", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240529-cna03.htm", "message": "Second U.S. congressional group in Taiwan since Lai's inaugurationROC Central News Agency05/29/2024 11:47 AMTaipei, May 29 (CNA) A second group of United States members of Congress visiting Taiwan since President Lai Ching-te's (Ķ│┤µĖģÕŠĘ) inauguration on May 20 arrived in the country Wednesday.\nThe group consists of Senators Tammy Duckworth, Dan Sullivan, Chris Coons, and Laphonza Butler, all of whom are Democrats except for Sullivan, a Republican from Alaska.\nDuckworth, Sullivan and Coons previously visited Taiwan in 2021 to announce that the U.S. would donate 750,000 COVID-19 vaccines to Taiwan, when the country needed them most at the height of the global pandemic.\nAnother bipartisan U.S. congressional delegation led by Republican Michael McCaul, chairman of the House Foreign Affairs Committee, is also in Taiwan until Thursday.\nThe two groups are in Taiwan to show support after China ended a military drill that encircled Taiwan following Lai's inauguration speech, which Beijing believed advocated Taiwan independence."}, {"id": "5ba60ffb-1c7d-4684-beaf-a9e79776f1ba", "title": "Taiwan says China is  nibbling away  at its space , trying to create a new normal", "date": "2024-05-30 04:00", "url": "https://www.thestandard.com.hk/breaking-news/section/3/216887/Taiwan-says-China-is-", "message": "Taiwan says China is 'nibbling away' at its space, trying to create a new normalChina is trying to \"nibble away\" at Taiwan's space and create a new normal with its military drills and other moves to exert pressure, which is a matter for global concern, Taiwanese Foreign Minister Lin Chia-lung said on Thursday.\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Lin told reporters at parliament before taking lawmaker questions.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said.\n\"They are creating a new normal, pressing on at every stage, trying to nibble away and annex (us).\""}, {"id": "6bc4b5ba-e355-492c-b122-5244a62f9b1b", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 04:45", "url": "https://www.yahoo.com/news/100-vet-says-greatest-generation-041238567.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world'World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "0d7042e3-76c3-4ab6-a96e-1521ecdd3158", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 11:30", "url": "https://abcnews.go.com/US/wireStory/100-vet-greatest-generation-moniker-fits-saved-world-110666665", "message": "“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.\nI just went into the service with an open mind.”Now, he proudly lays claim to being part of “The Greatest Generation.”“Because we saved the world,” he said.\nAnd at the same time, I’m saying to myself, they’re going to celebrate my birthday,” said Negra, who turned 100 on May 28.\nSo, if possible, we’re going to we’re going to go see that.”"}, {"id": "df394e7c-19c3-4132-ab72-0ab524f59ade", "title": "Gripen E testing set to ramp up ahead of deliveries to Swedish air force", "date": "2024-05-30 08:00", "url": "https://www.flightglobal.com/defence/gripen-e-testing-set-to-ramp-up-ahead-of-deliveries-to-swedish-air-force/158535.article", "message": "Activities to date have included general performance and sensor testing, along with supporting pilot training for the Swedish air force.\nOther current focus areas for Saab’s Gripen E flight-test programme include weapons integration tasks.\nSeven Gripen Es are already in squadron service with the Brazilian air force at Anapolis air base, with one test aircraft also in use in the country.\nThe nation’s air force will take eight examples, along with 28 single-seat Es, with the first F to be delivered next year for flight testing.\n“The [Hungarian] air force is extremely happy with the Gripen,” notes deputy head of sales and marketing Richard Smith."}, {"id": "f57343d4-76ce-4686-94ff-9ec3583417ac", "title": "Veteran , 100 :  Greatest Generation  Helped  Saved the World  ", "date": "2024-05-30 13:15", "url": "https://www.newsmax.com/us/d-day-veteran-world-war-ii/2024/05/30/id/1166745/", "message": "\"BECAUSE WE SAVED THE WORLD\"It was 1943, and Andrew \"Andy\" Negra Jr. had just finished high school.\n\"There was a war going on, so I went along with everybody else.\nNow, he proudly lays claim to being part of \"The Greatest Generation.\"\nAnd at the same time, I'm saying to myself, they're going to celebrate my birthday,\" said Negra, who turned 100 on May 28.\nSo, if possible, we're going to we're going to go see that.\""}, {"id": "927e9aaf-88bf-488b-989d-15462127c74b", "title": "At 100 , This Vet Says the  Greatest Generation  Moniker Fits  Because We Saved the World  ", "date": "2024-05-30 14:00", "url": "https://www.military.com/daily-news/2024/05/30/100-vet-says-greatest-generation-moniker-fits-because-we-saved-world.html", "message": "“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.\nI just went into the service with an open mind.”Now, he proudly lays claim to being part of “The Greatest Generation.”“Because we saved the world,” he said.\nAnd at the same time, I’m saying to myself, they’re going to celebrate my birthday,” said Negra, who turned 100 on May 28.\nSo, when they strafed, fortunately it was a brick one, and solid.”His plans for his return to France include revisiting the scene."}, {"id": "b2ba2cb9-ac1a-48f7-99f5-ac934cb43609", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:15", "url": "https://www.ksat.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "e25d970b-79dd-4811-96a6-1ab358146002", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:00", "url": "https://www.local10.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "7fd99a03-80ae-4aea-83e9-ec0c9ffcb408", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 07:45", "url": "https://www.news4jax.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "662d1227-385f-4118-886e-c9e35d030fe2", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Metro US", "date": "2024-05-30 08:45", "url": "https://www.metro.us/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "ef942be5-f6db-43c1-a5aa-f580a28143d9", "title": "Assault Class Machine Guns in Isonzo news", "date": "2024-05-30 14:00", "url": "https://www.moddb.com/news/assault-class-machine-guns-in-isonzo", "message": "We've written bits and pieces about the light machine guns in Isonzo (as distinct from the heavy machine guns which are static weapons placed by the map designers) but never brought them all together.\nPosted by WilsonT on May 30th, 2024We've written bits and pieces about the light machine guns in Isonzo (as distinct from the heavy machine guns which are static weapons placed by the map designers) but never brought them all together.\nThese limitations also apply to the machine guns used by the Italian and Austro-Hungarian Assault classes.\nEven with the need to deploy for accurate fire, light machine guns are extremely powerful weapons so it makes gameplay sense to limit their employment.\nand MG08/18 light machine guns."}, {"id": "bd197bb2-cc36-413e-bc49-629e2c2f1c2b", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 07:15", "url": "https://gazette.com/ap/national/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_1ab2ee9e-8b89-5a92-b747-073caeb8332c.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'\nAndy Negra Jr_ proudly lays claim to being among the last of what is known as “The Greatest Generation.”"}, {"id": "7f79ab33-ee4a-4c88-b304-fb57a2986215", "title": "Iran rules out sabotage explosion behind Raisi helicopter crash", "date": "2024-05-30 10:45", "url": "https://www.prokerala.com/news/articles/a1535428.html", "message": "Tehran, May 30 : Iran has ruled out the possibility of a sabotage explosion leading to the helicopter crash that resulted in the deaths of Iranian President Ebrahim Raisi and his entourage, local media reported.\nThe General Staff of Iran's Armed Forces released the second report on the causes of the helicopter crash on Wednesday, reports the official news agency IRNA.\nNo sign of an act of electronic warfare was detected on the crashed helicopter, it said, adding that the weather conditions on the way back to Tabriz, the capital of East Azerbaijan province, would need further investigations.\nAccording to the report, the total weight of the passengers and equipment onboard was proportionate to the helicopter's maximum load limit at the time of takeoff and during the flight.\nThe first report of the investigation committee of the General Staff of Iran's Armed Forces was released on May 23."}, {"id": "109cf45e-5413-4f97-b08a-06a020fc2b2f", "title": "Is North Korea Is  TPing  South Korea ? | The River 103 . 7", "date": "2024-05-30 13:00", "url": "https://www.river1037.com/2024/05/30/is-north-korea-is-tping-south-korea/", "message": "North Korea is now TPing its neighbor, South Korea.\nSouth Korea has been noticing hundreds of balloons flying across the border, not the high-altitude balloons that China was sending over here, just massive helium balloons, carrying bags of garbage.\nThe contents are being analyzed by the South Korean government, but it doesn’t sound like there’s a secret code to solve.\nNorth Korea ADMITS they’re doing this, as a, “tit for tat action.” Yes, they used that phrase.\nNorth Korean officials say they’re tired of South Korean activists sending “propaganda leaflets, food, medicine, radios, and USB sticks containing South Korean news and TV dramas” over to them the same way, with balloons."}, {"id": "4ec81469-b1dd-41d4-ada3-1dc7348b0c47", "title": "China Drills : Unveiling Tensions Around Taiwan", "date": "2024-05-30 09:15", "url": "https://www.devdiscourse.com/article/politics/2955140-chinas-drills-unveiling-tensions-around-taiwan", "message": "China's military achieved its \"expected goals\" during two days of drills around Taiwan last week but is prepared for further action if provoked, a defence ministry spokesperson said on Thursday.\nWhile the drills have formally ended, China's military activities have not, with Taiwan saying on Wednesday that Chinese warplanes and warships carried out a \"joint combat readiness patrol\".\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Foreign Minister Lin Chia-lung told reporters at parliament.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said."}, {"id": "1e43d8f9-fed6-41c8-90dc-68251790a8ca", "title": "Deadline", "date": "2024-05-30 03:15", "url": "https://deadline.com/print-article/1235944326/", "message": "Nelson Peltz may have lost the battle with Disney, but in strict financial terms may have won the war.\nMultiple media outlets, citing an unidentified source familiar with the transaction reported that Peltz’s firm, Trian Fund Management, unloaded its entire stake in Disney.\nA rep from Trian declined to comment when contacted by Deadline.\nThe profit from the stock sale, which occurred as shares were at around $120, came to about $1 billion, reports said.\nDisney stock closed Wednesday at $100.88Peltz, who has waged successful battles against corporate behemoths like Procter & Gamble, came into the Disney clash already a billionaire."}, {"id": "0c550fbc-9a07-41a1-89e9-44bb446d7dca", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:45", "url": "https://www.news-gazette.com/news/nation-world/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_759e7e19-e1a0-5aa1-9062-ae42a1b496dc.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'\nAndy Negra Jr_ proudly lays claim to being among the last of what is known as “The Greatest Generation.”"}, {"id": "5430c4ac-bf09-4884-87fa-1778d57c765e", "title": "Dominican Republic : The Coup That Became a War", "date": "2024-05-30 09:45", "url": "https://time.com/archive/6833716/dominican-republic-the-coup-that-became-a-war/", "message": "Twice before, General Wessin y Wessin, 40, had relied on his planes and tank-equipped supporting troops to settle political disputes in the Dominican Republic.\nAnd for help this time, he called on the U.S. Said Wessin y Wessin: “We saved the country by only a hair.\nMost often it was in the person of Wessin y Wessin.\nIn 1962, Wessin y Wessin helped stop the Armed Forces Secretary from overthrowing the seven-man civilian Council of State that administered the country after Trujillo.\nHe called Wessin y Wessin, who immediately agreed."}, {"id": "0e7fb131-874e-4b0e-bf11-e75fb3e6cf2e", "title": "DPharaoh Woon - A - Tai on Native Representation in Hollywood", "date": "2024-05-30 14:00", "url": "https://www.elle.com/culture/movies-tv/a60582331/dpharaoh-woon-a-tai-hollywood-rising-interview-2024/", "message": "As the rising Oji-Cree First Nations and Guyanese actor reaches new heights, he wants to bring other Indigenous actors up with him.\nHe now resides in California, where he’s lived since getting cast in Reservation Dogs, which premiered in 2021.\nFX D’Pharaoh Woon-A-Tai (Bear), Devery Jacobs (Elora), Lane Factor (Cheese), and Paulina Alexis (Willie) in Reservation Dogs.\n“Reservation Dogs was the first show of its kind regarding Indigenous representation, Indigenous comedy,” Woon-A-Tai says.\nYou can look anywhere, and you’ll definitely find Natives who are willing to try to act.”FX D’Pharaoh Woon-A-Tai as Bear and Devery Jacobs as Elora in Reservation Dogs."}, {"id": "b7b01ed0-0a4d-479d-92dd-9f0448c51a20", "title": "Chrishell Stause Is Officially Joining The Cast Of Neighbours", "date": "2024-05-30 01:00", "url": "https://www.pedestrian.tv/entertainment/chrishell-stause-neighbours-cast/", "message": "There is a tug-of-war that exists in every Australian’s conciousness, and it is a battle between the allure of Sesame Street and the high-stakes drama of Ramsay Street.\nUnfortunately for Elmo, everyone and their dog will now desire going and living amongst the Neighbours now that icon Chrishell Stause is joining the ranks.\nAnnounced this morning, Selling Sunset star Chrishell Stause will soon be bitch-slapping Karl Kennedy, cheating on Paul Robinson and resurrecting Rosemary Daniels on the set of Neighbours.\n“Chrishell Stause will bring glitz, glamour and LOTS of drama when she arrives in Erinsborough later this year.”Business CHIC (Source: Channel 10).\nWill G Flip make a random appearance on Ramsay Street?"}, {"id": "9ca4d358-7b2c-4b75-b4e2-1851872d780a", "title": "Battle of Chinese and Taiwanese Chatbots and a Balloon Battle Between the Koreas", "date": "2024-05-30 00:45", "url": "https://www.houstonpublicmedia.org/npr/2024/05/29/1196981303/battle-of-chinese-and-taiwanese-chatbots-and-a-balloon-battle-between-the-koreas/", "message": "NPRBattle of Chinese and Taiwanese Chatbots and a Balloon Battle Between the KoreasTaiwan has developed a large language model artificial intelligence chat bot to compete with a product from China because of fears regarding national security.\nAnd North Korea sends garbage-filled balloons over the border into South Korea, escalating a long-standing balloon battle between the Koreas.\nSign up for State of the World+ to listen sponsor-free and support the work of NPR journalists.\nVisit plus.npr.org."}, {"id": "2e3d4086-d65a-41b8-b16f-7ac05c79f1be", "title": "Remembering Hattie B . Dorsey : Atlanta civil rights , equitable housing leader", "date": "2024-05-30 01:30", "url": "https://www.fox5atlanta.com/news/remembering-hattie-b-dorsey-atlanta-civil-rights-equitable-housing-leader", "message": "articleAtlanta is mourning the passing of civil rights activist and community development leader Hattie B. Dorsey.\n\"Hattie supported me as a city council candidate and mayoral candidate, and we talked all the time about our favorite topic: affordable housing.\nHattie B. Dorsey’s early life and educationDorsey grew up witnessing the struggles associated with inadequate housing and economic disparities.\nIn Atlanta, Dorsey continued her education at David T. Howard High School.\nWhile Hattie B. Dorsey may not be a household name, her impact on affordable housing and community redevelopment is undeniable."}, {"id": "48f2b0aa-07c4-48fc-ae63-00f0d8697d8b", "title": "Cleared for publication : Two soldiers murdered in attack near Shechem", "date": "2024-05-30 03:45", "url": "https://www.israelnationalnews.com/news/390786", "message": "The IDF Spokesperson's Unit on Thursday morning cleared for publication that two soldiers were murdered in the ramming attack near Shechem (Nablus) on Wednesday evening: Staff sergeant Eliya Hilel, 20, from Tel Zion, and Staff sergeant Diego Shvisha Harsaj, 20, from Tel Aviv.\nIn addition, the IDF confirmed that Staff sergeant Yedidya Azugi , 21, from Revava, fell in battle in the northern Gaza Strip.\nA soldier from the 101st Battalion of the Paratroopers Brigade was seriously injured in the battle in which Azugi fell.\nIn addition, two soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip.\nAll the soldiers were evacuated to hospital for medical treatment and their families were notified."}, {"id": "8f39f846-0df5-4eb8-a5e5-5a6feea0c1b4", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:15", "url": "https://www.wfmz.com/news/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_9829ce9e-f750-5f23-bbf3-940c28dbb2a6.html", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)"}, {"id": "f8b6ccc3-0fe1-4412-9a64-38e548c942e5", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-05-30 05:00", "url": "https://www.tvguide.co.uk/schedule/93e198e4-a2ef-5017-84e3-a1519e0b1237/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Thursday 30 May Share Add toCalendar +Hidden Heroes of D-Day Season 3 Episode 5 of 10 S Subtitles Audio DescriptionBruce Crompton uncovers plans for the D-Day invasion, experiences a bumpy landing in a Dakota aeroplane, and in France his passion hits new heights with a parachute jumpCombat Dealers airs on Discovery Channel HD at 9:00 AM, Thursday 30 May .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "966620c8-89de-47b9-9c90-8d103685e959", "title": "What America Can Learn From Israel on the Battlefield", "date": "2024-05-30 05:30", "url": "https://www.frontpagemag.com/what-america-can-learn-from-israel-on-the-battlefield/", "message": "America has never successfully liberated and held territory from Islamic terrorists.\nAfter thousands dead in Afghanistan and Iraq: both countries are now controlled by Islamic terrorists.\nBut those successes pitted one group of Islamic terrorists against another.\nIslamic terrorists fighting warring gangs over territory are far preferable to terrorists building rockets and missiles.\nIn Afghanistan and Iraq, we used military force to achieve political and diplomatic aims, while Israel is using military force to achieve military aims."}, {"id": "240fa819-4f37-481f-b568-56c057a40259", "title": "Israel says offensive in Gaza could last for seven months", "date": "2024-05-30 00:00", "url": "https://www.pasadenastarnews.com/2024/05/29/israel-says-offensive-in-gaza-could-last-for-seven-months/", "message": "Israel says the corridor is awash in tunnels that have funneled weapons and other goods for Hamas — despite a yearslong blockade imposed by Israel and Egypt.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.\nEgypt has repeatedly expressed concerns that the Israeli offensive could push Palestinians across the border — a scenario Egypt says is unacceptable.\nThe Israeli military official said Israel has also taken “tactical control” of Tel al-Sultan, a neighborhood on Rafah’s northwest edge."}, {"id": "d8e14c7a-3e1e-41ff-8d5e-571f62168a05", "title": "Loran Smith : Alan Kinder returns to France for 80th anniversary of D - Day", "date": "2024-05-30 08:45", "url": "https://www.yahoo.com/news/loran-smith-alan-kinder-returns-081042434.html", "message": "Kinder is the guest of a patriotic nonprofit which is taking him and seven other Normandy veterans to France for the invasion anniversary celebration.\nThe most significant vignette in Kinder’s miliary career came later when Japan’s official and unconditional surrender came about Sept. 2, 1945.\n“We were all so grateful for the Japanese surrender.\nKinder, grew up on acreage near Bellevue, Washington, where he tended pigs, cows, and chickens.\nThis article originally appeared on Augusta Chronicle: Loran Smith: Alan Kinder was part of the D-Day invasion in France"}, {"id": "22666af8-1bae-4f62-a07b-371af735b324", "title": "Inside the Battle to Preserve  Black Wall Street  ", "date": "2024-05-30 14:00", "url": "https://www.yahoo.com/news/inside-battle-preserve-black-wall-130000749.html", "message": "Her hope is that the district, known as “Black Wall Street,” will soon secure that history-honoring and legacy-preserving designation, as the country prepares to observe the 103rd anniversary of the attack on Friday.\nAlso on Capitol Hill fighting for Greenwood to receive monument status was Crutcher, whose great-grandmother escaped the assault in Tulsa.\nBlack Tulsans were afraid to bring up what had occurred, since no one had ever been held accountable for the killings.\nLast month, the survivors entered the Oklahoma Supreme Court to appeal a judge’s 2023 dismissal of their lawsuit seeking restitution.\n“I believe that if we want to be on the right side of history, then America — the city of Tulsa — needs to make it right.”The post Inside the Battle to Preserve ‘Black Wall Street’ appeared first on Capital B News."}, {"id": "44b6f525-7988-41a5-98cd-1b94cdef9205", "title": "Putin purge of his top generals | The Spectator", "date": "2024-05-30 00:00", "url": "https://www.spectator.co.uk/article/putins-purge-of-his-top-generals/", "message": "More are likely to follow in what looks like a gathering purge by the Federal Security Service (FSB).\nBut could Putin’s purge hinder the war effort by throwing the military leadership into disarray at a time when Russia is seeking to take advantage of Kyiv’s munitions shortages?\nIt’s worth looking at the last major purge of Russian military top brass, undertaken by Stalin between 1937 and 1940.\nPutin’s purge will of course be less dramatic.\nBut with half the top brass covering their backsides and the other half seeking to denounce their way to the top, there is potential for much disruption in Putin’s war plans."}, {"id": "dda1fb30-8def-42cc-9cd6-e4a4e9969b29", "title": "Vonn Bell , Jordan Battle rotating at safety ; Dax Hill working at cornerback", "date": "2024-05-30 01:45", "url": "https://www.cincyjungle.com/2024/5/29/24167140/vonn-bell-jordan-battle-safety-dax-hill-cornerback-bengals-otas", "message": "The Cincinnati Bengals secondary struggled at times in 2023, largely thanks to inexperience at the safety position.\nDax Hill struggled as Jessie Bates’ replacement, and Nick Scott was completely ineffective, eventually being replaced by rookie Jordan Battle.\nThe team focused on the safety position this offseason by signing Geno Stone and bringing Bell back to Cincinnati.\nAccording to Charlie Clifford, Bell was taking starting snaps at safety over Battle, and DJ Turner was taking snaps at starting outside corner opposite Cam Taylor-Britt ahead of Hill.\nAt the corner position, it should be no surprise that Turner is taking snaps over Hill."}, {"id": "0c2ccfaa-0e3a-42cf-85ec-b037b741d944", "title": "Rose Festival Grand Floral Parade Grand Marshal Announced", "date": "2024-05-30 00:00", "url": "https://k103.iheart.com/content/2024-05-29-rose-festival-grand-floral-parade-grand-marshal-announced/", "message": "The Portland Rose Festival announced today the 2024 Grand Floral Parade Grand Marshal is Greg McKelvey, the prolific band director at Battle Ground High School.\n“Greg represents everything we love about the Rose Festival and Grand Floral Parade,” said Contesa Diaz-Nicolaidis, Rose Festival Board President.\nWe are so fortunate that Greg’s dedication to his students was matched in his dedication to sharing their talents with Portland and the world, for so many years.”Greg McKelvey is a Rose Festival legend, maybe the most prolific high school band director to participate in Rose Festival events over his decades-long career.\nThe Rose Festival is pleased to honor Greg as this year's Grand Floral Parade Grand Marshal, with gratitude and good wishes for his decades of dedication to music education and to his students.\nSource: Rose Festival"}, {"id": "7b5d59cd-01dd-43f2-aa34-4947024edfd1", "title": "Rose Festival Grand Floral Parade Grand Marshal Announced", "date": "2024-05-30 00:30", "url": "https://1059thebrew.iheart.com/content/2024-05-29-rose-festival-grand-floral-parade-grand-marshal-announced/", "message": "The Portland Rose Festival announced today the 2024 Grand Floral Parade Grand Marshal is Greg McKelvey, the prolific band director at Battle Ground High School.\n“Greg represents everything we love about the Rose Festival and Grand Floral Parade,” said Contesa Diaz-Nicolaidis, Rose Festival Board President.\nWe are so fortunate that Greg’s dedication to his students was matched in his dedication to sharing their talents with Portland and the world, for so many years.”Greg McKelvey is a Rose Festival legend, maybe the most prolific high school band director to participate in Rose Festival events over his decades-long career.\nThe Rose Festival is pleased to honor Greg as this year's Grand Floral Parade Grand Marshal, with gratitude and good wishes for his decades of dedication to music education and to his students.\nSource: Rose Festival"}, {"id": "a8ab8d7c-f1f6-4f2f-982f-c0dff7a0ae02", "title": "Clash of Ancient Warriors - Sky History", "date": "2024-05-30 08:45", "url": "https://www.tvguide.co.uk/schedule/26310aca-a5fb-503e-bdde-7a12f8f9723c/clash-of-ancient-warriors", "message": "Clash of Ancient WarriorsSky History 2:00 PM to 3:00 PM Thursday 30 May Share Add toCalendar +The Battle of Thermopylae Season 1 Episode 3 S SubtitlesThe Battle of Thermopylae, fought in 480 BC between the Achaemenid Persian Empire under Xerxes I and an alliance of Greek city-states led by Sparta under Leonidas I.\nThe Persians ultimately claimed victoryClash of Ancient Warriors airs on Sky History at 2:00 PM, Thursday 30 May .\n(Subtitles.)\nLearn more about Clash of Ancient Warriors and other education/science/factual topics on our factual page"}, {"id": "31123e3a-14f8-4b7d-9805-916fa1d262bd", "title": "In Mayurbhanj , it  Odisha ki beti  vs Naveen welfare schemes | India News", "date": "2024-05-30 01:45", "url": "https://timesofindia.indiatimes.com/india/in-mayurbhanj-its-odisha-ki-beti-vs-naveens-welfare-schemes/articleshow/110547914.cms", "message": "“Modi govt has honoured the tribal community by picking Mayurbhanj’s Murmu as President.\n“The CM has been working to take Odisha to a new height of development.\nIn the five elections from 1980 to 1996, it was with Congress.On the ground, opinions of locals present a mixed picture.\nRabindra Pattanayak, 65, an advocate based in Rairangpur, for instance, believes that President Murmu’s connection to Mayurbhanj is a major draw for voters.\nHowever, Saiba Murmu, 25, also from Rairangpur, lauds the BJD govt’s pro-poor and pro-tribal schemes."}, {"id": "57dd2149-05bc-476d-a600-e535e6c8b781", "title": "China military says Taiwan drills met goals but it is ready for further action", "date": "2024-05-30 13:15", "url": "https://www.thestandard.com.hk/breaking-news/section/3/216912/China", "message": "Taiwan Air Force Mirage 2000-5 aircraft prepare to take off at Hsinchu Air Base, in Hsinchu, Taiwan May 23, 2024.\nREUTERS/Carlos Garcia RawlinsChina's military achieved its \"expected goals\" during two days of drills around Taiwan last week but is prepared for further action if provoked, a defence ministry spokesperson said on Thursday.\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Foreign Minister Lin Chia-lung told reporters at parliament.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said."}, {"id": "d6609743-0b6f-4290-a0a3-6f01fdc1f5e1", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:15", "url": "https://www.hillingdontimes.co.uk/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "b01b99d9-9e6c-4996-ab13-89e23ff3e3fd", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:30", "url": "https://www.eastlothiancourier.com/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "a654ae56-de97-48ea-a2a6-2c5137bbb420", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:30", "url": "https://www.stourbridgenews.co.uk/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "d6f96df8-0970-4165-8872-33109cae86e7", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:15", "url": "https://www.thecomet.net/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "57ff2fc9-51a1-4846-aa1d-d5560af4585b", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:15", "url": "https://www.northsomersettimes.co.uk/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "9755aa10-25af-4171-81ce-b30683d3ff66", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:00", "url": "https://www.asianimage.co.uk/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "062aa6e1-5a3a-488c-a2bc-44bfc1e5cc68", "title": "Finn who completed national service says it could teach valuable skills", "date": "2024-05-30 13:00", "url": "https://www.redditchadvertiser.co.uk/news/national/24355475.finn-completed-national-service-says-teach-valuable-skills/", "message": "Daniel Simojoki was trained in weapon and navigation systems during his time in military service (Daniel Simojoki/PA)Prime Minister Rishi Sunak wants to introduce a new form of national service for 18-year-olds, which would see them join the armed forces or take part in public service volunteering over the course of a year.\nMr Simojoki said he thought national service could “instil a level of discipline and teach people valuable life and social skills” if it was brought into force in the UK, with the potential to become a rite of passage over a longer period of time.\nPrime Minister Rishi Sunak, pictured on a visit to defence vehicle manufacturer Supacat in Exeter, wants to introduce a new form of national service (Aaron Chown/PA)“I learnt a lot about myself and new-found limits and at the end of the day, it’s quite good fun.\n“That definitely has an impact and that’s why I don’t think it’s a thing that should be taken lightly, especially when people don’t have a choice – I had a choice, uniquely.\n“There’s such a culture so it makes it very accepted but I just don’t think the same thing exists in England."}, {"id": "8db36a0f-9d8d-4552-aacf-2362b2d458a2", "title": "Evidence of cancer treatment found in 4 , 000 - year - old skull", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/WeirdNews/815138-Evidence-of-cancer-treatment-found-in-4,000-year-old-skull", "message": "Evidence of cancer treatment found in 4,000-year-old skullWeirdNews WeirdNews Evidence of cancer treatment found in 4,000-year-old skullThis is an extraordinary new perspective in our understanding of the history of medicineFollow on Published On: Thu, 30 May 2024 07:36:34 PKT(Web Desk) - An international team of researchers says it has found evidence of ancient Egyptians performing experimental treatments or medical explorations of human cancer more than 4,000 years ago.\nResearchers noted that the man had a tumor — they observed about 30 small round lesions scattered across his skull.\nThe Cancer History Project reports that the earliest description of human cancer dates back to Egypt from around 3000 BC.\nThe Greek physician Hippocrates (460-370 BC) is credited with first calling the disease cancer.\nThe female skull, meanwhile, showed bone destruction from a cancerous tumor and two healed lesions from injuries."}, {"id": "5954da8b-2aba-4400-8720-3fb2f2bc71d8", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:00", "url": "https://www.whec.com/national-world/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n‘I need you.’ And, I was drafted.”World War II veteran Andy Negra sits in his home in Helen, Ga., on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n“There was a war going on, so I went along with everybody else."}, {"id": "164f80a6-2a35-4c59-b9c2-7e91c43ef681", "title": "Tekken 8 plus Mortal Kombat 1 and its Kombat Pack discounted to cheapest price ever in PlayStation Days of Play sale", "date": "2024-05-30 01:15", "url": "https://www.eventhubs.com/news/2024/may/29/play-sale-tekken-mk1/", "message": "PlayStation just launched its Days of Play sale, which includes some pretty sweet fighting game deals, to kick off the end of the school year and start of the Summer season.\nUnfortunately, said standard version and the Ultimate Edition remain their usual prices though this is also only the second time we've seen Tekken 8 go on sale now after launching back in January.\nThe other big pick up in this sale is Mortal Kombat 1 plus its Kombat Pack hitting the lowest prices the game and its DLC have have reached with both discounted a whopping 60%.\nNickelodeon All-Star Brawl 2 plus its Season Pass DLC are also included in the sale alongside Guilty Gear Strive with its first two seasons (though those still holding out for a Season 3 discount will need to keep waiting).\nYou can check out the full list of fighting games and DLC in the Days of Play sale below, which will go on until June 14."}, {"id": "76e77990-87c5-4d88-91a4-ebc7589af87a", "title": "San Francisco quietly removes  Appeal to Heaven  flag from outside City Hall after Alito flap", "date": "2024-05-30 01:00", "url": "https://www.foxnews.com/media/san-francisco-quietly-removes-appeal-heaven-flag-from-outside-city-hall-after-alito-flap", "message": "The city of San Francisco confirmed it had removed the \"Appeal to Heaven\" flag from outside City Hall over the weekend, just days after it was reported to have been flown outside a conservative Supreme Court justice's house.\nThe San Francisco Chronicle reported Wednesday that the Revolutionary War-era flag was taken down after 60 years in the Civic Center Plaza on Saturday.\nThe outlet reported that the Appeal to Heaven flag \"was among the original 18 raised by the city on June 14 — Flag Day — in 1964.\"\n\"The ‘Appeal to Heaven’ flag is part of our proud heritage of Faith and Freedom and every American should be proud to fly it,\" he concluded.\nSen. Sheldon Whitehouse, D-R.I., said on X that Alito’s \"Appeal to Heaven\" flag was a \"MAGA battle flag,\" in one instance."}, {"id": "43ba6f37-84bc-4af2-aca3-8132c904c767", "title": "Call of Duty : Warzone - All Ranked Play Rewards | Season 4", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499896/article/call-of-duty-warzone-all-ranked-play-rewards-season-4/", "message": "More Call of Duty guidesModern Warfare 3: All Ranked Play Rewards | Season 4 | MW3 and Warzone: How to Unlock the Kar98k | MW3 and Warzone: How to Unlock the Superi 46 | MW3 and Warzone: How to Unlock the JAK Harbinger Kit | Modern Warfare 3: How to get a DNA Bomb | Call of Duty: Modern Warfare 3 – How to Earn Weapon Prestige Camos | Call of Duty: Warzone – What is the Rebirth Infil Strikes Public Event?\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Warzone – What is the Utility Box Field Upgrade?\n| Call of Duty: Modern Warfare 3 – Minefield Mode Explained | Call of Duty: Warzone – All Urzikstan Nuke Rewards | Call of Duty: Warzone – How to get a Nuke and Complete the Champion’s Quest in Urzikstan |How high will you climb?"}]