[{"id": "5b7e9ddc-ca2e-4fbe-b70f-b3c1b1710360", "title": "Freedom of Expression : A Double Standard Fueling Antisemitism In united kingdom Academia ? ", "date": "2024-06-05 16:15", "url": "https://roarnews.co.uk/2024/freedom-of-expression-a-double-standard-fueling-antisemitism-in-uk-academia/", "message": "Staff writer, and CAMERA-On-Campus fellow, Patrick Schnecker examines the recent rise in UK antisemitism and questions whether universities are doing enough to put the fears of Jewish students at ease.\nAntisemitic cases have reached the highest level in UK recorded history, particularly impacting Jewish students on university campuses.\nSince January, Jewish students at the University of Leeds have similarly been under what can only be described as constant attack.\nAround the same time, the Hillel House, used as a community centre for Jewish students, was vandalised with “Free Palestine” graffiti.\nIt is not only hypocritical but highly discriminatory, for the administration and police to allow this sort of censorship-bullying of Jewish students."}, {"id": "d0051fa4-6faf-4ed9-9e22-71962098e635", "title": "Obituary : Yvonne Green", "date": "2024-06-05 10:30", "url": "https://www.thejc.com/news/obituaries/obituary-yvonne-green-lzf0zpiq", "message": "An elegant figure dressed in black with a simple brooch, Green read with impassioned yet contained emotion.\nGreen also read her poem to the Knesset in Jerusalem and in Australia, at Sydney’s Sephardi community.\nHer first pamphlet, Boukhara was published in 2007 and won the 2007 Poetry Business Book & Pamphlet Competition.\nOn July 3, 2017 Green read out Bejan Matur’s poems at The Kurdish Sisterhood event organised by the Exiled Lit Cafe at the Poetry Café.\nYvonne Green is survived by her husband Brian Green KC and their four children, Charlotte, Jasmine, Bertie and Rachael."}, {"id": "a67a159e-a171-4e6e-a5ce-1f3fb7e1b701", "title": "Friend of Goldberg - Polin keeps hope that he will be released", "date": "2024-06-05 00:00", "url": "https://richmond.com/news/state-regional/in-chicago-friend-of-hersh-goldberg-polin-keeps-hope-that-hostage-will-be-released/article_81c2dce2-22a7-11ef-aecf-53df5405c1ac.html", "message": "“I wouldn’t want nobody else to drive the truck,” Smith said, clutching the Star of David around his neck.\nHe’s like, ‘Just for you, I’m gonna keep running.’”He even traveled with the family to Hersh’s bar mitzvah in Israel.\nHersh’s family had no idea if he was alive until April 24, when Hamas released a three-minute video of him in captivity.\n“I had given up hope.”Hersh’s parents launched an international campaign, Bring Hersh Home, to raise awareness for the hostage crisis.\n“But I’m just here to spread awareness about all the hostages.”The truck was concocted by Jeff Aeder, a close friend of Hersh’s family."}, {"id": "d0c0a17f-5816-475a-baed-b376d7d31ab5", "title": "Chicago truck driver raises awareness for childhood friend held hostage in Gaza", "date": "2024-06-05 08:45", "url": "https://www.yahoo.com/news/chicago-truck-driver-raises-awareness-080000148.html", "message": "To Smith, he’s like a brother.\n“I wouldn’t want nobody else to drive the truck,” Smith said, clutching the Star of David around his neck.\nHersh’s family had no idea if he was alive until April 24, when Hamas released a three-minute video of him in captivity.\n“I had given up hope.”Hersh’s parents launched an international campaign, Bring Hersh Home, to raise awareness for the hostage crisis.\n“But I’m just here to spread awareness about all the hostages.”The truck was concocted by Jeff Aeder, a close friend of Hersh’s family."}, {"id": "68e19d23-acd3-4d7f-a206-4bb01411d8b2", "title": "Religion and Foreign Policy Webinar : USCIRF 2024 Annual Report on International Religious Freedom", "date": "2024-06-05 16:15", "url": "https://www.cfr.org/event/uscirf-2024-annual-report-international-religious-freedom-rfp-webinar", "message": "Ms. Cassidy’s expertise includes the International Religious Freedom Act, international organizational issues, international and comparative law issues, and refugee and asylum policy.\nWe really appreciate this opportunity to speak with you today about international religious freedom and its role in U.S. foreign policy.\nThe violations in these countries are egregious and well documented, including in the State Department’s own International Religious Freedom Report.\nGovernments are pursuing religious minorities and religious freedom advocates beyond their borders all throughout the world.\nThe State Department’s annual International Religious Freedom Report also plays a key role in doing this, as does USCIRF’s reporting."}]