[{"id": "10ebaaea-7ff8-4ce0-add3-c57f81daf840", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-16 04:00", "url": "https://abcnews.go.com/International/top-isis-leader-somalia-target-us-airstrike/story?id=111160552", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "fe06dfda-c559-43f6-a732-42ca5e7528a3", "title": "US targeted Islamic State group leader in airstrike last month : Report", "date": "2024-06-16 01:00", "url": "https://www.washingtonexaminer.com/policy/defense/3046728/us-islamic-state-group-leader-airstrike-last-month/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "U.S. forces launched an airstrike last month in Somalia targeting the leader of the Islamic State group, Abdulqadir Mumin.\nThe Office of the Director of National Intelligence lists Mumin as the leader and founder of the Islamic State group’s Somalia affiliate, which has between 100 and 400 members.\nThe unnamed U.S. officials said he became the global leader of the terrorist group after his predecessor, Abu al-Hassan al-Hashimi al-Qurayshi, died in combat in October 2022 in Syria.\nIraq and Syria are home to the largest concentrations of Islamic State group members, but U.S. forces have been effective against leadership there.\n“Somalia remains central to the security environment in East Africa,” according to AFRICOM."}, {"id": "0769c7c8-26e8-4c19-a000-417350774ca7", "title": "Lebanon Hezbollah targets Israeli military positions in fresh retaliatory strikes", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah targets Israeli military positions in fresh retaliatory strikesIran Press TVSaturday, 15 June 2024 11:32 AMHezbollah has carried out a fresh round of strikes against Israeli military positions in the north in response to the recent Israeli assassination of a top commander in southern Lebanon.\nSami Abdallah, better known by the nom the guerre Abu Taleb, was assassinated along with three other people in the Israeli strikes that targeted a residential building in the southern Lebanese town of Jwaya on Tuesday.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006.\nHezbollah's greatest achievement is the fact that there are tens of thousands of displaced people in the north,\" Gordin said."}, {"id": "a76fbd3a-0496-49cb-b8ca-7cb3e0b66f20", "title": "Lebanon Hezbollah warns of  decisive  response to Israeli expansion of war", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah warns of 'decisive' response to Israeli expansion of warIran Press TVSaturday, 15 June 2024 8:50 AMA senior official of Lebanon's Hezbollah resistance movement has warned the Israeli regime of a \"decisive\" response in case of expanding the scope of its war on Lebanese soil.\nThe senior Hezbollah official cautioned the Israeli regime against any further actions and said, \"You saw how we responded to the assassination of Commander Abu Taleb and his companions.\"\nThe Israeli regime has repeatedly attacked southern Lebanon since October 7, 2023, when it launched a ferocious war on the besieged Gaza Strip that has so far killed about 37,300 Palestinians, most of them women and children.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006."}, {"id": "fbe36686-1453-4e9e-8550-1cc1feb307f6", "title": "Palestinian resistance rocket attacks Zionist settlement of Sadirot", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Palestinian resistance rocket attacks Zionist settlement of SadirotIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- News sources announced on Friday night that the rocket attacks by the Palestinian resistance from Gaza towards the Zionist settlement of Sadirot.\nFrom Shahab Palestinian news agency, Saraya al-Quds resistance group announced that the Zionist settlement of Sadirot in the Gaza Strip was targeted by rocket attacks.\nAccording to this report, the alarm of a missile attack has sounded in the Zionist settlements bordering Gaza.\nAccording to IRNA, after more than seven months have passed since the Zionist regime invaded the Gaza Strip without any results and achievements, this regime is sinking more and more into its internal and external crises.\nDuring this period, the Zionist regime has not achieved anything other than crime, massacre, destruction, war crimes, violation of international laws, bombing of relief organizations and famine in this region."}, {"id": "52eb1810-0d5c-47f0-8a01-6c01baf61503", "title": "21 Filipino seafarers from Houthi - attacked ship rescued , 1 more missing", "date": "2024-06-16 06:15", "url": "https://www.sunstar.com.ph/manila/21-filipino-seafarers-from-houthi-attacked-ship-rescued-1-more-missing", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "THE Department of Migrant Workers (DMW) confirmed on Saturday, June 15, 2024, the successful rescue of 21 out of the 22 Filipino seafarers on board a ship that was attacked by the Houthi rebels in the southern Red Sea.\nAt least 17 Filipino crew members of the Galaxy Leader remain in the hands of the Houthi rebels after they attacked the vessel in November 2023.\nHe said the administration of President Ferdinand Marcos Jr. imposed a whole-of-government approach to help Filipino seafarers attacked by the Houthi rebel group in the Red Sea.\nTwo Filipino seafarers were also killed while 11 others were safely rescued and repatriated following a missile attack by Houthi to a bulk carrier True Confidence.\n“The return of the two seafarers’ remains are expected to be home soon,” said Cacdac."}, {"id": "7f22c4b2-50aa-4bd2-bd11-b5bb7a44e46d", "title": "US Naval forces rescue crew from Greek - owned ship struck by Houthis in Red Sea By Reuters", "date": "2024-06-16 08:45", "url": "https://www.investing.com/news/commodities-news/us-naval-forces-rescue-crew-from-greekowned-ship-struck-by-houthis-in-red-sea-3486012", "domain": "investing.com", "domain_classification": "Unknown", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "7199dbe1-61e5-40e3-8f26-0f0ddf6279bc", "title": "Israel - Hamas update : Eight Israel Defence Forces soldiers killed in deadliest incident in months", "date": "2024-06-16 04:00", "url": "https://www.9news.com.au/world/israel-hamas-update-eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-incidents-for-the-idf-since-october-7/d5f6b01e-b860-4197-a9f9-22557ac45fdd", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defence Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nIsrael identified one of the dead soldiers as Captain Wassem Mahmoud, Deputy Company Commander in the Engineering Battalion.\nVarious other ministers expressed their sorrow at the deaths, including defence minister Yoav Gallant, foreign minister Israel Katz and national security minister Itamar Ben Gvir.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defence Directorate in Gaza said."}, {"id": "c04b949c-1efd-46e0-8cb8-ab3b8144d301", "title": "IDF releases names of 5 more soldiers killed in Rafah explosiom", "date": "2024-06-16 06:45", "url": "https://www.ynetnews.com/article/skmtpknra", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The serious incident occurred in the early hours of Saturday morning, when the massive explosion occurred in an armored vehicle near the Tel a-Sultan refugee camp.\nThe names of two other fallen soldiers are expected to be released later on Sunday.\nInside the armored vehicle there were eight soldiers who were killed.\"\nIt was developed in Israel, entered service in 2016 and replaced the Puma combat armored engineering vehicle.\nIt is based on a regular infantry armored personnel carrier, but includes some improvements and adjustments and can carry 10 soldiers."}, {"id": "ba0d4213-1983-4faa-b66e-0b7d9db633c6", "title": "Two Arrested in Allegedly Gang - Related Costa Mesa Shooting", "date": "2024-06-16 03:30", "url": "https://mynewsla.com/crime/2024/06/15/two-arrested-in-allegedly-gang-related-costa-mesa-shooting-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men have been arrested on suspicion of attempted murder for a shooting connected to a memorial for a man stabbed to death in Costa Mesa earlier this week, authorities said Saturday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive.\nPolice were able to identify two suspects connected to the Friday morning shooting and identified them as Eric Garcilazo, 19, and Elmer Suarez-Morales, 20, both of Costa Mesa.\nOfficers located Suarez-Morales on Friday afternoon, who was pulled over in a vehicle and arrested without incident.\nAnyone with information on the stabbings or shooting was asked to call Costa Mesa police at 714-754-5097."}, {"id": "478b61c7-06c2-4916-9887-ebf39c08ddc8", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616981c599015.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning."}, {"id": "4ca1fc92-755f-46ed-b000-6039a3526a70", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:30", "url": "https://apnews.com/article/auburn-maine-armed-standoff-fire-aad7f7d1eb430d5c49fb1455daeff5e1", "domain": "apnews.com", "domain_classification": "International", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting."}, {"id": "b5731293-ae83-4b14-a3f7-80f14540911a", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 04:00", "url": "https://www.kiro7.com/news/national/maine-police-kill/RPPFZUK46GNQTDU6JAU6FLW6OE/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "0ed3558c-8393-498c-bd4b-6b408d8cb86c", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 03:45", "url": "https://tulsaworld.com/ap/national/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_b68e7e72-ff4c-5ed2-ae83-e1aa64104f60.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus."}, {"id": "b1020ea2-2810-4524-9087-2d1e601d9d4d", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 02:30", "url": "https://www.wfmz.com/news/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_d2a8eba8-2d13-50ef-a7e9-e3f47733e660.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday.\n(Russ Dillingham/Sun Journal via AP)"}, {"id": "c8f0bc31-d12b-4441-bd47-53778b211fad", "title": "US warns of further retaliation if Iran - Winning Bet Picks", "date": "2024-06-16 09:30", "url": "http://www.myanmarmuslim.net/news/2024061657a599886.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Mr Sullivan said Iran should expect “a swift and forceful response” if it, and not one of its proxies, “chose to respond directly” against the US.\nIran has tried to distance itself from the drone strike, saying the militias act independently of its direction.\nThe Biden administration has so far appeared to stop short of directly targeting Iran or senior leaders of the Quds Force within its borders.\nThe statement from Iran on the Behshad and Saviz ships appeared to signal Tehran’s growing unease over the US strikes across the region.\nThe ships are registered as commercial cargo ships with a Tehran-based company the US treasury has sanctioned as a front for the state-run Islamic Republic of Iran Shipping Lines."}, {"id": "068d7215-6aec-403a-8f53-4b5a4fc21c2c", "title": "Israel Hamas War News Live Updates : Israel army says eight soldiers killed in Gaza", "date": "2024-06-16 00:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-palestine-war-news-live-updates-gaza-rafah-lebanon-hamas-ceasefire-june-16-june-17/liveblog/111026807.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "For months, the United States, France, and other mediators have tried to halt the tit-for-tat strikes between Israel and Hezbollah, a powerful militia and political faction backed by Iran.\nIsrael has warned that it is prepared to take stronger action to dislodge Hezbollah militants from southern Lebanon.\nThis week, both sides escalated their attacks, raising concerns about another front in the conflict as Israel continues its offensive against Hamas in the Gaza Strip.\nIt was unclear if Gallant was speaking for the entire Israeli government.“ As we fight a just war, defending our people, France has adopted hostile policies against Israel,” Gallant wrote on social media.\n“Israel will not be a party to the trilateral framework proposed by France.”Stay with TOI for latest updates:"}, {"id": "d5991854-40d3-468d-a36f-165f5a426055", "title": "Israel rescues hostage Noa Argamani from Hamas captivity in Gaza , newly released footage shows", "date": "2024-06-16 06:30", "url": "https://nypost.com/2024/06/16/world-news/israel-rescues-hostage-noa-argamani-from-hamas-captivity-in-gaza-newly-released-footage-shows/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza.\nYou’re safe, we’re taking you to the vehicle.”Argamani, a 26-year-old China-born Israel citizen, was one of four hostages rescued during the operation.\n8 Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza on June 8.\n“We’re from the Yaman (Police) and Shabak (ISA),” one person explains to Argamani inside the vehicle.\nIsrael Foreign Ministry/UPI/Shutterstock8 Argamani, a 26-year-old China-born Israel citizen, Supernova music festival on Oct. 7 when Hamas attacked."}, {"id": "6a5af2d1-d3ca-40f7-b082-0e227509dd1d", "title": "Hezbollah rockets damaged 35 % of Israeli settlements in Metula town : Mayor", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah rockets damaged 35% of Israeli settlements in Metula town: MayorIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- The rocket attacks of the Lebanese resistance movement Hezbollah have damaged 35% of Israeli settlers' houses in al-Metula town in northern occupied Palestine, according to the town's mayor.\nThe Israeli regime's Channel 12 quoted the mayor as saying that more than 190 houses in this settlement, that is, about 35% of its houses, were damaged in Hezbollah's missile attacks.\nHezbollah's missiles have caused heavy damage to the infrastructure, electricity network and agricultural lands of Metula town, he added.\nMeanwhile, The Zionist Army Radio announced that Lebanon's Hezbollah fired more than 60 rockets into occupied Palestine on Friday.\nEarlier, Hebrew sources reported a massive fire in the Baram area in northern occupied Palestine following Hezbollah's rocket attacks and the efforts of four firefighting teams to control the fire."}, {"id": "dd4b2507-3724-4f60-b072-c42f17a0dc93", "title": "Cuba Does Not Approve of US Submarine Presence - Deputy Foreign Minister", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/cuba/cuba-240615-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Cuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterSputnik News20240615MEXICO CITY (Sputnik) - The Cuban government was notified of the USS fast attack submarine Helena visiting the US naval base in Cuba's Guantanamo, but Havana does not approve of such visits, Cuban Deputy Foreign Minister Carlos Fernandez de Cossio said.\n\"We were aware of their presence because, in accordance with the procedures that we have followed for years, the United States informed us in advance.\nUS Southern Command (SOUTHCOM) said Wednesday the USS fast attack submarine Helena made a pre-planned deployment to the US naval base at Guantanamo Bay, Cuba.\nThe deployment followed the Russian naval force's arrival in Cuba for naval exercises.\nUS officials previously noted that the Russian naval deployment to Cuba does not pose a threat to the United States."}, {"id": "7c03e13d-3107-4649-9816-51011c85ead1", "title": "Maine police kill armed man after a night of gunfire and burned homes that left a man missing", "date": "2024-06-16 01:30", "url": "https://www.gjsentinel.com/news/us/maine-police-kill-armed-man-after-a-night-of-gunfire-and-burned-homes-that-left/article_63110243-5875-5bd6-9a66-b7c5a8573c4b.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday."}, {"id": "efb8300a-0bde-4f23-9986-54d6cf3680b8", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-16 01:30", "url": "https://www.gjsentinel.com/news/world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_0c7fd223-4da2-51ac-9314-e470d602ea06.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThat's what its leaders and experts tell The Associated Press, whose journalists visited U.S. ships off Yemen in recent days."}, {"id": "195bec62-d31a-4216-be08-4bad4fb7961a", "title": "Why Russia Bond With North Korea Is a Danger to the World", "date": "2024-06-16 04:15", "url": "https://www.yahoo.com/news/why-russia-bond-north-korea-030000285.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "North Korea has likely received military aid in return that has increased the threat it poses to the US and its allies in East Asia.\nSatellite imagery shows arms transfers from North Korea to Russia took off after that.\nPutin will be in North Korea on Tuesday and Wednesday, according to South Korea’s Dong-A Ilbo newspaper.\nNorth Korea has also tested a close-range ballistic missile with an estimated range of about 110 kms.\nMore North Korean arms transfers to Russia would increase Ukraine’s need for US as well as European military assistance."}, {"id": "59ed0e95-df75-44ce-8cde-3625547e6291", "title": "Why Russia Bond With North Korea Is a Danger to the World", "date": "2024-06-16 04:00", "url": "https://www.bnnbloomberg.ca/why-russia-s-bond-with-north-korea-is-a-danger-to-the-world-1.2085704", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "North Korea has likely received military aid in return that has increased the threat it poses to the US and its allies in East Asia.\nSatellite imagery shows arms transfers from North Korea to Russia took off after that.\nPutin will be in North Korea on Tuesday and Wednesday, according to South Korea’s Dong-A Ilbo newspaper.\nNorth Korea has also tested a close-range ballistic missile with an estimated range of about 110 kms.\nMore North Korean arms transfers to Russia would increase Ukraine’s need for US as well as European military assistance."}, {"id": "2f3681d0-40e5-47c7-bdac-2e91f3e0f75a", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7", "date": "2024-06-16 01:30", "url": "https://kvia.com/news/us-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nThe Israeli military has so far released the names of six of the eight soldiers killed in the incident.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said."}, {"id": "f0cf36bb-ac55-4d78-b20b-8a85df0c2096", "title": "US Navy says faces most intense combat since World War II against Yemen", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-isna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Navy says faces most intense combat since World War II against YemenISNA - Iranian Students' News AgencySat / 15 June 2024 / 09:40The US-led campaign to protect Israeli interests in the Red Sea has escalated into the \"most intense\" running sea battle the Navy has faced since World War II, according to an AP report quoting American military commanders and experts.\nEric Blomberg told the AP aboard the USS Laboon warship in the Red Sea.\nBryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute, told the AP, \"this is the most sustained combat that the US Navy has seen since World War II.\"\nYemen initiated its naval operations in the Red Sea in October to help bring the US-Israeli genocide in Gaza to a halt.\nThe Yemeni leader vowed that they will continue to target American warships in the Red Sea and beyond, including the aircraft carrier USS Dwight D. Eisenhower."}, {"id": "ea86aa28-e5a9-40b4-ae31-4d95ff39ac89", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7 - LocalNews8 . com", "date": "2024-06-16 00:00", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7-2/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nThe Israeli military has so far released the names of six of the eight soldiers killed in the incident.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said."}, {"id": "e8a01b2a-f80c-4a56-9366-fc58ac2017ed", "title": "The previous 5 No . 12 picks of NBA draft : What can OKC Thunder expect ? ", "date": "2024-06-16 00:00", "url": "https://okcthunderwire.usatoday.com/lists/the-previous-5-no-12-picks-of-nba-draft-what-can-okc-thunder-expect/", "domain": "okcthunderwire.usatoday.com", "domain_classification": "Unknown", "message": "The 2024 NBA draft is less than two weeks away, which means the Oklahoma City Thunder will soon add a lottery talent to their young core.\nThe youngest first seed in league history owns the No.\n12 pick via the Houston Rockets,The Thunder will get a chance to add a role player to their young trio of Shai Gilgeous-Alexander, Chet Holmgren and Jalen Williams.\nOr perhaps OKC can feel frisky and swing for the fences knowing it has room for error.\n12 selections and what they did in their rookie seasons:"}, {"id": "52448f85-7354-4a07-8463-b9ea067040d7", "title": "8 Israeli soldiers killed in Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 01:00", "url": "https://www.houstonpublicmedia.org/npr/2024/06/15/nx-s1-5007398/8-israeli-soldiers-killed-in-gaza-in-deadliest-attack-on-israeli-forces-in-months/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Israel's military said on Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\n(Ohad Zwigenberg | AP)JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "755e2470-046c-4462-9770-7f083c71ce0b", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 05:15", "url": "https://www.prokerala.com/news/articles/a1539783.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Baghdad, June 16 : A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "604619bc-c9b4-4302-8e8e-a06fbbe1f0b6", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 06:45", "url": "https://www.thestatesman.com/world/iraqi-shiite-militia-claims-missile-attack-on-israel-1503310538.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on “a site in Haifa”, Xinhua news agency reported.\nIt provided no further details about the targeted location or any resulting casualties.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "83babe3e-3381-485b-a7cb-51899f70fb42", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://komonews.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "komonews.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "71d5fc79-327c-4a7d-8603-031e96def13e", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://www.wcti12.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "ef5de267-4f29-42b1-b6af-e6eede0ee5ae", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:00", "url": "https://wjla.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wjla.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "456bd2bb-70d9-4032-b2c4-8a05d8a522ad", "title": "Iraqi Shiite Militia Claims Missile Attack On N . Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338215/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-N-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BAGHDAD, Jun 16 (NNN-NINA) – A Shiite in Iraq, yesterday, claimed responsibility for an attack with a missile, on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement that, its fighters launched an attack at dawn yesterday, with a long-range al-Arqab upgraded cruise missile, on“a site in Haifa.”It provided no further details about the targeted location or any resulting casualties.\nThe militia stressed that, the attack was carried out“in solidarity with the people in the Gaza Strip” and pledged to continue its attacks on“the enemy's strongholds.”Earlier yesterday, the movement claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and U.S. targets in the region, since the outbreak of the Gaza conflict on Oct 7, last year.– NNN-NINA"}, {"id": "a28e9016-4c6c-4b8e-91cf-73f6209edda7", "title": "Iraqi Shiite Militia Claims Missile Attack On Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338213/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Baghdad, June 16 (IANS) A Shiite in Iraq has claimed responsibility for an attack with a missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023."}, {"id": "5cb76764-220a-41a3-907d-41ab4679aa52", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 03:30", "url": "https://gazette.com/ap/international/8-israeli-soldiers-killed-in-southern-gaza-in-deadliest-attack-on-israeli-forces-in-months/article_c08b0b07-8cc9-5286-9a79-3fcb884eac0b.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsIsrael’s military says that eight soldiers have been killed in southern Gaza in the deadliest attack on Israeli forces in months"}, {"id": "a5d933b6-ac35-4246-8c28-4e445e03a1e9", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://wlos.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wlos.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "6046afc2-f5da-4635-b400-235cbd2caa41", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://turnto10.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "02e75e43-c18a-456b-a317-546636122a22", "title": "8 Israeli soldiers killed in southern Gaza", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658056/8-israeli-soldiers-killed-in-southern-gaza", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "Attack on Israeli forces was the deadliest in months🔊 Listen to thisIsraeli army bulldozers are seen near the Gaza Strip border, in southern Israel, on Thursday.\nJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after."}, {"id": "fbb47210-94d1-4264-a3c6-a6506f689ef0", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 01:00", "url": "https://foxbaltimore.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "76d51231-8b55-43c9-b0ff-a59f04d37209", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://news3lv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "7bf4a24c-2532-47d1-bfd8-fb5326ee1f54", "title": "Eight more Israeli soldiers killed in south Gaza : Report", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Eight more Israeli soldiers killed in south Gaza: ReportIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Eight Israeli soldiers were killed in an explosion that blew up a military vehicle of the Zionist regime in the south of the Gaza Strip, according to a report.\nAl Mayadeen news channel said that an anti-armor missile blew up a \"Tiger\" military vehicle of the Zionist regime on Saturday.\nAccording to the news channel, eight Israeli soldiers were killed in the Palestinian resistance operation.\nMeanwhile, the Al-Qassam Brigades, the military wing of Hamas, announced on Saturday that it destroyed an Israeli D-9 type bulldozer with an Al-Yassin 105 rocket in Tel al-Sultan area, west of Rafah, in the south of the Gaza Strip.\n6125**4354NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "55701eea-fa39-4492-81ba-44b1a8452597", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 00:45", "url": "https://lasvegassun.com/news/2024/jun/15/8-israeli-soldiers-killed-in-southern-gaza-in-dead/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsTsafrir Abayov / Associated PressJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after."}, {"id": "22f3529f-deae-46fc-a2ce-9bc228657f4b", "title": "Israel rejects Macron initiative to defuse Hezbollah conflict", "date": "2024-06-16 01:30", "url": "https://news.yahoo.com/news/israel-rejects-macron-initiative-defuse-150000834.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Israel’s defence minister has rejected Emmanuel Macron’s initiative to work together on defusing an escalating conflict along the northern border with Lebanon.\nBut Yoav Gallant on Friday ruled out joining a plan pushed by the French president that included France, the United States and Israel forming a contact group to try to find a solution.\n“As we fight a just war, defending our people, France has adopted hostile policies against Israel,” Mr Gallant said in a statement.\nHezbollah has ruled out ending hostilities until there is a ceasefire between Israel and Hamas, which has so far proved elusive.\nUS President Joe Biden’s envoy Amos Hochstein is expected to arrive in Israel on Monday to help calm tensions, Axios reported."}, {"id": "697571f6-9a46-4e62-8164-fe3265f9c484", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas -- China Economic Net", "date": "2024-06-16 02:00", "url": "http://en.ce.cn/main/latest/202406/16/t20240616_39038453.shtml", "domain": "en.ce.cn", "domain_classification": "Unknown", "message": "GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage."}, {"id": "0f992db2-3bf7-4893-b3d2-0d2e8e35eaa9", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 03:30", "url": "https://www.nbcmontana.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "d36777ee-0a7d-4eee-a409-86649ad981a8", "title": "Crew Abandons Cargo Ship Hit By Houthi Missile Strikes In Gulf Of Aden : US", "date": "2024-06-16 02:30", "url": "https://article.wn.com/view/2024/06/16/Crew_Abandons_Cargo_Ship_Hit_By_Houthi_Missile_Strikes_In_Gu/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The crew of a bulk cargo carrier that was damaged in a missile attack by Yemen's Huthi rebels in the Gulf of Aden has abandoned the ship, the US military said Saturday.\n...... read full story"}, {"id": "63d7ac86-cb0d-44b0-8569-80926dfc31ae", "title": "Vladimir Putin marks anniversary of annexation of Ukrainian regions", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616841f599104.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin has insisted that the residents of four Ukrainian regions illegally annexed by Moscow a year ago “made their choice — to be with their fatherland”.\nIn an address released in the early hours to mark the first anniversary of the annexation, Mr Putin insisted it was carried out “in full accordance with international norms”.\nMeanwhile, in Ukraine, air defences shot down 30 out of 40 Iranian-made kamikaze drones aimed at the Odesa, Mykolaiv and Vinnytsia provinces overnight, the Ukrainian air force said.\nRomania’s Ministry of National Defence said on Saturday that “a possible unauthorised entry” into its national air space occurred overnight amid the bombardment.\nRussia’s Defence Ministry said on Saturday that it had shot down nine Ukrainian rockets fired at its southern Belgorod region, which borders Ukraine."}, {"id": "8419c7cc-fcbe-473f-ac99-420acb496b07", "title": "APC tragedy in Rafah : Names of five soldiers who fell cleared for publication", "date": "2024-06-16 04:15", "url": "http://www.israelnationalnews.com/news/391590", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "- Staff sergeant Stanislav Kostarev, 21, from Ashdod.\n- Staff sergeant Orr Blumovitz, 20, from Pardes Hanna-Karkur.\n- Staff sergeant Oz Yeshaia Gruber, 20, from Tal Menashe.\nOn Saturday night, it was cleared for publication that one of the eight IDF soldiers killed in Rafah was Captain Wassem Mahmoud , 23, from Beit Jann.\nCommenting on the incident, IDF Spokesperson, Rear Admiral Daniel Hagari, said on Saturday night, \"Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\""}, {"id": "be4b657d-7a04-45d3-8856-ccc4833e3f34", "title": "Woman stabbed multiple times next to ATM ; police search for suspect", "date": "2024-06-16 00:00", "url": "https://www.yahoo.com/news/woman-stabbed-multiple-times-next-213942847.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (FOX 5/KUSI) — Authorities are searching for an armed suspect after a 25-year-old pregnant woman was brutally attacked in Mira Mesa on Saturday, authorities said.\nThe suspect then reportedly pushed the victim to the ground before stabbing her two more times in the upper body.\nSan Diego Police released the below photos of the suspect to FOX 5/KUSI.\nSan Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)San Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)Anyone with more information is asked contact the San Diego Police Department’s Northeastern Division at 858-538-8026 or Crime Stoppers at 888-580-8477.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "31d7436e-5377-4b1f-a6bd-8a58b1a3ab95", "title": "8 Israeli Soldiers Killed in Southern Gaza", "date": "2024-06-16 06:00", "url": "https://www.theepochtimes.com/world/8-israeli-soldiers-killed-in-southern-gaza-5669358", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "JERUSALEM—Israel’s military said Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\nThe troops were killed in an explosion, the army said, without elaborating.\nThe deaths will likely fuel calls for a cease-fire and heighten Israeli public anger over ultra-Orthodox exemptions from the military.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian terrorists in Gaza."}, {"id": "b59a3fa8-4061-4ad1-a846-7f581b97468b", "title": "Eight Israeli soldiers killed in southern Gaza", "date": "2024-06-16 05:00", "url": "https://www.afr.com/world/middle-east/eight-israeli-soldiers-killed-in-southern-gaza-20240616-p5jm5y", "domain": "afr.com", "domain_classification": "Unknown", "message": "Jerusalem | Israel’s military said on Sunday it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries destined for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nThe “tactical pause” announced by the military, which applies to about 12 kilometres of road in the Rafah area, falls far short of a complete ceasefire in the beleaguered territory that has been sought by the international community, including Israel’s top ally, the United States.\nIf it holds, the limited halt in fighting could help address some of the overwhelming needs of Palestinians that have surged even more in recent weeks with Israel’s incursion into Rafah."}, {"id": "2afc51bd-247a-4a1a-817a-d82a930e9e0b", "title": "Gallatin neighbors fearful after home explosion believed to be intentional", "date": "2024-06-16 04:45", "url": "https://www.wsmv.com/2024/06/16/gallatin-neighbors-fearful-after-home-explosion-believed-be-intentional/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "GALLATIN, Tenn. (WSMV) - A mid-morning boom that neighbors thought was a lightning strike, a sonic boom even, turned out to be an incident many won’t forget on Chaffin Court.\nThat boom, which shook homes over half a mile from the blast site, was caused by a home explosion investigators believe to be resulting from a natural gas leak.\n“The glass on this [front door] was leaning over.”Multiple neighbors reported shattered glass on the outside of their homes.\n[PREVIOUS: Woman critically injured after Gallatin home explosion, official says]“[My son said] She’s on her way back, she’s out walking,” Perdue recalled.\nThey said a gas line exploded.”The cause of the explosion remains under investigation, but investigators with the Tennessee Bureau of Investigation believe the blast was intentional."}, {"id": "972e3267-07d8-47cd-964e-8c0d0d188e62", "title": "Nearby Iranian ship ignores distress call of ship attacked by Houthis", "date": "2024-06-16 03:45", "url": "https://www.jpost.com/breaking-news/article-806366", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Anna Meta ship responded on Saturday to the distress call of the Verbena, a Palauan-flagged, Ukrainian-owned, Polish-operated bulk cargo carrier, and took the crew to safety.\nThe ship was attacked in the Gulf of Aden last week by the Yemen-backed Houthis using cruise missiles, and the distress call indicated that Verbena was abandoning the ship, The US Army's Central Command (CENTCOM) stated in a Saturday night X post.\nThe vessel's crew struggled to contain fires following the strike.\nThe post added that an Iranian frigate was eight nautical miles away from the ship at the time of the distress call and did respond.\n\"This continued malign and reckless behavior by the Iranian-backed Houthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden,\" the statement added."}, {"id": "5f544f0c-931c-47f2-b6de-c650f658d6d0", "title": "8 soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 02:00", "url": "https://article.wn.com/view/2024/06/16/8_soldiers_killed_in_southern_Gaza_in_deadliest_attack_on_Is/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\n...... read full story"}, {"id": "38081322-7e31-46f8-a9dc-794bf3659edf", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://bakersfieldnow.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "b03c955d-67a7-4e55-b4f8-6520efbd5d69", "title": "50 - year - old man stabbed in downtown Cleveland", "date": "2024-06-16 05:15", "url": "https://www.cleveland19.com/2024/06/16/54-year-old-man-stabbed-downtown-cleveland/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "CLEVELAND, Ohio (WOIO) - A 50-year-old man was stabbed in downtown Cleveland Saturday evening.\nAccording to Cleveland EMS, they were called to the scene of the stabbing just past 8:45 p.m. at East 12th and Walnut Ave.Cleveland Police say the man was stabbed in the chest and received various cuts to his face.\nCleveland EMS say the victim was taken to the hospital in stable condition.\nPolice say a suspect in the stabbing is in custody.\nCopyright 2024 WOIO."}, {"id": "6c3fa68d-2ba9-4cc1-a29e-af1c195c90c7", "title": "Rishi Sunak was given a  secret briefing  after Putin feared nuclear submarine Kazan was detected without warning off the coast of Scotland this month", "date": "2024-06-16 02:30", "url": "https://www.dailymail.co.uk/news/article-13534619/rishi-sunak-secret-briefing-russia-kazan-havana.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Rishi Sunak was given a 'secret briefing' after a Russian nuclear submarine was spotted off the coast of Scotland earlier this month, it has been revealed.\nThe 13,800-tonne submarine Kazan passed by Britain's nuclear naval base in Faslane without crossing into British waters, prompting swift reports back to the Permanent Joint Headquarters in Northwood, London, The Express reported.\nCuba's foreign ministry said the vessels carried no nuclear weapons, an assertion echoed by U.S. officials.\nRussian pro-war Telegram channels boasted that Kazan has 'guided missile weapons' on board as it passes close to the American coastline, around 25 miles east of Florida.\nBoth the Admiral Gorshkov and the Kazan are normally key vessels in Putin's nuclear strike force."}, {"id": "1c98116b-4c82-4753-a953-8c8fd1cb58bb", "title": "Iran Update , June 15 , 2024 | Institute for the Study of War", "date": "2024-06-16 02:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-june-15-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, June 15, 2024Johanna Moore, Alexandra Braverman, Kitaneh Fitzpatrick, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nWest Bank: Israeli forces engaged PIJ and the al Aqsa Martyrs Brigades fighters in Kfar Dan.\n[2]Hamas and the Nasser Salah ad Din Brigades conducted mortar and rocket attacks targeting Israeli forces along the Netzarim Corridor on June 15.\nHamas and the al Aqsa Martyrs’ Brigades conducted rocket propelled grenade attacks targeting IDF vehicles.\nThe Martyr Abu Ali Mustafa Brigades launched a salvo of rockets targeting Israeli forces stationed at the Kerem Shalom border crossing."}, {"id": "f5d10832-9c27-4e08-9bdb-a74ea002beb8", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 04:00", "url": "https://www.ivpressonline.com/news/nation/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_53e77bc2-0dd7-55e3-a621-657231f34c15.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "a4319375-6d4d-480c-b342-81dc7d0b33cd", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 05:30", "url": "https://www.thesunchronicle.com/news/nation_world/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_1d541218-005f-51f1-b52c-c4c9d0ff3a1e.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Maine police kill armed man after a night of gunfire, burned homes and another person deadA Maine State Police tactical team has killed a man on a rooftop after an hourslong standoff in which he shot at officers and two homes burned down"}, {"id": "fdce06ba-567b-468b-ac9a-0477425d83a6", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:15", "url": "https://kitchener.citynews.ca/2024/06/15/explosions-heard-as-maine-police-deal-with-armed-individual/", "domain": "kitchener.citynews.ca", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting."}, {"id": "e8153f19-cba4-40fc-a0c1-1c71c9870943", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://www.krcrtv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "krcrtv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "dcd91894-aa22-417e-b015-bc4eda965d64", "title": "US Navy faces most intense combat since WWII against Yemen : Report", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Navy faces most intense combat since WWII against Yemen: ReportIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- The ongoing combat against Yemen is considered the most intense running sea battle the US Navy has faced since World War II, media outlets have reported.\n\"This is the most sustained combat that the U.S. Navy has seen since World War II — easily, no question,\" said Bryan Clark, a former Navy submariner and a senior fellow at the Hudson Institute.\n… If you let it fester, the Houthis are going to get to be a much more capable, competent, experienced force.\"\nFrom the outset of war in Gaza in October 2023, over 37,000 mostly women and children have been killed in the enclave.\n7129**9417NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "5a907d69-54e3-4a2d-83cd-c5a6583e80e2", "title": "What to look out for at Eurosatory , Europe biggest defense show", "date": "2024-06-16 07:15", "url": "https://www.defensenews.com/digital-show-dailies/eurosatory/2024/06/16/what-to-look-out-for-at-eurosatory-europes-biggest-defense-show/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "European governments have raised their defense budgets “so the business is there,” and military planners attending the show will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing.\nLook out at Eurosatory for hardy, expendable tactical drones, as well as stealthy drones that can operate close to the battle.\nDeep firesWith artillery being key on the Ukrainian battlefield, cannons and rocket artillery will be a major topic at Eurosatory 2024, with at least 10 manufacturers showcasing their systems, Beaudouin said.\n“We’re at the dawn, but only at the dawn, of a new definition of armored vehicles,” Beaudouin said.\n“War always takes us by surprise, and forces us to adapt.”Rudy Ruitenberg is a Europe correspondent for Defense News."}, {"id": "89a0cfb2-c084-4950-b09e-d9ef0dd7850e", "title": "Nagastra - 1 : India first indigenous suicide drone", "date": "2024-06-16 06:30", "url": "https://www.dnaindia.com/analysis/report-new-standard-for-tactical-warfare-nagastra-1-is-india-first-indigenous-suicide-drone-3093593", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Loitering munitions can circle above a target area and wait for the right moment to strike.\nThis advanced technology was developed by Solar Industries in Nagpur and marks an important achievement for the ‘Atmanirbhar Bharat’ (‘Self-Reliant India’) initiative.\nSolar Industries took on the arduous task of manufacturing several kinds of weaponized drones and the successful production of the Nagastra-1 is a good beginning.\nThe Indian Army has ordered the purchase of 480 drone munitions from Economic Explosives Ltd (EEL), a company fully owned by Solar Industries, as part of an emergency consignment.\nAfter successful inspection from May 20 to May 25, EEL has delivered the first batch of 120 drone munitions to the Ammunition Depot in Pulgaon."}, {"id": "bd345bb8-2d01-453a-9294-64025ede7e0e", "title": "Every Israeli , both Jews and Arabs , equal in life and death - editorial", "date": "2024-06-16 04:45", "url": "https://www.jpost.com/opinion/article-806347", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Wassem Mahmoud, a Druze Israeli who proudly served his country until his last breath.\nThe tragic deaths of Mahmoud and the seven other IDF soldiers underscore a pressing issue in Israeli society that must be urgently addressed: racism.\nThe Druze community must be equal partners not only in battle and mourning but also in life.”Tarif is correct.\n(credit: AMMAR AWAD/REUTERS)However, their contributions are often overshadowed by systemic racism and social discrimination that persist in Israeli society.\nIsraeli society must acknowledge and combat racism to create a more inclusive and cohesive nation."}, {"id": "2d5b5c52-d39b-43c2-8892-62b8d4edc17e", "title": "US military still has an edge , but China is catching up with hi - tech weapons", "date": "2024-06-16 01:00", "url": "https://www.scmp.com/news/china/military/article/3266740/us-military-still-has-edge-china-catching-hi-tech-weapons", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "This is the third article in a series about China’s military development, from weapons and aircraft to its role in the global supply chain and how it compares with the United States.\nWashington expressed “deep concerns” and repeatedly warned about the PLA’s regional military build-up as Beijing stepped up drills near Taiwan.\nChina’s defence industry is “robust” as a majority of the companies are state-owned with strong connections to the central leadership and “generous” funding, Heath said.\nOnly two countries – China and Russia – have such weapons in service.\nAccording to an annual report on China’s military power published in October, Beijing has the “world’s leading hypersonic arsenal” and has dramatically advanced its supersonic missile technologies in the past two decades."}, {"id": "8e8da4e3-f7da-4e72-b6d1-0346ed733a46", "title": "North Korea building roads , walls inside Demilitarized Zone Yonhap", "date": "2024-06-16 07:15", "url": "https://www.philstar.com/world/2024/06/16/2363309/north-korea-building-roads-walls-inside-demilitarized-zone-yonhap", "domain": "philstar.com", "domain_classification": "Unknown", "message": "North Korea building roads, walls inside Demilitarized Zone — YonhapA South Korean soldier stands guard near a military facility (R, green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju on June 11, 2024.\nSEOUL, South Korea — North Korea's military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nWhen asked about the report, the South Korean military said in a statement that it was \"closely tracking and monitoring the activities of the North Korean military\", and that \"further analysis is required\".\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture."}, {"id": "67499e00-cb18-46fb-a991-561ced5cc042", "title": "Modern warfare no longer solely physical domain : IAF chief V R Chaudhari – Indian Defence Research Wing", "date": "2024-06-16 04:00", "url": "https://idrw.org/modern-warfare-no-longer-solely-physical-domain-iaf-chief-v-r-chaudhari/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Modern warfare no longer solely physical domain: IAF chief V R Chaudhari| BySOURCE: PTIModern warfare is no longer a solely physical domain, but a dynamic and ever-evolving landscape increasingly influenced by complex data networks and advanced cyber technologies, Air Chief Marshal VR Chaudhari said on Saturday.\nIt is no longer solely physical domain.\nAs leaders you all need to adapt, innovate and leverage technology effectively for proving decisive in winning wars, the Air Chief Marshal said.\nAs you embark on this extraordinary journey, let the core values of Indian Air Force-mission, integrity and excellence be your guiding beacon, he advised the cadets.\nThe ceremony included presentation of ‘Wings’ to the Flight Cadets, officers of Indian Navy, Indian Coast Guard, and officers from friendly foreign countries who successfully completed their flying training."}, {"id": "2942b529-b37b-4886-9bb8-9bcbebc13b17", "title": "Arcade Archives Vs . Star Luster gameplay", "date": "2024-06-16 00:45", "url": "https://nintendoeverything.com/arcade-archives-vs-star-luster-gameplay/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "As part of its latest live stream, Hamster showed off its latest Arcade Archives game – that being Vs. Star Luster.\nThe player uses the Star luster “G.A.I.A” to fight the invader “Battura” who is trying to cause a big bang.\nThe Arcade Archives series has faithfully reproduced many classic Arcade masterpieces.\nHave a look at the Arcade Archives Vs. Star Luster gameplay below.\nGameplayArcade Archives Vs. Star Luster is located on the Switch eShop."}, {"id": "424c0ffa-4e07-4e78-b50a-7fcc11c3548e", "title": "Bf - 109 -  hybrid  models , extended version addon - IL - 2 Sturmovik : 1946", "date": "2024-06-16 04:00", "url": "https://www.moddb.com/games/il-2-sturmovik-1946/addons/bf-109-hybrid-models-extended-version", "domain": "moddb.com", "domain_classification": "Unknown", "message": "L-2 Sturmovik (Ил-2 Штурмовик) is a WWII combat flight simulator video game, focused on the air battles of the Eastern Front.\nIt is named after the Soviet Ilyushin Il-2 ground-attack fighter, which played a prominent role in this theatre and is the single most produced military aircraft design to date.\nAlong with its sequels, IL-2 Sturmovik is considered one of the leading World War II flight simulators."}, {"id": "e6b2ad00-25a1-4f0f-99c6-d25173d0558f", "title": "Nokor building roads , walls inside Demilitarized Zone – Yonhap", "date": "2024-06-16 03:30", "url": "https://manilastandard.net/news/314459953/nokor-building-roads-walls-inside-demilitarized-zone-yonhap.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -North Korea’s military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nSouth Korean authorities said it was likely accidental, and Yonhap quoted a military spokesman as saying some of the North Koreans were carrying work tools.\nThen, South Korea resumed blasting K-pop songs and news broadcasts at the North, using loudspeakers installed at the border.\nIt has previously threatened artillery strikes against the South Korean loudspeakers – a psychological warfare tactic that dates back to the 1950-53 Korean War."}, {"id": "73b2dd80-69b6-47da-b6b8-8437132c1977", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658059/ukraine-employs-a-flexible-defense-while-waiting-for-new-western-ammo-to-get-to-the-front", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukrainian firepower has been improving since U.S. lawmakers approved a much-needed military aid package this spring, though not quickly enough to halt the Russian offensive in eastern Ukraine.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago.\nOne unit in the Chasiv Yar area said a quarter of its casualties happen while transporting troops to and from front-line positions.\nTor, the commander of the Kotyky unit in Chasiv Yar, said Russia’s ever-present drones have made it impossible to mask especially large troop movements."}, {"id": "addb2a18-a8f1-4a25-8786-f26996f47d16", "title": "Wyoming History : Battle Of The Rosebud Started … ", "date": "2024-06-16 02:30", "url": "https://cowboystatedaily.com/2024/06/15/wyoming-history-battle-of-the-rosebud-started-great-sioux-wars-of-1876/", "domain": "cowboystatedaily.com", "domain_classification": "Unknown", "message": "It’s called the Battle of the Rosebud by historians, and the Battle Where the Girl Saved Her Brother by the Cheyenne and other native tribes.\n“He gets on and they ride out through the Northern Cheyenne battle line.\n(Cowboy State Daily Staff)The New York Herald carried an account of the Battle of the Rosebud on Saturday, June 24, 1876.\n(Cowboy State Daily Staff)Cheyenne’s Democratic Leader reports on June 24, 1876, the results of the Battle of the Rosebud from a correspondent with Crook.\n(Cowboy State Daily Staff) Arrow left Arrow rightNatives ‘Magnificently Mounted’Journalists embedded with Crook reported that the native warriors were skilled."}, {"id": "5c0fd64e-2aba-471e-b8c3-29ff48901ac7", "title": "More Gazans Killed As Israeli Strikes Continue", "date": "2024-06-16 04:00", "url": "https://menafn.com/1108338239/More-Gazans-Killed-As-Israeli-Strikes-Continue", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Eight Israeli were killed in the southern Gaza Strip Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nFour others were killed in separate attacks in the south, medics said.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza."}, {"id": "867d516b-01b3-4381-b305-d1ed207be791", "title": "Russia and Belarus launch second stage of tactical nuclear weapons drills", "date": "2024-06-16 02:00", "url": "https://www.heraldscotland.com/news/national/24379585.russia-belarus-launch-second-stage-tactical-nuclear-weapons-drills/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "During the second stage of the drills that began on Tuesday, Russian and Belarusian troops will undergo joint training in non-strategic nuclear weapons used in combat, the Defence Ministry said.\nThe Russian military had trained separately during the initial stage of the manoeuvres before joint drills with Belarusian forces.\nLast year, Russia moved some of its tactical nuclear weapons into neighbouring Belarus, which also borders Ukraine and Nato members Poland, Latvia and Lithuania.\nTactical nuclear weapons include air bombs, warheads for short-range missiles and artillery munitions and are meant for use on a battlefield.\nMr Putin pointed at the country’s nuclear doctrine that envisages the use of nuclear weapons in case of a threat to its sovereignty and territorial integrity."}, {"id": "9845e672-d924-47ac-ab6c-f32fd42856af", "title": "Monument to wartime malaria victims unveiled on Okinawa isle | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-16 08:45", "url": "https://www.asahi.com/ajw/articles/15307493", "domain": "asahi.com", "domain_classification": "Unknown", "message": "TAKETOMI, Okinawa Prefecture--A memorial ceremony was held for victims of a disastrous wartime relocation program by the Japanese military that left hundreds of islanders dead from malaria.\nAbout one-third of them died from malaria, either in Iriomotejima or after their return to Haterumajima following Japan’s defeat in the war.\nThe decision to move the islanders was made as the bloody Battle of Okinawa was getting under way.\nRelatives of the victims, as well as local school children, came to offer prayers that the tragedy would not be forgotten.\nHis siblings also contracted malaria, and five of the seven died, including his older brother who was killed in action."}, {"id": "98fa482d-6b35-462f-bf49-c65e5cf89902", "title": "Biden Holds LA Fundraiser As Trump Courts Michigan", "date": "2024-06-16 05:45", "url": "https://www.urdupoint.com/en/world/biden-holds-la-fundraiser-as-trump-courts-mic-1836001.html", "domain": "urdupoint.com", "domain_classification": "Unknown", "message": "His turn with the stars means Biden skipped a huge international peace conference for Ukraine on Saturday in Switzerland, with Vice President Kamala Harris attending instead.\nBut Biden's team said the fundraiser was a \"show of force with leaders across the entertainment industry sending a clear signal: they are united and enthusiastic about reelecting President Biden and Vice President Harris.\"\nIn Los Angeles, Biden and Obama, under whom he served as vice president, will take part in a conversation moderated by late-night US comic Jimmy Kimmel.\nThe Democrat is expected to go on the offensive on issues like abortion and democracy where his campaign thinks Trump is vulnerable.\nTheir last debates, in 2020, were tension-filled affairs, with Biden at one point snapping \"will you shut up, man?\""}, {"id": "c25a2b6c-511d-4173-aa54-6ff002674b74", "title": "Iran to react if Israel conducts broad raid on Lebanon : Israeli media", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iran to react if Israel conducts broad raid on Lebanon: Israeli mediaIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Media outlets of the Israeli regime warned their leaders in Tel Aviv that if the regime launches a full-scale attack on Lebanon, Iran is likely to get involved.\nThe anchor added that the Israeli army is worn out and completely reliant on US weapons, and its internal front is completely defenseless, so the authorities should think well before deciding to expand the war.\nMoreover, the Radio Israel reported earlier that the cabinet of this regime decided to call up another 50,000 reserve soldiers to be ready in case of any increase in engagement in the Lebanese front.\nMeanwhile, deputy secretary-general of Hezbollah Sheikh Naim Qassem had previously warned that if the Israeli regime seeks to engage in a full-scale war, Hezbollah is prepared to confront it.\n4208**9417NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "c6c9abbe-659c-4c83-8705-1834a5d1554b", "title": "China views Taiwan  elimination  as national cause : Taiwan president", "date": "2024-06-16 05:15", "url": "https://economictimes.indiatimes.com/news/defence/china-views-taiwans-elimination-as-national-cause-taiwan-president/articleshow/111032429.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelChina views the annexation and \" elimination \" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina staged war games around Taiwan shortly after Lai's inauguration.Lai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.Speaking in Kaohsiung in the south of the island on the 100th anniversary of the founding of the Whampoa Military Academy, Lai said today's cadets must recognise the challenges of the \"new era\".\n\"The biggest challenge is to face the powerful rise of China, (which is) destroying the status quo in the Taiwan Strait and regards Taiwan's annexation and the elimination of the Republic of China as the great rejuvenating cause of its people,\" he said, using Taiwan's formal name.China' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.Wang Huning, the fourth-ranked leader in China's ruling Communist Party, told a Saturday forum in China about relations with Taiwan that \"reunification is a historical necessity for the great rejuvenation of the Chinese nation\", vowing to \"smash any separatist plots\".Lai, at the event attended by senior military officials and also the top U.S. diplomat in Kaohsiung, Neil Gibson, said the cadets must defend Taiwan against being annexed by China and that the island's future can only be decided by its people.\n\"We really must be able to distinguish between ourselves and our enemies and between friend and foe, and absolutely cannot accept the defeatism of 'the first battle is the last battle',\" Lai said, referring to a theory that Taiwan could collapse as soon as China launched any attack.The academy was founded in China's Guangzhou - then known in English as Canton - in 1924, more than a decade after the establishment of the Republic of China, which overthrew the last emperor.Set up with the help of the Soviet Union to give China a professional military loyal to the nascent state, it moved to Nanjing, Chengdu and finally Kaohsiung after the defeated Republican government fled to the island in 1949 at the end of a civil war won by Mao Zedong and his communist forces.China says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "2e12eee3-5f8b-4edb-aa89-5186d8f7cb31", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 05:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/china-views-taiwans-elimination-as-national-cause-taiwan-president-says/articleshow/111032207.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "KAOHSIUNG: China views the annexation and \" elimination \" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina staged war games around Taiwan shortly after Lai's inauguration.Lai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.Speaking in Kaohsiung in the south of the island on the 100th anniversary of the founding of the Whampoa Military Academy , Lai said today's cadets must recognise the challenges of the \"new era\".\n\"The biggest challenge is to face the powerful rise of China, (which is) destroying the status quo in the Taiwan Strait and regards Taiwan's annexation and the elimination of the Republic of China as the great rejuvenating cause of its people,\" he said, using Taiwan's formal name.China' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.Wang Huning, the fourth-ranked leader in China's ruling Communist Party, told a Saturday forum in China about relations with Taiwan that \"reunification is a historical necessity for the great rejuvenation of the Chinese nation\", vowing to \"smash any separatist plots\".Lai, at the event attended by senior military officials and also the top U.S. diplomat in Kaohsiung, Neil Gibson, said the cadets must defend Taiwan against being annexed by China and that the island's future can only be decided by its people.\n\"We really must be able to distinguish between ourselves and our enemies and between friend and foe, and absolutely cannot accept the defeatism of 'the first battle is the last battle',\" Lai said, referring to a theory that Taiwan could collapse as soon as China launched any attack.The academy was founded in China's Guangzhou - then known in English as Canton - in 1924, more than a decade after the establishment of the Republic of China, which overthrew the last emperor.Set up with the help of the Soviet Union to give China a professional military loyal to the nascent state, it moved to Nanjing, Chengdu and finally Kaohsiung after the defeated Republican government fled to the island in 1949 at the end of a civil war won by Mao Zedong and his communist forces.China says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "b39576a7-39ac-40c0-b4db-80b71a3bfbdb", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 06:15", "url": "https://www.rappler.com/world/asia-pacific/china-views-taiwan-elimination-national-cause-taiwan-president-lai-ching-te/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a “separatist.” China staged war games around Taiwan shortly after Lai’s inauguration.\nLai says only Taiwan’s people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina’ Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai’s remarks.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "24ce2d94-de85-426a-bb5c-97e5d9248fb9", "title": "China sees annexation of Taiwan as  great national cause , Taiwanese prez warns", "date": "2024-06-16 07:45", "url": "https://www.firstpost.com/world/china-sees-annexation-of-taiwan-as-great-national-cause-taiwanese-prez-warns-13783006.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Lai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a ‘separatist’.\nChina staged war games around Taiwan shortly after Lai’s inauguration.\nAdvertisementLai says only Taiwan’s people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina says any move by Taiwan to declare formal independence would be grounds to attack the island.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "14ab7957-c794-4f1b-94ef-45aa3dcc426f", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 05:00", "url": "https://www.yahoo.com/news/china-views-taiwans-elimination-national-041848871.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Ann WangKAOHSIUNG, Taiwan (Reuters) - China views the annexation and \"elimination\" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nLai says only Taiwan's people can decide their future and has repeatedly offered talks with Beijing but been rebuffed.\nChina' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "c0ed59f4-2773-4906-a959-489b834802db", "title": "  Weep Over Fall of Our Fighter : PM Benjamin Netanyahu As Eight Israeli Soldiers Killed In Southern Gaza", "date": "2024-06-16 02:00", "url": "https://www.news18.com/world/israel-hamas-war-eight-idf-soldiers-killed-as-fighting-continues-in-gazan-city-of-rafah-8933938.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Prime Minister Benjamin Netanyahu on Saturday expressed grief over the killing of eight Israeli soldiers in the southern Gaza Strip.\nThis comes as Israeli forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nPrime Minister Netanyahu, this evening:“Citizens of Israel, today we paid a heart-rending price in our just war in defense of our homeland.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nThe deaths of the soldiers may complicate the political situation facing Prime Minister Benjamin Netanyahu, a week after centrist former general Benny Gantz quit the government, accusing Netanyahu of having no proper strategy for Gaza."}, {"id": "ef81568a-72eb-4766-88d5-7d7e7310a3a0", "title": "China views Taiwan  elimination  as national cause , Taiwan president says", "date": "2024-06-16 06:15", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217464/China-views-Taiwan", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Taiwanese President Lai Ching-te visits Republic of China Military Academy, an officer training academy, for its 100th anniversary celebrations in Kaohsiung, Taiwan June 16, 2024.\n(Reuters)China views the annexation and \"elimination\" of Taiwan as its great national cause, Taiwan President Lai Ching-te said on Sunday, telling cadets at the military's premier academy they must know their enemy and not give in to defeatism.\nLai has faced sustained personal attacks from China, which views Taiwan as its own territory, since assuming office last month, with Beijing calling him a \"separatist\".\nChina' Taiwan Affairs Office did not answer calls on Sunday seeking comments about Lai's remarks.\nThe government in Taipei says Taiwan is already an independent country, the Republic of China, and that it does not plan to change that."}, {"id": "e08a5f11-6188-4994-a9b8-26869e1108bf", "title": "235 officers , including 22 women , join Air Force", "date": "2024-06-16 06:30", "url": "https://www.newindianexpress.com/thesundaystandard/2024/Jun/16/235-officers-including-22-women-join-air-force", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "NEW DELHI: The Combined Graduation Parade (CGP) was held at the Air Force Academy at Dundigal near Hyderabad on Saturday to mark the culmination of the training of 235 flight cadets of flying and ground duty branches of the Indian Air Force.\n“The graduating officers included 22 women officers who got commissioned in various branches of the IAF,” said an official statement.\nNine officers from the Indian Navy, nine from the Indian Coast Guard, and one officer from the friendly foreign countries were also awarded ‘wings’ on completion of flying training, it added.\nThis is also the first CGP where 25 cadets, who joined the National Defence Academy four years ago for ground duty branches, were commissioned as officers.\nFive of these officers have been commissioned in the administration branch, three in the logistics branch and 17 in the technical branch of the Air Force."}, {"id": "4bee4104-f472-49a7-be0d-83c7b25c3bda", "title": "On This Day , June 16 : Sara Jane Olson captured after 20 years on the run", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/day-june-16-sara-jane-070006512.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On This Day, June 16: Sara Jane Olson captured after 20 years on the runOn June 16, 1999, police arrested Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army, which kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009.\nOn June 16, 1963, the Soviet Union put the first woman into space, cosmonaut Tereshkova.\nIn 1999, police arrested Sara Jane Olson, formerly known as Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army that kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009."}, {"id": "4ebac143-3a35-4c9f-b777-77dd2f073854", "title": "Olivia Colman and Benedict Cumberbatch seen together for a SECOND time as they film remake of Hollywood classic War Of The Roses - where they play married couple", "date": "2024-06-16 00:45", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13534559/Olivia-Colman-Benedict-Cumberbatch-War-Roses.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "They are two titans of the British acting world who look delighted to be working together for the first time in their illustrious careers.\nBut Olivia Colman and Benedict Cumberbatch will soon be at each others' throats – their new film is a remake of the dark divorce comedy The War Of The Roses.\nThe Crown star Colman, 50, and Sherlock's Cumberbatch, 47, were seen shooting their first scenes in the pretty Devon resort town of Salcombe last week.\nColman, who plays Ivy, wore a navy and white striped jumper and wide-leg trousers as she kissed Cumberbatch, who plays husband Theo, in a blue-grey jacket.\nProducers Searchlight Pictures say of the plot: 'Life seems easy for picture-perfect couple Theo and Ivy: successful careers, great kids, an enviable sex life."}, {"id": "eaa0b4b7-f43e-4a7a-b9bc-bf1f5ad90dfb", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.myjoyonline.com/israel-announces-military-pause-on-gaza-road-to-let-in-aid/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Israel is under pressure from its allies to enable sufficient aid to reach those living in GazaThe Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nAid agencies have repeatedly reported difficulties in distributing aid around Gaza."}, {"id": "0786d52d-dc99-4c56-9938-1bdd34543def", "title": "Russia a No - Show at  Swiss Peace Conference  ", "date": "2024-06-16 01:00", "url": "https://pjmedia.com/rick-moran/2024/06/15/russia-a-no-show-at-swiss-peace-conference-n4929918", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "But whenever Ukraine decides to sue for peace, the cost of rebuilding the shattered nation is approaching half a trillion dollars.\nAt the moment, the United States is standing four-square behind Kyiv.\nAnd that means the United States needs to enforce those rules, norms, and principles or they're just words on a piece of paper.\nAnd many in the West see no other way than continuing the war against Russia.\nI don't think Biden is dumb enough to start a war with Russia over Ukraine."}, {"id": "00aa0199-18dc-4c97-90cc-4b1436a22532", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.bbc.co.uk/news/articles/cgeepk8rp9xo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "International agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe number of aid trucks entering Gaza continues to be well below what agencies have said is required.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day.\nOCHA points out that since 7 May, it has been unable to directly observe the arrival of aid from the private sector through the Kerem Shalom crossing."}, {"id": "51ee8621-7dfe-4f47-af50-3ad3df2f2b30", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.bbc.com/news/articles/cgeepk8rp9xo", "domain": "bbc.com", "domain_classification": "International", "message": "They will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day."}, {"id": "a6997d7a-e770-4441-9909-6aa0060b4141", "title": "Japan PM calls for global efforts to achieve lasting peace in Ukraine", "date": "2024-06-16 00:30", "url": "https://english.kyodonews.net:443/news/2024/06/83d22adbb7a5-japan-pm-calls-for-global-efforts-to-achieve-lasting-peace-in-ukraine.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 9 hours ago - 09:05 | All, World, JapanJapanese Prime Minister Fumio Kishida on Saturday called for global efforts to achieve a \"just and lasting peace\" in Ukraine as the world's major powers, the United States and China, are divided over how to deal with Russia's invasion of its neighbor.\nThe Soviet Union, of which Russia and Ukraine were both a part, suffered the world's worst nuclear accident in 1986 at Chernobyl.\nJapan experienced the Fukushima Daiichi nuclear plant crisis triggered by a devastating earthquake and tsunami in March 2011.\nDuring the two-day meeting through Sunday, about 100 representatives of countries and international institutions, including some 60 leaders, will exchange views on peace proposals for Ukraine, according to the Swiss government.\nRelated coverage:Dozens of leaders gather in Switzerland at critical time for UkraineG7 needs to keep tackling Indo-Pacific issues as priority: Japan PMOPINION: Ukraine peace process must start with Swiss summit"}, {"id": "db196337-84c1-41b6-8499-fda2f79314ab", "title": "Eight Israeli soldiers and 19 Palestinians killed as fighting continues in Rafah - 16 - Jun - 2024", "date": "2024-06-16 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400483", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Eight Israeli soldiers have been killed in a blast in the southern Gaza Strip, the military says, as its forces continue to push into the city of Rafah, with strikes in several areas of Gaza killing at least 19 Palestinians, residents and medics say.\nAccording to the Israel Defense Forces (IDF), the Israeli soldiers were in an armoured carrier that detonated on Saturday while carrying combat engineering materials, apparently in contravention of standard practice.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nAt least 15 people were killed by Israeli air strikes on two houses in Gaza City suburbs, according to residents.\nAt least 37,296 Palestinians have been killed in Israel's military campaign against Hamas, according to the Gaza health ministry."}, {"id": "8fa13134-d0d8-4d2c-810a-e747582eb38f", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/israel-announces-military-pause-gaza-080608938.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel announces military pause on Gaza road to let in aidIsrael is under pressure from its allies to enable sufficient aid to reach those living in Gaza [Reuters]The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97."}, {"id": "80c0b02e-bf78-4f47-8d73-5cbe2c875199", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 06:15", "url": "https://www.thestandard.com.hk/breaking-news/section/6/217460/Eight-Israeli-soldiers-killed-as-fighting-continues-in-Rafah", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)Eight Israeli soldiers were killed in the southern Gaza Strip on Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza."}, {"id": "955171cc-e5a9-41b5-bcef-9032964d35e5", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 09:00", "url": "https://www.stabroeknews.com/2024/06/16/news/world/eight-israeli-soldiers-killed-as-fighting-continues-in-rafah/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "JERUSALEM/CAIRO, (Reuters) – Eight Israeli soldiers were killed in the southern Gaza Strip yesterday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities."}, {"id": "5afe14e1-9edd-49bc-b7c4-bf14d667e59d", "title": "Justice Road : A Perspective on the Synder Act", "date": "2024-06-16 04:15", "url": "https://www.yahoo.com/news/justice-road-perspective-synder-act-035457915.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "America paid veterans of theAmerican Revolutionary War in Indian land grants and it hadn’t even acquired the land from the Natives yet.\nShe and my grandfather, Eugene Seelye, were born before the Snyder Act (Indian Citizenship Act) of 1924.\nOur family couldn’t escape the oppressions any better than any other Native family.\nThey weren’t naïve about the irony, but if they had to defend America to defend Native America, they were willing to do that.\nMany Native Americans had become citizens by treaty, allotment, or special act of Congress for their service in the military after World War I."}, {"id": "d27ac1e5-7f78-4c9e-93db-7e9ecc6d9eff", "title": "Released Israeli hostage describes return from Hamas captivity", "date": "2024-06-16 04:45", "url": "https://www.jpost.com/israel-hamas-war/article-806369", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Almost seven months after she and her daughters returned from Hamas captivity, Doron Katz Asher explained the struggles of continuing with daily life after being held captive in a Saturday Facebook post.\nAsher was kidnapped on October 7 at Kibbutz Nir Oz with her two daughters, Raz, 5, and Aviv, 3.\nAsher explained that she continues to experience \"nightmares at night, fear of noises, and questions from [her] little girls who don't understand why this happened to them—dealing with tough questions that break my break.\"\n\"And it's mainly putting on a smiling mask to raise the girls in a happy home even though my heart is bleeding.\"\nShe wrote that the experience caused her to \"discover how wonderful the people of Israel are with all their help and support. \""}, {"id": "f2d1e370-24c7-42fa-b9f6-6990d65d0744", "title": "Press Briefing by IDF Spokesperson RAdm . Daniel Hagari - June 15 , 2024", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-idf01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press Briefing by IDF Spokesperson RAdm.\nDaniel Hagari- June 15, 2024IDF Press ReleaseJune 15, 202415.06.24IDFThis is a difficult evening,Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\nIDF representatives delivered the hard news to the families, and are currently with them at this difficult time.\nPlease respect the bereaved families, our first commitment in the IDF is to them, and we will not deviate from this principle.\nIDF troops are making progress in the defeat of the Hamas military wing, focusing on dismantling the Rafah Brigade's capabilities."}, {"id": "fc8ee46e-c9d3-4854-813a-c8a25a8b0748", "title": "Walter Dods , Jr ., Jay H . Shidler , donate Akaji sculpture to UH Mānoa RISE | University of Hawaiʻi System News", "date": "2024-06-16 01:30", "url": "https://www.hawaii.edu/news/2024/06/15/akaji-sculpture-dedication-rise-grand-opening/", "domain": "hawaii.edu", "domain_classification": "Unknown", "message": "Reading time: 2 minutesUniversity of Hawaiʻi at Mānoa alumni Walter Dods, Jr .\nThe sculpture, “ RISE ,” was installed outside the Walter Dods, Jr .\nRISE Center, and dedicated in a special ceremony prior to the official grand opening of the center on June 15.\nRISE was built under a public-private partnership between UH , UH Foundation and Hunt Companies Hawaiʻi.\nUH Foundation recently moved its headquarters to the second and third floors of the Charles Atherton House at RISE ."}, {"id": "492087d2-29b2-4215-b180-3f37b673d6cb", "title": "Biden holds LA fundraiser as Trump courts Michigan", "date": "2024-06-16 06:30", "url": "https://www.gjsentinel.com/news/national/biden-holds-la-fundraiser-as-trump-courts-michigan/article_665aff82-686d-50d6-9b6a-8db3fffb5363.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Republican former US president Donald Trump has courted Black voters -- traditionally more supportive of Democratic candidates -- as he campaigns in 2024 for another term in the White House"}, {"id": "89f6564a-630b-49f4-9ea6-13677776844f", "title": "The 8 Great Families of  House of the Dragon  explained", "date": "2024-06-16 07:30", "url": "https://timesofindia.indiatimes.com/web-series/news/english/the-8-great-families-of-house-of-the-dragon-explained/articleshow/111034047.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "\" House of the Dragon \" takes place two centuries before \"Game of Thrones\" and features several of the same noble houses.\nThe Targaryens maintained peace for many years, but after King Viserys I's reign, a conflict over the succession to the Iron Throne began.\nCorlys is a naval leader and explorer who supports Rhaenyra Targaryen in the civil war.\nSer Otto Hightower served as Hand of the King to both King Viserys I and King Jaehaerys Targaryen.\nTheir house is not mentioned in \"Game of Thrones\" and is likely extinct by that time.House Strong House Strong plays a significant role in \"House of the Dragon.\""}, {"id": "a63a9d98-ab2f-4e53-a0ae-66371fb8b541", "title": "Naarok0fKor Fusion War 2024 file - Guntoberfest mod for Doom II", "date": "2024-06-16 04:00", "url": "https://www.moddb.com/mods/guntoberfest/downloads/naarok0fkor-fusion-war-2024", "domain": "moddb.com", "domain_classification": "Unknown", "message": "====================================================================Title : Naarok0fKor Fusion War 2024.wadAuthors : Naarok0fKorDoomworld.comDeviantart.comModdb.com====================================================================* Play Information *Engine : GZDoom 4.10 with Doom2.wad.\nLevels : Map01 is my latest original map from my master WAD, Deimos base.wad.\n[Volcanic outpost]Map02 is my latest original map from my master WAD, Deimos base.wad.\nFiles : Naarok0fkor Fusion War 2024.WAD.\n-Naarok0fkor Fusion War 2024.WAD-CATSvisorBASE2.10.3.pk3-CATSvisorC1.10.3.pk3-CATSvisorC1.10.3_dynamics.pk3Compatibility : CATSvisor 1.10.3 -->Moddb.com widescreenCommlink : Send links of Battle reports, Deathmatch reports, Screenshots & Youtube videos on my ModDb page& Doomworld..."}, {"id": "9935693d-5e4e-48ce-8d4f-4969b21ee688", "title": "Russians lost another 1 , 160 soldiers and 58 artillery systems", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/russians-lost-another-1-160-040818409.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The General Staff of the Armed Forces of Ukraine reported that Russia lost another 1,160 soldiers and 58 artillery systems over the past 24 hours.\nSource: General Staff of the Armed Forces of UkraineDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:526,310 (+1,160) military personnel;7,956 (+0) tanks;15,269 (+6) armoured combat vehicles;13,913 (+58) artillery systems;1,104 (+1) multiple-launch rocket systems;853 (+0) air defence systems;359 (+0) fixed-wing aircraft;326 (+0) helicopters;11,159 (+11) strategic and tactical UAVs;2,296 (+3) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,967 (+56) vehicles and tankers;2,325 (+3) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "449efdca-0364-410b-bca4-1469a3632e78", "title": "Sam McBride : Day the Pope tapped his toe to the swagger of  The Sash  ", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/comment/sam-mcbride-day-the-pope-tapped-his-toe-to-the-swagger-of-the-sash/a843240098.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "The Royal Irish Regiment returned to Rome last week to celebrate the complexity of IrishnessThe band of the Irish Brigade in the Vatican on June 12, 1944.\nAfter the liberation of Rome in June 1944, Pope Pius XII invited the British army’s 38th (Irish) Brigade to the Vatican.\nThe band of the Irish Brigade in the Vatican on June 12, 1944.\nIreland’s neutrality during World War II is complicated.\nHe won the Military Cross in World War I, the Distinguished Service Order in World War II, and was also twice mentioned in dispatches."}, {"id": "01b379a2-be0f-4da8-b3dd-d213355982ae", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "591a6669-b8d8-416f-826d-a8e4fae35654", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 06:00", "url": "https://www.brisbanetimes.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "a465060c-e4a7-4b93-8dd7-d7c05ce7623d", "title": "Entertaining lineup at Illinois State Fair", "date": "2024-06-16 05:45", "url": "https://www.agrinews-pubs.com/community-contributed/2024/06/16/entertaining-lineup-at-illinois-state-fair/", "domain": "agrinews-pubs.com", "domain_classification": "Unknown", "message": "Illinois State FairAug. 8-18, 801 Sangamon Ave.Springfield, IllinoisSPRINGFIELD, Ill. — The Arena will host a variety of family-friendly events during the 2024 Illinois State Fair, Aug. 8-18.\nMonsters of Destruction take over The Arena Thursday, Aug. 8, with an all-out monster truck thrill show featuring exhilarating truck battles.\nParticipating monster trucks include Against the Grain, Redneck Rampage, American Scout, Crusharoo and War Wizard.\nGet up close with these monster trucks and meet the drivers at the Pit Party, open two hours before the show.\nGrandstand LineupFive-time Grammy award-winning, multiplatinum rap icon Lil Wayne will headline the Illinois State Fair Grandstand on Wednesday, Aug. 14."}, {"id": "393f6ead-87e7-478f-922c-a26ba43759fa", "title": "Shunned by West , Russian army deserters live in fear", "date": "2024-06-16 02:30", "url": "https://www.yahoo.com/news/shunned-west-russian-army-deserters-020856757.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kazakh rights campaigner Artur Alkhastov said Russian deserters stand virtually no chance of receiving refugee status in the Central Asian country.\nBut like Kazakhstan, activists say the country hosting a Russian military base is also not a safe destination.\nTwo Russian deserters have been detained by Russian military personnel in Armenia over the past two years.\n- 'Support deserters' -Activists say that if Western countries want to better support Ukraine they should offer asylum to Russian deserters.\nRussian deserters should be welcomed in the West, not stigmatised for having served in the Russian army, said a spokeswoman for InTransit, an organisation that helps men flee the war."}, {"id": "07b8799e-8956-4e38-b825-825468a220db", "title": "I walked streets of Llandudno to see if tourist  dirty  and  litter strewn  claims really stand up - David Powell", "date": "2024-06-16 08:15", "url": "https://www.dailypost.co.uk/news/north-wales-news/walked-streets-llandudno-see-tourists-29341018", "domain": "dailypost.co.uk", "domain_classification": "Unknown", "message": "I wandered around the town on foot looking for how much more routine litter is supposedly sullying these streets.\nIn truth, the good news for Llandudno is it was quite hard to find despite what the visitor claimed.\nI spotted some old Corona bottles and lager cans on a verge behind the old Pier Pavilion site by Llandudno Pier.\nEven the industrial sized wheelie bins in the back streets behind Llandudno's many hotels were neat and tidy - and colourful.\nBut, for the most part, Llandudno seems to be winning the war on garbage."}, {"id": "f871189f-03cf-4056-b46f-980103a54920", "title": "Epic Story of 16th - Century Japanese Civil War to Open at Broadwater Mainstage", "date": "2024-06-16 09:30", "url": "https://rafu.com/2024/06/epic-story-of-16th-century-japanese-civil-war-to-open-at-broadwater-mainstage/", "domain": "rafu.com", "domain_classification": "Unknown", "message": "From left, Masako Nikuma, Yukari Black, Tomoko Karina, Clement Bowen and Luce Metrius in “Castles in the Crimson Flame,” performed two weekends this month at the Broadwater’s Main Stage in Hollywood.\nEnsemble Tenshi, a production company that previously produced the award-winning play “Shizuka – 静” (Broadway World Regional Award, Los Angeles), delivers their new epic play at Hollywood Fringe Festival in June.\n“Castles in the Crimson Flame” takes the audience to the warring states period, Sengoku Jidai, 16th-century Japan, when all the powerful lords battled each other, aiming to conquer and unify Japan.\nYet, she aims to become the most powerful woman in Japan.\nCast: Yukari Black, Clement Bowen, Alexander Collins, Tomoko Karina, Stan Kowalski, Luce Metrius, Masako Nikuma, Dan Pousson, Vasilissa Zhuravleva."}]