[{"id": "ab959a7e-23c2-4172-815f-fb90722d2d70", "title": "Harvard didnt act on campus antisemitism says congressional report", "date": "2024-05-17 12:00", "url": "https://www.thejc.com/news/usa/harvard-didnt-act-on-campus-antisemitism-says-congressional-report-hdr3eqjr", "message": "Kestenbaum testified before the House Judiciary Committee on Wednesday as part of its investigation into campus antisemitism.\nKestenbaum told JNS that the complaint reminds him of his experience participating in Black Lives Matter marches.\nHarvard’s leaders and its Antisemitism Advisory Group “concluded that many of the antisemitic incidents could be addressed simply by enforcing existing non-discrimination and anti-bullying policies,” the report found.\n“The committee’s report proves that former president Gay and Harvard’s leadership propped up the university’s Antisemitism Advisory Group all for show,” she said.\n“That’s what’s happening at Harvard all the time,” Covit told JNS."}, {"id": "83676d5b-d6a8-4686-9a9d-133d40fb495e", "title": "Campus Reform the # 1 Source for College News", "date": "2024-05-17 12:45", "url": "https://www.campusreform.org/article/marschall-shameful-northwestern-president-must-cowardly-ineptitude-congressional-hearing-/25474", "message": "The House Committee on Education and the Workforce has justifiably summoned Northwestern University President Michael Schill to testify May 23 on “shocking concessions to the unlawful antisemitic encampments” the institution enabled last semester.\nNorthwestern is one of the worst examples of administrative negligence in protecting Jewish students.\nI recently sat down with Jewish alumni and students from Northwestern University to hear about their latest experiences.\nHis failure to keep Jewish students safe on campus last fall motivated me to submit a Title VI complaint against Northwestern.\nThe House Committee’s hearings reinforce the fact that protecting Jewish students - or any other minority - is not a political issue."}, {"id": "22627755-3cf3-4f2a-9f03-b80be6228244", "title": "The Graduation Issue 2024 : 2023 - 24 Year in Review", "date": "2024-05-17 04:45", "url": "https://www.thedp.com/article/2024/05/penn-graduation-issue-2024-years-23-24", "message": "Concerns about antisemitism on campus — and the University’s response — intensified after Hamas’ Oct. 7 attack on Israel.\nDozens of major donors pulled their funding in protest of University leadership, including Wharton Board of Advisors Chair Marc Rowan, 1987 College graduate Jon Huntsman Jr., and 1965 Wharton graduate Ronald Lauder.\nShortly after, the U.S. Department of Education announced an investigation into Penn over alleged antisemitism on campus.\nOn Dec. 5, Magill testified before Congress alongside the presidents of Harvard University and the Massachusetts Institute of Technology about antisemitism on college campuses.\nStudent dissent and activismThroughout the year, Penn students organized for various causes and leveraged criticism at University leadership."}, {"id": "227f51ce-e82b-41ec-8295-c7cd130dfb21", "title": "EU conference vows to combat rising antisemitism - The Jerusalem Post", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-801522", "message": "(credit: Vatican Media/­Handout via REUTERS)After launching the conference on May 6, Bergé repeated her government's commitments to fight \"the scourge of antisemitism everywhere.\"\nI think Britain is trying to fight antisemitism very hard and we are implementing programs from other countries.\n\"Organizations are working together to create an effective reporting system that others can learn from that will create a more effective way to fight antisemitism.\nAs a former EU security chief, I can say that I think antisemitism is a threat to European security.\"\nI think we should also look into combating and providing intelligence on hate crimes such as antisemitism so that countries can fight the phenomenon."}, {"id": "e1716e36-a436-49e1-b23d-ab430bfdbd3c", "title": "Holocaust education in Iowa schools should paint the full picture", "date": "2024-05-17 00:15", "url": "https://www.bleedingheartland.com/2024/05/16/holocaust-education-in-iowa-schools-should-paint-the-full-picture/", "message": "Governor Kim Reynolds came to Beit Shalom, the home of the Quad Cities Jewish community, on May 15 to sign House File 2545, a bill containing controversial new social studies curriculum requirements.\nBecause the bill requires Iowa schools to teach Holocaust education, following the model of Illinois, which has required it for several years.\nThough members of the Quad Cities Jewish community are divided about the policies of the governor and the Republican-controlled legislature, we do stand united on the issue of Holocaust education in our schools.\nFor most of the members of the Jewish community, Holocaust education is not only important as a reminder of the horrors of the past and as a memorial to the martyrs of the Holocaust, but also as a much needed safeguard for the future.\nIt is our deepest hope that when our Iowa schools teach about the Holocaust, they will paint a full picture of that dreadful chapter in world history."}, {"id": "070c1b99-d059-4e4a-8c86-6ee4f5a679e4", "title": "Oxford students invite terrorist sympathisers as  special guests  ", "date": "2024-05-17 16:45", "url": "https://www.thejc.com/news/uk/oxford-students-invite-terrorist-supporters-as-special-guests-hk2kc86o", "message": "A pro-Palestine group at Oxford University invited a Hamas sympathiser and terror-supporting doctor to speak at a press conference and rally on campus yesterday.\nBritish-Palestinian plastic surgeon Ghassan Abu Sittah is scheduled to speak before protesters at Oxford University on 16 May, 2024, despite having expressed pro-Hamas sentiment.\nThey said their client had been asked to speak at Al-Yamani’s memorial by his widow and his distress reflected his personal friendship with him.\nUntil our demands are met.”A representative from Oxford University told the JC that the event had “nothing to do with the university” and took place on the street outside a university building.\nThe situation keeps escalating and there is a very alarming lack of action by the university administration.”"}, {"id": "1a4c1498-a9e1-4459-9885-4e49b5741dc0", "title": "Shapiro order on  scandalou conduct amid Gaza protests raises alarm", "date": "2024-05-17 17:30", "url": "https://www.wesa.fm/politics-government/2024-05-17/shapiro-state-employees-israel-palestine-gaza-protests-executive-order-free-speech", "message": "Josh Shapiro has quietly revised his administration’s code of conduct to bar state employees from engaging in “scandalous or disgraceful” behavior — actions that could lead to discipline or termination, Spotlight PA has learned.\nAs protests against Israel’s war in Gaza — where the Palestinian death toll now tops 35,000 — have escalated, Shapiro has argued some demonstrations have crossed a line into bigotry.\nWitold J. Walczak, legal director of the ACLU of Pennsylvania, said the vagueness of Shapiro’s amended order could violate free speech protections enshrined in the U.S. Constitution.\n“Free speech is a value.\nFree speech doesn't give you the right to harass people."}, {"id": "34f6218d-70a8-45f0-9237-2e159929b1c8", "title": "How students are brainwashed to hate Israel", "date": "2024-05-17 18:30", "url": "https://www.heritagefl.com/story/2024/05/17/news/how-students-are-brainwashed-to-hate-israel/19945.html", "message": "Since students don’t know what they don’t know, they are vulnerable to propaganda and manipulation by faculty with a political agenda.\nBy doing so, Jentleson presents the Middle East he wants students to see.\nRather than blame Hamas for the current war, Kurtzer attacked Israeli intelligence failures and American support for Israel.\nA visiting scholar at the “Palestine Program” at Harvard spewed anti-Israel propaganda by imposing a false narrative of the “nakba” on students and calling Israel an apartheid state.\nWhen Students Supporting Israel and others held an event calling for the return of hostages taken by Hamas, their voices were drowned out."}, {"id": "ca69657c-a434-4a44-9b89-feeef965509a", "title": "More On Those  Outside Agitator – In Saner Thought", "date": "2024-05-17 18:30", "url": "https://lobotero.com/2024/05/17/more-on-those-outside-agitators/", "message": "I recently wrote a post about the accusation of those ‘outside agitators’ that conservatives and their lackeys keep trying to convince the nation exist.\nFor those that could not spare the time before maybe you can find a bit here…..Groups have been watching these protest besides the media and people looking to start shit with lies….all that violence that is being blamed on ‘outside agitators’ is almost non-existent….that’s right dimwits….these are not violent….\nI think we may have identified those ‘outside agitators’ (sarcasm in case you missed it)VFP members were present at the initial rally of about 200 people at Metropolitan State University of Denver, Auraria Campus, in Colorado on April 25 (photo above right).\nThe veterans came to support the students who are camping out there.\nIn a letter to the Treasury Department, the members of Congress requested documents on the organizations while smearing them as antisemitic and pro-Hamas."}, {"id": "12109bcf-9db1-49ad-947e-58020bd7b88f", "title": "The Two - Pronged Attack on a Muslim Judicial Nominee", "date": "2024-05-17 23:00", "url": "https://www.newyorker.com/news/the-political-scene/the-two-pronged-attack-on-a-muslim-judicial-nominee", "message": "Lindsey Graham, the ranking Republican on the Judiciary Committee, had cited a symposium co-sponsored by the center in 2021—“Whose narrative?\nto this nominee is a new low.”A month later, the committee’s members gathered for a vote on Berner and Mangi.\nJoe Manchin, who claimed that he couldn’t support a nominee without Republican backers, was the most predictable of these Democratic holdouts.\nbrought a case to Mangi’s law firm, looking for pro-bono counsel.\nTo my Senate sources, the disparity—another line of attack that none of Mangi’s Republican opponents felt the need to take up—was proof that those fighting his nomination were willing to dredge up anything."}, {"id": "0a6df5c4-758d-4037-aa07-911120bf1b0f", "title": "Louis Farrakhan Fast Facts", "date": "2024-05-17 21:45", "url": "https://krdo.com/news/2024/05/17/louis-farrakhan-fast-facts-3/", "message": "CNN Editorial Research(CNN) — Here’s a look at the life of Louis Farrakhan, leader of the Nation of Islam.\nLate 1960s – Takes the name Louis Abdul Farrakhan.\nFebruary 25, 2000 – Farrakhan makes peace with former NOI leader Muhammad who formed his own Islamic group in the wake of a dispute with Farrakhan on the direction of NOI.\nOctober 10, 2015 – Farrakhan speaks at the “Justice or Else” rally in Washington, DC, marking the 20th anniversary of the Million Man March.\nFebruary 11, 2016 – Farrakhan speaks at a rally at Tehran University in Iran, marking the 37th anniversary of Iran’s Islamic revolution."}, {"id": "8db91e8b-54f0-4383-986b-72be41ff33d8", "title": "Four pro - Palestine students , one pro - Israel protest in Kalama", "date": "2024-05-17 03:15", "url": "https://tdn.com/news/local/education/four-pro-palestine-students-one-pro-israel-protest-in-kalama/article_ac30e3e6-6882-11ee-aeaa-17623ab536e9.html", "message": "Four students from Kalama High School participated in a walk out protest near the end of the school day Wednesday in support of Palestine.\nThe brief protest was planned to be pro-Palestine, but one student also attended to support Israel and the U.S., and two Kalama residents unaffiliated with the school brought their children to hold American and Israeli flags after seeing the demonstrators.\nThe students gathered a few minutes outside of school property at an intersection on Elm Street, where they displayed signs urging for a ceasefire.\nHollingsworth originally suggested holding the walk out in the morning, but moved the time after speaking with Kalama High School Principal Heidi Bunker and Kalama Police Chief Ralph Herrera to create less disruption during the school day.\nSenior Diego Luna joined the protest to support Israel and the U.S., and said he wanted to show his pride in America and make sure people were aware of deaths happening on both sides."}, {"id": "689627be-bb61-4c75-9877-ad237f033441", "title": "Louis Farrakhan Fast Facts - LocalNews8 . com", "date": "2024-05-17 22:45", "url": "https://localnews8.com/news/national-world/cnn-national/2024/05/17/louis-farrakhan-fast-facts-3/", "message": "CNN Editorial Research(CNN) — Here’s a look at the life of Louis Farrakhan, leader of the Nation of Islam.\nLate 1960s – Takes the name Louis Abdul Farrakhan.\nFebruary 25, 2000 – Farrakhan makes peace with former NOI leader Muhammad who formed his own Islamic group in the wake of a dispute with Farrakhan on the direction of NOI.\nOctober 10, 2015 – Farrakhan speaks at the “Justice or Else” rally in Washington, DC, marking the 20th anniversary of the Million Man March.\nFebruary 11, 2016 – Farrakhan speaks at a rally at Tehran University in Iran, marking the 37th anniversary of Iran’s Islamic revolution."}, {"id": "adf9c495-b1cc-4290-a4b8-40940ceafc6d", "title": "Louis Farrakhan Fast Facts", "date": "2024-05-17 21:30", "url": "https://ktvz.com/news/national-world/cnn-national/2024/05/17/louis-farrakhan-fast-facts-3/", "message": "(CNN) — Here’s a look at the life of Louis Farrakhan, leader of the Nation of Islam.\nLate 1960s – Takes the name Louis Abdul Farrakhan.\nFebruary 25, 2000 – Farrakhan makes peace with former NOI leader Muhammad who formed his own Islamic group in the wake of a dispute with Farrakhan on the direction of NOI.\nOctober 10, 2015 – Farrakhan speaks at the “Justice or Else” rally in Washington, DC, marking the 20th anniversary of the Million Man March.\nFebruary 11, 2016 – Farrakhan speaks at a rally at Tehran University in Iran, marking the 37th anniversary of Iran’s Islamic revolution."}, {"id": "9300c03d-1bfa-41c3-8981-96a575d40a69", "title": "The Forever Wars , MAGA and the Loneliness of Anger", "date": "2024-05-17 05:00", "url": "https://www.juancole.com/2024/05/forever-loneliness-anger.html", "message": "Surgeon General Vivek Murthy recently highlighted the problem, claiming that loneliness was as dangerous to our health as smoking 15 cigarettes a day.\nLoneliness and a Lack of Self-ControlI’m a clinical social worker who treats Americans from all walks of life, including serving troops and veterans affected by our post-9/11 wars.\nIts underbelly, however, is alienation, loneliness, and their close cousins, anger and fear.\nAnd many of those who feel lonely and depressed are also angry.\nWhat Donald Trump and other MAGA leaders have done is take emotions like loneliness and channel them into a social movement."}, {"id": "4b16bcbb-00b1-4cbf-a026-797bac3570d7", "title": "Anger And The MAGA Movement| Countercurrents", "date": "2024-05-17 05:30", "url": "https://countercurrents.org/2024/05/anger-and-the-maga-movement/", "message": "And many of those who feel lonely and depressed are also angry.\nWhat Donald Trump and other MAGA leaders have done is take emotions like loneliness and channel them into a social movement.\nThe anger of the MAGA movement is transcendent.\nAre they a cultural movement responding to demographic shifts involving immigration and low birth rates among White families?\nIn such an ongoing climate of isolation, anger, and underdevelopment, there seem few safe and accessible ways for Americans to gather peacefully anymore."}]