[{"id": "f683f76b-c4b4-4802-9fd7-acdb6db365a9", "title": "Syrian fighters belonging to Islamic Jihad killed in southern Lebanon", "date": "2024-05-09 02:00", "url": "https://www.longwarjournal.org/archives/2024/05/syrian-fighters-belonging-to-islamic-jihad-killed-in-southern-lebanon.php", "message": "Islamic Jihad published a statement on its official Telegram channel on Wednesday, grieving the deaths of three fighters belonging to its Syria branch, Ali al-Aswad Brigade.\nIslamic Jihad said the fighters died in southern Lebanon as a part of the al-Aqsa Flood operation against Israel.\nThose who rose on the borders of occupied Palestine in southern Lebanon as part of the al-Aqsa Flood battle while performing their combat duty,” said the statement.\nThe deaths of the Islamic Jihad fighters add to the growing evidence of foreign fighters aligned with the Iran-led Resistance Axis that are actively engaging Israel in the ongoing seven-month conflict.\nLess than a week before the strike on members of the Imam Hossein Brigade, Israel killed two Syrian fighters belonging to Islamic Jihad operating in southern Lebanon."}, {"id": "7faf5daf-12ce-437d-a97b-2eb7571cb147", "title": "Rafah : Israeli military operations expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 02:00", "url": "https://us.cnn.com/2024/05/08/middleeast/rafah-israel-idf-ground-operation-intl-latam/", "message": "CNN —Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nPalestinians arrive at Al Kuwaiti Hospital in Rafah, Gaza, after Israeli air strikes on May 8.\nPlanet Labs, PBC Satellite images from May 6 and May 7 show damage in Rafah, Gaza.\nPlanet Labs, PBC Satellite images show Rafah, Gaza, before and during an airstrike."}, {"id": "9cf1bba2-a5df-4d08-8ef5-340006462a2f", "title": "China & Serbia Form Partnership After Depraved CIA Attack in Belgrade", "date": "2024-05-09 01:45", "url": "https://sputnikglobe.com/20240508/china--serbia-form-partnership-after-depraved-cia-attack-in-belgrade-1118343031.html", "message": "https://sputnikglobe.com/20240508/china--serbia-form-partnership-after-depraved-cia-attack-in-belgrade-1118343031.htmlChina & Serbia Form Partnership After Depraved CIA Attack in BelgradeChina & Serbia Form Partnership After Depraved CIA Attack in BelgradeSputnik InternationalThe two countries have grown closer after the twin tragedies of neoliberal deindustrialization and NATO’s attack on the Chinese embassy in Belgrade.\nAnd nobody prosecuted anybody for war crimes.”NATO’s attack on the former Yugoslavia, conducted after the UN Security Council’s rejection of the proposal, was illegal under international law.\nPreviously, the organization had acted more covertly, supporting efforts such as the CIA’s Operation Gladio which backed neo-Nazi paramilitary groups throughout Europe.\nMilitary secret services (or uncontrolled branches thereof) were involved in serious cases of terrorism and crime.\nThe phenomenon led to the loss of thousands of jobs and deindustrialization throughout Eastern Europe, with devastating consequences."}, {"id": "a85bb1a5-6efd-4701-9c68-bce88ba9a2d3", "title": "US determined to work with Pakistan to combat terrorism : State Dept spox", "date": "2024-05-09 03:30", "url": "https://dunyanews.tv/en/Pakistan/810403-US-determined-to-work-with-Pakistan-to-combat-terrorism:-State-Dept-spox", "message": "US determined to work with Pakistan to combat terrorism: State Dept spoxPakistan Pakistan US determined to work with Pakistan to combat terrorism: State Dept spoxMatthew Miller said that Pakistan has suffered greatly at the hands of terrorists.\nFollow on Updated On: Thu, 09 May 2024 07:55:32 PKTWASHINGTON (Dunya News) - US State Department spokesperson Matthew Miller said that the United States determined to work with Pakistan to combat terrorism, Dunya News reported.\nBriefing the media in Washington on Wednesday, Matthew Miller said that US remain committed to working with Pakistan to address the shared threat posed by terrorist groups throughout the region.\nMatthew Miller said that Pakistan has suffered greatly at the hands of terrorists, and we regret the loss of life and injuries sustained and offer our heart-felt condolences to those affected by these attacks.\nThose matters are for the government of Pakistan to decide.”"}, {"id": "aeb64086-b579-49b1-acd4-08a67e5259cd", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 04:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/08/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show/", "message": "(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "60e5b126-96b7-42ed-b0d2-fada9d6a2b70", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 03:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/05/08/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show/", "message": "By Paul P. Murphy, Abeer Salman and Andrew Raine, CNN(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "5a2c14b9-ffde-41b7-9f96-01efc3a22b93", "title": "Lebanon security source says five killed in Israeli strikes on south", "date": "2024-05-09 03:30", "url": "https://dunyanews.tv/en/World/810385-Lebanon-security-source-says-five-killed-in-Israeli-strikes-on-south", "message": "Lebanon security source says five killed in Israeli strikes on southWorld World Lebanon security source says five killed in Israeli strikes on southA Lebanese security source said five people were killed Wednesday in Israeli strikes.\nFollow on Published On: Thu, 09 May 2024 06:17:33 PKTBEIRUT (AFP) – A Lebanese security source said five people including two Hezbollah fighters were killed Wednesday in Israeli strikes on southern Lebanon, with a Palestinian armed group reporting three fatalities among its ranks.\nAccording to the Lebanese security source, \"two Hezbollah fighters\" were killed in an Israeli air strike on the border town of Adaisseh.\nA separate strike on the village of Khiam Wednesday killed three people who were likely \"Palestinian combatants\", the Lebanese source said.\nThe Israeli military said its \"fighter jets struck military structures... in the areas of Khiam, Adaisseh\" and other southern Lebanon towns."}, {"id": "692533e8-7f7e-40bd-bf43-378fdd6824e2", "title": "Hamas naval commander killed in Gaza : Israeli army", "date": "2024-05-09 03:15", "url": "https://www.prokerala.com/news/articles/a1529504.html", "message": "Israel-Hamas war: Egyptian officials in Tel Aviv to iron out ceasefire bottlenecks.\nImage Source: IANS NewsJerusalem, May 9 : Commander of Hamas' naval unit in Gaza City, Ahmed Ali, was assassinated in an Israeli airstrike, Israel Defense Forces (IDF) has announced in a statement.\nIDF and Shin Bet security agency said on Wednesday that an attack drone killed Ali in the Palestinian enclave, Xinhua news agency reported.\n\"Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip,\" according to the statement.\nDuring Israel's seven-month onslaught in Gaza, Ali was responsible for attacks on Israel and against ground troops operating in the Gaza Strip."}, {"id": "05883ed6-6cd2-4ae7-95b2-13734b96fde8", "title": "Hamas Naval Commander Killed In Gaza : Israeli Army", "date": "2024-05-09 02:00", "url": "https://menafn.com/1108191304/Hamas-Naval-Commander-Killed-In-Gaza-Israeli-Army", "message": "(MENAFN- IANS) Jerusalem, May 9 (IANS) Commander of Hamas' naval unit in Gaza City, Ahmed Ali, was assassinated in an Israeli airstrike, Israel Defense Forces (IDF) has announced in a statement.\nIDF and Shin Bet security agency said on Wednesday that an attack drone killed Ali in the Palestinian enclave, Xinhua news agency reported.\n\"Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip,\" according to the statement.\nDuring Israel's seven-month onslaught in Gaza, Ali was responsible for attacks on Israel and against ground troops operating in the Gaza Strip."}, {"id": "230d4c98-25bc-403d-becc-d285537e1c9a", "title": "New tech means defense outweighs offense , says Army Futures Command chief", "date": "2024-05-09 02:00", "url": "https://www.defenseone.com/technology/2024/05/new-tech-means-defense-outweighs-offense-says-army-futures-command-chief/396422/", "message": "New battlefield technologies mean that the defense is “dramatically” stronger than the offensive, Army Futures Command head Gen. James Rainey told reporters today.\nThis may mean Army units need to start using their tanks and infantry primarily to serve the needs of longer-range weapons such as artillery or rockets, Rainey added.\nArmy doctrine more typically has emphasized using long-range weapons to help armored and infantry units launch aggressive, fast-paced strikes that collapse enemy lines.\n“You're going to have to really put the work in to make sure you're successful.”Rainey advocated for weapons similar to those advocated by Zaluzhnyi: more unmanned systems, long-range weapons, and better command and control.\n‘I'm very interested in heavy lift unmanned systems,” Rainey said."}, {"id": "7ff75e24-ffef-4dfc-9f77-915b488584ff", "title": "Why the US is stopping some bomb shipments to Israel", "date": "2024-05-09 04:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/216195/Why-the-US-is-stopping-some-bomb-shipments-to-Israel", "message": "Washington paused one shipment consisting of 1,800 2,000-pound (907-kg) bombs and 1,700 500-pound bombs, according to U.S. officials.\nThey were part of an earlier approved shipment to Israel, not the recent $95 billion supplemental aid package the U.S. Congress passed in April.\nWHAT KIND OF DAMAGE CAN 2,000-POUND BOMBS CAUSE?\nLarge bombs like 2,000-pound bombs have an impact over a wide area.\nPresident Ronald Reagan imposed a six-year ban on cluster weapons sales to Israel after a Congressional investigation found that Israel had used them in populated areas during its 1982 invasion of Lebanon."}, {"id": "09edbdb2-6f45-4778-93e6-b50973bdbf84", "title": "  So happy youre alive : Woman who survived horrific Bondi Junction massacre reunited with ex - soldier who saved her life", "date": "2024-05-09 01:45", "url": "https://www.perthnow.com.au/news/so-happy-youre-alive-woman-who-survived-horrific-bondi-junction-massacre-reunited-with-ex-soldier-who-saved-her-life-c-14600438", "message": "READ NOWCamera Icon Liya Barko, 35, reunites with Wayne Tolver Banks who helped save her after the Bondi Junction stabbing.\n“I’m so happy you’re alive,” Mr Tolver Banks replied.\nAs Cauchi launched his senseless knife attack on unsuspecting shoppers, Mr Tolver Banks said he recalled coming face-to-face with the offender.\nHe said the 40-year-old shook his head as if to indicate he was safe, before stabbing Ms Barko in the abdomen.\nNine Credit: NCA NewsWireIncredibly Mr Tolver Banks’ wife Michi had been standing by his side but was spared from Cauchi’s violent attack."}, {"id": "ba316285-dd49-408a-85ad-71bc859c5e46", "title": "Zelenskyy : Russia launches  Nazi  attack on Ukraine", "date": "2024-05-09 01:45", "url": "https://www.voanews.com/a/zelenskyy-russia-launches-nazis-attack-on-ukraine/7603951.html", "message": "Ukrainian officials said the massive Russian aerial attack that included 55 missiles and 21 drones damaged a power generation facility in the region of western Ukraine.\nDTEK, Ukraine's largest private electricity company, said Russian missiles inflicted “serious damage” on three of the company’s six thermal power plants in Ukraine.\nMeanwhile, Kosovo’s foreign minister, who is also the deputy prime minister, said there is “only one solution” to Russia’s war on Ukraine.\n“It can only be Russia to lose the war and Ukraine to win this war,” Donika Gervalla-Schwarz said in an interview with The Associated Press on Wednesday.\n“Ukraine hasn’t recognized the Republic of Kosovo as a state, but we really believe that we know exactly what Ukraine is going through,” she said."}, {"id": "a50548a0-c9ae-44b8-a863-827cea921f4a", "title": "UC - Santa Cruz , Critical Race and Ethnic Studies Department : Striking for Hamas", "date": "2024-05-09 02:00", "url": "https://www.frontpagemag.com/uc-santa-cruz-critical-race-and-ethnic-studies-department-striking-for-hamas/", "message": "Editor’s note: Since the barbaric Hamas attacks against Israel on October 7th, American universities have become an undeniable locus of Jew hatred within our nation.\nThe Critical Race and Ethnic Studies Department at UC-Santa Cruz is #2 on our list.\nThe Critical Race and Ethnic Studies Department at UC-Santa Cruz has utterly abdicated its responsibility towards political neutrality and academic freedom, instead choosing to side with Hamas terrorists and their Jew-hating allies on the left in blatant disobedience of university policy.\nAs part of this “Global General Strike” CRES blatantly defied the authority of UC-Santa Cruz by refusing to hold classes or conduct university business.\nThis day is a day of solidarity with Palestinians in Palestine and around the world."}, {"id": "1d5d4bf5-9e90-4306-bec1-e64c09d3fdae", "title": "Biden Widens Rift With Israel in Move That Paused Bomb Shipments", "date": "2024-05-09 00:00", "url": "https://www.livemint.com/news/world/biden-widens-rift-with-israel-in-move-that-paused-bomb-shipments-11715204480290.html", "message": "It marked the Biden administration’s most serious signal of displeasure over the conduct of the ongoing war against Hamas.\nThe administration also wants to preserve space for negotiators who have convened in Cairo this week to keep striving for a cease-fire and hostage deal between Israel and Hamas.\nBiden is facing domestic pressure for a solution with US elections just six months away.\nAt the same time, Israel has begun strikes in Rafah that could either pressure Hamas leaders into signing a cease-fire deal or scuttle the negotiations entirely.\nThe US recently signed a foreign-aid package that contains billions of dollars of fresh assistance for Israel."}, {"id": "a10cf520-647f-45e1-a9db-9d3de2d8c826", "title": "Advancing in Ukraine , Russia to mark victory in World War Two", "date": "2024-05-09 03:15", "url": "https://www.deccanherald.com/world/advancing-in-ukraine-russia-to-mark-victory-in-world-war-two-3014794", "message": "The 71-year-old Kremlin chief promised victory in the war, where Russian forces have been advancing against Ukrainian forces despite hundreds of billions of dollars in aid from the United States and its allies.\nUkraine and the West say Putin is engaged in an imperial-style land grab and have vowed to defeat Russia, which currently controls about 18% of Ukraine, including Crimea, and parts of four regions in eastern Ukraine.\nRussia says the lands, once part of the Russian Empire, are now once again part of Russia.\nIn Moscow it was already May 9, which became the Soviet Union's \"Victory Day\" in what Russians call the Great Patriotic War of 1941-45.\nRussian officials warn that the Ukraine war is entering the most dangerous phase to date - Putin has repeatedly warned of the risk of a much broader war involving the world's biggest nuclear powers."}, {"id": "053144cd-4f50-4428-8e8c-48dcdfef3ae0", "title": "Israeli military operations in Rafah expand from airstrikes to ground operations , satellite images show", "date": "2024-05-09 02:15", "url": "https://www.cbs58.com/news/israeli-military-operations-in-rafah-expand-from-airstrikes-to-ground-operations-satellite-images-show", "message": "Israeli military operations in Rafah expand from airstrikes to ground operations, satellite images showPlanet Labs, PBC via CNN NewsourceBy Paul P. Murphy, Abeer Salman and Andrew Raine, CNN(CNN) — Israel’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nSome of the IDF forces have penetrated more than a mile inside the Palestinian enclave from the Rafah crossing gate, the images also show.\nThese ground operations follow a series of airstrikes on Rafah that have completely destroyed several buildings in the past 24 hours, and killed at least four people, according to a local hospital.\nSatellite images suggest these strikes are continuing, with one picture showing smoke still rising from one location.\nOnce IDF ground forces did move in, armored bulldozers worked with tanks and other military vehicles to bulldoze and raze buildings."}, {"id": "be4d91a4-f572-49ad-98e5-8bd4e555bfb9", "title": "Renewed rage of banditry", "date": "2024-05-09 01:45", "url": "https://punchng.com/renewed-rage-of-banditry/", "message": "The North-West and North-Central are the worst-hit regions in the renewed rage.\nKaduna, Katsina, Zamfara, Benue, and Plateau states have come under bloody attacks by bandits recently.\nWithin a week in mid-February, bandits slaughtered 12 persons and injured nine others in Makyali village in Kajuru LGA.\nOn March 7, bandits abducted 137 pupils from a school in Chikun LGA, Kaduna State.\nIn Katsina, bandits killed 24 persons in four communities in Sabuwa LGA in a night operation that lasted for one hour in late April."}, {"id": "9aa7dc41-1c8c-49a6-89dd-dad27b990068", "title": "Biden Threatens to Withhold Weapons to Israel Over Rafah Invasion", "date": "2024-05-09 03:00", "url": "https://time.com/6976220/biden-halt-weapons-israel-rafah/", "message": "The move marked the Biden administration’s most serious signal of displeasure over the conduct of the ongoing war against Hamas.\n“Civilians have been killed in Gaza as a consequence of those bombs and other ways in which they go after population centers,” Biden said.\nAt the same time, Israel has begun strikes in Rafah that could either pressure Hamas leaders into signing a cease-fire deal or scuttle the negotiations entirely.\nBiden told CNN that Israel’s actions in Rafah - including air strikes near border areas - had not yet crossed the line.\n“A lot of it just depends on how things play out in Rafah and whether it gets worse.”"}, {"id": "384597be-957c-4a47-a2a7-14c379652173", "title": "Republicans question over  ironclad  commitment after arms shipment halt", "date": "2024-05-09 03:00", "url": "https://www.jpost.com/american-politics/article-800515", "message": "The State Department was slated to release its review of Israel's assurances to Congress on Wednesday but said the report will be out \"in the coming days.\"\nIron dome anti-missile system fires interception missiles as rockets fired from Lebanon, as it seen over Kiryat Shmona, March 5, 2024.\nIsrael is an urgent priorityThe Republican leaders noted that while the assistance funded by the supplemental appropriations bill will not be impacted, security assistance to Israel is an urgent priority that must not be delayed.\n\"These recent press reports and pauses in critical weapons shipments call into question your pledge that your commitment to Israel's security will remain ironclad,\" the letter said.\nThe leaders said they expect the Biden administration to push \"departments, agencies and industry\" to expedite contracting, production and delivery of weapons and munitions \"critical to defense of the United States and free world.\""}, {"id": "ebaa575d-d931-40f4-ab00-3f61613dd3ee", "title": "Brothers to be extradited over alleged fatal stabbing", "date": "2024-05-09 04:00", "url": "https://www.bendigoadvertiser.com.au/story/8622981/brothers-to-be-extradited-over-alleged-fatal-stabbing/", "message": "The brothers had been on the run since the early hours of Sunday after a 22-year-old man from Noble Park was killed and a 30-year-old man, also from Noble Park, was injured at an Ormond home in Melbourne's southeast."}, {"id": "93aa0b4e-0554-4de2-b4b4-19175f3f3b2b", "title": "Video allegedly showing murder of Israeli in Egypt published , authenticity investigated", "date": "2024-05-09 02:00", "url": "http://www.israelnationalnews.com/news/389646", "message": "תיעוד ערבי (לכאורה) של רצח הישראלי במצרים מהרשתA video allegedly showing the murder of Israeli businessman Ziv Kipper in the Egyptian city of Alexandria by an unknown terrorist organization was published online on Wednesday.\nIn the background, a man is heard saying “Shalom” in Hebrew and adding in Arabic, “from the children of Gaza”.\nIf the video is authentic, it confirms the suspicion that the murder was a terrorist attack.\nThe organization that published the video called itself the “Shaheed Muhammad Salah Group” and claimed that it was responsible for the murder.\nDespite the video and the announcement of the terrorist organization, officials in Egypt continue to claim that the incident was a robbery and that the background is criminal."}, {"id": "9da52a88-7291-41a0-8509-02044047f529", "title": "Biden threatens to stop arm shipments if Israel invades Rafah", "date": "2024-05-09 03:30", "url": "https://dunyanews.tv/en/World/810389-Biden-threatens-to-stop-arm-shipments-if-Israel-invades-Rafah", "message": "Biden threatens to stop arm shipments if Israel invades RafahWorld World Biden threatens to stop arm shipments if Israel invades RafahBiden said he would stop US weapons supplies to Israel if it attacks Rafah in southern Gaza.\n\"If they go into Rafah, I'm not supplying the weapons that have been used… to deal with the cities,\" Biden said.\n\"Civilians have been killed in Gaza as a consequence of those bombs,\" Biden said.\nEven with the pause of US shipments, Israel is believed to have a significant weapons stockpile.\nIt has a major domestic defense industry and the Biden administration has repeatedly shipped weapons that fall beneath the threshold for congressional notification."}]