[{"id": "e6dd873f-8b72-4645-9585-014402b8a358", "title": "CBS Correspondent Reports From Inside Hezbollah Rally", "date": "2024-08-07 09:00", "url": "https://www.newsbusters.org/blogs/nb/jorge-bonilla/2024/08/07/cbs-correspondent-reports-inside-hezbollah-rally", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "Tyab had the opportunity to seethe further while attending a Hezbollah rally in Beirut.\nWell, as supporters of Hezbollah vowed to avenge the assassination, we can hear the sound of Israeli fighter jets in the skies above Beirut break the sound barrier.\nWhat is the vetting process for a Western journalist to get into a Hezbollah rally?\nBut we do know that Tyab was there and got a nice shot of an angry crowd waving yellow Hezbollah flags.\nClick “expand” to view the full transcript of the aforementioned report as aired on the CBS Evening News on Tuesday, August 6th, 2024:"}, {"id": "f661f975-2c6f-4114-bde9-d2c32b26043e", "title": "Israel - Gaza live updates : Israel , Hezbollah exchange fire over border", "date": "2024-08-07 02:30", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1577681", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah have exchanged near-daily strikes for the past 10 months amid the ongoing war in Gaza.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\n“His elimination significantly degrades the capabilities of the Hezbollah terrorist organization to promote and carry out terror activities from southern Lebanon against northern Israel,” the IDF said.\nAt least 7 Hezbollah attacks MondayIn another active day on the northern Israeli border, Hezbollah launched at least seven attacks on Monday.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "359bf96c-649a-4837-bbb5-adb4f34b7d46", "title": "US forces destroy Houthi uncrewed aerial vehicle and missiles launched from Yemen", "date": "2024-08-07 05:30", "url": "https://news.webindia123.com/news/Articles/World/20240807/4222710.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "US Central Command said on Tuesday that it has successfully destroyed one Iranian-backed Houthi uncrewed aerial vehicle and two Iranian-backed Houthi anti-ship ballistic missiles launched from Houthi-controlled areas of Yemen over the Red Sea.\nIn the statement, US Central Command said that these weapons posed a \"clear and imminent threat\" to the US and coalition forces and merchant vessels in the region.\nIn the statement posted on X, US Central Command stated, \"In the past 24 hours, U.S. Central Command forces successfully destroyed one Iranian-backed Houthi uncrewed aerial vehicle and two Iranian-backed Houthi anti-ship ballistic missiles launched from Houthi-controlled areas of Yemen over the Red Sea.\"\nEarlier on August 3, the United States military said that it successfully destroyed one Iranian-backed Houthi land attack cruise missile (LACM) in Houthi-controlled territory in Yemen.\nIn a statement, the US Central Command stated, \"In the past 24 hours, U.S. Central Command (USCENTCOM) forces successfully destroyed an Iranian-backed Houthi missile and launcher in a Houthi-controlled area of Yemen.\""}, {"id": "57abd38f-e4b2-4fea-bdf5-f7d63aafc9ba", "title": "Putin demands Iran delay attack on Israel , offers to mediate", "date": "2024-08-07 08:00", "url": "https://www.slobodenpecat.mk/en/putin-bara-iran-da-go-odlozhi-napadot-na-izrael-i-se-nudi-da-posreduva/", "domain": "slobodenpecat.mk", "domain_classification": "Unknown", "message": "Does Macedonia have geniuses and innovators?\nWhat do geniuses create and what makes them stand out from their peers?\nHow many innovations are there in this country and how innovative are our individuals, and how many are being worked on?\nQuestions that few know the answer to.\n\"Sloboden Pechat\" will try to provide at least a small part of the answers through a series and...VIDEO INTERVIEW | Stojanovska: Each yoga pose brings its own challenge, both mentally and physically Read More »"}, {"id": "4c3013a2-f2d0-4297-a797-73cb53c86c59", "title": "Washington and Arab states scramble to avert an all - out Middle East war", "date": "2024-08-07 01:15", "url": "https://www.adn.com/nation-world/2024/08/06/washington-and-arab-states-scramble-to-avert-an-all-out-middle-east-war/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Israel has repeatedly launched strikes on Hezbollah and Iranian commanders without first informing the United States, enraging Biden officials and the president himself.\nIranian officials have informed Arab partners that Iran’s military “will be very responsive and very calculated” in retaliating against Israel, the official said.\nNevertheless, Arab officials remained on guard.\n“I don’t think there is anything [else] that Arab states could do,” the former Egyptian official said.\n“Iran has in mind what it has in mind and will execute it.”ADVERTISEMENT- - -Hudson, Abutaleb and DeYoung reported from Washington."}, {"id": "eccd28ce-09bb-4986-8703-c05fb71f5927", "title": "As Middle East war looms , US restates its  ironclad  support for Israeli regime", "date": "2024-08-07 05:45", "url": "https://www.wsws.org/en/articles/2024/08/07/josz-a07.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "US imperialism’s posturing as a moderating influence in the Middle East after backing Israel’s genocidal war in Gaza is utterly hypocritical.\nWhile US diplomats are supposedly “scrambling” to de-escalate, top American military officials are huddled with their Israeli counterparts over war plans.\nWhile Iran is clearly not seeking a wider war, Israel is just as clearly seeking to provoke one.\nFar from de-escalating, the Zionist regime is continuing its genocidal war in Gaza and attacks inside Lebanon.\n* Israeli attacks inside Lebanon include a strike on a building in the town of Mayfadoun, killing five Hezbollah fighters."}, {"id": "0b604f9b-9c0f-427c-80be-a078127ee30c", "title": "Washington , Arab states scramble to avert all - out Middle East war", "date": "2024-08-07 01:30", "url": "https://www.pressherald.com/2024/08/06/washington-arab-states-scramble-to-avert-all-out-middle-east-war/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Israel has repeatedly launched strikes on Hezbollah and Iranian commanders without first informing the United States, enraging Biden officials and the president himself.\nIranian officials have informed Arab partners that Iran’s military “will be very responsive and very calculated” in retaliating against Israel, the official said.\nIn remarks to foreign diplomats Monday, acting Iranian foreign minister Ali Bagheri cited “the responsibility and the sovereign duty” to hit back.\nNevertheless, Arab officials remained on guard.\n“I don’t think there is anything (else) that Arab states could do,” the former Egyptian official said."}, {"id": "0fa2e3fa-da21-471e-ad57-f7898629caf8", "title": "Iraq declares 2 rockets attacked Ain al - Asad air base housing US forces", "date": "2024-08-07 10:00", "url": "https://menafn.com/1108526460/Iraq-declares-2-rockets-attacked-Ain-al-Asad-air-base-housing-US-forces", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) On Monday, the Ain al-Asad air base in western Iraq, which houses US and coalition forces, was attacked with 2 rockets, according to the Iraqi military.\nThe strike resulted in injuries to several US soldiers, as reported by US media sources citing official statements.\nIn response to the attack, the Iraqi military condemned actions that threaten its military bases, missions, or international coalition advisors.\nAustin described the attack on the Al-Asad air base as a dangerous escalation of regional tensions.\nWhile Hamas and Iran have blamed Israel for Haniyeh's death, Israel has neither confirmed nor denied involvement, adding to the already heightened regional tensions."}, {"id": "3356b36a-f04e-4955-9e51-0ba2f9c21da4", "title": "  The martyrs were cut up and burned : Survivors of the latest tent massacre in Gaza recount the horror – Mondoweiss", "date": "2024-08-07 04:45", "url": "https://mondoweiss.net/2024/08/the-martyrs-were-cut-up-and-burned-survivors-of-the-latest-tent-massacre-in-gaza-recount-the-horror/", "domain": "mondoweiss.net", "domain_classification": "Unknown", "message": "On Sunday, August 4, around 2 a.m., the Israeli army bombed a group of tents inside the compound of the Al-Aqsa Martyrs Hospital in Deir al-Balah, in central Gaza.\nShe was sleeping when the bombing occurred a few meters away from her tent inside the courtyard of the Al-Aqsa Martyrs Hospital.\nTwo weeks ago, an Israeli strike targeted a tent housing journalists inside the courtyard of the Al-Aqsa Martyrs hospital, killing one person.\nI saw three young men and a girl completely burned, and my relatives in the neighboring tent suffered minor burns.\n“The martyrs were cut up and burned; no one knew how to carry them; I saw martyrs cut up, many martyrs,” the young child told Mondoweiss."}, {"id": "607a79a0-55c4-4323-85ff-cde283da7703", "title": "Israeli fighter jets attack Hezbollah terrorist structures in Lebanon", "date": "2024-08-07 00:45", "url": "https://www.jpost.com/breaking-news/article-813629", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Israel Air Force fighter jets struck a Hezbollah military base where terrorists were located and operating on Tuesday in the area of the Yaroun village in Lebanon, the IDF said in the early hours of Wednesday.\nIn addition, the fighter jets also struck a Hezbollah terrorist infrastructure site in the area of Kfarkela in southern Lebanon.\nFurthermore, Hezbollah launched around 30 rockets into northern Israel on the same day, with portions toward the Golan and portions toward the Galilee.\n(credit: REUTERS/ALKIS KONSTANTINIDIS)Tension remains highThe strikes come as tension remains high between Israel and Lebanon's Hezbollah after Israel killed Hezbollah's military commander, Fuad Shukr.\nIsrael's strike on Shukr came following a Hezbollah rocket launch, which resulted in the deaths of 12 children from the Druze town of Majdal Shams."}, {"id": "58fdfe63-bccc-4023-8efd-c4b67443b4c0", "title": "Advanced RX9 Hellfire Rocket Used In Haniyeh Assassination : Colonel Hatem Saber", "date": "2024-08-07 04:15", "url": "https://menafn.com/1108525359/Advanced-RX9-Hellfire-Rocket-Used-In-Haniyeh-Assassination-Colonel-Hatem-Saber", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Daily News Egypt) A highly precise RX9 Hellfire rocket was used in the assassination of Hamas leader Ismail Haniyeh in Tehran, according to Colonel Hatem Saber, former commander of the Egyptian Army's 777 unit.\nMultiple conflicting accounts of Haniyeh assassination have emerged:The Iranian government claims a cross-border, satellite-guided missile was used, suggesting no breach of internal security.\nIsrael asserts a precision-guided Hellfire missile, likely the RX9, was used, highlighting a significant breach in the security system surrounding Haniyeh's residence.\nThe use of such advanced weaponry in a targeted assassination raises questions about the sophistication of the operation and its potential geopolitical implications.\nAs investigations continue, the conflicting narratives surrounding Haniyeh's death underscore the complex and often opaque nature of high-profile targeted killings in the region."}, {"id": "2b41bbbb-f085-4ecd-81d0-ca44825275e6", "title": "Preparing to again defend Israel , US presses Iran and Israel to de - escalate", "date": "2024-08-07 11:30", "url": "https://edition.cnn.com/2024/08/06/politics/us-israel-iran-de-escalate/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "The next day, Israel is widely believed to have assassinated Hamas’ political leader in Tehran, which Israel has not admitted to carrying out.\nIran and its proxies have been seen beginning to make some preparations for a potential retaliation against Israel, according to two US officials familiar with intelligence.\nMultiple US officials have told CNN that the US expects an attack against Israel in the coming days.\nOfficials have also told CNN that Iran is still believed to be deliberating the scope of its response.\nArab foreign ministers are expected to continue pressing Iran for restraint while also criticizing Israel for Haniyeh’s killing."}, {"id": "8fe29336-7229-47c2-a975-e6cdbda866b1", "title": "Six IDF soldiers injured in fresh strikes from Hezbollah", "date": "2024-08-07 11:00", "url": "https://www.siasat.com/six-idf-soldiers-injured-in-fresh-strikes-from-hezbollah-3074971/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "As many as six Israel Defence Forces (IDF) soldiers sustained injuries after a barrage of rockets were fired from Lebanon in northern Israel on Tuesday, Times of Israel reported.\nThis comes a day after senior Hezbollah, Ali Jamal al-Din Jawad was killed in an Israeli drone strike in southern Lebanon.\nToday, I spoke with Israeli Minster of Defense Yoav Gallant to reaffirm U.S. commitment to Israel’s defense from threats posed by Iran, Lebanese Hizballah, and other Iran-aligned militia groups.\nLast month, Israel Defence Forces (IDF) confirmed that top Hezbollah commander Fuad Shukr was killed in the Israeli strike in southern Lebanon on Tuesday (local time).\nThis has been followed by intense strikes between Israel and Hezbollah in Lebanon, sparking fears of a wider conflict."}, {"id": "a2ac3460-0c4a-4234-bec4-b830c31a4ab4", "title": "Hamas Appoints Sinwar as New Leader in Defiant Move", "date": "2024-08-07 13:30", "url": "https://dailystar.com.lb/hamas-appoints-sinwar-leader-defiant-move/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Hamas has appointed Yahya Sinwar, its top official in Gaza and the mastermind behind the October 7 attacks in Israel, as its new leader.\nSinwar, a secretive figure closely tied to Iran, has long been instrumental in building Hamas’ military capabilities.\nHamas announced Sinwar as the new head of its political bureau, replacing Haniyeh, who died in a blast that Iran and Hamas attributed to Israel.\nIn a statement to Al-Jazeera, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas’ leader in Gaza since 2017, Sinwar has rarely appeared in public but maintained a tight grip on the group’s rule."}, {"id": "b995b9f8-6c5e-4445-834d-44c0eaccb00a", "title": "No Fort Drum soldiers hurt in Iraq attack", "date": "2024-08-07 03:15", "url": "https://www.wwnytv.com/2024/08/06/no-fort-drum-soldiers-hurt-iraq-attack/", "domain": "wwnytv.com", "domain_classification": "Unknown", "message": "WASHINGTON, D.C. (WWNY) - No Fort Drum soldiers were injured in Monday’s missile strike at a base housing U.S. troops in western Iraq.\nSeven personnel were hurt at al Asad airbase after a pair of rockets hit, according to the Pentagon.\nOf the seven, five were soldiers.\n7 News has learned that although Fort Drum troops are in that region, they were not injured.\nThe attack comes as tensions in the region simmer following a pair of Israeli strikes that killed two top Iranian-backed militia leaders in Iran and Lebanon, prompting Iranian threats of retaliation."}, {"id": "30b7e126-e4ea-4f67-ac9c-be8ebf642225", "title": "North Korea Nuclear Doctrine : Trusted Shield and Treasured Sword", "date": "2024-08-07 14:30", "url": "https://www.heritage.org/asia/report/north-koreas-nuclear-doctrine-trusted-shield-and-treasured-sword", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Strategic Objectives of North Korea’s Nuclear ProgramFor decades, debate raged about whether North Korea was developing nuclear weapons as a military capability or merely as a nuclear bargaining chip.\nNorth Korean nuclear weapons deter allied preemptive or decapitation attacks, inhibit allied military responses to North Korean actions, and threaten the American homeland.\nNorth Korea’s nuclear doctrine has evolved in phases as the regime has augmented and improved its nuclear and missile arsenals.\nA more survivable North Korean nuclear force could create first-strike uncertainty for the United States with respect to whether it is able to target all of North Korea’s nuclear weapons.\nOne way to improve regional missile defense is by building an advanced missile defense system on Guam to bolster the existing THAAD system on the island."}, {"id": "3760b27a-704e-4e6b-ad7a-302cf6721a93", "title": "Seven US personnel hurt in attack on Iraq base - World", "date": "2024-08-07 05:30", "url": "https://www.dawn.com/news/1850626/seven-us-personnel-hurt-in-attack-on-iraq-base", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BAGHDAD: A rocket attack on a base in Iraq wounded seven US personnel, officials said, adding to already heightened regional tensions over an expected Iranian counterattack on Israel.\n“There was a suspected rocket attack today against US and coalition forces” at the site in western Iraq, a US defence spokesperson said.\n“Initial indications are that several US personnel were injured.”“Base personnel are conducting a post-attack damage assessment” and updates will be provided as more information becomes available, the spokesperson added.\nThe strike, which Iraqi sources said left four killed, was the first by American forces in Iraq since February.\nThere have been two recent attacks targeting bases hosting US and allied forces in Iraq — on July 16 and 25."}, {"id": "b77b9a2d-447f-4992-bd73-b0739a4474b3", "title": "Missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-07 06:15", "url": "https://apnews.com/article/yemen-houthi-rebels-red-sea-attacks-israel-hamas-war-89f89bfb6db61f74fcfe8b40ef203bd3", "domain": "apnews.com", "domain_classification": "International", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "c118fd00-2bdc-4d53-ac11-48ae477e1c4c", "title": "Israeli army issues new evacuation orders in north Gaza after fresh rocket fire", "date": "2024-08-07 12:00", "url": "https://www.yahoo.com/news/israeli-army-issues-evacuation-orders-111754041.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"For your own safety, evacuate immediately to the known shelters in the center of Gaza City,\" the army spokesman said.\nIn a nearby Gaza City neighbourhood, Al-Tuffah, an Israeli airstrike on a house killed three Palestinians, medics said.\nLater on Wednesday, 10 Palestinians were killed in two separate Israeli strikes in Khan Younis in southern Gaza.\nIn other central areas, Israeli tanks shelled Nuseirat and Bureij, two of Gaza Strip's eight historic refugee camps.\nIsrael says Hamas militants use civilian infrastructure for cover and to conceal operations posts and arms caches; Hamas denies this."}, {"id": "bf61a8ea-9f1b-4f9c-8bc9-3280dc8aad1f", "title": "Israeli army issues new evacuation orders in north Gaza after fresh rocket fire", "date": "2024-08-07 11:45", "url": "https://www.marketscreener.com/quote/currency/IRR-172239402/news/Israeli-army-issues-new-evacuation-orders-in-north-Gaza-after-fresh-rocket-fire-47582229/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"For your own safety, evacuate immediately to the known shelters in the center of Gaza City,\" the army spokesman said.\nIn a nearby Gaza City neighbourhood, Al-Tuffah, an Israeli airstrike on a house killed three Palestinians, medics said.\nIsrael says Hamas militants use civilian infrastructure for cover and to conceal operations posts and arms caches; Hamas denies this.\nOn Tuesday, Islamic Jihad, a close Hamas ally, said it fired rockets into Israel in response to what it called Israeli \"massacres of civilians\".\nHamas-led militants set off the Gaza war on Oct. 7 with a cross-border rampage into Israeli communities, killing 1,200 Israelis and foreigners and seizing some 250 hostages, according to Israeli tallies."}, {"id": "20361569-0ef0-45b4-9f1d-2dc89b9647be", "title": "Reports : Iran Asks Russia for Air Defense Systems as World Anticipates Attack on Israel", "date": "2024-08-07 01:30", "url": "https://www.breitbart.com/middle-east/2024/08/06/reports-iran-asks-russia-for-air-defense-systems-as-world-anticipates-attack-on-israel/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Multiple reports on Monday and Tuesday indicated that Iranian officials asked Russian allies to supply them with advanced air defense systems — which may already be en route to Tehran — in anticipation of the rogue terror state’s attack on Israel.\nFormer Russian Defense Minister Sergei Shoigu, now serving as a Russian Security Council secretary, visited Iran on Monday to meet with several top officials, including President Masoud Pezeshkian.\nMultiple Iranian outlets reported on Monday that, as part of the discussions, Iran asked Russian officials for advanced air defense gear.\nThe left-wing American New York Times newspaper later claimed, citing anonymous Iranian officials, that the equipment in question was already on its way to Iran.\nIranian officials have been threatening to unleash their “holy wrath” on Israel since the death of Hamas “political” chief Ismail Haniyeh in Tehran on July 31."}, {"id": "70241259-a3ed-4aa6-80d7-738a5385fbc7", "title": "Hamas selects hard - liner Sinwar to lead | The Arkansas Democrat - Gazette", "date": "2024-08-07 10:00", "url": "https://www.arkansasonline.com/news/2024/aug/07/hamas-selects-hard-liner-sinwar-to-lead/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast Iran and Hamas blamed on Israel.\nAlso last week, Israel said it had confirmed the death of the head of Hamas' military wing, Mohammed Deif, in a July airstrike in Gaza.\nThe two assassinations left Sinwar as the most prominent figure in Hamas.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nHamas has demanded guarantees from mediators that an initial cease-fire will continue until terms for that exchange are worked out."}, {"id": "3d33a151-7eb5-41a8-84a7-fbb539c49efb", "title": "Israel vows to kill newly - appointed Hamas leader as Yahya Sinwar - one of the terror group most extreme figures - replaces assassinated Ismail Haniyeh", "date": "2024-08-07 08:00", "url": "https://www.dailymail.co.uk/news/article-13717423/Israel-vows-kill-newly-appointed-Hamas-leader-Yahya-Sinwar-one-terror-groups-extreme-figures-replaces-assassinated-Ismail-Haniyeh.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Hamas named Yahya Sinwar, its top official in Gaza who masterminded the October 7 attacks in Israel, as its new leader yesterday - and it didn't take long for Israel to declare him a dead man.\nBut Sinwar is a ruthless hardliner who has vowed to fight to the bitter end and worked decades to develop Hamas' military and intelligence capabilities.\nA founding member of Hamas' student movement, Sinwar was active during the first intifada against Israel, which started in Gaza in 1987.\nAfter October 7, Israeli military spokesman Lieutenant Colonel Richard Hecht called Sinwar the 'face of evil' and declared him a 'dead man walking'.\nRear Admiral Hagari told Al-Arabiya flatly: 'Yahya Sinwar is a terrorist, who is responsible for the most brutal terrorist attack in history.'"}, {"id": "8d547907-be93-4b57-afa6-659dc176a20c", "title": "Raleigh Police respond to stabbing call , charge victim in earlier shooting", "date": "2024-08-07 08:30", "url": "https://abc11.com/post/raleigh-police-respond-stabbing-call-charge-victim-earlier-shooting/15152263/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Raleigh Police respond to stabbing call, charge victim in earlier shootingA man who was the victim of a stabbing Tuesday morning was subsequently charged in an earlier shooting the same day.\nA man who was the victim of a stabbing Tuesday morning was subsequently charged in an earlier shooting the same day.\nA man who was the victim of a stabbing Tuesday morning was subsequently charged in an earlier shooting the same day.\nA man who was the victim of a stabbing Tuesday morning was subsequently charged in an earlier shooting the same day.\nRALEIGH, N.C. (WTVD) -- A man who was the victim of a stabbing Tuesday morning was subsequently charged in a shooting earlier the same day."}, {"id": "c0dcdba5-25e0-4162-93b1-4d2105b222f8", "title": "Putin asks Iran to postpone Israel strike , offers to mediate", "date": "2024-08-07 08:15", "url": "https://asiatimes.com/2024/08/putin-asks-iran-to-postpone-israel-strike-offers-to-mediate/", "domain": "asiatimes.com", "domain_classification": "Unknown", "message": "The letter was hand-delivered by Russian Defense Minister Sergei Shoigu, who arrived in Tehran on Monday.\nReuters reported August 6 that Putin asked Iran to avoid civilian casualties in any prospective military action on Israel.\nThe New York Times reported August 5 that Russia was sending air defense systems to Iran, without specifying the systems in question.\nRussia has stood down its air defense and allowed Israel to operate unimpeded.\nIf Putin helps Israel by defusing a possible exchange of fire with Iran, he will want some favors in return."}, {"id": "8f8f14b5-3b93-426a-a2cd-5474aba84811", "title": "US charges Pakistani with alleged ties to Iran in foiled assassination plot", "date": "2024-08-07 00:45", "url": "https://dunyanews.tv/en/Pakistan/829124-us-charges-pakistani-with-alleged-ties-to-iran-in-foiled-assassination", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US charges Pakistani with alleged ties to Iran in foiled assassination plotPakistan Pakistan US charges Pakistani with alleged ties to Iran in foiled assassination plotAsif Merchant was charged with murder for hire in federal court in New York's Brooklyn borough.\nFollow on Published On: Wed, 07 Aug 2024 05:21:27 PKTWASHINGTON (Reuters) - A Pakistani man with alleged ties to Iran has been charged in the United States in connection with a foiled plot to assassinate a U.S. politician or government officials, the Justice Department said on Tuesday.\nMerchant, who prosecutors allege spent time in Iran before traveling to the United States from Pakistan, was charged with murder for hire in federal court in New York's Brooklyn borough.\nMerchant told a law enforcement informant that there would be \"security all around\" one target, according to the criminal complaint.\nMerchant told the informant his plans also included stealing documents from one target and organizing protests in the United States, prosecutors allege."}, {"id": "5e2e0450-59bd-4fd9-9925-73cf6575b214", "title": "Iran Is Expected To Attack Israel SOON", "date": "2024-08-07 00:30", "url": "https://www.shtfplan.com/headline-news/iran-is-expected-to-attack-israel-soon", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "Iran is expected to attack Israel within the next 48 hours following a major attack by Hezbollah that left two Israeli Defense Forces soldiers injured, top Western diplomats have warned.\nIsrael Considers “Preemptive Strike” On IranThe U.S. has already signaled its intent to defend Israel and says it has no idea what a retaliatory response by Tehran would even look like.\nDespite this, two Israeli troops were wounded in the attack, which also set off a fire in northern Israel.\nHezbollah said in a statement it targeted a military base in northern Israel in response to ‘attacks and assassinations’ carried out by Israel in several villages in south Lebanon.\n-The Daily Mail UKThese ongoing attacks between Israel and both Lebanon and Iran could be the red line that ignites world war 3."}, {"id": "5b5c49e8-67a6-4aae-9499-a83fab97fe86", "title": "Israel - Hamas war latest : Hamas chooses Oct . 7 mastermind Yahya Sinwar as their new leader", "date": "2024-08-07 10:00", "url": "https://www.ksat.com/news/2024/08/07/israel-hamas-war-latest-hamas-chooses-oct-7-mastermind-yahya-sinwar-as-their-new-leader/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken says the newly chosen Hamas leader Yahya Sinwar has the power to ensure that a cease-fire deal is reached for the Israel-Hamas war in Gaza.\nConcerns are also high after Israel killed a top Hezbollah commander in Lebanon last week.\nThe overall Palestinian death toll from the Israel-Hamas war has risen to at least 39,677, Gaza's Health Ministry says, with another 91,645 wounded.\nFollowing the accusations of harsh treatment that prompted this court case, Israel said it was transferring the bulk of Palestinian detainees out of Sde Teiman and upgrading it.\nHamas’ new political leader has the power to ensure cease-fire deal, Blinken saysWASHINGTON — U.S. Secretary of State Antony Blinken said Yahya Sinwar, the mastermind of the Oct. 7 attack who is becoming Hamas’ new political leader, has the power to ensure that a cease-fire deal is reached."}, {"id": "08392722-d7b7-47ab-ae74-5b41840c8882", "title": "Hezbollah launches fresh attack against Israeli military site", "date": "2024-08-07 12:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240806-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah launches fresh attack against Israeli military siteIRNA - Islamic Republic News AgencyAug 6, 2024Tehran, IRNA -- The Lebanese resistance movement Hezbollah has conducted a new strike against an Israeli military site in an effort to further support the Palestinian cause.\nHezbollah targeted the Zionist military base in northern Palestine with missiles on Tuesday morning, news outlets have reported.\nThe missile attack was aimed at supporting the Palestinian people in the Gaza Strip and their resistance to the Zionist regime's attacks on civilian residents of villages and towns in southern Lebanon.\nDuring the operation, a building in one of the Zionist settlements that had turned into the headquarters of the occupying military was directly targeted with missiles.\nHezbollah and the Israeli army have been trading fire across the border since October 8, a day after the occupying regime launched a devastating war on Gaza, which has killed nearly 40,000 Palestinians so far."}, {"id": "566a57d9-f2e0-4906-ad3b-89f4f99ee1ba", "title": "Hamas names Oct 7 mastermind Sinwar as leader after Haniyeh assassination", "date": "2024-08-07 02:00", "url": "https://www.asiaone.com/world/hamas-names-oct-7-mastermind-sinwar-leader-after-haniyeh-assassination", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "CAIRO — Hamas named its Gaza leader Yahya Sinwar as successor to former political chief Ismail Haniyeh, who was assassinated in Tehran last week, the group said on Aug 6, in a move that reinforces the radical path pursued since the Oct 7 attack on Israel.\n\"The Islamic Resistance Movement Hamas announces the selection of Commander Yahya Sinwar as the head of the political bureau of the movement, succeeding the martyr Commander Ismail Haniyeh, may Allah have mercy on him,\" the movement said, in a brief statement.\nSinwar, who spent half his adult life in Israeli prisons, was the most powerful Hamas leader left alive following the assassination of Haniyeh, which has left the region on the brink of a wider regional conflict after Iran vowed harsh retaliation.\nIsrael has not claimed responsibility for the assassination but it has said it killed other senior leaders, including Hamas deputy leader Saleh al-Arouri, who was killed in Beirut, and Mohammed Deif, the movement's military commander.\nBorn in a refugee camp in the southern Gaza city of Khan Younis, Sinwar, 61, was elected as Hamas' leader in Gaza in 2017 after gaining a reputation as a ruthless enforcer and an implacable enemy of Israel."}, {"id": "bd99847b-0bdc-43a9-800c-318c338add96", "title": "Yahya Sinwar Appointed as New Hamas Political Leader", "date": "2024-08-07 09:30", "url": "https://themedialine.org/headlines/yahya-sinwar-appointed-as-new-hamas-political-leader/", "domain": "themedialine.org", "domain_classification": "Unknown", "message": "Sinwar, who has been the leader of Hamas in Gaza since 2017, will now also replace Ismail Haniyeh, the former political leader who played a crucial role in indirect cease-fire talks with Israel.\nBorn in Gaza, the 61-year-old Sinwar is a major target for Israeli forces and is believed to be hiding in tunnels to evade attacks.\nHamas and Iran have accused Israel of the bombing that killed Haniyeh in Tehran following his attendance at the inauguration of Iran’s new president.\nFor years, the political leaders of Hamas have been based outside Gaza or in the West Bank, leading to a divided power structure.\nSinwar, who joined Hamas in the 1980s and spent over two decades in an Israeli prison, was released in a prisoner exchange in 2011."}, {"id": "05697995-c120-4b75-8705-de366106bf00", "title": "U . S . Urges Calm as Middle East Tensions Escalate", "date": "2024-08-07 00:45", "url": "https://www.devdiscourse.com/article/law-order/3044402-us-urges-calm-as-middle-east-tensions-escalate", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "The Middle East is bracing for a possible new wave of attacks by Iran and its allies following last week's killing of senior members of militant groups Hamas and Hezbollah.\n\"Further attacks only raise the risk of dangerous outcomes that no one can predict and no one can fully control.\"\nThe Pentagon has said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster defenses in the region.\nThe attack drew threats of revenge by Iran on Israel, which has not claimed responsibility.\nAsked if he knew who was behind the attack, Austin added the U.S. was sure it was an Iran-backed militia, but had not determined which one."}, {"id": "b759edcf-29a7-48a3-b385-37adda03f468", "title": "U . S . on high alert as Iran proxies threaten retaliation following Israeli strikes – NaturalNews . com", "date": "2024-08-07 08:00", "url": "https://www.naturalnews.com/2024-08-06-us-on-high-alert-iran-proxies-retaliation.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "U.S. on high alert as Iran’s proxies threaten retaliation following Israeli strikesWashington is closely monitoring the potential for coordinated attacks on Israel by Iran's proxies from Yemen, Iraq and Lebanon, a U.S. official informed Middle East Eye (MEE).\n\"Iran's proxies are expected to play a more significant role in retaliation than in April’s attack,\" the official told MEE.\nThis led to a limited Israeli response – a small drone strike on Isfahan.\nThe Houthis' drone strike on Israel in July led to an Israeli response and a subsequent easing of financial restrictions by Yemen's Saudi-backed government.\nRecent Israeli strikes in Beirut and Tehran have strained perceptions of U.S. control over Israeli actions, complicating diplomatic efforts."}, {"id": "1cf8cddd-9543-4fb6-b2da-bda1febda7d3", "title": "US has communicated need to not escalate conflict to Iran and Israel , says Blinken", "date": "2024-08-07 00:45", "url": "https://www.aol.com/us-communicated-not-escalate-conflict-230709880.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The Pentagon has said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster defenses in the region.\nWILL NOT TOLERATE ATTACK ON TROOPSIsmail Haniyeh, the political leader of Palestinian Islamist group Hamas, was assassinated in the Iranian capital of Tehran last week.\nThe attack drew threats of revenge by Iran on Israel, which has not claimed responsibility.\nIran has said the U.S. bears responsibility in the assassination of Haniyeh because of its support for Israel.\nAsked if he knew who was behind the attack, Austin added the U.S. was sure it was an Iran-backed militia, but had not determined which one."}, {"id": "41ead0fa-38f1-4661-8d50-036398481e63", "title": "US , Australia announce efforts to boost munition production", "date": "2024-08-07 01:30", "url": "https://www.yahoo.com/news/us-australia-announce-efforts-boost-224419957.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The U.S. and Australia on Tuesday announced a new collaborative effort to ramp up production of key munitions as the allies strengthen a pact focused on deterring China in the Indo-Pacific.\nAt a Tuesday press conference in Annapolis, Md., Defense Secretary Lloyd Austin and Australian Deputy Prime Minister and Minister for Defense Richard Marles lauded the efforts as a sign of strengthening ties between their nations.\nSecretary of State Antony Blinken and Australian Foreign Minister Penny Wong also joined the meeting in Annapolis on Tuesday.\nAnd under the Southern Cross Integrated Flight Research Experiment, the U.S. and Australia are pushing to develop an air-launched hypersonic weapon.\nA U.S. defense official said Australia will also work more closely on joint exercises and training, including with other allies like Japan and the Philippines."}, {"id": "ff1c599f-2fd0-4cce-95cb-b4e1bed44d6f", "title": "Israel - Hamas war latest : Hamas chooses Oct . 7 mastermind Yahya Sinwar as their new leader", "date": "2024-08-07 09:15", "url": "https://www.whec.com/national-world/israel-hamas-war-latest-hamas-chooses-oct-7-mastermind-yahya-sinwar-as-their-new-leader/", "domain": "whec.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken says the newly chosen Hamas leader Yahya Sinwar has the power to ensure that a cease-fire deal is reached for the Israel-Hamas war in Gaza.\nConcerns are also high after Israel killed a top Hezbollah commander in Lebanon last week.\nThe overall Palestinian death toll from the Israel-Hamas war has risen to at least 39,677, Gaza’s Health Ministry says, with another 91,645 wounded.\nFollowing the accusations of harsh treatment that prompted this court case, Israel said it was transferring the bulk of Palestinian detainees out of Sde Teiman and upgrading it.\nHamas’ new political leader has the power to ensure cease-fire deal, Blinken saysWASHINGTON — U.S. Secretary of State Antony Blinken said Yahya Sinwar, the mastermind of the Oct. 7 attack who is becoming Hamas’ new political leader, has the power to ensure that a cease-fire deal is reached."}, {"id": "417fb065-df24-434a-8ce2-52f2f128ed74", "title": "Israel - Hamas war latest : Hamas chooses Oct . 7 mastermind as their new leader as wider war feared", "date": "2024-08-07 00:30", "url": "https://www.ktsa.com/israel-hamas-war-latest-hamas-chooses-oct-7-mastermind-as-their-new-leader-as-wider-war-feared/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "Israel said it killed Shukur but did not claim or deny the rocket attack that killed Hamas leader Ismail Haniyeh, who was visiting Tehran.\nUltra-Orthodox protesters enter Israeli military base, objecting to draft orderJERUSALEM — Ultra-Orthodox protesters have jumped barriers and broken through fences to storm an Israeli military recruitment base in another demonstration against their impending enlistment.\nThe Israeli military said “a number” of drones entered from Lebanon, one of which was intercepted.\nThe Palestinian territory has been plunged into a severe humanitarian crisis in the war ignited by Hamas’ Oct. 7 attack into Israel.\nViolence has surged in the occupied West Bank since Hamas’ Oct. 7 attack triggered the war in Gaza."}, {"id": "8ca84d9e-e4d5-4086-8799-51aad33b4dc8", "title": "Pakistani man with ties to Iran charged with assassination plot in U . S . ", "date": "2024-08-07 02:15", "url": "https://www.yahoo.com/news/pakistani-man-ties-iran-charged-012713750.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pakistani man with ties to Iran charged with assassination plot in U.S.Pakistani national Asif Merchant, 46, is alleged to be part of an Iranian-backed murder-for-hire plot to assassinate a politician, believed by FBI officials to be former President Donald Trump or U.S. government officials on U.S. soil.\nMerchant is a Pakistani national \"with close ties with Iran,\" FBI Director Christopher Wray said.\nMerchant allegedly told the informant there would be more than one assassination and all targets would be killed in the United States while making a \"'finger gun' motion\" with his hand.\nThe Department of Justice's announcement of the arrest and charges filed against Merchant come after Iran allegedly threatened to assassinate Trump.\nThe Department of Justice previously provided information on Merchant paying $5,000 to assassinate someone that the FBI said might be Trump."}, {"id": "db0ff025-5feb-4393-b125-cabc817b6349", "title": "US has communicated need to not escalate conflict to Iran and Israel , says Blinken", "date": "2024-08-07 07:15", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219167/US-has-communicated-need-to-not-escalate-conflict-to-Iran-and-Israel,-says-Blinken", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)The United States has communicated to Iran and Israel that conflict in the Middle East must not escalate, Secretary of State Antony Blinken said on Tuesday, even as the Pentagon warned that it would not tolerate attacks against its forces in the region.\nWe've communicated that message directly to Israel,\" Blinken said.\nThe United States will continue to defend Israel against attacks, Blinken said, but noted that everyone in the region should understand the risks of escalation and miscalculation.\nThe Pentagon has said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster defenses in the region.\nAsked if he knew who was behind the attack, Austin added the U.S. was sure it was an Iran-backed militia, but had not determined which one."}, {"id": "a73b504f-5c0d-4b3f-a001-a58b7600b2b6", "title": "US charges man with alleged ties to Iran in foiled assassination plot", "date": "2024-08-07 08:00", "url": "https://www.stabroeknews.com/2024/08/07/news/world/us-charges-man-with-alleged-ties-to-iran-in-foiled-assassination-plot/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "WASHINGTON, (Reuters) – A Pakistani man with alleged ties to Iran has been charged in the United States in connection with a foiled plot to assassinate a U.S. politician or government officials, the Justice Department said yesterday.\nMerchant, who prosecutors allege spent time in Iran before traveling to the United States from Pakistan, was charged with murder for hire in federal court in New York’s Brooklyn borough.\nMerchant told a law enforcement informant that there would be “security all around” one target, according to the criminal complaint.\nAn individual Merchant contacted in April to help assist with the plot reported his activities to law enforcement and became a confidential informant, according to the complaint.\nMerchant told the informant his plans also included stealing documents from one target and organizing protests in the United States, prosecutors allege."}, {"id": "68063dea-3bf1-49ac-bfbf-fb36990d63bf", "title": "Tel Aviv prepares for Iran Hezbollah attack , sends rescue units to city", "date": "2024-08-07 00:00", "url": "https://www.jpost.com/israel-hamas-war/article-813626", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF Home Front Command moved the search and rescue forces of the Ram Battalion—the rescue battalion—to Tel Aviv, the IDF confirmed on Tuesday, as part of the efforts to prepare for a potential Iranian and Hezbollah attack.\nThe forces were deployed near the Yad Eliyahu Stadium, where the Home Front Command's rescue cars and trailers—which are defined as intervention and rapid rescue tools—were stationed.\nOther cities receive similar rescue unitsThe IDF confirmed that it deployed its search and rescue battalions to a number of central Israeli cities as part of its preparations.\nRapid rescue teams were stationed in Haifa, Krayot, and several cities in the south and center of the country.\nHome Front Command has permanent guidelines on how to be well prepared for an attack by keeping one’s bomb shelter stocked."}, {"id": "42d5a230-e708-4bcd-82cc-fe9b4cfe6ab9", "title": "CRS says Houthis pose a long term threat", "date": "2024-08-07 00:30", "url": "https://www.marinelog.com/legal/safety-and-security/crs-says-houthis-pose-a-long-term-threat/", "domain": "marinelog.com", "domain_classification": "Unknown", "message": "But not for long, indicating that the Houthis pose a long term threat that won’t go away any time soon, with a recent Congressional Research Service (CRS) “In Focus” briefing saying that “Yemen’s underlying conflict remains unresolved and the long-term threats the Houthis could pose present a vexing challenge for policymakers to consider.”20240803-UKMTO INCIDENT 105 WARNING-ATTACK -UPDATE 001The Company Security Officer reports that the vessel was hit by a missile.\nThe following day, that same vessel reported being struck by what the company security officer described as a missile.\nThat vessel was the Liberian-flagged containership M/V Groton and had left Fujairah in the United Arab Emirates bound for Jeddah, Saudi Arabia.\nYesterday it reported:“In the past 24 hours, U.S. Central Command forces successfully destroyed three Iranian-backed Houthi uncrewed aerial systems (UAS) launched from Houthi-controlled areas of Yemen over the Gulf of Aden.\n“Additionally, USCENTCOM forces successfully destroyedto one Iranian-backed Houthi UAS in a Houthi-controlled area of Yemen."}, {"id": "bb8cde56-fc3c-43ca-828c-e513d0f17ef4", "title": "US has communicated need to not escalate conflict to Iran and Israel , says Blinken", "date": "2024-08-07 08:00", "url": "https://www.stabroeknews.com/2024/08/07/news/world/us-has-communicated-need-to-not-escalate-conflict-to-iran-and-israel-says-blinken/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "US has communicated need to not escalate conflict to Iran and Israel, says BlinkenANNAPOLIS, Maryland, (Reuters) – The United States has communicated to Iran and Israel that conflict in the Middle East must not escalate, Secretary of State Antony Blinken said yesterday, even as the Pentagon warned that it would not tolerate attacks against its forces in the region.\nThe Middle East is bracing for a possible new wave of attacks by Iran and its allies following last week’s killing of senior members of militant groups Hamas and Hezbollah.\nThe United States will continue to defend Israel against attacks, Blinken said, but noted that everyone in the region should understand the risks of escalation and miscalculation.\nThe attack drew threats of revenge by Iran on Israel, which has not claimed responsibility.\nIran has said the U.S. bears responsibility in the assassination of Haniyeh because of its support for Israel."}, {"id": "73db2452-74e7-4265-aa41-1c5807ae1583", "title": "Israel Accuses Hamas of Using Human Shields . IDF Embeds Among Civilians at Lebanon Border . ", "date": "2024-08-07 00:30", "url": "https://theintercept.com/2024/08/02/lebanon-israel-hezbollah-idf-civilians-outposts/", "domain": "theintercept.com", "domain_classification": "Unknown", "message": "ARAB AL-ARAMSHE, ISRAEL — Inside the shrapnel-pocked school building, children’s drawings are strewn about and traces of blood dot the floor.\nYet the military has not changed course, continuing to station soldiers in the villages that dot the country’s northern border, putting civilians in harm’s way.\nThe IDF’s practice of embedding its troops among civilians in the north mirrors the alleged “human shields” policy for which it has repeatedly condemned Hamas.\nWhile Israel has criticized Hezbollah for targeting civilians in recent months, including when it killed two Israeli civilians driving in the occupied Golan Heights, the casualty counts tell a different story.\nSince October 7, 450 have been killed in Lebanon, including at least 100 civilians; in Israel, 23 civilians and 17 soldiers have been killed in the fighting."}, {"id": "8e9a004a-66c2-4f0c-875a-cf6243629ed9", "title": "Hamas names Yahya Sinwar ,  architect  of October 7 attacks , as its new political leader", "date": "2024-08-07 01:45", "url": "https://www.sbs.com.au/news/article/hamas-names-yahya-sinwar-architect-of-october-7-attacks-as-its-new-political-leader/f85sw06fx", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "Hamas has named its Gaza Strip leader Yahya Sinwar as successor to former political chief Ismail Haniyeh, who was assassinated in Tehran last week , the group says in a move that reinforces the radical path pursued since the October 7 attack on Israel.\nSinwar, accused of being the architect of the most devastating attack on Israel in decades, has been in hiding in Gaza, defying Israeli attempts to kill him since the start of the war.\nIsrael's chief military spokesman blamed Sinwar for the October 7 attack and said Israel would continue to pursue him.\nIsrael has bombarded Gaza since Hamas' October 7 attack in which more than 1,200 people were killed and over 200 hostages taken, according to the Israeli government.\nMore than 39,653 people have been killed in Gaza since October 7, according to the health ministry in Gaza."}, {"id": "e36493e5-0b64-4d07-aeb1-6ab010c1be62", "title": "Hamas attack : Final missing Israeli victim declared dead", "date": "2024-08-07 11:30", "url": "https://www.bbc.co.uk/news/articles/cwyxleqky15o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Previously even fingertip searches in the ash and debris had failed to find as much as a trace of Bilha's DNA.\n\"The house got a direct hit and was on fire within minutes,\" Maayan told Israeli TV in February.\nHamas gunmen killed about 1,200 people in the unprecedented attack, and took 251 others back to Gaza as hostages.\nThe attack triggered a massive Israeli military offensive on Gaza and the ongoing war.\nMore than 39,600 Palestinians have been killed in the Israeli campaign, according to Gaza's Hamas-run health ministry."}, {"id": "d625f4b6-8552-4e2f-9f57-d35b12afeecd", "title": "Man with alleged ties to Iran charged in foiled assassination plot", "date": "2024-08-07 01:45", "url": "https://www.unionleader.com/news/crime/man-with-alleged-ties-to-iran-charged-in-foiled-assassination-plot/article_fb63343f-1e30-5134-9b9c-414f52bab136.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "540415fc-fc3f-45db-a91a-b8d653ba517f", "title": "Israel - Hamas war latest : Hamas chooses Oct . 7 mastermind Yahya Sinwar as their new leader – Winnipeg Free Press", "date": "2024-08-07 08:00", "url": "https://www.winnipegfreepress.com/world/2024/08/07/israel-hamas-war-latest-hamas-chooses-oct-7-mastermind-yahya-sinwar-as-their-new-leader", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken says the newly chosen Hamas leader Yahya Sinwar has the power to ensure that a cease-fire deal is reached for the Israel-Hamas war in Gaza.\nConcerns are also high after Israel killed a top Hezbollah commander in Lebanon last week.\nSince early October, Hezbollah began attacking Israeli military posts along the border calling it a backup front for their Palestinian allies in the Gaza Strip.\nFollowing the accusations of harsh treatment that prompted this court case, Israel said it was transferring the bulk of Palestinian detainees out of Sde Teiman and upgrading it.\nHamas’ new political leader has the power to ensure cease-fire deal, Blinken saysWASHINGTON — U.S. Secretary of State Antony Blinken said Yahya Sinwar, the mastermind of the Oct. 7 attack who is becoming Hamas’ new political leader, has the power to ensure that a cease-fire deal is reached."}, {"id": "a68ebc8e-b00c-4e93-9ea2-09e3204ab30f", "title": "Israel on the Brink", "date": "2024-08-07 02:15", "url": "https://www.theatlantic.com/ideas/archive/2024/08/israel-iran/679384/", "domain": "theatlantic.com", "domain_classification": "Unknown", "message": "The war is an existential conflict between Israel and a coalition of its enemies, at the center of which is Iran.\nBut a coalition it is, and with it, Iran has built a ring of fire around Israel.\nStrikingly, Egypt, Jordan, the United Arab Emirates, and even Saudi Arabia have given Israel the use of their airspace and helped in the remarkable defense of Israel in April against salvos of drones and missiles from Iran.\nThe Israeli attacks, in other words, are best seen not as a ploy by Netanyahu but as a considered Israeli move, supported by its national-security establishment.\nFor many years, Israel has waged limited wars intended to contain threats; an old term, hachra’ah, or “decision,” has notably come back into use in Israeli military literature."}, {"id": "39e7c54b-941a-4712-9046-56082856af43", "title": "Hamas names Yahya Sinwar , mastermind of the Oct . 7 attacks , as its new leader", "date": "2024-08-07 13:30", "url": "https://abc11.com/post/hamas-names-yahya-sinwar-mastermind-oct-7-attacks-new-leader/15153793/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Yahya Sinwar chairs a meeting with leaders of Palestinian factions at his office in Gaza City, April 13, 2022.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel's campaign of bombardment and offensives aimed at destroying Hamas."}, {"id": "3012a1a9-a8aa-49c3-84d8-b29979ec86f5", "title": "Hamas names Yahya Sinwar , mastermind of the Oct . 7 attacks , as its new leader", "date": "2024-08-07 14:30", "url": "https://abc7news.com/post/hamas-names-yahya-sinwar-mastermind-oct-7-attacks-new-leader/15153793/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Yahya Sinwar chairs a meeting with leaders of Palestinian factions at his office in Gaza City, April 13, 2022.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel's campaign of bombardment and offensives aimed at destroying Hamas."}, {"id": "6c70fa24-581e-4bef-9c9d-b680b80e6e70", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 14:30", "url": "https://www.wcti12.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "1e86bb9f-9740-417b-b359-4f0fce3d7f11", "title": "Hamas names Yahya Sinwar , mastermind of Oct . 7 attacks , as its new leader", "date": "2024-08-07 01:30", "url": "https://www.pressherald.com/2024/08/06/hamas-names-yahya-sinwar-mastermind-of-oct-7-attacks-as-its-new-leader-in-show-of-defiance/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nHamas has demanded guarantees from mediators that an initial cease-fire will continue until terms for that exchange are worked out.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel’s campaign of bombardment and offensives aimed at destroying Hamas.\n“Two weeks ago, few would have expected Sinwar to be the group’s next leader despite the strong influence he exerts from Gaza,” he said."}, {"id": "e90668e4-dcf0-49a1-89a5-27a862034468", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 11:30", "url": "https://local12.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "local12.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "895234fa-f0f5-4448-9e08-4dc920385859", "title": "Counter - drone missile competition possible in 2025 , Army officials say", "date": "2024-08-07 14:30", "url": "https://www.yahoo.com/news/counter-drone-missile-competition-possible-140104893.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HUNTSVILLE, Ala. — The U.S. Army is considering holding a competition in fiscal 2025 for a next-generation interceptor to take out threats from unmanned aerial systems, Brig.\nGen. Frank Lozano, program executive officer for missiles and space, told an audience Aug. 6 at the Space and Missile Defense Symposium.\nThe Army uses its Combat Capabilities Development Command Aviation & Missile Center to evaluate systems such as Raytheon’s Coyote and Blue Halo’s Next-Generation C-UAS Missile.\nThe Army is also planning on holding a competition for a new handheld device to take out drones, Lozano noted.\nPrior to a Joint Readiness Training Center rotation the service provided the unit with handheld capabilities that could go up against small UAS, according to Lozano."}, {"id": "8bc96fda-1e12-4e07-9a7e-8dd27cfeaf61", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 13:45", "url": "https://wpde.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "f44d87ab-3090-4458-ba90-47b460d4c186", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 13:45", "url": "https://wset.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "wset.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "bf296769-c68f-45a7-9489-6486aa4f41c4", "title": "Russia claims Ukraine launches an attack in Russian territory", "date": "2024-08-07 12:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240806-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia claims Ukraine launches an attack in Russian territoryBy VOA News August 06, 2024Russia's Defense Ministry claimed Tuesday that hundreds of Ukrainian soldiers backed by tanks and armored vehicles attacked Russia's southern Kursk region and that Russian forces responded.\n\"The enemy today launched another attempt to break into the territory of Russia's Kursk region,\" the latest ministry statement said.\nPreviously, two groups have claimed responsibility for similar attacks in different parts of Russia: The Russian Volunteer Corps and the Freedom of Russia Legion.\nMeanwhile, Russian forces carried out aerial attacks on multiple parts of Ukraine, officials said earlier Tuesday, including hitting the northeastern city of Kharkiv with a missile.\nRussian drones also damaged homes in several villages in the Mykolaiv region, Governor Vitaliy Kim said."}, {"id": "04a199cf-b396-4e4a-95a6-1d45e940ad2c", "title": "Hamas names Yahya Sinwar , mastermind of the Oct . 7 attacks , as its new leader", "date": "2024-08-07 12:45", "url": "https://www.10news.com/world/israel-at-war/hamas-names-yahya-sinwar-mastermind-of-the-oct-7-attacks-as-its-new-leader-in-show-of-defiance", "domain": "10news.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nHamas has demanded guarantees from mediators that an initial cease-fire will continue until terms for that exchange are worked out.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel's campaign of bombardment and offensives aimed at destroying Hamas.\n“Two weeks ago, few would have expected Sinwar to be the group’s next leader despite the strong influence he exerts from Gaza,” he said."}, {"id": "4a334503-d649-40ee-a509-c332b5b648a5", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 14:30", "url": "https://wwmt.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "84c79622-fa35-47b6-b798-936e4cb0e301", "title": "Hamas names mastermind of Oct . 7 attacks as its new leader in show of defiance", "date": "2024-08-07 00:00", "url": "https://www.theday.com/nation/20240806/hamas-names-mastermind-of-oct-7-attacks-as-its-new-leader-in-show-of-defiance/", "domain": "theday.com", "domain_classification": "Unknown", "message": "Palestinians stand in rubble after an Israeli airstrike in Deir al Balah, Gaza Strip, Tuesday, Aug. 6, 2024.\n(AP Photo/Abdel Kareem Hana)A Palestinian walks on a smoke-filled street after an Israeli airstrike in Deir al Balah, Gaza Strip, Tuesday, Aug. 6, 2024.\n(AP Photo/Abdel Kareem Hana)A Palestinian man carries an injured child after an Israeli airstrike in Deir al Balah, Gaza Strip, Tuesday, Aug. 6, 2024.\n(AP Photo/Abdel Kareem Hana)Palestinians mourn the victims of an Israeli airstrike in Deir al Balah, Gaza Strip, Tuesday, Aug. 6, 2024.\n(AP Photo/Abdel Kareem Hana)"}, {"id": "a5c3e1e2-057f-4af9-8a33-5c391a562776", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 13:30", "url": "https://cbs12.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "196d2eb1-6049-47e6-b3e8-96832af49631", "title": "Iran may be reconsidering major strike on Israel - The Jerusalem Post", "date": "2024-08-07 10:00", "url": "https://www.jpost.com/breaking-news/article-813665", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Iran may be reconsidering its vow of a harsh reprisal on Israel for last week's assassination of Hamas political bureau leader Ismail Haniyeh in Tehran, Washington Post columnist David Ignatius reported on Wednesday morning, citing White House officials.\nWarships moved to the regionAdditionally, in a show of force, the US has sent more warships to the region in preparation for an Iranian-led attack on Israel.\nBoth President Joe Biden and Vice President Kamala Harris reportedly met with top advisers in the White House's Situation Room this week to discuss the matter.\nAdditionally, the American media outlet added that a squadron of F-22 fighter jets was among the US assets scrambled closer to Israel.\nBiden and Harris also reportedly discussed with advisors the attack by Iranian-backed Iraqi insurgents that wounded American forces in the region."}, {"id": "9520738c-7c79-48a3-89d4-ed203fa212d8", "title": "Lebanon Hezbollah launches drone attacks on Israel , says more to come", "date": "2024-08-07 05:30", "url": "https://dunyanews.tv/en/World/829131-lebanons-hezbollah-launches-drone-attacks-on-israel-says-more-to-com", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah launches drone attacks on Israel, says more to comeWorld World Lebanon's Hezbollah launches drone attacks on Israel, says more to comeLebanon's armed group Hezbollah launched a series of drone and rocket attacks into northern Israel.\nHezbollah said it launched a swarm of attack drones at two military sites near Acre in northern Israel, and also attacked an Israeli military vehicle in another location.\nThe Israeli military said a number of hostile drones were identified crossing from Lebanon and one was intercepted.\nIn a statement, the Israeli military said sirens sounded around Acre, but that turned out to be a false alarm.\nLast week, Israel killed Shukr, Hezbollah's senior-most military commander, in a strike on the group's stronghold in the southern suburbs of Lebanon's capital Beirut."}, {"id": "dde65e44-a91f-45d0-bdbd-88bb847acf89", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 11:30", "url": "https://fox11online.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "836b4efd-2167-4c3c-a649-34fa24dfeb2f", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 11:30", "url": "https://fox17.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "9611ef31-ea6c-4c9a-996c-898d7e5785ea", "title": "  Truly tragic : Coroner opens inquest into deaths of Southport stabbing victims", "date": "2024-08-07 11:00", "url": "https://www.lbc.co.uk/news/southport-inquest-stabbings-truly-tragic-coroner-deaths-taylor-swift/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "'Truly tragic': Coroner opens inquest into deaths of Southport stabbing victims'Truly tragic': Coroner opens inquest into deaths of Southport stabbing victims.\nPicture: AlamyBy Danielle de WolfeAn inquest has been opened into the Southport stabbings which left three young girls dead at a Taylor Swift dance class.\nShe spoke of the \"truly tragic events of Monday, July 29\" as she opened and adjured the case.\nDescribing how the three young girls \"will be missed beyond any description\", the coroner labelled her words of sympathy \"woefully inadequate\".\nThe inquest, which was opened at Bootle Town Hall, was adjourned to allow the criminal process to take place."}, {"id": "89f8eb02-24e2-45cc-a962-f79a644d1941", "title": "Hamas names Yahya Sinwar , mastermind of the Oct . 7 attacks , as its new leader in show of defiance", "date": "2024-08-07 00:00", "url": "https://www.timescolonist.com/world-news/hamas-names-yahya-sinwar-mastermind-of-the-oct-7-attacks-as-its-new-leader-in-show-of-defiance-9316086", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nHamas' representative in Iran, Khaled Kaddoumi, called Sinwar a “consensus choice” popular among all factions and involved in the group’s decision-making throughout, including in negotiations.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel's campaign of bombardment and offensives aimed at destroying Hamas.\n“Two weeks ago, few would have expected Sinwar to be the group’s next leader despite the strong influence he exerts from Gaza,” he said."}, {"id": "d66c59e5-b7fe-4a67-afdb-60c5d5a0ac32", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 11:45", "url": "https://khqa.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "khqa.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "34c140f2-eeeb-4630-ad28-215c2711263b", "title": "August : The bleakest of months ? ", "date": "2024-08-07 14:30", "url": "https://www.yahoo.com/news/august-bleakest-months-131219891.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "File Photo by Ismael Mohamed/UPIAug. 7 (UPI) -- Is August the bleakest of months?\nThe Tonkin Gulf incident may be surprisingly relevant today, as well as the assassination of Hamas leader Ismail Haniyeh in Tehran last week.\nFirst, the North Vietnamese PT boat attacks against two U.S. destroyers that triggered the resolution never occurred.\nOn the evening of Aug. 4th, both ships reported attacking North Vietnamese PT boats.\nWith that as a pretext, President Lyndon B. Johnson drafted the Tonkin Gulf Resolution that Congress overwhelmingly passed."}, {"id": "e2e8cd75-e3c3-48b8-9015-18afec53bc0f", "title": "Grovelling Russia begged US to stop Ukraine from ASSASSINATING Putin in  plan to blow Vlad up with kamikaze drone  ", "date": "2024-08-07 00:45", "url": "https://www.thesun.co.uk/news/29725485/russia-us-stop-ukraine-assassinating-putin-kamikaze-drone/", "domain": "thesun.co.uk", "domain_classification": "Unknown", "message": "A SUSPECTED assassination plot against Vladimir Putin was dramatically halted by the US after Ukraine planned to hit Vlad with a kamikaze drone, Moscow claim.\nThe Navy Day parade was attended by the 71-year-old dictator, and his defence minister Andrei Belousov, 65 last month.\nThey say the defence minister called US defence secretary Lloyd Austin to have a “genuinely tough conversation” about the assassination belief.\nDespite this, deputy foreign minister Ryabkov is adamant the US communicated with Ukraine to stop any attacks planned.\n5 Ryabkov spoke in detail about the alleged foiled assassination attempt on Russian TV Credit: East2West"}, {"id": "20e3287d-94c1-4a7f-9f40-46b32d724e42", "title": "Last missing Israeli victim of Hamas attack declared dead", "date": "2024-08-07 13:45", "url": "https://www.the-star.co.ke/news/world/2024-08-07-last-missing-israeli-victim-of-hamas-attack-declared-dead/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The last person listed as missing from the Hamas attack on Israel 10 months ago has been identified as killed, Israeli authorities say.\n\"The house got a direct hit and was on fire within minutes,\" Maayan told Israeli TV in February.\nHamas gunmen killed about 1,200 people in the unprecedented attack, and took 251 others back to Gaza as hostages.\nThe attack triggered a massive Israeli military offensive on Gaza and the ongoing war.\nMore than 39,600 Palestinians have been killed in the Israeli campaign, according to Gaza's Hamas-run health ministry."}, {"id": "6d2e87be-c314-4a8c-ae44-6bdc9362ef2a", "title": "Hamas says it has chosen Yahya Sinwar as new leader", "date": "2024-08-07 00:30", "url": "https://www.dailylocal.com/2024/08/06/hamas-says-it-has-chosen-yahya-sinwar-as-new-leader/", "domain": "dailylocal.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas’ leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas’ rule over the territory.\nHe has been in deep hiding since the Oct. 7 attacks, which triggered Israel’s campaign of bombardment and offensives aimed at destroying Hamas.\n“Two weeks ago, few would have expected Sinwar to be the group’s next leader despite the strong influence he exerts from Gaza,” he said."}, {"id": "d9fb7c46-706b-458b-bee9-4fe7d75e1513", "title": "Last missing Israeli victim of Hamas attack declared dead", "date": "2024-08-07 11:45", "url": "https://saudigazette.com.sa/article/644701/World/Mena/Last-missing-Israeli-victim-of-Hamas-attack-declared-dead", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "TEL AVIV — The last person listed as missing from the Hamas attack on Israel 10 months ago has been identified as killed, Israeli authorities say.\nBilha Yinon, 75, was killed along with her husband, Yaakov, at their home in Netiv Haasara, when hundreds of gunmen from Gaza stormed southern Israel on 7 October.\nHamas gunmen killed about 1,200 people in the unprecedented attack, and took 251 others back to Gaza as hostages.\nThe attack triggered a massive Israeli military offensive on Gaza and the ongoing war.\nMore than 39,600 Palestinians have been killed in the Israeli campaign, according to Gaza's Hamas-run health ministry."}, {"id": "88c02627-342f-44ab-ab2d-80ee7f356d84", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 01:45", "url": "https://upnorthlive.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nHamas' representative in Iran, Khaled Kaddoumi, called Sinwar a “consensus choice” popular among all factions and involved in the group’s decision-making throughout, including in negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n“Two weeks ago, few would have expected Sinwar to be the group’s next leader despite the strong influence he exerts from Gaza,” he said."}, {"id": "0079d078-9e60-4916-baa2-7271bec56171", "title": "Hamas says it has chosen Yahya Sinwar as new leader", "date": "2024-08-07 00:00", "url": "https://www.timescall.com/2024/08/06/hamas-says-it-has-chosen-yahya-sinwar-as-new-leader/", "domain": "timescall.com", "domain_classification": "Unknown", "message": "Hamas says it has chosen Yahya Sinwar, mastermind of the Oct. 7 attacks, as its new leader Sinwar is a secretive figure who leads Hamas' hardliners and is close to Iran."}, {"id": "27404687-6dd2-4fe2-8698-399d3d502ba1", "title": "Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attack", "date": "2024-08-07 05:30", "url": "https://dunyanews.tv/en/World/829133-flurry-of-diplomacy-to-ease-mideast-tensions-as-israel-awaits-iran-att", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attackWorld World Flurry of diplomacy to ease Mideast tensions as Israel awaits Iran attackDiplomatic pressure mounted on Monday to avoid an escalation between Iran and Israel.\nThe killing came hours after an Israeli strike on Beirut left Hezbollah military chief Fuad Shukr dead.\nBlinken asked his counterparts to place diplomatic pressure on Tehran, Hezbollah and Israel to \"maintain maximum restraint\", it added.\n\"PATH OF DIALOGUE\"Experts and diplomats fear that the expected attack on Israel could rapidly spiral into a regional war.\nMilitants also seized 251 hostages, 111 of whom are still held captive in Gaza, including 39 the military says are dead."}, {"id": "6bad5226-ba44-458c-b036-a953d926b984", "title": "Lebanon : united kingdom military on standby for potential evacuation of nationals", "date": "2024-08-07 11:30", "url": "https://www.bbc.co.uk/news/articles/ckgj2nw4lgro", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Hundreds of troops have been sent to Cyprus, where the UK already has a military presence.\nMeanwhile, in the UK, hundreds more troops have been put on notice - meaning they are ready to be deployed to the region if necessary.\nThe UK already has a significant military presence in Cyprus.\nAbout 1,200 people were killed in the attack, triggering a massive Israeli military response in Gaza.\nHaniyeh's assassination came hours after Israel killed Hezbollah senior commander Fuad Shukr in Beirut."}, {"id": "87fcc62a-b374-48c5-9b2e-c71546c11e0d", "title": "Lebanon : united kingdom military on standby for potential evacuation of nationals", "date": "2024-08-07 11:30", "url": "https://www.bbc.com/news/articles/ckgj2nw4lgro", "domain": "bbc.com", "domain_classification": "International", "message": "UK military on standby for possible Lebanon evacuationKfar Kila, a village in southern Lebanon, was reportedly the site of a recent Israeli strike.\nAn estimated 16,000 British people are currently in Lebanon , Foreign Secretary David Lammy told the House of Commons last week.\nOn Saturday, the Foreign Office repeated a call for UK nationals to leave Lebanon – while confirming that preparations were underway to help with an evacuation of the country if necessary.\nMore than a thousand British military personnel have been put on standby in case British nationals need to be evacuated from Lebanon.\nAbout 1,200 people were killed in the attack, triggering a massive Israeli military response in Gaza."}, {"id": "c34b00be-bacd-4da4-a766-58aa414da3db", "title": "US Central Command Neutralizes Houthi Missiles Amid Rising Middle East Tensions", "date": "2024-08-07 06:15", "url": "https://www.devdiscourse.com/article/international/3044507-us-central-command-neutralizes-houthi-missiles-amid-rising-middle-east-tensions", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "US Central Command announced Tuesday it successfully neutralized an Iranian-backed Houthi uncrewed aerial vehicle and two anti-ship ballistic missiles launched from Houthi-held areas in Yemen over the Red Sea.\nThe weapons posed a \"clear and imminent threat\" to US and coalition forces and merchant vessels in the region, according to the statement.\n\"In the past 24 hours, U.S. Central Command forces successfully destroyed one Iranian-backed Houthi uncrewed aerial vehicle and two Iranian-backed Houthi anti-ship ballistic missiles,\" the statement posted on X read.\nEarlier, on August 3, the US military reported destroying another Iranian-backed Houthi missile and launcher in Yemen.\nThe missile was deemed an imminent threat to US and coalition forces and merchant vessels."}, {"id": "852a8855-ef27-4a92-b2a9-34de33519507", "title": "British riots shows importance of managing migration", "date": "2024-08-07 08:00", "url": "https://www.afr.com/politics/british-riots-show-importance-of-managing-migration-20240806-p5jzyf", "domain": "afr.com", "domain_classification": "Unknown", "message": "UK Prime Minister Keir Starmer has rightly promised to jail the anti-immigration rioters who have attacked police and damaged property, just as he helped to do as head of the Crown Prosecution Service when protests after the police shooting of a black drug dealer turned violent back in 2011.\nThe Starmer government is also canvassing a crackdown on social media platforms that helped fuel the riots rocking cities across England.\nThe riots follow far-right activists spreading online misinformation about the stabbing to death of three children by an underage offender from a migrant background in the northern town of Southport."}, {"id": "5e82a05f-787b-4706-adf7-f33826a45ead", "title": "Hamas names Yahya Sinwar as its new leader in show of defiance", "date": "2024-08-07 13:45", "url": "https://bakersfieldnow.com/news/nation-world/hamas-names-yahya-sinwar-as-its-new-leader-in-show-of-defiance-october-7-attacks-mastermind-palestinian-militant-group-israel-strike-gaza-war-iran-revenge-ismail-haniyeh-killed-cease-fire-hostages", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "Hamas said in a statement it named Sinwar as the new head of its political bureau to replace Haniyeh, who was killed in a blast that Iran and Hamas blamed on Israel.\nIsrael's killings of multiple senior officials in Hamas over recent months left Sinwar as the most prominent figure in the group.\nSpeaking to Al-Jazeera television after the announcement, Hamas spokesman Osama Hamdan said Sinwar would continue the cease-fire negotiations.\nAs Hamas' leader inside Gaza since 2017, Sinwar rarely appeared in public but kept an iron grip on Hamas' rule over the territory.\n\"Two weeks ago, few would have expected Sinwar to be the group's next leader despite the strong influence he exerts from Gaza,\" he said."}, {"id": "7866665f-6a50-44ed-aab2-e28c4084c6a3", "title": "Israel vows to kill new Hamas political leader who plotted Oct . 7 massacre", "date": "2024-08-07 12:00", "url": "https://www.foxnews.com/world/israel-vows-kill-new-hamas-political-leader-who-plotted-oct-7-massacre", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Israel is vowing to kill the new political leader of Hamas, with an IDF official saying the only place he belongs is beside the group’s slain military commander and the rest of the \"October 7th terrorists.\"\nYahya Sinwar, Hamas’ top official in Gaza and one of the masterminds of the massacre that launched the Israel-Hamas war, has become Hamas' new political chief following the July 31 assassination of Ismail Haniyeh in Iran.\nIsrael says it has killed Deif, the head of Hamas’ military wing and another Oct. 7 attack mastermind, in a strike in southern Gaza last month.\nISRAEL SAYS IT HAS KILLED TOP HAMAS MILITARY COMMANDER MOHAMMED DEIFIsraeli Defense Minister Yoav Gallant has previously called Deif the \"Osama Bin Laden of Gaza.\"\nCLICK HERE TO GET THE FOX NEWS APPDuring the Oct. 7 attack, Hamas terrorists killed 1,200 people in southern Israel and abducted 251 hostages into the Gaza Strip."}, {"id": "8984ca8d-3d6f-4309-8c47-046ef7477f2f", "title": "Hamas names alleged October 7 mastermind as new leader", "date": "2024-08-07 12:15", "url": "https://www.gjsentinel.com/news/national/hamas-names-alleged-october-7-mastermind-as-new-leader/article_512195da-f670-571d-b385-39719cc381c1.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Sunday NightScattered thunderstorms during the evening followed by a few showers overnight.\nWinds ESE at 5 to 10 mph.\nChance of rain 50%."}, {"id": "ffb09370-81ab-49d3-8416-e0ba3641c47f", "title": "Who Is New Hamas Chief Yahya Sinwar ? October 7 Attack Mastermind And Key Architect Of Group Military Strength", "date": "2024-08-07 11:45", "url": "https://menafn.com/1108525883/Who-Is-New-Hamas-Chief-Yahya-Sinwar-October-7-Attack-Mastermind-And-Key-Architect-Of-Groups-Military-Strength", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Live Mint) Hamas has named Yahya Sinwar, its top official in Gaza and the mastermind of the October 7 on Israel, as the head of its bureau.\nSinwar, known for his secretive nature and strong ties with Iran, has played a key role in strengthening Hamas' military capabilities.\nThat is the only place we're preparing and intending for him.”Israel's recent killings of several senior Hamas officials have left Yahya Sinwar as the group's most prominent leader.\nHe was closely associated with Mohammed Deif and the Qassam Brigades and focused on enhancing Hamas' military strength.\nAlso Read: Iran rebuffs calls for restraint in its response to killing of Hamas leaderYahya Sinwar More Hardline?"}, {"id": "e5231d8c-6352-493c-8679-9489cfc73593", "title": "Israel - Hamas war latest : Hamas chooses Oct . 7 mastermind Yahya Sinwar as their new leader", "date": "2024-08-07 10:45", "url": "https://www.clickondetroit.com/news/2024/08/07/israel-hamas-war-latest-hamas-chooses-oct-7-mastermind-yahya-sinwar-as-their-new-leader/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken says the newly chosen Hamas leader Yahya Sinwar has the power to ensure that a cease-fire deal is reached for the Israel-Hamas war in Gaza.\nConcerns are also high after Israel killed a top Hezbollah commander in Lebanon last week.\nThe overall Palestinian death toll from the Israel-Hamas war has risen to at least 39,677, Gaza's Health Ministry says, with another 91,645 wounded.\nFollowing the accusations of harsh treatment that prompted this court case, Israel said it was transferring the bulk of Palestinian detainees out of Sde Teiman and upgrading it.\nHamas’ new political leader has the power to ensure cease-fire deal, Blinken saysWASHINGTON — U.S. Secretary of State Antony Blinken said Yahya Sinwar, the mastermind of the Oct. 7 attack who is becoming Hamas’ new political leader, has the power to ensure that a cease-fire deal is reached."}, {"id": "28a86d76-bc06-4c3f-9c2e-82ecc20bf548", "title": "2 men stabbed in Queens : 1 critical , suspect in custody", "date": "2024-08-07 04:15", "url": "https://www.fox5ny.com/news/2-men-stabbed-queens-1-critical-suspect-custody", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Two men were stabbed in Queens on Tuesday, police said.\nThe first stabbing happened at Bolla Market on North Conduit Avenue in Ozone Park just after 5 p.m.A 25-year-old man is in stable condition after being stabbed in the back.\nThe second stabbing also happened on Conduit Avenue at the A subway station.\nA 67-year-old man was stabbed in the neck and is in critical condition.\nThe person of interest is in custody for that attack."}, {"id": "c252861a-16d7-438b-a700-6a4ecd925244", "title": "Hamas names new chief as ceasefire negotiations assume new urgency", "date": "2024-08-07 06:15", "url": "https://www.sbs.com.au/news/podcast-episode/hamas-names-new-chief-as-ceasefire-negotiations-assume-new-urgency/k5g59nnco", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "After his appointment in 2017, Mr Sinwar told Palestinians he would fight for their liberation.\nIn 2015, the U-S State Department designated Mr Sinwar a global terrorist, prohibiting its citizens from engaging in transactions with him.\nWe will act determinedly against the Iranian terror wherever it is.\"\nSecretary Blinken says Mr Sinwar remains an influential figure in the talks.\nMiddle East Council on Global Affairs expert Adel Abdel Ghafar says killing Hamas' chief negotiator was not conducive to peace."}, {"id": "5f416114-081b-4cd4-ba60-eb7f021ef93b", "title": "Pakistani man charged in connection with alleged plot to kill US politicians , officials say – NBC Bay Area", "date": "2024-08-07 00:30", "url": "https://www.nbcbayarea.com/news/national-international/pakistani-man-asif-merchant-charged-in-connection-with-plot-to-assassinate-us-politicians/3617083/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out political assassinations on U.S. soil, the Justice Department said Tuesday in disclosing what officials say is the latest murder-for-hire plot to target American public figures.\nAsif Merchant traveled to New York in April for the purpose of hiring hitmen, even paying a $5,000 advance to two would-be assassins who were actually undercover law enforcement officers.\nThat shooting, carried out by a 20-year-old Pennsylvania man, was unrelated to the Iran threat and the case also has no connection to the Trump assassination attempt.\nFederal officials identified Merchant as a Pakistani citizen who has said he has a wife and children in Iran.\nHe traveled frequently to Iran, Syria and Iraq, the Justice Department said."}, {"id": "8e2765c4-907f-47cf-9784-fabd6d255147", "title": "Lebanon , Hezbollah and the fear of war – DW – 08 / 07 / 2024", "date": "2024-08-07 09:45", "url": "https://www.dw.com/en/lebanon-hezbollah-and-the-fear-of-war/a-69871402", "domain": "dw.com", "domain_classification": "International", "message": "The vast majority of people in Lebanon don't want a war with Israel.\n\"The estimation is that the response will not lead to an all-out war,\" Reuters cited one of its sources.\nAs he pointed out, time and again, the Israeli army had also attacked Hezbollah targets in other parts of the country.\nFor example, some 1.5 million Syrians came to Lebanon to seek shelter from the war in their native country.\nIn addition, Iran-supported militants from the entire region could join Hezbollah, which would make the conflict even more complex and precarious."}, {"id": "4406ece6-2b87-441f-bd92-b2a5a5db2272", "title": "Hamas names Oct 7 mastermind Sinwar as leader after Haniyeh assassination", "date": "2024-08-07 00:30", "url": "https://japantoday.com/category/world/hamas-names-oct-7-mastermind-sinwar-as-leader-after-haniyeh-assassination1", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "FILE PHOTO: Hamas leader Yehya Al-Sinwar looks on as palestinians Hamas supporters take part in an anti-Israel rally over tension in Jerusalem's Al-Aqsa mosque, in Gaza City October 1, 2022.\n\"The Islamic Resistance Movement Hamas announces the selection of Commander Yahya Sinwar as the head of the political bureau of the movement, succeeding the martyr Commander Ismail Haniyeh, may Allah have mercy on him,\" the movement said in a brief statement.\nSinwar, who spent half his adult life in Israeli prisons, was the most powerful Hamas leader left alive following the assassination of Haniyeh, which has left the region on the brink of a wider regional conflict after Iran vowed harsh retaliation.\nIsrael has not claimed responsibility for the assassination but it has said it killed other senior leaders, including Hamas deputy leader Saleh al-Arouri, who was killed in Beirut, and Mohammed Deif, the movement's military commander.\nIsrael's chief military spokesman, Rear Admiral Daniel Hagari, blamed Sinwar for the Oct 7 attack and said Israel would continue to pursue him."}, {"id": "9a073c15-6b88-4fd9-85b8-d5d7133d2598", "title": "Pakistani man with Iran ties charged with plot to kill US politician", "date": "2024-08-07 03:45", "url": "https://www.yahoo.com/news/pakistani-man-iran-ties-charged-005516590.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(NewsNation) — A Pakistani man with ties to Iran has been arrested in connection with an alleged plot to assassinate a U.S. politician, the Justice Department announced Tuesday.\nLaw enforcement officers stopped the plan before it could take place, using undercover officers, according to charging documents.\nThe U.S. government since then has paid for security for multiple Trump administration officials, and in 2022, the Justice Department charged an Iranian operative in a foiled plot to kill Bolton.\nWhile describing the assassination plot, Merchant made a “finger gun” motion with his hand, indicating he meant murder, charging documents stated.\nIn mid-June, Merchant is said to have met with the purported hit men, who were actually law enforcement officers."}, {"id": "ae1cdcfe-4626-45bf-8249-a0b8111e5643", "title": "Revealed : US ignored Kenyan intelligence on embassy attack", "date": "2024-08-07 04:15", "url": "https://nation.africa/kenya/news/revealed-us-ignored-kenyan-intelligence-on-embassy-attack-4716828", "domain": "nation.africa", "domain_classification": "Local - Africa", "message": "The Kenyan boss of the Special Branch (predecessor of National Security Intelligence Service) followed up with a phone call.\n“We have learnt of the planned attack on the US Embassy in Nairobi and the Nyali Bridge,” read the intelligence brief.\nMr Muite revealed how he recorded the statement of the woman who had crucial intelligence on the attack.\nThis alongside other material collected by the intelligence service would form the basis of the cable to the Americans.\n“He told us that they (intelligence service) had picked the same information and shared it with the US Embassy,” Mr Muite recounted."}, {"id": "9208086a-d5ee-481e-bf14-b11929244833", "title": "Pakistani man charged in scheme to commit political assassinations in US", "date": "2024-08-07 00:00", "url": "https://www.abcactionnews.com/us-news/crime/pakistani-man-with-ties-to-iran-is-charged-in-plot-to-carry-out-political-assassinations-on-us-soil", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out political assassinations on U.S. soil, the Justice Department said Tuesday in disclosing what officials say is the latest murder-for-hire plot originating from abroad to target American public figures.\nRELATED STORY | Threat from Iran prompted increased security for Trump prior to Saturday attack, officials sayBut the newly unsealed criminal complaint suggests Merchant may have had high-level officials like Trump in mind.\n\"The Justice Department will spare no resource to disrupt and hold accountable those who would carry out Iran's lethal plotting against Americans,\" he said.\nFederal officials identified Merchant as a Pakistani citizen who has said he has a wife and children in Iran and who traveled frequently to Iran, Syria and Iraq, the Justice Department said.\nOfficials say Merchant paid a $5,000 advance for the planned killings."}, {"id": "280dfe08-5971-44db-add7-270aaa64623c", "title": "Hamas names Oct 7 mastermind Sinwar as political leader after Haniyeh assassination", "date": "2024-08-07 01:00", "url": "https://www.thestar.com.my/news/world/2024/08/07/hamas-names-oct-7-mastermind-sinwar-as-political-leader-after-haniyeh-assassination", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "CAIRO (Reuters): Hamas named its Gaza leader Yahya Sinwar as successor to former political chief Ismail Haniyeh, who was assassinated in Tehran last week, the group said on Tuesday (Aug 6), in a move that reinforces the radical path pursued since the Oct 7 attack on Israel.\nSinwar, the architect of the most devastating attack on Israel in decades, has been in hiding in Gaza, defying Israeli attempts to kill him since the start of the war.\n\"The Islamic Resistance Movement Hamas announces the selection of Commander Yahya Sinwar as the head of the political bureau of the movement, succeeding the martyr Commander Ismail Haniyeh, may Allah have mercy on him,\" the movement said in a brief statement.\nSinwar, who spent half his adult life in Israeli prisons, is the most powerful Hamas leader left alive following the assassination of Haniyeh, which has left the region on the brink of a wider regional conflict after Iran vowed harsh retaliation.\nIsrael's chief military spokesman, Rear Admiral Daniel Hagari, blamed Sinwar for the Oct 7 attack and said Israel would continue to pursue him."}, {"id": "73a7aed1-b340-403e-afe8-95a251e66f77", "title": "Pakistani man with ties to Iran is charged in plot to carry out political assassinations on US soil", "date": "2024-08-07 00:15", "url": "https://www.smdailyjournal.com/news/national/pakistani-man-with-ties-to-iran-is-charged-in-plot-to-carry-out-political-assassinations/article_180db8ee-5434-11ef-a9b7-77290c31474b.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "f03d6cdb-f5ad-400a-935f-e0dc3a4cce34", "title": "Hamas names Oct . 7 mastermind Sinwar as leader after Haniyeh assassination", "date": "2024-08-07 01:45", "url": "https://www.unionleader.com/news/military/hamas-names-oct-7-mastermind-sinwar-as-leader-after-haniyeh-assassination/article_182ea409-5c9e-5270-bdd7-6078b9cc5480.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "06230cef-8379-45ae-aefd-d2703ade823d", "title": "Inquests to begin into deaths of three girls killed in Southport stabbing", "date": "2024-08-07 08:00", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/inquests-begin-deaths-three-girls-29691062", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up for our daily newsletter to get the day's biggest stories sent direct to your inboxSomething went wrong, please try again later.\nSign up for our daily newsletter to get the day's biggest stories sent direct to your inboxThe inquests into the deaths of three little girls who were killed in a stabbing in Southport are set to be opened today.\nAlder Hey Children's Hospital revealed yesterday that all children in their care, who had been admitted with injuries linked to the Southport stabbing, had now been discharged."}, {"id": "be859055-8abd-4ac3-b572-dd1ac4739a56", "title": "Russia says forces repel Ukrainian armoured border raid", "date": "2024-08-07 02:15", "url": "https://www.canberratimes.com.au/story/8721439/russia-says-forces-repel-ukrainian-armoured-border-raid/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Even if Russia were to commit reserves to stabilise the new front, given its vast manpower and the relatively small number of Ukrainian forces engaged in the operation, it would likely have little long-term impact."}, {"id": "c3f2ae47-6e2c-4afc-98aa-d59144e4508f", "title": "Zelensky Taunts The West As Too  Concerned  About Escalation Of War", "date": "2024-08-07 10:45", "url": "https://www.zerohedge.com/geopolitical/zelensky-taunts-west-too-concerned-about-escalation-war", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Authored by Mac Slavo via SHTFPlan.com,Ukraine’s ruler, Volodymyr Zelensky, is continuing to taunt the West in an attempt to expand the ongoing conflict with Russia.\nZelensky claims that the West is too “concerned” about the escalation of a war with the former Soviet Union.\nUnfortunately, Russia’s restraint in the matter is the only thing keeping this conflict from being the catalyst to World War 3.\n-RTRussia has been targeting Ukrainian military assets as well as some key infrastructure sites, such as power stations, which it considers crucial for Kyiv’s war effort.\nAccording to Russian officials, the conflict is a U.S.-led proxy war in which Ukrainian troops serve as “cannon fodder” for Western geostrategic interests."}, {"id": "a5443c1a-eb61-4ed3-a420-04402342938c", "title": "Pakistani man charged in scheme to commit political assassinations in US", "date": "2024-08-07 00:15", "url": "https://www.ksby.com/us-news/crime/pakistani-man-with-ties-to-iran-is-charged-in-plot-to-carry-out-political-assassinations-on-us-soil", "domain": "ksby.com", "domain_classification": "Unknown", "message": "A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out political assassinations on U.S. soil, the Justice Department said Tuesday in disclosing what officials say is the latest murder-for-hire plot originating from abroad to target American public figures.\nRELATED STORY | Threat from Iran prompted increased security for Trump prior to Saturday attack, officials sayBut the newly unsealed criminal complaint suggests Merchant may have had high-level officials like Trump in mind.\n\"The Justice Department will spare no resource to disrupt and hold accountable those who would carry out Iran's lethal plotting against Americans,\" he said.\nFederal officials identified Merchant as a Pakistani citizen who has said he has a wife and children in Iran and who traveled frequently to Iran, Syria and Iraq, the Justice Department said.\nOfficials say Merchant paid a $5,000 advance for the planned killings."}, {"id": "16caaad8-2210-4657-a76f-40dbd1533db0", "title": "Hamas names Sinwar new chief as region braces for Iran retaliation against Israel", "date": "2024-08-07 08:00", "url": "https://www.bssnews.net/international/202834", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "Hamas names Sinwar new chief as region braces for Iran retaliation against IsraelJERUSALEM, Aug 7, 2024 (BSS/AFP) - Hamas on Tuesday named Yahya Sinwar, the man Israel says masterminded the October 7 attack that sparked the Gaza war, as its new political chief following last week's killing of his predecessor Ismail Haniyeh.\nA senior Hamas official told AFP that the selection of Sinwar sent a message that the militant group \"continues its path of resistance\".\nHezbollah congratulated Sinwar and said the appointment affirms \"the enemy... has failed to achieve its objectives\" by killing Hamas leaders and officials.\n- 'Playing with fire' -Hezbollah has traded near-daily cross-border fire with Israeli troops throughout the Gaza war.\nThe Hamas attack resulted in the deaths of 1,198 people, mostly civilians, according to an AFP tally based on Israeli official figures."}, {"id": "8ccfc6e2-3d0f-4b04-8346-07a7a3cacd1b", "title": "Questions linger after Ryan Houston violent spree ends in tragedy", "date": "2024-08-07 01:30", "url": "https://wlos.com/news/local/questions-linger-after-ryan-houstons-violent-spree-ends-tragedy-ryan-ricky-houston-magistrates-office-sheriffs-deputy-bond-pretrial-release-legal-system-attempted-murder", "domain": "wlos.com", "domain_classification": "Unknown", "message": "News 13 continues to follow Ryan Houston's path of chaos and violence that left two people – as well as Houston himself – dead.\nIt all goes back to May 2023, when Houston was charged with attempted murder for shooting a Buncombe County Sheriff's Deputy outside of the Buncombe County Magistrate's Office.\nMany viewers and even law enforcement have questioned why Ryan Ricky Houston was able to have the chance at posting bond and pretrial release.\nIn May 2023, Houston was charged with two counts of attempted murder for the shooting outside the magistrate's office.\nWilliams told listeners that the District Attorney's office had also advocated that Houston's bond be revoked and made attempts to have it modified."}, {"id": "6a437745-e847-4f35-8c24-124e09002814", "title": "At least 32 killed in Al - Shabaab attack on busy Mogadishu beach", "date": "2024-08-07 00:15", "url": "https://www.naharnet.com/stories/en/307034-at-least-32-killed-in-al-shabaab-attack-on-busy-mogadishu-beach", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "An Al-Shabaab suicide bomber and gunmen attacked a busy beach in the Somali capital Mogadishu, killing 32 people and wounding scores more, in one of the deadliest attacks in months, police said on Saturday.\nHe said security forces had ended the attack and killed five gunmen, while a sixth member of the group \"blew himself (up) at the beach\".\nAl-Shabaab has claimed responsibility for numerous bombings and attacks in Mogadishu and other parts of the country, whose government is pressing on with an offensive against the Islamist militants.\nFive people were killed in a powerful car bomb blast at a cafe in the capital last month.\nIn March, the militants killed three people and wounded 27 in an hours-long siege of another Mogadishu hotel, breaking a relative lull in the fighting."}, {"id": "bc3a639b-e352-4026-a76d-b0ea7accab04", "title": "Hamas names Oct 7 mastermind Sinwar as leader after Haniyeh assassination", "date": "2024-08-07 04:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/hamas-names-oct-7-mastermind-sinwar-leader-after-haniyeh-assassination-3671341", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Hamas leader Yehya Al-Sinwar looks on as palestinians Hamas supporters take part in an anti-Israel rally over tension in Jerusalem's Al-Aqsa mosque, in Gaza City October 1, 2022.\nSinwar, the architect of the most devastating attack on Israel in decades, has been in hiding in Gaza, defying Israeli attempts to kill him since the start of the war.\n\"The Islamic Resistance Movement Hamas announces the selection of Commander Yahya Sinwar as the head of the political bureau of the movement, succeeding the martyr Commander Ismail Haniyeh, may Allah have mercy on him,\" the movement said in a brief statement.\nSinwar, who spent half his adult life in Israeli prisons, was the most powerful Hamas leader left alive following the assassination of Haniyeh, which has left the region on the brink of a wider regional conflict after Iran vowed harsh retaliation.\nIsrael's chief military spokesman, Rear Admiral Daniel Hagari, blamed Sinwar for the Oct 7 attack and said Israel would continue to pursue him."}, {"id": "8e8f2604-c37b-4826-800c-332387c8ecf5", "title": "Hizballah Leader Says Iran  Obliged  To Respond To Haniyeh Killing", "date": "2024-08-07 12:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240806-rferl01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hizballah Leader Says Iran 'Obliged' To Respond To Haniyeh KillingBy RFE/RL August 06, 2024Sayyed Hassan Nasrallah, the leader of the Iran-backed Lebanon-based group Hizballah, which has been designated a terrorist organization by the United States, said Israel's recent actions will not go without a \"strong and effective\" response amid fears of a full-blown war in the region.\nHizballah said six of its fighters were killed in Israeli attacks on August 6, while it claimed to have launched missiles and drones at Israel, though no casualties were immediately reported.\nHizballah is also considered a key part of Iran's efforts to deter Israel or Washington from going to war against Tehran.\nHizballah has not usually shied away from claiming attacks on Israeli targets.\nAs the world waits to see how and when Iran carries out its promised response to Haniyeh's assassination, Hamas named its Gaza leader, Yahya Sinwar, as Haniyeh's successor."}, {"id": "18e4d724-fa33-4f82-add3-c3267e2e5849", "title": "Britons in Lebanon could be evacuated by more than 1 , 000 united kingdom troops on standby - as fears of Hezbollah - Israel war grow", "date": "2024-08-07 10:15", "url": "https://news.sky.com/story/britons-in-lebanon-could-be-evacuated-by-more-than-1000-uk-troops-on-standby-as-fears-of-hezbollah-israel-war-grow-13192398", "domain": "news.sky.com", "domain_classification": "International", "message": "More than 1,000 British military personnel are on standby to help evacuate UK nationals from Lebanon as fears grow that Israel's war in Gaza will escalate into a wider regional conflict, Sky News understands.\nHundreds more servicemen and women are on alert in the UK to deploy to the region at short notice.\nThe two nations last went to war in 2006 - a crisis that triggered a previous mass UK evacuation mission by sea.\nIran, Hamas and Hezbollah have vowed revenge.\nPreparations are under way to defend Israel's skies again but a two-pronged attack from Iran and Hezbollah could prove overwhelming."}, {"id": "139c6221-9f8b-430c-aab5-5310a63cf3e3", "title": "Inquests into three girls stabbed to death in Southport to open today", "date": "2024-08-07 06:45", "url": "https://www.express.co.uk/news/uk/1932992/Inquests-southport-girls-stabbing-death", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Southport attack: Teen charged with murders arrives at courtInquests are to be opened into the deaths of three girls who were fatally stabbed in Southport.\nTheir inquests will be formally opened at Bootle Town Hall in Merseyside.\nFamily, friends and members of the local community have since paid their respects to the victims of the attack.\nAlice's family said: \"Keep smiling and dancing like you love to do, our princess, like we said before to you, you're always our princess and no one would change that.\nShe read out another message from the family, which said: \"We love you Alice, Your smile is extremely contagious and full of joy."}, {"id": "c6cc0a47-d436-43d2-bf84-65f334a18033", "title": "Ukraine Elite Amphibious Forces Raid Russians on Tendra Spit", "date": "2024-08-07 14:30", "url": "https://www.kyivpost.com/post/37023", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The Artan Active Action Unit and the Ukraine’s Defense Intelligence ( HUR ) carried out an operation on the temporarily occupied Tendra Spit in the northern part of the Black Sea.\nDuring the operation, according to HUR, the Ukrainians destroyed Russian forces, their equipment, and fortifications.\nUkrainian special forces attempted a daring amphibious raid of Russian occupied territory at the mouth of the Dnipro River in the early hours of Tuesday, Aug. 6.\nAdvertisementDuring the battle, Russian occupation forces suffered personnel losses, but the exact number is being clarified.\n“Such actions are just part of the large-scale plan of Ukraine’s Security and Defense Forces, which is ongoing,” the intelligence agency added."}, {"id": "1d6fa657-b551-4bfc-9538-558774bdb33d", "title": "Rabbis inundated with questions from Israeli soldiers on Jewish laws of war", "date": "2024-08-07 01:45", "url": "https://religionnews.com/2024/08/06/rabbis-inundated-with-questions-from-israeli-soldiers-on-jewish-laws-of-war/", "domain": "religionnews.com", "domain_classification": "Unknown", "message": "An Israeli soldier prays next to an armored personnel carrier at a staging ground near the Israeli-Gaza border, southern Israel, Oct. 9, 2023.\nIn a moment of crisis, which body of law prevails — military regulations or halacha, the Hebrew word for Jewish law?\nIsraeli soldiers in Gaza often ask about ritual practice in the field.\nWhile the military does not track religious identities among Israeli soldiers, observers note a clear surge of religious Zionism in the army.\nThat is three times the representation of the national religious in Jewish Israeli society.”These religious soldiers are more likely to seek halachic advice on situations they encounter on the battlefield."}, {"id": "f8083f02-db8c-401a-bf9d-4dcc77f2516d", "title": "Osan and Kunsan Air Bases Join Forces To Create  Super Squadron  With 31 F - 16s", "date": "2024-08-07 00:00", "url": "https://theaviationist.com/2024/08/06/osan-f-16-super-squadron/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "The 36th Fighter Squadron will be part of a year-long test to optimize combat capability and training effectiveness with a larger number of F-16 aircraft assigned to the “Super Squadron”.\nOsan Air Base, which is also home of the Seventh Air Force’s headquarters, was selected for the test.\nThe F-16s were drafted from the 35th and 80th Fighter Squadrons at Kunsan Air Base.\nSome squadrons are already being enlarged, but the numbers are still below the 31 of the “Super Squadron” test.\nThe Department of Defense did not make any mention of the F-16s based at Kunsan and the F-16s and A-10s based at Osan."}, {"id": "916d14e5-e713-4b9d-a464-933c1add03de", "title": "Japanese Premier voices no reference of America on Hiroshima anniversary", "date": "2024-08-07 11:30", "url": "https://menafn.com/1108526831/Japanese-Premier-voices-no-reference-of-America-on-Hiroshima-anniversary", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) On the 79th anniversary of the Hiroshima atomic bombing, Japanese Prime Fumio Kishida delivered a poignant address at the Hiroshima Peace Memorial Park but notably omitted any reference to the United States, the only nation to have ever used nuclear weapons in warfare.\nOn August 6, 1945, an American B-29 bomber dropped an atomic bomb on Hiroshima, leading to the deaths of up to 126,000 people, most of whom were civilians.\nThree days later, another nuclear bomb was dropped on Nagasaki, resulting in approximately 80,000 additional deaths.\nThe omission of the United States from Kishida’s speech highlights Japan’s focus on advocating for nuclear disarmament while navigating the sensitive historical and diplomatic implications of World War II’s aftermath.\nThe speech marked a solemn remembrance of the victims and a call for continued international efforts towards nuclear non-proliferation."}, {"id": "84625060-839d-4863-aac5-fd62a1c7fe25", "title": "Ukrainian intelligence reveals details about their operation on Russian - occupied Tendra Spit – video", "date": "2024-08-07 09:30", "url": "https://www.yahoo.com/news/ukrainian-intelligence-reveals-details-operation-055615904.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: Defence Intelligence of Ukraine (DIU)Quote: \"At night, a Special Operations Forces landing group landed on the Tendra Spit and destroyed enemy armoured vehicles, including MT-LBs, an enemy electronic warfare system and Russian fortifications.\nDuring the battle, the Russian invaders suffered losses among their personnel, but the exact number is being determined.\"\nThey added that this was not their first successful assault operation on the Russian-occupied Tendra Spit.\n\"These actions are only a part of the large-scale plan of the Ukrainian defence forces, which is being implemented,\" they concluded.\nFor reference: The Tendra Spit is a narrow spit about 65 kilometres long and up to 1.8 kilometres wide, located in the northern part of the Black Sea, off the coast of Kherson Oblast."}, {"id": "2c6716bf-7e24-4a9a-91cf-c3f7b114898f", "title": "Nazi Megastructures - National Geographic Channel HD", "date": "2024-08-07 05:45", "url": "https://www.tvguide.co.uk/schedule/a9d80efd-8c80-5ce7-aff1-d5fa70a90060/nazi-megastructures", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Nazi MegastructuresNational Geographic Channel HD 11:00 AM to 12:00 PM Wednesday 7 August Share Add toCalendar +Lightning War Machine Season 3 Episode 2 of 6 S SubtitlesRuins across Europe that show evidence of Hitler's infamous Blitzkrieg tactics, which represented a revolutionary new approach to warfare and brought Germany a string of victoriesNazi Megastructures airs on National Geographic Channel HD at 11:00 AM, Wednesday 7 August .\n(Subtitles.)\nLearn more about Nazi Megastructures and other education/science/factual topics on our factual page"}, {"id": "c545d67c-d5e9-48c7-9887-ef96d43f96e4", "title": "Ukraine pierces Russian border triggering major battles", "date": "2024-08-07 11:30", "url": "https://www.swissinfo.ch/eng/ukraine-pierces-russian-border-triggering-major-battles/86284680", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine pierces Russian border triggering major battlesreuters_tickers4 minutesBy Guy Faulconbridge and Lidia KellyMOSCOW (Reuters) -Russia said on Wednesday that it was fighting intense battles against Ukrainian forces which had penetrated Russia’s Kursk region in one of the largest incursions into Russia since the Ukraine war began in February 2022.\nSudzha is the last operational trans-shipping point for Russian gas exports to Europe via Ukraine.\nJust 60 km away to the northeast is Russia’s Kursk nuclear power station.\nThe battles around Sudzha come at a crucial juncture in the war: Ukraine is losing territory and Kyiv is deeply concerned that U.S. support could drop off if Donald Trump wins the November election in the United States.\nForces describing themselves as voluntary paramilitaries fighting on Ukraine’s side penetrated parts of Belgorod and Kursk region this year, triggering a major push by Russian troops to carve out a buffer zone in Ukraine’s northeast."}, {"id": "206c92ab-d983-4f24-ab96-9a0f15076a65", "title": "Ukraine says it raided Russian - controlled spit in Black Sea", "date": "2024-08-07 11:30", "url": "https://www.swissinfo.ch/eng/ukraine-says-it-raided-russian-controlled-spit-in-black-sea/86311766", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine says it raided Russian-controlled spit in Black Sea1 minuteKYIV (Reuters) – Ukraine’s military intelligence agency confirmed on Wednesday that its forces had conducted a raid on the Russian-controlled Tendra Spit in the northwest of the Black Sea, saying they damaged equipment and fortifications and inflicted casualties.\nIt said they destroyed a Russian electronic warfare system and armoured vehicles and that they were assessing Russian personnel losses.\nOn Tuesday Russian-installed authorities said that Ukrainian saboteurs had attempted to land on the Russian-held spit from the sea.\nThe Tendra Spit lies off the coast of the southern part of Kherson region in waters seen as important for maintaining Ukraine’s access to the Black Sea.\nUkraine attacked the spit in February."}, {"id": "ab4179f1-78b8-4565-827b-a77d876499bb", "title": "BattleBots - ITV4 | TV Guide", "date": "2024-08-07 05:45", "url": "https://www.tvguide.co.uk/schedule/11caa498-162c-5ffc-b327-f9167b3ab153/battlebots", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "BattleBotsITV4 11:25 AM to 12:25 PM Wednesday 7 August Share Add toCalendar +The Giant Nut Season 5 Episode 36 of 40 S SubtitlesUS robot combat series where contestants control their armoured and technologically advanced automatons through a remote control and battle other robots to win the competition.\nThe final episode of the fifth series battle for the BattleBots World Championship features the four bots remaining in the tournament, but only one will hoist the Giant Nut and be declared as the new BattleBots World Champion.\nBattleBots airs on ITV4 at 11:25 AM, Wednesday 7 August .\n(Subtitles.)\nLearn more about BattleBots and other show/game show on our entertainment page"}, {"id": "53942cc2-94c1-4a5a-b572-22e785621c93", "title": "The U . S . Navy Has a Laser Weapons Problem It Cant Solve", "date": "2024-08-07 05:45", "url": "https://nationalinterest.org/blog/buzz/us-navy-has-laser-weapons-problem-it-cant-solve-212213", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The U.S. Navy's Laser Drama ShowFor almost 20 years, the U.S. Navy (as well as the Air Force) has worked on various concepts for directed energy weapons (DEW), or lasers.\nThe Flaws of Directed Energy Weapons (DEW)Pyle wants the Navy to concentrate on developing DEW for surface warfare purposes.\nWhat’s more, hypersonic weapons completely circumvent the ability of conventional missile defenses to protect the ship or territory they are charged with defending.\nThe Pentagon is supposedly prioritizing the creation of hypersonic weapons of their own, as well as defenses against them.\nWithout the DEW capability, Navy warships risk being destroyed, or at least forced to stay out of any fight with an A2/AD-wielding enemy."}, {"id": "3cc47317-2ac5-4ddd-a44c-eb5c72e74b65", "title": "Israel vs Iran : What a Full - Scale War Could Mean for the Middle East", "date": "2024-08-07 05:30", "url": "https://www.bloomberg.com/news/articles/2024-08-05/israel-versus-iran-what-all-out-war-could-look-like", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "208489ff-98f1-41f0-b7e8-bab425a5f5e8", "title": "South China Sea : US , Australia , Canada , Philippines stage naval and air force maneuvers in disputed South China Sea", "date": "2024-08-07 08:00", "url": "https://economictimes.indiatimes.com/news/defence/us-australia-canada-philippines-stage-naval-and-air-force-maneuvers-in-disputed-south-china-sea/articleshow/112339731.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelMANILA: The United States Australia , Canada and the Philippines held air and naval manoeuvres Wednesday in a show of force in the disputed South China Sea , where China has increasingly asserted its territorial claims.\nThey said they were staging the two-day exercises to uphold unhindered passage in the Indo-Pacific region.China has long claimed much of the South China Sea, a key global trade and security route, and vowed to defend its territorial interests at all costs.\n\"The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,\" the commanders said.\n\"A Philippine military official said the navy ships and fighter jets would conduct anti-submarine warfare drills, combined sea passage manoeuvres and communications checks.\n\"They did not mention China by name but said their nations affirm a 2016 arbitration ruling on the South China Sea disputes \"as a final and legally binding decision on the parties to the dispute.\""}, {"id": "430ab45b-d663-44bd-8239-f1d53db6cd88", "title": "World War Two from Above - U y", "date": "2024-08-07 04:15", "url": "https://www.tvguide.co.uk/schedule/c0d4cd8f-3116-57b9-a3c7-c62d98c98cbe/world-war-two-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War Two from AboveU&Yesterday 10:00 AM to 11:00 AM Wednesday 7 August Share Add toCalendar +Monte Cassino Season 1 S SubtitlesA team of battlefield experts set out to scan the site of the Battle of Monte Cassino, one of the longest and bloodiest campaigns of the Second World War IIWorld War Two from Above airs on U&Yesterday at 10:00 AM, Wednesday 7 August .\n(Subtitles.)"}, {"id": "9950b168-7730-4bb3-9772-0d134995c447", "title": "  House of the Dragon  Season 3 Book vs . TV Show Predictions", "date": "2024-08-07 00:45", "url": "https://www.cosmopolitan.com/entertainment/tv/a61796138/house-of-the-dragon-season-3-book-vs-tv-show/", "domain": "cosmopolitan.com", "domain_classification": "Unknown", "message": "Here's what I, an amateur fictional historian, think will happen on House of the Dragon season 3.\nBut the Dance of the Dragons civil war is only covered in a small section of Fire & Blood, the House Targaryen \"history book\" that House of the Dragon is based on.\nHouse of the Dragon season 1 started more than a decade before the war, and then ended right at the beginning of 129 AC.\nWhy not just end House of the Dragon there?\nIf House of the Dragon season 3 kills off one of the main three characters, my prediction is Daemon."}, {"id": "845a8028-5c61-41f5-8341-5b8264e07fff", "title": "U . S ., Australia , Canada and Philippines stage naval and air force manoeuvres in disputed South China Sea", "date": "2024-08-07 12:30", "url": "https://www.theglobeandmail.com/world/article-us-australia-canada-and-philippines-stage-naval-and-air-force/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "In an apparent response, China said it conducted air and sea combat patrols on the same day.\nChina has long claimed much of the South China Sea, a key global trade and security route, and vowed to defend its territorial interests at all costs.\n“The naval and air force units of participating nations will operate together, enhancing co-operation and interoperability between our armed forces,” the commanders said.\nThe official spoke on condition of anonymity ahead of the release of specific details of the manoeuvres.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "87c3e17b-f799-4f82-ac1b-3e3d2a74d9f0", "title": "US , Australia , Canada , Philippines stage naval and air force maneuvers in disputed South China Sea", "date": "2024-08-07 11:30", "url": "https://www.newsday.com/news/nation/us-australia-canada-philippines-china-sea-maneuvers-h70030", "domain": "newsday.com", "domain_classification": "Unknown", "message": "MANILA, Philippines — The United States, Australia, Canada and the Philippines held air and naval maneuvers Wednesday in what they said was a show of force to promote the rule of law in the disputed South China Sea, where China has increasingly asserted its territorial claims.\nChina has long claimed much of the South China Sea, a key global trade and security route, and vowed to defend its territorial interests at all costs.\n“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nThey did not mention China by name but said their nations affirm a 2016 arbitration ruling on the South China Sea disputes “as a final and legally binding decision on the parties to the dispute.” The ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "6b926dee-a1e3-4a65-b3f2-df8c1d46d64a", "title": "US , Australia , Canada , Philippines stage naval and air force maneuvers in disputed South China Sea", "date": "2024-08-07 14:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-08-07/navy-air-force-drills-south-china-sea-14775119.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Public Affairs Office Armed Forces of the Philippines via AP)MANILA, Philippines — The United States, Australia, Canada and the Philippines held air and naval maneuvers Wednesday in a show of force that they said aimed to promote the rule of law in the disputed South China Sea, where China has increasingly asserted its territorial claims.\nIn an apparent response, China said it conducted air and sea combat patrols on the same day.\nChina has long claimed much of the South China Sea, a key global trade and security route, and vowed to defend its territorial interests at all costs.\n“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "75ad4fa9-9e06-45c0-89b1-f11fe37f1ef2", "title": "Tim Walz Said He Wants To Ban Guns He  Carried in War . He Never Saw Combat . ", "date": "2024-08-07 06:45", "url": "https://freebeacon.com/elections/tim-walz-said-he-wants-to-ban-guns-he-carried-in-war-he-never-saw-combat/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "Walz, the governor of Minnesota, served 24 years in the Army National Guard but never saw combat, according to his own résumé.\nWalz responded mostly to natural disasters in Minnesota and Nebraska, he told Minnesota Public Radio.\nAccording to Minnesota Public Radio, Walz said he reenlisted in the National Guard following the 9/11 attacks, but did not see combat before his retirement in 2005.\nA Harris campaign spokesman posted a photo of Walz in uniform shortly after he was added to the ticket.\nWalz, who served in the Nebraska National Guard from 1981 to 1986 and the Minnesota National Guard from 1996 to 2005, has repeatedly claimed he reached the rank of Command Sergeant Major."}, {"id": "080f82d1-cc5a-4459-b1c4-a50c43e360c3", "title": "Hochul , education leaders work on media literacy toolkit for schools", "date": "2024-08-07 14:15", "url": "https://www.amny.com/news/hochul-education-leaders-media-literacy-toolkit/", "domain": "amny.com", "domain_classification": "Unknown", "message": "Sign up for our amNewYork email newsletter to get news, updates, and local insights delivered straight to your inbox!\nKathy Hochul is continuing her campaign against dangerous and inaccurate social media information that, she says, endangers children across New York.\nThe toolkit, which is still in the works and has not yet been released to schools, will help teachers battle what the state calls “mis/dis/mal-information” on the internet.\nHochul and State Homeland Security and Emergency Services Commissioner Jackie Bray joined Rosa and district superintendents from across the state to discuss the “priority” project with education leaders.\nThe governor cited the many benefits of social media but also referred to them as “breeding grounds” for hateful content."}, {"id": "390b8af4-0827-409a-8d48-92f108d3c08d", "title": "Cori Bush looks to avert defeat in Missouri primary : Live results", "date": "2024-08-07 01:30", "url": "https://www.yahoo.com/news/cori-bush-looks-avert-defeat-220000516.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Missouri Rep. Cori Bush is looking to avoid defeat as she faces off with three Democratic challengers in a head-to-head battle in Missouri’s 1st Congressional District Democratic primary on Tuesday.\nBush, a member of the “squad,” has been tangled in criticism this year as the congresswoman has been a vocal critic of the ongoing war between Israel and Hamas, angering members of the Jewish community in the state.\nFollow Decision Desk HQ’s live results here.\nThis material may not be published, broadcast, rewritten, or redistributed.\nFor the latest news, weather, sports, and streaming video, head to The Hill."}, {"id": "78cdc203-557e-4c24-a495-66274be5e628", "title": "US , Australia , Canada and Philippines stage military drills in South China Sea", "date": "2024-08-07 14:30", "url": "https://www.theargus.co.uk/news/national/24503425.us-australia-canada-philippines-stage-military-drills-south-china-sea/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nChina said it held joint sea and air combat patrols on Wednesday near Scarborough Shoal, a disputed territory in the South China Sea, in an apparent response to the exercises.\nA short statement from the Chinese military’s Southern Theatre Command indicated that it was aware of “military activities that disrupt the South China Sea” and that they were “under control”.\nThe ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "be951513-68ae-48c3-a0b6-2c890632d8ef", "title": "US , Australia , Canada and Philippines stage military drills in South China Sea", "date": "2024-08-07 13:00", "url": "https://www.echo-news.co.uk/news/national/24503425.us-australia-canada-philippines-stage-military-drills-south-china-sea/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nChina said it held joint sea and air combat patrols on Wednesday near Scarborough Shoal, a disputed territory in the South China Sea, in an apparent response to the exercises.\nA short statement from the Chinese military’s Southern Theatre Command indicated that it was aware of “military activities that disrupt the South China Sea” and that they were “under control”.\nThe ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "a14184e4-92c5-4bf5-9966-27be996f24de", "title": "US , Australia , Canada , Philippines stage naval and air force maneuvers in disputed South China Sea", "date": "2024-08-07 11:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219177/US,-Australia,-Canada,-Philippines-stage-naval-and-air-force-maneuvers-in-disputed-South-China-Sea", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "File PhotoThe United States, Australia, Canada and the Philippines held air and naval maneuvers Wednesday in what they said was a show of force to promote the rule of law in the disputed South China Sea, where China has increasingly asserted its territorial claims.\nChina has long claimed much of the South China Sea, a key global trade and security route, and vowed to defend its territorial interests at all costs.\n“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nThey did not mention China by name but said their nations affirm a 2016 arbitration ruling on the South China Sea disputes “as a final and legally binding decision on the parties to the dispute.” The ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "f7337654-ab5c-4733-98ea-352077a36449", "title": "A Russian governor urges people to give blood as hazy reports of a Ukrainian incursion emerge", "date": "2024-08-07 11:15", "url": "https://www.bostonglobe.com/2024/08/07/world/russian-governor-urges-people-give-blood-hazy-reports-ukrainian-incursion-emerge/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Alexei Smirnov, Kursk’s acting governor, said on Telegram that blood banks were stocking up because of the fighting.\nThe Russian Defense Ministry said Tuesday up to 300 Ukrainian troops, supported by 11 tanks and more than 20 armored combat vehicles, had crossed into Russia.\nThere was no independent evidence that Ukrainian troops were involved in the assault.\nSome Russian war bloggers who have proved knowledgeable about the war said that Ukrainian soldiers were in Kursk.\nAnother pro-Kremlin military blog, Two Majors, claimed that Ukrainian troops had advanced up to 15 kilometers (10 miles) into the region."}, {"id": "8c22c69f-3462-4d1f-b5c0-2b3666fc15cc", "title": "Jane Hansen : Former broadcast , print journalist passes away after battle with cancer", "date": "2024-08-07 05:30", "url": "https://www.9news.com.au/national/former-broadcast-print-journalist-passes-away-after-battle-with-cancer/020ba9a1-2699-4463-9e16-cc7e6c84ec53", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Jane Hansen, a﻿ former A Current Affair reporter, has died after an 18-month battle with an aggressive form of brain cancer.\nHansen also worked as a war correspondent and print journalist for News Corp.\"To all that knew and loved my sister.\nJane passed away peacefully at approximately 11.40pm 6 August,\" a family statement said.\nNine years later Hansen revealed she was a co-author of the fictional book.\nWhile the book was fiction, the author said it drew inspiration from real-life experiences ﻿that Hansen and co-author Fiona McKenzie had witnessed in the industry."}, {"id": "e62ff7cb-c5c1-4e5b-ada2-bce1732258c4", "title": "US , Australia , Canada and Philippines stage military drills in South China Sea", "date": "2024-08-07 13:45", "url": "https://www.bucksfreepress.co.uk/news/national/24503425.us-australia-canada-philippines-stage-military-drills-south-china-sea/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nChina said it held joint sea and air combat patrols on Wednesday near Scarborough Shoal, a disputed territory in the South China Sea, in an apparent response to the exercises.\nA short statement from the Chinese military’s Southern Theatre Command indicated that it was aware of “military activities that disrupt the South China Sea” and that they were “under control”.\nThe ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "84888ccc-3b8d-44d4-aa9a-b8961b6517a7", "title": "Democrats Kamala Harris , Tim Walz to campaign in crucial Michigan , Wisconsin", "date": "2024-08-07 11:30", "url": "https://www.moneycontrol.com/news/world/us-polls-democrats-kamala-harris-tim-walz-to-campaign-in-crucial-michigan-wisconsin-12789824.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:US Polls: Democrats Kamala Harris, Tim Walz to campaign in crucial Michigan, Wisconsin"}, {"id": "c7715198-2295-43e7-83b6-b71a05da902a", "title": "Democrats Harris , Walz to campaign in crucial Michigan , Wisconsin", "date": "2024-08-07 11:30", "url": "https://www.swissinfo.ch/eng/democrats-harris,-walz-to-campaign-in-crucial-michigan,-wisconsin/86312793", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Democrats Harris, Walz to campaign in crucial Michigan, Wisconsinreuters_tickers5 minutesBy Jeff Mason and Joseph Ax(Reuters) -Democratic presidential candidate Kamala Harris will campaign alongside her new running mate, Tim Walz, on Wednesday, holding events in battleground states Wisconsin and Michigan that will offer an early test of his Midwestern credentials.\nIn an interview on Fox News on Wednesday, Trump called Walz a “shocking pick” and sought to paint him as a radical progressive.\nThe Harris campaign said Trump was trying to back out of a debate that had already been set to run on ABC on Sept. 10.\nThe Harris campaign said it raised more than $20 million on Tuesday after announcing Walz as the vice presidential pick.\nTrump and Vance immediately cast Walz as too liberal, doubling down on criticism they have frequently leveled at Harris."}, {"id": "ce13928e-35c9-4927-9576-de9801e1bd5d", "title": "War - weary Gazans voice concern over  stubborn  new Hamas leader Sinwar", "date": "2024-08-07 14:30", "url": "https://gulfnews.com/world/mena/war-weary-gazans-voice-concern-over-stubborn-new-hamas-leader-sinwar-1.103768579", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "DEIR AL BALAH, Palestinian Territories: War-weary Gazans voiced concern on Wednesday after Hamas appointed Yahya Sinwar as its new supremo, fearing his past as the movement’s military commander might hamper efforts for the ceasefire they yearn for.\n“In my opinion, appointing Yahya Sinwar as the head of Hamas was inappropriate at this critical stage”, he told AFP.\nWhat will happen with the fighter Yahya Sinwar?” he asked.\nA senior Hamas official told AFP that the selection of Sinwar sent a message that the militant group “continues its path of resistance”.\nThese included the leftist Popular Front for the Liberation of Palestine, which “wished Sinwar success” in a statement published by Hamas."}, {"id": "d443941a-0235-4727-9eef-d489fac19509", "title": "Fate / EXTRA Record Platforms and Publisher Revealed", "date": "2024-08-07 02:00", "url": "https://rpgamer.com/2024/08/fate-extra-record-platforms-and-publisher-revealed/", "domain": "rpgamer.com", "domain_classification": "Unknown", "message": "Developer Type-Moon announced that it is partnering with Bandai Namco to release its upcoming RPG Fate/EXTRA Record, which is a remake of PlayStation Portable title Fate/EXTRA.\nThe company also revealed the game is being developed for PC (via Steam), PlayStation 4, PlayStation 5, and Nintendo Switch, with a 2025 release window in Japan.\nFate/EXTRA Record takes place in a virtual world called “SE.RA.PH.”, which is generated by supercomputers located on the moon.\nIt sees 128 of the world’s best hackers battle to obtain the Holy Grail, an artifact capable to grant its owner’s wishes.\nIn this deadly competition to death known as the Holy Grail War, the participants are aided by Servants, which are souls of legendary heroes or eminent figures from history."}, {"id": "a1d6fb1a-5a59-4425-80af-a62a64ac97f9", "title": "Ayushmann Khurrana drops out of  Border 2 : Reports", "date": "2024-08-07 08:00", "url": "https://www.thestatesman.com/entertainment/bollywood/ayushmann-khurrana-drops-out-of-border-2-reports-1503329099.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Sunny Deol has recently announced the highly anticipated sequel to his 1997 blockbuster, ‘Border’.\nInitially, it was rumored that Ayushmann Khurrana would star alongside Deol in the sequel.\nReports indicated that Khurrana was slated to play a soldier in this ensemble war drama.\nSources close to the actor revealed that Khurrana felt uncertain about his role and positioning within a film led by the formidable Sunny Deol.\nWith the departure of Ayushmann Khurrana and potential new additions, the sequel is already shaping up to be a significant event in Bollywood’s upcoming slate."}, {"id": "707291a4-2390-4175-a535-34546e788909", "title": "Harris campaign pushes back on claims that Pennsylvania Governor was rejected for VP because of Jewish faith", "date": "2024-08-07 01:30", "url": "https://www.independent.co.uk/news/world/americas/us-politics/harris-campaign-vp-josh-shapiro-jewish-b2592295.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Kamala Harris’ campaign has rejected the suggestion that Pennsylvania governor Josh Shapiro was overlooked as her running mate because of his Jewish faith.\nThe Jewish community is a serious vote in 2024 and the voices of antisemitism and hate should have no platform.”The Independent has contacted the Harris campaign for comment on the claims.\n\"Let me tell you about my friend Kamala Harris, someone I’ve been friends with for two decades.\n“And I told Josh, look, I am so so invested in our friendship, in doing this together, because together with Josh Shapiro, we will win Pennsylvania.\""}, {"id": "8665112f-bf25-4789-81ed-ad2e352ff8ef", "title": "Why are Brits roting ? Middle class liberals dont get it", "date": "2024-08-07 08:00", "url": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-are-brits-roting-middle-class-liberals-dont-get-it/", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "A female bystander was punched in the face in what eyewitnesses described as “guerrilla warfare”.\nOne account described a “seething group of angry and howling people with hatred etched across their faces” engaged in running battles with police.\nThe fighting only came to an end when several fascists were arrested by police.\nSimilar confrontations in the towns and streets of England took place then as are taking place now.\nRead full story on TOI+Facebook Twitter Linkedin Email Disclaimer Views expressed above are the author's own."}, {"id": "38389f67-738e-4415-98ae-958ce402d7f0", "title": "Happy Birthday Charlize Theron : Revisiting Her Top 10 Action Movies As Actress Turns 49", "date": "2024-08-07 06:15", "url": "https://www.pinkvilla.com/entertainment/hollywood/happy-birthday-charlize-theron-revisiting-her-top-10-action-movies-as-actress-turns-49-1336377", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "As Charlize Theron celebrates her 49th birthday, it’s a perfect time to reflect on her illustrious career, particularly her notable contributions to the action genre.\nThe staccato action, coupled with Theron’s commanding and charismatic performance, brought the actress critical acclaim and accolades and marked her as a leading action star.\nThe Huntsman: Winter’s War (2016)In this fantasy action film, Theron reprises her role as the Evil Queen Ravenna from Snow White and the Huntsman.\nHer performance is both charismatic and grounded, adding depth to the action scenes and making the film a unique entry in her action repertoire.\nCharlize Theron stars as Ella, a bystander who becomes inadvertently involved in the unfolding chaos."}, {"id": "3d570cc5-192c-4472-bde3-4183a7791e4b", "title": "Daisy Ridley shares she been diagnosed with Grave disease", "date": "2024-08-07 02:00", "url": "https://www.nbcnewyork.com/entertainment/entertainment-news/daisy-ridley-shares-shes-been-diagnosed-with-graves-disease/5678137/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "OnlineDaisy Ridley is speaking out about her private health battle.\nThe \"Star Wars\" actress recently detailed her journey with Graves’ disease, an immune system disorder that impacts the thyroid gland, after being formally diagnosed in September.\nThere is no cure for Graves’ disease, but certain treatments like adjusting diet and exercise and taking daily medications can help combat the symptoms.\n“Then I looked back and thought, How did I do that?”She also makes sure to maintain a regular exercise regimen.\nAmid frustrations over her variety of health issues, Ridley is focused on staying in tune with her body."}, {"id": "09be1cdf-00da-4976-9abc-5f4ae82124e9", "title": "Air Force 1st Multi - Country Air Exercise In Decades Underway In Tamil Nadu – Indian Defence Research Wing", "date": "2024-08-07 03:30", "url": "https://idrw.org/air-forces-1st-multi-country-air-exercise-in-decades-underway-in-tamil-nadu/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Air Force’s 1st Multi-Country Air Exercise In Decades Underway In Tamil Nadu| BySOURCE: PTITarang Shakti, the IAF organised multinational exercise that will see the participation of air force units including from Germany and France got underway on Tuesday and will see a number of advanced fighters and other aircraft taking to the skies as part of the various simulated scenario.\nThe main focus will be on what we call the large force engagements where large numbers of formations will be operating together,” the Air chief told reporters.\nThis would be the first such exercise being conducted by the IAF in about six decades.\nThe top official pointed out that over the years, the Indian Air Force has been having a lot of bilateral exercises with partners and friendly countries, including the Royal Air Force, the Air Forces of the US, France and Singapore.\nAccording to the IAF, EX Tarang Shakti 24 is the “first multinational exercise being hosted,” by it."}, {"id": "2aa8d2d6-3bf4-4751-9220-dedd01b8eb2a", "title": "Daisy Ridley shares she been diagnosed with Grave disease", "date": "2024-08-07 00:00", "url": "https://www.nbcwashington.com/entertainment/entertainment-news/daisy-ridley-shares-shes-been-diagnosed-with-graves-disease/3687278/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "OnlineDaisy Ridley is speaking out about her private health battle.\nThe \"Star Wars\" actress recently detailed her journey with Graves’ disease, an immune system disorder that impacts the thyroid gland, after being formally diagnosed in September.\nGraves’ disease, which has affected other stars including Wendy Williams, Missy Elliott and Jenny Mollen, involves overproduction of the thyroid hormone often leaving patients “tired but wired,” according to Ridley's doctor.\n“Then I looked back and thought, How did I do that?”She also makes sure to maintain a regular exercise regimen.\nAmid frustrations over her variety of health issues, Ridley is focused on staying in tune with her body."}, {"id": "b8a37712-3367-4bac-8e94-c51e58908cfe", "title": "Shoulder - Fired Weapons Market Size Is Set To Grow By USD 4 . 37 Billion From 2024 - 2028 , Demand For New Generation Anti - Armor And Anti - Aircraft Protectio ... ", "date": "2024-08-07 03:30", "url": "https://menafn.com/1108523722/Shoulder-Fired-Weapons-Market-Size-Is-Set-To-Grow-By-USD-437-Billion-From-2024-2028-Demand-For-New-Generation-Anti-Armor-And-Anti-Aircraft-Protection-To-Boost-The-Market-Growth-Technavio", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- PR Newswire) NEW YORK, Aug. 6, 2024 /PRNewswire/ -- The global shoulder-fired weapons size is estimated to grow by USD 4.37 billion from 2024-2028, according toTechnavio.\nMarketChallengesThe shoulder-fired weapons market faces significant challenges due to escalating research and development (R&D) costs.\nConsequently, the shoulder-fired weapons market may experience limited growth during the forecast period.\nFor more insights on driver and challenges-Download a Sample ReportSegment OverviewThis shoulder-fired weapons market report extensively covers market segmentation by1.1 Unguided 1.2 Guided2.1 Ammunition 2.2 Launcher3.1 North America3.2 APAC3.3 Europe3.4 Middle East and Africa 3.5 South America1.1 Unguided- Unguided shoulder-fired weapons are manual weapons that require human skills for aiming and shooting warheads.\nRegional cooperation between defense contractors, like ZM Dezamet and Nammo, is also driving advancements in the unguided shoulder-fired weapons market."}, {"id": "6aa12603-360a-4e12-b60a-505b8ba7cb09", "title": "Daisy Ridley shares she been diagnosed with Grave disease", "date": "2024-08-07 00:45", "url": "https://www.nbclosangeles.com/entertainment/entertainment-news/daisy-ridley-shares-shes-been-diagnosed-with-graves-disease/3481036/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "OnlineDaisy Ridley is speaking out about her private health battle.\nThe \"Star Wars\" actress recently detailed her journey with Graves’ disease, an immune system disorder that impacts the thyroid gland, after being formally diagnosed in September.\nGraves’ disease, which has affected other stars including Wendy Williams, Missy Elliott and Jenny Mollen, involves overproduction of the thyroid hormone often leaving patients “tired but wired,” according to Ridley's doctor.\n“Then I looked back and thought, How did I do that?”She also makes sure to maintain a regular exercise regimen.\nAmid frustrations over her variety of health issues, Ridley is focused on staying in tune with her body."}, {"id": "456af8b9-a4cf-4f38-ad0d-29d498d9b42c", "title": "Khaleda Zia vs Sheikh Hasina : How the  Battle of Begum shaped Bangladesh politics . Explainer", "date": "2024-08-07 06:00", "url": "https://www.livemint.com/news/world/bangladesh-latest-news-khaleda-zia-sheikh-hasina-battle-of-begums-dhaka-muhammad-yunus-bnp-attacks-on-hindus-muslims-11723005956747.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Since 1991, Sheikh Hasina, 76, and Khaleda Zia, 78, have been the central figures in Bangladeshi politics.\nSheikh Hasina led the Awami League, founded by her father, Mujibur Rahman, who was assassinated in 1975.\nBorn on August 15, 1945, Khaleda Zia now suffers from liver disease, diabetes, and heart problems, according to her doctors.\n“Battle of Begums” In 2004, a grenade attack targeted a rally addressed by Sheikh Hasina.\nAlthough the BNP boycotted the 2008 election and Khaleda Zia did not regain power, her bitter feud with Sheikh Hasina shaped Bangladeshi politics."}, {"id": "022ce76a-1de1-43ad-bb61-cfbae94d64f9", "title": "Daisy Ridley shares she been diagnosed with Grave disease", "date": "2024-08-07 01:00", "url": "https://www.nbcphiladelphia.com/entertainment/entertainment-news/daisy-ridley-shares-shes-been-diagnosed-with-graves-disease/3936386/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "OnlineDaisy Ridley is speaking out about her private health battle.\nThe \"Star Wars\" actress recently detailed her journey with Graves’ disease, an immune system disorder that impacts the thyroid gland, after being formally diagnosed in September.\nGraves’ disease, which has affected other stars including Wendy Williams, Missy Elliott and Jenny Mollen, involves overproduction of the thyroid hormone often leaving patients “tired but wired,” according to Ridley's doctor.\n“Then I looked back and thought, How did I do that?”She also makes sure to maintain a regular exercise regimen.\nAmid frustrations over her variety of health issues, Ridley is focused on staying in tune with her body."}, {"id": "45f7bb3f-1fda-4e85-b01b-0ce5d05bea83", "title": "Gallant Says Israeli Preparedness Building During Iran Attack Delay as Hamas Names Sinwar New Leader", "date": "2024-08-07 10:00", "url": "https://www2.cbn.com/news/israel/gallant-says-israeli-preparedness-building-during-iran-attack-delay-hamas-names-sinwar", "domain": "cbn.com", "domain_classification": "Unknown", "message": "Israeli Defense Minister Yoav Gallant told a group of Israeli pilots on Tuesday that Israel is ready.\nIn southern Lebanon, hundreds celebrated the selection of Yahya Sinwar as the next leader of Hamas.\nHe warned, \"There is only one place for Yahya Sinwar.\nThis is the only place we are planning for Yahya Sinwar.\"\nIt was the United States of America who told them to go easy on the Houthis.\""}, {"id": "607db2b4-37a4-4387-a838-9cf0c835eca1", "title": "Daisy Ridley shares she been diagnosed with Grave disease", "date": "2024-08-07 01:15", "url": "https://www.nbcmiami.com/entertainment/entertainment-news/daisy-ridley-shares-shes-been-diagnosed-with-graves-disease/3384975/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "OnlineDaisy Ridley is speaking out about her private health battle.\nThe \"Star Wars\" actress recently detailed her journey with Graves’ disease, an immune system disorder that impacts the thyroid gland, after being formally diagnosed in September.\nGraves’ disease, which has affected other stars including Wendy Williams, Missy Elliott and Jenny Mollen, involves overproduction of the thyroid hormone often leaving patients “tired but wired,” according to Ridley's doctor.\n“Then I looked back and thought, How did I do that?”She also makes sure to maintain a regular exercise regimen.\nAmid frustrations over her variety of health issues, Ridley is focused on staying in tune with her body."}, {"id": "be337000-76e1-4fec-bc5d-3bf731a6f489", "title": "Kamala Harris : Tim Walz , Who Dodged Iraq Duty , Is  Varsity ; JD Vance , Who Fought in Iraq , Is  JV Squad  ", "date": "2024-08-07 00:45", "url": "https://www.breitbart.com/politics/2024/08/06/kamala-harris-tries-compares-tim-walz-to-jd-vance-a-matchup-between-the-varsity-team-and-the-jv-squad/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Democrat Presidential candidate Kamala Harris made an odd sporting comparison between her running mate, Minnesota Gov.\nSome people noted on social media that the comparison fell flat, due to the fact that JD Vance actually served during the Iraq War while Walz did not.\nKAMALA: \"When you compare [Walz's] resume to Trump's running mate, well some might say it's like a matchup between the varsity team and the JV squad.\"\nPresident Barack Obama referred to ISIS as the “JV team” in dismissing concerns about his policy on Iraq.\n“I can’t wait to debate JD Vance."}, {"id": "f8c84671-abf3-46cb-8be6-90574193595d", "title": "Warhammer 40K : Space Marine 2 is a hulking shooter sequel that hasnt lost a gory step", "date": "2024-08-07 13:30", "url": "https://www.mirror.co.uk/gaming/warhammer-40k-space-marine-2-33378035", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Despite being a sequel to a 13-year-old cult classic, Warhammer 40K: Space Marine 2 so far seems to be an exceptional continuation that takes true advantage of modern hardware.\nThere were multiple times while playing my preview build of Warhammer 40K: Space Marine 2 where the gory sights I was playing witness to (and causing) left my jaw dropped.\nIf you thought there wasn’t a place in 2024 for a Gears of War-style shooter, Warhammer 40K: Space Marine 2 staunchly proves otherwise.\nWhether you’re an existing fan of Relic Entertainment’s original Warhammer 40K: Space Marine or not, there’s plenty of reasons to be excited for this sequel when it releases on PS5, Xbox Series X|S, and PC on September 9, 2024.\nKilling masses of bug-like aliens is never not fun, and Warhammer 40K: Space Marine 2 appears primed to remind players of this important fact, doing so with grit, style, and a thirst for slaughter."}, {"id": "3aa06e6f-1fad-4291-8f19-2acd397c5f4f", "title": "BIA RTH30 : Axis Player Mod 6 . 0 file - Brothers in Arms : Road to Hill 30", "date": "2024-08-07 04:30", "url": "https://www.moddb.com/games/brothers-in-arms-road-to-hill-30/downloads/bia-rth30-axis-player-mod-60", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Full new Axis Mod.\nThe Axis Mod changes original plot, changes voicelines, adds alternative history and now you play as Fallschirmjager Soldier in this story.\n-On June 1, 1938, Germany developed various weapons, vehicles, planes, winter uniforms, gliders, and other military equipment.\n-By September 10, 1938, Germany had taken control of half of France's territories.\n-In November 1938, Germany invaded Norway, which surrendered on November 9th but was soon liberated by Allied forces on November 20th."}, {"id": "80e4a28d-beb3-4a23-add2-87a4e308bedc", "title": "Ukrainian Scouts Destroy Enemy Equipment , Fortifications On Tendra Spit", "date": "2024-08-07 10:00", "url": "https://menafn.com/1108526474/Ukrainian-Scouts-Destroy-Enemy-Equipment-Fortifications-On-Tendra-Spit", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Special operations from the Artan active operations unit and the Maritime Center of the Ukrainian Defense Ministry's Main Intelligence Directorate destroyed the equipment, personnel and fortifications of the Russian invaders on the Tendra Spit in the northern part of the Black Sea on August 6.\n\"At night, an amphibious group landed on the Tendra Spit and destroyed the enemy's armored vehicles, including an MT-LB, the enemy's EW system, as well as the fortifications of the Russians,\" the statement reads.\nAccording to Ukrainian intelligence, having completed the assigned task, including the secret part of it, the military scouts retreated without losses.\n\"This is not the first successful active operation carried out by the special forces of the Ukrainian Security and Defense Forces on the Tendra Spit, temporarily captured by the Russians.\nThese actions are only part of a large-scale plan of the Security Ukrainian and Defense Forces, the implementation of which is ongoing,\" the report said."}, {"id": "85df4c7a-e0f6-4e1e-a7c7-c0c0da4a9335", "title": "Rajasthan Government Announces Kargil Package For Families Of Agniveer Martyrs", "date": "2024-08-07 13:00", "url": "https://www.freepressjournal.in/india/rajasthan-government-announces-kargil-package-for-families-of-agniveer-martyrs", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "Rajasthan CM Bhajan Lal Sharma |Jaipur: After announcing reservation in some government recruitments for Agniveers, now the Rajasthan government has decided to give Kargil package to the families of Agniveer martyrs.\nUnder the said package, the wife of martyr Agniveer will get Rs 25 lakh cash, 25 bigha canal land or medium income group house, government job, free education of children, while the parents will get Fixed Deposit of Rs 5 lakh and free travel facility in government buses.\nAlong with this, a school, hospital, panchayat building, any road, park and any other public place will be named after Martyr Agniveer and his family will get out of turn agriculture electricity connection.\nThe Kargil package was announced by the then Ashok Gehlot government in the year 2000 for the soldiers martyred in the Kargil war which was later on amended in 2019.\nNotably, Rajasthan CM Bhajan Lal Sharmahad announced reservation recently to the Agniveers in the recruitment of police, jail guards and forest guards in the state."}, {"id": "82ac9635-ba2b-4242-af6d-009f3061c1b6", "title": "LaPorte County Historical Society Museum to display Union Mills history pop - up exhibit", "date": "2024-08-07 01:45", "url": "https://www.nwitimes.com/life-entertainment/local/laporte-county-historical-society-museum-to-display-union-mills-history-pop-up-exhibit/article_0173ff3a-53bc-11ef-b73b-2be01e5bdd23.html", "domain": "nwitimes.com", "domain_classification": "Unknown", "message": "\"A new exhibit is on display at the Museum,\" LaPorte County Historical Society Museum Assistant Director Savannah Jackson said.\n\"Learn about Union Mills in the seventh of our 'Towns of La Porte County Pop-Up' exhibits.\nHighlights include items from the high school, famous locals and business memorabilia.\"\nThe LaPorte County Historical Society Museum showcases a number of exhibits, such as period rooms that show what daily life was like in different eras and a recreation of serial killer Belle Gunness's farm that's complete with a human skull of one of her victims.\nThe local history museum displays vintage cars such as a DeLorean of \"Back to the Future\" fame, an antique weapons collection, fossils and the mechanical Otto Giese miniature church that was crafted by a soldier during World War II who promised while praying that he’d make something special for the community if he survived the Battle of the Bulge, crafting a scale-model New England Gothic-style church with doll congregants that's often visited as a holiday ritual during the Christmas season."}, {"id": "77b940cd-cd19-41ea-81dc-6cf78643c0f2", "title": "UK Government to Elon Musk : Tone It Down", "date": "2024-08-07 10:00", "url": "https://www.newser.com/story/354035/uk-government-to-elon-musk-tone-it-down.html", "domain": "newser.com", "domain_classification": "Unknown", "message": "The British government has called on Elon Musk to act responsibly after the tech billionaire used his social media platform X to unleash a barrage of posts that officials say risk inflaming the violent unrest gripping the country, the AP reports.\nJustice Minister Heidi Alexander made the comments Tuesday morning after Musk posted a comment saying that \"Civil war is inevitable\" in the UK.\nMusk later doubled down, highlighting complaints that the British criminal justice system treats Muslims more leniently than far-right activists and comparing Britain's crackdown on social media users to the Soviet Union.\nThe unrest began after right-wing activists used social media to spread misinformation about a knife attack that killed three girls during a Taylor Swift-themed dance event on July 29.\nBut the government is also calling on social media companies, such as Musk's X, to do more to combat the spread of misleading and inflammatory information online."}, {"id": "636b7219-b7fb-4a95-b41f-6a1ddfa6cc9c", "title": "Korean Navy to receive MH - 60R Seahawk helicopters in December", "date": "2024-08-07 02:30", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/205_380112.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The Navy is set to receive its first batch of MH-60R Seahawk maritime helicopters in December, officials said Wednesday, a move that could boost its anti-submarine capabilities against North Korean threats.\nIn 2020, the state arms procurement agency approved a 960 billion-won ($698 million) project to purchase 12 Seahawks from U.S. defense firm Lockheed Martin Corp. in efforts to strengthen the Navy's detection and attack capabilities against enemy vessels and submarines.\nThe 19.7-meter-long and 5.1-meter-high chopper with a maximum cruising speed of 270 kilometers per hour can handle multiple missions, including operations of warfare, search, rescue, and medical evacuation.\nOnce deployed, the Seahawks are set to operate alongside P-8A Poseidon maritime surveillance aircraft the Navy received in July.\nDubbed the \"submarine killer,\" the P-8A is capable of conducting an array of missions, including anti-submarine, anti-surface, intelligence, surveillance and reconnaissance operations."}, {"id": "16dafc7d-41db-4f65-b79b-123e1624b7d1", "title": "All Quiet on the Watchdog Front – For Now - Traders Magazine", "date": "2024-08-07 07:15", "url": "https://www.tradersmagazine.com/am/all-quiet-on-the-watchdog-front-for-now/", "domain": "tradersmagazine.com", "domain_classification": "Unknown", "message": "The more dramatic regulatory compliance professionals among us might argue the opposite more accurately describes their role – that staying abreast of new and evolving regulations is most of the time nightmarish, seldom easy.\nBut when it comes to enforcement actions over off-channel record-keeping failures, it has been eerily quiet on the watchdog front of late.\nOptimistic compliance professionals may interpret this as evidence market authorities are easing their oversight of this particular market threat.\nIt is widely accepted across the industry that market regulators tend to issue and settle more enforcement actions in the second half of the year.\nThis is also the case when it comes to financial institutions’ ongoing battle with regulators over messaging record-keeping and reporting violations."}, {"id": "12b892fa-7aa5-48d1-8e54-b91054b13bd1", "title": "UK hits out at Elon Musk combative X posts , @ Two Tier Keir hashtag ; says  act responsibly …. no way acceptable  ", "date": "2024-08-07 04:15", "url": "https://www.livemint.com/news/world/great-britain-uk-government-hits-out-at-tesla-boss-elon-musk-says-no-way-acceptable-tesla-share-keir-starmer-11722993573484.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "The Keir Starmer-led British government on Tuesday called on Elon Musk to act responsibly after the Tesla CEO used his social media platform X to unleash a barrage of posts about the protests that have been plaguing UK.\n“Civil war is inevitable,” Elon Musk had posted on X.\nThe Justice Minister further noted that everyone handling a social media platform should act responsibly.\nBritain's government has been calling upon social media companies, such as Musk’s X, to help combat the spread of misleading information online.\n“But there is undoubtedly more that the social media companies could and should be doing,” added Alexander."}, {"id": "d0f1f209-5744-42db-888a-322473ad965d", "title": "Namesake of Pensacola law firm dies at 104 years old", "date": "2024-08-07 05:00", "url": "https://www.yahoo.com/news/namesake-pensacola-law-firm-dies-023009056.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Namesake of Pensacola law firm dies at 104 years oldPENSACOLA, Fla. (WKRG) — A man who a personal injury attorney law firm is partially named after has died at the age of 104.\nPatrick Emmanuel, Sr. of Emmanuel Sheppard & Condon died after a life serving his community and country.\nAfter graduating with a bachelor’s degree in business administration, he continued his studies at the University of Florida College of Law.\nat the University of Florida College of Law in 1946.\nOnce he graduated he returned to Pensacola and joined Holsberry and Holsberry and was eventually made partner, which changed the law firm to Holsberry, Holsberry and Emmanuel."}, {"id": "f8153c0c-fcc8-4c4c-a779-4a7060156a9f", "title": "Olympic Wrestler Faints After Failed Frenzied Weight - Loss Attempt", "date": "2024-08-07 14:15", "url": "https://www.yahoo.com/news/olympic-wrestler-faints-failed-frenzied-135346930.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Indian wrestler who had been hoping to become her country’s first ever female Olympic champion was disqualified only hours before the gold medal bout because she was “a few grams” over the weight limit.\nNews of Vinesh Phogat’s elimination from the 50kg wrestling competition at the Paris Olympics shocked Indian sports fans.\nHer disqualification was announced in a statement from the Indian Olympic Association, which said the 29-year-old had weighed in “a few grams” over 50kg despite “the best efforts by the team through the night.\"\nBut that can be a problem in competitions like the Olympics, where they have to fight on successive days.\nVinesh herself was reportedly taken for treatment in the Olympic village hospital after fainting after the weigh-in."}, {"id": "ba3a0d40-366e-4ef5-ab51-f1d13da335bc", "title": "U . S . Confirms Pending SIGINT Upgrade For P - 8A | Aviation Week Network", "date": "2024-08-07 08:30", "url": "https://aviationweek.com/defense-space/sensors-electronic-warfare/us-confirms-pending-sigint-upgrade-p-8a", "domain": "aviationweek.com", "domain_classification": "Unknown", "message": "A newly published U.S. government document confirms that the Boeing P-8A Poseidon will be upgraded to perform signals intelligence (SIGINT) missions.\nThe Navy developed the MISD payloads to equip the family of aircraft selected to replace the Lockheed EP-3E ARIES II maritime SIGINT fleet.\nThe Navy, meanwhile, quietly prepared the P-8A fleet to form part of the EP-3E’s successor.\nThe 2016 Naval Aviation Vision outlined plans to replace the ARIES II with a mix of MQ-4Cs, P-8As and Northrop MQ-8C Fire Scouts.\nThe latter will be retired by the end of this year, leaving only the MQ-4Cs and P-8As in service."}, {"id": "8c1eabaf-f4b6-48ee-9f60-25a112eed6c6", "title": "Hezbollah congratulates Sinwar as new Hamas political chief", "date": "2024-08-07 09:45", "url": "https://www.naharnet.com/stories/en/307119-hezbollah-congratulates-sinwar-as-new-hamas-political-chief", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hamas ally Hezbollah on Tuesday congratulated Yahya Sinwar on his selection as the Palestinian militant group's new political chief following the killing last week of his predecessor Ismail Haniyeh.\nSinwar's appointment affirms that \"the enemy... has failed to achieve its objectives\" by killing Hamas leaders and officials, a Hezbollah statement said.\nHezbollah has traded near-daily cross-border fire with Israel since Hamas's October 7 attack on Israel that triggered war in the Gaza Strip.\nHezbollah is the most prominent member of the \"axis of resistance\" of Iran-backed regional armed groups opposed to Israel and the United States.\nHis death has sent tensions skyrocketing, with fears of a regional war and the Middle East bracing for Iran's retaliation."}, {"id": "92a7dce4-2878-4753-800d-fdccf6f9d5f9", "title": "Tunisia Presidential Race Marred By Arrests and Claims of Intimidation", "date": "2024-08-07 05:45", "url": "https://allafrica.com/stories/202408070054.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Prominent rival Abir Moussi, 49, head of the Free Destourian Party, was sentenced to two years in prison late Monday.\nThe former parliament member is a vocal critic of Saied, who has been in power since 2019.\nSix other potential candidates have also been sentenced to prison, and several have been banned from running for life.\nThese politicians are part of a group of over 20 of Saied's opponents detained since a series of arrests in February 2023.\nLast week, four women working on the presidential campaign of rapper-turned-businessman Karim Gharbi (known as K2Rhym) were jailed for allegedly buying endorsement signatures."}, {"id": "38a4d6df-eb76-47e7-b140-49fb613f5c76", "title": "The Queen Woo trailer : Jeon Jong Seo prepares for remarriage after Ji Chang Wook death to save herself and clan", "date": "2024-08-07 08:00", "url": "https://www.pinkvilla.com/entertainment/the-queen-woo-trailer-jeon-jong-seo-prepares-for-remarriage-after-ji-chang-wooks-death-to-save-herself-and-clan-1336458", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "The Queen Woo, starring Jeon Jong Seo, Ji Chang Wook, Kim Mu Yeol, and more, is a much-anticipated historical political drama that is all set to premiere this August.\nOn August 7, TVING dropped the main trailer for their upcoming historical drama, The Queen Woo.\nThe Queen Woo Part 1 is scheduled to premiere on August 29.\nThe main cast includes Jeon Jong Seo, Ji Chang Wook, Kim Mu Yeol, Jung Yoo Mi, Lee Soo Hyuk, and Park Ji Hwan.\nLee Byeong Hak wrote the screenplay for The Queen Woo."}, {"id": "db914b44-4250-45a5-8ffe-4cc5d685e704", "title": "2 Mindoro rebels convicted of illegal possession of firearms", "date": "2024-08-07 12:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240806-pna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "2 Mindoro rebels convicted of illegal possession of firearmsPhilippine News AgencyBy Benjamin PultaAugust 6, 2024, 12:38 pmMANILA -- The Department of Justice Task Force on Counter-Terrorism I (DOJ-TFCT 1) on Tuesday announced a court ruling convicting two members of the Communist Party of Philippines-New People's Army (CPP-NPA) operating in Oriental Mindoro for illegal possession of firearms.\nIn a new release, the DOJ-TFCT 1 said the Roxas, Mindoro Oriental Regional Trial Court Branch 43, in a decision promulgated on July 9, found Arnulfo Aumentado (a.k.a.\nLouise) guilty beyond reasonable doubt of unauthorized issuance of authority to carry firearm and ammunition outside of residence and illegal transfer/registration of firearms.\nOn April 26, 2023, Philippine Army soldiers apprehended Aumentado and Lizada in Barangay Santa Teresita, Mansalay, Oriental Mindoro.\nRecovered from them were one carbine rifle, a chamber-loaded Intratec submachine gun, one improvised hand grenade and two blasting caps."}, {"id": "ed341a03-26fe-4ce7-bcab-e1584243d3b5", "title": "Sea of Diplomacy : Joint Naval Exercises of Argentina and U . K . ", "date": "2024-08-07 11:30", "url": "https://www.riotimesonline.com/sea-of-diplomacy-joint-naval-exercises-of-argentina-and-u-k-amid-falklands-dispute/", "domain": "riotimesonline.com", "domain_classification": "Unknown", "message": "In September 2024, the Chilean-hosted Unitas naval exercise will gather forces from 24 nations.\nThe joint participation of these vessels in a multinational exercise amid the Falklands-Malvinas sovereignty conflict highlights a complex mix of diplomacy and military readiness.\nGeopolitical Significance of Recent Naval ExercisesFor Argentina, it underscores a legislative move requiring approval for the Sarandí’s deployment.\nUnitas Chile 2024 thus serves as more than just a routine naval exercise.\nThrough these shared exercises, Argentina and the UK navigate the delicate balance between cooperation and competition."}, {"id": "ea4867ef-f3f7-4832-987d-db576b1b3a99", "title": "World Health Organization Considers Declaring International Monkeypox Emergency", "date": "2024-08-07 01:30", "url": "https://www.breitbart.com/africa/2024/08/06/world-health-organization-considers-declaring-international-monkeypox-emergency/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Director-General Tedros Adhanom Ghebreyesus said on Sunday that he might declare an international health emergency due to the outbreak of monkeypox in the Democratic Republic of the Congo (DRC) and neighboring African countries.\nDRC researchers warned in June that a new, faster-spreading, and more dangerous strain of monkeypox was spreading in the war-torn eastern half of the country.\nThe new strain, known as Clade-1b, was originally detected among sex workers near the Rwandan border in September.\n“I am considering convening an International Health Regulations emergency committee to advise me on whether the outbreak of mpox should be declared a public health emergency of international concern [PHEIC],” he added.\nMore cases were reported in Burundi, Kenya, and Uganda in July, suggesting international spread, although the number of infections reported in other countries is small so far."}, {"id": "6dd028b9-6e3c-4deb-bd96-fcaf9c70e0e1", "title": "U . S . Sanctions Have Devastated Venezuela . How Does That Help Democracy ? ", "date": "2024-08-07 00:30", "url": "https://theintercept.com/2024/08/02/venezuela-election-maduro-us-sanctions-democracy/", "domain": "theintercept.com", "domain_classification": "Unknown", "message": "President Nicolás Maduro appears determined to survive the latest election in Venezuela.\nClaiming fraudulent results, the opposition declared its own victory, bringing Venezuela to the brink of a political crisis.\nIn light of Maduro’s declared victory and the chaotic aftermath of the contested election, however, the case that U.S. policy worked in Venezuela is on shaky ground.\nVenezuela’s opposition leaders, in contrast, are well aware that the economic sanctions benefit them electorally, as long as they don’t give any sound bites endorsing collective punishment of their own citizens by the U.S.\nPolicymakers may feel the urge to intensify sanctions on Venezuela in the coming weeks as Maduro digs in, hoping it will spur the change they seek."}, {"id": "4763f698-5aac-454b-8c9d-2155eacc0ead", "title": "BITS Pilani Unveils Centre for Research Excellence in National Security at Hyderabad Campus", "date": "2024-08-07 13:45", "url": "https://www.siliconindia.com/news/general/bits-pilani-unveils-centre-for-research-excellence-in-national-security-at-hyderabad-campus-nid-231165-cid-1.html", "domain": "siliconindia.com", "domain_classification": "Unknown", "message": "The Birla Institute of Technology and Science (BITS) Pilani Hyderabad has inaugurated a new Centre for Research Excellence in National Security (CRENS).\nThis new centre is set to enhance India’s security capabilities through the development of indigenous technologies, focusing on joint research, skill development, and entrepreneurship.\nThe initiative is expected to contribute significantly to India’s strategic and economic growth, ensuring a more secure and prosperous nation.\nProf. V. Ramgopal Rao, Vice Chancellor of BITS Pilani, expressed pride in the new centre, stating, “National security research and innovation require significant emphasis.\nThe launch of CRENS marks a significant step towards bolstering India's national security capabilities through advanced research and innovation."}, {"id": "777a2649-eac9-4459-981a-c15e021096d4", "title": "Encounter Underway Between Security Forces , Terrorists In J Udhampur – Indian Defence Research Wing", "date": "2024-08-07 03:30", "url": "https://idrw.org/encounter-underway-between-security-forces-terrorists-in-jks-udhampur/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Encounter Underway Between Security Forces, Terrorists In J&Ks Udhampur| BySOURCE: IANSAn encounter is underway between the security forces and a group of terrorists in J&K’s Udhampur district on Tuesday, officials said.\nOfficials said that an encounter between the security forces and the terrorists began in the Basantgarh area of Udhampur.\nThe terrorists hiding in the dense forests of these districts have carried out hit-and-run attacks against the army, paramilitary forces, and civilians.\nThe entire anti-terrorism strategy was revisited at the high-level security meetings chaired by Prime Minister Narendra Modi and Home Minister Amit Shah.\nThe security forces are aggressively carrying out operations in these districts to target the terrorists, their over ground workers (OGWs), sympathisers, and harbourers."}, {"id": "31f9080e-153e-4c8d-aa6a-38f48f6323b2", "title": "  My son was tortured and didnt get help : Manalapan Navy SEAL death hearing to start", "date": "2024-08-07 10:15", "url": "https://www.yahoo.com/news/son-tortured-didn-t-help-090941341.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "'My son was tortured and didn’t get help': Manalapan Navy SEAL death hearing to startRegina Mullen’s two-and-a-half year quest for justice after her son’s death as a Navy SEAL trainee is taking a key step forward — even as the emotional toll over the tragedy continues to mount.\nRegina Mullen looks over to a photo of her son Kyle in her Manalapan home Friday, April 22, 2022.\nThe investigation is still ongoing into how Kyle died during Navy SEAL training in February.\nAfter the investigation, three officers who oversee SEAL training were offered non-judicial punishments — essentially a reputational hit — by the Navy.\nThis article originally appeared on Asbury Park Press: Officers in Kyle Mullen Navy SEAL death will soon learn their fates"}, {"id": "9618b8ca-e3f6-4943-beba-7b9081629fd5", "title": "Daisy Ridley opens up about Grave disease battle", "date": "2024-08-07 08:00", "url": "https://www.thestatesman.com/entertainment/hollywood/daisy-ridley-opens-up-about-graves-disease-battle-1503329102.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Daisy Ridley, best known for her role in the ‘Star Wars’ saga, has recently shared her personal health struggle with the public.\nIn a candid interview with Women’s Health, as reported by Variety, Ridley revealed that she has Graves’ disease.\nGraves’ disease is an autoimmune disorder that leads to an overactive thyroid, resulting in an excess production of thyroid hormones.\nHer approach to managing Graves’ disease reflects a combination of traditional medical advice and alternative therapies aimed at improving her overall well-being.\nThis news follows a similar revelation from television host Wendy Williams, who disclosed her own battle with Graves’ disease in 2018."}, {"id": "30eec5a5-cfef-4b58-9fac-5d7059e8b946", "title": "US , Australia , Canada and Philippines stage military drills in South China Sea", "date": "2024-08-07 13:00", "url": "https://www.yourlocalguardian.co.uk/news/national/24503425.us-australia-canada-philippines-stage-military-drills-south-china-sea/", "domain": "yourlocalguardian.co.uk", "domain_classification": "Unknown", "message": "“The naval and air force units of participating nations will operate together, enhancing cooperation and interoperability between our armed forces,” the commanders said.\nChina said it held joint sea and air combat patrols on Wednesday near Scarborough Shoal, a disputed territory in the South China Sea, in an apparent response to the exercises.\nA short statement from the Chinese military’s Southern Theatre Command indicated that it was aware of “military activities that disrupt the South China Sea” and that they were “under control”.\nThe ruling invalidated China’s expansive claims in the South China Sea, but Beijing refused to participate in the Philippines-initiated arbitration, rejected the decision and continues to defy it.\nAfter an alarmingly violent June 17 confrontation at Philippine-occupied Second Thomas Shoal in the South China Sea, China and the Philippines reached a temporary agreement last month aimed at preventing further clashes."}, {"id": "0ebe4958-e12e-4087-8a98-8dc98b1861a7", "title": "Putin accuses Ukraine of a  large - scale provocation  in southwestern Russia", "date": "2024-08-07 13:45", "url": "https://isp.netscape.com/news/world/story/0001/20240807/e838343b88b2dd9827f5a40fbc5a1db7", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Putin accuses Ukraine of a ‘large-scale provocation’ with its raid in southwestern RussiaKYIV, Ukraine (AP) — Russian President Vladimir Putin on Wednesday described a Ukrainian incursion into the country's southwestern Kursk region as a “large-scale provocation” as his officials asserted that they were fighting off cross-border raids for a second day.\nIf confirmed, the cross-border foray would be among Ukraine's largest since Russia's full-scale invasion in February 2022, and unprecedented for its deployment of Ukrainian military units.\nBut it could risk stretching outmanned Ukrainian troops further along the front line, which is more than 1,000 kilometers (620 miles) long.\nThe think tank also cast doubt on video shared by Russian military bloggers claiming to show the aftermath of the Ukrainian raids.\nSome Russian war bloggers who have proved knowledgeable about the war said that Ukrainian soldiers were in Kursk."}, {"id": "e41f662d-cd56-4c81-a784-15d2b9fe3dda", "title": "China launches air , sea patrols near flashpoint reef as US holds joint drills", "date": "2024-08-07 11:45", "url": "https://www.philstar.com/headlines/2024/08/07/2376170/china-launches-air-sea-patrols-near-flashpoint-reef-us-holds-joint-drills", "domain": "philstar.com", "domain_classification": "Unknown", "message": "The Philippines, United States, Australia and Canada launched on August 6 two days of joint South China Sea naval and air exercises, a joint statement said, as Beijing presses its territorial claim over the strategic waters.\nBEIJING, China — China carried out a combat patrol to test \"strike capabilities\" near a flashpoint reef in the South China Sea on Wednesday, as the United States and its allies held joint military drills in the same waters.\nBeijing claims almost the entire South China Sea, brushing off rival claims of several Southeast Asian countries, including the Philippines, and an international ruling that its assertion has no legal basis.\nIts claims include the waters around Scarborough Shoal -- which Beijing seized from Manila in 2012 -- where the Chinese military's Southern Theater Command said Wednesday it had held joint sea and air patrols.\nChina has long used its coastguard to assert its claims in the South China Sea, which analysts describe as \"grey zone\" harassment tactics that fall short of an outright act of war."}, {"id": "c37738f9-d47c-45a1-bd33-d514bc8e6961", "title": "Borderlands : What You Need to Know About Pandora", "date": "2024-08-07 02:00", "url": "https://www.comingsoon.net/movies/features/1815968-borderlands-what-you-need-to-know-about-pandora", "domain": "comingsoon.net", "domain_classification": "Unknown", "message": "Eli Roth’s Borderlands movie brings the world of Pandora to the big screen, ComingSoon examines what to expect from the planet’s varied environments, factions, and the art of vault hunting.\nAnyone who has spent time in the video game version of Pandora will know just how deadly and surprising it can be.\nBorderlands’ Pandora will be one of the movie’s biggest starsPandora is a largely arid planet with many desert Badlands filled with beastly creatures.\nWith the search for Vault keys as crucial as finding vault locations, Vault Hunter’s search will take them all over the planet.\nSo be prepared for a wild world in Eli Roth’s Borderlands when it hits theaters on August 9, 2024."}, {"id": "1ee44d89-36a8-4698-a4bc-ff7c962a9cf0", "title": "Putin accuses Ukraine of  large - scale provocation  in south - western Russia", "date": "2024-08-07 14:30", "url": "https://www.lbc.co.uk/world-news/800b26c76ce54a239957497c54b562a8/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin has described a Ukrainian incursion into the country’s south-western Kursk region as a “large-scale provocation” as his officials asserted that they were fighting off cross-border raids for a second day.\nUkrainian officials remained quiet about the scope of the operation.\nHe instructed the cabinet to coordinate assistance to the Kursk region.\nBut it could risk stretching outmanned Ukrainian troops further along the front line, which is more than 620 miles long.\nRussian forces have swiftly repelled previous cross-border incursions, but not before they caused damage and embarrassed authorities."}, {"id": "893b35b6-52c7-42ae-a87c-5a248fa97178", "title": "Ukrainian FPV drone hit Russian Mi - 28 helicopter in  historic  feat , source says", "date": "2024-08-07 11:30", "url": "https://www.yahoo.com/news/ukrainian-fpv-drone-hit-russian-104117706.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Ukrainian first-person-view (FPV) drone hit a Russian Mi-28 attack helicopter over Russia's Kursk Oblast on Aug. 6, a source in intelligence services told the Kyiv Independent on Aug. 7.\nFootage of the FPV drone ramming into the helicopter began circulating social media on Aug. 6.\nRussian military blogger Alexei Zemtsov, who runs the channel Voevoda Veshchaet, wrote on the evening of Aug. 6 that a Russian helicopter was hit and was forced to land.\nThe Kyiv Independent could not verify all the claims, which had not been officially acknowledged by the SBU or the Ukrainian military.\nForbes wrote at the time that, according to Russian military bloggers, a Ukrainian drone successfully destroyed Russia's Mi-8 transport helicopter in the sky near occupied Donetsk."}, {"id": "bce3eaa7-cf6f-49a7-8b35-6f1f2478856e", "title": "2 Assam rifles battalions moved out of Manipur ignoring tribal protests | Imphal News", "date": "2024-08-07 04:00", "url": "https://timesofindia.indiatimes.com/city/imphal/2-assam-rifles-battalions-moved-out-of-manipur-ignoring-tribals-protests/articleshow/112328118.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Photo: AgenciesGUWAHATI: Amid protests by Manipur ’s Kukis against the withdrawal of two “non-partisan” Assam Rifles (AR) battalions from two sensitive security buffer zones in the strife-torn state, Army has recommended placing the incoming CRPF battalions under the command and control of AR’s sector headquarters.Kuki MLAs have been part of the protests to retain the AR troops.The community fears the move to withdraw a “non-partisan force like Assam Rifles” could lead to a resurgence of violence.Army has directed relocation of the two AR battalions from Manipur to Nagaland , where they will relieve two other battalions.\nThese relieved battalions will be redeployed in J&K.\nAssam Rifles, despite being a paramilitary force, has a dual control structure, with the Army overseeing operational control and home ministry handling administrative supervision.Currently, the two Assam Rifles battalions are deployed in Manipur’s Kangvai along the Churachandpur-Bishnupur border, and Kangchup on the Kangpokpi-Imphal (East) inter-district borders.The incoming CRPF battalions, comprising over 2,000 personnel, are being transferred from J&K and Telangana and are expected to assume their new positions this month, a security source said.\nThe AR battalions are expected to hand over their areas of responsibility within one week of the CRPF battalions’ arrival, the source added.“It has been recommended that the command and control of the two CRPF battalions, relieving the AR battalions, is vested with the respective AR sector headquarters of IG (E) and IG (S), to ensure cohesion in operations in these sensitive areas,” the source said.\nBesides, the two CRPF battalions will undergo three months of on-the-job training “in view of the prevailing security situation in the state”.Additionally, like other infantry battalions inducted into Manipur, they will undergo four weeks of pre-induction training at the Counter-Insurgency and Jungle Warfare School in Vairengte, Mizoram, suggesting their involvement in counter-insurgency operations in the state."}, {"id": "9566ae72-b0f2-48be-b749-cee1556cb70f", "title": "Ukrainian Customs Update Automated Systems at 8 Border Checkpoints", "date": "2024-08-07 14:30", "url": "https://www.kyivpost.com/post/37021", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukraine’s State Customs Service has installed a new, centralized and automated system for registering car and cargo traffic at eight border checkpoints, starting Aug. 1, to replace the existing “Inspector” system.\nThe new system could reduce border waiting time by integrating State Border Service and the International Road Transport Union (IRU) procedures with other domestic and international protocols.\n“It is important that the system is integrated both with traditional partner services (State Border Service, IRU, eCherha, etc.)\nand with new ones implemented by the State Customs Service in the context of European integration, for example, the European SEED+,” the Aug. 2 Customs Service’s press release read.\nThe State Customs Service thanked its IT department and foreign sponsors who helped the agency to implement the new computerized infrastructure for the customs clearance process."}, {"id": "6cfdeb36-ab24-4322-9511-dddbdb6919f1", "title": "Ys X : Nordics Preview - Preview", "date": "2024-08-07 14:15", "url": "http://www.nintendoworldreport.com/preview/68061/ys-x-nordics-preview", "domain": "nintendoworldreport.com", "domain_classification": "Unknown", "message": "At the end of July, I attended a digital preview event for the next entry in the long-running Ys series, Ys X: Nordics, hosted by NIS America.\nCompared to the large island space of Ys VIII and the urban areas of Ys IX, Ys X involves island hopping and filling out sea maps as you build up the crew of your ship.\nAs August begins, we’re but a few months away from the October 25th release date for Ys X: Nordics on Switch.\nQuestions remain about the game’s performance on Nintendo’s aging platform after the numerous issues that plagued Ys IX: Monstrum Nox, but I’m optimistic that having even more experience developing for the system will yield positive results.\nBe you landlubber or pirate, if you’re in the mood for more Ys action, you don’t have much longer to wait."}, {"id": "385b1fe7-f505-462a-b4d4-e194305ed230", "title": "Counterpoint : Why Supreme Court reform is needed", "date": "2024-08-07 03:15", "url": "https://www.startribune.com/counterpoint-why-supreme-court-reform-is-needed/600913932", "domain": "startribune.com", "domain_classification": "Unknown", "message": "One proposal is fixed terms — say 18 years, with one seat opening every two years, and each president appointing two justices per presidential term.\nEach vacancy would be predictable, and the appointments would be distributed in proportion to elections.\nEven though the proposal would end lifetime tenure on the court itself, it would neither require a constitutional amendment nor undermine the separation of powers if a justice rotating off the court continued to hold a lifetime appointment elsewhere in the federal judiciary, as retiring judges often do when taking “senior status.” Each justice would hold supreme judicial power for only(!)\n18 years, but the judiciary itself would cede no power to another branch.\nThis approach has already worked with some lower-level courts, such as the Foreign Intelligence Surveillance Court, which consists of sitting federal judges who serve for seven years then retain their original judgeships."}, {"id": "c4efd659-28de-4d61-8a79-fbc26f03ea83", "title": "World War 3 Decisive Battle", "date": "2024-08-07 00:30", "url": "https://biztoc.com/x/d746201019d389ee", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "World War 3's Decisive BattleAuthored by Nick Giambruno via InternationalMan.com,As I’ve discussed recently, I believe proxy wars will determine who wins WW3 and gets to shape the new world order.\nThere are numerous ongoing proxy wars in World War 3.\nHowever, the ones I believe will…This story appeared on zerohedge.com , 2024-08-06."}, {"id": "19a8cdea-1f51-4745-9056-18f208f56648", "title": "Türkiye starts works for integrated air defense system  Steel Dome  ", "date": "2024-08-07 11:45", "url": "https://www.hurriyetdailynews.com/turkiye-starts-works-for-integrated-air-defense-system-steel-dome-199267", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Türkiye starts works for integrated air defense system 'Steel Dome'ANKARATürkiye has decided to launch works to develop an integrated multilayered air defense system called the Steel Dome.\n“Assessments were made of the level achieved by Türkiye’s defense industry, future goals and critical projects,” the country’s Communications Directorate said on X.\n“The commitment to supporting the domestic and national defense industry was underlined,” it added.\nTürkiye has developed a number of indigenous air defense systems in recent years and is planning to combine all these systems under the Steel Dome, which will provide the protection of Türkiye’s entire air space.\nHighlighting satisfaction with the progress in Türkiye’s defense industry, the meeting underlined the need to continue with increased determination using domestic technologies."}, {"id": "048469a3-bfac-4c8e-a7de-50f992b6f309", "title": "Former MLB Player Billy Bean Dead At 60 After Battle With Leukemia", "date": "2024-08-07 00:15", "url": "https://www.tmz.com/2024/08/06/former-mlb-player-billy-bean-passes-away-after-battle-with-leukemia/", "domain": "tmz.com", "domain_classification": "Unknown", "message": "Former MLB player Billy Bean has died at the age of 60 ... Major League Baseball announced Tuesday.\nBean -- who served as the league's senior VP for Diversity, Equity, and Inclusion and Special Assistant to the Commissioner -- passed away after a year-long battle with Acute Myeloid Leukemia.\nBean -- one of the first openly gay players in MLB -- was first diagnosed with the disease in September 2023 ... but only went public with the news during the MLB Winter Meetings in December.\nMLB commissioner Rob Manfred released a statement on Bean's passing ... calling him \"one of the kindest and most respected individuals I have ever known.\"\n\"Billy was a friend to countless people across our game, and he made a difference through his constant dedication to others,\" Manfred said."}, {"id": "e5cf4a0a-784e-4ad3-8826-34ba56c05d70", "title": "Red Sox Dominic Smith Reflects On Clutch Base - Running Play", "date": "2024-08-07 09:15", "url": "https://nesn.com/2024/08/red-soxs-dominic-smith-reflects-on-clutch-base-running-play-vs-royals/", "domain": "nesn.com", "domain_classification": "Unknown", "message": "The Boston Red Sox knew what was at stake entering their three-game series with the Kansas City Royals, and so did 29-year-old Dominic Smith.\nInitially, Smith was called out at the plate but upon further review, the call was changed, giving the Red Sox a much-needed 4-3 lead over the Royals.\nThe Red Sox and Royals are in the midst of a tug-of-war battle for the third and final wild card spot in the American League.\nBoston gained ground with its second straight victory in Kansas City, now sitting just a 1/2 game behind the Royals.\nHe thought he was out,\" Red Sox manager Alex Cora recalled, as seen on NESN's postgame coverage."}, {"id": "f15bb9a8-e8bb-4fc7-a36c-900571962791", "title": "SafePlace , Simple Life competing in Coffee King Battle of the Brews", "date": "2024-08-07 00:30", "url": "https://www.yahoo.com/news/safeplace-simple-life-competing-coffee-220652588.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SIOUX CITY, Iowa (KCAU) — SafePlace and Simple Life are competing in Coffee King’s latest Battle of the Brews fundraiser!\nKCAU 9 News got a chance to speak with Sheri Porter from Simple Life and Stephanie Pickenpaugh from SafePlace to find out the flavor in this year’s Battle of the Brews.\nGoodwill donating over $13,000 to American Red Cross flood relief effortsSafePlace selected the Sumatra Dark as their single origin and Captian Crunch as their flavor and Simple Life selected Tanzania Peaberry for their simple origin and the Cinnamon Sugar Pop-tart for their flavor.\nThey can be ordered on the SafePlace website, by calling 712-277-0131, or in person at Coffee King.\nFor the latest news, weather, sports, and streaming video, head to SiouxlandProud | Sioux City, IA | News, Weather, and Sports."}, {"id": "c4d0ff43-9641-4819-af65-7c59b92962f9", "title": "Hezbollah pledges to respond alone or with allies to Israeli killing of commander", "date": "2024-08-07 05:30", "url": "https://dunyanews.tv/en/World/829132-hezbollah-pledges-to-respond-alone-or-with-allies-to-israeli-killing-o", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah pledges to respond alone or with allies to Israeli killing of commanderWorld World Hezbollah pledges to respond alone or with allies to Israeli killing of commanderSayyed Hassan Nasrallah said Hezbollah would wait for the right moment to respond.\nSayyed Hassan Nasrallah said Hezbollah would wait for the right moment to respond but did not hint at its form or timing.\nThe Israeli military said a number of hostile drones were identified crossing from Lebanon and one was intercepted.\nThe Israeli military said an initial investigation indicated the injuries were caused by an interceptor that \"missed the target and hit the ground, injuring several civilians\".\n\"Iran will respond and Hezbollah will respond and the enemy waits... Making the enemy wait is part of the punishment,\" he said."}, {"id": "d18df900-d5e8-455f-8395-1508e33bf6bc", "title": "Health Matters Newsletter : Post landslide , watching out for outbreaks", "date": "2024-08-07 06:15", "url": "https://www.thehindu.com/sci-tech/health/health-matters-newsletter-post-landslide-watching-out-for-outbreaks/article68491858.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "(In the weekly Health Matters newsletter, Ramya Kannan writes about getting to good health, and staying there.\nUnbridled infectious diseases, including cholera, diarrhoea, and other water-born illnesses may assault a community that is already sinking under the weight of a terrible tragedy.\nSince mental health assessment and support is also important in the wake of such mass tragedies, the government also despatched a 121-member mental health team to provide psycho-social support to survivors .\nFrom the threat of infectious diseases to handling infectious diseases in the community.\nSince mental health occupies an important aspect of wellness, and has been of concern with the ongoing debate about professional examinations, this article by Suhas Palshikar, Vibha Attri and Devesh Kumar assumes significance: Mental health matters: the psychological pressures of UPSC preparation ."}, {"id": "0a9ccc1f-ca8c-47ba-ada7-dc4e48a37e39", "title": "Thousands of students return to Metro Nashville Public Schools", "date": "2024-08-07 00:45", "url": "https://www.wsmv.com/2024/08/06/thousands-students-return-metro-nashville-public-schools/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WSMV) - More than 80,000 students returned to Metro Nashville Public Schools for the first day of school on Tuesday.\nAmong the biggest points of emphasis for the district are security and academic success.\n“We have been waiting for today,” MNPS Director of Schools Dr. Adrienne Battle said.\n“It’s critically important, particularly, in today’s times where there’s just a heightened sense around security measures around our schools,” Battle said.\n“We’re positioned as a district to know our students, identify their talents, meet them where they are so they’re prepared and ready to excel,” Battle said."}, {"id": "e0cd2f6d-8e01-4526-8cd9-8aa52b230b0f", "title": "Andrea Daolio", "date": "2024-08-07 00:00", "url": "https://theaviationist.com/author/andreadaolio/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Video footage emerged online shows a Russian pilot filming himself after ejecting from his stricken combat jet, visible in the distance spiraling out of control and in flames.\nA video recently emerged online, taken by […]Andrea Daolio is an aviation expert from Italy.\nHe has a mechanical engineering background and, alongside his great interest for aviation, also has a longstanding passion for wargaming and for geopolitics, international relationsHope, history, space, military technology and military history.\nStay connected FacebookTwitteryoutubeinstagramlinkedinCategories Categories Select Category Aviation Aviation Safety NH90 crash Drones Captured Stealth Drone Helicopters Information Security Hacking Information Warfare Military Aviation Aircraft Carriers Airshows F-104 F-35 Italian Air Force ItAF Museum Mil Ops Maritime Security Operation Odyssey Dawn Operation Unified Protector Osama Bin Laden raid Pillars of Defense Special Operations Patches Stealth Black Hawk Tales From The Cockpit Military History 9-11 Airspace violations Falklands War Libyan Uprising Turkish RF-4E shot down Space Troubled Areas Afghanistan Africa China Gaza Iran Iraq Kashmir Kenya Libya Mali Nagorno-Karabakh North Africa North Korea Operation Martyr Yalcin Russia Saudi Arabia Syria Taiwan Terrorism Turkey vs Greece Venezuela War in Ukraine War on ISIS Yemen Various Bizarre Books WeaponsArchives Archives Select Month August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 April 2010 March 2010 February 2010 January 2010 December 2009 November 2009 October 2009 September 2009 August 2009 July 2009 June 2009 May 2009 April 2009 March 2009 February 2009 January 2009 December 2008 November 2008 October 2008 September 2008 August 2008 July 2008 June 2008 May 2008 April 2008 March 2008 February 2008 January 2008 December 2007 November 2007 October 2007 September 2007 August 2007 July 2007 June 2007 April 2007 March 2007 February 2007 January 2007 December 2006 November 2006 October 2006 September 2006 May 2006 March 2006 November 2005"}, {"id": "ba11e6d6-40e1-4a86-a9cd-338c13213f7d", "title": "Assam Rifles : Army shifts AR units from Manipur amidst protests |", "date": "2024-08-07 01:45", "url": "https://timesofindia.indiatimes.com/city/guwahati/army-shifts-ar-units-from-manipur-amidst-protests/articleshow/112330638.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently2 Assam Rifles battalions moved out of Manipur ignoring tribals protestsIn Manipur, protests erupted as the Army planned to withdraw two Assam Rifles battalions from security buffer zones.\nResidents and Kuki MLAs voiced concerns over the decision, fearing renewed violence.\nThe CRPF battalions replacing the AR forces will undergo extensive training and may be placed under AR sector headquarters for cohesive operations.\nAuthorities halted new Amarnath Yatra departures as a precaution while security forces remained on high alert, following recent terrorist attacks in the Jammu region.\nBangladesh army carries out major reshuffle in top command amid unrestBangladesh's army underwent a significant reshuffle with top positions changed following Prime Minister Sheikh Hasina's departure due to protests over a controversial job quota."}, {"id": "df53a454-6e54-412b-b67e-297abdd759fc", "title": "Caleb McLaughlin lip synch LL cool j  Im Bad  on lip synch battle", "date": "2024-08-07 04:00", "url": "https://boxden.com/showthread.php?t=3375514", "domain": "boxden.com", "domain_classification": "Unknown", "message": "Kendrick really popped out, destroyed drake like he was light work and then went back 82 replies @hiphop"}, {"id": "4b84f93b-1e5c-422a-b08b-47f85e04b547", "title": "Sappers Thrill in Explosive Training", "date": "2024-08-07 06:00", "url": "https://www.miragenews.com/sappers-thrill-in-explosive-training-1291358/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "Department of DefenceSappers have been put through their paces on Exercise Bardia, the culminating activity for trainees at the School of Military Engineering at Holsworthy.\nLieutenant Stephen Smith, 2 Troop Commander and a course leader for the initial employment training continuum at the School of Military Engineering, said his troop tested all the skills they had learned over the past month at initial employment training on the combat engineer course.\nA group of trainees from Sydney University Regiment, which delivers initial employment training for part-time general service officers, also took part in the exercise.\n\"It's good to see people with very little training be confident soldiers by the time the course finishes,\" Corporal Warnock said.\nBattle lab lessons incorporated in Exercise Bardia provided greater engagement from trainees and the most relevant skills for their future postings."}, {"id": "45789a6b-a9cb-4e2a-ad0c-c7448d1b0d32", "title": " [ Catholic Caucus ] Transvestites in  Consecrated Life  - With Franci Approval", "date": "2024-08-07 00:00", "url": "https://freerepublic.com/focus/f-religion/4256764/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "[Catholic Caucus] Transvestites in \"Consecrated Life\" - With Francis' ApprovalGloria TV ^ | August 6, 2024 | Gloria TVPosted on by ebb tide[Catholic Caucus] Transvestites in \"Consecrated Life\" - With Francis' ApprovalThe August 2-4 \"Outreach\" conference at Jesuit Georgetown University, U.S., supported by both Francis and Washington Cardinal Wilton Gregory, pushed for transvestites in \"consecrated life\".\nThis year, for the first time since Outreach - a homosex propaganda event - began in 2022, a cardinal presided over a Eucharist.\nAndrea Conocchia, a homosexual activist and priest who keeps bringing transvestite prostitutes to Francis.\nMatson was particularly pleased that a panel entitled \"Transgender Catholics and the Church\" argued for the \"inclusion\" of transvestites in consecrated life.\nDisclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management."}, {"id": "beefe624-9e0d-4e21-bb60-bdeb1a4e313b", "title": "Beijing , Manila and allies , launch drills near South China Sea flashpoint", "date": "2024-08-07 11:30", "url": "https://article.wn.com/view/2024/08/07/Beijing_Manila_and_allies_launch_drills_near_South_China_Sea/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "China’s military has launched military drills near a territory in the South China Sea over which it contests sovereignty with the Philippines.\nThe Southern Theatre Command said on Wednesday that it had carried out air and sea combat patrols “near Huangyan Island” – the Chinese name for the Scarborough Shoal – to test... read full story\"All military activities that disrupt the South China Sea, create hotspots, and undermine regional peace and stability are all being controlled to the best extent,\""}, {"id": "bc2ec07c-2f17-4084-9891-65896e49a37f", "title": "The Challenge : Cara Maria Sorbello talks about  complicated relationship  heading into Season 40", "date": "2024-08-07 05:00", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-cara-maria-sorbello-talks-about-complicated-relationship-heading-into-season-40/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "In MTV’s 40th season of The Challenge, called Battle of the Eras, viewers will see Cara Maria Sorbello return in search of a third championship.\nCara refers to her ‘complicated relationship’ with her castmate in Season 40A promotional video for The Challenge: Battle of the Eras Launch Special footage features Cara Maria, Laurel, and others commenting on their relationships heading into the show.\n“I think the most complicated relationship that I’m entering into right now is my one with Laurel,” Cara says in a confessional interview.\n'” Cara asks in her Season 40 Launch Special confessional clip.\nDuring a confessional, he mentioned his relationship with Cara and her relationship with Laurel."}, {"id": "03fd6a15-764c-4433-a254-472b41b17dfc", "title": "  I feel ecstatic : Harris and VP pick Tim Walz fire up Philadelphia rally - goers | US elections 2024", "date": "2024-08-07 00:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/06/philadelphia-rally-kamala-harris-tim-walz-reaction", "domain": "theguardian.com", "domain_classification": "International", "message": "Last week, he campaigned for Harris by knocking on doors and handing out flyers in the nearby King of Prussia area.\nStill, they reaffirmed their vow to support Harris and to ensure that Trump isn’t elected again.\nIf Harris is elected president, Green said she hopes that teachers will get paid more and that reproductive rights will be protected.\nView image in fullscreen The packed crowd cheered on Harris and Walz at their first campaign rally together.\nCherelle Parker, Philadelphia’s mayor, also spoke in support of Harris at Tuesday’s rally."}, {"id": "2ee449cc-5a6f-494c-9f68-ac7c8fc6bb34", "title": "What Happened to Billy Bean ? Former MLB Player Passes Away", "date": "2024-08-07 12:00", "url": "https://www.yahoo.com/news/happened-billy-bean-former-mlb-104657141.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "William Daro Bean, famously known as Billy Bean, was a former American professional baseball player.\nBilly Bean passes away at 60, claims reportBilly Bean died at the age of 60 after a year-long battle with Acute Myeloid Leukemia.\nOver the last 10 years,… pic.twitter.com/dCfFM6hQlE — MLB (@MLB) August 6, 2024Bean was diagnosed with acute myeloid leukemia a year ago, in 2023.\nAdditionally, it is important not to misunderstand Billy Bean for the Billy Beane from the movie Moneyball.\nFormer MLB Player Passes Away appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More."}, {"id": "3ad03439-af99-4bfe-af1e-bf537315d1fc", "title": "China launches air , sea patrols near flashpoint Scarborough Shoal", "date": "2024-08-07 11:15", "url": "https://www.voanews.com/a/china-launches-air-sea-patrols-near-flashpoint-scarborough-shoal/7733012.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "China carried out a combat patrol to test \"strike capabilities\" near a flashpoint reef in the South China Sea on Wednesday, as the United States and its allies held joint military drills in the same waters.\nBeijing claims almost the entire South China Sea, brushing off rival claims of several Southeast Asian countries, including the Philippines, and an international ruling that its assertion has no legal basis.\nThe announcement came as the Philippines on Wednesday launched two days of sea and air exercises with the United States, Canada and Australia.\nChina has long used its coastguard to assert its claims in the South China Sea, which analysts describe as \"grey zone\" harassment tactics that fall short of an outright act of war.\nLast month, the United States said it would provide $500 million in additional military funding to the Philippines, which has been modernizing its armed forces."}, {"id": "bef46763-0c29-4a21-8db0-4693b8568727", "title": "China launches air , sea patrols near flashpoint Scarborough Shoal", "date": "2024-08-07 07:15", "url": "https://www.yahoo.com/news/china-launches-air-sea-patrols-063749595.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Chinese navy ship sails near Scarborough Shoal, in disputed waters of the South China Sea in Febuary 2024 (Ted ALJIBE)China carried out a combat patrol to test \"strike capabilities\" near a flashpoint reef in the South China Sea on Wednesday, as the United States and its allies held joint military drills in the same waters.\nBeijing claims almost the entire South China Sea, brushing off rival claims of several Southeast Asian countries, including the Philippines, and an international ruling that its assertion has no legal basis.\nIts claims include the waters around Scarborough Shoal -- which Beijing seized from Manila in 2012 -- where the Chinese military's Southern Theater Command said Wednesday it had held joint sea and air patrols.\nChina has long used its coastguard to assert its claims in the South China Sea, which analysts describe as \"grey zone\" harassment tactics that fall short of an outright act of war.\nAnd while the Chinese military had been deployed near Scarborough Shoal in the past, one analyst told AFP Wednesday's action showed they were \"becoming more aggressive and forceful\"."}, {"id": "9d870ac2-767e-4e72-b01b-fdefb8cf8e06", "title": "Increased Military Aircraft Activity Happening Now Over Wisconsin", "date": "2024-08-07 01:00", "url": "https://97zokonline.com/ixp/150/p/northern-lightning-2024-exercise/", "domain": "97zokonline.com", "domain_classification": "Unknown", "message": "Over 20 counties in Wisconsin will be hearing increased air traffic and jet noises as a big operation is underway.\nThe Volk Field Combat Readiness Training Center is hosting its annual Northern Lightning Counterland exercise now through August 16th, 2024.\nThe event will involve 1100 personnel from 19 Air Force, National Guard, and Marine Corps units.\nOthers include regional air guard bases like the 115th Fighter Wing from Madison, Wisconsin, and the 179 Fighter Squadron from Duluth.\nRead more about the Northern Lightning training exercise from the Wisconsin National Guard Press Release."}, {"id": "84a13dd4-59b1-4f05-89ed-916940b6fc93", "title": "In conversation with Gauteng Police Commissioner | 7 August 2024", "date": "2024-08-07 07:15", "url": "https://www.enca.com/news/conversation-gauteng-police-commissioner-7-august-2024", "domain": "enca.com", "domain_classification": "Unknown", "message": "JOHANNESBURG - Operation Shanela has netted over 13,000 suspects across the country, this week alone.\nThey include 8 suspected kidnappers in Fourways with over R300-million worth of drugs.\nAnd, two kidnappers in Johannesburg suspected of running a human trafficking ring.\nOperation Shanela was launched in May last year to combat crime in high-density areas.\nWe discuss this further with Gauteng Provincial Commissioner Tommy Mthombeni."}, {"id": "74031971-1c11-4d61-80c0-a27e06b62b9c", "title": "Maryland ban on assault - style weapons upheld", "date": "2024-08-07 02:00", "url": "https://www.yahoo.com/news/maryland-ban-assault-style-weapons-012658380.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SILVER SPRING, Maryland — A federal appeals court on Tuesday upheld Maryland’s decade-old ban on military-style firearms commonly referred to as assault weapons.\nCircuit Court of Appeals judges rejected gun rights groups’ arguments that Maryland’s 2013 law is unconstitutional under the Second Amendment.\nThe U.S. Supreme Court declined to review this case in May, when the full 4th Circuit was still considering it.\nMaryland officials argued the Supreme Court should defer to the lower court before taking any action, but the plaintiffs said the appeals court was taking too long to rule.\nThe Firearms Policy Coalition Inc., one of the plaintiffs challenging Maryland’s law, said it would again ask the Supreme Court to review the case."}, {"id": "a01cc32d-583d-4cd7-815a-26d662aeef1d", "title": "UK government calls on Elon Musk to act responsibly amid provocative posts as unrest grips country", "date": "2024-08-07 03:45", "url": "https://abcnews.go.com/Technology/wireStory/uk-government-calls-elon-musk-act-responsibly-amid-112628365", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The British government has called on Elon Musk to act responsibly after the tech billionaire used his social media platform X to unleash a barrage of posts that risk inflaming the violent unrest gripping the countryLONDON -- The British government has called on Elon Musk to act responsibly after the tech billionaire used his social media platform X to unleash a barrage of posts that officials say risk inflaming the violent unrest gripping the country.\nThe unrest began after right-wing activists used social media to spread misinformation about a knife attack that killed three girls during a Taylor Swift-themed dance event on July 29.\n“We’ve been working with the social media companies, and some of the action that they’ve taken already with the automatic removal of some false information is to be welcomed,” Alexander told the BBC.\n“But there is undoubtedly more that the social media companies could and should be doing.”That type of rhetoric may be part of what sparked Musk’s attack on the government.\nMusk frequently comments on geopolitical issues and his fans come to his defense when he is criticized, Baker said."}, {"id": "3b73582b-d9c2-4a2e-8c2f-dc1b18317df6", "title": "UK government calls on Elon Musk to act responsibly amid provocative posts as unrest grips country", "date": "2024-08-07 03:45", "url": "https://abcnews.go.com/Business/wireStory/uk-government-calls-elon-musk-act-responsibly-amid-112628364", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The British government has called on Elon Musk to act responsibly after the tech billionaire used his social media platform X to unleash a barrage of posts that risk inflaming the violent unrest gripping the countryLONDON -- The British government has called on Elon Musk to act responsibly after the tech billionaire used his social media platform X to unleash a barrage of posts that officials say risk inflaming the violent unrest gripping the country.\nThe unrest began after right-wing activists used social media to spread misinformation about a knife attack that killed three girls during a Taylor Swift-themed dance event on July 29.\n“We’ve been working with the social media companies, and some of the action that they’ve taken already with the automatic removal of some false information is to be welcomed,” Alexander told the BBC.\n“But there is undoubtedly more that the social media companies could and should be doing.”That type of rhetoric may be part of what sparked Musk’s attack on the government.\nMusk frequently comments on geopolitical issues and his fans come to his defense when he is criticized, Baker said."}, {"id": "aa1a3a4c-da95-404a-a0cb-d49837cf6c0c", "title": "As unrest roils united kingdom , government asks Musk to act responsibily", "date": "2024-08-07 03:30", "url": "https://www.mercurynews.com/2024/08/06/as-unrest-roils-uk-government-asks-musk-to-act-responsibily/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "The unrest began after right-wing activists used social media to spread misinformation about a knife attack that killed three girls during a Taylor Swift-themed dance event on July 29.\nThe government is calling on social media companies, such as Musk’s X, formerly known as Twitter, to do more to combat the spread of misleading and inflammatory information online.\nMusk frequently comments on geopolitical issues and his fans come to his defense when he is criticized, Baker said.\nNewsom vows new AI regulations after Elon Musk retweets fake Kamala Harris videoGov.\nFor his fans and followers, Musk’s impulsive comments are perceived as part of his genius.”Associated Press writer Brian Melley contributed."}, {"id": "9d70e8ab-acce-48ed-bf24-048d92a0eb59", "title": "Crane collapses in Vancouver as fire crews battle multiple blazes", "date": "2024-08-07 05:45", "url": "https://article.wn.com/view/2024/08/07/Crane_collapses_in_Vancouver_as_fire_crews_battle_multiple_b/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "VANCOUVER — Vancouver Fire and Rescue Services say a crane has collapsed on a construction site as crews battle multiple blazes that broke out Tuesday in the city's west side.\nFirefighters are working to extinguish the fires in locations including on Dunbar Street and W.... read full story"}, {"id": "60d71104-1892-4f03-b315-cae85091432d", "title": "Explained , Olympics 2024 : Why Vinesh Phogat was disqualified from wrestling gold medal match", "date": "2024-08-07 09:15", "url": "https://scroll.in/field/1071740/explained-olympics-2024-why-vinesh-phogat-was-disqualified-from-wrestling-gold-medal-match", "domain": "scroll.in", "domain_classification": "Unknown", "message": "Vinesh Phogat was dealt a heartbreak on Wednesday after she was disqualified from the women’s 50 kg wrestling final for being above the weight limit at the morning weigh-in at the 2024 Paris Olympics.\n“It is with regret that the Indian contingent shares news of the disqualification of Vinesh Phogat from the Women’s Wrestling 50 kg class,” read a statement published on social media by the Indian Olympic Association.\nThis is to ensure that, for example, a competitor weighing 50 kg does not compete against one weight in the over 80 kg category.\nPhogat previously used to compete in the women’s 53 kg category, but dropped down to the lower weight event for the Paris Olympics.\nSince Phogat has been disqualified, she will be ranked last in the weight category."}, {"id": "50d29986-a4bc-486a-87cc-98298373f354", "title": "Multiple teams have the talent to contend as Region 3 - 3A is up for grabs", "date": "2024-08-07 04:45", "url": "https://www.timesfreepress.com/news/2024/aug/06/multiple-teams-have-talent-contend-region-3-3a-tfp/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "Going up against the Tyner Rams offensive line this fall could be a losing battle for most in what looks to be a very competitive Region 3-3A."}, {"id": "32d3b71d-2d8c-488b-a42f-fb3df570f9ab", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:00", "url": "https://real1051.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "real1051.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "bd9a08af-24b9-421e-836e-bd9f3e71af89", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:15", "url": "https://wfmf.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "wfmf.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "fc30dc28-b4fb-439e-ba63-5bebfbf51bdf", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:15", "url": "https://wild955.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "wild955.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "112ddc40-661f-441a-b658-41ffb1290fa1", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:15", "url": "https://thebeatstl.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "thebeatstl.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "e1198436-ac58-4a99-9cc6-ef3587e32c43", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:00", "url": "https://1071kissfm.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "1071kissfm.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "19efb16c-438a-4d42-92e5-db7170b8b372", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:00", "url": "https://mix923fm.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "mix923fm.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "63ab2662-a308-4343-a3d2-02f1d56253f2", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 00:00", "url": "https://y100.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "y100.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "472815a7-83e9-42b5-8d72-3fd3e3d00139", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 01:00", "url": "https://v103.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "v103.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "7ad30904-22a1-4a9d-8f8c-753cca5124fa", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 01:45", "url": "https://wyldfm.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "wyldfm.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "185205c5-50b7-445b-9da8-f2dbd297f74c", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 01:45", "url": "https://1045thecat.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "1045thecat.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}, {"id": "be32ac77-22ab-4b27-89a7-3c86fe43a3f8", "title": "Drake Shocks Fans With 3 New Songs Featuring Latto , Young Thug & 21 Savage", "date": "2024-08-07 01:45", "url": "https://kisswheeling.iheart.com/content/2024-08-06-drake-shocks-fans-with-3-new-songs-featuring-latto-young-thug-21-savage/", "domain": "kisswheeling.iheart.com", "domain_classification": "Unknown", "message": "\"I can't sleep at night with Thug at Cobb County Corrections,\" Drake raps on \"It's Up.\"\nHis finsta account also posted promo footage of Latto and her sister Brooklyn.\nFor the unfamiliar, people believed Drizzy and Latto’s 21-year-old sister were rumored to be dating earlier this year.\n\"Ride it like big mama where you better have some skills,\" Latto spits.\n\"Attitude on Clayco but my ass is on Brazil/Latto givin' chills, Latto givin' thrills.\""}]