[{"id": "be77efb6-be59-4bbc-8e1e-f1354068f53e", "title": "Tropical storm Debby makes 2nd US landfall in South Carolina and threatens devastating flooding as it presses northward", "date": "2024-08-08 06:30", "url": "https://edition.cnn.com/2024/08/08/weather/tropical-storm-debby-landfall-forecast-thursday/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "It is on track to move into North Carolina by Thursday evening and into northern Virginia by Friday morning.\n• “Be prepared for a deluge,” North Carolina governor says: North Carolina Gov.\nThat includes four tornadoes in Florida, four in South Carolina and two in North Carolina.\n• Tornado watches issued in North Carolina and Virginia: Tornado watches have been issued for parts of eastern North Carolina and southeastern Virginia.\nSouth Carolina hasn’t seen a named storm make landfall on its shores since Hurricane Ian’s arrival in 2022 as a Category 1 storm."}, {"id": "f2dfc6f0-91f2-4bbf-8d1b-6ded1782adc1", "title": "Huge earthquake sparks tsunami warning as map shows exact location set for waves", "date": "2024-08-08 09:15", "url": "https://www.dailystar.co.uk/news/world-news/breaking-huge-earthquake-sparks-tsunami-33419638", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nA map shows waves are expected to batter a huge length of the country's entire Pacific coastline after the quake.\nThe 7.1 magnitude beast occurred today at 4:42 pm local time near Miyazaki, Japan, reported by the United States Geological Survey.\nThey include: Kochi Prefecture; Bungo Channel coast, Oita Prefecture; Miyazaki Prefecture and Eastern Kagoshima Prefecture."}, {"id": "92bf94e4-b97e-4e0d-8f24-cb75167f288c", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 02:30", "url": "https://www.fox17online.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "fox17online.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "90940a84-cfcd-4d3a-92c6-be0e8037bccd", "title": "Tropical Storm Debby stalls , poised to move north in US", "date": "2024-08-08 03:45", "url": "https://www.canberratimes.com.au/story/8723408/tropical-storm-debby-stalls-poised-to-move-north-in-us/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Bann said that by Friday Debby would dump up to 20cm of rain on Virginia up into Pennsylvania, where ground in some patches was already soaked from other storms this week, heightening flooding concerns there."}, {"id": "8e19edeb-a2b3-4f6f-88cf-a4350dd92d48", "title": "Tropical Storm Debby makes second landfall in South Carolina as dangerous flood threat continues", "date": "2024-08-08 08:15", "url": "https://nypost.com/2024/08/08/us-news/tropical-storm-debby-makes-second-landfall-in-south-carolina-as-dangerous-flood-threat-continues/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall near Bulls Bay, South Carolina as Debby slowly moves up the Eastern Seaboard and unleashes a dangerous flood threat for millions of Americans.\nPresident Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nGetty Images4 President Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nFox WeatherTropical Storm Warnings remain in effect on the South Carolina and southeastern North Carolina coasts.\nNOAA’s Weather Prediction Center has issued a Level 4 flood risk, the highest threat on its scale through Thursday, in parts of northeastern South Carolina and southeastern North Carolina."}, {"id": "2ebd8c48-816f-4e23-a9e3-5e2af83c0878", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:00", "url": "https://abcnews.go.com/International/wireStory/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-112669097", "domain": "abcnews.go.com", "domain_classification": "International", "message": "TOKYO -- A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "375f112b-adc0-493f-a13b-f23ca284bbe9", "title": "DC , Maryland prepare for Tropical Storm Debby", "date": "2024-08-08 01:30", "url": "https://www.yahoo.com/news/dc-maryland-prepare-tropical-storm-225251863.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "WASHINGTON (DC News Now) — In D.C., preparations for the remnants of Tropical Storm Debby are underway.\nThe District’s Emergency Operations Center will be staffed over the next few days to respond.\nWest Virginia emergency crews on alert as Tropical Storm Debby approachesD.C.’s Emergency Operations Center is gearing up for a potentially dangerous storm Thursday night into Friday.\nTropical Storm Debby heading towards Virginia: Here’s how drivers can stay safeThe county has flood sensors near certain roads to alert drivers.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "7ff7109e-d1ac-4696-8dd9-e3a96db87e2e", "title": "Tropical Storm Debby track shifts west", "date": "2024-08-08 01:15", "url": "https://www.unionleader.com/news/weather/tropical-storm-debby-track-shifts-west/article_fe9e78e4-550a-11ef-9ff9-37b0f1eec9d0.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "e9e7fda1-f583-4580-88ae-20c40107ee64", "title": "Malaysians in areas affected by southern California earthquake urged to remain vigilant", "date": "2024-08-08 08:15", "url": "https://www.thestar.com.my/news/nation/2024/08/08/malaysians-in-areas-affected-by-southern-california039s-earthquake-urged-to-remain-vigilant", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "PUTRAJAYA: Malaysians in areas affected by the earthquake in southern California are urged to remain vigilant and adhere to safety guidelines issued by local authorities, said the Foreign Ministry.\nAccording to a statement, the Foreign Ministry, through the Consulate General of Malaysia in Los Angeles, is actively monitoring the situation following a 5.2-magnitude earthquake that occurred near Bakersfield, Southern California.\n\"The Foreign Ministry will continue to closely monitor the developments and provide updates as necessary to ensure the safety and well-being of all Malaysians in the affected regions,” the statement read.\nAccording to the Foreign Ministry, Malaysians requiring consular assistance can contact the Consulate General of Malaysia in Los Angeles at 777 South Figueroa Street, Suite 600, Los Angeles, California or telephone +1-213-892 1238 or email mwlosangeles@kln.gov.my.\n\"As we continue to handle the ongoing Atlantic hurricane season, including monitoring Tropical Storm Debby in Florida, we are extending our vigilance to the earthquake effects in California,” the statement added."}, {"id": "9a65241c-2acd-484f-92ae-43dd8e02dd3e", "title": "Japan news : powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:30", "url": "https://www.9news.com.au/world/japan-news-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/b72e3249-bbd1-48ce-b81d-e714b4a114b2", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ powerful earthquake struck off Japan 's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered a preliminary magnitude of 6.9 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres.\nIt issued a tsunami advisory, predicting waves of up to one metre (or 3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nThe Japan Meteorological Agency said the quake registered a preliminary magnitude of 6.9 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "7bc069c8-c848-417e-9048-830dc16aed2a", "title": "Powerful earthquake hits southern Japan – NBC New York", "date": "2024-08-08 09:30", "url": "https://www.nbcnewyork.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/5683204/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nIt issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nOperators of nuclear plants on Kyushu and Shikoku said they were checking to see if there was any damage to them.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "8272e81b-e00f-4e2a-97cb-498d69aac6a3", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued – Winnipeg Free Press", "date": "2024-08-08 09:00", "url": "https://www.winnipegfreepress.com/world/2024/08/08/a-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nPeople take shelter outside building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nAn earthquake on Jan. 1 in Japan’s north-central region of Noto left more than 240 people dead."}, {"id": "1d882024-9f0d-46ce-a4a5-491d6b22725a", "title": "Tsunami alert as powerful quake hits western Japan", "date": "2024-08-08 09:00", "url": "https://www.canberratimes.com.au/story/8724009/tsunami-alert-as-powerful-quake-hits-western-japan/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "1a9ab265-9bb5-4082-8f47-013fd4ecca75", "title": "Powerful earthquake hits southern Japan – NBC Bay Area", "date": "2024-08-08 09:30", "url": "https://www.nbcbayarea.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3619053/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nIt issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nJapan sits on the Pacific “Ring of Fire,” the line of seismic faults encircling the Pacific Ocean, and is one of the world's most earthquake-prone countries.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "b900d980-851c-482a-8470-5247ff3fe642", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 01:30", "url": "https://www.fox9.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox9.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "10a83a15-1127-4c27-8f9b-b8d8cc5f0b95", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 00:00", "url": "https://www.fox26houston.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "c60d456c-77c8-4f41-8ec8-151c47692038", "title": "Tropical Storm Debby stalls off Carolinas , poised to move north", "date": "2024-08-08 04:45", "url": "https://www.rappler.com/world/us-canada/tropical-storm-debby-united-states-updates-august-7-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "TROPICAL STORM DEBBY.\nA woman uses her phone to capture images from the pier as Tropical Storm Debby drifts in the East Coast, in Myrtle Beach, South Carolina, US, August 7, 2024.\nAt least six people have died in Florida and Georgia in the wake of Tropical Storm Debby.\n“All North Carolinians across our state need to be prepared for a deluge,” North Carolina Governor Roy Cooper said at a briefing at the state’s Department of Emergency Management on Wednesday.\nIt was forecast to make landfall again further north in South Carolina early Thursday, the National Hurricane Center said."}, {"id": "cb994750-4d78-4af7-9804-e3a3251149da", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 01:15", "url": "https://www.kjrh.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "5cc71bbc-cd81-4dee-ad9b-c7986ee86f6b", "title": "Tropical Storm Debby : Tropical storm Debby : Coastal flooding , tornadoes and power outages ravage southern states in US", "date": "2024-08-08 06:00", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debby-coastal-flooding-tornadoes-and-power-outages-ravage-southern-states-in-us/articleshow/112361270.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Impact of stormTropical Storm Debby persisted over the coastal regions of Georgia and the Carolinas on Wednesday, continuing to bring heavy rainfall to the area before moving northward.\nMultiple water rescues were reported in the city and its surrounding areas.Severe storms left nearly 330,000 customers in Ohio without power as of Wednesday afternoon.\nFirstEnergy's Illuminating Company announced on social media that power restoration could take days due to extensive damage.\nThe sixth victim, a 48-year-old man in Gulfport, Florida, was found after his anchored sailboat partially sank.\nStates of emergency were declared in North Carolina and Virginia, while Maryland issued a state of preparedness to coordinate efforts without declaring an official emergency."}, {"id": "1c13b1c6-f90a-4711-bf78-8d58e3c31be1", "title": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves through", "date": "2024-08-08 07:00", "url": "https://www.wwaytv3.com/clarkton-residents-worry-about-canal-flooding-as-tropical-storm-debby-moves-through/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves throughCLARKTON, NC (WWAY) — In Bladen County, there are growing concerns about inland flooding from Tropical Storm Debby.\nIn the town of Clarkton, some residents are worried the canals won’t be able to move all the rainwater away from their homes.\nSome areas of Clarkton flooded earlier this week after a storm, which caused a tree to fall into one of the canals.\nClarkton resident Rhonda Caballero said she feels the town didn’t do enough after Hurricane Florence to prevent flooding of the canals again.\nPrior to Debby, I was at a meeting at a church in town and I could not get back to my home."}, {"id": "b29d0a03-0ab3-436d-9edd-0a14f9413a5d", "title": "Tropical Storm Debby path : Storm heading north", "date": "2024-08-08 00:45", "url": "https://www.ctvnews.ca/climate-and-environment/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents-1.6991347", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimetres) of rain from Debby.\nIn South Carolina, Gov.\nThe centre of Debby was over the Atlantic on Wednesday evening, about 40 miles (65 kilometres) east-southeast of Charleston, the National Hurricane Center said.\nIn Charleston, South Carolina, the Brown Dog Deli closed early Monday and couldn't open Tuesday due to a curfew decreed by local officials.\n------Collins reported from Columbia, South Carolina."}, {"id": "6d445d0b-aaf2-49aa-857c-565329407264", "title": "A powerful earthquake measuring magnitude 6 . 9 hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:00", "url": "https://abcnews.go.com/International/wireStory/powerful-earthquake-measuring-magnitude-69-hits-off-southern-112668925", "domain": "abcnews.go.com", "domain_classification": "International", "message": "By The Associated PressAugust 8, 2024, 3:58 AM"}, {"id": "3880f9b8-e718-41af-bb61-e8a0057cf28c", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 03:45", "url": "https://dailyvoice.com/new-york/newrochelle/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "21d62072-6156-449b-ba6a-cfe70f03548e", "title": "Strong earthquake with preliminary magnitude of 7 . 1 strikes coast of Japan", "date": "2024-08-08 09:30", "url": "https://abcnews.go.com/International/71-magnitude-earthquake-strikes-coast-japan/story?id=112669098", "domain": "abcnews.go.com", "domain_classification": "International", "message": "LONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan as tsunami advisories have been triggered in the region, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan.\nThe Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPeople have been urged to stay away from the coast or river and have been warned that other quakes -- even on the same magnitude --may occur.\nIt would’ve been strong enough to knock over furniture, damage some concrete buildings and even topple some wooden ones."}, {"id": "2dafcba3-e415-4ab9-8074-fdf597f59290", "title": "Debby makes second landfall in South Carolina – NBC 5 Dallas - Fort Worth", "date": "2024-08-08 07:45", "url": "https://www.nbcdfw.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3615650/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "dc99353a-83ec-4b0d-b20b-244b309b80e4", "title": "7 . 1 magnitude earthquake strikes coast of Japan , tsunami advisories triggered", "date": "2024-08-08 09:15", "url": "https://abc7ny.com/71-magnitude-earthquake-strikes-coast-of-japan-tsunami-advisories/15158199/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "7.1 magnitude earthquake strikes coast of Japan, tsunami advisories triggeredLONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan as tsunami advisories have been triggered in the region, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan.\nMiyazaki, with a population of approximately 400,000 people, is now on alert for potential tsunamis in the aftermath of the quake.\nThe Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPeople have been urged to stay away from the coast or river and have been warned that other quakes -- even on the same magnitude --may occur."}, {"id": "ce36510b-a587-4658-acfb-14038e88b5a7", "title": "Debby makes second landfall in South Carolina – NBC Los Angeles", "date": "2024-08-08 07:45", "url": "https://www.nbclosangeles.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3482407/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "005f36c5-1857-45b8-9070-bba22ae377ee", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/national/2024/08/08/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina."}, {"id": "90877594-26b3-4d0f-9093-3a9ed12a4b22", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:30", "url": "https://gazette.com/ap/national/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east/article_b18943e6-6fe5-5e90-a374-58c90582b0f2.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend"}, {"id": "1ed67a01-6545-44a4-9b9a-60076214415a", "title": "Debby makes second landfall in South Carolina – NBC Chicago", "date": "2024-08-08 07:30", "url": "https://www.nbcchicago.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3516190/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "161afec3-7cb0-4ea4-ace5-377e4dee911f", "title": "Debby makes second landfall in South Carolina – NBC Connecticut", "date": "2024-08-08 09:15", "url": "https://www.nbcconnecticut.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3357649/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "1687ba71-2f6c-4db6-9ba4-f3c19365d67f", "title": "Japan earthquake : Magnitude 7 . 1 quake hits southern part of island nation , tsunami warning issued", "date": "2024-08-08 09:30", "url": "https://www.dnaindia.com/world/report-japan-earthquake-magnitude-71-quake-hits-southern-japan-tsunami-warning-issued-3101047", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Japan earthquake: Magnitude 7.1 quake hits southern part of island nation, tsunami warning issuedThe quake was centred off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometreA powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "42f81da5-981f-4e9c-9f47-314bcbfec70f", "title": "Debby makes second landfall in South Carolina – NBC10 Philadelphia", "date": "2024-08-08 09:00", "url": "https://www.nbcphiladelphia.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3937797/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "e15464a0-5ad9-4d96-91a2-e316973e79a9", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://abcnews.go.com/US/wireStory/latest-debby-makes-landfall-tropical-storm-soaks-south-112668297", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Tropical Storm Debby is heading up the East Coast as it has made landfall for a second timeAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nMeahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Tropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea."}, {"id": "04a15af7-c30b-441d-b09a-985ede6c82d0", "title": "Tropical Storm Debby makes second U . S . landfall , in South Carolina", "date": "2024-08-08 07:00", "url": "https://www.nbcnews.com/news/weather/tropical-storm-debby-makes-second-us-landfall-south-carolina-rcna165679", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already dumped more than a foot of rain on parts of the South and is forecast to bring more, made a second landfall in the U.S. early Thursday when it crossed back into South Carolina.\nThe storm, which had 50 mph winds, made landfall near Bulls Bay, South Carolina, the National Hurricane Center said in a 2 a.m.\n“The big story with Debby is going to continue to be the rainfall,” National Hurricane Center Director Dr. Michael Brennan said in a 5 p.m. Wednesday update.\nWhen it was still out to sea off South Carolina at around 5 p.m., the storm was affecting weather from Florida to the Carolinas and into to the Mid-Atlantic states, Brennan said.\nAn EF-1 tornado associated with an outer rain band of the tropical storm damaged roofs of homes on the Isle of Palms in South Carolina on Tuesday, the weather service said."}, {"id": "94616df4-4d0d-4567-a110-b3d33410d26f", "title": "Magnitude 7 . 1 earthquake hits Japan southern region , tsunami warnings issued", "date": "2024-08-08 09:00", "url": "https://www.forexlive.com/news/magnitude-71-earthquake-hits-japans-southern-region-tsunami-warnings-issued-20240808/", "domain": "forexlive.com", "domain_classification": "Unknown", "message": "NHK is reporting that the earthquake have triggered tsunami warnings for several regions in the Japanese islands of Kyushu and Shikoku.\nThese warnings are also extended to the Kagoshima and Ehime prefectures, with the Miyazaki prefecture the one impacted the most.\nThe height of the tsunami is estimated to reach 1 metre.\nUSD/JPY is hovering around 145.70-80 levels still, keeping its track lower since the start of European morning trade.\nUpdate: We are seeing more headlines trickle in with NHK reporting that there are no abnormalities with the Sendai Nuclear Power Plant, which is located in Satsumasendai in the Kagoshima prefecture."}, {"id": "d533cae0-efa5-4e06-ac37-1acf0f02d0dc", "title": "Back - to - back strong earthquakes hit southern Japan , Tsunami warning issues – Firstpost", "date": "2024-08-08 08:45", "url": "https://www.firstpost.com/world/back-to-back-strong-earthquakes-hit-southern-japan-tsunami-warning-issues-13802389.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Two earthquakes, one of magnitude 6.9 and the other of 7.1, hit southern Japan on Thursday (August 8) read moreTsunami advisory has been issued following two earthquakes in southern Japan.\nImage source: Japan Meteorological AgencyAn earthquake of magnitude 6.9 hit southern Japan on Thursday (August 8).\nAdvertisementThe Japanese government established a special task force in response to the earthquakes, as stated in an official announcement.\nThe government of Japan has already set up a special task force in response to the quakes, according to a statement.\nIn fact, it accounts and accounts for around 18 percent of the world’s earthquakes."}, {"id": "75e6223f-022a-4cdc-8f38-13d1ce51fdca", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:45", "url": "https://isp.netscape.com/news/story/0001/20240808/d90428b0417df35fa1cae8b24793f5c5", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "cbc067ff-f451-4e3e-ac29-17ade3999327", "title": "Restaurants in Beaufort prepare for Tropical Storm Debby", "date": "2024-08-08 03:00", "url": "https://www.witn.com/2024/08/08/restaurants-beaufort-prepare-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "BEAUFORT, N.C. (WITN) - Tropical Storm Debby is inching closer to eastern Carolina, and restaurants across the area are preparing for the impact.\nAround Beaufort, tables and chairs were seen stacked as the town braces for Debby.\nCiara Heuser recently moved to the area and says the restaurant she works at will take the storm day by day.\n“We are one of the higher restaurants,” said Front Street Grill at Saltwater general manager Shannon Piner.\nTropical storms are something Piner says she is used to, which is why safety is top priority."}, {"id": "ceabf377-821f-49c0-b66f-592eddf9e29f", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:00", "url": "https://www.yahoo.com/news/latest-debby-makes-landfall-again-061607281.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Debby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov."}, {"id": "fa2d5110-dbee-4ace-9daf-61b54a2a4cb3", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:45", "url": "https://www.ksat.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov."}, {"id": "ac6aa3ce-2ed2-42ee-b37a-b63a863605e4", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.clickondetroit.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov."}, {"id": "34de3572-231d-45dc-ba4d-74421dc420db", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.local10.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov."}, {"id": "0348f347-649e-4701-bfe9-34c9250a3d64", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov."}, {"id": "2819fb99-4238-40a0-861d-9b07de2c3d14", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – The Durango Herald", "date": "2024-08-08 07:15", "url": "https://www.durangoherald.com/articles/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina."}, {"id": "92d5a412-dd8c-4b74-bb46-1378aeb3e812", "title": "Water district  takes dam safety very seriously  even in wake of  small earthquake  – St George News", "date": "2024-08-08 02:15", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/07/mgk-water-district-takes-dam-safety-very-seriously-even-in-wake-of-small-earthquake/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Jessop and others quickly checked the dams at the Kolob, Sand Hollow, Quail Creek, Ivins and Gunlock reservoirs for any potential problems.\nThe water district also works closely with engineers and the state’s own dam safety program, he said.\nOver 800 dams in Utah are monitored and inspected by the Division of Water Rights’ Dam Safety Section while the 50 federal dams in the state are overseen by the Bureau of Reclamation.\nBoth the state and federal agencies have standards for dam construction that include taking seismic, or earthquake, potential into account.\nZach Renstorm, the general manager of the county water district, praised the swift response of Jessop and others who made sure the dams weren’t affected by the earthquake."}, {"id": "74c5dbe0-6ad7-4d71-9caa-ad31c079a37e", "title": "New York Residents Warned To Prepare For Tropical Storm Debby", "date": "2024-08-08 03:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/update-new-york-residents-warned-to-prepare-for-tropical-storm-debby/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is making its way to New York State, forcing Empire State officials to warn New Yorkers to prepare.\nIt's been downgraded to a Tropical Storm but is expected to break rainfall records in both Georgia and South Carolina.\nHochul notes Tropical Storm Debby will hit later in the week, but right now there's a flood watch in effect for many parts of the state.\nFor all the news that the Hudson Valley is sharing make sure to follow Hudson Valley Post on Facebook, download the Hudson Valley Post Mobile\"Rain could fall at rates up to two inches per hour with local rainfall rates up to three inches at times.\nThen, Empire State residents have to worry about Tropical Storm Debby."}, {"id": "f9c4c075-b52f-4b56-bea3-e4b9e71edf9b", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 05:45", "url": "https://www.santafenewmexican.com/news/national_and_world_news/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents/article_f3223330-3d86-5480-979f-737d6d86e5e8.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "ac4033c9-13d6-4f62-9c48-76daa033d5fe", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 04:15", "url": "https://www.live5news.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "A few doors down, Charles Grainger was cleaning up after about 8 inches (20 centimeters) of water got into his home.\nIt’s part of living on the creek.”The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimeters) of rain from Debby.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nTropical Storm Debby strengthened over the Atlantic Ocean.\nAt least six people have died due to the storm, five of them in traffic accidents or from fallen trees."}, {"id": "d9a23818-836b-4f43-b493-203d3a3e0dcd", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:15", "url": "https://www.clickondetroit.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "23697b63-5b90-4c20-b2cb-9eb5c6aa727d", "title": "Charlotte gears up for storm : Hardware stores see surge , county Monitors water levels", "date": "2024-08-08 03:30", "url": "https://www.wbtv.com/2024/08/08/charlotte-gears-up-storm-hardware-stores-see-surge-county-monitors-water-levels/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Charlotte residents are preparing for the approaching storm as local groups work to ensure they’re ready to respond.\nTim Trautman, the Mecklenburg County Stormwater Program Manager, highlighted a network of sensors and cameras monitoring water levels in real-time.\nThese systems become crucial during heavy rainfall events, alerting authorities to areas at risk of overflowing creeks and subsequent road closures.\nTrautman warned that last week’s storms brought water levels halfway up the banks of some creeks, raising concerns about potential flooding with the expected rainfall.\n“They communicate messages to our staff as well as our emergency managers, so that they can decide where to deploy resources.”Local hardware stores are experiencing a surge in storm preparation supplies."}, {"id": "1d4e011f-a482-4dd4-afb3-80867605b644", "title": "Japan earthquake LIVE : Tsunami fears after massive 7 . 1 tremor rocks towns and cities - World News", "date": "2024-08-08 09:00", "url": "https://www.mirror.co.uk/news/world-news/japan-earthquake-live-tsunami-warning-33419988", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "A massive 7.1 magnitude earthquake has rocked Japan sparking fears a tsunami could be imminent.\nThe 7.1 magnitude earthquake occurred today at 4:42 pm local time near Miyazaki, Japan, the United States Geological Survey reported.\nThe Japan Meteorological Agency has also recorded the magnitude as 7.1 with the epicentre at Hyuganada Sea.\n\"According to preliminary data, the quake was located at a very shallow depth of 8.8 km.\nBased on the preliminary seismic data, the quake should have been felt by everybody in the area of the epicentre."}, {"id": "5ec1122b-da93-42d7-bc01-86051e7dd377", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:00", "url": "https://www.clickorlando.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "485c654b-6fd9-4d23-9deb-be3b4236d651", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – Winnipeg Free Press", "date": "2024-08-08 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/07/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nA resident walks through flood waters in the historic district of French Quarter Creek as flood waters recede from Tropical Storm Debby, Wednesday, Aug. 7, 2024, in Huger, S.C. (AP Photo/Mic Smith)___Collins reported from Columbia, South Carolina."}, {"id": "7ef66ce5-48c9-4301-b86e-dee4534281af", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://www.yahoo.com/news/tropical-storm-debby-move-over-040947508.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina."}, {"id": "6bca4c53-d08a-442a-b6e2-acfa3f0ed402", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://abcnews.go.com/US/wireStory/tropical-storm-debby-move-soggy-south-carolina-coast-112667020", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina."}, {"id": "9ae599f7-888b-4ca6-b5d3-a3994a7d94a4", "title": "FIRST ALERT WEATHER : Heavy rain and wind in the early AM for the Midlands", "date": "2024-08-08 04:45", "url": "https://www.wistv.com/2024/08/08/first-alert-weather-heavy-rain-wind-early-am-midlands/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "First Alert Headlines· We have a final First Alert Weather Day for our Thursday due to heavy rain, gusty winds, and isolated flooding from Debby.\nFirst Alert Summarywis (wis)Today is a First Alert Weather Day as heavy rain and gusty winds push into the region from the east with Tropical Storm Debby pushing back up into South Carolina.\nwis (wis)Not much storm surge is expected with this system, but gusty winds, rough surf and heavy rain is our main threats.\nwis (WIS)ADDITIONAL RAIN EXPECTED AS OF 6AM TODAY:wis (wis)Thursday is a First Alert Weather Day for heavy rain and gusty winds.\nFirst Alert ForecastFirst Alert Weather Day (Thursday): Continuous rounds of heavy rain and gusty winds, especially early."}, {"id": "3ed3af3e-7609-4c56-b4f8-298b6fd29b43", "title": "Japan hit by 2 powerful earthquakes , tsunamis expected | South China Morning Post", "date": "2024-08-08 09:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3273719/japan-hit-two-powerful-earthquakes-tsunamis-expected", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "A 6.9-magnitude earthquake followed by a 7.1 tremor struck off southern Japan on Thursday, the United States Geological Survey said, with the local meteorological agency warning of tsunamis striking coastal areas.\nThe USGS said that the first quake hit at 4.42pm (0742 GMT) at a depth of 33 kilometres (20 miles), about 29km southeast of Miyazaki on Kyushu.\nThe second struck less than a minute later at a depth of 26m and was 20km northeast of Miyazaki.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan.\nIn March 2022, a 7.4-magnitude quake off the coast of Fukushima shook large areas of eastern Japan, killing three people."}]