[{"id": "20841d97-e8fa-4eca-bd22-3bf30de0df43", "title": "Hezbollah fighters shoot down an Israeli drone in Lebanon and fire rockets at an Israeli base", "date": "2024-06-02 00:30", "url": "https://www.local10.com/news/world/2024/06/01/hezbollah-fighters-shoot-down-an-israeli-drone-in-lebanon-and-fire-rockets-at-an-israeli-base/", "message": "(AP Photo/Mohammad Zaatari)BEIRUT – The militant Hezbollah group said it shot down an Israeli drone over southern Lebanon and fired rockets at an Israeli military base on Saturday, hours after Israeli drone strikes killed at least one person and wounded several others.\nEarlier Saturday, an Israeli drone strike on a motorcycle near the southern Lebanese village of Khirbet Selm wounded two people, state-run National News Agency said.\nSuch strikes deep inside Lebanon and far away from the Israeli border have been rare since the latest round of fighting began nearly eight months ago.\nThe Saturday night strike was about 100 kilometers (60 miles) from the Israeli border.\nHezbollah began attacking Israeli military posts along the Lebanon-Israel border a day after the Israel-Hamas war broke out on Oct. 7."}, {"id": "9574abcb-d674-42a5-89c5-f63b4aa8d885", "title": "Does Biden Reject Israel Right to Self - Defense ? | The Jewish Press - JewishPress . com | Caroline B . Glick | 25 Iyyar 5784 – Sunday , June 2 , 2024", "date": "2024-06-02 02:30", "url": "https://www.jewishpress.com/indepth/opinions/does-biden-reject-israels-right-to-self-defense/2024/06/02/", "message": "Take away a state’s right to self-defense, and you’ve effectively transformed it into a non-sovereign state.\nSix Biden administration actions and policies subvert Israel’s right to self-defense.\nSo by undermining Israel’s operation in Rafah, the administration is protecting Hamas from destruction while effectively criminalizing Israel’s war to protect itself from further aggression against Hamas.\nare better than Hamas terrorists but Israel does not share (nor can it afford to) in the Americans’ delusions.\nAll of the administration’s actions against Israel in Gaza—throughout the region and in relation to Iran—undermine and subvert Israel’s sovereign right to self-defense."}, {"id": "421061ff-0786-47d8-80d3-4ef5217515dd", "title": "The West is crossing a dangerous new threshold in Ukraine", "date": "2024-06-02 00:30", "url": "https://www.thetimes.co.uk/article/the-west-is-crossing-a-dangerous-new-threshold-in-ukraine-wd0333hjt", "message": "Since the autumn of 2022 Ukraine’s western backers have crossed one threshold after another in response to President Putin’s invasion of his neighbour.\nAfter much agonising, the West first gave Kyiv offensive multiple-launch rockets, then Patriot air defence missiles, then Nato tanks, then cruise missiles, then F-16 aircraft, and latterly, ATACMS — the US army’s tactical ballistic missile system.\nOn Thursday, President Biden took a hesitant step across the most delicate threshold of all, announcing that Ukraine could use some of the most offensive of these US weapons to strike at targets on the Russian side of the border opposite Ukraine’s Kharkiv region.\nUkraine’s Himars (High Mobility Artillery Rocket System) launchers can now be used to fire longer-range missiles SERHII MYKHALCHUK/GLOBAL IMAGES UKRAINE/GETTY IMAGESBiden, however, has specified that US weapons could be used only in the sector around Kharkiv, and against strictly military targets, and"}, {"id": "05dc1b5d-931a-4145-b5d6-fadb0e243c66", "title": "North Korea says leader Kim Jong Un supervised drills simulating preemptive attacks on South Korea - New Delhi Times - India Only International Newspaper", "date": "2024-06-02 01:15", "url": "https://www.newdelhitimes.com/north-korea-says-leader-kim-jong-un-supervised-drills-simulating-preemptive-attacks-on-south-korea/", "message": "North Korea has simulated nuclear strikes on South Korea numerous times, but the latest drills came after animosities on the Korean Peninsula rose over North Korea’s recent failed spy satellite launch.\nNorth Korea reacted angrily, arguing that it has the sovereign right to launch satellites.\nAlso this week, North Korea flew hundreds of huge balloons into South Korea carrying manure and other trash, and allegedly jammed GPS navigation signals in the South.\nMinistry spokesperson Kim Inae said separately that South Korea “strongly condemns” North Korea for threatening preemptive strikes against the South.\nThe North Korean firing exercises appeared to be short-range ballistic missile test-launches that South Korea detected from North Korea’s capital region on Thursday."}, {"id": "86a3d878-5902-443d-b381-951f645b74d6", "title": "Sheboygan police officer shoots stabbing suspect", "date": "2024-06-02 00:45", "url": "https://www.yahoo.com/news/sheboygan-police-officer-shoots-stabbing-193529069.html", "message": "SHEBOYGAN, Wis. - A Sheboygan police officer shot a stabbing suspect, who allegedly charged at officers with a knife, on Friday, May 31.\nIt happened near 14th and Michigan shortly after 5 p.m. Police were initially called for a fight at an apartment.\nAfter nearly two hours of negotiations, police said the suspect came out with a knife and charged at officers.\nAn officer first retreated and tried using \"less-lethal means of incapacitating the suspect,\" police said, before shooting the suspect one time.\nThe Sheboygan County Sheriff's Office will handle the investigation into the officer-involved shooting, police said."}, {"id": "e8f62ca9-1627-41a5-b970-1a763d051941", "title": "Satellite Images Show New Aircraft Shelters At Russian Air Base Near Ukrainian Border", "date": "2024-06-02 01:15", "url": "https://theaviationist.com/2024/06/01/satellite-images-marinovka/", "message": "New Aircraft Shelters at Marinovka Air Base: Deception, Protection, or Strategic Defense?\nSatellite photos show aircraft shelters at Russia’s Marinovka air base in Russia’s Volgograd region, 300-km from the border with Ukraine.\nThis will significantly reduce Russia’s air raids capacities.\nThe images, Google Earth, show “hangars in anticipation of deep strikes by Ukraine,” said Ukrainian military blogger Igor Sushko.\nSatellite photos then revealed Russia had placed rubber “tires” on its bombers at Engels Air Base, perhaps to provide added protection from drone and, possibly, Neptune missile strikes."}, {"id": "5a586170-4603-415b-9bb3-db1c9905f308", "title": "Hezbollah shot down an Israeli drone in Lebanon and fired rockets at an Israeli base", "date": "2024-06-02 03:00", "url": "https://article.wn.com/view/2024/06/02/Hezbollah_shot_down_an_Israeli_drone_in_Lebanon_and_fired_ro/", "message": "Lebanese men inspect a destroyed house that was hit on Friday night by an Israeli airstrike, killing one woman and... read full story"}, {"id": "43db3e8e-3ba3-4699-a662-fb6aa47f9554", "title": "Ukraine war briefing : Kharkiv counts cost of Russian air strikes", "date": "2024-06-02 01:00", "url": "https://www.theguardian.com/world/article/2024/jun/02/ukraine-war-briefing-kharkiv-counts-cost-of-russian-air-strikes", "message": "A Russian missile strike on residences injured 13 people including eight children in Balakliia town, Kharkiv region, on Saturday, Ukrainian prosecutors said.\nA military spokesperson, Nazar Voloshin, told national television on Saturday that Ukrainian forces controlled 70% of Vovchansk, 5km (three miles) inside the border, which Russian troops have been trying to capture.\nRussian forces fired a combined 100 missiles and drones at Ukraine overnight into Saturday morning, hitting energy sites, Ukrainian officials said.\nThe air force said it shot down 35 of the missiles and all but one of the drones.\nThe UK’s Ministry of Defence has estimated that the number of Russian troops killed or wounded since the war’s outbreak “has now likely reached 500,000”."}, {"id": "04837489-5b2c-4aad-bee9-542114d2bf82", "title": "Osnat Abramov", "date": "2024-06-02 03:00", "url": "https://www.courant.com/obituaries/osnat-abramov-israel-ct/", "message": "Condolences are offered to the family and friends of Osnat Abramov, who was killed in a suicide bombing by two Palestinian terrorists on Monday (October 21, 2002).\nOsnat Abramov, an 11th grader, was on her way home after spending the day with friends in Tiberias.\nThe two terrorists killed 14 people and injured 42 when a car bomb loaded with about 100 pounds of nail-studded explosives was detonated next to Bus 841, traveling from Kiryat Shmona to Tel Aviv.\nOsnat Abramov was a junior at the Yavne High School in Holon.\nShe is survived by her parents, Levi and Dora Abramov, a brother and three sisters."}, {"id": "64282cdd-8e55-4970-a7dc-80309522f15b", "title": "Hell Kitchen stabbing : 1 stabbed outside Duane Reade", "date": "2024-06-02 02:00", "url": "https://abc7ny.com/post/hells-kitchen-stabbing-1-stabbed-duane-reade/14900660/", "message": "Duane Reade security guard stabbed in while trying to stop robbery at Hell's Kitchen storeThe security guard was taken to the hospital and is expected to survive.\nThe security guard was taken to the hospital and is expected to survive.\nThe security guard was taken to the hospital and is expected to survive.\nThe security guard was taken to the hospital and is expected to survive.\nHELL'S KITCHEN, Manhattan (WABC) -- A security guard at a Duane Reade in Hell's Kitchen was stabbed multiple times while trying to stop a homeless man from stealing."}, {"id": "f494f4df-ec03-4de2-8be0-8fec27081aa6", "title": "Boston Police investigate serious Saturday night stabbing in Jamaica Plain", "date": "2024-06-02 03:30", "url": "https://www.boston25news.com/news/local/boston-police-investigate-serious-saturday-night-stabbing-jamaica-plain/VONGZAT625ED3CZCMDLDECGP3Y/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "bff884ed-7d8f-4582-8825-8a326f41b4df", "title": "One Man Wounded , One Arrested in Van Nuys Stabbing", "date": "2024-06-02 03:00", "url": "https://mynewsla.com/crime/2024/06/01/one-man-wounded-one-arrested-in-van-nuys-stabbing/", "message": "A man was arrested after stabbing another man during a fight in Van Nuys Saturday.\nThe stabbing occurred about 3:50 p.m. Saturday at Victory and Van Nuys boulevards, Los Angeles Police Department Officer David Cuellar told City News Service.\nThe wounded man was taken to a hospital by paramedics, Cuellar said.\nHis condition was not immediately available.\nThe knife-wielding man was taken into custody, he said."}, {"id": "3d4bde77-54da-46f8-90ba-1eb5cba04610", "title": "1 critically injured in south Wichita stabbing", "date": "2024-06-02 00:00", "url": "https://www.kwch.com/2024/06/01/1-critically-injured-south-wichita-stabbing/", "message": "WICHITA, Kan. (KWCH) - One person is in critical condition after a stabbing in south Wichita on Saturday afternoon.\nAccording to Sedgwick County dispatch, the incident occurred at 12:18 p.m. in the 2500 block of South Mosley.\nOne person was rushed to the hospital in critical condition.\nThis is an ongoing investigation; we will update this story as more details become available.\nTo report a correction or typo, please email news@kwch.com"}, {"id": "7d7b27ec-97d2-4556-a131-5d20be6e664f", "title": "Taste of the Creek returns to delight patrons with local flavors", "date": "2024-06-02 00:00", "url": "https://wwmt.com/news/local/taste-of-the-creek-returns-to-delight-patrons-with-local-flavors-battle-creek-festival-market-square-vendors-kiddie-land", "message": "Rain couldn't stop community members from enjoying a wide array of tasty food offerings.\nTaste of the Creek returned to Battle Creek on Saturday.\nHistory restored:The free event featured the best foods from local chefs and restaurants for the whole family.\nLocated at the Festival Market Square, the event featured 40 different vendors and a live DJ.\nCrime:This year also featured Kiddie Land, a new made-for-kids area including bounce houses, bubble machines, and more."}, {"id": "1ad62ae0-b2eb-470a-9549-2fc2d1fd4076", "title": "Dem Rep . Quigley : Biden Slow - Walking Weapons Has Made Our Ukraine Strategy for Them to Not Win", "date": "2024-06-02 04:45", "url": "https://www.breitbart.com/politics/2024/06/01/dem-rep-quigley-biden-slow-walking-weapons-has-made-our-ukraine-strategy-for-them-not-to-win/", "message": "On Friday’s “CNN Newsroom,” Rep. Mike Quigley (D-IL) stated that President Joe Biden has constantly refused requests for weapons from Ukraine before eventually changing his mind, and that has effectively resulted in America’s strategy being for Ukraine to not win.\nAnd unfortunately, that puts Ukraine behind the schedule of dealing with this.\nDo you agree with that criticism?”Quigley answered, “I think it’s had the effect of having that result.\nI think that President Biden and those that support Ukraine always wanted them to win, and have certainly given them a tremendous amount of aid.\nThe slow-rolling on some of the issues and the weaponry that we’re talking about has had that effect."}, {"id": "8b39331b-5f13-4eed-9bb5-8f8aac07ad20", "title": "Lucasfilm Is Ready to Defend The Acolyte From Bigoted Backlash", "date": "2024-06-02 04:45", "url": "https://gizmodo.com.au/2024/06/lucasfilm-is-ready-to-defend-the-acolyte-from-bigoted-backlash/", "message": "Lucasfilm has had what can, charitably, be described as a rocky history with how it has handled Star Wars frequently finding itself the target of the ever-evolving reactionary culture war.\nBut things have improved, to a point—and with its latest show, The Acolyte, the company is at least willing to acknowledge that it’s ready to defend its work from bad-faith bigotry.\nI think a lot of the women who step into Star Wars struggle with this a bit more.\n“As a fan myself, I know how frustrating some Star Wars storytelling in the past has been.\n“I stand by my empathy for Star Wars fans."}, {"id": "1d7c46d3-5aba-4b20-9bde-e3503118f041", "title": "D . J . Tice : In spite of an awful war , they  had a good feeling about this country  ", "date": "2024-06-02 00:30", "url": "https://www.startribune.com/dj-tice-in-spite-of-an-awful-war-they-had-a-good-feeling-about-this-country/600370352/", "message": "Some years ago I recorded an oral history interview with my mother focused on \"the special feeling\" she recalled during the war years.\n\"In spite of how bad it all was,\" Mom said, \"you really had a good feeling about this country.\"\nSuch sorrowful chapters are the regrettably un-exceptional parts of American history.\nIn short, when it faced a war it was not prepared to lose, America gave little quarter to anyone.\nG.K. Chesterton called America \"a nation with the soul of a church,\" being \"the only nation in the world that is founded on a creed,\" not a common ancestry."}, {"id": "53e02891-cb72-469d-aaca-6f1398ca7fcf", "title": "Royals and veterans prepare to mark 80th anniversary of D - Day landings", "date": "2024-06-02 03:30", "url": "https://www.ipswichstar.co.uk/news/national/24360318.royals-veterans-prepare-mark-80th-anniversary-d-day-landings/", "message": "The King, Queen and Prince of Wales will travel to Normandy to attend a number of commemorative events on Thursday, with Prime Minister Rishi Sunak due to join Charles and Camilla at the British Normandy Memorial in Ver-sur-Mer.\nOn the eve of the anniversary, hundreds of Armed Forces personnel will parachute into a historic D-Day drop zone in France to recreate the airborne liberation of Normandy 80 years ago.\nA series of commemorative events are planned for the days leading up to the anniversary.\nBattle of Britain Memorial Flight aircraft are not expected to take part in the D-Day 80 commemorations (Aaron Chown/PA)On Monday, D-Day veterans will meet local schoolchildren at an event in Portsmouth – the nerve centre of D-Day operations 80 years ago – before they are shown around Southwick House from where General Dwight Eisenhower directed operations back in 1944.\nThe Princess Royal, Colonel-in-Chief of The Royal Regina Rifles, will unveil a statue of a Second World War Canadian Royal Regina Rifleman in Normandy and attend a reception with members of the regiment."}, {"id": "1c75456c-54ef-4ad2-bebc-633020b7a1ba", "title": "Royals and veterans prepare to mark 80th anniversary of D - Day landings", "date": "2024-06-02 02:30", "url": "https://www.yorkpress.co.uk/news/national/24360318.royals-veterans-prepare-mark-80th-anniversary-d-day-landings/", "message": "The King, Queen and Prince of Wales will travel to Normandy to attend a number of commemorative events on Thursday, with Prime Minister Rishi Sunak due to join Charles and Camilla at the British Normandy Memorial in Ver-sur-Mer.\nOn the eve of the anniversary, hundreds of Armed Forces personnel will parachute into a historic D-Day drop zone in France to recreate the airborne liberation of Normandy 80 years ago.\nA series of commemorative events are planned for the days leading up to the anniversary.\nBattle of Britain Memorial Flight aircraft are not expected to take part in the D-Day 80 commemorations (Aaron Chown/PA)On Monday, D-Day veterans will meet local schoolchildren at an event in Portsmouth – the nerve centre of D-Day operations 80 years ago – before they are shown around Southwick House from where General Dwight Eisenhower directed operations back in 1944.\nThe Princess Royal, Colonel-in-Chief of The Royal Regina Rifles, will unveil a statue of a Second World War Canadian Royal Regina Rifleman in Normandy and attend a reception with members of the regiment."}, {"id": "dec5f459-faa8-44ab-a3c9-6261dfc0373a", "title": "Royals and veterans prepare to mark 80th anniversary of D - Day landings", "date": "2024-06-02 04:45", "url": "https://www.thenorthernecho.co.uk/news/national/24360318.royals-veterans-prepare-mark-80th-anniversary-d-day-landings/", "message": "The King, Queen and Prince of Wales will travel to Normandy to attend a number of commemorative events on Thursday, with Prime Minister Rishi Sunak due to join Charles and Camilla at the British Normandy Memorial in Ver-sur-Mer.\nOn the eve of the anniversary, hundreds of Armed Forces personnel will parachute into a historic D-Day drop zone in France to recreate the airborne liberation of Normandy 80 years ago.\nA series of commemorative events are planned for the days leading up to the anniversary.\nBattle of Britain Memorial Flight aircraft are not expected to take part in the D-Day 80 commemorations (Aaron Chown/PA)On Monday, D-Day veterans will meet local schoolchildren at an event in Portsmouth – the nerve centre of D-Day operations 80 years ago – before they are shown around Southwick House from where General Dwight Eisenhower directed operations back in 1944.\nThe Princess Royal, Colonel-in-Chief of The Royal Regina Rifles, will unveil a statue of a Second World War Canadian Royal Regina Rifleman in Normandy and attend a reception with members of the regiment."}, {"id": "4234cc3a-e9b1-475c-9602-835aaf027397", "title": "DA Alvin Bragg committed  political malpractice  by taking NY Trump case , Mitt Romney says", "date": "2024-06-02 03:00", "url": "https://www.yahoo.com/news/da-alvin-bragg-committed-political-185402050.html", "message": "Sen. Mitt Romney on Saturday accused Manhattan District Attorney Alvin Bragg of committing “political malpractice” by pursuing criminal charges against ex-President Donald Trump .\nBut he made a political decision,” the Utah Republican and staunch Trump critic told his biographer, Atlantic writer McKay Coppins.\nIt’s political malpractice.”Sen. Mitt Romney accused Alvin Bragg of committing “political malpractice” by pursuing criminal charges against the former president.\nJoe Rondone/The Republic / USA TODAY NETWORKManhattan DA Alvin Bragg speaks at a news conference following the conviction of former President Trump on May 30, 2024.\nA Manhattan jury on Thursday convicted Trump of 34 criminal charges of falsifying business records in a scheme to influence the 2016 presidential election."}, {"id": "1e4ceb90-8b5c-4afb-b501-593f34ecfbdc", "title": "Royals and veterans prepare to mark 80th anniversary of D - Day landings", "date": "2024-06-02 04:45", "url": "https://www.swindonadvertiser.co.uk/news/national/24360318.royals-veterans-prepare-mark-80th-anniversary-d-day-landings/", "message": "The King, Queen and Prince of Wales will travel to Normandy to attend a number of commemorative events on Thursday, with Prime Minister Rishi Sunak due to join Charles and Camilla at the British Normandy Memorial in Ver-sur-Mer.\nOn the eve of the anniversary, hundreds of Armed Forces personnel will parachute into a historic D-Day drop zone in France to recreate the airborne liberation of Normandy 80 years ago.\nA series of commemorative events are planned for the days leading up to the anniversary.\nBattle of Britain Memorial Flight aircraft are not expected to take part in the D-Day 80 commemorations (Aaron Chown/PA)On Monday, D-Day veterans will meet local schoolchildren at an event in Portsmouth – the nerve centre of D-Day operations 80 years ago – before they are shown around Southwick House from where General Dwight Eisenhower directed operations back in 1944.\nThe Princess Royal, Colonel-in-Chief of The Royal Regina Rifles, will unveil a statue of a Second World War Canadian Royal Regina Rifleman in Normandy and attend a reception with members of the regiment."}, {"id": "e27355f3-e717-4150-b38a-f7a1d90da928", "title": "World War 3 on the horizon - is canned food and shotguns a better investment than a house ? ", "date": "2024-06-02 02:00", "url": "https://www.housepricecrash.co.uk/forum/index.php?/topic/253734-world-war-3-on-the-horizon-is-canned-food-and-shotguns-a-better-investment-than-a-house/page/2/", "message": "Join the conversationYou can post now and register later.\nIf you have an account, sign in now to post with your account."}, {"id": "77f5a507-e037-465d-a49c-08b93f8ff5d4", "title": "  Inspiring  D - Day veteran , 100 , dies days before 80th anniversary", "date": "2024-06-02 00:30", "url": "https://metro.co.uk/2024/06/01/inspiring-d-day-veteran-100-dies-days-80th-anniversary-20954324/", "message": "D-Day veteran David Teacher has died aged 100 at Broughton House in Salford, Greater Manchester, just days away from the 80th anniversary of the landings (Picture: PA Wire)A veteran of one of WWII’s most famous battles has died aged 100.\nDavid Teacher served as a mechanic with the RAF during the Second World War, and was one of the first to put boots on the ground at Juno beach as part of the 1944 ‘D-Day’ invasion.\nHis death on Friday came just before the 80th anniversary of the Normandy beach landings, which turned the tide of the conflict in favour of the Allied Forces.\nKaren Miller, chief executive of the home, said: ‘David was 100 years old and was an inspiration to us all.\nMORE : D-Day veteran honoured by King with special 100th birthday cardMORE : World War II submarine sunk 80 years ago found 3,000ft beneath oceanMORE : The history of ‘draft dodgers’ in war as Britain could consider conscription again"}, {"id": "5f896c89-c286-4c7b-9bcb-bcea680c9184", "title": "Royals and veterans prepare to mark 80th anniversary of D - Day landings", "date": "2024-06-02 02:30", "url": "https://www.kentonline.co.uk/news/national/royals-and-veterans-prepare-to-mark-80th-anniversary-of-d-day-landings-119139/", "message": "Members of the royal family and veterans are preparing to mark the 80th anniversary of the D-Day landings over the coming week.\nThe King, Queen and Prince of Wales will travel to Normandy to attend a number of commemorative events on Thursday, with Prime Minister Rishi Sunak due to join Charles and Camilla at the British Normandy Memorial in Ver-sur-Mer.\nOn the eve of the anniversary, hundreds of Armed Forces personnel will parachute into a historic D-Day drop zone in France to recreate the airborne liberation of Normandy 80 years ago.\nA series of commemorative events are planned for the days leading up to the anniversary.\nThe Princess Royal, Colonel-in-Chief of The Royal Regina Rifles, will unveil a statue of a Second World War Canadian Royal Regina Rifleman in Normandy and attend a reception with members of the regiment."}, {"id": "197b43e9-512a-480a-93fc-9db3b9266798", "title": "Orban social media mouthpiece zeroes in on EU ahead of vote", "date": "2024-06-02 04:45", "url": "https://www.yahoo.com/news/orbans-social-media-mouthpiece-zeroes-040839315.html", "message": "But critics say it has become the latest mouthpiece for nationalist Prime Minister Viktor Orban's Fidesz party, amplifying its narratives while slamming those critical of the government and most recently the EU.\nNo other political party in the EU has spent as much as Megafon over the same period, according to AFP.\n- 'Seemingly infinite' funding -During Orban's 14 years in power, Hungary's media landscape has been transformed, with public media long a government mouthpiece and large swathes of the private media sector owned by pro-government allies.\nIn the past, Megafon's director Istvan Kovacs, a former Fidesz candidate, said the centre has \"no formal relations\" with any political party.\nThrough Megafon's clips, Orban's Fidesz aims to reach more Hungarians who do not follow politics closely \"but can still be persuaded to lean towards the party\", Laszlo added."}, {"id": "f504b268-d649-4375-97f9-67da0185e896", "title": "Orban social media mouthpiece zeroes in on EU ahead of vote", "date": "2024-06-02 04:45", "url": "https://www.digitaljournal.com/tech-science/orbans-social-media-mouthpiece-zeroes-in-on-eu-ahead-of-vote/article", "message": "But critics say it has become the latest mouthpiece for nationalist Prime Minister Viktor Orban’s Fidesz party, amplifying its narratives while slamming those critical of the government and most recently the EU.\nNo other political party in the EU has spent as much as Megafon over the same period, according to AFP.\n– ‘Seemingly infinite’ funding –During Orban’s 14 years in power, Hungary’s media landscape has been transformed, with public media long a government mouthpiece and large swathes of the private media sector owned by pro-government allies.\nIn the past, Megafon’s director Istvan Kovacs, a former Fidesz candidate, said the centre has “no formal relations” with any political party.\nThrough Megafon’s clips, Orban’s Fidesz aims to reach more Hungarians who do not follow politics closely “but can still be persuaded to lean towards the party”, Laszlo added."}, {"id": "e09d2edc-28ae-4d34-b30b-8bee803cfd46", "title": "Great North Battle 2024 Day 2 - NOW Toronto", "date": "2024-06-02 03:30", "url": "https://nowtoronto.com/event/great-north-battle-2024-day-2/", "message": "The Great North Battle returns for its 5th edition in Toronto!\nA true celebration of hip hop shining light on all of the elements with battles, showcases and workshops over 2 days.\nThen Beatbox Canada shall be hosting the seeding rounds/first battle rounds of both the solo/loopstation categories of our stacked international beatbox competition with judge and special guest showcases mixed in.\nOur partners in the world of battle rap are the premier battle league KOTD.\nThey will be hosting a 4 person on beat battle rap tournament with 4 hungry MCs all vying for title of champion."}, {"id": "5b1bcc88-5289-411f-88a3-21dbe679e02f", "title": "Rabbi Shmuley Boteach says he is why Ben Shapiro fired Candace Owens", "date": "2024-06-02 04:45", "url": "https://www.jpost.com/j-spot/article-804169", "message": "Living in New York City, I have had the opportunity to cross paths with many influential and well-known figures in the Jewish world.\nOver the past few years, it has been a tremendous privilege to become close to Rabbi Shmuley Boteach, who is known as “America’s rabbi.”Boteach is an eloquent public speaker and writer, as well as a popular television and radio host.\nHe is the author of over 30 books, including The Israel Warrior: Fighting Back for the Jewish State from Campus to Street Corner."}, {"id": "52566d8f-7cb1-450e-b0da-f2b1be413402", "title": "Ryan Reynolds declares  War of the Popcorn Buckets  ", "date": "2024-06-02 00:00", "url": "https://www.cp24.com/entertainment-news/ryan-reynolds-has-declared-war-of-the-popcorn-buckets-he-s-honestly-onto-something-1.6910014", "message": "Dan Heching, CNN(CNN) — Ryan Reynolds this week unveiled arguably the most anticipated and sure-to-be coveted merchandise tied to his upcoming film “Deadpool & Wolverine”: the movie’s novelty popcorn bucket.\nIn his social media post announcing the buzzy item, Reynolds wrote, “Years from now they will look back at 2024 as the year the War of the Popcorn Buckets began.”What “war” could he possibly be referring to and why the hype around these movie snack containers, anyway?\nPopcorn buckets, in case you haven’t noticed, are having a major moment.\nThe first round of 2024 bucket battles, one might argue, was won in March by a “Dune: Part Two” popcorn bucket so strange it spawned a “Saturday Night Live” skit).\nA brief history of the bucketBranded popcorn buckets began popping up in the 1990s at Disney theme parks before they made their way to theaters in marketing campaigns."}, {"id": "2b014272-3583-424f-beca-a9ea9e7ef945", "title": "Gaza , mining top issues during second day of DFL convention", "date": "2024-06-02 02:00", "url": "https://www.postbulletin.com/news/minnesota/gaza-mining-top-issues-during-second-day-of-dfl-convention", "message": "The Minnesota DFL Convention was being held nearby.\nDan Williamson / Duluth Media GroupSeveral dozen protesters joined party delegates outside of the Duluth Convention Center on Saturday.\nPeople gather for the DFL Convention Saturday, June 1, 2024 at the Duluth Entertainment Convention Center.\nPeople raise their badges for a vote during the DFL Convention Saturday, June 1, 2024 at the Duluth Entertainment Convention Center.\nOn Saturday, the first day of the convention, delegates endorsed Sen. Amy Klobuchar in this year's election ."}, {"id": "a18a221c-fb53-41b7-bfda-f79ab14f97ad", "title": "Devastating Forest Infernos", "date": "2024-06-02 03:30", "url": "https://www.dailyexcelsior.com/devastating-forest-infernos/", "message": "The relentless heat wave gripping the UT has precipitated a severe crisis, with rampant forest fires wreaking havoc across vast tracts of forest land, particularly in the Jammu Division.\nIn districts such as Udhampur, Kathua, Rajouri, Reasi, and Anantnag, vast areas of forest have been reduced to ashes.\nEfforts by the Forest Department and local residents to combat the fires have been commendable but largely insufficient.\nReports suggest that the accumulation of flammable pine needles and the burning of agricultural waste near forest areas are significant contributors.\nThe forest fires in J&K are a stark reminder of our vulnerability to climate change and the urgent need for concerted action to protect our natural heritage and communities."}]