[{"id": "291c3878-4a17-45d2-97e0-f3bf88a3841a", "title": "Tropical Storm Hone forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 22:30", "url": "https://www.smdailyjournal.com/news/national/tropical-storm-hone-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend/article_b2af0160-c06a-597b-92f2-9b4496949b2c.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "bfba5b88-a88e-40ea-b191-46d57756193c", "title": "After the Dramatic Rescues , the Hidden Toll of Disasters is Felt by Millions", "date": "2024-08-23 10:30", "url": "https://blogs.adb.org/blog/after-dramatic-rescues-hidden-toll-disasters-felt-millions", "domain": "blogs.adb.org", "domain_classification": "Unknown", "message": "Earthquakes, powerful storms, tsunamis and other disasters have powerful immediate impacts, but they also do long-term damage that often gets overlooked.\nThe region is home to more than 80% of about 206 million people affected by disasters globally each year.\nBut an often-neglected aspect is the indirect human and economic toll that is still felt years, even decades, after the disaster.\nDisaster impacts can also transmit far beyond the disaster epicenter through temporary migration or permanent resettlement.\nAsia and the Pacific must continue to respond to disasters with immediate life-saving aid and reconstruction of the directly affected areas."}, {"id": "c5e0aa0e-ead9-4647-8908-500fdc30a08e", "title": "Tropical Storm Hone and Hurricane Gilma to track near Hawaii", "date": "2024-08-23 20:45", "url": "https://www.yahoo.com/news/tropical-storm-hone-hurricane-gilma-190117367.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"The strength of these wind gusts will be highly dependent on the exact track of the storm,\" AccuWeather Lead Hurricane Expert Alex DaSilva explained.\nThe RealImpact Scale factors in more than the Saffir-Simpson Wind Scale for Hurricanes.\nTropical depressions, tropical storms and hurricanes passing near Hawaii are rare but not unheard of.\nAugust tends to be the busiest month in terms of tropical threats to Hawaii, with 30 tropical cyclones affecting the islands since official record-keeping began in 1949.\nTwo named storms have not passed within 300 miles of the main islands of Hawaii within a week since 1992."}, {"id": "6b4b9dd3-7b4e-4d2f-867d-bed19f9f4681", "title": "Tropical Storm Hone threatens Hawaii with fire and floods", "date": "2024-08-23 18:00", "url": "https://www.yahoo.com/news/tropical-storm-hone-threatens-hawaii-165224197.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Atlantic hurricane season might be quiet for now, but the same can’t be said in the Pacific, where Tropical Storm Hone is threatening to deliver a weekend blow to Hawaii.\nA tropical storm watch has been raised for Hawaii’s Big Island with the storm on track to pass close to the state this weekend.\nThe storm is forecast to pass about 150 miles south of the Big Island late Saturday into Sunday morning.\nCNN WeatherIn addition to potentially flooding rainfall, Hone will also deliver gusty winds this weekend, especially over the Big Island.\nThe system will weaken as it approaches Hawaii, but whatever remains of it could take a swipe at the state late next week."}, {"id": "a8ae243b-41de-405b-808a-4cacd313c9a0", "title": "Tropical storm expected to bring strong winds and heavy rain to Hawaii", "date": "2024-08-23 18:15", "url": "https://www.pennlive.com/weather/2024/08/tropical-storm-expected-to-bring-strong-winds-and-heavy-rain-to-hawaii.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — A tropical storm is expected to deliver strong winds and heavy rain to Hawaii this weekend, particularly to the Big Island and Maui, as it passes south of the island chain.\nThe National Weather Service on Thursday evening issued a tropical storm watch for Hawaii County, which includes all of the Big Island, in anticipation of Tropical Storm Hone.\nIn an 8 p.m. advisory, the weather service said the storm was located about 770 miles east-southeast of Hilo and about 980 miles east-southeast of Honolulu.\nThe National Weather Service said Gilma was expected to weaken this weekend.\nFILE - A general view shows the aftermath of a wildfire in Lahaina, Hawaii, Thursday, Aug. 17, 2023."}, {"id": "98cb7378-8f34-4c26-ae05-7508bc99fae9", "title": "Atlantic hurricane season to bring 6 to 10 named storms during  supercharged September  ", "date": "2024-08-23 03:00", "url": "https://www.silive.com/weather/2024/08/atlantic-hurricane-season-to-bring-6-to-10-named-storms-during-supercharged-september.html", "domain": "silive.com", "domain_classification": "Unknown", "message": "STATEN ISLAND, N.Y. — With August drawing to a close, so too does the brief reprieve from tropical storms this Atlantic hurricane season.\nAn AccuWeather graphic shows the Atlantic hurricane season forecast as of Wednesday, Aug. 14, 2024.\n“We often see one tropical wave move off the coast of Africa every few days during the peak of the Atlantic hurricane season,” said DaSilva.\nThe potential of breaking recordsSince March, AccuWeather has been warning of an “explosive” Atlantic hurricane season.\nThese anticipated figures fall just short of the record-breaking season of 2020, which produced 30 named storms."}, {"id": "d54d74e1-5ad6-409b-9cab-d64094f03d1f", "title": "Tropical storm bears heavy rain , strong winds toward Hawaii", "date": "2024-08-23 19:30", "url": "https://www.oregonlive.com/weather/2024/08/tropical-storm-bears-heavy-rain-strong-winds-toward-hawaii.html", "domain": "oregonlive.com", "domain_classification": "Unknown", "message": "A tropical storm is expected to deliver strong winds and heavy rain to Hawaii this weekend, particularly to the Big Island and Maui, as it passes south of the island chain.\nThe National Weather Service on Thursday evening issued a tropical storm watch for Hawaii County, which includes all of the Big Island, in anticipation of Tropical Storm Hone.\nThe weather service issued a red flag warning at the time, something it does when warm temperatures, very low humidity and strong winds combine to raise fire danger.\nHurricane Gilma was packing maximum sustained winds of 120 mph, making it a Category 3 hurricane.\nThe cause of Lahaina blaze, the deadliest in the United States in over a century, hasn’t been determined, but it’s possible it was ignited by bare electrical wire and leaning power poles toppled by the strong winds."}, {"id": "976d261f-c506-44c1-8bc8-d26afd09230b", "title": "WFXR Weather Trivia : Saffir - Simpson Wind Scale", "date": "2024-08-23 16:15", "url": "https://www.yahoo.com/news/wfxr-weather-trivia-saffir-simpson-135838059.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROANOKE, Va. (WFXR) — Are you a weather fan or a meteorological expert?\nSee if you can correctly guess this WFXR Weather Trivia question!\nWhen was the Saffir-Simpson Hurricane Wind Scale developed?\nAccording to the National Hurricane Center (NHC), the Saffir-Simpson Hurricane Wind Scale is a one to five categorization rating based on a hurricane’s maximum sustained wind speed.\nKeep in mind that the scale does not address other hurricane-related hazards, such as storm surge, rainfall-induced flooding, and tornadoes."}, {"id": "ed610c2f-1a3a-4a53-8ef5-f27afa873797", "title": "Hone could strengthen in next 48 to 72 hours : NWS", "date": "2024-08-23 23:15", "url": "https://www.yahoo.com/news/hone-could-strengthen-next-48-213642045.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hone could strengthen in next 48 to 72 hours: NWSHONOLULU (KHON2) — Tropical Storm Hone continues moving westward toward the Hawaiian islands but the forward speed is expected to gradually slow.\nHawaii County remains under a tropical storm watch, which means that tropical storm conditions could reach the area within 48 hours.\n“There is the potential for excessive rainfall and flash flooding on portions of the Big Island.”The storm is forecast to pass near or south of the Big Island Saturday night into Sunday.\nThis material may not be published, broadcast, rewritten, or redistributed.\nFor the latest news, weather, sports, and streaming video, head to KHON2."}, {"id": "f0068a65-70a1-4333-960e-b090215b62d5", "title": "Tropical Storm Hone forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 20:15", "url": "https://www.livemint.com/news/tropical-storm-hone-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend-11724440760062.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — Tropical Storm Hone was expected to deliver strong winds and heavy rain to Hawaii this weekend, particularly to the Big Island and Maui, as it passes south of the island chain.\nA tropical storm watch was in effect Friday for Hawaii County, which includes all of the Big Island, according to the Central Pacific Hurricane Center in Honolulu.\nIt was moving west at 16 mph (26 kph) with maximum sustained winds of 45 mph (72 kph).\nThe weather service issued a red flag warning at the time, something it does when warm temperatures, very low humidity and strong winds combine to raise fire danger.\nHurricane Gilma was packing maximum sustained winds of 115 mph (185 kph), making it a Category 3 hurricane."}, {"id": "e82c42b9-bd06-4443-a534-2da61e287979", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 13:45", "url": "https://www.cleveland.com/news/2024/08/tropical-storm-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend.html", "domain": "cleveland.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — A tropical storm is expected to deliver strong winds and heavy rain to Hawaii this weekend, particularly to the Big Island and Maui, as it passes south of the island chain.\nThe National Weather Service on Thursday evening issued a tropical storm watch for Hawaii County, which includes all of the Big Island, in anticipation of Tropical Storm Hone.\nThe storm was moving west at 14 mph (23 kph) with maximum sustained winds of 40 mph (65 kph).\nThe National Weather Service issued a red flag warning at the time, something it does when warm temperatures, very low humidity and strong winds combine to raise fire danger.\nThe National Weather Service said Gilma was expected to slowly weaken this weekend."}, {"id": "cd7fd4e7-e633-4039-a80a-e641881e9ca4", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 11:00", "url": "https://www.ajc.com/news/nation-world/tropical-storm-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend/QBEV4QTORBFDNF7YTINXHLHJ3A/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "cf3bb05d-c41d-47be-856c-85446bce2d41", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 11:30", "url": "https://www.kiro7.com/news/tropical-storm/D6PPVZCOGZCILMP5MI23EPI54U/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "ee51d4dd-1749-44fa-a7ca-431185f863c9", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 11:00", "url": "https://gazette.com/ap/national/tropical-storm-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend/article_128828be-dccb-5f4c-b19c-42210d7ed01c.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekendA tropical storm is expected to deliver strong winds and heavy rain to Hawaii this weekend as it passes south of the island chain"}, {"id": "4e1c3940-72d0-4d75-af90-baf94ebfe0c2", "title": "Hurricane Gilma tracker : Check out the Category 3 storm projected path", "date": "2024-08-23 08:45", "url": "https://www.yahoo.com/news/hurricane-gilma-tracker-check-category-080719798.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Gilma continues to move slowly across East Pacific waters but isn't expected to bring extreme weather to Hawaii until the end of the month.\nHurricane #Gilma is churning between Tropical Depression #One-C near Hawaii and a developing tropical disturbance to the southeast.\nSeven become hurricanes and three become major hurricanes in hurricane season, which occurs from June 1 through November 30.\nWhat are the 2024 hurricane season names?\nAtlanticAccording to the National Hurricane Center, these are the list of names for the 2024 hurricane season:AlbertoBerylChrisDebbyErnestoFrancineGordonHeleneIsaacJoyceKirkLeslieMiltonNadineOscarPattyRafaelSaraTonyValerieWilliamEastern North PacificAlettaBudCarlottaDanielEmiliaFabioGilmaHectorIleanaJohnKristyLaneMiriamNormanOliviaPaulRosaSergioTaraVicenteWillaXavierYolandaZekeContributing: Christopher Cann, Doyle Rice, Mike Snider, Eduardo Cuevas, USA TODAY, Jennifer Sangalang, Florida TodayThis article originally appeared on USA TODAY: Hurricane Gilma tracker: See the Category 3 storm's projected path"}, {"id": "7b523ae7-2c7c-4b31-8e03-1c70b8c793d0", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 07:30", "url": "https://www.wsls.com/news/national/2024/08/23/tropical-storm-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "This satellite image provided by the National Oceanic and Atmospheric Administration (NOAA) shows Tropical Storm Hone and Hurricane Gilma located southeast of Hawaii, Thursday, Aug. 22, 2024.\n(NOAA via AP)HONOLULU – Tropical Storm Hone was expected to deliver strong winds and heavy rain to Hawaii this weekend, particularly to the Big Island and Maui, as it passes south of the island chain.\nA tropical storm watch was in effect Friday for Hawaii County, which includes all of the Big Island, according to the Central Pacific Hurricane Center in Honolulu.\nThe U.S. Drought Monitor says much of Hawaii is in moderate drought while parts of Maui and the Big Island are in extreme drought.\nThe weather service issued a red flag warning at the time, something it does when warm temperatures, very low humidity and strong winds combine to raise fire danger."}, {"id": "0eae0cf6-00b6-42d6-8289-b6260691b6ca", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 11:45", "url": "https://www.wsbradio.com/news/tropical-storm/D6PPVZCOGZCILMP5MI23EPI54U/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "951afa78-70b0-4d1e-8f0b-4058125d1e7c", "title": "Hurricane Gilma tracker : Check out the Category 3 storm projected path", "date": "2024-08-23 11:00", "url": "https://www.aol.com/hurricane-gilma-tracker-check-category-080719282.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Hurricane Gilma continues to move slowly across East Pacific waters but isn't expected to bring extreme weather to Hawaii until the end of the month.\nHurricane #Gilma is churning between Tropical Depression #One-C near Hawaii and a developing tropical disturbance to the southeast.\nSeven become hurricanes and three become major hurricanes in hurricane season, which occurs from June 1 through November 30.\nWhat are the 2024 hurricane season names?\nAtlanticAccording to the National Hurricane Center, these are the list of names for the 2024 hurricane season:AlbertoBerylChrisDebbyErnestoFrancineGordonHeleneIsaacJoyceKirkLeslieMiltonNadineOscarPattyRafaelSaraTonyValerieWilliamEastern North PacificAlettaBudCarlottaDanielEmiliaFabioGilmaHectorIleanaJohnKristyLaneMiriamNormanOliviaPaulRosaSergioTaraVicenteWillaXavierYolandaZekeContributing: Christopher Cann, Doyle Rice, Mike Snider, Eduardo Cuevas, USA TODAY, Jennifer Sangalang, Florida TodayThis article originally appeared on USA TODAY: Hurricane Gilma tracker: See the Category 3 storm's projected path"}, {"id": "c6aed387-9b48-43ae-b862-b57461b6937c", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 07:00", "url": "https://www.gjsentinel.com/news/us/tropical-storm-forecast-to-bring-strong-winds-and-heavy-rain-to-hawaii-this-weekend/article_2b8e5c26-9e37-5614-bfc5-2aa45f2a4b02.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Thursday NightPartly cloudy this evening then becoming cloudy with periods of light rain after midnight.\nLow near 65F.\nWinds ESE at 5 to 10 mph.\nChance of rain 60%."}, {"id": "6b0dae6e-1601-455f-9350-4c07132016ae", "title": "First Alert Forecast : Tropical Storm Watch posted for Hawaii Island", "date": "2024-08-23 19:15", "url": "https://www.hawaiinewsnow.com/2024/08/23/first-alert-forecast-tropical-storm-watch-posted-hawaii-island/", "domain": "hawaiinewsnow.com", "domain_classification": "Unknown", "message": "HONOLULU (HawaiiNewsNow) - Breezy trade winds will persist through Friday, with showers favoring windward and mauka locations.\nThe Central Pacific Hurricane Center is closely monitoring Tropical Storm Hone far east-southeast of the state currently tracking westward.\nHone is expected to pass south of, or possibly near to the Big Island this weekend, bringing the potential for flooding rain and damaging winds, and large surf.\nFirst Alert Weather Days issued for effects from Tropical Storm Hone in Central PacificIncreased moisture will move in from the east sometime late Saturday into Sunday, increasing the potential for heavy rainfall across windward and southeast areas of the Big Island.\nAs Tropical Storm Hone approaches this weekend into early next week, surf along south and east facing shores will increase, possibly reaching advisory levels over some east facing shores."}, {"id": "bf28af39-e44f-43eb-b325-537286f9cd32", "title": "Strong Tropical Storm Hone still on track to come near or just south of Big Island : Big Island Now", "date": "2024-08-23 22:30", "url": "https://bigislandnow.com/2024/08/23/strong-tropical-storm-hone-still-on-track-to-come-near-or-just-south-of-big-island/", "domain": "bigislandnow.com", "domain_classification": "Unknown", "message": "A few lingering heavy thundershowers may persist over portions of the Big Island into Monday, especially over leeward and upslope areas.\nPreparations for Tropical Storm Hone should be completed by midday Saturday.\nA tropical storm watch was issued for the Big Island last night in anticipation of Hone’s arrival.\nA few heavy showers and thunderstorms could persist over leeward and upslope portions of the Big Island, lasting into Monday.\nThe next update for Tropical Storm Hone will be issued at about noon, or sooner if conditions warrant."}, {"id": "50019f96-a9c9-4112-ad8a-0431f869d3e3", "title": "What is a tsunami ? Can they happen along the East & Gulf Coasts ? ", "date": "2024-08-23 01:15", "url": "https://www.wuft.org/weather/2024-08-22/what-is-a-tsunami-can-they-happen-along-the-east-gulf-coasts", "domain": "wuft.org", "domain_classification": "Unknown", "message": "The tsunami energy was propagated by a submarine landslide and although the maximum tsunami was recorded near the earthquake epicenter in Newfoundland, there were some tsunami waves recorded as far south as in South Carolina.\nEast and Gulf Coast tsunamis are low frequency.\nThere is a subduction zone in the Caribbean Sea and the tsunamis recorded in areas along the Gulf Coast states have been less than one meter or 3.28 feet.\nMeteotsunamis are progressive waves limited to the tsunami frequency band of wave periods (between two minutes and two hours).\nStorm surge is the abnormal rise in sea level caused by a storm, often a tropical system, apart from the predicted astronomical tide."}, {"id": "e624e21c-c65e-4490-824e-91f6c21a5021", "title": "What is a tsunami ? Can they happen along the East Coast ? ", "date": "2024-08-23 01:30", "url": "https://www.southcarolinapublicradio.org/sc-news/2024-08-22/what-is-a-tsunami-can-they-happen-along-the-east-coast", "domain": "southcarolinapublicradio.org", "domain_classification": "Unknown", "message": "For us on the East Coast, a tsunami will be more likely caused by a submarine landslide like the one that occurred in 1929 after a Magnitude 7.2 quake stroke near Newfoundland, Canada.\nThe tsunami energy was propagated by a submarine landslide and although the maximum tsunami was recorded near the earthquake epicenter in Newfoundland, there were some tsunami waves recorded as far south as in South Carolina.\nEast and Gulf Coast tsunamis are low frequency.\nThey don’t just occur along the coast, but they can happen in lakes, bays, or inlets.\nMeteotsunamis are progressive waves limited to the tsunami frequency band of wave periods (between two minutes and two hours)."}, {"id": "011524d1-c1eb-4ee2-bcc6-6fb03801622b", "title": "Frequency of Deadly Hurricanes Has Jumped 300 % ", "date": "2024-08-23 18:45", "url": "https://www.claimsjournal.com/news/national/2024/08/23/325895.htm", "domain": "claimsjournal.com", "domain_classification": "Unknown", "message": "Frequency of deadly hurricane weather has jumped 300 percent.\nSeverity of extreme hurricane rainfall has grown 33 percent.\nNot only has the frequency of extreme hurricane rainfall increased, but the maximum severity is growing as well, the report found.\n“Deep Sky Research uses a risk assessment approach for predicting the impact of climate change,” said Max Dugan-Knight, Deep Sky climate data scientist.\nDeep Sky said the U.S. will see worsening hurricanes not in the next 50 years, but in the next five."}, {"id": "522e2ac1-a8a4-4326-95b6-8b42a2152deb", "title": "Denman earthquake , NSW : Earthquake rocks NSW town", "date": "2024-08-23 02:45", "url": "https://www.dailymail.co.uk/news/article-13771333/Denman-earthquake-nsw.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A magnitude 5.0 earthquake hit a town in rural NSW so hard a local mayor 'thought the roof was about to cave in', as Australians living hours away in Sydney reported feeling tremors.\nThe earthquake was reported to have occurred at a depth of 10km and 14km to the east of Denman, according to the GA website.\nRegional NSW residents closer to the epicentre, in Mudgee and Gulgong - two hours drives west of Denman - reported walls and floors shaking.\nOthers further west at Dunedoo and someone at Anna Bay, north of Newcastle on the coast also reported feeling tremors.\nLavis Mitre 10 in Muswellbrook posted a photo of items strewn through its aisles after the quake."}, {"id": "6db2dc4b-ceec-4e99-bbe1-5927d94e77f8", "title": "Elizabeth Warren has fierce clash with CNBC host on Harri price control plan :  A fool errand  ", "date": "2024-08-23 23:15", "url": "https://www.yahoo.com/news/elizabeth-warren-fierce-clash-cnbc-202600538.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sen. Elizabeth Warren, D-Mass., was grilled on CNBC over Vice President Kamala Harris' plan to impose federal price controls on food and groceries in a nearly 20-minute-long debate on \"Squawk Box\" on Friday.\nWhen oil prices go up for whatever reason, or they go down, when they go down, the price is set for oil.\nThe Harris campaign has argued that federal price controls would keep grocery prices from spiking due to corporate greed.\n\"It is not price controls.\nOriginal article source: Elizabeth Warren has fierce clash with CNBC host on Harris' price control plan: 'A fool's errand'"}, {"id": "9329a027-cb57-483b-85da-84eba9e7554a", "title": "Manatee County residents claiming stormwater bacteria is killing their animals", "date": "2024-08-23 00:30", "url": "https://www.mysuncoast.com/2024/08/22/manatee-county-residents-claiming-stormwater-bacteria-is-killing-their-animals/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. (WWSB) - Following Hurricane Debby, high storm water levels have forced the relocation of horses, cattle, pets, and more.\nSeveral Manatee County residents have said their cows have died, pets have become sick, and other livestock have either fallen ill or died as well.\n“I feel terrible,” said Wes Matejka, a Myakka man who saw no flooding at all.\n“We got extremely lucky, we happened to purchase the highest elevation property in the county,” he added.\nCarol Felts, a longtime livestock owner in Manatee County and recent winner of a Manatee County election, said the infection of cuts as well as ingestion of chemicals can be horribly detrimental to these animals."}, {"id": "195d0589-e328-44ba-8138-f7e12e8183fb", "title": "Tropical storm forecast to bring strong winds and heavy rain to Hawaii this weekend", "date": "2024-08-23 11:15", "url": "https://www.krmg.com/news/tropical-storm/D6PPVZCOGZCILMP5MI23EPI54U/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "06acef7e-95c8-49d1-aa0f-ee949b3446ad", "title": "Ernesto heading toward Bermuda as Category 1 Hurricane | Virgin Islands News Online", "date": "2024-08-23 15:30", "url": "http://www.virginislandsnewsonline.com/en/news/ernesto-heading-toward-bermuda-as-category-1-hurricane", "domain": "virginislandsnewsonline.com", "domain_classification": "Unknown", "message": "You are here: Virgin Islands News Online News » Ernesto heading toward Bermuda as Category 1 HurricaneHurricane Ernesto is expected to strengthen into a major hurricane over the coming days as it travels northwards toward Bermuda, having already left the Virgin Islands without power on Wednesday, August 14, 2024.\nPhoto: Fox News A downed utility pole in the Ridge Road area of Tortola, Virgin Islands on August 14, 2024.\nPhoto: Team of ReportersROAD TOWN, Tortola, VI- Hurricane Ernesto is expected to strengthen into a major hurricane over the coming days as it travels northwards toward Bermuda, having already left the Virgin Islands without power on Wednesday, August 14, 2024.\nIt is expected to gather strength through the coming weekend, possibly growing from a Category 1 to Category 3 hurricane.\nBy Friday night, the storm is expected to approach Bermuda as a Category 2 hurricane with winds of up to 110 mph."}, {"id": "38b03994-8546-41bd-b3bb-9f8a74cc2838", "title": "Forest Service urges Mississippians to prevent wildfires", "date": "2024-08-23 22:15", "url": "https://www.yahoo.com/news/forest-urges-mississippians-prevent-wildfires-201105141.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(WJTV) – The U.S. Forest Service is urging visitors to exercise caution while visiting national forests this weekend because most of Mississippi is abnormally dry or in a moderate to severe drought.\n“Please keep wildfire prevention in mind when visiting a national forest,” said Jay Boykin, Forest Service Fire Duty Officer.\nIf campfires or grills are allowed, keep the fire small, never leave them unattended and put it out completely before leaving.\nIf campfires are allowed, clear vegetation away from your campfire area and use a preexisting campfire ring when possible.\nMake sure your campfire is cold to the touch before leaving it."}, {"id": "b459acd1-a14b-4831-9b0f-72cd29a4ecbf", "title": "B . C . crews move to  mop up  stage on many wildfires , drought persists in the north | iNFOnews", "date": "2024-08-23 20:15", "url": "https://infotel.ca/newsitem/wildfires-bc/cp1107246496", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "crews move to 'mop up' stage on many wildfires, drought persists in the northWildland firefighters with the B.C.\nWildfire Service perform mop-up operations on the Shetland Creek wildfire's eastern flank in the area of Thompson-Nicola, B.C.\nThe BC Wildfire Service says the Shetland Creek wildfire, which had triggered evacuation orders and alerts in the southern Interior since it was first detected on July 12, is now classified as \"being held\" at about 280 square kilometres in size.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it's still an active wildfire season.\n's active blazes are classified as burning out of control."}, {"id": "85a23c51-142a-443f-bfff-9231835ac733", "title": "Residents asked to suspend irrigation as storms continue to pummel Utah", "date": "2024-08-23 00:45", "url": "https://www.ksl.com:443/article/51107430/residents-asked-to-suspend-irrigation-as-storms-continue-to-pummel-utah", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 2-3 minutesST. GEORGE — Washington County Water Conservancy District officials are asking property owners in southwest Utah to suspend all landscape irrigation for at least 48 hours to conserve water after the region was pummeled with more storms Thursday morning.\nAnother round of deep monsoon moisture entered Utah Thursday, generating some morning storms that dumped heavy rainfall throughout southwest Utah.\nWashington County Water Conservancy District officials aren't alone in calling on residents to reduce or stop irrigation because of this week's storm activity.\nThe heaviest totals are forecast for southwest Utah, where flash flooding is probable in slot canyons.\nAbout 37% of Washington County remains in moderate drought, as do parts of Garfield, Iron and Kane counties in southwest Utah."}, {"id": "f00bf6e7-0349-41ab-9672-a4609b96b634", "title": "Tropical Storm Hone forms in Pacific , could impact Hawaii this weekend", "date": "2024-08-23 01:30", "url": "https://www.cbsnews.com/news/tropical-storm-hone-pacific-ocean-hawaii/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while Hurricane Gilma was a Category 2 storm at sea.\nSatellite image shows Tropical Storm Hone southeast of Hawaii on Aug. 23, 2024.\nA tropical storm watch was in place for Hawaii County, which covers the Big Island.\nMap shows expected winds from Tropical Storm Hone near Hawaii.\nThe system strengthened to tropical storm status on Sunday and has grown more powerful since then."}, {"id": "266aac3a-93e0-4cd6-b6dc-f54f02da3ba7", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 03:45", "url": "https://www.canberratimes.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "1321bd90-3a5d-4499-a2ef-4286566e488b", "title": "Experts Say NJ Likely Hasnt Seen Its Last Hurricane This Year", "date": "2024-08-23 23:00", "url": "https://catcountry1073.com/active-nj-hurricane-season-fall-2024/", "domain": "catcountry1073.com", "domain_classification": "Unknown", "message": "According to the experts, hurricane season in the Atlantic ocean lasts from June 1 to November 30.\nvia GIPHYNJ likely to see more hurricanes come fall 2024In South Jersey, these storm surges and lead to some pretty insane flooding.\nThey're already calling the 2024 hurricane season \"above-average,\" stating that we likely haven't seen the last of them for the year.\nIf the experts are to be believed, we might have another gnarly hurricane or two still to come.\nThe complete list of names for the 2024 Atlantic Hurricane Season Gallery Credit: Dan Zarrow"}, {"id": "d9d5ed1e-d544-4f12-8d16-d09582e650de", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:30", "url": "https://isp.netscape.com/news/story/0001/20240822/6b4707ad7414e75ed430bef6ec46b156", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone forms in the central Pacific Ocean, Gilma still a Category 3 hurricaneHONOLULU (AP) — Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph (65 kph) and was centered about 1,090 miles (1,760 kilometers) east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph).\nGilma was trailing behind Hone, located about 1,980 miles (3,185 kilometers) east of Hilo and moving west-northwest at 7 mph (11 kph).\nThe system strengthened to tropical storm status on Sunday and has grown more powerful since then."}, {"id": "57dd76c3-72bb-4d43-bbc6-d43170a6eedc", "title": "The potential for flooding increases through the weekend", "date": "2024-08-23 15:15", "url": "https://www.wmnf.org/the-potential-for-flooding-increases-through-the-weekend/", "domain": "wmnf.org", "domain_classification": "Unknown", "message": "New rains are expected to add insult to injury for water-logged parts of southwest Florida after Debby caused extensive flooding in the area.\nA stalled front draped across the state is creating a steady stream of rain and some tropical downpours across southwest Florida for the next several days.\nWidespread downpours that develop have the potential to bring in more flooding rains.\nCity staff is monitoring the rainfall and water levels as thunderstorms move through the area.\nLate this weekend, the typical summer weather pattern returns with morning sunshine, hot afternoons, and a round of late-day thunderstorms."}, {"id": "87fa3389-2679-4029-8b81-2e830cef8baa", "title": "Mississippi sees increase of wildfires due to dry conditions", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/mississippi-sees-increase-wildfires-due-235616803.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(WJTV) – Officials with the Mississippi Forestry Commission (MFC) said parts of Mississippi are experiencing an abnormally dry period.\nState Forester Russell Bozeman said this is the time of year the state begins to see a fall drought pattern.\nSo, we’ve seen a lot of forest health issues since the drought last year.\nSo all this year, we’ve dealt with with beetle problems, caterpillar problems, fungus problems, all kinds of forest health issues that we’ve been seeing out in the forest.\nSo if we end up into an extended drought period, then we could continue to see tree and tree health issues,” he explained."}, {"id": "cb3ced02-9a49-4944-825a-8e5794a534a0", "title": "Triple hurricane threat meandering toward Hawaii", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/triple-hurricane-threat-meandering-toward-000739662.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One of the main features that can impact tropical storm strength is the abundance of warm sea surface temperatures in the Gulf of Mexico.\n*Hurricane Gilma IR satellite imagery*Currently there are three tropical systems lined up in the Pacific Ocean slowly moving towards our 50th state.\nAs of Thursday, Aug. 22, the National Hurricane Center (NHC) has upgraded the furthest-west system to Tropical Storm Hone.\nTropical systems, storms, and hurricanes are no stranger to the Pacific Ocean but they don’t often directly impact Hawaii.\nHurricane Gilma, about a week away from any Hawaiian impacts, continues to spin and strengthen in the Pacific Ocean."}, {"id": "d9005c60-9f56-4ec4-a8f8-8d5e0c7122a1", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "b56bd111-da90-478d-a73c-50c4577a814c", "title": "Light earthquake , 4 . 4 mag was detected near Sola in Vanuatu", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-4-mag-was-detected-near-sola-in-vanuatu-15/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 113 km NW of Sola, Vanuatu (70 miles) on Saturday.\nExact location of earthquake, longitude 166.8249 East, latitude -13.1346 South, depth = 188.424 km.\nEvent ids that are associated to the earthquake: us7000n8nd.\nId of event: us7000n8nd.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 113 km NW of Sola, Vanuatu."}, {"id": "5fec8ccd-39d5-4ae3-8abc-1b2c066ac9f6", "title": "Light earthquake , 4 . 4 mag was detected near Lata in Solomon Islands", "date": "2024-08-23 17:15", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-4-mag-was-detected-near-lata-in-solomon-islands-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Sunday, 167 km W of Lata, Solomon Islands (104 miles).\nEvent ids that are associated to the earthquake: us7000n8t0.\nId of event: us7000n8t0.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 167 km W of Lata, Solomon Islands."}, {"id": "de30fdff-2448-4a6a-bff9-2acc0ef490ab", "title": "Connecticut flooding likely to rank as nation 21st billion - dollar disaster", "date": "2024-08-23 22:15", "url": "https://www.theday.com/state/20240823/connecticut-flooding-likely-to-rank-as-nations-21st-billion-dollar-disaster/", "domain": "theday.com", "domain_classification": "Unknown", "message": "Hurricane Debby's damage from Florida northward through New England, where her remnants caused flash flooding, should be the 20th billion-dollar disaster of the year.\nThe weekend flooding in Connecticut will most likely make it 21 billion-dollar weather disasters through the middle of this month, with plenty of 2024 still to go.\nIs there a link between our warming world and a record-breaking number of billion-dollar weather and climate disasters?\nIt can help give a clearer picture of the link between climate change and extreme weather events.\nClimate Central says over one-third of inland flood damage is due to climate change."}, {"id": "c06fe4fd-d7be-4273-a9e1-e0664b9eae9b", "title": "Light earthquake , 4 . 4 mag has occurred near Yamada in Japan", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-4-mag-has-occurred-near-yamada-in-japan-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 142 km E of Yamada, Japan (88 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us7000n8l7.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 142 km E of Yamada, Japan."}, {"id": "d7cb1b46-ff96-4d83-b112-9e45abb53728", "title": "Light earthquake 4 . 3 mag , Owen Fracture Zone region", "date": "2024-08-23 17:15", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-3-mag-owen-fracture-zone-region-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported Owen Fracture Zone region (0 miles) on Saturday.\nExact location of earthquake, 57.1015° East, 13.8088° North, depth 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Owen Fracture Zone region."}, {"id": "75eb719a-ba9a-47bb-89b9-32ada8c9f268", "title": "Light earthquake , 4 . 3 mag has occurred near Walker Lake in Nevada", "date": "2024-08-23 17:15", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-3-mag-has-occurred-near-walker-lake-in-nevada/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 20 kilometers (12 miles) from Walker Lake in Nevada on Friday.\nThe epicenter of the earthquake was roughly 5 km (3 miles) below the earth’s surface.\nId of earthquake: us7000n90a.\nEarthquake epicenter was 87 km (54 miles) from Fallon (c. 8 600 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 20 km ENE of Walker Lake, Nevada."}, {"id": "190dbef7-fa1e-45cf-a4cf-a428aca0d7d0", "title": "A year of weird and record - breaking weather : 5 things to know", "date": "2024-08-23 16:45", "url": "https://www.yahoo.com/news/weird-record-breaking-weather-5-150118433.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Here’s what you need to know about the report’s findings on last year’s climate, and what they say about the emerging state of the world.\nA world where the weather is getting far hotter and also far more strange.\nLast year was the hottest on record, with the average global temperature every month from June to December setting all-time highs.\nLast year, the AMS found that the global carbon dioxide concentration hit 420 parts per million, or 50 percent greater than preindustrial levels.\nBut climate scientists are, in general, quite concerned."}, {"id": "760b866a-537e-46f1-b6b8-994385541d61", "title": "A year of weird and record - breaking weather : 5 things to know", "date": "2024-08-23 18:30", "url": "https://www.yahoo.com/news/weird-record-breaking-weather-5-161804115.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Here’s what you need to know about the report’s findings on last year’s climate, and what they say about the emerging state of the world.\nA world where the weather is getting far hotter and also far more strange.\nLast year was the hottest on record, with the average global temperature every month from June to December setting all-time highs.\nLast year, the AMS found that the global carbon dioxide concentration hit 420 parts per million, or 50 percent greater than preindustrial levels.\nBut climate scientists are, in general, quite concerned."}, {"id": "f38490eb-23fa-4bac-95c2-df61691e7ff6", "title": "Light earthquake 4 . 1 mag , 17 km ENE of Walker Lake , Nevada", "date": "2024-08-23 17:15", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-1-mag-17-km-ene-of-walker-lake-nevada/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) has occurred on Friday, 17 kilometers (11 miles) from Walker Lake in Nevada.\nThe 4.1-magnitude earthquake was detected at 15:31:58 / 3:31 pm (local time epicenter).\nExact time and date of earthquake 23/08/24 / 2024-08-23 15:31:58 / August 23, 2024 @ 3:31 pm UTC/GMT.\nEpicenter of the event was 90 km (56 miles) from Fallon (c. 8 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 17 km ENE of Walker Lake, Nevada."}, {"id": "4612c901-8688-478a-b7cb-95f082d691e4", "title": "Light earthquake , 4 . 4 mag strikes near Lospalos in Timor Leste", "date": "2024-08-23 21:45", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-4-mag-strikes-near-lospalos-in-timor-leste-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 215 km N of Lospalos, Timor Leste (134 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact time and date of earthquake 23/08/24 / 2024-08-23 14:45:41 / August 23, 2024 @ 2:45 pm UTC/GMT.\nEach year there are an estimated 13,000 light earthquakes in the world.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 215 km N of Lospalos, Timor Leste."}, {"id": "64b8202c-7511-492b-b1d2-58bc81477d36", "title": "Officials raise serious concerns with new report on this year devastating wildfire season in Oregon :  It really important  ", "date": "2024-08-23 02:45", "url": "https://www.yahoo.com/news/officials-raise-serious-concerns-report-003000877.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials raise serious concerns with new report on this year's devastating wildfire season in Oregon: 'It's really important'The 2024 wildfire season has already been the most destructive one on record for the state of Oregon, OregonLive reported.\nSeventy-one large fires have burned more than 1.4 million acres since the 2024 wildfire season began (which, according to the Western Fire Chiefs Association, happens in mid-May).\nHistorically, the state has seen the most wildfires in September, which means that the final numbers could eclipse previous state records.\nOregon state officials stressed that people should be extra careful about fire safety this time of year and avoid accidentally starting fires.\nAlthough the conditions that have led the fires to spread are due to climate change, more than 70% of fires are started by people, according to the Oregon Wildfire Response & Recovery website."}, {"id": "cd607fb6-1581-4ae5-a18f-891021f04d08", "title": "Light earthquake : M4 . 4 quake has struck near Boston in Philippines", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-m4-4-quake-has-struck-near-boston-in-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Saturday, 6 kilometers (4 miles) from Boston in Philippines.\nDate and time of earthquake in UTC/GMT: 03/08/24 / 2024-08-03 02:19:18 / August 3, 2024 @ 2:19 am.\nThe earthquake was roughly at a depth of 88.165 km (55 miles).\nNearby country/countries, Philippines (c. 99 900 000 pop) (That might be effected).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 6 km NE of Boston, Philippines."}, {"id": "d7db5f9b-3dc0-4aa8-92ca-656d28dd90d4", "title": "The science behind climate change role in CT flood disaster", "date": "2024-08-23 11:30", "url": "http://www.thehour.com/weather/article/ct-flooding-climate-change-19717589.php", "domain": "thehour.com", "domain_classification": "Unknown", "message": "A year-to-date count of billion-dollar weather and climate disasters.\nThe weekend flooding in Connecticut will most likely make it 21 billion-dollar weather disasters through the middle of this month, with plenty of 2024 still to go.\nIs there a link between our warming world and a record-breaking number of billion-dollar weather and climate disasters?\nIt can help give a clearer picture of the link between climate change and extreme weather events.\nScientists' confidence in studies to detect the influence of global warming on a specific extreme event."}, {"id": "1aabc1ec-1567-4137-856d-53122ea2a42f", "title": "Light earthquake : M4 . 4 quake has struck near Santa Maria in Philippines", "date": "2024-08-23 17:15", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-m4-4-quake-has-struck-near-santa-maria-in-philippines-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Sunday, 59 kilometers (37 miles) from Santa Maria in Philippines.\nExact location of earthquake, 126.9786° East, 8.0548° North, depth 59.759 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake was roughly at a depth of 59.759 km (37 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 59 km E of Santa Maria, Philippines."}, {"id": "896e7aca-2baf-43b0-a156-86b9788d9343", "title": "Met Office issues Storm Lilian warning as flooding could hit united kingdom in just HOURS", "date": "2024-08-23 20:15", "url": "https://www.mirror.co.uk/news/uk-news/breaking-met-office-issues-storm-33529600", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Flooding as a result of Storm Lilian could hit within hours, forecasts have warned.\nThe Met Office has issued a yellow weather warning for rain in the South East as Lilian continues to batter the UK.\nThe warning lasts until 1pm tomorrow, bringing a dismal start to the Bank Holiday weekend for millions.\nThe Met Office warned of \"spells of rain, heavy at times\" which were \"likely to cause some travel disruption and perhaps flooding in a few places\".\nIt comes after a chaotic 24 hours in which parts of the UK were hit hard by strong winds brought about by the storm."}, {"id": "240ecb63-a8de-469d-a89f-5f33a08ab770", "title": "Technical Discussion : Dry and bright , also trending warmer through the weekend", "date": "2024-08-23 10:45", "url": "https://www.wfsb.com/page/technical-discussion-dry-and-bright-also-trending-warmer-through-the-weekend/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "The high in Bridgeport was 72°, setting a record for March 15th; previously, the record high was 65° from 1990.\n3-6″ fell in the Greater Hartford Area, as well as for inland sections of New Haven, Middlesex, and New London Counties.\nWhen it comes to temperature, it was the 9th warmest with an average temperature of 53.7° (4.2° above normal).\nFor Bridgeport, the record high for Saturday was 72 (from 1961), it was surpassed by 1 degree.\nFrom June 28th through August 12th, every day featured a high temperature at or above 80 in the Hartford Area."}, {"id": "1df7bb6d-f944-4c39-afb0-175a9ccc481d", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 15:00", "url": "https://991wqik.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "991wqik.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "5ebe44e7-77ac-4173-9d9f-fd46a3a29bad", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 15:00", "url": "https://x1015.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "x1015.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "1a29b9db-e5e6-49c0-95dc-dbfc51bbd66e", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 12:00", "url": "https://mia943.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "mia943.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ian is five times the size in terms of its extent compared to Hurricane Andrew,\" said Smith.\nHurricane-force winds for Andrew - a very tight cyclone - had a diameter of 50 miles compared to the much larger 240-mile diameter of Ian.\nBased on wind speed, Andrew was more than 200 times more powerful than Ian.\nClick HERE to see how Andrew compares to other hurricanes."}, {"id": "b964b951-e9c1-4b4d-8d58-58ff8168ea42", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 12:00", "url": "https://wjbt.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wjbt.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "aed10035-2513-4c9c-87ac-7400395a415f", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:15", "url": "https://rumba957.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "rumba957.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ian is five times the size in terms of its extent compared to Hurricane Andrew,\" said Smith.\nHurricane-force winds for Andrew - a very tight cyclone - had a diameter of 50 miles compared to the much larger 240-mile diameter of Ian.\nBased on wind speed, Andrew was more than 200 times more powerful than Ian.\nClick HERE to see how Andrew compares to other hurricanes."}, {"id": "3bf6ba45-54eb-4762-9103-c8c49ef7f3ee", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:15", "url": "https://v1015.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "v1015.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "8b18bded-ab57-4d7d-9685-24872069a5ed", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | 107 . 9 WSRZ", "date": "2024-08-23 11:15", "url": "https://wsrz.iheart.com/featured/operation-storm-watch/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wsrz.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "5ced1eec-c097-4880-a316-81a911aaf7a0", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:15", "url": "https://wccfradio.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wccfradio.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "27c57df3-d782-48d9-91a9-f40d80c2d58e", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:00", "url": "https://ctqcountry.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "ctqcountry.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "4827ef64-4d81-4560-afa3-82e4c849774c", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | 1290 WJNO", "date": "2024-08-23 11:00", "url": "https://wjno.iheart.com/featured/florida-news/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wjno.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "de42aeca-61db-4957-b561-60dbe4380ed1", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | NewsRadio WFLA", "date": "2024-08-23 11:45", "url": "https://wflanews.iheart.com/featured/florida-news/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "3f371890-f582-497f-bb4f-ab4afc593038", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:45", "url": "https://realradio921.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "realradio921.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "2b458da6-d2f8-43ab-9162-e909fb459a4a", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 10:45", "url": "https://979kissfm.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "979kissfm.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "689875a9-6553-4e68-b6ff-e0ef8837245f", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 10:45", "url": "https://933flz.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "933flz.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "4c16d552-fe79-4360-8584-35ed890f9516", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 15:30", "url": "https://xl1067.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "xl1067.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "8d0e4746-e59f-4847-a7a1-4956510d8bbf", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | 106 . 5 & 102 . 9 The Beat", "date": "2024-08-23 15:30", "url": "https://thebeatflorida.iheart.com/featured/operation-storm-watch/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "thebeatflorida.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "3d5e9a0e-2dac-444f-b187-078427dcf57e", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | 96 . 3 | 102 . 5 NewsRadio WFLA", "date": "2024-08-23 13:15", "url": "https://wflapanamacity.iheart.com/featured/florida-news/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wflapanamacity.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "238f3c26-f1f2-451e-815c-28c271aeb87e", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:30", "url": "https://953wdae.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "953wdae.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "b3cbd111-5aa0-4a3f-83ae-1cdc4c47f7a0", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:30", "url": "https://big1059.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "big1059.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "923427b8-a6a9-4449-af31-c4518c9855f0", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:30", "url": "https://1230thegambler.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "1230thegambler.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "5b33e0fc-e1a2-447d-b808-3175255e54dc", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 11:30", "url": "https://gatorrocks.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "gatorrocks.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "f51018b7-87f2-4305-b0fd-89dcee2fc2c5", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 13:45", "url": "https://whnz.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "whnz.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "bd1b1db6-ff3f-4b19-b6e7-084ae628c13b", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer", "date": "2024-08-23 13:45", "url": "https://beat1053.iheart.com/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "beat1053.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "4a1ce2d9-468c-40c9-a58f-861178334897", "title": "32 Years Ago : Hurricane Andrew , The Life Changer & Life Claimer | 100 . 7 WFLA", "date": "2024-08-23 16:15", "url": "https://wflafm.iheart.com/featured/florida-news/content/2024-08-23-32-years-ago-hurricane-andrew-the-life-changer-life-claimer/", "domain": "wflafm.iheart.com", "domain_classification": "Unknown", "message": "Do you remember where you were when Hurricane Andrew hit?\nThe Bahamas and Louisiana felt it, but South Florida took a direct hit.\nAndrew slowly attacked other areas to the north, hitting Fort Myers and the Gulf Coast, with storm warnings expanding from Mississippi to Louisiana.\nDuring the time, President Bush declared South Florida a federal disaster area, and with good reason.\nAndrew:Completely destroyed more than 63,500 homes, damaged an additional 124,000 homes, caused $26.5 billion in damages and killed 65 people in its path."}, {"id": "3d80416d-d784-4ee2-a683-163e63b76204", "title": "US weather forecast : Tropical Storm Hone , Hurricane Gilma are coming . Check predictions", "date": "2024-08-23 22:15", "url": "https://article.wn.com/view/2024/08/23/US_weather_forecast_Tropical_Storm_Hone_Hurricane_Gilma_are__m/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Answer for your question of the article will be displayed here ..."}, {"id": "73e22131-d4ff-4e92-ae52-0c1701f2156d", "title": "Biden approves disaster declaration to aid cleanup following Missoula windstorm", "date": "2024-08-23 22:30", "url": "https://www.yahoo.com/news/biden-approves-disaster-declaration-aid-215017363.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The homeowner said the man with the chainsaw is a volunteer who just showed up to help after the windstorm in Missoula blew down trees and power lines.\nGreg Gianforte’s request for a major disaster declaration that followed the straight-line wind even on July 24 that caused damage across Missoula and left many without power for several days.\n“We will continue to come alongside our communities as they respond and recover from the major windstorm,” Gianforte said in a statement.\nThunderstorms and near-hurricane-force winds blew through the two counties, causing damage and downed trees and power lines across the city of Missoula and both counties.\nThis is the second major disaster declaration Biden has agreed to for Montana this year."}, {"id": "584ec711-2e59-42d2-b128-09acbd51b43a", "title": "A robot attempt to get a sample of the melted fuel at Japan damaged nuclear reactor is suspended", "date": "2024-08-23 15:15", "url": "https://www.yahoo.com/news/robots-attempt-sample-melted-nuclear-041105578.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A robot's attempt to get a sample of the melted fuel at Japan's damaged nuclear reactor is suspendedThis photo provided by the Tokyo Electric Power Company Holdings shows what they call a \"Telesco-style\" extendable pipe robot on July 10, 2024.\n(TEPCO via AP)TOKYO (AP) — An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "5675caba-9a7d-4153-8323-c436ab673305", "title": "Katrina Wake - up Call : The Urgency of Climate Action Now - The Sacramento Observer", "date": "2024-08-23 11:30", "url": "https://sacobserver.com/2024/08/katrinas-wake-up-call-the-urgency-of-climate-action-now/", "domain": "sacobserver.com", "domain_classification": "Unknown", "message": "But as extreme weather events continue to intensify, driven by climate change, the stakes couldn’t be higher.\nAnd while climate change threatens everyone, its effects are not felt equally.\nThe success of the IRA has shown us that we can make meaningful progress on climate change, but we cannot afford to slow down.\nWe must continue to advocate for policies that are equitable, just, and grounded in the needs of the communities most impacted by climate change.\nIt’s about whether we have the courage to build a more resilient, equitable, and sustainable future for all."}, {"id": "129431eb-2166-4174-9aee-2a1ccc54be76", "title": "Reports Highlight Compounding Impacts , Costs of Extreme Weather Events", "date": "2024-08-23 01:15", "url": "https://www.enr.com/articles/59168-reports-highlight-compounding-impacts-costs-of-extreme-weather-events", "domain": "enr.com", "domain_classification": "Unknown", "message": "Earlier this month, the National Oceanic and Atmospheric Administration predicted that the 2024 Atlantic hurricane season could rank “among the busiest on record,” as climate change continues to cause more extreme weather events.\nWith the number of such events caused by warming ocean temperatures and other climate change set to grow, costs also wiil rise—in some cases exponentially.\nMost existing building codes now focus on preventing loss of life, not restoring functionality, says Maria Lehman, past president of ASCE and vice chair of the National Infrastructure Advisory Council.\nEfforts are underway to quantify true costs in a more holistic way, by the federal standards agency, the World Bank and others.\nLehman points to a recent GHD study that found widespread—although uneven—support across generations in several countries to address climate change and reduce carbon emissions."}, {"id": "026c9752-a70a-4a10-9e79-71765737d15d", "title": "Flooding : Is it time to stop living in basements ? ", "date": "2024-08-23 00:00", "url": "https://theconversation.com/flooding-is-it-time-to-stop-living-in-basements-237189", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "And that doesn’t take into account the largely overlooked human and social consequences on our communities of flooding.\nFrom cellars designed to store coal, to basements converted into living environmentsIn the past, cellars were dark, damp, utilitarian spaces designed to store coal and other provisions.\nThe use of basements as living spaces has become a particularly popular practice in Québec, but also elsewhere in northeast North America.\nReducing the damage caused by flooding requires a multidimensional approach, combining short-term prevention measures with in-depth action.\nBy taking action, we will be helping to reduce inequalities and ensure a better living environment for all."}, {"id": "e6fb4d40-7f95-4e02-a1c0-2e67b36a541a", "title": "The Gulf of Mexico is blazing hot , but hurricane season is ominously quiet", "date": "2024-08-23 23:15", "url": "https://www.yahoo.com/news/gulf-mexico-blazing-hot-hurricane-224750860.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Gulf of Mexico is blazing hot, but hurricane season is ominously quietStorm surge pushes water past wind swept palm trees along the Gulf of Mexico, in Horseshoe Beach, Fla., on Aug. 5.\nThe Gulf of Mexico is blazing hot, but hurricane season — temporarily, at least — has hit a lull, a surprise to researchers who see plenty of ingredients brewing in the Atlantic but no storms on the radar.\nHurricane season begins June 1 and ends Nov. 30.\nHurricane scientists predicted a record hurricane season this year, and it got off to a record-setting start when Hurricane Beryl became the first Category 4 storm to form in the Atlantic Ocean in June.\nThe unofficial peak of hurricane season is Sept. 10."}, {"id": "442b455d-7cbc-404a-b485-4cb85b8c20af", "title": "Hot water , bigger storms : What the future of Florida clam industry ? ", "date": "2024-08-23 11:30", "url": "https://www.tampabay.com/life-culture/food/2024/08/23/hot-water-bigger-storms-whats-future-floridas-clam-industry/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "It’s forcing many in Cedar Key’s small but robust aquaculture industry to reassess their livelihoods.\nMost clam farmers say they’re here to stay.\nIn Tampa Bay, it’s common to see Cedar Key clams on restaurant menus and for sale at seafood markets.\nThe area includes Cedar Key and the cluster of islands that make up the Cedar Keys National Wildlife Refuge.\nResidents in Cedar Key awoke to massive storm surge, which in some areas had swelled to 7 feet."}, {"id": "ce83b751-386f-4804-9142-065c75cde3e6", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:45", "url": "https://www.bunburymail.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "fd277eaa-3fbf-4ec9-bd1e-efa799f50f89", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:30", "url": "https://www.hawkesburygazette.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "6b6627ea-64d9-43a1-8a95-26d36870df2d", "title": "The Gulf of Mexico is hot , but hurricane season is ominously quiet", "date": "2024-08-23 23:15", "url": "https://www.nbcnews.com/science/environment/gulf-mexico-hot-hurricane-season-ominously-quiet-rcna168040", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "The Summary Despite high ocean temperatures, hurricane season has hit a lull.\nThe Gulf of Mexico is blazing hot, but hurricane season — temporarily, at least — has hit a lull, a surprise to researchers who see plenty of ingredients brewing in the Atlantic but no storms on the radar.\nHurricane season begins June 1 and ends Nov. 30.\nHurricane scientists predicted a record hurricane season this year, and it got off to a record-setting start when Hurricane Beryl became the first Category 4 storm to form in the Atlantic Ocean in June.\nThe unofficial peak of hurricane season is Sept. 10."}, {"id": "20e3edf1-d040-4f4d-9bb9-dc08cc268cd6", "title": "Which Mississippi counties are under a burn ban in 2024 ? ", "date": "2024-08-23 22:15", "url": "https://www.yahoo.com/news/mississippi-counties-under-burn-ban-194657312.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Which Mississippi counties are under a burn ban in 2024?\n(WJTV) – As dry conditions persist in Mississippi this year, some counties have been placed under burn bans.\nAccording to the Mississippi Forestry Commission (MFC), the following counties were placed under burn bans:Adams County – Aug. 5 to Sept. 5, 2024Franklin County – Aug. 23 to Sept. 23, 2024Noxubee County – Aug. 23 to Sept. 23, 2024Winston County – Aug. 22 to Sept. 5, 2024Burn bans are restrictions on outdoor burning during drought or wildfire conditions.\nMississippi sees increase of wildfires due to dry conditionsThe local sheriff’s department enforces burn bans, according to MFC officials.\nExemptions from a Burn BanMississippi Forestry Commission Certified Burn Managers County Fire Services Commercial contractors with heavy construction equipment, providing that said burn meets Mississippi Department of Environmental Quality (MDEQ) regulations."}, {"id": "cd13d8e8-8bfe-4644-be35-c40041c18227", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.yasstribune.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=14264", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "efb5027f-1125-47ce-a431-af012a60de5a", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:45", "url": "https://www.manningrivertimes.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=9397", "domain": "manningrivertimes.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "3f519641-219c-4f64-93bb-a44fa015b7fb", "title": "Storm Lilian live updates : Leeds Festival closes two stages as Storm Lilian brings strong wind to united kingdom ", "date": "2024-08-23 12:15", "url": "https://www.bbc.co.uk/news/live/cj62x92n7kgt", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "'Worst day ever', says Leeds Festival goer\"It's honestly really bad here,\" says a Leeds Festival attendee whose tent has been destroyed by Storm Lillian.\n\"The fabric ripped open and leaked the whole tent with the rain,\" says Carrie Gill, 19, a university student who says she was told to leave the area by festival organisers.\n\"All our stuff is in our mates' tent, phones on 30%, all the stores have blown over, the urinal walls are gone and lads are just pissing against fences, people's tents are in the sky,\" she says.\nGill has spent £60 on a replacement tent, but it's still too windy to put it up so she's waiting in a nearby McDonald's.\n\"As you can imagine being a student, it's quite an expensive festival to be going to and to be let down like this,\" she says, \"it's the worst day ever.\""}, {"id": "3e7230b8-96cf-407a-98d5-ec9554b2f122", "title": "Flooding brings boom in mosquitoes for Bamberg County", "date": "2024-08-23 01:30", "url": "https://www.wrdw.com/2024/08/22/flooding-brings-boom-mosquitoes-bamberg-county/", "domain": "wrdw.com", "domain_classification": "Unknown", "message": "BAMBERG, S.C. (WRDW/WAGT) - Bamberg County officials say there has been an increase in mosquitoes because of flooding from Tropical Storm Debby.\nThen Debby dumped more rain than many people can remember, bringing standing water in places like Screven and Bamberg counties.\n“Using dirt or cement to fill in low places such as tire ruts or puddles is important to prevent those areas from accumulating storm water.\nThere are at least 61 different species of mosquitoes in South Carolina, but fortunately not all of them bite people, Evans said.\nOnce this water finally recedes, it’s advised to tip and toss any remaining standing water in buckets or any outdoor containers."}, {"id": "063404b8-22e4-411b-a9c6-142a5ea799a9", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 00:00", "url": "https://lethbridgeherald.com/news/world-news/2024/08/22/tropical-storm-hone-forms-in-the-central-pacific-ocean-gilma-still-a-category-3-hurricane/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone forms in the central Pacific Ocean, Gilma still a Category 3 hurricaneBy The Associated Press on August 22, 2024.\nThis satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\n(NOAA via AP) This satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\n(NOAA via AP)MEXICO CITY (AP) – Tropical Storm Hone has formed in the central Pacific Ocean, forecasters said, on a path that may cross near Hawaii’s Big Island.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph)."}, {"id": "13722dba-478a-448a-87f0-ca914cff4b2d", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:15", "url": "https://www.hawaiipublicradio.org/local-news/2024-08-22/tropical-storm-hone-central-pacific-ocean-gilma-hurricane", "domain": "hawaiipublicradio.org", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaiʻi Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph and was centered about 1,090 miles east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph.\nGilma was trailing behind Hone, located about 1,980 miles east of Hilo and moving west-northwest at 7 mph.\nHurricane-force winds extended outward up to 35 miles from the center of Gilma and tropical-storm-force winds extended outward up to 115 miles, the National Hurricane Center in Miami said."}, {"id": "d5454eb7-1b94-47f9-9816-3cd48b56b040", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Examiner", "date": "2024-08-23 05:45", "url": "https://www.examiner.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "aabe4872-84cb-4a6d-ae07-d5f805f4ee55", "title": "Parishes respond with prayer , outreach amid historic Northeast floods", "date": "2024-08-23 13:45", "url": "http://www.thebostonpilot.com/article.php?ID=198009", "domain": "thebostonpilot.com", "domain_classification": "Unknown", "message": "Two women in the town of Oxford drowned as rescuers tried to save them.\nA volunteer staffer at St. Thomas the Apostle Parish in Oxford told OSV News that while the church buildings were intact, \"a lot of people here\" in the parish \"did get hit\" by the flooding.\nThe priest told OSV News the parish's two churches \"are on high ground\" and did not sustain any damage.\nOn its Facebook page, St. Thomas the Apostle invited those affected to contact the parish for help.\nLord, please be with everyone waiting to be rescued, keep them safe, and bring help to them soon,\" read the prayer."}, {"id": "ed0ab87d-c508-41b9-80d3-979246b8d9c9", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:00", "url": "https://krcgtv.com/news/nation-world/tropical-storm-hone-forms-in-the-central-pacific-ocean-gilma-still-a-category-3-hurricane", "domain": "krcgtv.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph (65 kph) and was centered about 1,090 miles (1,760 kilometers) east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph).\nGilma was trailing behind Hone, located about 1,980 miles (3,185 kilometers) east of Hilo and moving west-northwest at 7 mph (11 kph).\nHurricane-force winds extended outward up to 35 miles (56 kilometers) from the center of Gilma and tropical-storm-force winds extended outward up to 115 miles (185 kilometers), the National Hurricane Center in Miami said."}, {"id": "a256b5ad-1810-41d4-9c4e-712878a322fa", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 00:45", "url": "https://www.thesunchronicle.com/news/nation_world/tropical-storm-hone-forms-in-the-central-pacific-ocean-gilma-still-a-category-3-hurricane/article_9e867a82-5e08-5bad-9d38-1cb7be07c949.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "53d06b47-e232-4225-bdf2-1fbca257be32", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.newcastleherald.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "He warned of aftershocks in the next two days, saying \"there might be a cluster of aftershocks typically a little bit smaller than this one\"."}, {"id": "d323c5f3-6cb9-4cfb-8291-baaad6c844ab", "title": "Tornado - Like Waterspouts Are  More Likely  as the Mediterranean Warms", "date": "2024-08-23 13:15", "url": "https://www.insurancejournal.com/news/international/2024/08/23/789738.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "The type of weather phenomenon that may have led billionaire Mike Lynch’s yacht to sink in the Mediterranean this week is now more likely to happen as global warming has raised sea temperatures, according to climate experts.\nTornado-like events are not uncommon in Italian waters during the late summer, as sea temperatures are at their warmest levels, but this year has been exceptionally hot.\nThe Mediterranean broke the record for its highest ever daily mean sea surface temperature with 28.47C (83.2 F) on Aug. 15.\nA University of Barcelona study of areas around the Balearic Islands found waterspouts are more likely in warmer waters.\nYet extreme weather events are becoming more frequent and intense across the region as global temperatures continue to increase."}, {"id": "963af4b8-73ac-41e5-9663-ede15d412dc1", "title": "Montreal - area mayors say Quebec government has not delivered on promised flood relief | iNFOnews", "date": "2024-08-23 20:15", "url": "https://infotel.ca/newsitem/que-flooding-mayors/cp635249498", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "The Communauté métropolitaine de Montréal (CMM), which represents 82 municipalities, says there has been no meaningful change to the program if sewer backups located far from waterways are not included.\nPeople living on certain streets have been told they're eligible for financial aid, he said, while residents of other streets have been told they're out of luck.\nBut the site also says homeowners are only eligible for assistance for sewer backups \"if a nearby waterway overflowed.\"\nAlain Mailhot, a professor of urban hydrology at Quebec's national scientific research institute, said it doesn't make sense to compensate people for sewer backups only if they live close to a river.\nIn a press release, the group requested that sewer backups caused by \"urban runoff\" during episodes of heavy rain be eligible for government aid."}, {"id": "e28d478d-d660-4e8f-aff9-d1abb1e7bfbe", "title": "County officials identify what behind chronic flooding in Security - Widefield", "date": "2024-08-23 00:15", "url": "https://krdo.com/news/2024/08/22/county-officials-identify-whats-behind-chronic-flooding-in-security-widefield/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "EL PASO COUNTY, Colo. (KRDO) - After years of flooding in Security-Widefield, El Paso County Officials say they're working on a study to determine the root of the issue in infrastructure to prevent further flooding.\nJack Ladley, the Director of Public Works for El Paso County, says that the issue stems from 50 to 100-year-old infrastructure in the southeast part of El Paso County.\nHowever, completing the study isn't the only problem facing county officials.\n\"Once we have an idea of how we want to address this, then of course it becomes a funding issue,\" Ladley said.\n\"When you identify a problem or you see a problem, call us, and let us know [at] 719-520-6460."}, {"id": "060df581-a12e-4927-ae7d-8278d1dd6f69", "title": "B . C . wildfires trending into the  held  and mop - up stages - The Chilliwack Progress", "date": "2024-08-23 23:30", "url": "https://www.theprogress.com/news/bc-wildfires-trending-into-the-held-and-mop-up-stages-7501446", "domain": "theprogress.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says the Shetland Creek wildfire, which had triggered evacuation orders and alerts in the southern Interior since it was first detected on July 12, is now classified as “being held” at about 280 square kilometres in size.\nThe service says many fires are in the “mop-up” stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it’s still an active wildfire season.\nJust under 100 of B.C.’s active blazes are classified as burning out of control.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "59ba588b-d5f2-48e5-b700-2980267b3e57", "title": "B . C . wildfires trending into the  held  and mop - up stages - The Williams Lake Tribune", "date": "2024-08-23 23:30", "url": "https://www.wltribune.com/news/bc-wildfires-trending-into-the-held-and-mop-up-stages-7501446", "domain": "wltribune.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says the Shetland Creek wildfire, which had triggered evacuation orders and alerts in the southern Interior since it was first detected on July 12, is now classified as “being held” at about 280 square kilometres in size.\nThe service says many fires are in the “mop-up” stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it’s still an active wildfire season.\nJust under 100 of B.C.’s active blazes are classified as burning out of control.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "51c8ca99-3216-4a83-97c5-fa359db13ee6", "title": "B . C . wildfires trending into the  held  and mop - up stages", "date": "2024-08-23 23:30", "url": "https://www.hopestandard.com/news/bc-wildfires-trending-into-the-held-and-mop-up-stages-7501446", "domain": "hopestandard.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says the Shetland Creek wildfire, which had triggered evacuation orders and alerts in the southern Interior since it was first detected on July 12, is now classified as “being held” at about 280 square kilometres in size.\nThe service says many fires are in the “mop-up” stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it’s still an active wildfire season.\nJust under 100 of B.C.’s active blazes are classified as burning out of control.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "8672d102-16eb-4783-a4a2-52b1afcf6cde", "title": "Extreme climate change : NOAA reports new terminology to address", "date": "2024-08-23 16:15", "url": "http://www.mrt.com/news/article/super-marine-heatwaves-noaa-19716921.php", "domain": "mrt.com", "domain_classification": "Unknown", "message": "Creating a new language for climate change: NOAA releases a report describing a new term, \"super-marine heatwaves,\" which has never been used before.\nScientists now have a new term, “super-marine heatwaves,” which has never been used before to address rising sea surface temperatures.\nWith decades of data, NOAA released a chart highlighting the changes in sea surface temperature in waters worldwide.\nThe sea surface temperatures are collected from the uppermost layer of seawater, which typically means the top few meters, NOAA explains.\nNOAAProviding new language for the record-breaking sea surface temperatures, NOAA describes how “strong marine heatwaves” contribute to the temperature increases."}, {"id": "0d28f4db-ac2e-415e-9961-5a72c501305b", "title": "These Hurricane Supplies Are Tax Free Again", "date": "2024-08-23 22:30", "url": "https://sunny1063.com/listicle/these-hurricane-supplies-are-tax-free-again/", "domain": "sunny1063.com", "domain_classification": "Unknown", "message": "We are approaching the most active part of hurricane season, end of August into September.\nTo help out, these hurricane supplies are tax free again in Florida.\nThe list of items included is extensive and may include things you don’t typically think about when it comes to hurricane supplies.\nWhat Hurricane Supplies Are Tax Free AgainI love that lawmakers not only consider things you might need for your personal safety during and immediately following a storm like flashlights and tarps.\nThese Hurricane Supplies Are Tax Free Again Through September 6th."}, {"id": "c92be930-ebb7-49a9-97c6-e75b4786d8bf", "title": "B . C . crews move to  mop up  stage on many wildfires , drought persists in the north", "date": "2024-08-23 22:15", "url": "https://www.delta-optimist.com/bc-news/bc-crews-move-to-mop-up-stage-on-many-wildfires-drought-persists-in-the-north-9402568", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "British Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nBritish Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nThe service says many fires are in the \"mop-up\" stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it's still an active wildfire season.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "30231a6d-bb9f-46a8-9e43-af06c5b1a2b1", "title": "B . C . crews move to  mop up  stage on many wildfires , drought persists in the north", "date": "2024-08-23 19:15", "url": "https://www.nsnews.com/bc-news/bc-crews-move-to-mop-up-stage-on-many-wildfires-drought-persists-in-the-north-9402568", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "British Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nBritish Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nThe service says many fires are in the \"mop-up\" stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it's still an active wildfire season.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "2fd1ce7a-16a9-4e85-af1c-4d107eb2a6da", "title": "B . C . crews move to  mop up  stage on many wildfires , drought persists in the north", "date": "2024-08-23 19:15", "url": "https://www.squamishchief.com/bc-news/bc-crews-move-to-mop-up-stage-on-many-wildfires-drought-persists-in-the-north-9402568", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "British Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nBritish Columbia is down to just one \"wildfire of note,\" as the wildfire service says rain and cooler temperatures have helped crews turn the corner on a number of larger blazes, especially in southern parts of the province.\nThe service says many fires are in the \"mop-up\" stage, when crews move in to douse the edges of a blaze with water in order to fully contain it.\nStill, it says recent rainfall has not been enough to alleviate severe drought across many areas of the province, and it's still an active wildfire season.\nCampfires continue to be prohibited with the exception of the Prince George Fire Centre, the Haida Gwaii Forest District and the northwestern corner of B.C."}, {"id": "815ecf78-3812-4fd5-897e-8d18b805f628", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Bendigo Advertiser", "date": "2024-08-23 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "f82d342e-efee-4207-809d-2e3aa43c5ce2", "title": "Suffolk County storm damage : Gov . Kathy Hochul declares Disaster Emergency after record rainfall , flooding", "date": "2024-08-23 18:45", "url": "https://abc7ny.com/post/suffolk-county-storm-damage-gov-kathy-hochul-declares-disaster-emergency-after-record-rainfall-flooding/15223009/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Hochul declares Disaster Emergency for Suffolk County after torrential floodingThe major storm event resulted in severe flooding to homes, businesses and institutions, damaged roads and caused the breach of two local dams.\n\"We are working around the clock to ensure that impacted residents and municipalities are able to rebuild after this devastating flooding event,\" Hochul said.\nThey will be deployed to the following communities:Tuesday, August 27 - Stony Brook University's Center of Excellence in Wireless and Information Technology (CEWIT), Room 343, 1500 Stony Brook Road, Stony Brook, NY 11794.\n10 a.m. - 7 p.m.Wednesday, August 28 - Stony Brook University's Center of Excellence in Wireless and Information Technology (CEWIT), Room 343, 1500 Stony Brook Road, Stony Brook, NY 11794.\nInformation on Homeowners' Insurance - Additional information can be found at the Homeowners Resource Center on the Department of Financial Services' website."}, {"id": "5299ee60-ed76-4931-b474-c6de41537b7e", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Advocate", "date": "2024-08-23 04:15", "url": "https://www.theadvocate.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "theadvocate.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "897e3a9e-42b7-4ac6-987c-3c2aa2e340d1", "title": "Afghanistan Urges Foreign Organizations To Resume Work On Environmental Projects", "date": "2024-08-23 23:30", "url": "https://menafn.com/1108595314/Afghanistan-Urges-Foreign-Organizations-To-Resume-Work-On-Environmental-Projects", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The National Environmental Protection Agency (NEPA) of Afghanistan said on Tuesday that it had urged international organizations to resume work on 32 small and large environmental projects.\n“The international community should not politicize environmental issues.\nThe National Environmental Protection Agency observed that several concerns, including deforestation, drought, flooding, and climate change, have contributed to environmental problems in the country.\nThe environmental protection agency also called on the people and companies to fight against plastic pollution and reduce their production and use.\nDecades of war and conflict have been one of the factors that created several environmental issues in Afghanistan."}, {"id": "70f99301-66eb-40a7-a393-c6073856eef5", "title": "Former Mississippi Gov . Haley Barbour reflects on Coast resiliency after Hurricane Katrina", "date": "2024-08-23 01:45", "url": "https://www.wlox.com/2024/08/22/former-mississippi-gov-haley-barbour-reflects-coast-resiliency-after-hurricane-katrina/", "domain": "wlox.com", "domain_classification": "Unknown", "message": "GULFPORT, Miss.\n(WLOX) - Haley Barbour says while he and other state leaders were boots on the ground in the days, weeks, and months after Hurricane Katrina, he also credits South Mississippi residents for “hitching up their britches” and getting to work in the storm’s aftermath.\nIt’s a standing room only crowd listening to former Ms.\nGovernor Haley Barbour at the GCBC meeting in Gulfport.\npic.twitter.com/d4RDQYGpWs — Bill Snyder (@BillSnyderWLOX) August 22, 2024The former Mississippi Governor spoke about Katrina’s looming 19th anniversary to members of the Gulf Coast Business Council Thursday."}, {"id": "e7abcb6c-1149-41cc-9cb7-343c32ff2f4c", "title": "Long Island business owners ask for federal relief after devastating flooding", "date": "2024-08-23 00:30", "url": "https://www.fox5ny.com/news/long-island-business-owners-ask-federal-relief-after-devastating-flooding", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Business owners on Long Island are still reeling from the aftermath of the historic flooding that ravaged their community on Sunday.\nThe flooding has left many business owners facing a financial nightmare, with damages running into the hundreds of thousands of dollars.\n\"We need state funding, we need federal funding, like, we don't need help for the future.\nHowever, Suffolk County is yet to hear back from state and federal officials, something residents say is frustrating.\nFOX 5 NY reached out to Senator Chuck Schumer to find out if the federal government will step in to help the affected business owners and residents."}, {"id": "0dd3cbdd-ccbf-4a0c-8e2b-595b8eebd404", "title": "Earthquake hits Hunter region , Newcastle residents feel tremors | Manning River Times", "date": "2024-08-23 04:45", "url": "https://www.manningrivertimes.com.au/story/8740134/earthquake-hits-hunter-region-newcastle-residents-feel-tremors/?cs=305", "domain": "manningrivertimes.com.au", "domain_classification": "Unknown", "message": "Reports flooded in of the quake being felt across the region - and as far away as Tamworth, Mudgee and the Central Coast - at about midday on August 23."}, {"id": "2d8e606b-783c-4293-bd33-7118246ed5c6", "title": "First responders supporting each other after Oxford floods", "date": "2024-08-23 23:15", "url": "https://www.yahoo.com/news/first-responders-supporting-other-oxford-205340112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "First responders supporting each other after Oxford floodsOXFORD, Conn. (WTNH) — Connecticut first responders opened up on Friday about their physical and mental health following last weekend’s flash flooding.\n“Long days, long nights, no sleep,” Oxford Assistant Fire Chief Daniel Gramigna said.\nGramigna said firefighters faced raging water, multiple rescues and the deaths of two women swept away from flash flooding.\nIn Beacon Falls, leaders said that firefighters responded to countless calls throughout the region, and already have a program in place to address physical and mental health.\n“We try to be there for each other and make sure that everyone is aware of the mental health aspects,” Rodorgio said."}, {"id": "cbbfd37e-0cb9-4f98-920d-e748c2f56aeb", "title": "When Storm Lilian will end in County Durham and Darlington", "date": "2024-08-23 08:45", "url": "https://www.thenorthernecho.co.uk/news/24537197.storm-lilian-will-end-county-durham-darlington/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Storm Lilian, the latest named storm of the year, has brought strong wings across the North East and much of Yorkshire as people opened their curtains this morning.\nThe warning, which was in force from 5am on Friday is due to end at 11am.\nMet Office Chief Meteorologist Jason Kelly said: “Storm Lilian will bring some potentially damaging gusts during Friday morning, with gusts widely in the 50-60mph range, with the possibility of some gusts in excess of 75mph in a few places.\n“There’s associated rainfall with Lilian that has also resulted in a Met Office warning for parts of Scotland.\nWithin the warning area, another 50mm of rain is possible over high ground, with 20-30mm falling quite widely."}, {"id": "bf9294ca-8977-4fbd-a47d-829b4fb2386b", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Wellington Times", "date": "2024-08-23 07:00", "url": "https://www.wellingtontimes.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "wellingtontimes.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "bb14e48c-2da5-43eb-8f11-1abeb6530bbb", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Eastern Riverina Chronicle", "date": "2024-08-23 05:45", "url": "https://www.easternriverinachronicle.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "easternriverinachronicle.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "55c86cbb-c33c-491c-982a-731289d25542", "title": "Lake Manatee dam cannot hold anymore water as rain causes flooding to continue", "date": "2024-08-23 00:00", "url": "https://www.abcactionnews.com/news/region-sarasota-manatee/lake-manatee-dam-cannot-hold-anymore-water-as-rain-causes-flooding-to-continue", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. — Manatee County has continuously seen heavy bands of rain since Tuesday.\nOn Wednesday evening, residents downstream from Lake Manatee Dam heard the sirens and flooding quickly followed.\nManatee County officials responded with their own Facebook post letting residents know they were trying to manage water levels at the dam and were aware of the flooding.\n“The dam and Lake Manatee continue to function as designed.\nIt is just a situation where we have no ability to store any additional water in Lake Manatee.”"}, {"id": "a9c4570a-92b4-454c-8aca-c0adb1030b45", "title": "Earthquake hits Hunter region , Newcastle residents feel tremors | Newcastle Herald", "date": "2024-08-23 05:00", "url": "https://www.newcastleherald.com.au/story/8740134/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Reports flooded in of the quake being felt across the region - and as far away as Tamworth, Mudgee and the Central Coast - at about midday on August 23."}, {"id": "b5b96558-067b-41d4-adc6-621db043f74f", "title": "Monsoon moisture surges northward at end of workweek", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/monsoon-moisture-surges-northward-end-233648694.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Flash flooding and the risk for a few strong to severe storms for portions of Utah as we head into the weekend.\nAs we round out the work week we’ll see another surge of monsoonal moisture stream into the state.\nWe’ve already seen heavy rain and thunderstorms this morning in portions of southern Utah, leading to a Flash Flood Warning in Washington County.\nThe main focus for storm development will remain in central and southern Utah, but isolated storms will be possible for the Wasatch Front and Cache Valley later Thursday evening.\nThe cold front will likely stall over the state, bringing cooler temperatures and strong winds on Saturday, though not as intense as on Friday."}, {"id": "6a064372-3df6-4d96-8641-12928aa41326", "title": "Shower and storm chance continues into the weekend", "date": "2024-08-23 13:15", "url": "https://cbs12.com/news/local/weather-forecast-august-23-2024-west-palm-beach-south-florida-treasure-coast-shower-and-storm-chance-continues-into-the-weekend", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "Humid conditions continue through the morning with temperatures quickly heating into the lower 90s today.\nAn onshore wind flow will return to the area today, helping to push showers and storms inland by the evening.\nStill, as the sea breeze moves onshore around lunchtime, a few showers and isolated storm will develop.\nBy the weekend a weak tropical wave will move into the region and linger through early next week.\nThis paired with an onshore wind flow will mean a higher shower chance during the morning hours at the coast with a few stronger storms moving inland through the afternoon."}, {"id": "2563f52b-6002-466a-8803-089add8d6056", "title": "The science behind climate change role in CT flood disaster", "date": "2024-08-23 11:15", "url": "http://www.middletownpress.com/weather/article/ct-flooding-climate-change-19717589.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "A year-to-date count of billion-dollar weather and climate disasters.\nThe weekend flooding in Connecticut will most likely make it 21 billion-dollar weather disasters through the middle of this month, with plenty of 2024 still to go.\nIs there a link between our warming world and a record-breaking number of billion-dollar weather and climate disasters?\nIt can help give a clearer picture of the link between climate change and extreme weather events.\nScientists' confidence in studies to detect the influence of global warming on a specific extreme event."}, {"id": "97ffd5c1-b713-4cc0-93ac-03f70e160853", "title": "The science behind climate change role in CT flood disaster", "date": "2024-08-23 11:00", "url": "http://www.registercitizen.com/weather/article/ct-flooding-climate-change-19717589.php", "domain": "registercitizen.com", "domain_classification": "Unknown", "message": "A year-to-date count of billion-dollar weather and climate disasters.\nThe weekend flooding in Connecticut will most likely make it 21 billion-dollar weather disasters through the middle of this month, with plenty of 2024 still to go.\nIs there a link between our warming world and a record-breaking number of billion-dollar weather and climate disasters?\nIt can help give a clearer picture of the link between climate change and extreme weather events.\nScientists' confidence in studies to detect the influence of global warming on a specific extreme event."}, {"id": "1a0b645a-9acd-4ad4-9dd5-aa7c3bb6ab33", "title": "Seymour business may be forced to close after 20 years due to flooding damage", "date": "2024-08-23 10:45", "url": "https://www.wfsb.com/2024/08/23/seymour-business-may-be-forced-close-after-20-years-due-flooding-damage/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "SEYMOUR, CT (WFSB) - More than a dozen businesses suffered thousands of dollars worth of losses from last weekend’s historic flooding.\nIn the end, it told Nilesh that $700,000 worth of his merchandise (the entire stock) must go down the drain due to fears of contamination from the severe flooding.\n“And this happened and they said they cannot do anything, so I don’t know what I have to do now,” he said.\nYou got to be here.’ But I don’t know how,” Nilesh said.\n“I want to come back, but I don’t know how right now.”Nilesh said he’s grateful."}, {"id": "8a4f96b7-00fd-4904-bb7e-8bd4885a6ab9", "title": "Jordan Ray Ramos", "date": "2024-08-23 10:30", "url": "https://www.wuft.org/people/jordanrayramos", "domain": "wuft.org", "domain_classification": "Unknown", "message": "On Wednesday, Governor Ron DeSantis detailed Florida’s emergency response plan for Hurricane Ian.\nOver 10,000 first responders are on standby.\nSome 42,000 linemen are also on standby to restore power to the 1.7 million people who have currently lost power.\n911 call centers are down in Lee, Hendry and Glade counties and those calls are being rerouted to nearby counties.\nDeSantis urges people to stay safe indoors even if it is clear because many hurricane deaths happen after the storm, due to hurricane hazards."}, {"id": "273a5932-0329-4dde-b4fe-fa1f4611e400", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Eastern Riverina Chronicle", "date": "2024-08-23 05:45", "url": "https://www.easternriverinachronicle.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=635", "domain": "easternriverinachronicle.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "6898dae4-8920-41ea-8631-10884b15191a", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Milton Ulladulla Times", "date": "2024-08-23 05:45", "url": "https://www.ulladullatimes.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "ulladullatimes.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "a940fc40-dbd4-4fa0-aec0-53f773b685c8", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Namoi Valley Independent", "date": "2024-08-23 06:30", "url": "https://www.nvi.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "nvi.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "5aaf5396-6e92-4602-ac4c-316eb5c0ebe8", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Grenfell Record", "date": "2024-08-23 07:45", "url": "https://www.grenfellrecord.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2947", "domain": "grenfellrecord.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "0916b400-f260-4450-b9e3-6dd6f20ee55c", "title": "Trump Revives - and Further Decreases - His Absurdly Low Estimate of Sea Level Rise", "date": "2024-08-23 22:30", "url": "https://www.factcheck.org/2024/08/trump-revives-and-further-decreases-his-absurdly-low-estimate-of-sea-level-rise/", "domain": "factcheck.org", "domain_classification": "Unknown", "message": "Trump’s latest sea level rise claims are even more extreme than his previous assertion, in 2019, that sea level rise would total one-eighth of an inch “within the next 250 years,” which we fact-checked at the time.\nCurrent and Projected Levels of Sea Level RiseAccording to the latest data from NASA, the current rate of global sea level rise is 4.2 millimeters, or 0.17 inches, per year.\nSea level rise has accelerated in recent years, and that trend is expected to continue.\nProjections for future sea level rise further dwarf Trump’s already low figures.\nSea level rise over the next 30 years is projected to be the same as the total rise over the past 100 years, according to the report."}, {"id": "d0b13801-19b3-4661-a130-288ea6f04d8a", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Southern Highland News", "date": "2024-08-23 07:00", "url": "https://www.southernhighlandnews.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2658", "domain": "southernhighlandnews.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "b7a9d723-63fa-43db-8cf1-4f7395e86efc", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Southern Highland News", "date": "2024-08-23 07:00", "url": "https://www.southernhighlandnews.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "southernhighlandnews.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "f42b20d0-ec4b-49e0-a02c-9483836d5bca", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Irrigator", "date": "2024-08-23 07:15", "url": "https://www.irrigator.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "irrigator.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "3bd4c7b8-743f-4dd4-8c97-2b11dd6e5d54", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Blayney Chronicle", "date": "2024-08-23 07:15", "url": "https://www.blayneychronicle.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "blayneychronicle.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "25434d3d-daf1-439b-9cb1-72c046012e2a", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Blayney Chronicle", "date": "2024-08-23 07:15", "url": "https://www.blayneychronicle.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2938", "domain": "blayneychronicle.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "e380d7f3-b688-4ccf-90e3-a8cb1612241b", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Boorowa News", "date": "2024-08-23 07:30", "url": "https://www.boorowanewsonline.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "boorowanewsonline.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "c4f5077b-397a-429b-8507-57222da1fe71", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Blue Mountains Gazette", "date": "2024-08-23 07:30", "url": "https://www.bluemountainsgazette.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2696", "domain": "bluemountainsgazette.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "a7e9aeb0-799c-475c-adb6-db37ec93b2bd", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Singleton Argus", "date": "2024-08-23 10:45", "url": "https://www.singletonargus.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=6771", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "57f94a6d-771e-475b-97d0-565eb2eb1e85", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Grenfell Record", "date": "2024-08-23 07:45", "url": "https://www.grenfellrecord.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "grenfellrecord.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "2827a5f8-0fea-473a-8c63-ff9feca40964", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Redland City Bulletin", "date": "2024-08-23 07:45", "url": "https://www.redlandcitybulletin.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2678", "domain": "redlandcitybulletin.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "e5175cbf-1bce-4cc5-b3ed-b4404354ea30", "title": "10 Grim Climate Scenarios As World Prepares To Cross Dangerous Warming Tipping Point", "date": "2024-08-23 18:00", "url": "https://www.zmescience.com/ecology/climate/10-grim-climate-change-scenarios/", "domain": "zmescience.com", "domain_classification": "Unknown", "message": "The study’s most alarming projection was for the Miombo Woodlands in Central and Southern Africa, one of the priority places most vulnerable to climate change.\nDue to global warming, entire countries could be swallowed by the sea.\nHowever, according to California’s Fourth Climate Change Assessment released by the governor’s office in August 201, the Golden State’s fires will only worsen.\nDead CoralsAs the world’s largest carbon sink, our oceans bear the brunt of climate change.\nIn other words, staying under 2 degrees Celsius is increasingly unlikely, and because of that, a sustainable and equitable society stubbornly remains a distant dream."}, {"id": "9d530861-abce-499d-ab04-a5542124ce6c", "title": "Storm Lilian : British Airways cancels flights as Leeds Festival shuts two stages", "date": "2024-08-23 13:45", "url": "https://www.cityam.com/storm-lilian-british-airways-cancels-flights-as-leeds-festival-shuts-two-stages/", "domain": "cityam.com", "domain_classification": "Unknown", "message": "Storm Lilian: British Airways cancels flights as Leeds Festival shuts two stagesScreenshot taken from a video with permission from the social media site X, formerly Twitter, posted by @decomcfc of the campsite at Leeds Festival.\nTwo stages at Leeds Festival have closed for the day due to high winds caused by Storm Lilian.\nAt least 16 British Airways flights from Heathrow have reportedly already been cancelled on Friday due to Storm Lilian.\nThis is how the wind is affecting campers at Leeds Festival this morning.\nStorm Lilian is named after Anglo-Irish journalist and pioneering aviator Lillian Bland, who was the first woman in Ireland to build and fly an aircraft, according to Met Eireann."}, {"id": "888c4cd6-5811-4c00-af2e-86574cf22f6d", "title": "Kyodo News Digest : Aug . 23 , 2024", "date": "2024-08-23 01:30", "url": "https://english.kyodonews.net:443/news/2024/08/b00e02bbaf99-kyodo-news-digest-aug-23-2024--1-.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 9 hours ago - 23:00 | All, World, JapanThe following is the latest list of selected news summaries by Kyodo News.\nBased on the concept of a \"park in Ginza,\" it features numerous open spaces, including an atrium, to create a sense of openness.\nKono, long viewed as a political maverick, was defeated by Kishida, the current LDP chief and prime minister, in the previous election in 2021.\nMainland China views Taiwan as part of its territory and opposes attempts to undermine its territorial sovereignty.\nHe is believed to have posted an image of the graffiti on Chinese social media, according to the sources."}, {"id": "3ccbdd52-3ac8-4063-b4e8-2640bd88f28c", "title": "Manatee County addresses dam speculation", "date": "2024-08-23 00:30", "url": "https://www.mysuncoast.com/2024/08/22/manatee-county-addresses-dam-speculation/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. (WWSB) - Sirens were blaring in Manatee County after another night of road closures and flooded yards around the Manatee Dam.\nBut Deputy County Administrator Evan Pilachowski tried to quiet any speculation surrounding the dam’s role in the flooding, denying they did an intentional release.\n“I do want to state unequivocally, that the dam in Mantee County continued to function as designed.\nThere is no risk of any sort of breach of the dam.\nNow the water that would typically be caught in the ponds flows into the dam and goes right through to the surrounding area because of the high water level of Lake Manatee."}, {"id": "69c38aa9-4ee7-4095-b6fe-b95fb4af067b", "title": "Belfast flights cancelled as Storm Lilian disrupts travel across united kingdom ", "date": "2024-08-23 15:30", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/belfast-flights-cancelled-as-storm-lilian-disrupts-travel-across-uk/a1769465616.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "People walking in wet and windy conditions brought by the storm near Tower Bridge, central London (Yui Mok/PA)Two flights between Belfast and London have been cancelled on Friday as Storm Lilian sweeps across parts of the UK.\nBritish Airways has cancelled 16 flights scheduled to take off from Heathrow on Friday and delayed others, according to the airline's website.\nThe flights between Belfast and London impacted are the 1.30pm arrival into Belfast City Airport and the 2.15pm departure leaving the Northern Irish airport for Heathrow.\nLilian is the 12th named storm of the season – the furthest the Met Office has got through the list since it was introduced - and the first since April.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said."}, {"id": "645a9a80-b23e-4831-80de-e0b3fb1ef5ba", "title": "A new age of flooding | News , Sports , Jobs - Williamsport Sun - Gazette", "date": "2024-08-23 16:15", "url": "https://www.sungazette.com/opinion/other-commentaries/2024/08/a-new-age-of-flooding/", "domain": "sungazette.com", "domain_classification": "Unknown", "message": "Lycoming County was not alone.\nRight here in Lycoming County.\nBut now, the hydro-bomb that exploded on Trout Run points to a whole new era of intensified flooding on the horizon.\nTim Palmer is the author of Seek Higher Ground: The Natural Solution To Our Urgent Flooding Crisis, as well as 30 other books.\nFrom 1972 to 1980 he served as the environmental planner for the Lycoming County Planning Commission."}, {"id": "03945195-3bc7-493c-ad6e-6668f34e5092", "title": "Dumbur reservoir row : Is anti - India rhetoric camouflaging Bangladesh shortcomings ? – Firstpost", "date": "2024-08-23 10:30", "url": "https://www.firstpost.com/opinion/flood-row-is-anti-india-rhetoric-camouflaging-bangladeshs-own-shortcomings-13807456.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Perhaps Dhaka was too preoccupied with political manoeuvres against former Prime Minister Sheikh Hasina to notice the heavy rains.\nSalehin explains that a significant factor contributing to this year’s severe flooding is the abnormal rainfall pattern.\nThe ministry said that India has three water level observation sites along the river and has been transmitting real-time flood data to Bangladesh.\nThe ministry further stressed that India is committed to resolving water resource issues and managing river water through bilateral consultations and technical discussions.\nBangladesh’s flood management challengesThe fact is, despite its annual vulnerability to floods, Bangladesh failed to prepare adequately for this disaster."}, {"id": "b967a9d3-f55e-4831-af4b-a98932474f3c", "title": "Leeds Festival campers issued urgent warning amid Storm Lilian", "date": "2024-08-23 11:15", "url": "https://www.manchestereveningnews.co.uk/whats-on/music-nightlife-news/leeds-festival-campers-issued-urgent-29795165", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSubscribe to our daily What's On newsletter to keep up with what's happening around Greater ManchesterSomething went wrong, please try again later.\nRAC Breakdown spokeswoman Alice Simpson said the adverse weather and large volume of expected trips represented “a perfect storm” for drivers.\nA Network Rail spokeswoman said: “We are closely monitoring the potential impact that the storm might have on the rail network."}, {"id": "65161cfa-ad71-4180-9231-23c97bf050e2", "title": "Southeastern services between Rainham and Sittingbourne disrupted after train hits fallen tree", "date": "2024-08-23 08:45", "url": "https://www.kentonline.co.uk/medway/news/train-damaged-after-hitting-tree-on-tracks-311819/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "Services have resumed after a train hit a tree which has fallen onto a railway line.\nThe Southeastern train suffered “significant damage” after it crashed into the tree, which had fallen onto the line, between Rainham and Newington at around 6.30am.\nThe damaged southeastern train after it hit a tree on the line.\nServices were brought to a standstill with all lines blocked between Rainham and Sittingbourne, but the line has now been cleared.\nA spokesperson for Southeastern said: \"Earlier this morning one of our trains was damaged after it struck a fallen tree between Sittingbourne and Newington."}, {"id": "11bdea22-ef1e-4a6b-89ea-c428275d9866", "title": "Storm Lilian : Met Office issues danger to life in North East", "date": "2024-08-23 08:45", "url": "https://www.thenorthernecho.co.uk/news/24537129.met-office-issues-weather-warnings-storm-lilian-hit-uk/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Storm Lilian will move northeast early on Friday morning, bringing strong winds for northern England and Wales, as well as parts of southern Scotland.\n“There’s associated rainfall with Lilian that has also resulted in a Met Office warning for parts of Scotland.\nHow to prepare for Storm LilianThe Met Office has issued advice on how to prepare for Storm Lilian and the yellow weather warnings associated with it.\nWhen a weather warning is issued, the Met Office recommends staying up to date with the weather forecast in your area.\"\nYellow weather warnings for Storm Lilian will be in place from 5am until 11am on Friday (August 23)."}, {"id": "da511f63-acec-4b5a-8b5e-2473d79628f9", "title": "Meteorologists Watching Tropical Moisture Pool in Gulf", "date": "2024-08-23 01:15", "url": "https://999ktdy.com/louisiana-tropical-moisture-gulf-of-mexico/", "domain": "999ktdy.com", "domain_classification": "Unknown", "message": "As we approach the peak of the 2024 Hurricane Season, meteorologists are on high alert and monitoring any potential disturbances in the Gulf or Atlantic.\nThis can allow for spontaneous development, and that is why some will be watching a \"Tropical Moisture Pool\" in the Gulf of Mexico.\nAnd remember, to always have a plan for this hurricane season.\nDownload the station's app in your app store and be sure to turn on notifications.\nFor those counting, hurricane season officially ends on November 30th."}, {"id": "43e33976-832e-477b-8ee0-cfbcd47911fb", "title": "Meteorologists Watching Tropical Moisture Pool in Gulf", "date": "2024-08-23 07:30", "url": "https://talkradio960.com/ixp/29/p/louisiana-tropical-moisture-gulf-of-mexico/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "As we approach the peak of the 2024 Hurricane Season, meteorologists are on high alert and monitoring any potential disturbances in the Gulf or Atlantic.\nThis can allow for spontaneous development, and that is why some will be watching a \"Tropical Moisture Pool\" in the Gulf of Mexico.\nAnd remember, to always have a plan for this hurricane season.\nDownload the station's app in your app store and be sure to turn on notifications.\nFor those counting, hurricane season officially ends on November 30th."}, {"id": "61c9f53b-5463-4dae-8f9f-094ded4f11df", "title": "Meteorologists Watching Tropical Moisture Pool in Gulf", "date": "2024-08-23 10:30", "url": "https://1079ishot.com/ixp/29/p/louisiana-tropical-moisture-gulf-of-mexico/", "domain": "1079ishot.com", "domain_classification": "Unknown", "message": "As we approach the peak of the 2024 Hurricane Season, meteorologists are on high alert and monitoring any potential disturbances in the Gulf or Atlantic.\nThis can allow for spontaneous development, and that is why some will be watching a \"Tropical Moisture Pool\" in the Gulf of Mexico.\nAnd remember, to always have a plan for this hurricane season.\nDownload the station's app in your app store and be sure to turn on notifications.\nFor those counting, hurricane season officially ends on November 30th."}, {"id": "a6e6c2fe-aefe-4646-8b46-12294e3fb5c8", "title": "Flights cancelled across united kingdom as Storm Lilian hits the country", "date": "2024-08-23 10:30", "url": "https://www.bristolpost.co.uk/news/uk-world-news/flights-cancelled-across-uk-storm-9504834", "domain": "bristolpost.co.uk", "domain_classification": "Unknown", "message": "Flights have been cancelled and drivers urged to take care as Storm Lilian sweeps across parts of the UK ahead of what could be the busiest August bank holiday on the roads on record.\nBritish Airways has cancelled 14 flights scheduled to take off from Heathrow on Friday and delayed others, according to the airline’s website.\nThe Met Office has issued a yellow weather warning for rain spanning much of South East England from 6am to 1pm on Saturday.\nLilian is the 12th named storm of the season – the furthest the Met Office has got through the list since it was introduced – and the first since April.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said."}, {"id": "d4dae549-0c0d-4925-8dfb-80a28fe0c0ca", "title": "Flights axed as Storm Lilian brings travel disruption to bank holiday weekend", "date": "2024-08-23 11:45", "url": "https://www.yorkpress.co.uk/news/national/24537428.flights-axed-storm-lilian-brings-travel-disruption-bank-holiday-weekend/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "The cancellations include international flights to Italy, Switzerland and the US as well as domestic journeys to Scotland and Northern Ireland.\nThe Met Office has issued a yellow weather warning for rain spanning much of South East England from 6am to 1pm on Saturday.\nA separate wind warning was also in place across northern England and north Wales until 11am on Friday, with the storm widely expected to bring gusts of 50-60mph in the region.\nLilian is the 12th named storm of the season – the furthest the Met Office has got through the list since it was introduced – and the first since April.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said."}, {"id": "7398785b-1eeb-4a5e-b287-5e7f54a0990d", "title": "Flights axed as Storm Lilian brings travel disruption to bank holiday weekend", "date": "2024-08-23 10:45", "url": "https://www.kentonline.co.uk/news/national/flights-axed-as-storm-lilian-brings-travel-disruption-to-bank-holiday-weekend-126006/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "The cancellations include international flights to Italy, Switzerland and the US as well as domestic journeys to Scotland and Northern Ireland.\nThe Met Office has issued a yellow weather warning for rain spanning much of South East England from 6am to 1pm on Saturday.\nA separate wind warning was also in place across northern England and north Wales until 11am on Friday, with the storm widely expected to bring gusts of 50-60mph in the region.\nLilian is the 12th named storm of the season – the furthest the Met Office has got through the list since it was introduced – and the first since April.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said."}, {"id": "cafe504f-78f6-4f32-8faf-38ced9c4d2c4", "title": "Madison County now eligible for FEMA Assistance following Hurricane Debby", "date": "2024-08-23 04:45", "url": "https://www.wtxl.com/community/fema-agents-canvas-madison", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Madison County neighbors are now eligible to apply for help from FEMA for Hurricane Debby-related losses.\nWatch the video to see how FEMA teams are increasing outreach in Madison.\nBROADCAST TRANSCRIPT:FEMA teams are on the ground in Madison County where neighbors can now apply for help following Hurricane Debby.\nVideo shows the force of Hurricane Debby sweeping through Madison County.\nHere's how you can apply for help or get answers:Apply online at https://www.disasterassistance.gov/Download the FEMA Mobile AppCall 1-800-621-3362The deadline to apply for Hurricane Debby related assistance is October 9th."}, {"id": "4900831b-766f-40d7-8f22-7955debe49c4", "title": "A robot attempt to get a sample of the melted fuel at Japan damaged nuclear reactor is suspended", "date": "2024-08-23 01:00", "url": "https://wfin.com/fox-world-news/a-robots-attempt-to-get-a-sample-of-the-melted-fuel-at-japans-damaged-nuclear-reactor-is-suspended/", "domain": "wfin.com", "domain_classification": "Unknown", "message": "An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nCLICK HERE TO GET THE FOX NEWS APPBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "df166fcf-d48c-4894-83c0-c564958378fa", "title": "Clues sought in shooting that injured Denmark store owner", "date": "2024-08-23 01:30", "url": "https://www.wrdw.com/2024/08/22/clues-sought-shooting-that-injured-denmark-store-owner/", "domain": "wrdw.com", "domain_classification": "Unknown", "message": "DENMARK, S.C. (WRDW/WAGT) - Authorities are asking the public for help as they investigate a shooting earlier this month at a convenience store in Denmark.\nThe shooting happened after 8 p.m. on Aug. 6 at the Denmark Grocery, 59 Magnolia Ave.\nThe store owner was shot, taken to a hospital and treated for injuries.\nThe South Carolina Law Enforcement Division is assisting Denmark police with the investigation, and released surveillance images from the store.\nThe shooting came amid an outbreak of violent crime that’s claimed more than 170 lives in a little over two years across the CSRA ."}, {"id": "fbbd369a-26cf-4363-89b5-d28178638b87", "title": "Scorching heat , creeping drought threaten Nashville , Middle Tennessee next week", "date": "2024-08-23 18:30", "url": "https://www.yahoo.com/news/scorching-heat-creeping-drought-threaten-180307443.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"We'll definitely be adding to that total the rest of the month,\" the weather service said.\nOver half of Middle Tennessee is in some level of drought, according to the weather service.\nWednesday: Sunny and hot with a high near 99 and overnight lows around 73.\nThursday: A 20% chance of showers and thunderstorms, otherwise mostly sunny with a high near 96 and lows around 70.\nThis article originally appeared on Nashville Tennessean: Drought concerns rise as blistering heat returns to Middle Tennessee"}, {"id": "47eb1bfd-18dc-4e84-857a-4b1bf371d0e0", "title": "Drought shows no sign of improvements as sunshine filled weekend gets underway", "date": "2024-08-23 13:45", "url": "https://www.yahoo.com/news/drought-shows-no-sign-improvements-120249187.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Highs in the low to mid 80s under mostly sunny skies really give us that summer feel we’ve missed out on so often this year.\nHighs push into the mid 80s with a few spots west of Beckley making a solid run at the upper 80s.\nWith mostly sunny skies, we’ll reach for the mid and upper 80s with our mountains trying for the low 80s.\nTuesday starts with sun & clouds with temps warming up steadily into the mid and upper 80s by the afternoon.\nThursday partly sunny skies gives us a few hours of sunshine helping temps warm up into the mid and upper 80s."}, {"id": "face7b08-3003-4179-8999-38c2e955c134", "title": "Lockheed Martin Marks 70 Years of C - 130 Aircraft in Flight", "date": "2024-08-23 01:15", "url": "https://www.military.com/daily-news/2024/08/22/lockheed-martin-marks-70-years-of-c-130-aircraft-flight.html", "domain": "military.com", "domain_classification": "Unknown", "message": "Inside the cavernous Lockheed Martin aircraft manufacturing plant at Dobbins Air Reserve Base, employees Thursday celebrated nearly 70 years of flight for the C-130 tactical airlifter -- built in Marietta as the longest-running military aircraft production line in history.\nDuring an all-employee event Thursday for the anniversary, Lockheed Martin also honored four employees who have worked there for at least 60 years.\nThe U.S. Air Force commissioned what was then Lockheed Aircraft Corp. to build a military cargo transport that could airlift combat troops and deliver them to small airfields.\nThe future for HerculesIt's yet to be seen what the ultimate life span of C-130 production will be.\n\"I would have told you in 2010 that we wouldn't be producing C-130Js in 2020,\" said Lockheed Martin Aeronautics President Greg Ulmer."}, {"id": "66511845-f5fa-459d-b804-19f45a0db6e0", "title": "National Hurricane Center tracking 4 tropical waves as we near the peak of storm season", "date": "2024-08-23 14:30", "url": "https://www.yahoo.com/news/national-hurricane-center-tracking-4-141543804.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "National Hurricane Center tracking 4 tropical waves as we near the peak of storm seasonFor the North Atlantic, Caribbean Sea and the Gulf of Mexico, tropical cyclone formation is not expected during the next seven days.\nThe Atlantic hurricane season is from June 1 to Nov. 30 every year, with the most active part of the season between August and October.\nWhat are the 2024 Atlantic hurricane season names?\nAccording to the National Hurricane Center in Miami, these are the list of names for the 2024 Atlantic hurricane season:AlbertoBerylChrisDebbyErnestoFrancineGordonHeleneIsaacJoyceKirkLeslieMiltonNadineOscarPattyRafaelSaraTonyValerieWilliamWhat happens if we run out of hurricane names?\nThese are the supplemental hurricane names for the 2024 Atlantic hurricane season:AdriaBraylenCaridadDeshawnEmeryFosterGemmaHeathIslaJacobusKenzieLucioMakaylaNolanOrlandaPaxRoninSophieTayshaunVivianaWillContributing: Cheryl McCloud, USA TODAY Network-FloridaThis article originally appeared on Florida Today: Hurricane season: 4 tropical waves in Atlantic, 2 in Caribbean Sea"}, {"id": "55146223-0d9b-40f3-817b-eb4df2d176d3", "title": "Another sales - tax holiday kicks off Saturday across Florida", "date": "2024-08-23 16:15", "url": "https://www.fox35orlando.com/news/another-sales-tax-holiday-kicks-off-saturday-across-florida", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "The state also held a similar tax holiday around the June 1 start of the six-month hurricane season.\nMeteorological experts have forecast an above-average hurricane season this year, which could mean more than 20 named storms before the end of November.\nFlorida Emergency Management Director Kevin Guthrie this week advised people not to be fooled by the current calm in the Atlantic and to use the tax holiday that starts Saturday to \"go out and restock or stock for disaster items.\"\n\"We're entering the peak weeks of hurricane season,\" Guthrie said Wednesday while in Sarasota.\nThe tax holiday starting Saturday and the similar period around the start of hurricane season are projected to trim $80.2 million from state and local tax revenues."}, {"id": "0af033ce-0600-4ef8-a8cf-cf634d57183d", "title": "NEOC to convene following Ernesto - Premier Wheatley | Virgin Islands News Online", "date": "2024-08-23 00:45", "url": "http://www.virginislandsnewsonline.com/en/news/neoc-to-convene-following-ernesto-premier-wheatley", "domain": "virginislandsnewsonline.com", "domain_classification": "Unknown", "message": "You are here: Virgin Islands News Online News » NEOC to convene following Ernesto- Premier WheatleyThe National Emergency Operations Centre (NEOC) will convene today, Wednesday, August 14, 2024, to receive reports from various agencies following the effects of Hurricane Ernesto.\nPhoto: Government of the Virgin IslandsROAD TOWN, Tortola, VI- The National Emergency Operations Centre (NEOC) will convene today, Wednesday, August 14, 2024, to receive reports from various agencies following the effects of Hurricane Ernesto.\nPremier and Minister for Finance Honourable Dr. Natalio D. Wheatley in a statement released today said, “Ernesto has left downed trees and power lines and scattered debris into the roads of the Territory.\nAt the moment, crews from Public Works, the BVIEC, and telecommunication providers are working to clear roads and restore services.\"\nPremier Wheatley also urged residents to remain safe at home until the all-clear is issued."}, {"id": "8e40d796-4725-417f-94cc-65d4eb396d16", "title": "Japan postpones trial removal of nuclear debris from Fukushima reactor", "date": "2024-08-23 03:30", "url": "https://www.channelnewsasia.com/east-asia/japan-postpones-trial-removal-nuclear-debris-fukushima-reactor-4560386", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "TOKYO: The operator of Japan's stricken Fukushima nuclear power plant said this week's trial removal of radioactive debris from a battered reactor has been postponed due to a technical issue.\nTokyo Electric Power Company (Tepco) was aiming to remove a tiny sample of the estimated 880 tons of radioactive debris believed to sit inside reactors at the tsunami-hit nuclear plant.\nThe trial removal will not resume on Friday as the operator has to \"investigate the cause of the trouble,\" another spokesman Tatsuya Matoba told AFP on Friday.\nThree of Fukushima Daiichi nuclear plant's six reactors were operating when a tsunami hit on Mar 11, 2011, knocking down cooling systems and sending them into meltdown in what became the worst nuclear disaster since Chernobyl.\nIn three units of the Fukushima plant, fuel and other material melted and then solidified into highly radioactive \"fuel debris\"."}, {"id": "4dfbf5a3-0b68-45d9-b59f-85f3b45bbb79", "title": "A third of California is  abnormally dry , drought monitor says . Where are conditions worst ? ", "date": "2024-08-23 13:45", "url": "https://www.yahoo.com/news/third-california-abnormally-dry-drought-130000967.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "About 6.9% of California was under moderate drought conditions as of Thursday and 0.1% was under severe drought conditions, the map indicated.\nAbout 33.4% of California is under “abnormally dry conditions” as of Thursday, Aug. 22, 2024, according to the U.S. Drought Monitor.\nAbout 6.9% of the state is under “moderate drought” conditions and 0.1% is under “severe drought” conditions.\nMeanwhile, 33.4% of California was battling abnormally dry conditions as of Thursday, the Drought Monitor said.\nAs of Thursday morning, an estimated 72,714 California residents were living in drought conditions, according to the U.S. Drought Monitor."}, {"id": "9bb54401-eaea-4067-91f2-574febf88e1c", "title": "A third of California is  abnormally dry , drought monitor says . Where are conditions worst ? ", "date": "2024-08-23 13:45", "url": "https://www.yahoo.com/news/third-california-abnormally-dry-drought-130000929.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "About 6.9% of California was under moderate drought conditions as of Thursday and 0.1% was under severe drought conditions, the map indicated.\nAbout 33.4% of California is under “abnormally dry conditions” as of Thursday, Aug. 22, 2024, according to the U.S. Drought Monitor.\nAbout 6.9% of the state is under “moderate drought” conditions and 0.1% is under “severe drought” conditions.\nMeanwhile, 33.4% of California was battling abnormally dry conditions as of Thursday, the Drought Monitor said.\nAs of Thursday morning, an estimated 72,714 California residents were living in drought conditions, according to the U.S. Drought Monitor."}, {"id": "66e174a3-b50f-4fd3-a09a-b22078632eaf", "title": "Mason County wildfire burns 3 , 000 acres , 10 % contained", "date": "2024-08-23 12:00", "url": "https://www.yahoo.com/news/mason-county-wildfire-burns-3-094245562.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Mason County wildfire ignited by lightning, forest service says; 4,000 acres burned and 30% containedMASON COUNTY, Texas (KXAN) — The Mason Volunteer Fire Department and several other fire departments across the Hill Country are working to put out a wildfire in Mason County Friday morning.\nThe Texas A&M Forest Service said the fire is currently an estimated 3,000 acres and 10% contained.\n(Courtesy: Ashley Airheart Duarte)View from Ranch Road 1900 of the “North Art Complex” wildfire in Mason County Aug. 23, 2024.\n(KXAN Photo/Todd Bailey)View from Ranch Road 1900 of the “North Art Complex” wildfire in Mason County Aug. 23, 2024.\nThe Texas A&M Forest Service said on Friday morning the fire has burned over 3,000 acres and has been 10% contained."}, {"id": "1610a6d7-cd07-4c6d-9f9d-dee0c528fc5b", "title": "Amazon  disaster relief hub  opens in Inland Empire – Daily News", "date": "2024-08-23 00:45", "url": "https://www.dailynews.com/2024/08/22/amazons-disaster-relief-hub-opens-in-inland-empire/", "domain": "dailynews.com", "domain_classification": "Unknown", "message": "But just in case, they’re ready to ship from Amazon’s first disaster relief hub focused on wildfires.\n(Photo by Will Lester, Inland Valley Daily Bulletin/SCNG)Vidya Sampath, Amazon’s senior product manager for disaster relief for Amazon, is seen Thursday, Aug. 22, 2024, near an aisle full of disaster relief supplies in the company’s disaster relief hub in Beaumont.\n(Photo by Will Lester, Inland Valley Daily Bulletin/SCNG)Disaster relief supplies fill an aisle at Amazon’s disaster relief hub in Beaumont on Thursday, Aug 22, 2024.\n(Photo by Will Lester, Inland Valley Daily Bulletin/SCNG)Vidya Sampath, senior product manager for disaster relief for Amazon, stands near an aisle of disaster relief supplies at Amazon’s disaster relief hub in Beaumont on Thursday, Aug. 22, 2024.\nAmazon wants to provide disaster relief “with as much attention to detail, thoroughness and commitment as we do with any Amazon product launch,” said Vidya Sampath, senior product manager with Amazon Disaster Relief."}, {"id": "6e784b4e-b14e-472f-b523-dbeacad41243", "title": "St . Charles Roofing Urges Quick Action on Storm - Damaged", "date": "2024-08-23 00:15", "url": "https://www.globenewswire.com/news-release/2024/08/22/2934676/0/en/St-Charles-Roofing-Urges-Quick-Action-on-Storm-Damaged-Roofs-to-Avoid-Costly-Repairs.html", "domain": "globenewswire.com", "domain_classification": "Unknown", "message": "St. Charles, IL, Aug. 22, 2024 (GLOBE NEWSWIRE) -- Due to changing climate patterns, severe flooding, thunderstorms, and extreme heat have become common in St. Charles in recent years.\nSt. Charles Roofing, a premier roofing contractor technology platform, advocates for timely repairs for storm-damaged roofs.\nSt. Charles Roofing partners leverages scaffolding techniques to install or repair storm-damaged roofing.\nAfter installations and repairs, St. Charles Roofing partners remove debris, such as nails and old shingles.\nMedia Contact:Company Name: St. Charles RoofingContact Person: Frank LawsonPhone: (224) 281-7320Address: 100 Illinois St #200City: St. CharlesState: ILPostal Code: 60174Country: USWebsite: https://stcharlesroofers.com/"}, {"id": "4eccf311-e06d-4c44-b153-d5b99965298a", "title": "Stony Brook University students move on campus after three - day storm delay", "date": "2024-08-23 00:15", "url": "https://www.newsday.com/long-island/education/stony-brook-university-move-in-campus-fqd4bz8z", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Hundreds of Stony Brook University students moved into their dorms Thursday following a three-day delay after a torrential downpour early Monday flooded two residence halls, creating havoc on campus along with millions of dollars in damage in the region.\nCompared to the pandemic, the three-day delay at Stony Brook was nothing, she said.\n\"It’s really impressive how quickly Stony Brook got their act together,” Jami said.\n\"Just another kid.”Stony Brook officials said Thursday they still did not know the number of students displaced by the flooding.\nCleanup continues at the Ammann Hall dormitory on the Stony Brook University campus on Thursday."}, {"id": "1c7c135f-a7e9-4aed-a0ee-1a024c94cece", "title": "Mini heat wave on tap for Lincoln this weekend", "date": "2024-08-23 15:15", "url": "https://journalstar.com/news/local/weather/mini-heat-wave-on-tap-for-lincoln-this-weekend/article_4f5de22c-60ac-11ef-b512-a71ea3355ae2.html", "domain": "journalstar.com", "domain_classification": "Unknown", "message": "After an extended period of lower-than-normal temperatures, Lincoln is in for a late-summer mini heat wave this weekend.\nThe Weather Service said the heat index could reach as high as 105-110 degrees on both Saturday and Sunday.\nSince Aug. 5, Lincoln has seen a below-normal high temperature on 14 of 17 days, including seven days in the 70s.\nDrought has also been expanding statewide, with 19% of Nebraska now in at least a moderate drought, including nearly 6% in severe drought.\nThere was no severe drought at all in the state as recently as mid-July, while the amount of moderate drought bottomed out at around 1% in mid-June."}, {"id": "97c505e1-281f-47f0-b14a-18d3306d2bf8", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Yass Tribune", "date": "2024-08-23 04:15", "url": "https://www.yasstribune.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2732", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "fd26ea4d-e40e-4726-9243-ef7589e3030f", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Braidwood Times", "date": "2024-08-23 04:15", "url": "https://www.braidwoodtimes.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "braidwoodtimes.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "b657659f-3127-4bbc-b49c-ac1df6afa356", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Parkes Champion - Post", "date": "2024-08-23 05:45", "url": "https://www.parkeschampionpost.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "parkeschampionpost.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "0c6e709c-6da2-41ee-99ea-a798b06fa9c2", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Mudgee Guardian", "date": "2024-08-23 04:45", "url": "https://www.mudgeeguardian.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2666", "domain": "mudgeeguardian.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "2e7fbf5f-d0fe-419c-bd1c-1a2318355be5", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Mudgee Guardian", "date": "2024-08-23 04:45", "url": "https://www.mudgeeguardian.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=1485", "domain": "mudgeeguardian.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "1d632875-8a59-4cf1-9e99-e215d6d1f887", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Mudgee Guardian", "date": "2024-08-23 04:45", "url": "https://www.mudgeeguardian.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "mudgeeguardian.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "50657e1c-455d-4fbc-aff0-9fb8e0ef0b02", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Gloucester Advocate", "date": "2024-08-23 04:30", "url": "https://www.gloucesteradvocate.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "gloucesteradvocate.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "3ec48dbf-a1c4-491f-ada7-6d6282a2cb14", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Hawkesbury Gazette", "date": "2024-08-23 04:30", "url": "https://www.hawkesburygazette.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2729", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "025a2f89-d21b-40e3-91ca-ffb02416cd2c", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Gloucester Advocate", "date": "2024-08-23 04:30", "url": "https://www.gloucesteradvocate.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2835", "domain": "gloucesteradvocate.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "945e93ba-babd-4bc6-88c9-d6a747c5d0bf", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Braidwood Times", "date": "2024-08-23 04:15", "url": "https://www.braidwoodtimes.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2971", "domain": "braidwoodtimes.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "7f7d2c1b-8706-45df-91b6-908379baed5a", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Yass Tribune", "date": "2024-08-23 04:15", "url": "https://www.yasstribune.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "ceb9d626-1a3e-4bfe-83a5-d43445f6b784", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Bega District News", "date": "2024-08-23 04:15", "url": "https://www.begadistrictnews.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=511", "domain": "begadistrictnews.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "5837e135-5d1e-47d7-8bb1-5630b6710de9", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Bay Post - Moruya Examiner", "date": "2024-08-23 04:00", "url": "https://www.batemansbaypost.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2690", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "c9add31b-3953-4384-b0f1-0fc1108d6586", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Goulburn Post", "date": "2024-08-23 05:00", "url": "https://www.goulburnpost.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2650", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "b6131bc2-6102-4022-b8f3-cbd71eb0fdec", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Magnet", "date": "2024-08-23 05:00", "url": "https://www.edenmagnet.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "edenmagnet.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "04135b94-2512-4ec1-bdca-bac27a45e97a", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Magnet", "date": "2024-08-23 05:00", "url": "https://www.edenmagnet.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=2895", "domain": "edenmagnet.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "a0577a73-d01a-45c8-8217-79fa09a34979", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Scone Advocate", "date": "2024-08-23 05:15", "url": "https://www.sconeadvocate.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "\"There is always a possibility that the aftershocks will continue for the weeks to come, but as a general rule of thumb, the larger aftershocks tend to occur at the earlier stages,\" he said."}, {"id": "72331ece-69b4-4618-8f9f-827730378757", "title": "Montreal - area mayors say Quebec government has not delivered on promised flood relief – Winnipeg Free Press", "date": "2024-08-23 16:15", "url": "https://www.winnipegfreepress.com/business/2024/08/23/montreal-area-mayors-say-quebec-government-has-not-delivered-on-promised-flood-relief", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The government program had only compensated homeowners for water damage caused by overland flooding.\nThe Communauté métropolitaine de Montréal (CMM), which represents 82 municipalities, says there has been no meaningful change to the program if sewer backups located far from waterways are not included.\nPeople living on certain streets have been told they’re eligible for financial aid, he said, while residents of other streets have been told they’re out of luck.\n)”Alain Mailhot, a professor of urban hydrology at Quebec’s national scientific research institute, said it doesn’t make sense to compensate people for sewer backups only if they live close to a river.\nIn a press release, the group requested that sewer backups caused by “urban runoff” during episodes of heavy rain be eligible for government aid."}, {"id": "2eee47bc-55bd-484c-b27b-ca98794333c5", "title": "Leeds Festival campers warned to secure their tents as Storm Lilian sweeps in", "date": "2024-08-23 01:15", "url": "https://www.edp24.co.uk/news/national/24536997.leeds-festival-campers-warned-secure-tents-storm-lilian-sweeps/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "“So there could be potentially some impacts from those strong winds, of 50 to 60mph in the area so it’s worth making sure your tents are secured.\n⚠️ Storm Lilian has been named by the Met Office.\nThe warning for strong winds covers parts of north Wales on Friday.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said.\nThis is primarily based on impacts from strong winds but other weather types will also be considered, including rain if flood warnings are advised by national agencies, or snow."}, {"id": "d52c3503-4345-48e9-bf7d-b5725774d36a", "title": "Earthquake jolts Sankhuwasabha", "date": "2024-08-23 12:00", "url": "https://myrepublica.nagariknetwork.com/news/earthquake-jolts-sankhwasabha/", "domain": "myrepublica.nagariknetwork.com", "domain_classification": "Unknown", "message": "KATHMANDU, Aug 23: An earthquake jolted Sankhuwasabha district.\nAccording to the National Earthquake Monitoring and Research Center (NEMRC), an earthquake of 3.9 magnitude jolted Sankuwasahba at 3:07 PM on Friday, with its epicenter around Gadi Danda Bazar.\nThe Sankhuwasabha administration said that it is uncertain how much damage was caused by the earthquake and they are in the process of gathering further details."}, {"id": "08e0aaba-b9b3-4aa8-b1cc-0ac5f6d2d0d3", "title": "Storm Lilian : Leeds Festival campers warned to secure tents as weather system set to bring chaos", "date": "2024-08-23 07:45", "url": "https://www.mirror.co.uk/news/uk-news/storm-lilian-leeds-festival-campers-33523210", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Storm Lilian, which has also caused travel disruption and power cuts, blew away tents at Leeds Festival, where campers filmed heavy rain lashed across the siteTents have been blown away at Leeds Festival amid the fierce gales caused by Storm Lilian.\nFurther gusts of up to 80mph are still expected, with travel disruption, flooding, power cuts and dangerous conditions near coastal areas all likely.\nThe forecaster has issued two yellow weather warnings for rain in south-west Scotland and the Aberdeenshire coast from 9pm on Thursday to 9am on Friday.\nA yellow wind warning has also come into force covering northern England and north Wales until 11am on Friday, with the storm widely expected to bring gusts of 50-60mph in the region.\nRAC Breakdown spokeswoman Alice Simpson said the adverse weather and large volume of expected trips represented “a perfect storm” for drivers."}, {"id": "110e30e1-6a01-4a62-b93f-78ec45a82b96", "title": "Flights axed as Storm Lilian brings travel disruption to bank holiday weekend", "date": "2024-08-23 11:30", "url": "https://www.oxfordmail.co.uk/news/national/24537428.flights-axed-storm-lilian-brings-travel-disruption-bank-holiday-weekend/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "The cancellations include international flights to Italy, Switzerland and the US as well as domestic journeys to Scotland and Northern Ireland.\nThe Met Office has issued a yellow weather warning for rain spanning much of South East England from 6am to 1pm on Saturday.\nA separate wind warning was also in place across northern England and north Wales until 11am on Friday, with the storm widely expected to bring gusts of 50-60mph in the region.\nLilian is the 12th named storm of the season – the furthest the Met Office has got through the list since it was introduced – and the first since April.\nStorms are named when they have the potential to cause disruption or damage which could result in an amber or red warning, the Met Office said."}]