[{"id": "ee5ffc69-73f8-4d13-96f4-34866208df26", "title": "One - third of Canadians report being personally impacted by severe weather : poll", "date": "2024-08-22 14:30", "url": "https://www.stcatharinesstandard.ca/news/canada/one-third-of-canadians-report-being-personally-impacted-by-severe-weather-poll/article_a9763a9f-27e1-5447-a560-8c01d32064f8.html", "domain": "stcatharinesstandard.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "879d36cb-a438-4561-9d44-0aeb0a51303a", "title": "One - third of Canadians report being personally impacted by severe weather : poll | iNFOnews", "date": "2024-08-22 11:00", "url": "https://infotel.ca/newsitem/poll-weather/cp1379087060", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "One-third of Canadians report being personally impacted by severe weather: pollThe Don River overflows causing flooding on surrounding roads following heavy rain in Toronto, on July 16, 2024.\nA new poll suggests more Canadians are feeling the direct impacts of extreme weather, but that has not changed overall opinions about climate change.\nTHE CANADIAN PRESS/Arlyn McAdoreyOTTAWA - A new poll suggests more Canadians are feeling the direct impacts of extreme weather, but that has not changed overall opinions about climate change.\nWhen Leger asked the same question in June 2023, around one in four Canadians indicated they had been impacted by extreme weather.\nAbout half of respondents believe there is still time to reverse climate change, while just over one-third said it's too late to turn back the clock."}, {"id": "d8088678-d338-4c3f-9c5e-6046c0181de1", "title": "Haunting photo shows tourists caught by first tsunami wave of disaster that claimed more than 220 , 000 lives", "date": "2024-08-22 09:45", "url": "https://www.ladbible.com/news/world-news/2004-boxing-day-tsunami-photo-145141-20240822", "domain": "ladbible.com", "domain_classification": "Unknown", "message": "The devastating disaster claimed the lives of over 220,000 people, while injuring thousands more in what was the third largest earthquake since 1900.\nIt took several years to clear up the devastation left behind in affected places such as Indonesia, Sri Lanka, India and Thailand.\nThe 2004 Indian Ocean earthquake hit a magnitude of 9.1.\nSri Lanka is 1,100 miles from Sumatra, and it took two hours for the tsunami to reach the South Asian island.\nThe overall fatality figure included approximately 9,000 foreign tourists that came from several other nations, making the 2004 Indian Ocean tsunami and earthquake one of the worst natural disasters in history."}, {"id": "63a2d999-189f-4bf8-a514-98fee21cee37", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 01:30", "url": "https://www.timescolonist.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "2f77fcbf-c0ef-411c-919a-1cb9ae66aee6", "title": "One - third of Canadians report being personally impacted by severe weather : poll", "date": "2024-08-22 09:15", "url": "https://www.princegeorgecitizen.com/national-news/one-third-of-canadians-report-being-personally-impacted-by-severe-weather-poll-9384776", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "OTTAWA — A new poll suggests more Canadians are feeling the direct impacts of extreme weather, but that has not changed overall opinions about climate change.\nOTTAWA — A new poll suggests more Canadians are feeling the direct impacts of extreme weather, but that has not changed overall opinions about climate change.\nWhen Leger asked the same question in June 2023, around one in four Canadians indicated they had been impacted by extreme weather.\nDespite all that, people who took the survey were less likely to be concerned about climate change now than in 2023.\nAbout half of respondents believe there is still time to reverse climate change, while just over one-third said it's too late to turn back the clock."}, {"id": "ae4fd42e-d544-49f1-9bfe-a3ba0db1d643", "title": "One - third of Canadians report being personally impacted by severe weather : poll", "date": "2024-08-22 14:15", "url": "https://www.cornwallseawaynews.com/ontario-news/one-third-of-canadians-report-being-personally-impacted-by-severe-weather-poll/", "domain": "cornwallseawaynews.com", "domain_classification": "Unknown", "message": "OTTAWA — A new poll suggests more Canadians are feeling the direct impacts of extreme weather, but that has not changed overall opinions about climate change.\nWhen Leger asked the same question in June 2023, around one in four Canadians indicated they had been impacted by extreme weather.\nAlmost half of those polled in Atlantic Canada say they have been touched by extreme weather, up from less than one-third a year ago.\nDespite all that, people who took the survey were less likely to be concerned about climate change now than in 2023.\nAbout half of respondents believe there is still time to reverse climate change, while just over one-third said it’s too late to turn back the clock."}, {"id": "ed865c20-aad7-45e4-b3fe-d0495c4d5538", "title": "Rising Above the Flood : Floridians lifting their homes above the surge", "date": "2024-08-22 14:30", "url": "https://www.abcactionnews.com/news/local-news/rising-above-the-flood-floridians-lifting-their-homes-above-the-surge", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "In January, he told Paluska he bought the home in Shore Acres to be his very first lift.\nJasuwan partnered with Payne Construction Services, a family-owned and operated company that specializes in lifting homes.\nHouse Lift Timelapse 2Just down the road in another part of Shore Acres, Dr. Meghan Martin is also planning to lift.\nSt. Pete Pier Storms TimelapseEven before our recent floods from Eta and Idalia, some people in Shore Acres were proactive.\nHe currently has jobs in Homosassa, Treasure Island, St. Pete Beach, and other homes in the Shore Acres community."}, {"id": "4d74893d-02e6-4e51-bd84-028361bae25c", "title": "Leftover sandbags : what should you do with them ? ", "date": "2024-08-22 00:00", "url": "https://www.yahoo.com/news/leftover-sandbags-them-210919170.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Leftover sandbags: What should you do with them?\nOne thing you can do is store the sandbags in a dry, covered area for up to a year so they can be used again if needed.\nYou also should not dump sandbags on the beach or into creeks, rivers, canals, ditches or roadway gutters.\nYou can also reach out to neighbors, community centers, local emergency agencies or public work departments to see if they might have a use for them.\nIf you believe your sandbags are contaminated, contact your local public works department to find out where and how you should dispose of them."}, {"id": "20ee41b2-5c08-412c-9329-32eb14187b8b", "title": "Japan : Robot Attempt To Get Nuclear Fuel Sample Of Damaged Fukushima Daiichi Reactor Suspended", "date": "2024-08-22 07:30", "url": "https://www.outlookindia.com/international/japan-robots-attempt-to-get-nuclear-fuel-sample-of-damaged-fukushima-daiichi-reactor-suspended", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "InternationalJapan: Robot's Attempt To Get Nuclear Fuel Sample Of Damaged Fukushima Daiichi Reactor SuspendedThe work was stopped Thursday morning when workers noticed that five 1.5-meter (5-foot) pipes used to maneuver the robot were placed in the wrong order and could not be corrected within the time limit for their radiation exposure, the plant operator Tokyo Electric Power Company Holdings said."}, {"id": "03e8feba-5fef-4a92-8d74-e3d9fd1f6293", "title": "Posts falsely depict old Japan quake photos as aftermath of August 2024 jolt", "date": "2024-08-22 02:45", "url": "https://www.yahoo.com/news/posts-falsely-depict-old-japan-021335650.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Posts falsely depict old Japan quake photos as aftermath of August 2024 joltSocial media users have shared a photo collage of damaged buildings and roads from previous earthquakes in Japan, falsely claiming the images show the impact of a 7.1-magnitude tremor that struck off the country's south in August 2024.\nScreenshot of the false Facebook post, taken August 21, 2024The post racked up more than 680 shares.\nJapan recently lifted a warning that a \"megaquake\" potentially causing colossal damage and loss of life could strike (archived link).\nThe caption of the January 7, 2024 post says the images were shot as the force inspected earthquake damage in Wajima city in Japan's Noto Peninsula.\nAFP has previously fact-checked misinformation on the recent Japan earthquake here and here."}, {"id": "a3e6f5bb-cfe4-44d4-9142-f1721c1e4518", "title": "Hurricane Gilma Now a Category 2 and Expected to Intensify , Forecasters Say", "date": "2024-08-22 04:30", "url": "https://www.theepochtimes.com/world/hurricane-gilma-now-a-category-2-and-expected-to-intensify-forecasters-say-5710287", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "This satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\nThis satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\nNOAA via APMEXICO CITY—Gilma strengthened into a Category 2 hurricane Wednesday afternoon in the eastern Pacific Ocean and was forecast to become a major hurricane as soon as Thursday.\nHurricane Gilma was located about 975 miles (1,570 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 4 hurricane by Thursday afternoon, forecasters said."}, {"id": "0a606c2f-ae73-41df-8b84-5fccaf7803d1", "title": "Hurrican Gilma : Forecasts show storm will stay away , 2nd of east Pacific season", "date": "2024-08-22 01:30", "url": "https://www.ctvnews.ca/world/hurricane-gilma-now-a-category-2-and-expected-to-intensify-forecasters-say-1.7008494", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "MEXICO CITY, Mexico -Gilma strengthened into a Category 2 hurricane Wednesday afternoon in the eastern Pacific Ocean and was forecast to become a major hurricane as soon as Thursday.\nHurricane Gilma was located about 975 miles (1,570 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 4 hurricane by Thursday afternoon, forecasters said.\nGilma had strengthened to tropical storm status on Sunday.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "9a3814bb-bd8e-4cb2-80f9-b4a83b818be3", "title": "Fukushima Nuclear Fuel Debris Removal Work Halted", "date": "2024-08-22 12:00", "url": "https://menafn.com/1108588487/Fukushima-Nuclear-Fuel-Debris-Removal-Work-Halted", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Tokyo, Aug 22 (IANS) Tokyo Electric Power Company (TEPCO) on Thursday decided to halt preparatory work for the test retrieval of nuclear debris from one of the crippled reactors at the disaster-stricken Fukushima Daiichi nuclear plant.\n2 unit at the in Fukushima Prefecture on Thursday, but setup errors were discovered during preparations in the debris retrieval device, according to the utility, reports Xinhua news agency.\nIt is the first such attempt to take out fuel debris in 13 and a half years since the Fukushima nuclear plant was devastated by a massive earthquake and tsunami.\n2 reactor as the first to start the fuel debris retrieval work as its reactor building was the only one not to suffer a hydrogen explosion.\nAn estimated 880 tons of fuel debris remain in the three reactors."}, {"id": "2cbc6e68-d97b-4ce2-92ab-a4c2a0b31244", "title": "25 US States With the Biggest Risk of Flooding", "date": "2024-08-22 03:30", "url": "https://finance.yahoo.com/news/25-us-states-biggest-risk-012429893.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "Based in Switzerland, the company offers a multitude of insurance services in over 200 territories and countries, including homeowners’ insurance, flood insurance, and health insurance.\n25 US States With the Biggest Risk of Flooding25 US States With the Biggest Risk of FloodingOur MethodologyTo compile this list of 25 US states with the highest risk of flooding, we consulted the National Risk Index by the Federal Emergency Management Agency (FEMA).\nVirginiaAverage Annual Losses to Flooding: $144,981,713Virginia ranks tenth on our list of US states with the biggest risk of flooding.\nNew JerseyAverage Annual Losses to Flooding: $818,943,074New Jersey is one of the states where most losses come from coastal flooding rather than riverine flooding.\nTexasAverage Annual Losses to Flooding: $1,965,480,712Texas ranks as the first state in our list of US states with the highest risk of flooding."}, {"id": "389705d7-972b-4670-9fb5-96cc45ca8ba9", "title": "Drought , wildfire concerns remain despite cooler , wet weather", "date": "2024-08-22 00:45", "url": "https://www.cbc.ca/news/canada/british-columbia/drought-wildfire-concerns-1.7301277", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "While some parts of the province have received some rain and mild temperatures in recent days, officials are warning British Columbians that drought conditions persist and the fire situation is \"active.\"\nWhile a change in weather has helped firefighters \"gain the upper hand\" against several fires, Ma said it doesn't mean B.C.\nDrought levelsMinister of Water, Land and Resource Stewardship Nathan Cullen said drought is still a major concern throughout B.C., even after some rainfall.\nDrought conditions across B.C.\nDrought conditions in B.C."}, {"id": "6dad2b4d-22eb-4c2a-b87a-446817badfd7", "title": "Storm Lilian to lash Ireland as weather warnings issued by Met Eireann for fierce double blast", "date": "2024-08-22 13:00", "url": "https://www.irishmirror.ie/news/irish-news/storm-lilian-lash-ireland-weather-33517553", "domain": "irishmirror.ie", "domain_classification": "Unknown", "message": "With miserable conditions looming, Met Eireann has issued two separate weather warnings for a double blast of wind and rain.\nIt warns of \"heavy rain spreading northeastwards\" with the potential for localised flooding and difficult travelling conditions.\nHighest temperatures of 15C to 18C with mostly moderate west to southwest winds.\nLowest temperatures of 8C to 11C in light to moderate southwest winds.\nLowest temperatures of 11C to 14C in light to moderate southwest winds.\""}, {"id": "5c31edd3-68e3-49ac-99d9-d21dd09e6367", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 06:00", "url": "https://www.timescolonist.com/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "30b11101-52d3-49a3-98a7-65b256060dca", "title": "Light earthquake , 4 . 3 mag strikes near southeast Indian Ridge", "date": "2024-08-22 09:15", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-3-mag-strikes-near-southeast-indian-ridge-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Wednesday, southeast Indian Ridge (0 miles).\nThe earthquake was roughly at a depth of 10 km (6 miles).\nExact time and date of earthquake 24/07/24 / 2024-07-24 14:32:28 / July 24, 2024 @ 2:32 pm UTC/GMT.\nExact location of earthquake, longitude 112.7191 East, latitude -50.3578 South, depth = 10 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: southeast Indian Ridge."}, {"id": "4af81b80-bbee-4afe-be14-0a58ac2d0c9a", "title": "Met Office confirms exact date Storm Lilian is set to hit united kingdom with 80mph winds", "date": "2024-08-22 14:30", "url": "https://www.lbc.co.uk/news/met-office-confirm-exact-date-storm-lilian-hit-uk-with-80mph-winds/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Met Office confirms exact date Storm Lilian is set to hit UK with 80mph windsThe Met Office has confirmed Storm Lilian will hit the UK on Friday.\nPicture: Met Office & AlamyBy Will ConroyThe Met Office has confirmed Storm Lilian - the 12th named storm of the season - will hit the UK on Friday with winds of up to 80mph in some parts of the country.\nPicture: Met OfficeThe Met Office said: \"An area of strong winds associated with Storm Lilian is expected to move east across northern England during Friday morning.\nPicture: Met OfficeThe Met Office urged the public to protect property, to check for loose items outside their homes and check for travel delays before heading out.\nStorm Lilian marks just the third year when a storm has been named in August since they started being named in 2015."}, {"id": "c2cf5e55-e8b7-41bd-b73f-df4024c230de", "title": "Light earthquake , 4 . 9 mag has occurred near Fiji region", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-9-mag-has-occurred-near-fiji-region-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has struck on Thursday, Fiji region (0 miles).\nDate and time of earthquake in UTC/GMT: 22/08/24 / 2024-08-22 12:34:56 / August 22, 2024 @ 12:34 pm.\nThe earthquake was roughly at a depth of 361.086 km (224 miles).\nIds that are associated to the earthquake: us7000n8r4.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Fiji region."}, {"id": "792b6ec8-0a5a-4f7f-8208-e95e0cfb029f", "title": "Light earthquake : M4 . 4 quake has struck near Atka in Alaska", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-m4-4-quake-has-struck-near-atka-in-alaska-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 187 km SSE of Atka, Alaska (116 miles).\nExact location of earthquake, -173.3728° West, 50.5904° North, depth 22.817 km.\nThe 4.4-magnitude earthquake has occurred at 09:52:55 / 9:52 am (local time epicenter).\nThe earthquake occurred at a depth of 22.817 km (14 miles).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 187 km SSE of Atka, Alaska."}, {"id": "f30e267a-92f2-4e4d-8ade-4af0259dabf5", "title": "Light earthquake , 4 . 2 mag strikes near Fiji region", "date": "2024-08-22 09:15", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-2-mag-strikes-near-fiji-region-16/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has occurred on Tuesday, Fiji region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -178.6293 West, latitude -20.8055 South, depth = 543.044 km.\nThe earthquake occurred at a depth of 543.044 km (337 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Fiji region."}, {"id": "6f7564bb-e6e6-4b41-8bbb-f7ff10204e1b", "title": "Light earthquake , 4 . 3 mag has occurred near Kermadec Islands region", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-3-mag-has-occurred-near-kermadec-islands-region-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Friday, Kermadec Islands region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nDate and time of earthquake in UTC/GMT: 02/08/24 / 2024-08-02 07:53:04 / August 2, 2024 @ 7:53 am.\nThere are an estimated 13,000 light quakes in the world each year.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Kermadec Islands region."}, {"id": "6d741bd7-1e24-4d7d-9516-79264ef54dd6", "title": "Light earthquake , 4 . 4 mag strikes near Mid - Indian Ridge", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-4-mag-strikes-near-mid-indian-ridge-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported Mid-Indian Ridge (0 miles) on Friday.\nGlobal time and date of event 26/07/24 / 2024-07-26 09:55:01 / July 26, 2024 @ 9:55 am UTC/GMT.\nThe earthquake occurred at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Mid-Indian Ridge."}, {"id": "8f06a3f7-4c4d-467e-aed0-9c3bf02034af", "title": "Light earthquake , 4 . 6 mag strikes near Gorontalo in Indonesia", "date": "2024-08-22 09:15", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-6-mag-strikes-near-gorontalo-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) strikes 90 kilometers (56 miles) from Gorontalo in Indonesia on Thursday.\nId of earthquake: us7000n8pi.\nDate and time of earthquake in UTC/GMT: 22/08/24 / 2024-08-22 04:43:13 / August 22, 2024 @ 4:43 am.\nEpicenter of the event was 91 km (56 miles) from Gorontalo (c. 144 200 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 90 km SE of Gorontalo, Indonesia."}, {"id": "491cac73-93c9-4509-b141-cf5cd7638e6c", "title": "Hawaiian Electric monitoring stormy weather forecast , urges customers to review emergency plans : Maui Now", "date": "2024-08-22 00:30", "url": "https://mauinow.com/2024/08/21/hawaiian-electric-monitoring-stormy-weather-forecast-urges-customers-to-review-emergency-plans/", "domain": "mauinow.com", "domain_classification": "Unknown", "message": "File PC: Kalani PrinceWith the forecast of possible stormy weather this weekend and its potential impact to Hawaiʻi, Hawaiian Electric advises its customers to review their emergency preparedness plans and be ready for possible outages.\nStrong winds and flooding can damage utility equipment or blow trees and debris into power lines, which can lead to outages.\nWhen the weather improves, power lines must be inspected, possibly involving aerial inspections using helicopters and drones, and any damage must be repaired before service can be restored.\nThe company urges customers to review family and business emergency plans, ensure they have supplies they need on hand, and keep close watch on the development of the storm.\nIf you plan to use a ladder while preparing your home for the storm, note the location of power lines before you begin."}, {"id": "fce892da-c0d9-4097-844b-25bf35d4e397", "title": "Moderate earthquake , 5 . 1 mag has occurred near Kepulauan Babar , Indonesia", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/moderate-earthquake-5-1-mag-has-occurred-near-kepulauan-babar-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Thursday, Kepulauan Babar, Indonesia (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nId of earthquake: us7000n8qw.\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Kepulauan Babar, Indonesia."}, {"id": "614d555b-ec9e-4676-9f84-911b4e8d5a3c", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 00:00", "url": "https://www.squamishchief.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "d3cfdf3e-81f6-4d64-be85-dbaaeb9622bc", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 00:00", "url": "https://www.coastreporter.net/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "5677f4bb-54ec-47f1-be82-eaf2a11c4641", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 00:15", "url": "https://www.burnabynow.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "0e861c9e-efdb-484e-afbf-a5ce872ccf03", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 00:15", "url": "https://www.prpeak.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "699f9ee1-324d-4e4b-87a2-dab4ded21590", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 00:30", "url": "https://www.princegeorgecitizen.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "bc669c2e-3f1d-4070-a0a6-c3304ebd5505", "title": "B . C . wildfires : Drought and risks persist despite cooler weather", "date": "2024-08-22 01:30", "url": "https://bc.ctvnews.ca/weather-and-luck-help-b-c-wildfire-situation-but-drought-and-risks-persist-1.7009802", "domain": "bc.ctvnews.ca", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nForrest Tower with the wildfire service said Wednesday that firefighters had been \"pretty fortunate with the weather conditions,\" enabling them to get many fires under control.\nAreas in southern B.C.\nDrought level five means adverse impacts are almost certain."}, {"id": "98b76274-db03-4cbc-a05a-50d4c9643961", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 01:45", "url": "https://www.nsnews.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "9c9c9680-0866-41ec-8497-62f9bd24e147", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 03:45", "url": "https://www.richmond-news.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "b6c4505e-6f20-4b59-bf47-e3924ecf75a5", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 03:15", "url": "https://www.delta-optimist.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "09ed1730-ac43-4c35-b214-53964c4b1060", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 03:00", "url": "https://www.bowenislandundercurrent.com/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "f5e11293-ac77-47da-843f-04ca63ce3e7d", "title": "Weather and luck help B . C . wildfire situation , but drought and risks persist", "date": "2024-08-22 02:30", "url": "https://www.newwestrecord.ca/bc-news/weather-and-luck-help-bc-wildfire-situation-but-drought-and-risks-persist-9380737", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "this year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nthis year has been less intense than last year's record destruction, drought conditions persist in many regions and the situation could worsen, Emergency Minister Bowinn Ma has warned.\nThe Corya Creek fire is among the 29 per cent of the province's fires that the BC Wildfire Service classifies as burning out of control.\nDrought conditions in other areas are even worse.\nDrought level five means adverse impacts are almost certain."}, {"id": "edf8d946-d64a-43cf-a661-d5a54a60b02c", "title": "  Were stressed out : Local farmers face devastating crop losses , seek federal help", "date": "2024-08-22 02:00", "url": "https://www.wcti12.com/news/local/were-stressed-out-local-farmers-face-devastating-crop-losses-seek-federal-help", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Craven County farmers are fed up and worried about crop losses.\nWe need help,\" says Jason Jones/ Craven County Farm Bureau President.\nSecondly, as we said, there’s gonna have to be a disaster bill passed on the federal level,\" Jones said.\nEastern North Carolina farmers know how devastating natural disasters can be.\nI’m eager to pass the Farm Bill, which would enhance disaster assistance programs that producers rely on to protect their livelihoods and continue feeding America."}, {"id": "3ba5296b-74d6-46ad-bb2b-340b3eac698d", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended", "date": "2024-08-22 05:15", "url": "https://abcnews.go.com/International/wireStory/robots-attempt-sample-melted-nuclear-fuel-japans-damaged-113049691", "domain": "abcnews.go.com", "domain_classification": "International", "message": "An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit nuclear plant has been suspended due to a technical issueA robot's attempt to get a sample of the melted fuel at Japan's damaged nuclear reactor is suspendedTOKYO -- An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "733e0032-29a4-4052-a2e8-91b31a2c2307", "title": "Technical Discussion : A dry stretch with a gradual warming trend", "date": "2024-08-22 11:15", "url": "https://www.wfsb.com/page/technical-discussion-a-dry-stretch-with-a-gradual-warming-trend/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "The high in Bridgeport was 72°, setting a record for March 15th; previously, the record high was 65° from 1990.\n3-6″ fell in the Greater Hartford Area, as well as for inland sections of New Haven, Middlesex, and New London Counties.\nWhen it comes to temperature, it was the 9th warmest with an average temperature of 53.7° (4.2° above normal).\nFor Bridgeport, the record high for Saturday was 72 (from 1961), it was surpassed by 1 degree.\nFrom June 28th through August 12th, every day featured a high temperature at or above 80 in the Hartford Area."}, {"id": "29e3be88-d20c-4d76-bf58-e352452bea2f", "title": "Light earthquake , 4 . 3 mag has occurred near Bulata in Philippines", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-3-mag-has-occurred-near-bulata-in-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 42 kilometers (26 miles) from Bulata in Philippines on Wednesday.\nThe 4.3-magnitude earthquake has occurred at 08:44:38 / 8:44 am (local time epicenter).\nThe epicenter of the earthquake was roughly 43.949 km (27 miles) below the earth’s surface.\nClose country/countries that might be effected, Philippines (c. 99 900 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 42 km W of Bulata, Philippines."}, {"id": "7f638c12-93fd-4091-9546-672b70d74a5f", "title": "A Few Isolated Showers Tomorrow ; Dry Weekend Ahead : The Alabama Weather Blog", "date": "2024-08-22 00:15", "url": "https://www.alabamawx.com/?p=268624", "domain": "alabamawx.com", "domain_classification": "Unknown", "message": "FRIDAY AND THE WEEKEND: The weather looks mostly dry with slowly rising heat levels; highs will be in the 90s Saturday and Sunday.\nNEXT WEEK: An upper ridge will strengthen across the Deep South, meaning hot and mostly dry weather.\nA few isolated showers or storms could show up late in the week, but we still see no evidence of anything really widespread.\nIt would make landfall the following day as a tropical storm at Westerly, Rhode Island with maximum sustained winds of 60 mph.\nLook for the next video briefing here by 6:00 a.m. tomorrow…Category: Alabama's Weather, ALL POSTS, Weather Xtreme Videos"}, {"id": "57a02a2a-3492-4573-806f-d37bf32c694f", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended – Winnipeg Free Press", "date": "2024-08-22 05:15", "url": "https://www.winnipegfreepress.com/arts-and-life/life/sci-tech/2024/08/21/a-robots-attempt-to-get-a-sample-of-the-melted-nuclear-fuel-at-japans-damaged-reactor-is-suspended", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nA device to remove debris from a reactor at the damaged Fukushima Nuclear power plant is revealed in Kobe, western Japan, May 28, 2024.\n(Kyodo News via AP)The pipes were to be used to push the robot inside and pull it back out when it finished.\nThis aerial photo shows the damaged Fukushima Nuclear power plant, sitting in coastal towns of Okuma and Futaba, northeastern Japan, Feb. 11, 2024.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "2de248a2-aeaf-46fd-8dfe-ae4e8b474a2e", "title": "Summery Thursday With Slight Chance For Rain", "date": "2024-08-22 14:15", "url": "http://www.news9.com/story/64de0dd5b95e10088537cebe/summery-thursday-with-slight-chance-for-rain-", "domain": "news9.com", "domain_classification": "Unknown", "message": "There is a slight chance of rain on Thursday afternoon and evening.\nThere is a chance for rain on Friday, mostly in the panhandle and northwest part of the state.\nDrink plenty of water or electrolyte replacement drinks several hours before and during long exposure to the summer heat.\nWear light-colored, loose fitting clothing and a wide-brimmed hat if working outdoors, and take plenty of shade breaks.\nUse the buddy system if working outdoors and check on elderly neighbors."}, {"id": "79f2b3d2-f919-4a0a-bd08-2a3879b333c3", "title": "Monitor changes in your pets with approach of stormy weather", "date": "2024-08-22 12:00", "url": "https://www.royalgazette.com/general/lifestyle/article/20240822/monitor-changes-in-your-pets-with-approach-of-stormy-weather/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "With some reassurance he settled back down and fell asleep, but it illustrates how much more sensitive our animal companions are to subtle changes in weather than perhaps we are.\nHaving said that, I know many people who suffer from weather related headaches and migraines, and a range of other symptoms due to pressure and weather changes.\nDuring the storm itself, the tree frogs went ghostly quiet, and the birds stopped their songs, all hunkered down to avoid the turbulent weather.\nLet’s hope that is the last storm of the season, but when the next inevitable hurricane threatens our beautiful island, pay attention to the changes in your pets.\nThey live at the practice with their two children, Ray and Stella, and their dog, two cats and two guinea pigs."}, {"id": "7e29ffb2-3f84-4010-a1bd-4bd741798057", "title": "25 US States With the Biggest Risk of Flooding", "date": "2024-08-22 02:00", "url": "https://www.insidermonkey.com/blog/25-us-states-with-the-biggest-risk-of-flooding-1338692/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "In this article, we will take a look at 25 US states with the biggest risk of flooding.\nBased in Switzerland, the company offers a multitude of insurance services in over 200 territories and countries, including homeowners’ insurance, flood insurance, and health insurance.\nVirginiaAverage Annual Losses to Flooding: $144,981,713Virginia ranks tenth on our list of US states with the biggest risk of flooding.\nNew JerseyAverage Annual Losses to Flooding: $818,943,074New Jersey is one of the states where most losses come from coastal flooding rather than riverine flooding.\nTexasAverage Annual Losses to Flooding: $1,965,480,712Texas ranks as the first state in our list of US states with the highest risk of flooding."}, {"id": "ff9d3092-1d68-4f7f-8641-57f0724fa2a1", "title": "Light earthquake , 4 . 66 mag strikes near Fern Forest in Hawaii", "date": "2024-08-22 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-66-mag-strikes-near-fern-forest-in-hawaii/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.66 (ml/mb) has struck on Thursday, 14 kilometers (9 miles) from Fern Forest in Hawaii.\nGlobal date and time of event UTC/GMT: 22/08/24 / 2024-08-22 10:52:44 / August 22, 2024 @ 10:52 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 1.2400000095367 km (1 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 14 km S of Fern Forest, Hawaii."}, {"id": "5c41ff5a-91e8-4385-9cf2-bb8b6ab4bb8a", "title": "A robot attempt to get a sample of the melted fuel at Japan damaged nuclear reactor is suspended", "date": "2024-08-22 12:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/a-robots-attempt-to-get-a-sample-of-the-melted-fuel-at-japans-damaged-nuclear-reactor-is-suspended/articleshow/112712523.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "TEPCO said a new start date is undecided.\n\"It seems to me a basic mistake,\" TEPCO spokesperson Kenichi Takahara said of the pipe setup problem.\nHe said officials are investigating and the retrieval mission will resume only after they find the cause and have preventive measures \"so a problem like this should never be repeated.\n\"TEPCO President Tomoaki Kobayakawa said the priority was safety rather than rushing the process.The goal of the operation was to bring back less than 3 grams of an estimated 880 tons of fatally radioactive molten fuel.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "1bbdddb2-2870-4978-8efe-00adc3bb6d91", "title": "Minister urges caution amidst frequent earthquakes", "date": "2024-08-22 06:45", "url": "https://www.jamaicaobserver.com/2024/08/22/minister-urges-caution-amidst-frequent-earthquakes/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "“I want the country to be mindful that earthquakes don’t set up like rain.\nJamaica is one of the top-tier countries when it comes on to disaster… We sit right in that fault line of earthquakes.\nSince October 30 last year to around January of this year Jamaica has experienced over 577 felt earthquakes ranging from a magnitude of 3.4.\n“When there is a hurricane notice, listen to what the media is saying, don’t listen to social media that creates all sorts of mischief, because social media is having it to say that I am sick and drop down yesterday and in the hospital.\nThat is a part of what social media is used for — to distort the facts and create mischief,” charged McKenzie."}, {"id": "0ffb7761-d9ac-49b0-be98-d1aa0ef44553", "title": "As DNREC repairs dune breach , more work will need to be done in future", "date": "2024-08-22 02:00", "url": "https://www.delawarepublic.org/politics-government/2024-08-21/as-dnrec-repairs-dune-breach-more-work-will-need-to-be-done-in-future", "domain": "delawarepublic.org", "domain_classification": "Unknown", "message": "After this past weekend’s dune breach near Route 1, DNREC is still repairing the dunes north of the Indian River Inlet Bridge.\nIn the hours following the breach, Route 1 was closed in both directions near the bridge because of flooding.\nDNREC doesn’t typically use hardened shoreline remedies, but the immediate urgency of this breach called for it to protect critical highway infrastructure.\nSand is also being trucked in - with the help of DelDOT – to use along with the rip rap rock to build the dune back up.\nDNREC notes different options exist for more stone to be placed at the most weakened section of the dune which is a likely location for another breach."}, {"id": "a73250b2-5c7d-4e24-9130-a4a033a67841", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-22 02:30", "url": "https://www.cbc.ca/news/canada/north/western-alaska-yup-ik-village-floods-as-river-rises-from-a-series-of-storms-1.7301532", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Napakiak, a Yup'ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nConditions beforehand were \"pretty brutal,\" with winds and a lot of rain, said Job Hale, the minister of Armory of God Baptist Church.\nWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024.\nNavigating erosionWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024.\nWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024."}, {"id": "44572b90-7f02-4fdf-ab55-1df2382d7885", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended", "date": "2024-08-22 06:15", "url": "https://abcnews.go.com/Technology/wireStory/robots-attempt-sample-melted-nuclear-fuel-japans-damaged-113049701", "domain": "abcnews.go.com", "domain_classification": "International", "message": "An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit nuclear plant has been suspended due to a technical issueA robot's attempt to get a sample of the melted fuel at Japan's damaged nuclear reactor is suspendedTOKYO -- An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "25f9c2f0-284d-4d7e-8eef-cd63d855e78e", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended", "date": "2024-08-22 06:00", "url": "https://www.ksat.com/news/world/2024/08/22/a-robots-attempt-to-get-a-sample-of-the-melted-nuclear-fuel-at-japans-damaged-reactor-is-suspended/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(TEPCO via AP)TOKYO – An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "70aa5468-2a64-4f0b-a7a5-e1b538eecd09", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended", "date": "2024-08-22 06:15", "url": "https://www.clickondetroit.com/news/world/2024/08/22/a-robots-attempt-to-get-a-sample-of-the-melted-nuclear-fuel-at-japans-damaged-reactor-is-suspended/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(TEPCO via AP)TOKYO – An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "54129479-e859-4692-a80a-63e97a89da4f", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended", "date": "2024-08-22 06:45", "url": "https://www.clickorlando.com/news/world/2024/08/22/a-robots-attempt-to-get-a-sample-of-the-melted-nuclear-fuel-at-japans-damaged-reactor-is-suspended/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(TEPCO via AP)TOKYO – An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nThe small sample will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "be8b0575-3cec-4e20-8b0c-7540d67f0816", "title": "Hurricane Katrina Anniversary Spurs Hard Push For AM Radio Act", "date": "2024-08-22 12:15", "url": "https://radioink.com/2024/08/22/hurricane-katrina-anniversary-spurs-hard-push-for-am-radio-act/", "domain": "radioink.com", "domain_classification": "Unknown", "message": "Directed to House Speaker Mike Johnson and Majority Leader Steve Scalise, Honoré’s letter highlights the crucial role of AM radio in emergencies, as demonstrated during Hurricanes Katrina and Ida.\nThis group has a direct understanding of the critical role AM radio plays in emergencies—providing life-saving information when other communication infrastructures fail.\nNOAA predicts an above-average hurricane season, expecting 17-24 named storms, with 8-13 potentially becoming hurricanes.\nNumerous FEMA executives and administrators, past and present, have come out in staunch support of the AM For Every Vehicle Act.\nThis includes Michael Brown, who was the FEMA leader during Hurricane Katrina."}, {"id": "4115e260-67d0-4055-a2f1-4c97d229b289", "title": "Map : Tracking Tropical Storm Shanshan - The New York Times", "date": "2024-08-22 13:45", "url": "https://www.nytimes.com/interactive/2024/08/22/weather/shanshan-map-path-tracker.html", "domain": "nytimes.com", "domain_classification": "International", "message": "Tracking Tropical Storm ShanshanShanshan was a tropical storm in the Philippine Sea late Thursday Japan time, the Joint Typhoon Warning Center said in its latest advisory.\nThe tropical storm had sustained wind speeds of 52 miles per hour.\nFlash flooding can occur well inland and away from the storm’s center.\nSource: NOAA By The New York TimesTyphoon season is year-round; however, most typhoons form from early July through mid-December.\nMost typhoons scrape or strike places like the Philippines, Japan and Taiwan; they can also hit the Korean Peninsula, China and Vietnam, bringing damaging winds and storm surges."}, {"id": "ce82ae11-e847-46bc-a156-d6c8406273cd", "title": "Wilton Cannon Grange dries out after flood for Agricultural Fair", "date": "2024-08-22 13:00", "url": "http://www.thehour.com/news/article/cannon-grange-wilton-agricultural-fair-floods-19706866.php", "domain": "thehour.com", "domain_classification": "Unknown", "message": "Tiffany Shelton from RSKS Photography/contributed photo Tiffany Shelton captured flooding in Cannondale Village in Wilton during the heavy rainstorm on Sunday, Aug. 18, 2024.\nTiffany Shelton from RSKS Photography/contributed photo Tiffany Shelton captured flooding in Cannondale Village in Wilton during the heavy rainstorm on Sunday, Aug. 18, 2024.\nTiffany Shelton from RSKS Photography/contributed photo Tiffany Shelton captured flooding in Cannondale Village in Wilton during the heavy rainstorm on Sunday, Aug. 18, 2024.\nTiffany Shelton from RSKS Photography/contributed photo Tiffany Shelton captured flooding in Cannondale Village in Wilton during the heavy rainstorm on Sunday, Aug. 18, 2024.\nTiffany Shelton from RSKS Photography/contributed photoWILTON — Despite being underwater last Sunday, the Cannon Grange grounds are now dry, and the 92nd annual Agricultural Fair is happening this Sunday."}, {"id": "3c5d0488-2c64-4bb4-b4d8-23c5c5f423e2", "title": "A robot attempt to get a sample of the melted fuel at Japan damaged nuclear reactor is suspended", "date": "2024-08-22 13:00", "url": "https://www.whec.com/science-technology/a-robots-attempt-to-get-a-sample-of-the-melted-fuel-at-japans-damaged-nuclear-reactor-is-suspended/", "domain": "whec.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nA device to remove debris from a reactor at the damaged Fukushima Nuclear power plant demonstrates to pinch a stone, as revealed in Kobe, western Japan, May 28, 2024.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "a2ea9909-ad7f-4420-ad8b-5456a9f334b8", "title": "Wildfire Pollution Promotes Asthma Hospitalizations", "date": "2024-08-22 10:15", "url": "https://www.medscape.com/viewarticle/short-term-wildfire-pollution-promotes-asthma-2024a1000fd2", "domain": "medscape.com", "domain_classification": "Unknown", "message": "Higher levels of air pollution from wildfires were associated with significant spikes in hospitalizations for asthma and a slight increase in hospitalizations for chronic obstructive pulmonary disease (COPD) in surrounding areas, based on data from approximately 80,000 individuals.\nIn the current study, Horne and colleagues expected to see increases in the risk for asthma and COPD during summer wildfire season.\n\"This includes evaluating what biomarkers in the blood are changed by air pollution such as inflammatory factors, determining whether some medications may block or reduce the adverse effects of air pollution, and examining whether masks or indoor air purifiers have a meaningful benefit in protecting health during short-term air pollution elevations,\" he said.\n\"These data underscore the increased risk of wildfire-related air pollution relative to 'traditional sources of air pollution from industrial and transportation sources,\" he added.\nAlthough the adverse effects of exposure to wildfire smoke and inversion season pollution on asthma were not unexpected, the degree of the effect size of wildfire smoke relative to inversion season was surprising, Rabin told Medscape Medical News."}, {"id": "3007f569-5668-4956-b2b1-5b10eac970ca", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:00", "url": "https://www.peacearchnews.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "peacearchnews.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "e00bb932-5f52-4abf-ad89-085887037bca", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:00", "url": "https://www.wltribune.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "wltribune.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "6ce3d410-382b-4721-8c5e-6b5257389076", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:00", "url": "https://www.campbellrivermirror.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "campbellrivermirror.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "ffaeb029-c7c5-4dcf-a6a5-950bdfc2426a", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 01:00", "url": "https://www.kelownacapnews.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "4ccc0c75-43a9-48c9-abbe-0d690497deec", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 01:15", "url": "https://www.comoxvalleyrecord.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "comoxvalleyrecord.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "cce7e021-eca6-4d3e-aa34-42c5ffafd68f", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:15", "url": "https://www.vicnews.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "vicnews.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "19ca0e28-8fbd-439b-a395-bc15605136fa", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:15", "url": "https://www.thefreepress.ca/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "thefreepress.ca", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "f0de0c38-91e1-498e-9abc-03c62b6d01e0", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:15", "url": "https://www.quesnelobserver.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "quesnelobserver.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "5ac7884b-02e7-4482-8c41-8435cb01f8a8", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:30", "url": "https://www.cowichanvalleycitizen.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "cowichanvalleycitizen.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "b1f6fc15-8bb0-41e4-97e2-47e2011f900e", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:30", "url": "https://www.interior-news.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "interior-news.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "7e9c9f88-de63-47e8-bad6-09c34a95a647", "title": "  It is no way to live : New flood initiative welcomed by Shrewsbury businesses", "date": "2024-08-22 06:15", "url": "https://www.shropshirestar.com/news/local-hubs/shrewsbury/2024/08/22/it-is-no-way-to-live-new-flood-initiative-welcomed-by-shrewsbury-businesses/", "domain": "shropshirestar.com", "domain_classification": "Unknown", "message": "Watch more of our videos on ShotsTV.com and on Freeview 262 or Freely 565The National Flood Forum, Shropshire Council, and Shrewsbury BID are asking for businesses in Shrewsbury impacted by flooding, whether directly or indirectly, to get involved in a new Flood Action Group, which is focused on their issues.\nMs Connor who runs a PR agency from her home in the town, is chair of Shrewsbury Flood Action Group and welcomed the move.\nThe first will be 'identification of key impacts – understanding the specific ways in which flooding affects businesses'.\nFinally the group will also be tasked with considering the 'true economic impact' of flooding on businesses in the town.\nThe next drop-in session of the new Flood Action Group takes place on Tuesday, August 27 at the Hive from 3.30pm to 6.30pm."}, {"id": "f54c60e0-1784-4bc3-8440-22cb2586e181", "title": "Robot attempt to retrieve nuclear fuel sample at Japan reactor suspended", "date": "2024-08-22 07:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_381029.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nDespite the small amount of the debris sample, it will provide key data to develop future decommissioning methods and necessary technology and robots, experts say.\nBetter understanding of the melted fuel debris is key to decommissioning the three wrecked reactors and the entire plant.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "a1ccdd20-87bc-4d5e-b1f9-a625196a2bdc", "title": "Canadian wildfire smoke hits European skies after travelling 4 , 000 km", "date": "2024-08-22 04:30", "url": "https://www.theweathernetwork.com/en/news/weather/severe/canadian-wildfire-smoke-hits-european-skies-after-travelling-4-000-km-ireland", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "As a result, hazy sunsets have been seen across Europe including Ireland.\nCANADA'S WILDFIRES: Visit The Weather Network's wildfire hub to keep up with the latest on the active start to wildfire season across Canada.\nIt was reported that wildfire smoke from Canada has been trekking across the North Atlantic since Aug. 10, finally hitting Western Europe on Aug. 17.\nThe result, aside from the picturesque sunsets and moon rises, has been a vast increase in levels of particulate matter and aerosols such as smoke particles in Ireland, the United Kingdom, France and Scandinavia.\nThat amounts to just more than 80 megatonnes of total estimated emissions for Canada in August, approaching the 2023 tally in which the country experienced its highest carbon emissions for the month since 2003, CAMS added."}, {"id": "0e9e2943-dfe4-4006-b3b9-fb9b4a91a838", "title": "Hurricane Gilma now a Category 2 and expected to intensify , forecasters say", "date": "2024-08-22 00:00", "url": "https://lethbridgeherald.com/news/world-news/2024/08/21/hurricane-gilma-now-a-category-2-and-expected-to-intensify-forecasters-say/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Hurricane Gilma now a Category 2 and expected to intensify, forecasters sayBy The Associated Press on August 21, 2024.\nThis image provided by the National Oceanic and Atmospheric Administration shows Tropical Storm Gilma, at center, Monday, Aug. 19, 2024.\n(National Oceanic and Atmospheric Administration via AP) This image provided by the National Oceanic and Atmospheric Administration shows Tropical Storm Gilma, at center, Monday, Aug. 19, 2024.\n(National Oceanic and Atmospheric Administration via AP)MEXICO CITY (AP) – Gilma strengthened into a Category 2 hurricane Wednesday afternoon in the eastern Pacific Ocean and was forecast to become a major hurricane as soon as Thursday.\nHurricane Gilma was located about 975 miles (1,570 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami."}, {"id": "2e79626e-eb65-4d57-95fd-bcd4d6b8e46a", "title": "Hurricane Gilma now a Category 2 and expected to intensify , forecasters say", "date": "2024-08-22 06:15", "url": "https://halifax.citynews.ca/2024/08/21/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land/", "domain": "halifax.citynews.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a Category 2 hurricane Wednesday afternoon in the eastern Pacific Ocean and was forecast to become a major hurricane as soon as Thursday.\nHurricane Gilma was located about 975 miles (1,570 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 4 hurricane by Thursday afternoon, forecasters said.\nGilma had strengthened to tropical storm status on Sunday.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "f6cc735c-52e0-4535-b331-0a1278d7b1f0", "title": "Hurricane Gilma now a Category 2 and expected to intensify , forecasters say", "date": "2024-08-22 03:15", "url": "https://www.ktsa.com/hurricane-gilma-now-a-category-2-and-expected-to-intensify-forecasters-say/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a Category 2 hurricane Wednesday afternoon in the eastern Pacific Ocean and was forecast to become a major hurricane as soon as Thursday.\nHurricane Gilma was located about 975 miles (1,570 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 4 hurricane by Thursday afternoon, forecasters said.\nGilma had strengthened to tropical storm status on Sunday.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "65443e6b-c985-45ed-ae54-d9c85c6192b6", "title": "Flooded farmers  forgotten about  by government", "date": "2024-08-22 06:15", "url": "https://www.yahoo.com/news/flooded-farmers-forgotten-government-052238889.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Farm Recovery Fund was set up by the previous government to support farmers whose land had been damaged by flooding during Storm Babet and Storm Henk.\nSome early claimants received payment in July but a second eligible group - thought to include several thousand farmers - is still waiting for financial support.\nHenry Ward's farm at Shortferry near Lincoln was included in May's expanded support scheme.\nHe is angry that eight months on from the winter floods he has not received anything from the Farm Recovery Fund.\nFollowing complaints from farmers, the scheme was expanded in May to include many more farms that had been hit by over-topping rivers and exceptionally heavy rainfall."}, {"id": "a5205c81-4ba5-4830-86f4-d6ad0589c30c", "title": "Work to remove nuclear fuel at Fukushima plant postponed again | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-22 05:00", "url": "https://www.asahi.com/ajw/articles/15397031", "domain": "asahi.com", "domain_classification": "Unknown", "message": "1 nuclear power plant in Okuma, Fukushima Prefecture (Asahi Shimbun file photo)Tokyo Electric Power Co. on Aug. 22 again postponed a long-awaited test to remove melted nuclear fuel from the stricken Fukushima No.\n1 power plant, citing a mistake in equipment installation.\nTEPCO’S plan was to open an isolation valve, insert a simple “fishing rod-type device,” and move it on a path toward the reactor containment vessel via remote control.\nThe only way to remove the fuel debris is to use a remote-controlled robot.\nAn estimated 880 tons of melted fuel debris accumulated at the plant’s No."}, {"id": "1b75738f-ed3c-4d8b-b9c0-46f560c22313", "title": "St . Martin News Network - EOC Meets to Debrief on the Passing of Tropical Storm Ernesto . ", "date": "2024-08-22 03:00", "url": "https://www.smn-news.com/index.php/st-maarten-st-martin-news/45865-eoc-meets-to-debrief-on-the-passing-of-tropical-storm-ernesto.html", "domain": "smn-news.com", "domain_classification": "Unknown", "message": "PHILIPSBURG(DCOMM):--- The Emergency Operations Center (EOC) met at the Government Administration Building on Wednesday to debrief on the national response to the passing of Tropical Storm Ernesto, the fifth named storm of the 2024 Atlantic hurricane season.\nEach Emergency Support Function (ESF), which makes up the essential core of the country’s national disaster system, was presented for the meeting gave a presentation.\nFire Chief/Disaster Coordinator Clive Richardson said that the passing of Tropical Storm Ernesto tested all areas and levels of emergency response.\nRichardson said the passing of the storm allowed the individual ESFs to fine-tune their emergency response mechanisms in preparation for the next system.\nThe remaining storm names for the 2024 Atlantic hurricane season are Francine, Gordon, Helene, Isaac, Joyce, Kirk, Leslie, Milton, Nadine, Oscar, Patty, Rafael, Sara, Tony, Valerie, and William."}, {"id": "8eafec9e-a44b-43b3-9493-3f684006b898", "title": "Houstonians still facing cleanup delays months after May storm and Hurricane Beryl", "date": "2024-08-22 00:30", "url": "https://abc13.com/post/houstonians-still-facing-storm-clean-up-delays/15214926/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Houstonians still facing delays in storm damage cleanup: 'Nothing is done'It's been three months since the May storm and a month since Beryl, and crews are only halfway done with cleaning up the mess left behind.\nIt's been three months since the May storm and a month since Beryl, and crews are only halfway done with cleaning up the mess left behind.\nIt's been three months since the May storm and a month since Beryl, and crews are only halfway done with cleaning up the mess left behind.\nHouston city crews have been working overtime since May.\nThey were still picking up storm debris from May's storm when Hurricane Beryl hit."}, {"id": "8f493093-5f12-432e-8ae4-05ef31626bb7", "title": "Ernesto showed we work best together", "date": "2024-08-22 12:00", "url": "https://www.royalgazette.com/opinion-writer/opinion/article/20240822/ernesto-showed-we-work-best-together/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "First Prev 1 2 Next LastBermudians got together to ensure the mark left by Ernesto was not lasting (Photograph by Blaire Simmons)On behalf of the Progressive Labour Party, I wish to express my heartfelt gratitude that Bermuda was spared the loss of life and extensive damage during Hurricane Ernesto.\nWe are deeply thankful for the resilience and unity displayed by our community in the face of this formidable storm.\nWe owe them our deepest thanks for their professionalism and sacrifice, working around the clock to protect and serve us all.\nLet us continue to work hand-in-hand to build Bermuda for the future — not just in times of crisis but every day.\nDawn Simmons is the chairwoman of the Progressive Labour Party• Dawn Simmons is the chairwoman of the Progressive Labour Party"}, {"id": "229e5786-1e72-4f28-af11-0903eaa1a2d7", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 12:15", "url": "https://www.mymotherlode.com/news/latin/3411818/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at seaGilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea View PhotoMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nGilma was moving west-northwest at 6 mph (9 kph).\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "1ca2d108-6cb6-4cec-8fab-dd9112ec2fce", "title": "Five earthquakes hit Kon Tum Kon Plong district on August 22", "date": "2024-08-22 12:15", "url": "https://en.vietnamplus.vn/five-earthquakes-hit-kon-tums-kon-plong-district-on-august-22-post292360.vnp", "domain": "en.vietnamplus.vn", "domain_classification": "Unknown", "message": "Five earthquakes struck Kon Plong district in the Central Highlands province of Kon Tum on August 22, according to the Earthquake Information and Tsunami Warning Center under the Institute of Geophysics.\nIllustrative photo (Photo: VNA)Hanoi (VNA) – Five earthquakes struck Kon Plong district in the Central Highlands province of Kon Tum on August 22, according to the Earthquake Information and Tsunami Warning Center under the Institute of Geophysics.\nPreviously, on the same day, four consecutive earthquakes of respective magnitudes of 2.5, 2.9, 3.0 and 4.4, with a focal depth of about 8.0-8.3 km, also hit the same district.\nEarthquakes have occurred regularly in Kon Plong since 2021.\nAccording to Director of the Institute of Geophysics Dr. Nguyen Xuan Anh, Kon Tum in general and Kon Plong in particular belongs to a small fault, which see earthquakes with magnitude not exceeding 5.0."}, {"id": "28086b3b-2879-4785-a27d-02e21900ca41", "title": "Warning as Storm Lilian set to bring heavy rain to Angus", "date": "2024-08-22 12:00", "url": "https://www.thecourier.co.uk/fp/news/angus-mearns/5065197/storm-lilian-rain-warning-angus/", "domain": "thecourier.co.uk", "domain_classification": "Unknown", "message": "A 12-hour weather warning has been issued for parts of Angus with Storm Lilian set to bring heavy rain to the region.\nThe Met Office has issued a yellow warning from 9pm on Thursday until 9am on Friday.\nAccording to the Met Office, the Angus coast between Montrose and Carnoustie may see up to 50mm of rain falling, which could lead to flooding.\nThe Met Office says public transport may also be affected and spray on the roads could lead to increased journey times.\nMet Office chief meteorologist Jason Kelly said: “Within the warning area, 50mm of rain is possible over high ground, with 20-30mm falling quite widely."}, {"id": "afacf77e-ae7e-451a-bd4b-ea3a7cc6946a", "title": "Point of view", "date": "2024-08-22 02:45", "url": "https://monocle.com/magazine/issues/176/point-of-view/", "domain": "monocle.com", "domain_classification": "Unknown", "message": "— LHow did you arrive at the decision to practise landscape architecture?\nHistorically, landscape architecture hasn’t necessarily been practised to its full potential.\nTell us about your planned work on the Dia Art Foundation’s Dia Beacon site and why the museum approached you to redesign its grounds.\nArchitectural modelIs landscape architecture as a field going in the right direction when engaging with social and environmental issues?\nFrom there, he launched the profession of landscape architecture."}, {"id": "a441bbc7-5d21-4d53-8b55-6b4b0d963c1a", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 12:15", "url": "https://www.newwestrecord.ca/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "88d05b6f-5b25-4661-91ec-363c47dcd69f", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 12:15", "url": "https://www.bowenislandundercurrent.com/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "4a2f10e3-fce7-4f22-a32f-3b3ab6215812", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 11:00", "url": "https://www.nsnews.com/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "95b1ef07-b1c0-4b9e-8dc1-d8d33bb5b7e5", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 10:45", "url": "https://www.thereminder.ca/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "b5d3315f-6f9b-463d-b3af-28a9f36e9781", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 10:45", "url": "https://www.thompsoncitizen.net/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "4f37c506-2324-4082-999b-fb2bf714dc87", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 13:00", "url": "https://www.delta-optimist.com/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "1c8e59f9-b745-48f1-aaba-922f52ee9b3a", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 13:45", "url": "https://www.prpeak.com/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "f410cd72-4c59-4f1d-96e1-680f7ddf4266", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 14:00", "url": "https://www.fitzhugh.ca/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385220", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "c644db0a-b5c1-4909-ad3b-4936b88a37df", "title": "Gilma becomes a powerful Category 3 hurricane and is forecast to strengthen as it stays at sea", "date": "2024-08-22 14:30", "url": "https://www.burnabynow.com/world-news/gilma-becomes-a-powerful-category-3-hurricane-and-is-forecast-to-strengthen-as-it-stays-at-sea-9385238", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nMEXICO CITY (AP) — Gilma strengthened into a powerful Category 3 hurricane Thursday in the eastern Pacific Ocean and was forecast to remain a powerful hurricane for the next couple of days while staying away from land.\nThe storm was located about 1,025 miles (1,649 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nGilma had strengthened to tropical storm status on Sunday and grown more powerful since then.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 125 miles (205 kilometers)."}, {"id": "11095e76-ef01-4a55-b05b-2c5278c228d2", "title": "Caribbean nations still facing humanitarian crisis weeks after Hurricane Beryl destruction", "date": "2024-08-22 14:30", "url": "https://www.theguardian.com/world/article/2024/aug/22/caribbean-nations-still-facing-humanitarian-crisis-weeks-after-hurricane-beryl-destruction", "domain": "theguardian.com", "domain_classification": "International", "message": "Six weeks on, nature has calmed down, reverting to the quiet, stunning beauty that defines SVG.\nFor some people in shelters, it is still hard to imagine returning to the new reality that Beryl left in its wake.\nView image in fullscreen Humanitarian organisations were shocked by the damage caused by Beryl on Union.\nSome Hurricane Beryl survivors echo government concerns that more support should be given to those living on the frontline of the climate crisis.\nLavia, from Union, said: “So much is being done to destroy the planet, and then these kinds of things happen."}, {"id": "72962078-ff53-4344-a4bf-676c5e7794b1", "title": "Caribbean nations still facing humanitarian crisis weeks after Hurricane Beryl destruction", "date": "2024-08-22 14:15", "url": "https://www.aol.co.uk/news/caribbean-nations-still-facing-humanitarian-133729770.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "A man stands by a destroyed business in Clifton, on the island of Union, which bore the brunt of the damage from Hurricane Beryl.\nSix weeks on, nature has calmed down, reverting to the quiet, stunning beauty that defines SVG.\nFor some people in shelters, it is still hard to imagine returning to the new reality that Beryl left in its wake.\nSome Hurricane Beryl survivors echo government concerns that more support should be given to those living on the frontline of the climate crisis.\nLavia, from Union, said: “So much is being done to destroy the planet, and then these kinds of things happen."}, {"id": "f782877e-f66d-45b2-8acd-d06251dc6a6a", "title": "Smyrna man fighting for answers to save his home after flooding in Cobb County", "date": "2024-08-22 12:15", "url": "https://www.wsbtv.com/news/local/smyrna-man-fighting-answers-save-his-home-after-flooding-cobb-county/FW5AVIZWWNE2TP5IC3VLIZCJBM/", "domain": "wsbtv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "c383bc31-f8bd-4a7e-b186-419b0790e802", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 03:45", "url": "https://www.piquenewsmagazine.com/must-reads/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "piquenewsmagazine.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "024ffa95-3658-45b9-aabd-26ec68fafd36", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 03:45", "url": "https://www.richmond-news.com/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "d6891829-5b69-4a62-bce8-a738a39d1a1e", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 03:45", "url": "https://www.tricitynews.com/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "46024f1d-e6f8-4e45-bb94-589c7113e74d", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 03:15", "url": "https://www.delta-optimist.com/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "02364c4a-f4b8-4eb9-a998-40bf0556e7bc", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 03:00", "url": "https://www.bowenislandundercurrent.com/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "0bf074fd-7ba5-4eb0-8a95-e53588c96988", "title": "As the world burns : the art and science of responding to B . C . wildfires", "date": "2024-08-22 02:30", "url": "https://www.newwestrecord.ca/highlights/as-the-world-burns-the-art-and-science-of-responding-to-bc-wildfires-9379298", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "Wildfires impact our lives and our communities — what does science say about how they happen, and how to respond?\nEvery morning during the months-long fire season, Matt MacDonald, lead fire weather forecaster with the BC Wildfire Service, examines conditions with his team and hundreds of frontline firefighters.\nWe should know how fires are fought.”Why is it so challenging to fight wildfires in B.C.?\nMacDonald, who worked as an Environment Canada meteorologist for 18 years before joining the BC Wildfire Service in 2020, said he’s witnessed underlying climatic conditions intensify over the past two decades.\nThis year, a 24-year-old firefighter with the Alberta Wildfire service died while responding to the Jasper fire."}, {"id": "5092f49d-2154-4923-8d70-85437813657e", "title": "Smyrna man fighting for answers to save his home after flooding in Cobb County", "date": "2024-08-22 13:00", "url": "https://www.wsbradio.com/news/local/smyrna-man-fighting-answers-save-his-home-after-flooding-cobb-county/3UOOSI2WSRB2PDKOF4AKZBHK4U/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "9b151031-5146-4d78-82dc-6e15db51c3ae", "title": "Sicily Divers Seek Last Missing From united kingdom Tycoon Shipwreck", "date": "2024-08-22 12:15", "url": "https://www.urdupoint.com/en/world/sicily-divers-seek-last-missing-from-uk-tycoo-1855850.html", "domain": "urdupoint.com", "domain_classification": "Unknown", "message": "Porticello, (APP - UrduPoint / Pakistan Point News - 22nd Aug, 2024) Searches resumed Thursday for the last person missing after a superyacht carrying UK tech tycoon Mike Lynch sank off Sicily, with divers recovering a fifth body from the wreck.\nSpecialist divers working with an underwater robot on Wednesday pulled up four bodies from the wreck of the \"Bayesian\", while another was pulled up on Thursday morning, according to AFP reporters.\nThere was no official identification of the bodies, but Lynch and his 18-year-old daughter Hannah were among the six passengers missing.\nLynch and his daughter, his lawyer Christopher Morvillo and his wife Neda, and Jonathan Bloomer, the chair of Morgan Stanley International, and his wife Judy, were all reported missing.\n\"A Perini ship resisted Hurricane Katrina, a category 5 (hurricane)."}, {"id": "de7b5dfb-79ff-4be0-a1d7-401f987dcc04", "title": "Storm Lilian to batter united kingdom with warning of power cuts and  dangerous conditions  ", "date": "2024-08-22 13:45", "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/storm-lilian-batter-uk-warning-9501588", "domain": "stokesentinel.co.uk", "domain_classification": "Unknown", "message": "Sign up to our newsletterFamilies are being warned of power cuts and 'potentially damaging gusts' as Storm Lilian takes aim at the UK.\nStorm Lilian is expected to move north east early on Friday morning and will cause problems across northern parts of England along with Wales and southern Scotland.\nThe heavy rain and powerful winds could lead to 'potential travel disruption, the possibility of power cuts and dangerous conditions near coasts.'\nStorm Lilian - the 12th named storm of the 'naming season' - is expected to move into the North Sea on Friday morning with wind speeds reducing and scattered showers remaining.\nThere’s associated rainfall with Lilian that has also resulted in a Met Office warning for parts of Scotland."}, {"id": "ea1e0f6a-2700-49dd-a1bd-f03ab2be691b", "title": "Storm Lillian to batter Scotland as new wind and rain warnings issued", "date": "2024-08-22 12:00", "url": "https://www.dailyrecord.co.uk/lifestyle/storm-lillian-batter-scotland-new-33516902", "domain": "dailyrecord.co.uk", "domain_classification": "Unknown", "message": "The Met Office has named the latest storm that's set to bring grim conditions to Scotland and wider Britain.\n\"There’s associated rainfall with Lilian that has also resulted in a Met Office warning for parts of Scotland.\nThe Met Office has warned that road and bridges closures as well as public transport cancellations are likely.\nIf either of the yellow weather warnings affect your area, it's important to be prepared for worst case scenarios.\nThe Met Office recommends staying up to date with the weather forecast in your area as weather warnings can change quickly."}, {"id": "a566eae9-76f7-4cb0-b2d5-e9a059e8228f", "title": "Love Seafood and Steaks temporarily closed after heavy flooding from Debby", "date": "2024-08-22 12:00", "url": "https://www.wtoc.com/2024/08/22/loves-seafood-steaks-closes-doors-after-heavy-flooding-debby/", "domain": "wtoc.com", "domain_classification": "Unknown", "message": "CHATHAM COUNTY, Ga. (WTOC) - Beloved local seafood restaurant Love’s Seafood and Steaks are just one of the hundreds of buildings cleaning up after Topical Storm Debby put them out of commission.\nObadiah Love and his wife Donna have been running Loves Seafood and Steaks from most of their lives and a day off wasn’t something they got often, but they never seemed to mind.\nAccording to the Love, the flood waters have cost them at least a quarter of a million dollars in repairs, that’s not including, inventory, wages or equipment.\nSomething that flood insurance would have covered… if this happened, last year.\n“We have been paying for flood insurance for what, 30 years?"}, {"id": "ed0097fa-e544-4ee2-a9f1-4ae3a5ff79de", "title": "State legislature approves $10 billion plan that will appear on the 2024 ballot here what it could fund", "date": "2024-08-22 07:30", "url": "https://www.yahoo.com/news/state-legislature-approves-10-billion-050000589.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "State legislature approves $10 billion plan that will appear on the 2024 ballot — here's what it could fundCalifornia's November 2024 election ballot will include a $10 billion equity-focused climate resilience bond.\nAs The Hill reported in July, the California Legislature agreed to the bond's terms after addressing state budget cuts for climate initiatives.\nThe Legislature will apply funds to eight different categories related to climate resilience.\nThe investment will include $3.8 billion for safe drinking water, drought, flood, and water resilience, along with $1.5 billion for wildfire and forest resilience.\n\"I will be voting yes for the climate,\" one social media user on X, previously known as Twitter, commented on the $10 billion climate investment news."}, {"id": "643c684e-6810-40e3-a327-3cb4f620bd21", "title": "Hurricane sparks greater interest in solar power", "date": "2024-08-22 12:00", "url": "https://www.royalgazette.com/local-business/business/article/20240822/hurricane-sparks-greater-interest-in-solar-power/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "Kristian Smith, solar concierge at Greenlight Energy, received more than 20 calls from the solar-curious even before the storm ended.\n“Year after year, hurricanes definitely impact our incoming calls,” Mr Smith said.\n“Whenever there is a Belco outage, or an increase in the price of electricity, we always get more calls.”People expressed interest in installing solar panels and also solar batteries.\n“Without battery power, solar panels do not work when the grid is off,” Mr Smith explained.\nMr Hatfield, at Be Solar, said people are increasingly looking at solar panels as a way to increase their property values."}, {"id": "fad9a0d0-1114-4903-966e-f6ce673037cb", "title": "5 Bodies Recovered In united kingdom Tycoon Shipwreck , Divers Seek Last Missing Person", "date": "2024-08-22 11:00", "url": "https://www.ndtv.com/world-news/6-bodies-recovered-in-uk-tycoon-shipwreck-divers-seek-last-missing-person-6392369", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Fifteen people were rescued, including Mike Lynch's wife and a woman with a one-year-old baby.\nSearches resumed Thursday for the last person missing after a superyacht carrying UK tech tycoon Mike Lynch sank off Sicily, with divers recovering a fifth body from the wreck.\nThere was no official identification of the bodies, but Lynch and his 18-year-old daughter Hannah were among the six passengers missing.\n\"A Perini ship resisted Hurricane Katrina, a category 5 (hurricane).\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"id": "43a4aadc-8379-4902-89e2-bbe376768d1d", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:45", "url": "https://www.aldergrovestar.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "aldergrovestar.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "bb39ca06-5345-440f-b5e0-4de030d5b7d1", "title": "Hurricane Season Isnt Finished : Texas Sees Increased Activity", "date": "2024-08-22 03:30", "url": "https://kfyo.com/ixp/189/p/texas-increased-hurricane-activity/", "domain": "kfyo.com", "domain_classification": "Unknown", "message": "What's in Store for Hurricane Season?\nHurricane season runs from June 1st to November 30th, and the peak of the season is typically during August and September.\nThe 2024 hurricane season outlook projects 90% of Atlantic tropical storms to be above normal strength.\n“The hurricane season got off to an early and violent start with Hurricane Beryl, the earliest category-5 Atlantic hurricane on record.\nHurricane Beryl Makes Landfall In Texas Gallery Credit: Rob CarrollLearn the 21 Storm Names for the 2024 Hurricane Season in Texas June brings the official start of summer."}, {"id": "977d1248-bd03-4921-b41d-a47153086a21", "title": "Latest body found in Sicily yacht wreck is united kingdom Lynch : Italian media", "date": "2024-08-22 10:30", "url": "https://www.hurriyetdailynews.com/latest-body-found-in-sicily-yacht-wreck-is-uks-lynch-italian-media-199813", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Latest body found in Sicily yacht wreck is UK's Lynch: Italian mediaPORTICELLO, ItalyDivers of the Vigili del Fuoco, the Italian Corps.\nof Firefighters arrive in Porticello harbor near Palermo, with a third body at the back of the boat on Aug. 21, 2024, two days after the British-flagged luxury yacht Bayesian sank.\nThe latest body recovered from the sunken luxury yacht off Sicily has been identified as UK tech tycoon Mike Lynch, who had been missing along with six others, according to Italian media reports on Thursday.\nSpecialist divers were searching for the last person missing after the superyacht sank in a pre-dawn storm off the Italian island on Monday.\nThe 56-meter (185-foot) British-flagged yacht was anchored approximately 700 meters off Porticello, near Palermo in northern Sicily, when it was suddenly hit by a waterspout, resembling a mini-tornado."}, {"id": "9f4ea29e-e4a5-4b22-89b1-5d9adfe00687", "title": "GET READY FOR THE RAIN : When heavy downpours will hit your neighborhood", "date": "2024-08-22 10:30", "url": "https://www.wptv.com/weather/get-ready-for-the-rain-when-heavy-downpours-will-hit-your-neighborhood", "domain": "wptv.com", "domain_classification": "Unknown", "message": "WEST PALM BEACH, Fla. — Afternoon storms will develop Thursday as the sea breezes trigger some heavy downpours.\nIt won't be as hot today as an easterly wind kicks in later in the day.\nThe heaviest rain will be between 4 p.m. and 6 p.m., just in time for the evening commute.\nWPTVMORE WEATHER: Radar | Alerts | 7-Day Forecast | Hourly ForecastAs we finish the week, the east wind takes hold.\nThis will help push the afternoon storms inland and away from the east coast metro areas."}, {"id": "c0025bcd-7d0d-411a-ae06-73ddf4a8f8d9", "title": "What Long Islanders need to know about insurance coverage after a storm", "date": "2024-08-22 00:45", "url": "https://www.newsday.com/long-island/suffolk/homeowners-flood-insurance-nlgg91jh", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Here’s what Long Islanders need to know about seeking help to pay for storm damage.\nBut recent data shows that in many communities in northern Suffolk County, such as Stony Brook, only a few dozen homeowners had flood insurance through the National Flood Insurance Program as of September 2022.\nStandard renters insurance does not cover flood damage, according to the Federal Emergency Management Agency.\nHowever, most flood insurance policies are backed by the National Flood Insurance Program.\nHowever, most flood insurance policies are backed by the National Flood Insurance Program."}, {"id": "4e5bfc7e-d5d9-4771-9791-6d2146c50d92", "title": "CT weather news : President Joe Biden approves emergency declaration for Connecticut after historic flooding", "date": "2024-08-22 00:00", "url": "https://abc7ny.com/post/ct-weather-news-president-joe-biden-approves-emergency-declaration-connecticut-after-historic-flooding/15214325/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "President Biden approves emergency declaration for Connecticut after historic floodingPresident Joe Biden approved an emergency declaration for Connecticut after the state experienced historic flooding.\nPresident Joe Biden approved an emergency declaration for Connecticut after the state experienced historic flooding.\nPresident Joe Biden approved an emergency declaration for Connecticut after the state experienced historic flooding.\nPresident Joe Biden approved an emergency declaration for Connecticut after the state experienced historic flooding.\nCONNECTICUT (WABC) -- President Biden has approved an emergency declaration for Connecticut as the state tries to clean up after historic flooding."}, {"id": "6bc1f42c-c29b-4cbd-8b66-a3029735e834", "title": "A robot attempt to get a sample of the melted nuclear fuel at Japan damaged reactor is suspended « nuclear - news", "date": "2024-08-22 10:45", "url": "https://nuclear-news.net/2024/08/22/1-b1-a-robots-attempt-to-get-a-sample-of-the-melted-nuclear-fuel-at-japans-damaged-reactor-is-suspended/", "domain": "nuclear-news.net", "domain_classification": "Unknown", "message": "A robot’s attempt to get a sample of the melted nuclear fuel at Japan’s damaged reactor is suspendedAn attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit nuclear plant has been suspended due to a technical issueabc news, By MARI YAMAGUCHI Associated Press, August 22, 2024,TOKYO — An attempt to use an extendable robot to remove a fragment of melted fuel from a wrecked reactor at Japan’s tsunami-hit Fukushima Daiichi nuclear power plant was suspended Thursday due to a technical issue.\nThe pipes were to be used to push the robot inside and pull it back out when it finished.\nOnce inside the vessel, the robot is operated remotely from a safer location.\nThe government and TEPCO are sticking to a 30-40-year cleanup target set soon after the meltdown, despite criticism it is unrealistic.\nNo specific plans for the full removal of the melted fuel debris or its storage have been decided."}, {"id": "0cb311a1-58dd-4de5-9e27-e6b63e6ea221", "title": "City of Florence conducts Alligator Road initiative to combat water discoloration", "date": "2024-08-22 01:45", "url": "https://wpde.com/news/local/alligator-road-flushing-map-flooding-tropical-storm-debby-impacts-crews-divide-size-systematic-evenings-complete-map", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Due to the after-effects of Tropical Storm Debby, the City of Florence had to postpone the Alligator Road Flooding Initiative.\nThe City of Florence has consulted engineers in a continued effort to address system water discoloration issues.\nCrews have divided into sections for systematic flushing that will occur throughout multiple evenings until it is complete.\nThe map highlights all affected City of Florence water customers.\nDuring this period, residents and affected customers will experience temporary low water pressure as crews continue to work."}, {"id": "48269254-3e28-4cde-a8ff-08f66405ad42", "title": "Mt . Charleston residents , first responders 1 - year later after Tropical Storm Hilary", "date": "2024-08-22 06:15", "url": "https://www.fox5vegas.com/2024/08/22/mt-charleston-residents-first-responders-1-year-later-after-tropical-storm-hilary/", "domain": "fox5vegas.com", "domain_classification": "Unknown", "message": "LAS VEGAS, Nev. (FOX5) - One year ago this week, Tropical Storm Hilary hit Mt.\n“To be honest, when we heard about the storm, we didn’t really think anything would come out of it...\nBut what we got instead was a torrential river that came and destroyed this entire road,” said Old Town Mt.\n“The aftermath is what really hit us, how it destroyed our infrastructure, the water lines.\nCharleston Fire Captain Steve Clement was at the fire house in old town the night Tropical Storm Hilary swept in."}, {"id": "9f29a609-9712-4dff-9e13-21d6d4caa813", "title": "More than 90 % of B . C . remains under some level of drought", "date": "2024-08-22 00:30", "url": "https://www.northislandgazette.com/news/more-than-90-of-bc-remains-under-some-level-of-drought-7496944", "domain": "northislandgazette.com", "domain_classification": "Unknown", "message": "According to provincial figures, 26 per cent of the province is experiencing the second-worst level of drought while another 13 per cent (Vancouver Island, Bulkley-Lakes, and Upper Fraser West) is at the worst level.\nEmergency Management Minister Bowinn Ma provided an update on wildfire activity and drought conditions on Wednesday.\nAnother eight basins are experiencing Level 1 or Level 2 drought conditions, meaning adverse impacts are rare or unlikely, while 12 are at Level 3, meaning impacts are possible.\nDrought continue fuel wildfire activityThe drought conditions also continue to be a major factor in this year's wildfire season.\nShe added that the province and BC Wildfire Service also took and implemented lessons from last year, which have helped them along."}, {"id": "46283263-f6de-44b0-a1c5-624adc5c6e21", "title": "Rain possible in the Bay Area this week in rare August storm system", "date": "2024-08-22 00:45", "url": "https://www.mercurynews.com/2024/08/21/rain-possible-in-the-bay-area-this-week-in-rare-august-storm-system/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "Friday will be the coolest day of the week in the Bay Area, with temperatures expected to range from the upper 50s near the coast to mid 70s inland.\n#CAwx pic.twitter.com/IjSRuHZlqS — NWS Bay Area 🌉 (@NWSBayArea) August 21, 2024How rare is rain in August?\nAugust is the second-driest month of the year in the Bay Area, behind July.\nFrom Oct. 1 through Wednesday, San Francisco has received 25.72 inches of rain, or 113% of its historic average.\nAny rain that falls across Northern California and the Bay Area on Friday and Saturday will temporarily reduce fire danger for a few days, Null noted."}, {"id": "2dc37da4-ef28-4ae3-99ce-d8008623fb2d", "title": "HazardHub Provides Critical Wildfire Risk Data and Maps", "date": "2024-08-22 00:45", "url": "https://www.wallstreet-online.de/nachricht/18407876-hazardhub-provides-critical-wildfire-risk-data-and-maps", "domain": "wallstreet-online.de", "domain_classification": "Unknown", "message": "This service leverages more than 1,000 data points and HazardHub risk scores for climate risks and extreme weather events.\nSource: Guidewire HazardHubTop States for Wildfire RiskGuidewire HazardHub Enhanced Wildfire Risk Score data indicates that the top states for wildfire risk, based on the percentage of homes receiving an “F” rating for wildfire risk, are:1.\nWyomingThe HazardHub Enhanced Wildfire Score leverages granular geographical data, updated vegetation data, proximity to fire hydrants and fire stations, historical wildfire data, and environmental factors to provide a detailed and accurate assessment of wildfire risk.\nNumber of Homes at High Risk from WildfiresThe top states by the number of homes at high risk of wildfire (rated as an “F” for wildfire risk) are:1.\nArizona: 61.7k homesAccording to analysis by Guidewire HazardHub, wildfire risk mitigation and home hardening efforts can reduce the risk of wildfire damage by as much as 70%."}, {"id": "4b023e3f-6e93-487c-bdfc-ee215bc7dc37", "title": "Rain possible in the Bay Area this week in rare August storm system", "date": "2024-08-22 00:00", "url": "https://www.eastbaytimes.com/2024/08/21/rain-possible-in-the-bay-area-this-week-in-rare-august-storm-system/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Friday will be the coolest day of the week in the Bay Area, with temperatures expected to range from the upper 50s near the coast to mid 70s inland.\n#CAwx pic.twitter.com/IjSRuHZlqS — NWS Bay Area 🌉 (@NWSBayArea) August 21, 2024How rare is rain in August?\nAugust is the second-driest month of the year in the Bay Area, behind July.\nFrom Oct. 1 through Wednesday, San Francisco has received 25.72 inches of rain, or 113% of its historic average.\nAny rain that falls across Northern California and the Bay Area on Friday and Saturday will temporarily reduce fire danger for a few days, Null noted."}, {"id": "cab5ef22-5fc1-4883-9ac6-e678a1e35bcc", "title": "Richmond Hill residents question drainage infrastructure after Debby", "date": "2024-08-22 12:15", "url": "https://www.yahoo.com/news/richmond-hill-residents-drainage-infrastructure-094441457.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "RICHMOND HILL, Ga. (WSAV) – Mayor Russ Carpenter is responding to concerns from Richmond Hill residents who lost nearly everything from Tropical Storm Debby flooding.\nCarpenter says the city is reevaluating the drainage, but the fact remains… this is a low-lying area with slow drainage even in normal conditions.\nRichmond Hill can’t just sacrifice a neighborhood once a year,” she said.\nStolen gun found by Richmond Hill teen walking home from schoolCarpenter says if anyone is in need of assistance to call the city of Richmond Hill at 912-756-3345.\nThe city of Richmond Hill contractors will begin collecting debris in areas that were impacted by Tropical Storm Debby on Thursday."}, {"id": "610035b7-e8e1-427b-bdaa-29d7f8f36e36", "title": "Flash flood warning issued as thunderstorms drench Washington County", "date": "2024-08-22 14:30", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/22/prc-flash-flood-warning-issued-as-thunderstorms-drench-washington-county/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Some locations that will experience flash flooding include St. George, Santa Clara, Ivins and Snow Canyon State Park, according to the alert.\nThe warning forecasts life-threatening flash flooding of creeks and streams, urban areas, highways, streets and underpasses.\nA flash flood warning means that flooding is imminent or occurring.\nWhen a flash flood warning is issued for your area or the moment you first realize that a flash flood is imminent, act quickly to save yourself.\nDo not hike rivers and especially slot canyons while flash flood warnings are in place."}, {"id": "8559c5d4-7ad8-45d1-9a93-256b42af4ac5", "title": "All 6 bodies recovered from sunken yacht off Sicily as questions mount", "date": "2024-08-22 09:45", "url": "https://www.yahoo.com/news/5-bodies-recovered-yacht-off-090235745.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Italian Coast Guard spokesperson Vincenzo Zagarola told CBS News that teams were still working to recover the body of the sixth and final person left missing when the boat went down.\nItalian authorities have not officially identified the remains recovered from the Bayesian, which belonged to Lynch's wife Angela Bacares.\nof Firefighters arrive in Porticello harbor near Palermo, with a body bag at the back of the boat on Aug. 22, 2024, three days after the British-flagged luxury yacht Bayesian sank.\nQuestions as to how the state-of-the-art boat could have gone down so quickly have mounted steadily since the accident.\nThe 184-foot sailing yacht Bayesian is seen in an undated file photo provided by SuperYacht Times."}, {"id": "44570c2c-670a-46f1-ae92-481c7936c95a", "title": "Couple return to  beloved  Bermuda for silver anniversary - The Royal Gazette | Bermuda News , Business , Sports , Events , & Community", "date": "2024-08-22 12:00", "url": "https://www.royalgazette.com/general/news/article/20240822/couple-return-to-beloved-bermuda-for-silver-anniversary/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "First Prev 1 2 3 4 5 6 Next LastStephen McNichol, left, and Karen McNichol are visiting the island for their 25th anniversary.\nStephen and Karen McNichol arrived from England last Thursday to celebrate their silver anniversary just before the storm’s arrival the next evening and into Saturday morning.\nFront: Annette Glasford, left, and Karen McNichol (Photograph supplied)Mr McNichol’s family eventually moved to Woking, England, where he met his future wife when they worked together in the same medical diagnostics company.\nStephen McNichol, back of carriage with Karen McNichol, with members of their wedding party.\nStephen and Karen McNichol married in 1999 at St James Church in Sandys, the same place Mr McNichol’s parents married (Photograph supplied)"}, {"id": "d952262b-de38-44d3-ab7f-35bd3c9a5491", "title": "Rain , cooler weather quenches wildfire concerns for Délı̨nę , N . W . T . ", "date": "2024-08-22 02:30", "url": "https://www.cbc.ca/news/canada/north/rain-cooler-weather-quenches-d%C3%A9l%C4%B1-n%C4%99-n-w-t-concerns-about-nearby-wildfire-1.7301437", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "The Délı̨nę Got'ı̨nę government says it is lifting a notice warning residents to be prepared in case a nearby wildfire triggered an emergency.\nOn Monday, the community government issued an evacuation notice — basically a heads-up for residents to keep an eye on the wildfire in case it started threatening the community.\nSince then, the wildfire has gotten about 15 millimetres of rain, the government posted on Facebook Wednesday afternoon.\nThe wildfire in question was about 20 kilometres southwest of Délı̨nę at its closest point Tuesday.\nThe Délı̨nę Got'ı̨nę government said wildfire protection equipment would stay in Délı̨nę for a few days just in case things change."}, {"id": "f02d3c65-76a1-4eb8-8af2-989844004d2d", "title": "Met Office urgent Storm Lilian warning as united kingdom hit by wind | Weather | News", "date": "2024-08-22 10:45", "url": "https://www.express.co.uk/news/weather/1939165/met-office-wind-warning-storm-lilian", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The UK will be lashed by brutal 80mph winds on Friday, maps suggestStorm Lilian is forecast to smash most of the UK on Friday, with up to 80mph winds around the north of England, as weather maps show horror wind gusts smashing Britain.\nThe forecaster has confirmed that a new storm, Storm Lilian, will hit the UK on Friday, potentially bringing winds of up to 80mph in some areas.\nAn urgent yellow weather warning was issued for northern England and parts of southern Scotland, effective from 5am until 11am on Friday.\nAs well as the strong winds, some locally heavy rainfall will add to the difficult travel conditions.\"\nRead our Privacy PolicyStorm Lilian, will hit the UK on Friday, potentially bringing winds of up to 80mph in some areas."}, {"id": "c611d578-2403-43b9-b47b-f2edda709081", "title": "Denver hailstorm in May caused nearly $2 billion in damage", "date": "2024-08-22 01:45", "url": "https://www.cpr.org/2024/08/21/denver-hailstorm-in-may-caused-nearly-2-billion-in-damage/", "domain": "cpr.org", "domain_classification": "Unknown", "message": "A May 2024 hailstorm in the Denver metro area caused nearly $2 billion in damages across Colorado, according to a federal climate report.\nIn 2017, hail storms and wind tore through Denver, leaving insurers to pick up nearly $2.8 billion in damages when adjusted for inflation.\nThe federal government has been tracking “billion-dollar disasters” since 1980 to inform officials and the public about how extremes are changing.\nThis year alone, there have been 19 such disasters, which have killed at least 149 people and caused nearly $50 billion in damages.\n“Climate change is also supercharging a number of these different extremes that lead to billion-dollar disasters,” Smith said."}, {"id": "80d15e89-88e3-478f-9178-7adc714b499f", "title": "Tens Of Thousands Remain Without Power In Puerto Rico , A Week After Tropical Storm Swiped The Island", "date": "2024-08-22 01:30", "url": "https://www.klove.com/news/us-and-world/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island-51650", "domain": "klove.com", "domain_classification": "Unknown", "message": "By DÁNICA COTO Associated PressSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nThe northeast coastal town of Luquillo, popular with tourists, reported the highest number of outages, with 30% of clients without power.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}]