[{"id": "b101a5f6-7873-46e8-a7ce-f60c72b104b5", "title": "Pentagon admits killing a shepherd with a Hellfire missile in Syria in botched drone strike after mistaking him for a senior Al Qaeda leader", "date": "2024-05-02 18:15", "url": "https://www.dailymail.co.uk/news/article-13376575/pentagon-drone-strike-syria-al-qaeda-shepherd-death.html", "message": "A botched U.S. drone strike in Syria killed a shepherd last year after he was mistakenly identified as a senior Al Qaeda operative.\nThe Pentagon has admitted a civilian and not a terrorist leader was slain on May 3, 2023 after an internal Central Command (CENTCOM) investigation.\nThe victim has since been 56-year-old father-of-10 Lufti Hasan Masto, who was killed while he was tending to his sheep.\nA MQ-9 predator drone was tracking his movements in fields around his home in the rural town of Qorqanya when a Hellfire missile was fired in his direction.\nCENTCOM 'determined U.S. forces misidentified the intended Al Qaeda target and that a civilian, Mr. Lufti Hasan Masto (Masto), was struck and killed instead'."}, {"id": "d9b7f8c7-ecf7-48d7-9aa2-9c2a2350c465", "title": "US policy in Gaza undermines its own national security", "date": "2024-05-02 11:00", "url": "https://www.ynetnews.com/article/sj2mmj11zr", "message": "Notably, U.S. officials – chief among them President Joe Biden - echoed Israel's military objectives.\nHowever, as time elapsed, a shift occurred in the Biden administration's approach, increasingly favoring engagement with Hamas at Israel's national security expense.\nThe current American policy in Gaza contradicts Israel's war objectives, which the American government initially agreed upon.\nCurrent U.S. policy in Gaza is also at odds with the fundamental American principle of the global war on terrorism.\nHe is a military strategy and national security expert, and a researcher at the Jerusalem Institute for Strategy and Security (JISS) and the Israel Defense and Security Forum-Habithonistim"}, {"id": "c51e8bff-34cb-438c-88ec-58247340a633", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated."}, {"id": "61734b70-fd48-444f-a425-b652197622b5", "title": "US Drone Strike Killed Middle - Aged Shepherd Instead Of Al - Qaeda Terrorist Leader , Probe Finds", "date": "2024-05-02 20:15", "url": "https://dailycaller.com/2024/05/02/us-drone-strike-killed-middle-aged-shepherd-instead-al-qaeda-terrorist-leader-probe-finds/", "message": "A 2023 drone strike originally believed to have killed a top leader of the radical Islamic terrorist group al-Qaeda instead killed a Syrian shepherd, a U.S. Central Command (CENTCOM) assessment revealed Thursday.\nAn investigation “determined U.S. forces misidentified the intended Al Qaeda target and that a civilian” had been killed, CENTCOM announced.\nThe investigation involved 10 senior service members and civilian employees who were not directly involved with the strike.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike,” the press release reads.\n“We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm."}, {"id": "aefe8af7-304b-4671-94e4-be9639f1a15c", "title": "Deadly Russian strikes hit civilian center and other targets in Odesa", "date": "2024-05-02 00:30", "url": "https://www.bostonglobe.com/2024/05/01/world/deadly-russian-strikes-hit-civilian-center-other-targets-odesa/", "message": "The attack followed a Russian airstrike on Monday evening that killed five people and wounded about 30 others, Ukrainian officials said.\nAdvertisementUkrainian authorities on Tuesday accused Russia of using cluster munitions — a controversial and widely banned weapon that can often cause indiscriminate harm to civilians — in that attack.\n“The investigators have a reason to believe that the decision to use such a weapon was taken by the Russian military officers deliberately to kill as many Ukrainian civilians as possible,” Kostin said.\nUS officials said they were aware of the Monday attack and of the Ukrainian claims of cluster munitions, but could not confirm the use of the munitions.\nBecause of the danger of cluster munitions to civilians, more than 100 countries have signed a 2008 treaty known as the Convention on Cluster Munitions, promising not to make, use, transfer or stockpile them."}, {"id": "3275162d-6b56-43cf-8f4c-71a7591adf69", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say - LocalNews8 . com", "date": "2024-05-03 06:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims."}, {"id": "4a68b0e1-0c13-4aba-ba6f-b27261a24039", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say - LocalNews8 . com", "date": "2024-05-03 06:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say-2/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims."}, {"id": "12f1f373-c6fd-40c2-b000-8547d4708822", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say", "date": "2024-05-03 10:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims."}, {"id": "be3c48fa-aa37-480f-8d53-c0ea063c1f66", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.yahoo.com/news/u-central-command-finds-2023-184350267.html", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nFile Photo by Bonnie Cash/UPIMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"\nThe strike investigation, conducted by Army Brigadier General John P. Cogbill, wrapped up Nov. 15, 2023."}, {"id": "3e3bbe7d-9882-4acb-a3ce-f4a534508f6c", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/02/CENTCOM-Syria-strike-civilian-killed/1701714674364/", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nCENTCOM said it is fully engaged in implementing Defense Secretary Lloyd Austin's (pictured) Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes.\nFile Photo by Bonnie Cash/UPI | License PhotoMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\""}, {"id": "8da7a4c8-d1c5-4faa-8077-67f35cdd3a79", "title": "Ukraine - Russia war latest :  Huge fire breaks out  in port city after missile strike ; Russia  shifting battlefield focus  ", "date": "2024-05-02 00:45", "url": "https://news.sky.com/story/ukraine-russia-war-latest-huge-fire-breaks-out-in-port-city-after-missile-strike-russia-shifting-battlefield-focus-12541713", "message": "Russia threatens Denmark with 'retaliation' if it blocks vesselsMore now from Russian foreign ministry spokeswoman Maria Zakharova, who has been speaking to journalists this afternoon.\nShe has said any move by Denmark to restrict the freedom of navigation of Russian ships in the Baltic straits will be seen as a hostile act and draw retaliation.\nIt is unclear exactly what prompted the threat, but we'll bring you any more detail as we get it.\nDenmark has played down suggestions it will begin checking Russian tankers moving through its waters to establish whether they have the correct documentation.\nAnd the Danish Maritime Authority said in a statement in March that a tanker from Russia's shadow fleet was involved in a collision near Denmark."}, {"id": "8bc6b0d7-8e0c-4d5c-81a4-ad1117c6097f", "title": "U . S . military concludes airstrike in Syria last May killed a civilian , not a terrorist", "date": "2024-05-02 16:30", "url": "https://www.cbsnews.com/news/airstrike-syria-may-2023-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThen, reports quickly surfaced that the strike had killed a civilian, not a terrorist.\nIn a tweet on May 3, the same day as the strike, a group known as \"The White Helmets\" who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported."}, {"id": "344ce694-953e-42cf-8aa8-0fbd6b130eb1", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities."}, {"id": "f7c1462f-5433-4803-ab6f-2ae531bdd4ee", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 20:30", "url": "https://www.devdiscourse.com/article/law-order/2925923-us-airstrike-targeting-al-qaida-leader-in-syria-killed-a-farmer-american-military-says", "message": "A US airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, US Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nUS Central Command said an investigation into the May 3 strike concluded that US forces misidentified the intended al-Qaida target \"and that a civilian, Mr. Lufti Hasan Masto, was struck and killed.\"\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIn a statement, Central Command said much of the investigation and findings are classified but acknowledged it revealed \"several issues that could be improved.\"\nThe US also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida's second in command in Syria."}, {"id": "d2a37c8c-72d9-43f7-9dca-6ac236e3478f", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria."}, {"id": "1b15c118-b524-48a9-aed4-9f55726d359e", "title": "US drone strike in Syria killed civilian not terrorist leader , Pentagon probe finds", "date": "2024-05-02 20:30", "url": "https://www.stripes.com/theaters/us/2024-05-02/drone-strike-syria-terrorist-civilian-killed-military-13732627.html", "message": "(X)A U.S. military drone strike last year that targeted a top al-Qaida leader in Syria killed a civilian instead, the Pentagon admitted Thursday.\n“We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\nAfter initially expressing confidence that the strike killed its intended target — whose name was never made public — Pentagon officials by mid-May told reporters that they were no longer certain the strike killed a terrorist.\n“The protection of civilians is a strategic priority as well as a moral imperative,” Austin wrote in his 2022 civilian harm mitigation plan.\n“Our efforts to mitigate and respond to civilian harm directly reflect our values and also directly contribute to achieving mission success.”"}, {"id": "b771a138-81ff-4ade-ac07-4b1d2358d034", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home."}, {"id": "1ced7d19-b541-4d93-8f1f-e6013eff6f15", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike."}, {"id": "d374d95b-7196-41c8-b601-c953f7436e64", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there."}, {"id": "b6031cfc-b19a-4ffa-96ff-09b950e78195", "title": "Missile defence successes in Gulf , Ukraine fuel global urgency to acquire systems", "date": "2024-05-03 05:00", "url": "https://www.theglobeandmail.com/world/article-missile-defence-successes-in-gulf-ukraine-fuel-global-urgency-to/", "message": "Iran launched as many as 120 intermediate-range ballistic missiles at Israel on April 13, U.S. and Israeli officials say.\nKuwait, Qatar and Bahrain have Patriot batteries as well, and Oman has expressed interest in missile defence.\nBut the impact may be most acute in Asia, where China has invested heavily in conventionally armed ballistic missiles.\n“Cases such as the Israel-Hamas conflict and the Russia-Ukraine war have reaffirmed the importance of a ‘ballistic missile defence system’ to respond to increasingly sophisticated missile threats,” the ministry said.\n“It raises the possibility that the U.S. and its allies could depend on missile defence significantly against a ballistic missile attack,” Zhao said."}, {"id": "09442821-ca90-4714-8caa-f785589dff59", "title": "More than 100 Russian soldiers killed in Atacms strike", "date": "2024-05-02 14:30", "url": "https://www.telegraph.co.uk/world-news/2024/05/02/more-than-100-russian-soldiers-killed-in-atacms-strike/", "message": "More than 100 Russian soldiers were reportedly killed when a volley of Atacms missiles hit a training base in eastern Ukraine in one of the highest single losses of Russian lives in months.\nWestern analysts said the attack occurred on a Russian training centre between the towns of Kuban and Mozhnyakivka, about 50 miles behind the front lines in the Donbas region of Luhansk.\nThe strikes reportedly killed 116 Russian troops, the US-based Institute for the Study of War think-tank wrote in a report on Wednesday.\n‘Such strikes are crucial’Neither the Russian nor Ukrainian defence ministries have commented on the reported attacks.\nThe Russian troops were preparing for an offensive on the neighbouring Kharkiv region, Oleksandr Musiienko, head of Ukraine’s Centre for Military-Legal Studies, said."}, {"id": "bbb5a43e-ffa1-4ed2-a52d-8c14c0d94149", "title": "Missile defence successes in Gulf , Ukraine fuel global urgency to acquire systems", "date": "2024-05-03 07:30", "url": "https://www.bworldonline.com/world/2024/05/03/592620/missile-defence-successes-in-gulf-ukraine-fuel-global-urgency-to-acquire-systems/", "message": "Iran launched as many as 120 intermediate-range ballistic missiles at Israel on April 13, US and Israeli officials say.\nBut the impact may be most acute in Asia, where China has invested heavily in conventionally armed ballistic missiles.\nJapan’s defense ministry said the country “needs to fundamentally and swiftly reinforce its defense capabilities, including integrated air and missile defense”.\n“Cases such as the Israel-Hamas conflict and the Russia-Ukraine war have reaffirmed the importance of a ‘ballistic missile defense system’ to respond to increasingly sophisticated missile threats,” the ministry said.\n“It raises the possibility that the U.S. and its allies could depend on missile defense significantly against a ballistic missile attack,” Zhao said."}, {"id": "67621dea-fd5a-48ab-9e18-394c9c1fd6ab", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 01:45", "url": "https://www.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning."}, {"id": "ca64b60d-53b8-4bdd-9f2b-3fa27a75c5b0", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 02:00", "url": "https://us.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning."}, {"id": "78c5d253-047a-4a8a-8fb7-99b10cc853bf", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 05:00", "url": "https://edition.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning."}, {"id": "b323381d-9839-46d0-9b38-3e966c98f369", "title": "1 killed , 3 injured in Israeli strikes on Lebanese villages", "date": "2024-05-01 22:15", "url": "https://www.prokerala.com/news/articles/a1527609.html", "message": "Beirut, May 2 : A Hezbollah fighter was killed and three civilians were injured in Israeli airstrikes on Lebanese villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Wednesday that an Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter inside the house, Xinhua news agency reported.\nAccording to the sources, another airstrike targeted the southeast village of Adaysseh, wounding three civilians.\nThe military sources added that Israeli warplanes carried out on Wednesday a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 445 people on the Lebanese side, according to Lebanese security sources."}, {"id": "867e21f4-0c87-4a80-8ffd-c19e56b1859c", "title": "Military concludes airstrike in Syria last May killed civilian , not terrorist", "date": "2024-05-02 18:30", "url": "https://www.wsgw.com/military-concludes-airstrike-in-syria-last-may-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThough the investigation found several areas the command could improve on, according to the summary, it did not recommend any accountability actions for killing a civilian.\nIn a tweet on May 3, the same day as the strike, a group known as “The White Helmets” who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported."}, {"id": "7ab4b5c0-ef15-4a65-b0da-6765530e6d0c", "title": "Russo - Ukraine War - 01 May 2024", "date": "2024-05-02 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-01.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nDuring the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7x concentrations of Russian troops."}, {"id": "3a7c7450-6cb9-4462-b458-e7967f29605d", "title": "Ukraine updates : Russia strikes Odesa for 3rd time this week – DW – 05 / 02 / 2024", "date": "2024-05-02 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-3rd-time-this-week/live-68974519", "message": "\"We will give 3 billion pounds every year for as long as is necessary.\nWe've just really emptied all we can in terms of giving equipment,\" Cameron told Reuters in Kyiv.\n\"Some of that [equipment] is actually arriving in Ukraine today, while I'm here,\" he added.\n\"Through our multi-year military funding, weapons provision and vital support to protect and repair Ukraine's energy infrastructure, the UK is standing with Ukraine and we will stand with Ukraine for as long as it takes,\" Cameron said.\nThe former prime minister also met with Ukrainian President Volydymyr Zelenskyy and Foreign Minister Dmytro Kuleba, and said Ukraine had the right to use these weapons to strike targets in Russia where necessary."}, {"id": "b6bf4b36-0bef-48d4-9e3a-42572741c083", "title": "Russia breached global chemical weapons ban in Ukraine war , US says - New Delhi Times - India Only International Newspaper", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russia-breached-global-chemical-weapons-ban-in-ukraine-war-us-says/", "message": "The United States accused Russia on Wednesday of breaching a global chemical weapons ban by deploying the choking agent chloropicrin against Ukrainian troops.\nThe State Department also accused Russia of using riot control agents “as a method of warfare” in Ukraine.\nAdditionally, Russian forces have used grenades loaded with CS and CN gases, according to the Ukrainian military.\nA guided bomb attack killed two civilians, including a 38-year-old woman and her father, Kharkiv regional Governor Oleh Syniehubov said.\nRussia’s defense ministry said Wednesday that it thwarted Ukrainian drone attacks targeting several Russian regions."}, {"id": "a820066a-e06c-4134-9432-b0336218fad0", "title": "RIGHT SPEAK : UKR Hits Two RU Buk Anti - Aircraft Missile Complexes , Including 6 Missiles ; UKR Forces Hold Chasiv Yar Despite RU Efforts ; UKR Drones Began Striking Unexpected RU Targets ; Crimean Bridge Destruction is Quite Real ; 106 C - Clashes ...", "date": "2024-05-03 08:00", "url": "http://www.rightspeak.net/2024/05/ukr-hits-two-ru-buk-anti-aircraft.html", "message": "Blog Archive: May 2024 (14) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "41ea591b-e4a8-4d07-a213-bbe282d3535e", "title": "Russia - Ukraine war : List of key events , day 798", "date": "2024-05-02 02:15", "url": "https://www.aljazeera.com/news/2024/5/2/russia-ukraine-war-list-of-key-events-day-798", "message": "Russia-Ukraine war: List of key events, day 798As the war enters its 798th day, these are the main developments."}, {"id": "1b230deb-1ec4-4929-9427-94d71bc6c7f6", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors."}, {"id": "30e1efb6-b787-4040-b871-9fe2ca1f43a4", "title": "Three terrorists killed in Tank operation", "date": "2024-05-02 15:00", "url": "https://tribune.com.pk/story/2464897/three-terrorists-killed-in-tank-operation", "message": "Security forces on Thursday killed three terrorists during a joint intelligence-based operation (IBO) in Khyber-Pakhtunkhwa’s Tank district, the military said in a statement.\nAccording to the Inter-Services Public Relations (ISPR), during the operation, following a fierce exchange of gunfire, security forces successfully neutralised three terrorists, including ringleaders Azmat alias Azmati, Karamat alias Hanzla, and terrorist Rehan.\nThe slain militants remained “actively involved” in several terrorist activities in the area, including the recent abduction of a district and sessions judge of South Waziristan district, the military’s media wing stated.\nIt further asserted that the security forces remain determined to eliminate the menace of terrorism from the country.\nRead more: At least four terrorists killed in Tank IBOHe returned home safely, the Counter-Terrorism Department (CTD) confirmed on Monday."}, {"id": "0a9f119d-fbef-4914-8279-27ba4df5ef76", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240502-voa01.htm", "message": "Russian missile attack injures 14 in OdesaBy VOA News May 02, 2024Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military."}, {"id": "6a1924d4-ee35-46ce-bc02-4a76f4cfed15", "title": "Ukraine update : US sanctions Chinese , UAE firms for aiding Moscow war", "date": "2024-05-02 01:00", "url": "https://www.dailymaverick.co.za/article/2024-05-02-us-sanctions-chinese-uae-firms-for-aiding-moscows-war-us-bans-import-of-russian-enriched-uranium/", "message": "US sanctions firms in China, UAE for support of Russia’s warThe US on Wednesday announced sanctions on nearly 300 companies and individuals, including in China and the United Arab Emirates, for alleged support of Russia’s invasion of Ukraine.\nA combination of Russian and Chinese companies were sanctioned for being involved in the trade of those materials.\nThe move came shortly after Treasury Secretary Janet Yellen warned Chinese officials the US would take action against any firms that helped Russia’s military procurement efforts.\nSeparately, the State Department also levied sanctions against companies and individuals it said had engaged in sanctions evasion or in supporting Russia’s chemical and biological weapons programmes.\nThe Prohibiting Russian Uranium Imports Act, approved by unanimous consent, would bar US imports 90 days after enactment while allowing temporary waivers until January 2028."}, {"id": "f4f01769-a11a-452d-a20f-f85d99cdc99e", "title": "Progressive Florida Dems Push To Cancel Fetterman Speech Over Support for Israel", "date": "2024-05-02 18:15", "url": "https://freebeacon.com/latest-news/progressive-florida-dems-push-to-cancel-fetterman-speech-over-support-for-israel/", "message": "Florida's progressive Democratic caucus this week called on the Florida Democratic Party to cancel Sen. John Fetterman’s (D., Pa.) keynote speech at its 2024 Leadership Blue gala over his support for Israel since Hamas’s Oct. 7 terrorist attack.\nThe progressive Democrats said Fetterman was \"once touted as a progressive champion\" but \"has betrayed the trust of his constituents by swiftly pivoting away from the platform he was elected on.\"\n\"I unequivocally support any necessary military, intelligence, and humanitarian aid to Israel,\" Fetterman said in a statement following the Hamas attack.\nI also fully support Israel neutralizing the terrorists responsible for this barbarism.\"\n\"It’s truly disturbing that Members of Congress rushed to blame Israel for the hospital tragedy in Gaza,\" Fetterman wrote on X."}, {"id": "7f205f14-c7e9-4d02-a1d5-a4a91eb4787c", "title": "ISIS - K operative or aid worker ? CCTV footage , new reports question US drone target in Kabul : World News", "date": "2024-05-02 06:45", "url": "https://www.rashtranews.com/isis-k-operative-or-aid-worker-cctv-footage-new-reports-question-us-drone-target-in-kabul-world-news/", "message": "But before heading to his house, Ahmadi picked up another colleague named Khan (name changed for security reasons).\n“There wasn’t much coming and going from the house, so when a vehicle did leave, it was significant,” the US official told CNN.\nHe told CNN that his family lived at the residential address for over 40 years.\n(Video accessed by CNN from Nutrition and Education International)“So, it seems to correlate or did correlate with what the intelligence was suggesting was going to happen,” the official told CNN.\nHe also acknowledged that the secondary explosion could be caused by a gas cylinder."}, {"id": "e9798810-d6f6-4a59-b794-38d60f523eed", "title": "Russian forces have hit on a cheap way to foil US precision weapons in Ukraine", "date": "2024-05-02 06:30", "url": "https://www.businessinsider.in/defense/news/russian-forces-have-hit-on-a-cheap-way-to-foil-us-precision-weapons-in-ukraine/articleshow/109735978.cms", "message": "Another US precision-guided weapon is being foiled by Russian electronic warfare.\nAdvertisementAnother US precision-guided weapon has apparently been foiled by Russian electronic warfare, a Pentagon official said.\nIf this weapon did fail, it would not be the first US precision-guided weapon foiled by Russian electronic warfare.\nIn December, Lt. Gen. Antonio Aguto said electronic warfare directed at some of \"our most precise capabilities is a challenge.\"\nAdvertisementPatt said at the time that \"the peak efficiency of a new weapon system is only about two weeks before countermeasures emerge.\""}, {"id": "171ce22e-9aaa-480f-abdc-9f883ece456f", "title": "Russia Shows Off NATO Military Equipment Taken From Ukraine", "date": "2024-05-01 21:30", "url": "https://www.shtfplan.com/headline-news/russia-shows-off-nato-military-equipment-taken-from-ukraine", "message": "Russian crowds are getting to see a new exhibition in Moscow of NATO (North Atlantic Treaty Organization) military hardware that was captured by Russian forces in Ukraine.\nThe display shows off a whole lot of “trophies,” ranging from United States-made armored fighting vehicles to state-of-the-art tanks and European armored personnel carriers.\nThe military equipment has come from 12 countries including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\nRussia Has Destroyed 1/3 Of U.S.\nRussia is advancing and making mincemeat of the equipment sent to Kiev by the West."}, {"id": "67d4bd1c-3c5e-41f3-a860-db8e3be7d38a", "title": "Teenager on terror charges after stabbings at Sydney church denied bail", "date": "2024-05-02 09:00", "url": "https://www.bucksfreepress.co.uk/news/national/24293436.teenager-terror-charges-stabbings-sydney-church-denied-bail/", "message": "“The messages clearly set up the young person wanting to do something catastrophic,” Mr Viney added.\nLater, the boy’s lawyer, Mr Dib, told reporters he would apply for bail to the New South Wales state Supreme Court.\nMr Viney said he had “no doubt” the parents were both loving and supportive of their son, and had confiscated his phone after becoming concerned by his behaviour.\n“They are genuinely shocked as to the charges he’s facing,” Mr Viney said.\nThe boy arrested in the stabbings was charged with committing a terrorist act four days after the attack that triggered a riot outside the church."}, {"id": "ce9e18b8-8618-4022-8571-3c6942f3e4c9", "title": "Surprise : Literal Terrorist Visits Pro - Terrorism  Encampment  at Major University in Chicago", "date": "2024-05-02 15:00", "url": "https://townhall.com/tipsheet/guybenson/2024/05/02/surprise-literal-terrorist-visits-pro-terrorism-encampment-at-major-university-in-chicago-n2638509", "message": "When I call Ayers and Dohrn 'terrorists,' I mean it quite literally.\nMr. Ayers, who is 56, calls it a memoir, somewhat coyly perhaps, since he also says some of it is fiction.\nIn his book Mr. Ayers describes the Weathermen descending into a ''whirlpool of violence.''\nBetween 1970 and 1974 the Weathermen took responsibility for 12 bombings, Mr. Ayers writes...\nAdvertisementbill ayers of the weather underground addresses students at the uchicago popular university for gaza ‼️‼️ pic.twitter.com/V7MSsS4Q8V — kxh (@halfmoonpoem) April 29, 2024A literal, unrepentant, anti-American terrorist bomber addressing a pro-terrorism crowd."}, {"id": "558896d8-7456-4eb8-93d2-1374e05d36dd", "title": "USS Cole Anniversary Today : Media Silent", "date": "2024-05-03 13:45", "url": "https://www.newsbusters.org/blogs/nb/richard-newcomb/2007/10/12/uss-cole-anniversary-today-media-silent", "message": "On this day in the year 2000, the guided missile destroyer USS Cole was attacked by Islamic terrorists associated with Osama bin Laden's al-Quaeda group.\nToday is the seventh anniversary of that attack.\nThe most recent example occured in 1968 when North Korea attacked the USS Pueblo.\nYet not a single media organ seems to care that Americans were attacked and killed.\nThe USS Pueblo was attacked and captured by North Korea, not North Vietnam."}, {"id": "81110311-f691-4b29-9254-5336f8302d89", "title": "Odesa Currently Seen As Key Target For Russian Strikes Air Force", "date": "2024-05-01 15:15", "url": "https://menafn.com/1108160426/Odesa-Currently-Seen-As-Key-Target-For-Russian-Strikes-Air-Force", "message": "(MENAFN- UkrinForm) The Russians have now picked the city of Odesa as the key target for their strikes.\nOvernight Wednesday, they attacked densely populated areas with three Iskander-M ballistic missiles.\nThat's according to a spokesperson for Ukraine's Air Force Ilia Yevlash, who spoke on the air of the national telethon, Ukrinform reports.\nThis is another manifestation of the bloodthirsty face of Russian terror.\nLate Tuesday night, Russian ballistic missiles hit Odesa again, killing three."}, {"id": "17e41b1e-4657-4994-bea9-fc3e21fc712b", "title": "Ukrainian drone attack sets major Russian oil refinery on fire", "date": "2024-05-02 03:00", "url": "https://www.dailyrepublic.com/state-nation-world/ukrainian-drone-attack-sets-major-russian-oil-refinery-on-fire/article_5bd943d4-0814-11ef-b433-cb5c1afded3c.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "f3db9a42-3e82-4e80-9cd3-624d0eaff0d6", "title": "For Decades , Moscow Has Sought to Silence Its Critics Abroad", "date": "2024-05-03 07:30", "url": "https://www.newsmax.com/world/globaltalk/russia-kgb-killings-spies-assassinations/2024/05/03/id/1163339/", "message": "Security expert Andrei Soldatov said the work of the Kremlin's intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat's how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky's ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.\nBritain accused Russia in the attack, which the Kremlin denied being behind, and Western nations expelled Russian spies in response."}, {"id": "3a778d5c-dd27-4fd5-a4d4-1db0714a8e5c", "title": "Likely missile attack by Yemen Houthi rebels targets ... ", "date": "2024-05-01 22:00", "url": "https://accesswdun.com/article/2024/4/1240028", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said."}, {"id": "b5592723-24b0-4483-8038-80ef46cf061c", "title": "Remember the 60s : How Many Campus Protesters Will Go Full Terrorist ? ", "date": "2024-05-01 20:00", "url": "https://hotair.com/headlines/2024/05/01/remember-the-60s-how-many-campus-protesters-will-go-full-terrorist-n3787569", "message": "It is almost certain that Hamas operatives are planning terrorist attacks in the United States as well.\nIt is not a bridge too far to believe that radicals who claim to be in Hamas, love their rockets and call for the death of Israelis and Jews might take the next step and help Hamas operatives engage in terrorism against US targets.\nAdvertisementThey could be recruited to help purchase weapons, identify targets and even plant bombs.\nSomething similar happened in the late 1960s and early 1970s when American supporters of terrorism became terrorists themselves, including students, professors and university graduates."}, {"id": "8469bbd1-321a-4c6d-9106-969b06f10c25", "title": "Major US law firm sues Students for Justice in Palestine for alleged support of Hamas  terrorist activities  ", "date": "2024-05-02 20:15", "url": "https://www.yahoo.com/news/major-us-law-firm-sues-173046553.html", "message": "\"In the NSJP Toolkit, AMP and NSJP identify themselves as ‘PART of’ a ‘Unity Intifada,’ governed by Hamas’s ‘unified command’ of terrorist operations in Gaza.\n\"The next day, NSJP released its Day of Resistance Toolkit ('NSJP Toolkit') across more than 300 American college campuses and on the internet,\" the complaint says.\nHundreds of students outside the \"Palestine Solidarity Encampment\" on the campus of UCLA in Los Angeles on Wednesday, May 1, 2024.\n\"AMP and NSJP are thus liable to Plaintiffs for the damages they incurred because AMP and NSJP aid and abet Hamas’s terrorism.\"\nOriginal article source: Major US law firm sues Students for Justice in Palestine for alleged support of Hamas 'terrorist activities'"}, {"id": "6774f3d3-cbf9-489f-b673-38a178e2911a", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14 – Winnipeg Free Press", "date": "2024-05-02 10:15", "url": "https://www.winnipegfreepress.com/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14", "message": "KYIV, Ukraine (AP) — The situation on the front line in eastern Ukraine is worsening but local defenders are so far holding firm against a concerted push by Russia’s bigger and better-equipped forces, a senior Ukrainian military official said Thursday.\n(Ukrainian Emergency Service via AP)Russia has pushed Ukraine onto the back foot on the battlefield as Kyiv grapples with shortages of troops and ammunition.\nUkrainian forces are now racing to build more defensive fortifications at places along the around 1,000-kilometer (600-mile) front line.\nUkraine’s difficulties have been deepening for months as the military waited for vital new military aid from the United States.\n‘’I’m not ruling anything out, because we are facing someone who is not ruling anything out,’’ he told the Economist, referring to Russian President Vladimir Putin."}, {"id": "9acac758-c034-46da-9a25-ef8cc39c7368", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel - LocalNews8 . com", "date": "2024-05-01 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage."}, {"id": "75a9a4a5-7561-43a2-a0e4-16f03e779ebc", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "Abdirisaq Shino Shares 70TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike."}, {"id": "fd7988bd-446c-4424-acfa-6cbd17e9177c", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel."}, {"id": "9a5bf8a9-4670-459e-975e-b0a600023e9b", "title": "When Tony Blair Bombed Montenegro", "date": "2024-05-02 19:45", "url": "https://consortiumnews.com/2024/05/02/when-tony-blair-bombed-montenegro/", "message": "It came amid airstrikes on Yugoslav forces in Kosovo, where Bill Clinton and Tony Blair waged a “humanitarian intervention” ostensibly to save ethnic Albanians from Serb leader Slobodan Milosevic.\nApproving Air StrikesThe Atlantic alliance did not specify which of its members had taken part in the air strikes on Montenegro at the time.\nSuch secrecy would become a common feature of future NATO air wars, making it hard for victims to hold individual states responsible.\nBut a formerly classified document reveals that Britain was heavily involved in the April 29, 1999 attack on Montenegro.\na decade on from the Kosovo war."}, {"id": "9bb79787-96ec-48c0-a521-0918ee9a92cb", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 06:30", "url": "https://www.voanews.com/a/russian-missile-attack-injures-14-in-odesa/7594669.html", "message": "French President Emmanuel Macron said in an interview published Thursday it would be wrong to rule out any particular actions in response to Russia’s invasion of Ukraine, saying that doing so weakens the capacity to deter Russia.\n“We are now all in the process of doing this, so it would be wrong to rule out the rest,” Macron said.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nThe State Department also accused Russia of using riot control agents \"as a method of warfare\" in Ukraine.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military."}, {"id": "4a69c603-522f-4cf6-bf80-fdd34b95177e", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14", "date": "2024-05-02 11:45", "url": "https://www.wsls.com/news/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14/", "message": "In this photo provided by the Ukrainian Emergency Service, emergency services personnel work to extinguish a fire following a Russian attack in Odesa, Ukraine, Wednesday, May 1, 2024.\n(Ukrainian Emergency Service via AP)KYIV – The situation on the front line in eastern Ukraine is worsening but local defenders are so far holding firm against a concerted push by Russia’s bigger and better-equipped forces, a senior Ukrainian military official said Thursday.\nUkrainian forces are now racing to build more defensive fortifications at places along the around 1,000-kilometer (600-mile) front line.\nUkraine’s difficulties have been deepening for months as the military waited for vital new military aid from the United States.\n‘’I’m not ruling anything out, because we are facing someone who is not ruling anything out,’’ he told the Economist, referring to Russian President Vladimir Putin."}, {"id": "cd3f7a4b-68d8-40b5-b8ba-ab438f537cb1", "title": "Russian missile attack injures 14 in Odesa - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russian-missile-attack-injures-14-in-odesa/", "message": "Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military."}, {"id": "e87a1b35-7d63-4d68-9443-7e12ed17132d", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel", "date": "2024-05-01 18:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage."}, {"id": "a2e5e529-089d-4174-b837-c34a00b806ea", "title": "US Navy Needs More Missiles That Just Got First Kill to Take on China", "date": "2024-05-01 18:00", "url": "https://www.businessinsider.com/us-navy-more-missiles-recently-got-first-kill-pacific-threats-2024-5", "message": "The US Navy used its SM-3 missile interceptor in combat for the first time last month.\nAdvertisementThe US Navy will need a lot more of its SM-3 missile, an interceptor that only recently scored its first-ever kill, to counter Pacific threats like China, the sea service's top civilian official said on Wednesday.\nThe Missile Defense Agency's budget request for FY25 cuts procurement of SM-3 Block IB variant, which became operational a decade ago.\nDuring Wednesday's hearing, South Carolina Rep. Joe Wilson referred to this variant as the Navy's \"primary defense against tactical ballistic missiles for the Aegis Ballistic Missile Defense\" weapons system.\nAdvertisementThe Navy, however, is already getting a taste of what it's like to battle anti-ship ballistic missiles."}, {"id": "5b90f4a6-2d32-4413-ae22-35576efbb38f", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month."}, {"id": "550e44a9-0443-4cbe-bce1-5a486195c8cb", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged."}, {"id": "1260b796-a595-4ca1-8b34-ae803379a033", "title": "Congress Supplemental Aid Package Includes Billions to Boost the U . S . Defense Industrial Base", "date": "2024-05-02 17:15", "url": "https://foreignpolicy.com/2024/05/01/congress-supplemental-aid-bill-pentagon-defense-industry-missiles-production/?tpcc=recirc_trending062921", "message": "The U.S. defense industrial base just got a $20 billion shot in the arm from the national security supplemental bills passed by Congress last week.\nThe U.S. defense industrial base just got a $20 billion shot in the arm from the national security supplemental bills passed by Congress last week.\nOfficials and experts say that the United States needs more of it, lots more, to make the real investments.\nAt the peak of World War II, the United States was spending nearly 40 percent of its GDP on defense.\nAnd that can’t go unnoticed by China.”But the jolt will allow the United States to surge artillery production and solve key bottlenecks."}, {"id": "67684905-760e-4e29-817f-b71346ce1f76", "title": "Congress Supplemental Aid Package Includes Billions to Boost the U . S . Defense Industrial Base", "date": "2024-05-02 02:00", "url": "https://foreignpolicy.com/2024/05/01/congress-supplemental-aid-bill-pentagon-defense-industry-missiles-production/", "message": "The U.S. defense industrial base just got a $20 billion shot in the arm from the national security supplemental bills passed by Congress last week.\nThe U.S. defense industrial base just got a $20 billion shot in the arm from the national security supplemental bills passed by Congress last week.\nOfficials and experts say that the United States needs more of it, lots more, to make the real investments.\nAt the peak of World War II, the United States was spending nearly 40 percent of its GDP on defense.\nAnd that can’t go unnoticed by China.”But the jolt will allow the United States to surge artillery production and solve key bottlenecks."}, {"id": "c612cf8a-3a30-4d17-b904-95dd0745e186", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-02 15:30", "url": "https://www.naharnet.com:443/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions."}, {"id": "410419a9-9565-4999-b863-2c3e7f6c4806", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-03 08:45", "url": "https://naharnet.com/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions."}, {"id": "555e1ee5-2a9b-4f9d-a55a-c6d28b4724eb", "title": "Russia Says Mariupol Hospital Attack  Staged  By Ukraine : World News", "date": "2024-05-02 02:45", "url": "https://www.rashtranews.com/russia-says-mariupol-hospital-attack-staged-by-ukraine-world-news/", "message": "#Russia #Mariupol #Hospital #Attack #Staged #UkraineIgor Konashenkov has stated that the Mariupol hospital was staged by Ukraine.\nMoscow, Russia:The Russian army claimed Thursday that an attack on a children’s hospital in the southeastern Ukrainian port of Mariupol, which killed three including a child and caused global outrage, was a “staged provocation” by Ukraine.\n“The Russian aviation carried out absolutely no missions to hit targets on the ground in the Mariupol area,” Russian defence ministry spokesman Igor Konashenkov said.\n“The airstrike that allegedly took place is a completely staged provocation to maintain anti-Russian hype for a Western audience,” he said.\nThe bombing of the maternity hospital resulted in three deaths, including one child, according to the city’s mayor."}, {"id": "eee02bd9-5004-44b8-abac-c40796809c6a", "title": "US military admits that air strike killed civilian in Syria last year", "date": "2024-05-02 19:30", "url": "https://us.cnn.com/2024/05/02/politics/us-military-admits-air-strike-killed-civilian-syria/", "message": "“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the summary says.\nStill, the US did not launch an official investigation of the strike until nearly 8 weeks later after the strike that killed him.\nMohammad Mesto sits next to the grave of his brother Lutfi, who was killed on May 3 in a suspected US military strike in northern Syria.\nIn that case, CENTCOM opened a formal 15-6 investigation into the strike within a week of the operation.\nMesto’s family previously told CNN that he had been out grazing his sheep when he was killed."}]