[{"id": "332bedf5-232c-4203-b6cf-d9146dac5d65", "title": "As a former IDF soldier and historian of genocide , I was deeply disturbed by my recent visit to Israel", "date": "2024-08-13 04:30", "url": "https://www.theguardian.com/world/article/2024/aug/13/israel-gaza-historian-omer-bartov", "domain": "theguardian.com", "domain_classification": "International", "message": "On 19 June 2024, I was scheduled to give a lecture at Ben-Gurion University of the Negev (BGU) in Be’er Sheva, Israel.\nI had not been to Israel since June 2023, and during this recent visit I found a different country from the one I had known.\nThe IDF covered up the circumstances of this event, which was caused by the negligence of the training base commander.\nBeyond this limited circle, such statements on the illegality of Israeli actions in Gaza are anathema in Israel.\nSince I returned from my visit, I have been trying to place my experiences there into a larger context."}, {"id": "d556e107-928b-4502-9f18-ce338f62d75f", "title": "Elon Musk interiew of Trump hit with technical problems on X", "date": "2024-08-13 01:00", "url": "https://www.theglobeandmail.com/world/article-elon-musk-interiew-of-trump-hit-with-technical-problems-on-x/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "“If I had not turned my head, I would not be talking to you right now — as much as I like you,” Trump told X’s owner Elon Musk.\nThe rocky start was reminiscent of a May 2023 social media conversation between Musk and Florida Gov.\n“I need an Elon Musk — I need somebody that has a lot of strength and courage and smarts.\nAnd on Monday, at least, Trump returned to Musk’s social media platform in force.\nThe former president made at least eight individual posts in the hours leading up to the Musk interview."}, {"id": "1f2ae2ff-4a67-4b50-b338-bcf13ce5bf61", "title": "Elon Musk interiew of Trump hit with technical problems on X", "date": "2024-08-13 01:45", "url": "https://www.swissinfo.ch/eng/elon-musk-interiew-of-trump-hit-with-technical-problems-on-x/86686993", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Rambling Trump, Musk interview marred by tech issuesreuters_tickers6 minutesBy Richard Cowan and Andy SullivanWASHINGTON (Reuters) -Republican presidential candidate Donald Trump sat Monday for a friendly two-hour interview with billionaire entrepreneur Elon Musk on Musk’s social media platform X, after technical problems delayed the start of the event for more than 40 minutes.\nTrump sought to turn the problems into a positive, congratulating Musk on the number of people trying to tune in.\nAt the time, Trump mocked DeSantis on his own, social media platform, Truth Social.\nMusk backed Democratic President Joe Biden in 2020 but has tacked rightward since.\nThe chat with Musk offered Trump an unfiltered chance to air his usual mix of grievances, personal attacks and overstated or false claims."}, {"id": "96e929c4-d0af-4e03-907c-b6b6402a6727", "title": "Musk interview of Trump starts after technical issues", "date": "2024-08-13 01:45", "url": "https://www.rte.ie/news/2024/0813/1464697-musk-trump-interview/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Mr Trump sought to turn the problems into a positive, congratulating Mr Musk on the number of people trying to tune in.\nAt the time, Mr Trump mocked the Florida governor on his own social media platform, Truth Social.\nRead more: EU warns Musk over 'harmful content' ahead of Trump interviewThe two men exchanged praise repeatedly, with the Tesla chief lauding Mr Trump for his bravery during the attempt on his life last month, and Mr Trump congratulating Mr Musk for his willingness to fire workers demanding better conditions.\nMr Musk, one of the world's richest men, announced his support for Mr Trump shortly after his attempted assassination, despite Republicans' opposition to state support for electric carmakers like Tesla.\n\"She hasn't done an interview since this whole scam started,\" Mr Trump said, claiming that Mr Biden dropping off the ticket was a \"coup\"."}, {"id": "3018f704-a543-4905-80a5-49e46a753468", "title": "Musk Trump interview : Elon Musk interview of Donald Trump hit by technical problems on X", "date": "2024-08-13 02:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/elon-musk-interview-of-donald-trump-hit-by-technical-problems-on-x/articleshow/112480612.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "7584c832-5f73-436c-9af7-3b6e53830023", "title": "Musk Trump interview hit by tech problems on X", "date": "2024-08-13 02:15", "url": "https://www.odt.co.nz/news/world/musks-trump-interview-hit-tech-problems-x", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "\"There appears to be a massive DDOS attack on X,\" Musk wrote in an X post at 8:18pm, referring to a type of cyberattack in which a server or network is flooded with traffic in an attempt to shut it down.\nAt the time, Trump mocked DeSantis on his own, social media platform, Truth Social.\nDonald Trump's Space is seen in a screenshot from the social media network X during technical issues when Elon Musk was due to interview Trump.\nTrump frequently posts on his Truth Social platform, which was launched in February 2022, but his posts there reach a much smaller audience than on X.\nSome X users also reported seeing advertisements pop up supporting Trump."}, {"id": "20dd43c4-ecd7-41ae-b6d4-467657976f13", "title": "Turn your RAGE into OUTRAGE ! | The Jewish Press - JewishPress . com | Rabbi Efrem Goldberg | 10 Av 5784 – Tuesday , August 13 , 2024", "date": "2024-08-13 13:15", "url": "https://www.jewishpress.com/blogs/turn-your-rage-into-outrage/2024/08/13/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: unsplashThe internet has become a very angry place and “rage bait” influencers are in large part to blame.\nBut here is the thing – rage isn’t productive, rage is never the solution.\nRage demolishes and outrage builds.\nNo matter what is happening in the world, no matter who or what tries to bait you, always remember, rage is not all the rage.\nTake that fire in your belly and instead of indulging the feeling of rage, channel it into outrage and action."}, {"id": "e0cd1b9a-8e14-4b15-8e24-64ad4091c248", "title": "Elon Musk interview of Trump starts after technical issues", "date": "2024-08-13 04:00", "url": "https://www.rappler.com/world/us-canada/elon-musk-interview-donald-trump-updates-august-12-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Trump sought to turn the problems into a positive, congratulating Musk on the number of people trying to tune in.\nA counter on X showed as many as 1.3 million people were listening at times during the lengthy conversation.\nAt the time, Trump mocked DeSantis on his own, social media platform, Truth Social.\nMusk backed Democratic President Joe Biden in 2020 but has tacked rightward since.\nThe chat with Musk offered Trump an unfiltered chance to air his usual mix of grievances, personal attacks, and overstated or false claims."}, {"id": "cc20f9f4-8c89-4370-8564-3706e727f840", "title": "Trump back on social media site X ahead of interview with Elon Musk", "date": "2024-08-13 04:00", "url": "https://www.asiaone.com/world/trump-back-social-media-site-x-ahead-interview-elon-musk", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Musk, who has endorsed Trump, began the event at 8.42 pm local time, more than 40 minutes after the scheduled start time.\nMusk, the world's richest person, announced his support for Trump shortly after the shooting.\nIn an interview that was light on policy detail, Trump also appeared to praise Musk for firing workers.\nTrump back on XThe interview provided an opportunity for Trump to seize the limelight at a time when his campaign is facing new headwinds.\nMusk has started an external super PAC spending group to support Trump's campaign."}]