[{"id": "b65591f2-b841-4ced-8727-8e60d05ff4bf", "title": "Exclusive | Meet the NYPD highest - ever - ranking Orthodox Jew a 9 / 11 hero who vows to fight antisemitic hate crime", "date": "2024-08-25 19:15", "url": "https://nypost.com/2024/08/25/us-news/meet-the-nypds-highest-ever-ranking-orthodox-jew-a-9-11-hero-who-vows-to-fight-antisemitic-hate-crime/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The NYPD recently promoted the department’s highest-ever-ranking Orthodox Jew — a 9/11 hero who wears a yarmulke on the job — as the city fights a wave of antisemitic hate crime.\nObtained by the N.Y.PostTaylor’s current job includes “outreach to all communities, not just the Jewish community,” he told The Post.\n8 Taylor urged New Yorkers to not hide their religious beliefs in the face of rising hate crimes.\nObtained by the NY PostSo far this year, 229 antisemitic hate crimes have been reported to the NYPD through last Sunday, according to NYPD data.\n“The NYPD is making arrest after arrest after arrest” for anti-Semitic hate crimes, Taylor said."}, {"id": "a05ec6a8-a693-4134-8639-0defc1068539", "title": "Police Detain Suspect in Connection to Explosion Outside of Synagogue in France", "date": "2024-08-25 06:30", "url": "https://sputnikglobe.com/20240825/police-detain-suspect-in-connection-to-explosion-outside-of-synagogue-in-southern-france-1119898747.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240825/police-detain-suspect-in-connection-to-explosion-outside-of-synagogue-in-southern-france-1119898747.htmlPolice Detain Suspect in Connection to Explosion Outside of Synagogue in Southern FrancePolice Detain Suspect in Connection to Explosion Outside of Synagogue in Southern FranceSputnik InternationalOn Saturday, two cars outside a synagogue in the French town of La Grande-Motte exploded, injuring a police officer and prompting an investigation into the event as a possible terrorist attack.\n2024-08-25T05:35+00002024-08-25T05:35+00002024-08-25T05:35+0000worldemmanuel macronfranceisraelgerald darmaninanti-semitismterrorist attacknord streamhttps://cdn1.img.sputnikglobe.com/img/07e8/08/19/1119900440_0:160:3072:1888_1920x0_80_0_0_e1f548b74fbeea71eb1bed15fa57b011.jpgOn Saturday, two cars outside a synagogue in the French town of La Grande-Motte exploded, injuring a police officer and prompting an investigation into the event as a possible terrorist attack.\nAccording to Interior Minister Gérald Darmanin, the suspect opened fire on police.“The alleged perpetrator of the arson attack on the synagogue has been detained.\nFour people and a rabbi were present at the time of the attack but according to officials they were not injured.\nhttps://sputnikglobe.com/20240824/israels-attacks-are-now-part-of-day-to-day-1119891617.htmlfranceisraelSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Mary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgMary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Mary Manley https://cdn1.img.sputnikglobe.com/img/07e6/01/0b/1092187887_0:0:2048:2049_100x100_80_0_0_0c2cc4c84f89aff034cc55bb01fb6697.jpgfrance, anti-semitism, gerald darmanin, emmanuel macron, israel, southern france"}, {"id": "7da4d997-f94f-4c69-882e-7d48ed3ef091", "title": "Hillel , safety NGO launch program to secure campuses for Jewish students", "date": "2024-08-25 19:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-816300", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The new partnership, Operation Secure Our Campuses, will see full-time intelligence analysts monitor campus developments and provide information and real-time support.\nSCN will provide assessments of Jewish facilities on campuses, and the partners will offer consultations on physical security, emergency plans, and procedures.\nThe new program builds on previous cooperation, including SCN provision of guidance, resources, training, assessment, and event security planning.\nSince October 7, SCN said that it had trained 200 people and assisted in security plans for 10 Hillel events across the US.\nNYPD officers stand in between Pro-Israel protestors and Pro-Palestine protestors during a rally against the Baruch College Hillel campus organization at Baruch College on June 05, 2024 in New York City."}, {"id": "7ef31413-12dd-48e3-b67d-567c71dc7718", "title": "Campuses Arent Ready for the Return of Encampments Leslie Lenkowsky", "date": "2024-08-25 10:45", "url": "https://www.ruthfullyyours.com/2024/08/25/campuses-arent-ready-for-the-return-of-encampments-leslie-lenkowsky/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "As students start returning to their colleges and universities this month, many will find new rules about protests, camping, signage, and other types of “expressive activity” on their campuses.\nAt its July meeting, Indiana University’s board of trustees adopted a new “expressive activity” policy, which went into effect on August 1.\nThe Cooley report blamed inconsistencies, gaps, and ambiguities in IU’s “expressive activity” policies for causing confusion about what protesters were permitted to do.\nLike those at other schools, IU’s rules had developed piecemeal over many years.\nLike policies that will be adopted at other schools this fall, IU’s new “expressive activity” rules strive to be neutral about what is being expressed."}, {"id": "74ef1208-167a-4d68-a200-d875405476c0", "title": "The crime trend that continues to rise in Virginia", "date": "2024-08-25 17:45", "url": "https://martinsvillebulletin.com/news/state-regional/hate-crimes-virginia-2023/article_a0e3c275-225d-571b-aa8e-f5cc0b48a973.html", "domain": "martinsvillebulletin.com", "domain_classification": "Unknown", "message": "It was one of more than 270 hate crimes reported by police last year.\nThe most current tally of hate crime cases came from Virginia State Police, which last week released a snapshot of crime trends from 2023.\nStill, the jump is significant — a 49% spike from the year before, when around 182 hate crimes were reported.\nNearly all of the 2023 hate crimes involved assaults or verbal intimidation, police said.\nThat report found the highest numbers of reported hate crimes filed by Fairfax County police, followed by Chesterfield County police."}, {"id": "93469f8f-aca2-4341-a031-5c85842c16d0", "title": "Top ten moments from the 2024 Democratic National Convention", "date": "2024-08-25 13:45", "url": "https://www.bleedingheartland.com/2024/08/25/top-ten-moments-from-the-2024-democratic-national-convention/", "domain": "bleedingheartland.com", "domain_classification": "Unknown", "message": "I doubt either party has had a more successful convention in my lifetime than last week’s Democratic National Convention in Chicago.\nDoug EmhoffPolitical spouses have one job at a Republican or Democratic National Convention: help voters see a candidate’s personal qualities.\nDuncan reassured fellow Republicans, “If you vote for Kamala Harris in 2024, you’re not a Democrat.\nAbortion storytellersEvery night, the Democratic National Convention featured some “ordinary people” on stage as well as political leaders.\nDo something!”)Video, for those who missed it:Feel free to share your own favorite Democratic National Convention moments in the comments."}]