[{"id": "542d1722-b351-4e28-8164-9c17973ec8b9", "title": "Global Turmoil : Leaders in Crisis and Conflict Unfolding", "date": "2024-05-31 00:30", "url": "https://www.devdiscourse.com/article/politics/2956116-global-turmoil-leaders-in-crisis-and-conflict-unfolding", "message": "The decision marks a policy shift by Biden, who had steadfastly refused to allow Ukraine to use American weaponry for strikes inside Russia.\nNorth Korean leader Kim Jong Un guided the firing drill of 600mm \"super-large\" multiple rocket launchers on Thursday, state news agency KCNA reported.\nRegional Governor Oleh Syniehubov said at least two children were among the injured in the attack, which occurred at about midnight local time.\nAfter two days of deliberation, the 12-member jury pronounced Trump guilty on all 34 felony counts he faced.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "54392014-e824-4198-9747-e013623f7d24", "title": "Biden Gaza Policy Leaves Israel Vulnerable to Hezballah", "date": "2024-05-31 09:15", "url": "https://www.americanthinker.com/articles/2024/05/biden_s_gaza_policy_leaves_israel_vulnerable_to_hezb_allah.html", "message": "The Biden administration has been arguing with itself over its support of Israel in its war against Hamas in Gaza.\nBut the current existential threat to Israel comes from Lebanon, and the Biden administration’s fixation on Gazan civilians is leaving Israel fatally vulnerable.\nThe Arrow and David’s Sling elements of Israel’s missile defenses are not designed for this threat; only the Iron Dome and the yet-to-be-deployed Iron Beam (laser-based) systems are.\nNor can the Biden administration (or the IDF, for that matter) rely on the notion that there would be intelligence forewarning of a full-scale Hezb’allah attack.\nIsrael must assume that its first confirmation of a Hezb’allah attack will be a barrage of several thousand incoming missiles."}, {"id": "51bef250-13eb-40da-9e24-eadec14638e7", "title": "Israel is accused by the world too easily during the war - editorial", "date": "2024-05-31 03:30", "url": "https://www.jpost.com/opinion/article-804432", "message": "A targeted IDF strike was carried out in Rafah on Sunday, targeting two Hamas leaders, which seemingly led to an explosion that killed 45 civilians.\nBoth Rabia and Nagar were in a compound a mile away from the humanitarian zone that was created to keep Palestinians safe when Israel targeted the terrorists in a precise airstrike.\nBut one thing is clear from even the shortest of closer looks into what happened on Sunday: Israel did not intentionally kill dozens of Palestinian civilians.\nThe IDF – Israel as a whole, in fact – knows to own up to its mistakes and to reach conclusions that would change future actions accordingly.\nHowever, the world media and critics of Israel afford it even less credibility than they do a terrorist organization."}, {"id": "98b90ed7-3a99-4970-8514-4898853e9cdf", "title": "Kyiv authorities post photos showing aftermath of Russian missile attack on Ukraine capital", "date": "2024-05-31 07:45", "url": "https://www.yahoo.com/news/kyiv-authorities-post-photos-showing-045423056.html", "message": "A service station and car wash have caught fire in the Holosiivskyi district of Kyiv, with six cars and warehouse premises damaged, as a result of falling wreckage from downed aerial targets.\nSource: Kyiv City Military Administration on TelegramQuote: \"The aftermath of a missile strike on Kyiv.\nThe following were damaged by fire: a private residential building serving as a service station; a car wash; six cars; and a warehouse.\nBackground:An air-raid warning was issued in Kyiv and Kyiv Oblast for a second time on the night of 30-31 May and a loud explosion was heard.\nThe Russians launched a missile strike on Kyiv."}, {"id": "cbcad8bd-b7b8-4246-8e68-5c0529c86a55", "title": "Huge explosions as eight of Ukraine powerful  Neptune  missiles blast Russian oil depot supplying Vlad war machine", "date": "2024-05-31 09:00", "url": "https://www.thesun.co.uk/news/28224854/ukraine-double-strike-oil-depot-russia/", "message": "UKRAINE blasted two Russian oil depots in a massive strike with eight powerful Neptune missiles and kamikaze drones.\nKrasnodar regional Veniamin Kondratyev said: “As a result of the air strike, the infrastructure of the oil depot was damaged.\nEight such Neptune missiles were used to strike a ferry crossing and oil terminal in Port Kavkaz, according to Ukrainian journalist Andrey Tsaplienko.\n“Several Ukrainian-made missiles from the Neptune coastal missile system were fired at the oil terminal near Port Kavkaz,” said a statement.\nPort Kavkaz is the fifth port in Russia for cargo turnover and the second port in the Black Sea-Azov basin after Novorossiys."}, {"id": "54e43759-89d1-4a23-aeb1-eb5cd1358699", "title": "Russia launches missile attack on Kyiv , no casualties reported", "date": "2024-05-31 06:45", "url": "https://www.yahoo.com/news/russia-launches-missile-attack-kyiv-043505052.html", "message": "During the night of May 31, Kyiv was targeted by a Russian missile attack.\nSerhii Popko, head of the Kyiv City Military Administration, said in a post on Telegram that according to preliminary data, Russian forces likely used cruise missiles.\nThe Kyiv City Military Administration provided an overview of the consequences of the attack around 7:40 a.m.\nRead also: Updated: Russian missile attacks on Kharkiv kill 3, injure 23We’ve been working hard to bring you independent, locally-sourced news from Ukraine.\nConsider supporting the Kyiv Independent."}, {"id": "cbcad7a2-1c8c-46da-8c41-2781469bc053", "title": "Missile attack on Kyiv : all targets downed but falling wreckage causes fire", "date": "2024-05-31 06:45", "url": "https://www.yahoo.com/news/missile-attack-kyiv-targets-downed-024105955.html", "message": "Missile attack on Kyiv: all targets downed but falling wreckage causes fireThe Russians launched a missile strike on Kyiv during an air-raid on the night of 30-31 May.\nEarly reports indicate that cruise missiles have been used.\nSource: Serhii Popko, Head of Kyiv City Military Administration, on TelegramDetails: A fire broke out in a non-residential building in the Holosiivskyi district as a result of falling wreckage.\nBackground:An air-raid warning was issued in Kyiv and Kyiv Oblast for the second time on the night of 30-31 May and a loud explosion was heard.\nEarlier that night, Shahed drones reached Kyiv Oblast."}, {"id": "2a2f44a7-9f8b-4740-ac42-32bdb33a2739", "title": "Joe Biden allows Ukraine to use US weapons to conduct limited strikes inside Russia", "date": "2024-05-31 04:00", "url": "https://www.irishtimes.com/world/us/2024/05/31/joe-biden-allows-ukraine-to-use-us-weapons-to-conduct-limited-strikes-inside-russia/", "message": "The Biden administration has decided to allow Ukraine to strike inside Russia with US-made weapons with the aim of blunting Russia’s attacks in the Kharkiv area, senior US officials said.\nPhotograph: Finbarr O’Reilly/The New York TimesUS president Joe Biden has authorised Ukraine to conduct limited strikes inside Russia with US-made weapons, opening what could well be a new chapter in the war for Ukraine, US officials said Thursday.\nBecause Kharkiv is so close to Russia, Ukraine’s president Volodymyr Zelenskyy repeatedly pressed Mr Biden and his aides for the right to strike back inside Russia.\nA senior US official in Washington said the administration’s policy prohibiting Ukraine from using US-made weapons for “long range” attacks inside Russia had not changed.\nIt was Gen Cavoli who conveyed the decision to Ukraine, officials said."}, {"id": "8bf98ed3-94a2-4c37-81b1-929642942ad7", "title": "Biden eases ban on Ukraine use of US weapons inside Russia | Russia - Ukraine war News", "date": "2024-05-31 07:30", "url": "https://www.aljazeera.com/news/2024/5/31/biden-eases-ban-on-ukraines-use-of-us-weapons-inside-russia", "message": "US president eases ban on Ukraine using US weapons to hit Russian targets in bid to protect the Kharkiv region.\nUnited States President Joe Biden has eased a ban on Ukraine using US weapons inside Russian territory to help the country defend its northeastern Kharkiv region from attack.\nKyiv will be authorised to strike military targets on the border with the Kharkiv region, where Russia has overrun a number of villages since May 10, forcing the evacuation of thousands of residents.\nGermany discussed with allies the fact that Russia has carried out strikes on the Kharkiv region from positions in the immediately adjacent Russian border area, a government spokesperson said in a statement.\nA Russian attack at midnight (21:00 GMT) killed at least three people and injured 16 after a Russian missile hit an apartment block in the city."}, {"id": "41d48e57-287c-49cc-92ef-0c8ff6a6b2db", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:15", "url": "http://www.nhregister.com/news/world/article/russian-missiles-kill-4-people-in-kharkiv-after-19487746.php", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP Firefighters put out a fire on an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP Police officers cover a dead body after the Russian missile attack hit an apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024."}, {"id": "274e74e1-26f0-4818-9e78-05b899abda90", "title": "Russia Destroys Ukrainian Magura Unmanned Surface Vessel with FPV Drone", "date": "2024-05-31 01:00", "url": "https://theaviationist.com/2024/05/30/fpv-vs-magura/", "message": "But the Ukrainian loss was interesting and rare, as it was first documented destruction of a USV (Unmanned Surface Vessel) with a kamikaze UAV (Unmanned Aerial Vehicle).\nRussia has long suffered under menacing Ukrainian USV strikes in the Black Sea and around the Sevastopol naval harbor.\nUnmanned Kamikaze Boat, Destroyed by Unmanned Kamikaze AircraftThe video, that went around on several Russian and Ukrainian Telegram groups, showed what appears to be a quadcopter-type drone rapidly approaching the Magura V5 USV.\n“Possibly the first documented case of a strike with an FPV drone targeting an unmanned surface vehicle (USV).\nMagura V5The Magura V5, developed and manufactured by FTE SPETSTECHNOEXPORT, is 5.5-meters in length, 0.5-meters in height, can carry a payload of 320-kg to a distance of 800-km."}, {"id": "22ff765f-119f-4c12-969a-1256cc3ba346", "title": "Kim Jong Un oversees missile launch in  power demonstration  to South Korea", "date": "2024-05-31 07:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/31/North-Korea-Kim-Jong-Un-multiple-rocket-launcher-power-demonstration/7151717135821/", "message": "North Korean leader Kim Jong Un oversaw a firing drill of 600mm super-large multiple rocket launchers in a \"power demonstration\" to South Korea, state-run media reported Friday.\nSouth Korea's military said Thursday it detected a launch of around 10 short-range ballistic missiles from the Pyongyang area.\nThe United States and South Korea refer to the 600mm rocket system as the KN-25 and characterize it as a short-range ballistic missile.\nNorth Korea has claimed since October 2022 that the weapon can be fitted with a tactical nuclear warhead.\n\"Kim Jong Un is absolutely not interested [in talks],\" Sue Mi Terry, a senior fellow with the Council on Foreign Relations, said."}, {"id": "6edf7d38-9c26-43ee-9a2c-bfda42d98493", "title": "Israel Intercepts Cruise Missile Launched From Iraq", "date": "2024-05-31 00:30", "url": "https://www.zerohedge.com/geopolitical/israel-intercepts-cruise-missile-launched-iraq", "message": "Time of Israel is describing \"cruise missiles\" fired from Iraq and shot down over northern Israel on Thursday.\nOther Israeli outlets pointed to a single cruise missile inbound over Israel and possibly accompanied by drones, however.\n\"Following the interceptions, the pro-Iranian militias in Iraq claimed to have launched drones towards Eilat,\" Israel National News (Arutz Sheva) reported.\n\"Earlier today, following sirens regarding a hostile aircraft infiltration in the Golan Heights area, the IDF intercepted a cruise missile that approached Israel from the east,\" the IDF said.\nWednesday saw an Israeli airstrike hit deep inside Syria, in Baniyas city, though it's unclear what the precise target was."}, {"id": "59c79212-2a22-414d-b2e9-09301cec646b", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 03:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/articleshow/110578335.cms", "message": "The state media on Friday reported that these drills were intended to demonstrate North Korea 's capability for preemptive attacks on neighbouring South Korea .These firing exercises seem to refer to what South Korea identified as a barrage of ballistic missile test-launches conducted by North Korea on Thursday.\nExperts highlight that North Korea's large artillery rockets blur the lines between artillery systems and short-range ballistic missiles .\n\"KCNA accused South Korea of staging a \"clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right\" of North Korea.\nHad it succeeded, North Korea would have placed its second spy satellite into orbit.The multiple rocket launchers are a significant part of North Korea's arsenal aimed at South Korea.\nSouth Korea's military had earlier reported that North Korea fired about 10 suspected ballistic missiles into the sea off its east coast.The unsuccessful spy satellite launch by North Korea was strongly condemned by the US, South Korea, and others."}, {"id": "4cb98c2b-d7c9-4344-bd8b-1b41cb876df7", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:00", "url": "https://www.yahoo.com/news/russian-missiles-kill-4-people-081752775.html", "message": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stanceFirefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nA German government statement noted that, in recent weeks, Russia has prepared, coordinated and carried out attacks on Ukraine's northeastern Kharkiv region in particular from areas just over the border in Russia.\n“Together we are convinced that Ukraine has the right under international law to defend itself against these attacks,” the statement said.\nWestern Europe’s inadequate military production has also slowed crucial deliveries of military aid to Ukraine.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said."}, {"id": "bf1abcd4-7496-4f10-b979-77aafef59142", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:15", "url": "https://www.clickorlando.com/news/world/2024/05/31/russian-missiles-kill-4-people-in-kharkiv-after-biden-oks-a-ukrainian-response-using-us-weapons/", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nA German government statement noted that, in recent weeks, Russia has prepared, coordinated and carried out attacks on Ukraine's northeastern Kharkiv region in particular from areas just over the border in Russia.\nRecommended Videos“Together we are convinced that Ukraine has the right under international law to defend itself against these attacks,” the statement said.\nWestern Europe’s inadequate military production has also slowed crucial deliveries of military aid to Ukraine.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said."}, {"id": "3a6876a0-979c-4a97-9621-506dab5ce6b8", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:15", "url": "https://www.wfmz.com/news/russian-missiles-kill-4-people-in-kharkiv-after-biden-oks-a-ukrainian-response-using-u/article_47dc6e45-8465-5130-927b-d620c4f2c2ad.html", "message": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U.S. weaponsThe German government says Ukraine can use weapons it delivers against attacks from positions just over the Russian border"}, {"id": "c6bee4b0-e4c9-4652-b367-6af18742228d", "title": "Experts : Israel could have used smaller bombs in Gaza tent fire", "date": "2024-05-31 07:30", "url": "https://www.mercurynews.com/2024/05/30/defense-experts-israel-could-have-used-smaller-bombs-in-gaza-tent-fire/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nSunday’s strike shows that even the smaller 250-pound bombs the U.S. has continued to provide can be too large for use near densely packed refugee areas, Cancian said."}, {"id": "e88ce536-a79c-4a1b-bedf-b539f08a25c4", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-31 07:30", "url": "https://www.pressdemocrat.com/article/news/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaz/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they're smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said."}, {"id": "f68d4ec9-e851-4eac-8fab-6433306f20b5", "title": "Experts : Israel could have used smaller bombs in Gaza tent fire", "date": "2024-05-31 01:15", "url": "https://www.eastbaytimes.com/2024/05/30/defense-experts-israel-could-have-used-smaller-bombs-in-gaza-tent-fire/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nSunday’s strike shows that even the smaller 250-pound bombs the U.S. has continued to provide can be too large for use near densely packed refugee areas, Cancian said."}, {"id": "da966195-b105-42d7-a179-926313b3eba1", "title": "Four killed , 25 injured , including children after Russian  double - tap  strikes on Kharkiv", "date": "2024-05-31 08:15", "url": "https://www.yahoo.com/news/four-killed-25-injured-including-064900841.html", "message": "Four killed, 25 injured, including children after Russian 'double-tap' strikes on KharkivDamaged house in Kharkiv after 31 May attackFive people were killed and 25 injured after repeated Russian strikes on Kharkiv - including \"double-tap\" strikes - overnight on May 31, Kharkiv Mayor, Ihor Terekhov, reported on Telegram.\n“25 people were injured, including two children - a boy and a girl, both 12 years old, as a result of the Russian strike.”Six people, including a child, were rescued, it was reported at 8:00 a.m. EET.\nUkraine's Internal Affairs Ministry showed footage of the damage caused by the Russian attack on the residential building.\nKharkiv reported, citing Kharkiv Police Chief Volodymyr Tymoshko.\nСуспільне.Харків/ TelegramСуспільне.Харків/ TelegramСуспільне.Харків/ TelegramСуспільне.Харків/ TelegramReports showed that Russia fired five S-300 / S-400 missiles in the Novobavarskyi district - five hits were recorded on the city's civilian infrastructure."}, {"id": "995db3e2-9205-4938-bc3b-91d6c293cb0c", "title": "WW3 threat raised as US grants Ukraine permission to fire its missiles INTO Russia - as Kremlin warns of  escalating tensions  ", "date": "2024-05-31 08:15", "url": "https://www.dailymail.co.uk/news/article-13479373/WW3-threat-raised-grants-Ukraine-permission-fire-missiles-Russia-Kremlin-warns-escalating-tensions.html", "message": "Ukraine will only be allowed to use the weapons to defend the northeastern Kharkiv region, which is currently bearing witness to a drawn-out brawl for control of the region.\n'The use of tactical nuclear weapons can also be miscalculated, although this would be a fatal mistake,' said Medvedev, who was Russian president with his finger on the nuclear button from 2008 to 2012.\n'After all, as the President of Russia rightly noted, European countries have a very high population density.\n'And for those enemy countries whose lands are further than the coverage area of tactical nuclear weapons, there is finally a strategic potential.\nFrench President Emmanuel Macron had also insisted this week that Ukraine be allowed to 'neutralise' bases in Russia used to launch strikes."}, {"id": "2b80b0df-a19d-46a9-8a61-0f22b36b502f", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-31 02:45", "url": "https://www.nzherald.co.nz/world/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaza-tent-fire-experts-say/5N64QUJQHFHXFG2P7HWOMKRDCQ/", "message": "They said the bombs used were likely US-made.\nPalestinians fleeing from the southern Gaza city of Rafah during an Israeli ground and air offensive.\nBased on those images and satellite photos of the debris field, two defence experts said the bombs used were likely US-made 113kg GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the US has provided to Israel, these bombs can still create a wide swath of damage.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said."}, {"id": "0505c1ef-b684-4de2-9bbd-3fe584baad04", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 01:00", "url": "https://abcnews.go.com/International/wireStory/north-koreas-kim-supervises-firing-drills-simulating-preemptive-110699061", "message": "North Korea says leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South KoreaSEOUL, South Korea -- North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea's capital on Thursday.\nThat refers to a South Korean aerial exercise performed hours before North Korea's failed spy satellite launch on Monday night.\nSouth Korea's military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast.\nNorth Korea's failed spy satellite launch drew strong condemnation from the U.S., South Korea and others because the U.N. bans any satellite launches by North Korea, viewing them as covers for testing missile technologies."}, {"id": "38c18fed-5072-4ac1-b338-33d4a69a9f78", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 03:15", "url": "https://www.startribune.com/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/600369872/", "message": "SEOUL, South Korea — North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country's ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea's capital on Thursday.\nKCNA accused South Korea of staging a ''clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right'' of North Korea.\nThat refers to a South Korean aerial exercise performed hours before North Korea's failed spy satellite launch on Monday night.\nSouth Korea's military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast."}, {"id": "9bfa8aef-2627-4abd-a0fd-ca2bff7b3a0b", "title": "Syrian President Bashar Assad visits Iran to express condolences over death of Raisi", "date": "2024-05-31 08:45", "url": "https://www.thehindu.com/news/international/syrian-president-bashar-assad-visits-iran-to-express-condolences-over-death-of-raisi/article68235403.ece", "message": "Syrian President Bashar Assad met with Iran's supreme leader in the capital Tehran on May 30 and expressed his condolences over the death of President Ebrahim Raisi in a helicopter crash, state media reported on May 30.\nMr. Assad met with Iranian Supreme Leader Ayatollah Ali Khamenei and also expressed condolences over the death of Foreign Minister Hossein Amirabdollahian who was also killed in the helicopter crash earlier this month.\nHundreds of Iranian forces have been killed in the war though Tehran has long said it has only a military advisory role in Syria.\nMr. Assad’s trip also comes with the backdrop of the Israel-Hamas war roiling the region.\nRaisi, the country’s Foreign Minister and others were found dead at the site of a helicopter crash after an hours-long search through a foggy, mountainous region of the country’s northwest."}, {"id": "0b2f824a-98b0-4c8c-bce6-4734fd114628", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 01:30", "url": "https://www.thespec.com/news/world/asia/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/article_51766435-268f-5f13-b8de-f1f6675410d6.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "27b5975a-c1bf-4847-9ded-a447061fbe5a", "title": "Assad Condolences Amidst Iran Political and Regional Turmoil", "date": "2024-05-31 08:15", "url": "https://www.devdiscourse.com/article/politics/2956363-assads-condolences-amidst-irans-political-and-regional-turmoil", "message": "Syrian President Bashar Assad met with Iran's supreme leader in the capital Tehran on Thursday and expressed his condolences over the death of President Ebrahim Raisi in a helicopter crash, state media reported Thursday.\nAssad met with Iranian Supreme Leader Ayatollah Ali Khamenei and also expressed condolences over the death of Foreign Minister Hossein Amirabdollahian who was also killed in the helicopter crash earlier this month.\nHundreds of Iranian forces have been killed in the war though Tehran has long said it has only a military advisory role in Syria.\nAssad's trip also comes with the backdrop of the Israel-Hamas war roiling the region.\nRaisi, the country's foreign minister and others were found dead at the site of a helicopter crash after an hourslong search through a foggy, mountainous region of the country's northwest."}, {"id": "842a4c81-4a15-400e-8ea7-a6f55b8af7fc", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:30", "url": "https://www.clickondetroit.com/news/world/2024/05/31/russian-missiles-kill-4-people-in-kharkiv-after-biden-oks-a-ukrainian-response-using-us-weapons/", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nA German government statement noted that, in recent weeks, Russia has prepared, coordinated and carried out attacks on Ukraine's northeastern Kharkiv region in particular from areas just over the border in Russia.\nRecommended Videos“Together we are convinced that Ukraine has the right under international law to defend itself against these attacks,” the statement said.\nWestern Europe’s inadequate military production has also slowed crucial deliveries of military aid to Ukraine.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said."}, {"id": "21542dc7-08fd-4a4d-b4a3-26b0ffda641e", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-31 00:00", "url": "https://isp.netscape.com/news/world/story/0001/20240530/ada219d17926a14ca8c179338d53d109", "message": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire, experts sayWASHINGTON (AP) — Defense experts who have reviewed debris images from an Israeli airstrike that ignited a deadly fire in a camp for displaced Palestinians questioned why Israel did not use smaller, more precise weapons when so many civilians were nearby.\nThey said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they're smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby."}, {"id": "0388b058-ec2a-4e71-a26a-321acf3cab6d", "title": "The US Navy botched the design of its new $1 billion frigates : report", "date": "2024-05-31 09:15", "url": "https://www.businessinsider.in/defense/news/the-us-navy-botched-the-design-of-its-new-1-billion-frigates-report/articleshow/110574224.cms", "message": "US Navy/MCS2 Stuart PhillipsUS Navy's guided missile frigate project faces delays due to a flawed design.\nThe $22 billion project started construction before completing the design, causing issues.\n\"To reduce technical risk, the Navy and its shipbuilder modified an existing design to incorporate Navy specifications and weapon systems,\" the report said.\n\"However, the Navy's decision to begin construction before the design was complete is inconsistent with leading ship design practices and jeopardized this approach.\"\nIn addition to scheduling delays and the halting of ship construction, the Navy has yet to demonstrate frigate propulsion and machinery control systems."}, {"id": "cb913b9e-f2f8-456c-b87a-7e7a83386c62", "title": "North Korean leader guides firing drill involving super - large multiple rocket launchers", "date": "2024-05-31 08:15", "url": "https://www.prokerala.com/news/articles/a1535683.html", "message": "Seoul, May 31 : North Korea, on Friday, said it conducted a firing drill involving super-large multiple rocket launchers in a bid to demonstrate its resolve to stage a preemptive strike against South Korea if provoked.\nNorth Korean leader Kim Jong-un supervised the \"power demonstration firing\" drill involving 600 mm multiple rocket launchers on Thursday, according to the Korean Central News Agency (KCNA).\nThe South Korean military said it detected the North's launch of around ten short-range ballistic missiles toward the East Sea on Thursday.\nThe North's super-large multiple rocket launch system is classified as a short-range missile that could put the entire South Korean territory within range.\nPhotos carried by state media showed 18 artillery shots being fired from multiple rocket launchers on transporter erector launchers (TELs)."}, {"id": "20fc9c58-18b0-412b-822f-15ab1d4fb63f", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:00", "url": "https://www.dudleynews.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "3499024b-ab94-43c4-968f-caed26ff1aed", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.kidderminstershuttle.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "5f2a1b87-65f8-4f90-bc7a-2991f2fc77f9", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.somersetcountygazette.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "5cb3a6a3-d92b-4f99-96d8-fe747065a63d", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.northwichguardian.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "e4937c93-c4f3-43ed-914a-803b16e3e85e", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.dumbartonreporter.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "d65657f2-dedd-4fb9-a23c-fb8c0bcb36e9", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.denbighshirefreepress.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "1cd5b0cb-7416-4976-a09f-b2e381fc2ddc", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.surreycomet.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "41eb17eb-86dd-43ae-8ed2-6a276f559faf", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:15", "url": "https://www.islingtongazette.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "dbf6601b-9e26-4c1f-a5c1-af3ed8334412", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-05-31 09:30", "url": "https://www.halesowennews.co.uk/news/national/24357235.russian-missiles-hit-apartment-block-ukrainian-city/", "message": "The night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThe tactic is called a “double tap” in military jargon, and Russia used the same method in Syria’s civil war.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "605e324a-527f-4011-81a3-f112a8a1824c", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea – Winnipeg Free Press", "date": "2024-05-31 00:15", "url": "https://www.winnipegfreepress.com/world/2024/05/30/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea", "message": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea’s capital on Thursday.\n(AP Photo/Lee Jin-man)KCNA accused South Korea of staging a “clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right” of North Korea.\nSouth Korea’s military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast.\nIn this undated photo provided on Friday, May 31, 2024 by the North Korean government, North Korean leader Kim Jong Un supervises firing drills at an undisclosed place in North Korea."}, {"id": "4755519b-00d5-41fb-8d11-c562cbd9a4fd", "title": "Three killed in Russian strikes on Kharkiv in Ukraine , two children wounded", "date": "2024-05-31 07:45", "url": "https://www.thejournal.ie/kharkiv-bombings-6394968-May2024/", "message": "But that calculus changed after Russian forces launched a fresh offensive in the Kharkiv region this month.\nOvernight Russian strikes on a residential area in Kharkiv city killed three people and wounded at least 23 others, including two children, regional police said early this morning, warning residents could still be trapped under the rubble.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nFrench President Emmanuel Macron had also insisted this week that Ukraine be allowed to “neutralise” bases in Russia used to launch strikes.\nBut experts say a recent weapons testing spree in North Korea may be for munitions destined for use in Ukraine."}, {"id": "9ddbbdcc-89d0-44bd-a567-7a8e1a89b256", "title": "Fico assassination attempt reshuffles cards in Slovakia EU election campaign – Euractiv", "date": "2024-05-31 09:15", "url": "https://www.euractiv.com/section/politics/news/ficos-assassination-attempt-reshuffles-cards-in-slovakias-eu-election-campaign/", "message": "Before the assassination attempt, most polls were predicting a clear victory of the leading opposition party, pro-Western liberal Progressive Slovakia (PS/Renew).\nFico’s Smer and his coalition partner Peter Pellegrini’s Hlas (both S&D but suspended) followed, with significant differences.\nAt an online event recently organised by Euractiv Slovakia, political scientist Aneta Világi noted that “for the first time, EU foreign policy is a critical topic ahead of the EU elections in Slovakia”.\n“Until now, the campaigns for the previous EU elections have been about issues closely related to our domestic problems,” she pointed out.\nRegarding the next Slovak EU commissioner, Fico has reiterated his support for the present EU Commissioner, Executive Vice-President Maroš Šefčovič."}, {"id": "badbb9db-350f-4130-96db-dbd385eae2ae", "title": "Russian missiles kill 4 people in Kharkiv after Biden OKs a Ukrainian response using U . S . weapons", "date": "2024-05-31 09:30", "url": "http://www.middletownpress.com/news/world/article/russian-missiles-kill-4-people-in-kharkiv-after-19487746.php", "message": "Firefighters put out a fire an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP Firefighters put out a fire on an apartment building damaged in the Russian missile attack in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP Police officers cover a dead body after the Russian missile attack hit an apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024.\nAndrii Marienko/AP People react after the Russian missile attack hit their apartment building in Kharkiv, Ukraine, Friday, May, 31, 2024."}, {"id": "3143249a-61ea-4e43-84b9-d1cee63b3cdd", "title": "Ukrainian air defense downs four Shahed drones , Iskander - K cruise missile", "date": "2024-05-31 08:00", "url": "https://www.ukrinform.net/rubric-ato/3869818-ukrainian-air-defense-downs-four-shahed-drones-iskanderk-cruise-missile.html", "message": "Ukraine's air defense units intercepted four Russian Shahed attack drones and an Iskander-K cruise missile on Friday, May 31.\nUkrainian Air Force Commander Mykola Oleshchuk reported this on the Telegram messaging app, according to Ukrinform.\nOn the night of May 30 to 31, the Russian army attacked Kharkiv with five S-300/S-400 air defense missiles fired from the Belgorod region and Kyiv with an Iskander-K cruise missile launched from the Kursk region.\nThe enemy also launched four Shahed-131/136 type attack UAVs from the Yeysk area.\nAs a result of the combat work, anti-aircraft missile units and mobile fire groups destroyed four Shahed drones in the Kyiv, Zaporizhzhia, and Dnipropetrovsk regions, as well as an Iskander-K missile in the Kyiv region."}, {"id": "d846b051-60d8-4b5e-86dc-6211642ebd04", "title": "Biden Allows Ukraine To Use US Weapons To Attack Inside Russia In Highly Dangerous Escalation", "date": "2024-05-31 04:15", "url": "https://www.zerohedge.com/geopolitical/dangerous-shift-escalation-biden-allows-ukraine-use-us-weapons-attack-inside-russia", "message": "The same official stipulated that the policy of not allowing long-range strikes inside Russia \"has not changed.\"\nBut the official said Ukraine cannot use those weapons to hit civilian infrastructure or launch long-range missiles, such as the Army Tactical Missile System, to hit military targets deep inside Russia.\nA reporter followed up by asking if he meant the White House will now support Ukrainian attacks inside Russia.\nThe Biden administration gave a non-Ukrainian foreign intelligence service permission to strike inside Russia using sleeper cells 48 hours prior to the invasion.\nhttps://t.co/Kdnn2EgJfJ — Jack Murphy (@JackMurphyRGR) May 30, 2024Russian President Vladimir Putin warned earlier this week there will be \"major consequences\" if NATO countries support long-range strikes on Russian territory."}, {"id": "054cc44d-6dd7-47da-9845-85c69839b682", "title": "Day 237 : Intensified Israeli Bombing Kills Dozens In Gaza", "date": "2024-05-31 01:30", "url": "https://imemc.org/article/day-237-intensified-israeli-bombing-kills-dozens-in-gaza/", "message": "On Thursday, Day 237 of the ongoing genocide in Gaza, the Israeli army intensified the bombing and shelling of various parts of the coastal enclave, killing and wounding dozens of Palestinians.\nThe Israeli army said one soldier was killed in northern Gaza and added that three soldiers were injured.\nMedia sources said the army fired many artillery shells at homes and buildings in northern Gaza, including Beit Lahia and Jabalia, entire residential blocks, and even centers and tents used by displaced families.\nAt least two Palestinians were killed, and many were injured, when the army fired a missile at displaced families near the Tuwam junction, in northern Gaza.\nMedical sources said at least nineteen Palestinians were killed, and dozens injured, in repeated bombings and shelling of various parts of Rafah, Thursday."}, {"id": "fb4c22d0-5613-4d73-a15a-6261b274cc0e", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:15", "url": "https://www.yahoo.com/news/us-says-russia-using-n-033805832.html", "message": "\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\nSoo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un's father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "fd22f252-d667-4d88-91f8-b105930f48f2", "title": "US says Russia using North Korea missiles in Ukraine", "date": "2024-05-31 04:15", "url": "https://timesofindia.indiatimes.com/world/us/us-says-russia-using-north-korea-missiles-in-ukraine/articleshow/110580155.cms", "message": "Clear evidenceWASHINGTON: Russia is using North Korean ballistic missiles in Ukraine , a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.The report by the Pentagon's Defense Intelligence Agency used open-source imagery to confirm that debris found in Ukraine's Kharkiv region in January this year is from a short-range ballistic missile made in North Korea .\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\n\"They appear to provide clear evidence that these were used in the attack on Ukraine, and clearly demonstrate that the recent statement by Kim Yo Jong denying Russian arms transfer is blatantly false,\" Hong told AFP.North Korea's testing spree, which includes showing off the large-scale production and operational capabilities of its weaponry, \"seems to be part of efforts to supply additional weapons to Russia ahead of President (Vladimir) Putin's visit to North Korea,\" he added.South Korea's defense ministry told AFP it has no comment to give on the report.Soo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\n\"What's concerning, though, is the ongoing and uninhibited cooperation between the two nations,\" said Kim, who currently works in policy for LMI Consulting.\n\"As time passes and as the conflict unravels, the depth of cooperation is bound to become more extensive and diversified."}, {"id": "484050e7-fcf0-4414-b475-f5d0dc53ab45", "title": "US says Russia using North Korea missiles in Ukraine", "date": "2024-05-31 05:30", "url": "https://www.thedailystar.net/news/world/news/us-says-russia-using-north-korea-missiles-ukraine-3623501", "message": "\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\nSoo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un's father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "22a9667c-d55d-4ca3-84bc-223cd3e775b1", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/us-says-russia-using-n-korea-missiles-in-ukraine/article", "message": "“Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,” the DIA said in a statement released with the report on Wednesday.\nSoo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was “being prepared”.\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un’s father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "3b4cebce-c8bc-4657-92d2-81e7879aa567", "title": "114 Million Fled Homes As Nations Failed To Tackle Causes Of Conflict : UN Refugee Chief", "date": "2024-05-31 09:00", "url": "https://www.outlookindia.com/international/114-million-fled-homes-as-nations-failed-to-tackle-causes-of-conflict-un-refugee-chief", "message": "“But it is not too late to put your focus and energy on the crises and conflicts that remain unresolved, so that they are not allowed to fester and explode again,” Grandi said.\n“It is not too late to step up help for the millions who have been forcibly displaced to return home voluntarily, in safety and with dignity.”"}, {"id": "1f82a37f-00f1-4c13-bcd2-121b1123c4ce", "title": "Man Stabbed With A Machete In Times Square | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-31 01:00", "url": "https://1450wkip.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "f933afa8-ffb6-4055-a611-f5ec93f26e6f", "title": "Man Stabbed With A Machete In Times Square | News Talk 1090 WKBZ - AM", "date": "2024-05-31 01:00", "url": "https://newstalk1090.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "18fa9e46-b59b-43cd-bbd0-ebc8e404c9bb", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:00", "url": "https://1150wima.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "bafe1ba8-2e6d-44d8-abfe-e19743579bfa", "title": "Man Stabbed With A Machete In Times Square | News Radio 103 . 1 and 810 WGY", "date": "2024-05-31 01:15", "url": "https://wgy.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "f25c9d4f-d670-4373-9c15-fe3befea10ab", "title": "Man Stabbed With A Machete In Times Square | KOA 850 AM & 94 . 1 FM", "date": "2024-05-31 01:15", "url": "https://koacolorado.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "52273df2-6427-4577-b672-cf22060e6169", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 00:15", "url": "https://kste.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "d275c6a0-7bff-4604-8aab-abdee714a2f9", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://55krc.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "46a4b262-5ddc-476f-be32-5ccf513ee299", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://kfbk.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "96f4cacc-b1ad-4da2-ab63-17cd67c43836", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://wvoc.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "41d6a39f-b852-49c2-86fe-7c3b3638e391", "title": "Man Stabbed With A Machete In Times Square | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-05-31 00:45", "url": "https://powertalk1460.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "143e9cb7-dc92-4c4a-9197-e38120518616", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 02:15", "url": "https://klvi.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "28063f2a-2356-49f1-8c96-f68be2133d19", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 00:45", "url": "https://600kcol.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "073bcfc7-2cb8-471f-a28f-b775b50a0e26", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://newsradio967.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "50e2db44-71bc-4614-98c1-47b47c0d66fb", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://newsradio1470.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "eb6f07fe-3ccc-4a84-963f-a5d94bc6ac15", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://wmrn.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "2309ad44-3bd3-45bc-a96b-e3cd2132ad34", "title": "Man Stabbed With A Machete In Times Square | NewsRadio WKCY", "date": "2024-05-31 01:45", "url": "https://newsradiowkcy.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "2db3b084-e4ff-4a19-988d-62ecb77bb766", "title": "Man Stabbed With A Machete In Times Square | KFYR 550 AM / 99 . 7 FM", "date": "2024-05-31 01:45", "url": "https://kfyr.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "b255fdb9-d862-41f2-8e01-cc6afabc2a48", "title": "Man Stabbed With A Machete In Times Square | NewsRadio 570 WKBN", "date": "2024-05-31 01:45", "url": "https://570wkbn.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "0e81a0e4-b297-4419-854b-9e7a9978249f", "title": "Israel dishonors families of Oct . 7 victims who beg for peace – The Forward", "date": "2024-05-31 05:45", "url": "https://forward.com/opinion/617878/oct-7-victim-families-peace-israel-hamas-rafah/", "message": "Zeigen is the son of the late Vivian Silver, a peace activist killed by Hamas’s Oct. 7 attack on Israel.\n“Because you can’t cure dead babies with more dead babies.”Israel has promised to honor the victims of Oct. 7.\nOf course, the victims of Oct. 7 were not all alike, and neither are their families.\nTo achieve peace in their names.”All around, I see people saying they feel that the victims of Oct. 7 have been forgotten or overlooked, even erased.\nThis is as true for the families of hostages as for the families of the dead."}, {"id": "0bc3161a-6151-4b00-a9b3-2c9277086549", "title": "N . Korea Kim supervises rocket launcher test : state media", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/n-koreas-kim-supervises-rocket-launcher-test-state-media/article", "message": "A handout photo from North Korean state media shows the test-firing of the country's 600mm 'super-large' multiple rocket launcher system - Copyright KCNA VIA KNS/AFP STRNorth Korean state media on Friday released images of leader Kim Jong Un supervising tests of a multiple rocket launcher system, a day after Seoul accused Pyongyang of firing a volley of short-range ballistic missiles.\nThe photos showed Kim, in a brown leather jacket, smiling with uniformed generals as he supervised the simultaneous launch of what appeared to be 18 projectiles.\nThe test involved “super-large multiple rocket sub-units”, according to a report by the official Korean Central News Agency.\nImages from the drill showed the 600mm multiple launch rocket system (MLRS), which North Korea has said can be fitted with nuclear warheads.\nUS State Department spokesman Matthew Miller condemned the launches as “reckless behavior which poses a grave threat to the Korean Peninsula”."}, {"id": "d11b3f7e-5229-4bfa-baf5-a99ca16c8a4c", "title": "Britain joins US in fresh strikes against Houthis in Yemen", "date": "2024-05-31 01:15", "url": "https://www.dailymail.co.uk/news/article-13478365/Britain-fresh-strikes-against-Houthis-Yemen.html", "message": "Britain has joined the US in fresh strikes against the Houthis in Yemen as more than a dozen targets have been blasted in the fifth wave of attacks.\nThe Ministry of Defence (MoD) confirmed strikes took place against the Iranian-backed terror group on Thursday as part of a response to assaults on cargo ships in the Red Sea and Gulf of Aden.\nBritish and American fighter jets as well as US ships hit a wide range of underground facilities, missile launchers, command and control sites, a Houthi vessel and other facilities, according to officials.\nThe US F/A-18 fighter jets launched from the USS Dwight D Eisenhower aircraft carrier in the Red Sea, officials said.\nPresident Joe Biden and other senior leaders have repeatedly warned that the US will not tolerate the Houthi attacks against commercial shipping."}, {"id": "462b36f4-8c09-4558-92c4-a18e433bc99e", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 02:45", "url": "https://www.yahoo.com/news/deadly-strikes-kharkiv-biden-lets-020755856.html", "message": "NATO downplays Kremlin threat over US weapons as 5 killed in KharkivUS officials say President Joe Biden has lifted restrictions on Ukraine using US weapons on targets in Russian territory, but only to defend the Kharkiv region (SERGEY BOBOK)NATO chief Jens Stoltenberg Friday downplayed Kremlin threats of escalation after President Joe Biden secretly lifted restrictions on Ukraine using US-supplied weapons against targets inside Russian territory, as five people were killed in an overnight strike on Kharkiv.\nUS officials said Thursday that Biden had lifted restrictions on Ukraine using weapons supplied by the United States against targets on Russian territory, but only to defend Kharkiv.\nAll services are working at the scene,\" said Oleg Synyegubov, Head of Kharkiv Region Military Administration.\nKharkiv Mayor Igor Terekhov said there had not been \"a single military person, not a single military object\" present.\nRussian strikes that hit a hardware superstore in Kharkiv last weekend killed 16 people."}, {"id": "30389b8d-e564-4c5a-86ff-484f154c7360", "title": "N Korea Kim supervises rocket launcher test : state media", "date": "2024-05-31 06:15", "url": "https://www.hurriyetdailynews.com/n-koreas-kim-supervises-rocket-launcher-test-state-media-194120", "message": "N Korea's Kim supervises rocket launcher test: state mediaPYONGYANGNorth Korean state media on Friday released images of leader Kim Jong Un supervising tests of a multiple rocket launcher system, a day after Seoul accused Pyongyang of firing a volley of short-range ballistic missiles.\nThe photos showed Kim, in a brown leather jacket, smiling with uniformed generals as he supervised the simultaneous launch of what appeared to be 18 projectiles.\nThe test involved \"super-large multiple rocket sub-units\", according to a report by the official Korean Central News Agency.\nImages from the drill showed the 600mm multiple launch rocket system (MLRS), which North Korea has said can be fitted with nuclear warheads.\nU.S. State Department spokesman Matthew Miller condemned the launches as \"reckless behavior which poses a grave threat to the Korean Peninsula\"."}, {"id": "b1778518-d73b-4ba0-9e65-f52e0d5356c9", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/deadly-strikes-on-kharkiv-as-biden-lets-ukraine-use-us-arms-inside-russia/article", "message": "A firefighter sprays water in a Kharkiv hardware store destroyed by a Russian strike earlier in the week.\nBut that calculus appears to have changed since Russian forces launched a fresh offensive in the Kharkiv region this month.\nKharkiv, Ukraine’s second-largest city, is located just across the border from Russia’s Belgorod and regularly comes under attack from Russian missiles.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nGerman Chancellor Olaf Scholz, however, remained less sure, saying Ukraine should act within the law — and Berlin had not supplied weapons that could hit Russia anyway."}, {"id": "527dccbf-f43a-498b-bb21-ee008cf15dc5", "title": "Russian missile attack on Kyiv damages power facility , grid , energy company says", "date": "2024-05-31 08:45", "url": "https://www.swissinfo.ch/eng/russian-missile-attack-on-kyiv-damages-power-facility%2c-grid%2c-energy-company-says/79185705", "message": "Russian missile attack on Kyiv damages power facility, grid, energy company saysreuters_tickers2 minutesKYIV (Reuters) -A Russian missile attack on Kyiv destroyed a power facility and damaged the power grid in Holosiivskyi district of the Ukrainian capital on Friday, the DTEK energy company said.\nUkraine’s Air Force said on the Telegram messaging app that Russia attacked Kyiv with an Iskander short-range ballistic missile and drones.\nRussia has been stepping up air strikes and ground attacks on Ukraine as it seeks to capture more territory in the country’s east and northeast, but the overnight air attack was not as intense as some previous onslaughts.\nUkraine’s largest private energy company said power had been restored to most of the buildings affected by the attack with back-up sources, leaving some 10 private residences and one business without power.\nThere were no injuries, according to preliminary information, but missile debris fell down and damaged the facility and the grid."}, {"id": "df1b1285-00bd-4e36-93a8-833db5791527", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 03:45", "url": "https://www.hurriyetdailynews.com/deadly-strikes-on-kharkiv-as-biden-lets-ukraine-use-us-arms-inside-russia-194118", "message": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside RussiaKIEVRussian strikes killed three people in the Ukrainian city of Kharkiv, the regional governor said early Friday, hours after the United States authorised Kiev to use American weapons to hit targets inside Russia in defense of the embattled region.\nBut that calculus appears to have changed since Russian forces launched a fresh offensive in the Kharkiv region this month.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nAhead of the NATO meeting, alliance chief Jens Stoltenberg had also said repeatedly that it was time for members to reconsider the limits on strikes inside Russia.\nGerman Chancellor Olaf Scholz, however, remained less sure, saying Ukraine should act within the law — and Berlin had not supplied weapons that could hit Russia anyway."}, {"id": "fac14a7b-68a5-4883-a291-f6f4f353dad7", "title": "Slovak prime minister who was shot in assassination attempt is released from the hospital", "date": "2024-05-31 09:30", "url": "https://abcnews.go.com/International/wireStory/slovak-prime-minister-shot-assassination-attempt-released-hospital-110705446", "message": "Slovakia’s populist prime minister, Robert Fico, has been released from a hospital where he was treated after an assassination attemptSlovak prime minister who was shot in an assassination attempt is released from the hospitalBRATISLAVA, Slovakia -- Slovakia’s populist prime minister, Robert Fico, has been released from a hospital where he was treated after an assassination attempt.\nMiriam Lapunikova, the director of the hospital in the central city of Banska Bystrica, said on Friday that Fico was transported to his home, where he continues to recover from the attack.\nFico lives in the capital, Bratislava.\nThe country’s Specialized Criminal Court in the town of Pezinok ordered the suspect, who is charged with attempted murder, to remain behind bars.\nProsecutors told police not to publicly identify the suspect or release details about the case."}, {"id": "05175eb6-b0b7-4873-9bfb-cddf5b82ed5f", "title": "US and Britain strike Houthi rebel targets in Yemen after surge in shipping attacks", "date": "2024-05-31 04:45", "url": "https://isp.netscape.com/news/world/story/0001/20240531/9f13a9739a139abfecb6fdc499280a89", "message": "US and Britain strike Houthi rebel targets in Yemen after surge in shipping attacksWASHINGTON (AP) — The U.S. and Britain struck 13 Houthi targets in several locations in Yemen on Thursday in response to a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden over the Israel-Hamas war, three U.S. officials said.\nThe U.S. F/A-18 fighter jets launched from the USS Dwight D. Eisenhower aircraft carrier in the Red Sea, officials said.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nPresident Joe Biden and other senior leaders have repeatedly warned that the U.S. won’t tolerate the Houthi attacks against commercial shipping."}, {"id": "86840a97-5f5e-42da-ba21-38bf44079d2f", "title": "Slovak PM Robert Fico released from hospital after assassination attempt", "date": "2024-05-31 09:30", "url": "https://www.breakingnews.ie/world/slovak-pm-robert-fico-released-from-hospital-after-assassination-attempt-1632286.html", "message": "Slovakia’s populist prime minister Robert Fico has been released from hospital where he was treated after an assassination attempt.\nMiriam Lapunikova, the director of the clinic in the central city of Banska Bystrica, said on Friday that Mr Fico was taken to his home, where he continues to recover from the attack.\nAdvertisementMs Lapunikova thanked Mr Fico in a statement for being “a disciplined patient”.\nMr Fico was shot in the stomach as he greeted supporters on May 15 in the town of Handlova, about 85 miles north east of the capital, Bratislava.\nMr Fico’s government has made efforts to overhaul public broadcasting — a move critics said would give the government full control of public television and radio."}, {"id": "a5d794cd-d48a-4254-8afc-3a79ae46c811", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 06:15", "url": "https://www.bssnews.net/news-flash/192257", "message": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside RussiaKYIV, Ukraine, May 31, 2024 (BSS/AFP) - Russian strikes killed three people in the Ukrainian city of Kharkiv, the regional governor said early Friday, hours after the United States authorised Kyiv to use American weapons to hit targets inside Russia in defence of the embattled region.\nBut that calculus appears to have changed since Russian forces launched a fresh offensive in the Kharkiv region this month.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nAhead of the NATO meeting, alliance chief Jens Stoltenberg had also said repeatedly that it was time for members to reconsider the limits on strikes inside Russia.\nGerman Chancellor Olaf Scholz, however, remained less sure, saying Ukraine should act within the law -- and Berlin had not supplied weapons that could hit Russia anyway."}, {"id": "59190b53-b69f-4976-b236-d550abef965a", "title": "Palestine - Israel war - Live Event Reporting by Dunya News", "date": "2024-05-31 07:45", "url": "https://dunyanews.tv/en/Event-Reporting/166", "message": "Fri, 31 May 2024 13:29:43 PKTIsrael ‘demolishing’ homes, public facilities in eastern Rafah neighbourhoods The Israeli military has continued to bomb Rafah and push deeper into the western part of the city.\nAs it stated, the Israeli military has full control over the Philadelphi Corridor and is now systematically demolishing homes in the eastern part of Rafah city.\nIn its operations in the north, the Israeli military said it had “dismantled hundreds of metres” of tunnels and killed more Palestinian fighters using tank fire.\nThe Israeli Air Force also hit military infrastructure and fighting positions in central Gaza, the military said, killing several people.\nThere are no universities left in Gaza because Israel has bombed every single one,” Berkinsky told The Associated Press news agency."}, {"id": "c09e0d1b-611a-4b3d-b142-25507c36647e", "title": "WORLD BRIEFING : May 31 , 2024", "date": "2024-05-31 07:45", "url": "https://www.kyivpost.com/post/33541", "message": "A Manhattan jury found Donald Trump guilty on all 34 felony counts of falsifying business records in his New York hush money criminal trial.\nA felony conviction of a former president or party frontrunner is unprecedented, but Trump can still run for office.\nThe former president called the jury’s decision a “disgrace” and said the “real verdict” will come during the presidential election on November 5.\nPresident Joe Biden said on social media his 2024 rival can only be defeated at the ballot box.\nThe move comes as Ukrainian officials have stepped up calls on the U.S. administration to allow its forces to defend itself against attacks originating from Russian territory."}, {"id": "344a5396-8c8a-441d-a666-ae7538083e13", "title": "Ukraine war live updates : Ukraine air strike sets Russian oil depot ablaze ; China not expected to attend Swiss peace talks", "date": "2024-05-31 08:15", "url": "https://www.nbcdfw.com/news/business/money-report/ukraine-war-live-updates-ukraine-air-strike-sets-russian-oil-depot-ablaze-china-not-expected-to-attend-swiss-peace-talks/3555714/", "message": "Russia's Dmitry Medvedev said on Friday that the Kremlin isn't bluffing over its threats to use tactical nuclear weapons against Ukraine.\nHis comments come shortly after reports said U.S. President Joe Biden had quietly given permission to Ukraine to allow its forces use U.S. weapons inside Russia.\nThe decision only applies to counter-fire purposes in the area around Ukraine's northeastern region of Kharkiv.\nMedvedev, who currently serves as deputy chairman of Russia's influential Security Council, was president of Russia between 2008 and 2012.\n— ReutersRead CNBC’s previous live coverage here:Italy says no to Ukraine using Western weapons to strike military targets inside Russia"}, {"id": "b51cab24-d90e-4055-942d-e23e53174656", "title": "  Somebody has to die : Man accused of stabbing homeless man at Nashville bus stop", "date": "2024-05-31 01:00", "url": "https://www.wsmv.com/2024/05/30/somebody-has-die-man-accused-stabbing-homeless-man-nashville-bus-stop/", "message": "NASHVILLE, Tenn. (WSMV) - Metro Nashville police revealed frightening new details about the attack of a homeless man at a WeGo bus stop Thursday morning.\nWhen witnesses intervened to help the homeless man, Boswell allegedly said, “This guy needs to die,” and “Somebody has to die, I’m gonna kill you!”Previous Coverage: Man found stabbed at WeGo bus stop in EdgehillThe attack happened at a bus stop at the intersection of Edgehill Ave. and 12th Ave. S just after 5 a.m.\nMNPD has already investigated two separate shootings at the downtown bus terminal and an attack on a bus driver in May.\nThere are 5.4 million people who visit WeGo Central each year, and nearly 8 million riders annually.\nThere is security at WeGo Central 24/7, and they have 283 cameras in use to keep the facility safe."}, {"id": "5bab3b07-4a6e-4bfa-9d89-0b8ff931f9c5", "title": "Ukraine war live updates : Ukraine air strike sets Russian oil depot ablaze ; China not expected to attend Swiss peace talks", "date": "2024-05-31 08:15", "url": "https://www.nbcsandiego.com/news/business/money-report/ukraine-war-live-updates-ukraine-air-strike-sets-russian-oil-depot-ablaze-china-not-expected-to-attend-swiss-peace-talks/3528838/", "message": "Russia's Dmitry Medvedev said on Friday that the Kremlin isn't bluffing over its threats to use tactical nuclear weapons against Ukraine.\nHis comments come shortly after reports said U.S. President Joe Biden had quietly given permission to Ukraine to allow its forces use U.S. weapons inside Russia.\nThe decision only applies to counter-fire purposes in the area around Ukraine's northeastern region of Kharkiv.\nMedvedev, who currently serves as deputy chairman of Russia's influential Security Council, was president of Russia between 2008 and 2012.\n— ReutersRead CNBC’s previous live coverage here:Italy says no to Ukraine using Western weapons to strike military targets inside Russia"}, {"id": "3796ca6b-b197-47e3-b99b-772e28069358", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 03:30", "url": "https://www.yahoo.com/news/us-says-russia-using-n-025352208.html", "message": "US says Russia using N. Korea missiles in UkraineThe report used open-source imagery to confirm that debris found in Ukraine's Kharkiv region (pictured) in January this year is from a short-range ballistic missile made in North Korea (SERGEY BOBOK)Russia is using North Korean ballistic missiles in Ukraine, a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\n\"North Korean missile debris was found throughout Ukraine,\" it added.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "b889dacd-609b-4af3-8fce-e73aacddb1a1", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/us-says-russia-using-n-korea-missiles-in-ukraine-2/article", "message": "“Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,” the DIA said in a statement released with the report on Wednesday.\n“North Korean missile debris was found throughout Ukraine,” it added.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was “being prepared”.\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un’s father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "af181e76-4338-432f-be12-114d4700b223", "title": "Biden allows Ukraine to hit some targets in Russia with US weapons", "date": "2024-05-31 05:15", "url": "https://www.the-star.co.ke/news/world/2024-05-31-biden-allows-ukraine-to-hit-some-targets-in-russia-with-us-weapons/", "message": "US President Joe Biden has given Ukraine permission to use American-supplied weapons to strike targets in Russia, but only near the Kharkiv region, US officials say.\nOne told BBC News his team had been directed to ensure Ukraine was able to use US weapons for \"counter-fire purposes\" to \"hit back at Russian forces hitting them or preparing to hit them\".\nRussian forces have made gains in the Kharkiv region in recent weeks after a surprise offensive in the area, close to the border with Russia.\nThe UK earlier signalled that it was open to an easing of restrictions on how Ukraine could use weapons supplied by the West.\nThe Ukrainian official accused Russian forces of targeting \"exclusively civilian infrastructure\" and using a \"double-strike tactic\", hitting the site for a second time after paramedics and rescue workers had arrived."}, {"id": "da3ce627-e71c-46d4-ac6a-7b49ab15214f", "title": "BAP president Khalid Magsi survives attack", "date": "2024-05-31 05:30", "url": "https://tribune.com.pk/story/2469100/bap-president-khalid-magsi-survives-attack", "message": "Levies sources say armed assailants opened fire on BAP president Khalid Hussain Magsi's convoy, but security personnel and guards responded swiftly, forcing the attackers to flee.\nPHOTO: FILEKhalid Hussain Magsi, President of the Balochistan Awami Party (BAP) and a member of the National Assembly, narrowly escaped an assassination attempt in the Notal area of Nasirabad district, according to levies officials.\nArmed assailants opened fire on Magsi's convoy, but security personnel and guards responded swiftly, forcing the attackers to flee.\nIn November, BAP elected Magsi as its president, replacing Mir Abdul Qudoos Bizenjo.\nSenator Nasibullah Bazai, senior vice president of the party, administered the oath to the newly elected president."}, {"id": "a528c070-68ca-441d-8d53-58107aba99df", "title": "Fires break out in Kyiv after Ukraine downs Russian cruise missile", "date": "2024-05-31 08:15", "url": "https://www.yahoo.com/news/fires-break-kyiv-ukraine-downs-071000425.html", "message": "Fires break out in Kyiv after Ukraine downs Russian cruise missile - photosAftermath of the attack on Kyiv on May 31While fires broke out in Kyiv, no casualties were reported after Russia fired at least one cruise missile at the capital overnight on May 31, the Kyiv City Military Administration (KMVA) reported on Telegram.\nКМВА/TelegramRead also: Seven injured in Russian missile attack on KharkivA warehouse caught fire in Kyiv's Holosiivskyi district, near a private home with a service station and car wash, the State Emergency Service reported.\nДСНС КиєваКМВА/TelegramRead also: Two people hospitalized and in shock in Brovary, Kyiv Oblast after Russia's latest mass missile attackKyiv's air defense managed to eliminate all cruise missiles fired by Russia, with debris igniting the fires.\nThe enemy launched an Iskander-K cruise missile at the capital from Russia's Kursk Oblast, Ukraine's Air Force said.\nRead the original article on The New Voice of Ukraine"}, {"id": "ad0e5da4-0713-4986-8036-2964c99a1798", "title": "Ukraine war latest : Russian ferry crossing , 4 patrol boats struck in Crimea , military says", "date": "2024-05-31 01:15", "url": "https://kyivindependent.com/ukraine-war-latest-11/", "message": "Russian troops also reportedly responded with chaotic fire from small arms and 30 mm cannons.\nThe Russian Defense Ministry claimed that Russian air defense downed eight long-range U.S.-supplied ATACMS (Army Tactical Missile System) missiles and eight drones overnight.\nUkraine hits Russian ferry crossing with ATACMS in Crimea, General Staff saysThe Ukrainian military struck the Russian Kerch ferry crossing in occupied Crimea overnight on May 30, the General Staff of Ukraine's Armed Forces reported.\nThe accumulation of ammunition supplies and degradation of Russian forces also reduced Russian offensive capabilities, Syrskyi wrote on Facebook.\nMoscow is forming another grouping of forces near Ukraine's northern border, President Volodymyr Zelensky said on May 26."}, {"id": "8d595425-acb3-48c3-bac7-1c82e1c52e4c", "title": "Russia S - 500 missile systems to usher in new era in air defense Defense TV - Military & Defense", "date": "2024-05-31 03:15", "url": "https://tass.com/defense/1796099", "message": "Russia’s S-500 Prometheus surface-to-air missile/anti-ballistic missile system will be a game changer for both Russia’s security and the global military landscape, protecting national airspace with unprecedented efficacy and reliability, according to Defense TV YouTube channel.\nThe channel’s authors emphasize the system’s increased range and its advanced missile and radar technologies.\nApart from that, the system is highly resistant to electronic interference, which ensures its reliability even under most complex scenarios on the battlefield.\n\"The secret sauce behind the S-500’s hypersonic killing abilities lies in its powerful radar and computer system,\" the channel says.\nThen Russian Defense Minister Sergey Shoigu said on April 23 that this year, the Russian air defense troops will receive the first S-500 air defense systems in two modifications: long-range surface-to-air missile systems and anti-ballistic missile defense complexes."}, {"id": "e9736f90-1495-4b57-9f70-b583ca34c487", "title": "US says Russia using N Korea missiles in Ukraine", "date": "2024-05-31 04:30", "url": "https://www.hurriyetdailynews.com/us-says-russia-using-n-korea-missiles-in-ukraine-194126", "message": "US says Russia using N Korea missiles in UkraineWASHINGTONRussia is using North Korean ballistic missiles in Ukraine, a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un's father and predecessor.\nNorth Korea is barred by U.N. sanctions from any tests using ballistic technology."}, {"id": "557eb4db-7e5a-4258-8f66-c9c0afb93e3d", "title": "Robots to fight alongside humans on frontline against Putin troops | World News", "date": "2024-05-31 06:00", "url": "https://metro.co.uk/2024/05/31/robots-fight-alongside-humans-frontline-putins-troops-20936700/", "message": "Mr Stupak hopes that the robots will give Ukraine another advantage, just like the navy and aerial drones have.\nZelensky’s charity UNITED24 launched a fundraiser for ground robots (Picture: UNITED24)‘In the beginning, their role was to assist medics to evacuate the wounded on the battlefield and collect the bodies of those killed.\nFour models of combat robots have been approved for use by Ukraine’s Ministry of Defence – the SHABLYA M2, LYUT, MOROZ and D-11.\nThe problem is that Ukraine is not able to produce that many of these combat robots.\nUkraine is racing to produce the army of robots as they can also evacuate the wounded from the frontline."}, {"id": "33a2c7ac-167a-40c1-81be-cab8abb8ae60", "title": "America Must Prevent China from Flipping the Kill Switch on Taiwan Democracy", "date": "2024-05-31 09:15", "url": "https://www.americanthinker.com/articles/2024/05/america_must_prevent_china_from_flipping_the_kill_switch_on_taiwan_s_democracy.html", "message": "In the speech, Lai urged China to end political and military intimidation, pledging to neither provoke nor yield to Beijing.\nAccordingly, China wages political warfare through propaganda and disinformation, winning over elites who command influence, political subversion, and economic actions.\nA robust fifth-column network has been established by China inside Taiwan’s national security apparatus and political system, according to the Global Taiwan Institute.\nHigh-ranking retired generals are invited to China and influenced to spread defeatist propaganda and erode confidence in the Taiwanese military.\nTaiwan, which makes more than 90% of the world’s microchips, counts on America to ensure that it does not have to flip the kill switches on those machines — and that China does not flip the kill switch on Taiwan’s democracy."}, {"id": "46d1fca5-127e-47a4-8e1b-43fed49ad472", "title": "Dynasty Warriors : Origins announced", "date": "2024-05-31 01:15", "url": "https://nichegamer.com/dynasty-warriors-origins-announced/", "message": "Publisher Koei Tecmo and developer Omega Force have announced Dynasty Warriors: Origins, what they’re teasing as a “new era of 1 vs. 1000” action.\nDynasty Warriors: Origins is in development for Windows PC (via Steam), Xbox Series X|S, and PlayStation 5.\n“For almost 30 years, the DYNASTY WARRIORS franchise has been built by delivering not only a sense of realism on the battlefield, but by the exhilarating action of 1 vs. 1,000 gameplay,” said Tomohiko Sho, DYNASTY WARRIORS: ORIGINS producer and Head of Omega Force, KOEI TECMO GAMES.\nCoordination with allied armies is key as players deploy battle tactics in real time while slicing through waves of soldiers in the most tension-filled fights in DYNASTY WARRIORS history!\nIn addition, for the first time in a DYNASTY WARRIORS title, the storyline will be told through the eyes of a “nameless hero”."}, {"id": "51fe0b55-f38c-46fe-b497-72715fb4b395", "title": "God of War Ragnarök is coming to PC", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/god-of-war-ragnarok-is-coming-to-pc/", "message": "Like thisGod of War Ragnarök will be coming to PC on September 19, 2024!\nSanta Monica Studio’s development partner for God of War (2018) on PC, Jetpack Interactive, is back to help deliver the PC version of God of War Ragnarök.\nSuper ultra-widescreen supportEnjoy the breathtaking beauty of the Nine Realms in panoramic widescreen with 21:9 ultra-widescreen and 32:9 super ultra-widescreen support!\nIncludes God of War Ragnarök: ValhallaAt launch, God of War Ragnarök PC will include all our post-launch updates including a robust New Game+ mode and the God of War Ragnarök: Valhalla DLC.\nGod of War Ragnarök – Digital Deluxe EditionThe God of War Ragnarök Digital Deluxe Edition of the game includes:Full God of War Ragnarök game for PCfor PC Kratos Darkdale Armor ********** Atreus Darkdale Attire (cosmetic) *****(cosmetic) ***** Darkdale Blades Handles for the Blades of Chaos*****for the Blades of Chaos***** Darkdale Axe Grip for the Leviathan Axe*****for the Leviathan Axe***** Official God of War Ragnarök Digital SoundtrackDark Horse Digital Mini Artbook*****Unlock in-game items via story progression."}, {"id": "b77f2ac8-b109-473f-b3f0-ec74cf7f6b8b", "title": "God of War Ragnarok coming to PC in September", "date": "2024-05-31 01:15", "url": "https://nichegamer.com/god-of-war-ragnarok-coming-to-pc-in-september/", "message": "Publisher Sony Interactive Entertainment and developer Sony Santa Monica have announced God of War Ragnarok is coming to PC this fall.\nGod of War Ragnarok is coming to Windows PC (via Steam and the Epic Games Store) on September 19th.\nThe sequel to the critically acclaimed God of War (2018), God of War Ragnarök picks up with Fimbulwinter well underway.\nMASTER THYSELF IN GOD OF WAR RAGNARÖK: VALHALLAAvailable right at launch with your purchase of God of War Ragnarök is access to the God of War Ragnarök: Valhalla DLC for no additional cost!\nPC FEATURESPartnering with Jetpack Interactive once again, God of War Ragnarök on PC will harness the power of the platform to deliver an exceptional experience."}, {"id": "526d4709-bbcb-4d49-81da-c1c35bd93b06", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 05:45", "url": "https://www.yahoo.com/news/women-were-barred-combat-during-050411077.html", "message": "D-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "8d1a7a8f-d8fa-441f-b036-6054286778b2", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 05:30", "url": "https://abcnews.go.com/International/wireStory/women-barred-combat-wwii-helped-ensure-allies-day-110703661", "message": "For British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nThe pitch on recruiting posters was simple: By joining the military and taking over support roles, women could free men for front-line service.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "d77c5c56-b05d-4fa5-ad69-9e7ae35750c4", "title": "Women Were Barred from Combat During WWII . But They Helped Ensure the Allie D - Day Success", "date": "2024-05-31 07:15", "url": "https://www.newsmax.com/world/globaltalk/dday-normandy-80th-anniversary-women/2024/05/31/id/1166901/", "message": "For British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\n“People forget they were 17, 18 doing these jobs,\" said Dick Goodwin, the honorary secretary of the Taxi Charity for Military Veterans, which helps veterans travel to Normandy each year.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "0523d224-de86-4809-96ee-cdfcaa840043", "title": "Barred from combat , women working as codebreakers , cartographers and coxswains helped D - Day succeed", "date": "2024-05-31 09:30", "url": "https://www.clickondetroit.com/news/world/2024/05/31/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "D-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "f0d99b9d-235f-401d-ac34-ca34da95399e", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 06:00", "url": "https://www.local10.com/news/world/2024/05/31/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "D-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "5be299f7-eeb4-4e53-8d87-0b5931f6724a", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success – Metro US", "date": "2024-05-31 05:45", "url": "https://www.metro.us/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "D-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "e19fbe17-5fd2-4322-a47c-fd53ee19f04a", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 05:45", "url": "https://www.kob.com/news/us-and-world-news/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "For British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nD-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "4230e9e0-c5a2-4944-8e40-a4250a4c1981", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 07:30", "url": "https://www.clickorlando.com/news/world/2024/05/31/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "D-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "3947d110-abaf-4758-87cd-745c4f4fca0d", "title": "God of War Ragnarok Launches on PC in September with DLSS 3 . 7 and FSR 3 . 1 , PSN Required", "date": "2024-05-31 01:15", "url": "https://wccftech.com/god-of-war-ragnarok-launches-on-pc-in-september-with-dlss-3-7-and-fsr-3-1/", "message": "Pre-orders for the PC version of God of War Ragnarok are now open.\nUpscaling technology - Full integration with NVIDIA RTX Deep Learning Super Sampling (DLSS), AMD FidelityFX Super Resolution (FSR), and Intel XeSS (Xe Super Sampling) will allow you to reach higher graphical settings and output resolutions.\n- Full integration with NVIDIA RTX Deep Learning Super Sampling (DLSS), AMD FidelityFX Super Resolution (FSR), and Intel XeSS (Xe Super Sampling) will allow you to reach higher graphical settings and output resolutions.\nSuper ultra-widescreen support - Enjoy the breathtaking beauty of the Nine Realms in panoramic widescreen with 21:9 ultra-widescreen and 32:9 super ultra-widescreen support!\nIncludes God of War Ragnarök: Valhalla At launch - God of War Ragnarök PC will include all our post-launch updates including a robust New Game+ mode and the God of War Ragnarök: Valhalla DLC."}, {"id": "80fc2654-090d-4bab-bc79-53c752746018", "title": "Everything revealed in the May 2024 State of Play", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/everything-revealed-in-the-may-2024-state-of-play/", "message": "Play VideoConcordToday’s State of Play revealed the first look at the gameplay, universe, and characters of Concord, as well as how and when you’ll be able to get your hands on the 5v5 character-driven, first-person multiplayer shooter.\nPlay VideoGod of War RagnarökGod of War Ragnarök will be coming to PC on September 19, 2024!\nIn a dedicated PS Blog post, Capcom introduces some of the monsters and characters, as well as more info on the hunter’s new mount.\nThe creators behind this psychological survival horror remake delve deeper into the new gameplay and narrative details on PS Blog.\nPlay VideoInfinity NikkiInfinity Nikki is an open-world dress-up adventure game coming to PS5, with a beta test due later this year."}, {"id": "e0b1ee11-34ca-4745-a47b-ef32e00e6503", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success – Winnipeg Free Press", "date": "2024-05-31 05:30", "url": "https://www.winnipegfreepress.com/world/2024/05/31/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success", "message": "For British women who came of age during World War II, the answer to that question is often: quite a lot.\nD-Day, took place on June 6, 1944, the invasion of the beaches at Normandy in France by Alied forces during World War II.\n(AP Photo/Kirsty Wigglesworth)But behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nAltogether, some 7 million British women served their country in some capacity during World War II."}, {"id": "576fe765-6b1e-41df-8199-cdb2f130bc74", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 09:15", "url": "https://lasvegassun.com/news/2024/may/30/women-were-barred-from-combat-during-wwii-but-they/", "message": "But they helped ensure the Allies’ D-Day successKirsty Wigglesworth / APLONDON — What did you do in the war, Granny?\nFor British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, cartographers, ship plotters and radar operators.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "d47c5f57-43d3-4790-ac19-8296710a5f30", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 06:15", "url": "https://www.yakimaherald.com/news/nation_and_world/world/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day/article_fba70358-f324-54f5-9226-f28af92f66c7.html", "message": "The history of the D-Day invasion that changed the course of World War II is often told through the stories of the men who fought and died when the Allies stormed the beaches of Normandy, France, on June 6, 1944"}, {"id": "f0a2edb4-d44e-4f7d-8f61-3a44c97a45da", "title": "World War II veterans will travel from Dallas to Normandy", "date": "2024-05-31 08:15", "url": "https://www.dallasnews.com/opinion/commentary/2024/05/31/world-war-ii-veterans-will-travel-from-dallas-to-normandy/", "message": "AdvertisementFollowing a 1940s-themed send-off — to be attended by Mary Eisenhower, granddaughter of Gen. Dwight D. Eisenhower — some 60 World War II veterans will depart for France for the 80th anniversary of the D-Day invasion.\nA pilot in the Army Air Corps, Kunkle flew his first combat missions over Normandy and dozens over Germany.\nHe was shot down Sept. 16, 1944, near Aachen, the first German city to fall to the Allies.\nHe gathered intelligence in postwar Germany, some of which would allow for the prosecution of high-ranking Nazis for war crimes.\nThat helped usher the European war to a close, and Shipe was soon put on a freighter to the Pacific."}, {"id": "362de945-eb9c-4c86-a85e-91d4583ea27a", "title": "Worthplaying |  Dynasty Warriors : Origin Announced For PS5 , Xbox Series X|S And PC In 2025", "date": "2024-05-31 01:30", "url": "https://worthplaying.com/article/2024/5/30/news/142183-dynasty-warriors-origins-announced-for-ps5-xbox-series-xs-and-pc-in-2025-screens-trailer/", "message": "Throughout the game, players will be forced to act fast as the unprecedented size and scale of enemy armies overwhelm the battlefield.\nCoordination with allied armies is key as players deploy battle tactics in real time while slicing through waves of soldiers in the most tension-filled fights in Dynasty Warriors history!\nIn addition, for the first time in a Dynasty Warriors title, the storyline will be told through the eyes of a “nameless hero”.\n“For almost 30 years, the Dynasty Warriors franchise has been built by delivering not only a sense of realism on the battlefield, but by the exhilarating action of 1 vs. 1,000 gameplay,” said Tomohiko Sho, Dynasty Warriors: Origins producer and Head of Omega Force, KOEI TECMO GAMES.\n“With Dynasty Warriors: Origins, we return to these roots and deliver the non-stop action to not only our most loyal fans of the series, but to all game fans worldwide, delivering the most thrilling warfare we’ve ever been able to create!”Dynasty Warriors: Origins is coming to PS5, Xbox Series X|S and PC (Steam) in 2025."}, {"id": "9f538b81-5e16-482b-96c7-c16a07a255a3", "title": "Dynasty Warriors : Origins revealed for PS5 , out 2025", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/dynasty-warriors-origins-revealed-for-ps5-out-2025/", "message": "Like thisWhen the original Dynasty Warriors debuted back in 1997, little did we know that 27 years later Koei Tecmo would be introducing an electrifying new entry into the series, ready to deliver Dynasty Warriors to the next generation of action gamers.\nDynasty Warriors: Origins unleashes the largest armies ever seen in the series while also introducing a new hero to the exhilarating 1 vs. 1,000 action that made the franchise famous.\nSince Dynasty Warriors 2 (the original Dynasty Warriors was a fighting game!\nAn original protagonist appearsBut that’s not all, as for the first time in Dynasty Warriors franchise history, we will depict the chaos of the Three Kingdoms from the eyes of a ‘nameless hero’.\nStay tuned for more information in the coming months as we reveal more about our new nameless hero and his fight for the Three Kingdoms before Dynasty Warriors: Origins is released in 2025."}, {"id": "241734d7-cc41-460a-9b43-dcee73c9b041", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 07:30", "url": "https://www.smdailyjournal.com/news/world/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day/article_77488d0b-6d4d-5eb7-b17b-1787ea7b0ed7.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "f42f8130-c331-4f8f-b9b9-3a61837cbb69", "title": "Call of Duty : Modern Warfare III Fallout Crossover Leaks", "date": "2024-05-31 01:15", "url": "https://www.playstationlifestyle.net/2024/05/30/call-of-duty-modern-warfare-iii-fallout-crossover-leaks/", "message": "While eyes turn to the upcoming Black Ops 6, Activision is still releasing content for Call of Duty: Modern Warfare III.\nCall of Duty: Modern Warfare III and Warzone getting Fallout collabThe leak includes a promotional image of the new Fallout-inspired Vault Dweller Tracer Pack and a short video showing the content.\nHowever, this may be the “Top Secret” collab teased in the official Modern Warfare III/Warzone Season 4 roadmap revealed last week.\nThe upcoming Modern Warfare III Vault Dweller Tracer Pack includes “Vault 141” jumpsuits for operators Price, Ghost, Soap, and Gaz.\nModern Warfare III and Warzone players can also get several loading screens and calling cards based on Fallout 4."}, {"id": "e58f3bea-0b26-4247-8eee-0408dc1dab0f", "title": "Long : What if we had failed on June 6 , 1944 ? ", "date": "2024-05-31 08:45", "url": "https://roanoke.com/opinion/column/long-what-if-we-had-failed-on-june-6-1944/article_f8348aa8-1e09-11ef-b941-63fdb2a75889.html", "message": "“Our landings in the Cherbourg-Havre area have failed to gain a satisfactory foothold and I have withdrawn the troops.\nThe mightiest army ever assembled was now impotent, defeated by a weaker foe and a narrow ribbon of saltwater.\nThough respected for what he had achieved in the Mediterranean before the Normandy debacle, his historical reputation was sealed.\nHaving long pushed for the “second front,” he accused his allies of timidity and betrayal.\nBecause good had lost in Normandy in 1944."}, {"id": "41eb7dc2-f4fe-4e3d-88dd-76ccc0514986", "title": "Germany Announces New €500 Million Weapons Package for Ukraine", "date": "2024-05-31 02:30", "url": "https://www.bnnbloomberg.ca/germany-announces-new-500-million-weapons-package-for-ukraine-1.2079327", "message": "(Bloomberg) -- Germany is providing as much as €500 million ($542 million) in additional military aid to Ukraine, including air-defense missiles, Defense Minister Boris Pistorius said.\n“We will continue to support you in this defensive struggle,” Pistorius said Thursday during a visit to Odesa, Ukraine, to meet Ukrainian Defense Minister Rustem Umerov, German broadcaster ARD reported.\nSome of the weapons are about to be delivered to Ukraine, Pistorius said.\nWhile Ukraine’s allies are stepping up efforts to send more air-defense assets, the US and Germany have been cautious about delivering weaponry that can hit targets inside Russia.\nPistorius said this month he wants Germany to deliver another €3.8 billion in military aid to Ukraine this year."}, {"id": "59476411-9b2d-4fb2-83d8-fd893f62c23b", "title": "Russia jamming technology reducing accuracy of U . S . weapons in Ukraine to just 10 % – NaturalNews . com", "date": "2024-05-31 07:00", "url": "https://www.naturalnews.com/2024-05-30-russia-jamming-tech-reducing-us-weapons-accuracy-ukraine.html", "message": "Russia’s jamming technology reducing accuracy of U.S. weapons in Ukraine to just 10%Many high-tech American weapons systems in Ukraine are being rendered ineffective due to Russian military jamming technology.\nRussian electronic warfare systems and air defenses pose significant threats to Ukrainian pilots.\n(Related: Russian electronic warfare systems are successfully disabling “sophisticated” US-supplied Ukrainian weapons.)\nThe conflict is providing valuable real-world data on how U.S. precision weapons perform under modern threats like electronic warfare.\nWatch this video of Alex Christoforou commenting on Russia's GPS jamming technology."}, {"id": "efa5791c-b200-4c7b-b1ad-6e0052dfbb97", "title": "Lights for Peace : Flag honors New Bedford Edward A . Baker , Merchant Marine killed in WWII", "date": "2024-05-31 09:30", "url": "https://www.yahoo.com/news/lights-peace-flag-honors-bedfords-080510606.html", "message": "Merchant Marines and was killed on April 20, 1944, aboard the USS Hamilton while serving in World War II.\nHe served as the chief engineer aboard the USS Hamilton, which was named after Paul Hamilton, the third U.S. Secretary of the Navy.\nThe May Lights for Peace flag at the Fort Taber - Fort Rodman Military Museum flew in honor of Edward A. Baker of New Bedford.\nThis reportedly led one of the attackers to follow the tracers to the USS Paul Hamilton, which became the first target.\nHe received the following medals for his heroic service: Merchant Marine Mariner’s Medal, Merchant Marine Combat Bar, Merchant Marine Atlantic War Zone Medal, Merchant Marine Mediterranean War Zone Medal and the Merchant Marine WWII Victory Medal."}, {"id": "e42c42d4-4337-44f8-b54e-a2c5808dfc8f", "title": "Innovation will keep Nigeria ahead of security threats – Tinubu", "date": "2024-05-31 00:30", "url": "https://punchng.com/innovation-will-keep-nigeria-ahead-of-security-threats-tinubu/", "message": "President Bola Tinubu has expressed optimism that Nigeria will prevail against adversaries undermining its peace and security.\nTinubu, represented by the President of the Senate, Godswill Akpabio, gave the assurance while inaugurating the headquarters of the Defence Intelligence Agency, in Abuja, on Thursday.\nHe said his confidence was anchored on the unwavering commitment of members of the Armed Forces of Nigeria and the intelligence agencies, including the Department of State Security, the Nigerian Intelligence Agency, and the Defence Intelligence Agency.\n“The entire nation is behind you and appreciates your sacrifices.”According to him, Nigeria is bedevilled by a myriad of security challenges across the six geopolitical zones of the entire nation.\nIn our bid to combat physical threats, we deploy the armed forces in almost all the states to assist the civil authorities."}, {"id": "55d7a7d8-00b4-4c6e-bc46-005ec668d923", "title": "God of War Ragnarok is Coming to PC on September 19", "date": "2024-05-31 01:30", "url": "https://gamingbolt.com/god-of-war-ragnarok-is-coming-to-pc-on-september-19", "message": "Recent leaks claimed that after Ghost of Tsushima, God of War Ragnarok would be the next big single-player first-party PlayStation game to make its way over to PC, and as expected, that announcement was made officially at Sony’s recent State of Play presentation.\nGod of War Ragnarok is coming to PC this September, along with its free roguelike DLC Valhalla.\nCheck out the PC version’s announcement trailer below.\nIn our review of God of War Ragnarok upon its 2022 release, we awarded it a score of 10/10, saying, “God of War Ragnarok surpasses its predecessor in every way.\nGod of War Ragnarok is currently available on PS5 and PS4."}, {"id": "221c0841-b652-43bd-baeb-4cb78d6d4a0a", "title": "Russia opens a new front : A visual guide to the Ukraine war", "date": "2024-05-31 04:45", "url": "https://us.cnn.com/2024/05/31/europe/russia-ukraine-war-offensive-dg-intl/", "message": "It serves as an example of how Russia has been exploiting Ukraine’s main vulnerabilities: insufficient manpower, artillery shortages, sparse air defenses and inadequate defensive fortifications.\nIn the north, Moscow’s troops are aiming to bring its troops within tube artillery range of Kharkiv city.\nThe nearby Russian city of Belgorod, for instance, has increasingly come under Ukrainian attack in recent months.\nSince then, Russian troops have made steady progress westwards in the direction of Pokrovsk, which serves as a vital military hub in Ukraine’s war effort.\nIt was first captured by Russian forces in early March 2022 and Moscow again claimed control over it earlier this month, something denied by Ukraine."}, {"id": "516a9a8a-1063-4626-ba16-3b0f2da1ba5a", "title": "Disney Bob Iger may be celebrating today after Nelson Peltz latest move", "date": "2024-05-31 09:15", "url": "https://www.businessinsider.in/entertainment/news/disneys-bob-iger-may-be-celebrating-today-after-nelson-peltzs-latest-move/articleshow/110572534.cms", "message": "Bob Iger shut down the idea that ABC was for sale at the DealBook Summit on Wednesday.\nPeltz fought a pricey proxy battle with Disney CEO Bob Iger over its board but lost.\nBillionaire hedge fund founder Nelson Peltz has sold his stake in The Walt Disney Company after losing a pricey proxy battle with CEO Bob Iger.\nNelson Peltz, CEO of Trian Fund Management.\nPeltz's proxy battle may have been the most expensive in history, with various parties spending an estimated $70 million on the campaign."}, {"id": "ce50ecfd-f526-4faa-af70-321a5c44aea4", "title": "The Blackpool Combat Club  Book Club  Is On Hiatus , MLW To Honor Gary Juster", "date": "2024-05-31 03:45", "url": "https://www.ewrestlingnews.com/news/aew/the-blackpool-combat-clubs-book-club-is-on-hiatus-mlw-to-honor-gary-juster", "message": "The Blackpool Combat Club’s ‘book club’ has been on a bit of a hiatus in recent months, and Bryan Danielson recently spoke with Sports Illustrated to comment on the stable and its private book club.\nThe last six weeks, we haven’t been as deep into it as we were.”He continued, “Mox just recommended a book to me.\nIt’s something like Chosen Suffering, and that’s very apropos for both me and Mox and the BCC–choosing to suffer is what we enjoy.”Major League Wrestling (MLW) will honor Gary Juster at Battle Riot VI.\nLegendary wrestling promoter and executive Gary Juster will be honored this Saturday in Atlanta at the building he helped make famous: Center Stage.\nA key player in the success of WCW, Ring of Honor and MLW, Major League Wrestling is delighted to celebrate the extraordinary career of Mr. Juster as he is presented with a lifetime achievement award."}, {"id": "fd2130c3-ab3e-450f-8e0e-ec3e669d255d", "title": "Marvel Rivals is coming to PS5 : Venom and Adam Warlock revealed , Closed Beta test announced for July", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/marvel-rivals-is-coming-to-ps5-venom-and-adam-warlock-revealed-closed-beta-test-announced-for-july/", "message": "It’s Stephen Wu here, Producer of Marvel Rivals.\nWe know the players have been eagerly awaiting this news since we first unveiled Marvel Rivals back in March!\nI have to admit, developing Marvel Rivals has been a thrilling ride.\nSuper Powers Rather Than AbilitiesWe want every fan of Marvel Rivals to dive into a Super Hero world unlike ever before.\nMarvel Rivals lets you tear down walls to open shortcuts across the map or destroy a building’s foundation to collapse it on your foes."}, {"id": "789e9694-36a4-482a-a700-19d2b35e6f18", "title": "Russia opens a new front : Mapping three key battles in the Ukrainian war", "date": "2024-05-31 09:30", "url": "https://krdo.com/news/2024/05/30/russia-opens-a-new-front-mapping-three-key-battles-in-the-ukrainian-war/", "message": "In the north, Moscow’s troops are aiming to bring its troops within tube artillery range of Kharkiv city.\nThe nearby Russian city of Belgorod, for instance, has increasingly come under Ukrainian attack in recent months.\nSince then, Russian troops have made steady progress westwards in the direction of Pokrovsk, which serves as a vital military hub in Ukraine’s war effort.\nNotes: “Assessed” means the Institute for the Study of War has received reliable and independently verifiable information to demonstrate Russian control or advances in those areas.\nRussian advances are areas where Russian forces have operated in or launched attacks, but they do not control them."}, {"id": "d2475184-4f61-4e6f-ac8c-a302ec2ab6b7", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 03:45", "url": "https://www.theglobeandmail.com/world/article-north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hard line policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafletting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications."}, {"id": "928a708b-80d1-4ff4-83da-1fe268cb4923", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 01:30", "url": "https://www.startribune.com/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/600369722/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications."}, {"id": "0e02c0a1-c8cb-4eb0-873f-3037006610c9", "title": "Where Winds Meet brings superhuman , open - world martial arts adventure to PS5", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/where-winds-meet-brings-superhuman-open-world-martial-arts-adventure-to-ps5/", "message": "Martial arts skills can also be acquired from observing and mimicking the behavior of animals.\nWhere Winds Meet, is set in the period in Chinese history known as the Five Dynasties and Ten Kingdoms.\nWhere Winds Meet has an oriental martial arts theme, and we attach great importance to the presentation of martial arts (Wuxia) elements in the game.\nWe hope to introduce players around the world to the unique charm of wuxia martial arts combat.\nPlease stay tuned for more news about Where Winds Meet for PlayStation 5."}, {"id": "3e3d89ee-a0bd-41b2-8fa4-63549344427a", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 01:00", "url": "https://www.news-gazette.com/news/nation-world/north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres-what-it-means/article_54d03c24-77a6-5a92-8f4a-f8cce52e87d7.html", "message": "Champaign, IL (61820)TodayA mix of clouds and sun.\nWinds SE at 10 to 20 mph..TonightCloudy skies early, then off and on rain showers overnight.\nLow around 60F.\nWinds SE at 10 to 15 mph.\nChance of rain 60%."}, {"id": "80214065-3228-448e-a45a-4a31b968349a", "title": "WWII vet from Northern California flies to France to commemorate 80th anniversary of D - Day", "date": "2024-05-31 00:00", "url": "https://www.cbsnews.com/sacramento/news/dan-dougherty-wwii-veteran-d-day-80th-anniversary-france-flight/", "message": "WWII vet from Fairfield heads to France to commemorate D-DayWWII vet from Fairfield heads to France to commemorate D-DayWWII vet from Fairfield heads to France to commemorate D-DaySACRAMENTO – A Northern California World War II veteran is headed back to France to visit Normandy for the first time since the war.\nTo honor that anniversary, a number of World War II vets are being flown out to France next week.\nDougherty arrived in France several months after D-Day, but he was later part of the unit that liberated the Dachau concentration camp.\nEarlier in 2024, the sole living survivor from the sinking of the USS Arizona died at age 102.\nOnly about 119,000 of the 16.1 million Americans who served in WWII are alive today, according to the National World War II Museum."}, {"id": "835d16ea-407e-4018-aba9-4df1bcebb5b1", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 02:15", "url": "https://www.smdailyjournal.com/news/world/north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres-what-it-means/article_f2f1131a-7de9-51ac-83a5-98dacb110b96.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "4b4d6072-e062-43f8-bf18-d0db15a0f1f2", "title": "Why is North Korea sending balloons full of trash into South Korea ? – NBC Bay Area", "date": "2024-05-31 08:15", "url": "https://www.nbcbayarea.com/news/national-international/north-korea-sending-balloons-full-of-trash-south-korea/3553207/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.\nBut it’s unclear whether and how aggressively the South Korean government can urge civil groups to refrain from sending balloons toward North Korea."}, {"id": "2347cbac-7d2e-48da-a72e-81ee30b7c01c", "title": "Why is North Korea sending balloons full of trash into South Korea ? – NBC Chicago", "date": "2024-05-31 02:45", "url": "https://www.nbcchicago.com/news/national-international/north-korea-sending-balloons-full-of-trash-south-korea/3451326/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.\nBut it’s unclear whether and how aggressively the South Korean government can urge civil groups to refrain from sending balloons toward North Korea."}, {"id": "a86be5fe-5af7-480b-a5d7-a97597b530ae", "title": "Why is North Korea sending balloons full of trash into South Korea ? – NBC Connecticut", "date": "2024-05-31 02:45", "url": "https://www.nbcconnecticut.com/news/national-international/north-korea-sending-balloons-full-of-trash-south-korea/3302576/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.\nBut it’s unclear whether and how aggressively the South Korean government can urge civil groups to refrain from sending balloons toward North Korea."}, {"id": "123f3ebe-5a50-466e-891d-fd3822843220", "title": "Trump Online MAGA Army Calls Guilty Verdict a Declaration of War", "date": "2024-05-31 01:45", "url": "https://www.wired.com/story/trump-guilty-verdict-online-maga-fanbase-war/", "message": "Images of an upside-down American flag—a symbol of distress that became co-opted by the 2020 Stop the Steal movement—flooded social media, as Trump supporters, fringe extremists, right-wing pundits, and politicians voiced their anger.\nEver since the trial began, pro-Trump commentators—and Trump himself—have been priming MAGA online ecosystems to claim foul play if the jury found him guilty.\nThe response to his felony conviction was predictably swift, with many characterizing it as a declaration of “war” from the “deep state.” Incendiary rhetoric about how the guilty verdict was a sign of America’s collapse reverberated from the mainstream right all the way to the fringes.\n“As of today, with this fake guilty verdict against Trump, America is no longer the United States,” wrote Joey Marianno, a pro-Trump political commentator, to his 466,000 followers on X.\n“Ladies and gentlemen, we see our republic on its deathbed right now,” said Jones, adding that he believed that “false-flag terror attacks blamed on Trump supporters angry about the verdict” were imminent."}, {"id": "c04a7f1c-db36-441b-92af-c92d5014abe4", "title": "Russia opens a new front : Mapping three key battles in the Ukrainian war - LocalNews8 . com", "date": "2024-05-31 08:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/30/russia-opens-a-new-front-mapping-three-key-battles-in-the-ukrainian-war/", "message": "In the north, Moscow’s troops are aiming to bring its troops within tube artillery range of Kharkiv city.\nThe nearby Russian city of Belgorod, for instance, has increasingly come under Ukrainian attack in recent months.\nSince then, Russian troops have made steady progress westwards in the direction of Pokrovsk, which serves as a vital military hub in Ukraine’s war effort.\nNotes: “Assessed” means the Institute for the Study of War has received reliable and independently verifiable information to demonstrate Russian control or advances in those areas.\nRussian advances are areas where Russian forces have operated in or launched attacks, but they do not control them."}, {"id": "4c674325-fa3f-4f1d-a633-60fa5375b2b1", "title": "Israel warns the war in Gaza to last through end of 2024 | WND", "date": "2024-05-31 04:00", "url": "https://www.wnd.com/2024/05/israel-warns-war-gaza-last-end-2024/", "message": "(ZEROHEDGE) – Israel is warning that its military operation in Gaza will continue through at least the end of the year, in an assessment which is sure to shock and anger the growing chorus of international critics and countries.\nGet the hottest, most important news stories on the Internet – delivered FREE to your inbox as soon as they break!\nTake just 30 seconds and sign up for WND's Email News Alerts!\nThe same official stressed that the war cabinet had defined 2024 as \"a year of combat\" in the wake of the Oct.7 terror attack by Hamas and Islamic Jihad.\nRead the full story ›"}, {"id": "33c7c29f-e8fc-4d28-b208-152a2a64436d", "title": "Why the Swedish and Finnish Air Forces are a powerful add to NATO", "date": "2024-05-31 03:15", "url": "https://news.yahoo.com/news/why-swedish-finnish-air-forces-213001204.html", "message": "Their forces and bases would complicate any Russian effort to conquer the Baltic states in NATO.\nFinland's F/A-18 Hornets — which used to be the US Navy's standard fighter — are already compatible with NATO air forces.\nThis puts several squadrons of stealth fighters on Russia's northern border, with the potential to penetrate and suppress Russian air defenses, and hit vital targets.\n\"Both Finland's and Sweden's proximity allows NATO air forces to stage closer to the Baltics.\nTheir air forces are vital for this Nordic push, and will become very useful to further deter and defend the increasingly contested arctic space with Russia.\""}, {"id": "fe28d520-c1a2-40d4-aac5-113002d8fd8b", "title": "  D Day Dodger  shares World War Two battle memories", "date": "2024-05-31 08:15", "url": "https://www.bbc.co.uk/news/articles/ce99vz560dno", "message": "As the nation prepares to mark the 80th anniversary of the D-Day landings, a World War Two veteran has shared his memories of the battles that raged hundreds of miles away from the beaches of Normandy.\nNow aged 99, Matt MacKinnon Pattison was among hundreds of thousands of Allied soldiers who fought Germans in Italy in the spring of 1944.\nSometimes remembered as the \"D-Day Dodgers\", in reference to their role away from Normandy, men in Italy faced brutal conditions as they battled to take Monte Cassino and dislodge enemy soldiers.\n\"We came back from Italy having flogged ourselves to pieces, nervous wrecks, and people say 'where were you on D-Day?'\"\n\"We just say we were busy bloody well fighting.\""}, {"id": "7838b180-cb8d-48d1-b67d-7c0b3f7e2f34", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 01:15", "url": "https://www.yakimaherald.com/news/nation_and_world/world/north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres-what-it-means/article_1667004c-2b49-5a04-96bb-918372e5a0b9.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "07136437-0947-4402-8fbd-e1b65d279eb5", "title": "Evansville Museum hosts D - Day remembrance event Thursday", "date": "2024-05-31 07:30", "url": "https://www.14news.com/2024/05/31/evansville-museum-hosts-d-day-remembrance-event-thursday/", "message": "EVANSVILLE, Ind.\n(WFIE) - The Evansville Museum hosted a D-day and French War Memorial 80th Anniversary Remembrance event on Thursday.\nThey also spoke about some of the most important American war cemeteries and memorials.\nUE History Professor Dr. James MacLeod says it’s important to remember the sacrifices that were made in the war.\n“More important for us to talk about them and to remind people of what happened,” said Dr. MacLeod."}, {"id": "0026e04a-3ddb-4b33-bac9-7f5b8aa2dc9f", "title": "Biden partially lifts ban on Ukraine using U . S . arms in strikes on Russian territory , US officials say", "date": "2024-05-31 00:30", "url": "https://lasvegassun.com/news/2024/may/30/biden-partially-lifts-ban-on-ukraine-using-us-arms/", "message": "Biden partially lifts ban on Ukraine using U.S. arms in strikes on Russian territory, US officials sayWASHINGTON — President Joe Biden has given Ukraine the go-ahead to use American weaponry to strike inside Russia for the limited purpose of defending Kharkiv, according to two U.S. officials familiar with the matter.\nThe officials, who requested anonymity to discuss the sensitive matter, underscored that the U.S. policy calling on Ukraine not to use American-provide long-range missiles and other munitions to strike inside Russia offensively has not changed.\nThe move comes as Ukrainian officials have stepped up calls on the U.S. administration to allow its forces to defend itself against attacks originating from Russian territory.\nUkrainian officials, most notably Ukrainian President Volodymyr Zelenskyy, have been increasingly vocal in making the case that the restriction was putting Ukrainian forces in an untenable situation as Russia has intensified attacks around the northeast Kharkiv region.\nThat position, Blinken noted, was a “hallmark” of the Biden administration's stance on Ukraine to “adapt and adjust” as needed."}, {"id": "061b6db6-163e-4e1b-9735-97d6e0d7ada4", "title": "LSU hosts memorial service on campus , honors former students , staff that served", "date": "2024-05-31 01:15", "url": "https://www.wbrz.com/news/lsu-hosts-memorial-service-on-campus-honors-former-students-staff-that-served", "message": "LSU hosts memorial service on campus, honors former students, staff that servedBATON ROUGE — LSU held a Memorial Day service Thursday for veterans — including former students, faculty and staff — who died in service of their country.\nThe ceremony was held at noon on the Parade Ground at the LSU War Memorial.\nThe public \"Ceremony in Silence\" observance will include a wreath-laying ceremony and \"Taps,\" the traditional military bugle march.\nLSU's memorial service is being held on the traditional date for Memorial Day — May 30 — when the holiday was first held in 1868.\n\"It's very important because a lot of people today don't realize, that haven't served in the military, fewer people do."}, {"id": "7648a033-5de5-49c8-b5fb-2eb19be0dccc", "title": "Joe Biden partially lifts ban on Ukraine using US arms in strikes on Russian territory , US officials say", "date": "2024-05-31 00:45", "url": "https://www.nzherald.co.nz/world/joe-biden-partially-lifts-ban-on-ukraine-using-us-arms-in-strikes-on-russian-territory-us-officials-say/QZDCZZEOZZDCRECAPPWMBMRXXI/", "message": "An image of Russian President Vladimir Putin is displayed as US President Joe Biden speaks.\nPhoto / GettyAn image of Russian President Vladimir Putin is displayed as US President Joe Biden speaks.\nThe move comes as Ukrainian officials have stepped up calls on the US administration to allow its forces to defend itself against attacks originating from Russian territory.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy as he welcomes him to the White House, December 2022.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy as they meet in the Oval Office of the White House, Tuesday, Dec. 12, 2023, in Washington."}, {"id": "1b0e2987-fbb8-4cea-9a9e-c4abc5b30daf", "title": "God of War Ragnarök announced for PC with enhancements , launches in September", "date": "2024-05-31 00:30", "url": "https://www.neowin.net/news/god-of-war-ragnark-announced-for-pc-with-enhancements-launches-in-september/", "message": "However, one of the announcements was purely dedicated to PC, with another port being unveiled.\nConfirming previous leaks, Sony is finally bringing God of War Ragnarök to PC, less than two years after the title's launch on the PlayStation 4 and PlayStation 5 as an exclusive.\nThe PC version of Ragnarök is touting some nifty features much like other Sony ports too.\nDespite being a single-player experience, Sony makes it clear in the announcement that \"Account for PlayStation Network is required\" to play God of War Ragnarök.\nGod of War Ragnarök is out on Steam and the Epic Games Store on September 19, and pre-orders are available now."}, {"id": "0583015a-c733-4d77-81f4-aa4d92862a48", "title": "Opinion : A war - crimes investigation against Netanyahu is a favour to Israel and the world", "date": "2024-05-31 09:30", "url": "https://www.theglobeandmail.com/opinion/article-a-war-crimes-investigation-against-netanyahu-is-a-favour-to-israel-and/", "message": "Mr. Cotler’s criticism would be valid if Israel showed any sign of using its courts to investigate these war-crime allegations.\nThose criticisms might apply to the International Court of Justice, an unrelated United Nations court that prosecutes claims against entire countries.\nHowever, Canada seemed to change its messaging around the international charges this week.\nEven ardent supporters of Israel, and Israelis themselves, should recognize that the ICC is doing everyone a favour by investigating the grotesque missteps of leaders.\nAt this point, hardly anyone believes that Mr. Netanyahu should remain immune from prosecution – except the man himself."}, {"id": "224a4cab-3fe3-45d1-a095-84f8f8df0b8b", "title": "China , Russia know space weapons are needed ; US should too | Commentary", "date": "2024-05-31 04:00", "url": "https://www.postandcourier.com/opinion/commentary/space-weapons-united-states-china-russia/article_371bee8c-1d29-11ef-b0ee-e75e1b60f8ab.html", "message": "\"The stars will never be won by little minds,\" observed the great science fiction writer Robert Heinlein.\nIf we aren't careful, though, they just might be won by the scheming minds of governments hostile to the United States.\nRead moreLowry: Russia and China realize space weapons are essential to war.\nWe should too."}, {"id": "c75dc007-ab76-4c92-9868-f851f258fcd4", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 06:45", "url": "https://www.thesunchronicle.com/news/nation_world/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day/article_8bc5fe4a-e47e-5731-bf2e-6890752415b4.html", "message": "The history of the D-Day invasion that changed the course of World War II is often told through the stories of the men who fought and died when the Allies stormed the beaches of Normandy, France, on June 6, 1944"}, {"id": "ac7e1f36-792c-4095-81ef-e99084dc2fdf", "title": "Women were barred from combat during WWII . But they helped ensure the Allie D - Day success", "date": "2024-05-31 06:15", "url": "https://toronto.citynews.ca/2024/05/31/women-were-barred-from-combat-during-wwii-but-they-helped-ensure-the-allies-d-day-success/", "message": "For British women who came of age during World War II, the answer to that question is often: quite a lot.\nBut behind the scenes were hundreds of thousands of military women who worked in crucial non-combat roles such as codebreakers, ship plotters, radar operators and cartographers.\nAlthough technically barred from combat, more than 800 British women were killed in military service during the war.\n“People forget they were 17, 18 doing these jobs,” said Dick Goodwin, the honorary secretary of the Taxi Charity for Military Veterans, which helps veterans travel to Normandy each year.\nThey include the uniforms of the Auxiliary Territorial Service, the Women’s Auxiliary Air Force and the Women’s Royal Naval Service."}, {"id": "21ce5919-7aa4-446e-829a-99a95321604a", "title": "China defense ministry condemns US missile deployment in Philippines", "date": "2024-05-31 04:00", "url": "https://www.rappler.com/world/asia-pacific/china-defense-ministry-condemns-united-states-missile-deployment-philippines/", "message": "A Chinese defense ministry spokesman says Beijing remains highly vigilant and opposes the deployment, the first in the Indo-Pacific region.\nChina’s defense ministry on Thursday, May 30, strongly condemned the deployment of a US intermediate range missile system in the northern Philippines during military drills in April, saying it “brought huge risks of war into the region”.\nDefense Ministry spokesperson Wu Qian told a press briefing in Beijing that China remained highly vigilant and opposed the deployment, the first in the Indo-Pacific region.\nPlay VideoThe US said last month it had deployed its Typhon missile system to the Philippines as part of their Balikatan or “shoulder-to-shoulder” military drills.\nA Philippines military spokesperson could not be reached for comment on Thursday."}, {"id": "800596cc-5e66-4c3d-8161-06ebe3319467", "title": "Electronic Weapons : USAF Electronic Warfare Squadrons", "date": "2024-05-31 05:45", "url": "http://www.strategypage.com/htmw/htecm/articles/2024053103743.aspx", "message": "May 31, 2024: The United States Air Force has made a bold move by establishing two new electronic warfare squadrons.\nThis means which offensive electronic countermeasures; jamming or spoofing (deceptive signals) are best suited to protect aircraft, ships, and land bases.\nNo one took credit for the AIS signal manipulation, which is known as spoofing.\nAfter 2012 security researchers found even more ways to hack AIS and called for changes in the AIS software to make it more difficult to spoof.\nThe 563rd specializes in developing new EW software apps for EW that support specific EW needs of Air Force combat and support units."}, {"id": "44c704fc-06df-482a-9ed4-e0e4d2eead34", "title": "Tributes to Greater Manchester  inspirational  D - Day hero who has died at aged 100", "date": "2024-05-31 09:15", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/tributes-greater-manchesters-inspirational-d-29268848", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up to the MySalford newsletter to keep up with what's happening in and around the citySomething went wrong, please try again later.\nDavid Teacher, who served as a mechanic with the RAF in the Second World War, died last Friday, a spokesman for Broughton House care home in Salford, Greater Manchester, said.\nThe 80th anniversary of D-Day will be marked on June 6 with commemorations in Normandy as well as across the UK."}, {"id": "dea5852c-259f-4583-a571-ac7fff5e0106", "title": "Skydance Behemoth Releases Fall 2024 for PS VR2 , SteamVR , and Quest", "date": "2024-05-31 01:00", "url": "https://www.vgchartz.com/article/461180/skydances-behemoth-releases-fall-2024-for-ps-vr2-steamvr-and-quest/", "message": "Skydance's Behemoth Releases Fall 2024 for PS VR2, SteamVR, and Quest - News/ 444 Viewsby, posted 10 hours agoSkydance Interactive has announced Behemoth will launch for PlayStation VR2, SteamVR, and Meta Quest in Fall 2024.\nWhen you enter the Forsaken Lands, one thing is clear: You are not welcome here.\nThe Forsaken Lands are your gauntlet and your hunting ground.\nHunt or be huntedAlthough desolate at a glance, the Forsaken Lands are populated by marauders and zealots.\nOnly then will the darkest secrets of the Forsaken Lands be revealed…A life-long and avid gamer, William D'Angelo was first introduced to VGChartz in 2007."}]