[{"id": "89ff9033-684d-42a3-a2a5-2caa84a589c0", "title": "UT Austin initiates discipline for student protesters , places hold on transcripts", "date": "2024-06-11 14:45", "url": "https://www.yahoo.com/news/ut-austin-initiates-discipline-student-140019997.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Another UT student who was arrested April 24, and spoke on condition anonymity for fear of retaliation, said they also received a disciplinary letter and cannot register for classes.\nWhat else was in UT's disciplinary letter?\nWhy were UT students protesting?\n“It’s for Palestine; it’s for Gaza.”The UT System and Abbott have said divestment is not on the table for UT.\nI earned my degree rightfully so, and share it with the people of Gaza where no universities stand.”This article originally appeared on Austin American-Statesman: UT Austin student pro-Palestine protesters receive disciplinary letter"}, {"id": "3b4e3637-5e50-4b84-a3f7-53fc15c142c3", "title": "New York Times Adds  Editor Note  to Article That Whitewashed Violent Anti - Israel Protest", "date": "2024-06-11 23:15", "url": "https://www.algemeiner.com/2024/06/11/new-york-times-adds-editors-note-article-whitewashed-violent-anti-israel-protest/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "In Washington, DC last weekend, an anti-Israel crowd attacked a park ranger by throwing bottles at him as he tried to protect a statue that they were vandalizing.\nYet the New York Times whitewashed the protest, publishing an article that made no mention of the assault on the park ranger.\nThe byline over the Times article is that of Minho Kim.\nOther basic facts in the Times article were incorrect, outdated, or lacked context.\nThere was no mention of Jews or antisemitism.” It’s not actually accurate that the Times didn’t mention Jews, but the paper certainly was dismissive of the antisemitism concerns."}, {"id": "63eae92b-7a0d-4dee-a414-a9e2580c5599", "title": "Marxists , Muslims Storm White House at Pro - Hamas Rally", "date": "2024-06-11 06:15", "url": "https://www.dailysignal.com/2024/06/10/9-things-saw-pro-hamas-white-house-rally/", "domain": "dailysignal.com", "domain_classification": "Unknown", "message": "pic.twitter.com/w3YtKv6qzk — Hudson Crozier ?\npic.twitter.com/JwNyCUzseW — Hudson Crozier ?\nVandalismThe small police presence failed to stop protesters as they spray-painted historic monuments and property surrounding the White House.\nMonuments in front of the White House are being vandalized — the second time anti-Israel demonstrators have done this in recent memory.\n\"Death to AmeriKKKa\" written on a monument in front of the White House."}, {"id": "1f5241ec-c636-49f0-a475-7021867435eb", "title": "Julianna Margulies will NOT return to Apple TV+ The Morning Show", "date": "2024-06-11 02:00", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13515687/Julianna-Margulies-NOT-return-Apple-TV-Morning-backlash-podcast.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Margulies passed on 'a one-episode appearance' for the show's fourth season, an insider told Variety.\nJulianna Margulies, 58, is not returning to The Morning Show for the Apple TV+'s fourth season,.\nMargulies referenced her own religion as well as her role as Peterson on the streaming series in her response to the controversy.\nA, you're Black, and B, you're gay.\nMargulies in December of 2023 in a statement she was sorry for the comments and 'horrified' that they 'offended the Black and LGBTQIA+ communities,' which she has 'love and respect' for."}]