[{"id": "7ab24542-6013-49f3-bfd0-3b866f9ab4d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26875/", "date": "2024-05-08 07:14", "message": "The spokesperson for the Israeli Coordinator of Government Activities in the Territories:\n\nIn accordance with the directive of the Israeli government, the Kerem Shalom crossing was opened this morning for the entry of humanitarian aid into the Gaza Strip.\n\nWe emphasize that all humanitarian aid comes in after a careful security check by Land Crossings Authority security guards at the Ministry of Defense.\n\n\n###\nThe Biden administration is tying Israel's hands and preventing it from defeating Hamas.\n\nStrong American pressure on all fronts."}, {"id": "cb64475c-b1df-4d24-828b-2b9e3d8e5a70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "The Palestinian Authority this morning:\n\nThe Kerem Shalom crossing is still closed.\nThe Rafah crossing is closed to Palestinian passengers for the second day in a row."}, {"id": "71b71001-64f1-4824-ae1b-b570f49935b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "IDF activity in the Gaza Strip\n\nDuring last night night and in the early hours of the morning, the IDF continued with airstrikes in Rafah, which resulted in almost no casualties.\n\nThe most \"significant\" attack in terms of casualties last night was in the Zaytoun neighborhood in Gaza City, where seven members of the A-Loh family were killed.\n\nIn the Rafah sector, two casualties were reported last night from an Israeli attack.\n\nThere are no Palestinian reports of ground movement of the maneuvering forces in Rafah.\n\n##\nAmerica's influence is evident... Currently, according to the Palestinian reports on the IDF's activity in the Rafah sector, there does not seem to be any significant movement of forces operating in this area."}, {"id": "14c923c0-e0de-417d-8af3-cfc9d067f033", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26871/", "date": "2024-05-08 06:06", "message": "Egypt: The newly-formed organization named after the Egyptian policeman Muhammad Salah, which accepted responsibility for the murder of the Israeli tourist yesterday in Egypt, published a photo, which looks like a frame taken from a video, allegedly showing the moment of the murder of the Israeli tourist (I blurred out the photo - AA).\n\nThe caption on the picture reads \"Hello from the children of Gaza\"."}]