[{"id": "ddf8e59d-81c4-451a-b91d-38f8d5722986", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31899/", "date": "2024-08-05 20:21", "message": "Sergei Shoigu, the head of the Russian Security Council, has concluded his visit to Iran after meeting with the Iranian president and is now on his way to Baku, the capital of Azerbaijan.\n\nIranian sources claim that his intention is to warn Azerbaijan against taking any actions in favor of Israel concerning Iran."}, {"id": "bf015bf9-ba22-4719-bb09-1d19f263c214", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31898/", "date": "2024-08-05 20:20", "message": "Iran's Airport Authority tries to reassure passengers by stating that there are no flight restrictions in the west and north of the country."}, {"id": "96b89f0a-fb87-4eb4-bdcf-558733de061b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31897/", "date": "2024-08-05 20:19", "message": "Iran: Reports of explosions in Isfahan\n\nSources affiliated with the Iranian opposition report three explosions heard a short while ago in Isfahan, located in the center of Iran.\n\nUnofficial Iranian sources affiliated with the regime claim, \"These are just training exercises.\"\n\n##\nI remain unconvinced..."}, {"id": "e7b0d055-2947-4600-a697-e9c811402667", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31896/", "date": "2024-08-05 20:17", "message": "Hezbollah announces another casualty in its ranks:\n\nAli Jawed (nickname: Karbala!), born in 1987, was killed earlier today by an Israeli drone strike while riding his motorcycle near Jibchit.\n\nAccording to the IDF spokesperson, he was a commander in Hezbollah's Radwan Force.\n\nNumber 394."}, {"id": "c8be1016-458c-444e-9a99-97d56082e162", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31894/", "date": "2024-08-05 20:14", "message": "Iraqi sources affiliated with the Shiite Axis:\n\nThis is the launcher from which rockets were fired this evening towards the American base in Ayn al-Assad (Iraq) by Shiite militias.\n\nReuters news agency confirms that rockets were indeed fired at the American base."}, {"id": "31748e00-c0a1-4e75-be0f-65c8961e999b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31893/", "date": "2024-08-05 20:13", "message": "Hezbollah, and the rising rental prices in Lebanon\n\nThe Lebanese \"al-Akhbar\" complains about \"war profiteers\" who are exploiting the current situation by raising rental prices in \"safe areas.\" \n\nAccording to the daily Hezbollah-affiliated newspaper, residents of the Dahieh in Beirut and southern Lebanon (predominantly Shiite areas, prone to conflict) are seeking to move somewhere safer and are now discovering that rental prices have skyrocketed since the war began and have increased even more since the assassination of Fuad Shukr, Hezbollah's chief of staff, due to fears of Israeli attacks.\n\nFor example, in Beirut, in areas outside of the Dahiyeh, Hezbollah's stronghold - rental prices have tripled within days following the assassination of Shukr. \n\nApartments rented for $600 per month have jumped to $1,800, and a deposit of six months' rent is now required upfront, instead of three months.\n\nHezbollah supporters looking to escape danger are faced with an unpleasant reality."}, {"id": "8e707eb0-246a-4800-baba-89c40a3fb66c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31892/", "date": "2024-08-05 20:07", "message": "IDF Spokesperson Hagari responds:\n\n\"In light of the recent publications in the last hour and the questions that they bring, it's important to clarify - there are no changes in the directives of the Home Front Command. We are closely monitoring the situation all the time and will update you on any changes.\""}, {"id": "a2e80057-7df8-44e0-a577-6ae89f86cf7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31891/", "date": "2024-08-05 20:05", "message": "Trump Addresses Iran's Expected Attack on Israel:\n\n\"You know, I'm hearing that there's going to be an attack tonight by Iran on Israel. \n\nThey're going to be attacked tonight, I'm telling you right now. I hear it through the same waves. There's no top secret information or anything, but I hear that Israel is going to be attacked tonight. \n\nIf I were president, nobody would even be talking about this. It wouldn't happen, 100%.\""}, {"id": "92a724c6-d08a-414c-ab64-84aa633c762e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31890/", "date": "2024-08-05 18:28", "message": "The US State Department: We have conveyed to Iran that escalation is not in its interest and that we will protect Israel. \n\nWe have made it clear that we will defend Israel against any Iranian attack or any attack by terrorist organizations."}, {"id": "ba85d58d-8092-47a9-99d9-3a111132e4ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31889/", "date": "2024-08-05 18:27", "message": "An infographic circulating on social media and cited by supporters of the Iranian axis apparently shows the current deployment of US Navy assets in the Middle East.\n\nAccording to American bloggers, in addition to the vessels depicted in the infographic, two nuclear-powered Ohio-class submarines that departed from their base in Kings Bay, Georgia, in the past two weeks - have also arrived in the area."}, {"id": "446e637f-ff14-47ca-b0ac-0e144c7e30ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31887/", "date": "2024-08-05 17:13", "message": "According to Palestinian sources, Abd al-Hadi Siam (\"Dario\"), one of the senior commanders in Izz a-Din al-Qassam's Gaza City Brigade (Hamas), was killed in the same attack along with al-Furqan Brigade commander Jaber Aziz.\n\nAttached are pictures of the two senior commanders."}, {"id": "010721eb-4269-4e24-be4f-8bd729148614", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31886/", "date": "2024-08-05 17:07", "message": "Joint IDF and ISA announcement:\n\nDuring the strike on Hamas command and control centers in Gaza City; the IDF and ISA eliminated the terrorist Jaber Aziz, Commander of Hamas' Al-Furqan Battalion\n\nYesterday (Sunday), based on IDF and ISA intelligence, the IDF struck Hamas terrorists who operated in a Hamas command and control center that was embedded within the \"Hassan Salame\" and \"Nasser\" schools in Gaza City.\nAccording to IDF and ISA intelligence, during the strike in the area of the \"Hassan Salame\" school, the terrorist Jaber Aziz, Commander of Hamas' Al-Furqan Battalion was eliminated along with additional terrorists.\n\nAziz has been the Commander of Hamas' Al-Furqan Battalion since 2020. He was previously the Deputy Commander of the Al-Furqan Battalion, Deputy Commander of the Zaytun Battalion, and the Commander of the Zaytun Battalion.\n\nAziz took a significant part in the planning of the October 7th massacre and led the preparations and training of the Al-Furqan Battalion. He also participated in the infiltration into communities near the Gaza Strip on October 7th.\n\nThroughout the war, he was responsible for directing and promoting numerous terror attacks against the IDF and the State of Israel. Aziz was a key operative in the war management of Hamas' Gaza Brigade. His elimination significantly degrades the capabilities of the Hamas terrorist organization."}, {"id": "364a5f08-f84d-4e74-a277-be19050fb958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31884/", "date": "2024-08-05 16:50", "message": "Iran: After the briefing for the foreign ambassadors, Ali Bagheri Kani, the acting Iranian foreign minister, arrived at the Hamas offices in Tehran."}, {"id": "a7a225fa-0528-413c-b8d2-5c7bde59f5e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31883/", "date": "2024-08-05 16:48", "message": "Here and there..."}, {"id": "9bcf5f20-57f6-46e3-9e8f-3d751952467c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31880/", "date": "2024-08-05 16:48", "message": "The funeral of Muhammad Hammadi, the medic of the Amal Shia movement 👆 who was killed by Israeli drone fire this morning in Meiss el-Jabal in southern Lebanon.\n\nThe funeral was also for Ali Shakir, a Hezbollah operative who was killed together with the Amal operative."}, {"id": "6040dd8d-b25b-4016-ba47-fa4c542fc08d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31878/", "date": "2024-08-05 16:46", "message": "The Palestinians in Deir al-Balah in the center of the Gaza Strip are disturbed - the IDF has begun leveling and preparing a large area north of the Hamad neighborhood - between Khan Yunis and Deir al-Balah (the Hamad neighborhood is marked with a red pin).\nThe residents of Deir al-Balah fear that areas are being prepared for them where they will have to evacuate in preparation for the possible entry of IDF forces into Deir al-Balah and Nuseirat - areas where the IDF has not yet maneuvered."}, {"id": "464245c4-efe0-4659-901c-fe9a49357306", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31877/", "date": "2024-08-05 16:45", "message": "For those who did not understand the situation in Iran: the Russians are sticking it to the Americans for the fact that the Americans are arming Ukraine..."}, {"id": "efd3a6e2-dde7-4bf9-9d9e-e264c3b7fe9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72607/", "date": "2024-08-05 15:10", "message": "Unofficial Lebanese channels claim that a man was killed in the attack in Jibchit."}, {"id": "f3bac4fa-417c-47fe-bcd0-6fe28e55c3ba", "channel_id": 1560386984, "url": "", "date": "2024-08-05 15:01", "message": "South Lebanon: casualties in an attack carried out by an Israeli UAV on a motorcycle near the village of Jibchit"}, {"id": "63f87ff4-b25f-4f7f-8672-f6b702f5eecc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31872/", "date": "2024-08-05 15:01", "message": "Iran: Documenting the moment of the explosion of one of the oil storage facilities in the Dogaron region, near the border between Iran and Afghanistan."}, {"id": "49788fc1-508c-4947-8aa3-9740188b1c76", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72601/", "date": "2024-08-05 14:47", "message": "Documentation of the exchange of fire in Jenin at this time."}, {"id": "12ab4145-02f3-4fb4-91e8-e6a097df0119", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31865/", "date": "2024-08-05 14:47", "message": "IDF activity in Jenin\n\nIn the last hour, large IDF forces raided Jenin with great fanfare. Armored military vehicles unexpectedly crossed \"the path of Palestinian private vehicles\", shot at electrical transformers and raised drones into the air, as the Palestinians report and can be seen in the attached videos.\nAccording to the Palestinians, the forces scattered \"bills\" worth negative one million dollars with the portrait of Ismail Haniyeh - apparently as part of an operation against money exchangers who help finance terrorism in Jenin."}, {"id": "b5703211-a2a3-42be-95f8-33362b5a7de2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31864/", "date": "2024-08-05 14:41", "message": "Tehran: Documentation from the meeting of the Russian security delegation that arrived in Iran led by Sergei Shoigu, head of the Russian Security Council, with the heads of the Iranian security establishment.\n\nAmong the members of the delegation, the presence of Aleksandr Mikheyev, chairman of the board of the Russian State Corporation for Arms Exports, stands out."}, {"id": "24665745-9976-47ee-ba6f-461ac3ab14a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31862/", "date": "2024-08-05 14:01", "message": "Michael Kurilla, commander of the US Army's Central Command, landed in Israel, hours after Sergei Shoigu, head of the Russian Security Council, landed in Tehran.\n\nUSA VS Russia"}, {"id": "b1d21f66-87c9-403c-a5d7-e75a1414dc19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31859/", "date": "2024-08-05 13:23", "message": "Oil tankers caught fire in the Dogaron region at the Iran-Afghanistan border crossing, which led to the closure of the crossing. The Iranian fire brigade is trying to control the fire."}, {"id": "b1793730-8f34-45b7-bf9e-5c69f58e0dee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31858/", "date": "2024-08-05 13:12", "message": "Tehran: The Iranian Foreign Minister is holding a briefing for the foreign ambassadors in Iran - he is trying to build legitimacy for a reaction against Israel."}, {"id": "b0e8aa57-d2e0-4fc4-a79d-a6665041db73", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31857/", "date": "2024-08-05 12:36", "message": "Gaza channels report that today residents from the center of the Gaza Strip robbed the fruit and vegetable trucks that were intended for their brothers in the north of the Gaza Strip again..."}, {"id": "d2ad89e7-3478-48c9-8969-85679bf1cf8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31856/", "date": "2024-08-05 12:27", "message": "The area of ​​the \"TIKA\" towers built by the Turkish Cooperation and Coordination Agency in Jahar al-Dikh, south of Gaza City:\n\nBefore the war and now...\n\nGreetings to Erdogan."}, {"id": "a47d11ec-1437-45f6-aec2-d1ac0249a077", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31855/", "date": "2024-08-05 12:05", "message": "The evacuation warning is a follow-up to the firing of rockets into Israel earlier today."}, {"id": "5175620a-0922-4ce6-9cd3-abefe9ca8ef3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31854/", "date": "2024-08-05 12:05", "message": "The IDF spokesman in Arabic repeats his evacuation warning from yesterday for the south Khan Yunis and north Rafah area and adds the Nasser neighborhood in the center of Khan Yunis to the neighborhoods subject to evacuation (the Salah al-Din route passes through this neighborhood that crosses the Strip from north to south)."}, {"id": "62587c91-7cca-40d6-9405-84894260f4b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31853/", "date": "2024-08-05 11:11", "message": "From what Hossein Salami, commander of the Iranian Revolutionary Guards, said this morning:\n\nThe US and Israel export all types of prohibited weapons and claim today that Iran has no right to have a nuclear capability.\nThe enemy thought, wrongly, that eliminating the nuclear scientists (the Iranians) would prevent us from achieving a nuclear capability..."}, {"id": "6cd472b4-f9e2-4189-aaf9-93ce8ccad17f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31851/", "date": "2024-08-05 11:02", "message": "Four US military planes have landed in Jordan since this morning."}, {"id": "4ee3f023-6850-4cf5-a2ee-b035d40d0cbe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31850/", "date": "2024-08-05 11:02", "message": "Sergei Shoigu, Secretary of the Security Council of Russia and former Minister of Defense landed in Tehran."}, {"id": "04a6760f-d091-4fcd-99fa-f1842522bbc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31847/", "date": "2024-08-05 10:44", "message": "The Hamas police jeep in Deir al-Balah where 8 were killed as a result of the IDF attack👆."}, {"id": "da75155f-fee4-47ce-89de-7b955390fbb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31846/", "date": "2024-08-05 09:51", "message": "I would like to point out that following the instruction of the IDF spokesman yesterday afternoon to evacuate the neighborhoods of south Khan Yunis and north Rafah 👆 no photos and videos of civilians evacuating from the area were seen on social media, unlike usual after evacuation instructions.\n\n##\nIn my opinion, this is due to the fact that the area is relatively sparsely populated and because there was no report of shooting and fire from the IDF which usually \"speeds up\" the evacuation."}, {"id": "e98777f4-9743-455f-97fb-309be3c08d76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31845/", "date": "2024-08-05 09:49", "message": "The Palestinians report 8 dead, including at least 5 Hamas policemen, after an Israeli aircraft attacked a jeep of the aid convoy security at the \"Almatahen\" intersection in Deir al-Balah in the center of the Gaza Strip about an hour ago."}, {"id": "6ee22a77-6d19-4f59-a614-9b4ef8e966a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31844/", "date": "2024-08-05 09:48", "message": "Hamas-identified sources: An Israeli aircraft recently attacked the family home of the mayor of Bureij near Abu Ratzaz square in the Buireij camp (central Gaza). There are casualties."}, {"id": "cfda7b70-6776-445f-bfe2-f5386fb3686b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31843/", "date": "2024-08-05 09:36", "message": "IDF Spokesperson: Following the sirens that sounded a short while ago in communities near the Gaza Strip, approximately 15 projectiles crossed from southern Gaza into Israeli territory. The IDF Aerial Defense Array successfully intercepted multiple projectiles, and several fell in the areas of Re'im and the Geha Interchange."}, {"id": "fd5c62af-7877-49eb-9992-851874905c01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31842/", "date": "2024-08-05 08:59", "message": "The President of Egypt, Al-Sisi, welcomes the Turkish Foreign Minister in the city of El Alamein in Egypt.\n\nNot long ago, such a meeting would have been considered an \"imaginary event\" due to the enmity that prevailed between the regime of Erdogan, the man of the Muslim Brotherhood, and the regime of al-Sisi."}, {"id": "da6c682f-2a19-4759-9d65-6ed9feac1f2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31839/", "date": "2024-08-05 08:34", "message": "Khan Yunis, southern Gaza Strip: The Palestinians are preparing to bury the 80 bodies of Gazans they received from Israel this morning."}, {"id": "5ad697d3-186b-4de5-83e6-17b8696bc11d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31838/", "date": "2024-08-05 08:34", "message": "Iranian Foreign Ministry spokesman:\nTehran does not seek to escalate regional tensions, but it is necessary to punish Israel."}, {"id": "5dc42ae7-b9dc-40ae-9a86-7c2f50cafdae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31837/", "date": "2024-08-05 08:33", "message": "Palestinian channels publish footage of this morning's shooting at the Beka'ot settlement.\nThere were no casualties."}, {"id": "91a8e85c-b7ee-433a-ba4e-cbc3ddb1f925", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31836/", "date": "2024-08-05 08:31", "message": "Hezbollah announces a death in its ranks:\n\nAli Shakir\n\nHe is the second person killed in the IDF attack this morning in Meiss el-Jabal in southern Lebanon. He was killed together with Muhammad Hammadi from the Amal movement👆\n\nNumber 393"}, {"id": "d5042b43-9e54-4da1-8998-6000cceb30e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31835/", "date": "2024-08-05 08:30", "message": "Following on from the report here 👆👆 yesterday evening:\n\nIDF spokesperson: Yesterday (Sunday), with the direction of IDF intelligence, the IAF eliminated Abed Al-Zeriei, a terrorist operative in the Manufacturing Department of Hamas' Military Wing, who also served as Hamas' Minister of Economy in the Gaza Strip.\n \nThe Manufacturing Department operates to increase Hamas' weapons capabilities, including by exchanging information with other terrorist organizations across the Middle East. \n \nAl-Zeriei had a significant role in directing Hamas' efforts to seize control of humanitarian aid entering the Gaza Strip and in managing Hamas-controlled markets. Furthermore, he was responsible for the distribution of fuel, gas, and funds for terrorist purposes."}, {"id": "a953b69c-fb40-4a38-9e25-3f491e523b19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31834/", "date": "2024-08-05 07:41", "message": "Nasser Hospital in Khan Yunis: We are preparing to receive 80 bodies of Gazans from Israel via the Red Cross."}, {"id": "aefb1e41-f6e5-4f55-87e3-d813b85d9006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31833/", "date": "2024-08-05 07:41", "message": "The military arm of Hamas is in need of content... Yesterday they released a \"new video\" from July 19th"}, {"id": "bde5b8a6-55e0-4e31-9c12-2ff9381958b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31832/", "date": "2024-08-05 07:00", "message": "Iranian sources report that the USA is sending huge amounts of weapons to the region and point to a large American cargo plane that arrived at the American base \"Ali al-Salem\" in Kuwait."}, {"id": "7bf702ff-7793-4f00-a610-09260fbd8c6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31831/", "date": "2024-08-05 06:59", "message": "A source associated with the Iranian opposition explains why and how important it is for the Iranian regime to respond to Haniyeh's assassination:\n\nIran does not respond for Haniyeh or for Gaza. She reacts because she feels that her dignity has been trampled on - something that arouses a severe sense of internal humiliation among the regime.\n\nThe citizens of Iran themselves began to look at the regime as weak and compromised from a security point of view.\n\nAt the regional level, Iran's militias began to feel insecure and that their people were not protected even in the heart of Tehran.\n\nAt the international level - Iranian sovereignty was violated in an unprecedented way by the \"weakest entity\", according to the perception presented by official Iran.\n\nThese are Iran's motives this time."}, {"id": "b0ab44f1-0a47-4066-9269-3f6138cf10ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31832/", "date": "2024-08-05 06:14", "message": "Pictures from Siberia, last night."}, {"id": "f4697f60-2651-41a5-8d7d-22f45d5715c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31821/", "date": "2024-08-05 06:13", "message": "News agencies in Russia: Northern lights were observed in several places across Russia."}, {"id": "638708da-8bce-48bb-9a86-1fac7dd67c5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31820/", "date": "2024-08-05 06:13", "message": "According to the IDF spokesperson, an IDF officer and soldier were moderately injured early this morning as a result of a fall (of a Hezbollah UAV -AA) near Ayelat HaShachar."}, {"id": "23f2cbb0-7caa-48bf-a8a5-fe91c4c426cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31819/", "date": "2024-08-05 06:11", "message": "The Lebanese Ministry of Health reports two deaths as a result of an Israeli UAV attack about an hour ago in Meiss el-Jabal in southern Lebanon.\n\nAccording to Lebanese sources, one of the dead is a member of the rescue forces of the Shia Amal movement - Muhammad Fouzi Hammadi (pictured).\nApparently, the second is his colleague."}, {"id": "49cbd896-526b-40c0-abb9-e48ff098f385", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31818/", "date": "2024-08-05 06:10", "message": "Regarding the expected Iranian response:\n\nThe Pentagon reports that the US Secretary of Defense spoke with his Israeli counterpart and emphasized to him US support for Israel's security.\nAccording to the Pentagon, the minister discussed with his Israeli counterpart the reinforcement of American forces and deterrence in the defense of Israel.\n\nThe American minister also stated that the tensions in the region must be calmed and that he strongly supports a ceasefire in Gaza and the deal to release the abductees.\n\n##\nAccording to Reuters, President Biden is expected to hold a security discussion today with the \"American National Security\" team regarding what is happening in the Middle East.\n\nIt was also reported that Biden is expected to talk today with King Abdullah of Jordan."}, {"id": "23e2ba32-4fc8-4261-8dca-0a347a814a0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31817/", "date": "2024-08-05 06:09", "message": "How wretched is the military arm of Hamas and how desperate is it to accept responsibility for terrorist attacks?\n\nEven after the Islamic Jihad revealed a photographed testament of Jamal Abu Haniyeh and Ali Khalil 👆 according to which they are both Islamic Jihad operatives (those who murdered Amnon Mokhtar on June 22 in Qalqiliya), the military wing of Hamas publishes a poster stating that the two are Hamas operatives."}, {"id": "9d542af5-1526-47bb-9335-83d885bbda40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31816/", "date": "2024-08-05 06:07", "message": "Khalil al-Hayya, a member of the political bureau of Hamas and deputy of Yahya Sinwar. The leadership is united and within days we will finish the consultations to choose a new leader for the movement (in place of Haniyeh-AA).\n\n##\nAl-Hayya's statement comes amid reports of disputes regarding the selection of Haniyeh's replacement, with the most prominent candidates being himself and Khaled Mashal."}, {"id": "59390f9e-0ebd-4f35-a405-c3a144387384", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31815/", "date": "2024-08-05 06:06", "message": "On May 22, the IDF conducted an extensive operation in Jenin.\nDuring the operation, IDF forces arrested Wafaa Jarrar, the wife of Abd al-Jabbar Jarrar, a senior member of Hamas in Jenin who is imprisoned in Israel.\n\nUnfortunately for her, the terrorists in Jenin set off an explosive device against the Israeli jeep she was staying in after she was arrested. As a result, her legs were amputated and she was transferred to the hospital for treatment (the IDF released her from detention because of this).\n\nToday the Palestinians reported that Jarrar died of her wounds...\nSo that in fact a senior woman in Hamas was killed by an explosion by terrorists in Jenin...\n\n##\nTheir sword shall enter into their own heart..."}, {"id": "a0c677d9-baf6-4f02-aa8c-f2c59716e6cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31812/", "date": "2024-08-05 06:00", "message": "IDF bulldozers cleared the burning tires set on fire by the Palestinians to the Nablus vegetable and fruit market area.... the results are in front of you...\n\nOne of the members of the Palestinian fire brigade was injured from smoke inhalation."}]