[{"id": "7035094d-69e4-444e-9f1d-0491439168bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32341/", "date": "2024-08-13 09:25", "message": "A Palestinian on Twitter:\nWhile Khamenei and his gang threaten and promise...\n2000 settlers invaded the Al-Aqsa Mosque since this morning to mark the destruction of the Temple.\n\n##\nIt's a good point..."}, {"id": "01f6fe4e-7c50-4d6c-b4b6-3008717745b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32340/", "date": "2024-08-13 09:24", "message": "This morning the Waqf in East Jerusalem reported:\n\"Minister Itamar Ben Gvir is now invading the Al-Aqsa Mosque.\""}, {"id": "83b16be0-cbf0-4dd3-a9a0-e8ff983ab17b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32339/", "date": "2024-08-13 09:23", "message": "Gaza: the donkey earned his rest"}, {"id": "ba37d835-3721-4fd1-95ad-37c100b7eccd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32338/", "date": "2024-08-13 09:22", "message": "Yesterday evening, Iranian propaganda channels spread a tweet with the time 02:00 and an hourglass - so that in Israel they would think that the attack would happen in the morning hours.\n\nGazans managed to record the moments of the Iranian attack at two in the morning...(volume on)"}, {"id": "d1ed9818-7da8-415a-86e3-0a0be948d859", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32335/", "date": "2024-08-13 09:21", "message": "East Jerusalem channels complain:\n\"1400 settlers invaded the Al-Aqsa Mosque this morning.\"\n\nThe Palestinians also complain about the fact that the Israeli flag was raised on the Temple Mount as well as a prayer that took place near the Cotton Merchants' Gate in the Old City of Jerusalem."}, {"id": "d76bf428-8835-42ff-849a-ca891e0567aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32330/", "date": "2024-08-13 06:30", "message": "Opponents of the Iranian regime on social media mock the fact that the Iranians have not yet responded to Haniyeh's assassination despite the dramatic threats."}, {"id": "c939b960-b843-46c8-8ff0-43f73abb1cc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32329/", "date": "2024-08-13 06:28", "message": "The Lebanese Al-Akhbar newspaper (Hezbollah-affiliated): American envoy Amos Hochstein is expected to arrive in Beirut tomorrow with a new initiative to calm the situation and prevent a widespread war."}, {"id": "f13452d2-78b9-48dd-9ac7-a48d9bffde38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32328/", "date": "2024-08-13 06:25", "message": "Tonight Trump held a first interview of its kind with Elon Musk on the X Network (Twitter).\n\nDuring the interview it was reported that the X network was subject to extensive cyber attacks. Despite this, it was reported that over a million people listened to the interview live.\n\nKamala Harris' campaign team stated that Elon Musk was abusing his ownership of X to promote Trump's candidacy.\n\nDuring the interview, Trump repeated his familiar positions and claimed that every Jew who votes for Harris should undergo a mental examination.\nTrump praised the performance of the Argentine president. Trump stated that he will know how to make peace in the world and deal with Putin, who he says respects him.\nTrump also assumed that the Iranians will not attack Israel in the end..."}, {"id": "a1ce8254-5b93-4993-beb1-1ff2f8d88f6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32322/", "date": "2024-08-13 06:22", "message": "A magnitude 5.5 earthquake was reported tonight shortly before midnight in the Hama district of Syria\n\nThe earthquake was felt in Jordan, Lebanon, Turkey and Israel.\nIn Syria, minor damage to buildings and 25 injuries of various degrees were reported.\nAccording to Syrian sources, another 15 aftershocks were felt in the last hours.\nMany residents of Syria and Lebanon came out of their homes into the streets for fear that their homes would collapse on them."}]