[{"id": "fd58afb7-3f58-4aa1-a1f2-c7c14d47d33f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26814", "date": "2024-05-06 19:40", "message": "Airstrikes in Janineh, eastern Rafah."}, {"id": "5eb4a24e-81fe-45d8-9791-08fa27a1eb07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26813/", "date": "2024-05-06 19:22", "message": "The Israeli Prime Minister's Office:\n\nThe war cabinet has unanimously decided that Israel should continue with a military operation in Rafah to exert pressure on Hamas militarily, with the aim of advancing the release of our hostages and achieving our objectives.\n\nDespite Hamas's offer being far from meeting Israel's crucial demands, Israel will send work crews to the mediators to maximize the possibility of reaching an agreement acceptable to Israel."}, {"id": "a9f60bbe-fe0d-40b0-af5d-1792566bb93f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26812/", "date": "2024-05-06 19:17", "message": "The IDF: IDF forces are now attacking and operating against targets of the terrorist organization Hamas in eastern Rafah.\n\nMore details to follow."}, {"id": "0b8e07ed-cac1-4163-8e81-3ded808d008a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26811/", "date": "2024-05-06 19:15", "message": "The Palestinians report that Israeli airplanes are conducting \"fire belt\" type air strikes in the in the eastern neighborhoods of Rafah."}, {"id": "e3889913-d5fe-4cf7-b3c4-50478135e59e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26810/", "date": "2024-05-06 19:11", "message": "Gaza channels:\n\nA surprise ground attack now in East Rafah.\n\n(Israeli - AA) tank movement under heavy artillery cover."}, {"id": "dffb9414-7413-4e05-8431-b71dc9cd50ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26809/", "date": "2024-05-06 19:01", "message": "Knesset MK Mansour Abbas: We will provide a safety net to any political party that formulates a ceasefire deal in Gaza. It is a moral obligation to end suffering that has lasted for 7 months.\n\nSource: Muhammad Majadala"}, {"id": "b81a3ea1-6e83-4335-90e4-f635d540bff6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26808/", "date": "2024-05-06 18:51", "message": "In the same breath, the question of disarming Hamas should also come up. This too as part of the agreement."}, {"id": "1209add4-c676-44ba-a1e1-fcc7d23a317c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26807/", "date": "2024-05-06 18:33", "message": "Against the background of Hamas's agreement - chants in praise of Muhammad Deif, the head of Hamas's military wing, in the square of the Shuhada al-Aqsa hospital in Deir al-Balah."}, {"id": "ab60d38d-59f6-4a5c-bdf2-173047a2d44e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26806/", "date": "2024-05-06 18:32", "message": "An important question to ask tonight:\nWhat does the ceasefire agreement say about the continued presence of Hamas in the Gaza Strip and its continued rule?\n\nWill senior Hamas officials finish their journey in the Strip and be deported or will they stay in the Strip and renew their control over the Strip?\n\nThis is a question that Israel should ask itself and also present this question to the Americans.\n\nIf the war ends before the second phase of the deal and before the release of all the abductees, what will happen to senior Hamas officials who are in the Strip?\n\nThis should appear in the agreement."}, {"id": "1e13fc29-8c26-4c8f-b509-55c208863995", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26805/", "date": "2024-05-06 18:30", "message": "Khalil al-Hayya, Yahya Sinwar's deputy, in an interview with Al Jazeera:\n\nWe agreed that there would be a temporary ceasefire in the first phase of the transaction, but before the start of the second phase of the transaction (which includes the release of the kidnapped IDF soldiers - AA) a permanent ceasefire would be announced.\n\nThe mediators promised that President Biden would be a clear guarantor of the implementation of the agreement."}, {"id": "14e24ed5-0fc5-4feb-9bdf-af7b2ad506f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26804/", "date": "2024-05-06 18:06", "message": "The solution to all these complications is transparency. Publish the proposals officially. This will prevent deals being made in the dark."}, {"id": "65bb4164-bc78-498d-a3b0-fceeffa21efb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26803/", "date": "2024-05-06 18:04", "message": "Hamas knows that its public announcement will direct all the international pressure from it towards the Israeli government. \n\nHamas knows that the announcement will create pressure on the Israeli government at home, just as the recent videos of the abductees did.\n\nThrough the announcement, Hamas hopes to neutralize the wheels of action in Rafah that have begun to move and stall the Israeli momentum."}, {"id": "7a25852d-653e-4cc0-9b88-10f5a4dd72ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26802/", "date": "2024-05-06 18:03", "message": "If you are confused about the issue of the agreement with Hamas, I will simplify the matter for you:\n\nThe root of the contention is the issue of a permanent ceasefire, or whether the fighting will resume after the hudna.\n\nIn the rest of the details there are no major disputes.\n\nHamas will not agree to sign an agreement that does not guarantee it a permanent ceasefire, and Israel will not agree to sign an agreement that will prevent it from resuming fighting after the hudna. It's one or the other.\n\nIn the middle are the USA, Qatar and Egypt who are trying, in my opinion, fraudulently, to find a way to say yes to both sides. There is a one and a zero here. If one side gets what it wants, the other doesn't.\nThe US is trying to guarantee Hamas behind Israel's back a permanent ceasefire, even though Israel is not ready for it. Hence the sensitivity created by Netanyahu's public statement yesterday regarding the continuation of the war. As a result, Hamas is not satisfied with the American guarantees... which conflict with the continuation of the war as Israel wants."}, {"id": "99ef318c-ef9d-4357-977f-00955c3b834a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26801/", "date": "2024-05-06 17:33", "message": "Viewer Warning:\n\nA video shows a number of Gazans falling from the top of a half-destroyed building as they try to release aid that was parachuted and got stuck on the building in western Gaza City.\nThe video was taken last Friday.\nAt least one person was killed in the incident. Several others were injured according to Palestinian reports."}, {"id": "a2221c1b-3442-4717-8faf-d549183120c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26800/", "date": "2024-05-06 17:30", "message": "My suggestion to the \"Israeli officials\": transparency!\n\nGet out from behind the curtain. Present to the public the proposal to which you agreed and present the proposal to which Hamas agreed.\n\nThe Israeli public has the right to see the details of a deal that will affect their future in the State of Israel and judge for themselves."}, {"id": "9db79144-f402-4297-abce-fffd4dec7333", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26800/", "date": "2024-05-06 17:30", "message": "The IDF's extensive attack this morning 👆 in al-Lwaiza area in southern Lebanon (in response to Hezbollah's drone attack) - it is possible to distinguish several shades of gray as a result of the Israeli attacks. Lebanese sources hint that strategic assets of Hezbollah were attacked there. The place is 45 km from the border with Israel."}, {"id": "b4356790-f3c9-4736-a837-2682fc3a0958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26794/", "date": "2024-05-06 17:27", "message": "Palestinian channels: Emad Al-Aufi, a Palestinian police officer, was killed by Israeli sniper fire during an IDF operation in the Tulkarm refugee camp today."}, {"id": "fb412499-a498-4b6c-8c2d-6501083e1246", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26793/", "date": "2024-05-06 17:24", "message": "An Israeli official told the IDF: This is a deception by Hamas - Hamas is trying to present us as refusing the deal, when this is not the deal we discussed with the Egyptians at all. No offer that Hamas agreed to - was presented to Israel"}, {"id": "15e27bf5-3e85-4e57-93df-dc35a96066d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26793/", "date": "2024-05-06 17:24", "message": "The Gazans are ecstatic."}, {"id": "a077ea6b-e51a-47b5-803d-c224f3251224", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26789/", "date": "2024-05-06 17:05", "message": "Against the backdrop of the announcement by Hamas of its agreement to a ceasefire, Gaza residents took to the streets to celebrate."}, {"id": "68ee5e37-226b-4ccc-8236-2927830f4021", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26788/", "date": "2024-05-06 16:54", "message": "If the pressure from the operation in Rafah did the job and made Hamas flexible, perhaps more pressure could improve the terms of the deal...\nThis is how negotiations are done in the Middle East. Under fire."}, {"id": "48c1b142-6d99-4667-aec9-030fbaa21359", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26787/", "date": "2024-05-06 16:54", "message": "Hamas is shifting the public and international pressure in Israel's direction.\nNow we have to wait to understand what exactly Hamas agreed to and what guarantees they received."}, {"id": "720a998d-a558-40f0-b589-badbf23e0f83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26786/", "date": "2024-05-06 16:53", "message": "The Hamas movement in an official announcement:\nIsmail Haniyeh, chairman of the political bureau of Hamas, called the Prime Minister of Qatar and the Egyptian Minister of Intelligence and informed them that Hamas accepts their proposal for a ceasefire."}, {"id": "b7349c01-425a-4fe7-80fd-1834753a794b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66159/", "date": "2024-05-06 16:53", "message": "Al Jazeera from a senior Hamas source:\nWe informed the mediators, the Qatari and the Egyptian, of our agreement to their proposal regarding a ceasefire."}, {"id": "f5030b30-aafb-4104-bb30-fa7ae5407465", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26784/", "date": "2024-05-06 16:33", "message": "Despite the report of \"Al-Arabi Al-Jadid\" 👆 Al-Qahara channel reports from an Egyptian source that a Hamas delegation is expected to return to Cairo tomorrow to complete the talks regarding a ceasefire.\n\n##\nSuch conflicting reports point to media spins. Meanwhile, there are no public statements by senior Hamas officials on the issue and they maintain ambiguity to allow Hamas room to maneuver."}, {"id": "a717d212-86b3-449a-982f-90a2df757c4d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26781/", "date": "2024-05-06 16:33", "message": "IDF activity in the Tulkarm refugee camp:\nThe Palestinians report that IDF forces blew up the house of Ashraf Nafe, a senior member of the Hamas military wing in Tulkarm, as well as a vehicle in which weapons were discovered.\nAttached are photos of the explosion of the building and the vehicle."}, {"id": "e802bd6b-6226-444a-bd68-0c2697d2544a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26780/", "date": "2024-05-06 16:10", "message": "Mahmoud Elhabash, advisor to the PA chairman in an interview with the Al-Arabiya network:\n\nHamas gave Israel all the justifications for it to go to war against Gaza.\n\nHamas is also responsible for what happened and what will happen in Rafah.\n\nHamas wants to stay in power more than it wants to release prisoners.\n\nThe innocent abductees in the Gaza Strip (meaning the residents of the Gaza Strip - AA) are paying the price for Hamas's adventures.\n\nHow does Hamas say it is ready militarily. We are a defenseless people."}, {"id": "d8d9fb8c-8649-430c-9ef7-b1ceb2649a6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26777/", "date": "2024-05-06 15:00", "message": "The senior officials of the Republican camp in the USA are against the Biden administration against the background of the report that the USA froze the shipment of weapons to Israel last week, during wartime.\n\nMike Pompeo, who was the secretary of state of the Trump administration, calls it: \"betrayal of an ally\".\n\nMike Pence, who was Trump's Vice President: this better not be true.\n\nMike Johnson, Speaker and Speaker of the US House of Representatives: This is wholly unacceptable. The administration should stop this immediately.\n\n##\nThe 3 Republican Mikes stand by Israel's side."}, {"id": "beaa082a-c0d0-40c3-8026-604858151aea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26776/", "date": "2024-05-06 14:58", "message": "Gazans on their way from Rafah towards Khan Yunis following the evacuation order of the IDF this morning.\nPalestinian reports of a significant evacuation movement since this morning."}, {"id": "1f20f486-a8a1-4d52-9d4e-d6669a9f60a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26775/", "date": "2024-05-06 14:58", "message": "\"Al Arabi Aljadid\" from a source in Hamas:\n\nAfter consulting with the opposition factions, Hamas decided to suspend the ceasefire talks.\nThe return of the Hamas delegation to Cairo will be postponed pending the results of the mediators' efforts.\n\n##\nIt is important to note that there is still no official announcement by Hamas about this."}, {"id": "bb67c831-6396-44f3-a520-ce70da7f8a6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26774/", "date": "2024-05-06 13:46", "message": "Resident of Gaza on Facebook:\n\n\"For two months they (the Israelis - AA) have been saying that there is a ready and organized evacuation plan for the evacuation of the citizens from Rafah - in the end the whole plan turned out to be a post on the Facebook page of the Coordinator of Government Activities in the Territories 😁\""}, {"id": "fc24d704-51da-46ec-8d84-128dfe09981e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26771/", "date": "2024-05-06 13:27", "message": "A reporter for the Lebanese Almanar channel (Hezbollah-affiliated) claims: an Israeli F15 fighter jet tried to intercept the Hezbollah UAV that eventually hit the target in Metula."}, {"id": "59480178-45a6-4078-b464-7826f1977aef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26770/", "date": "2024-05-06 13:24", "message": "Palestinian channels publish documentation of one of the IDF attacks in eastern Rafah a short time ago."}, {"id": "47dae7ab-9822-4f26-9b2e-e56ec1576caa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26769/", "date": "2024-05-06 13:23", "message": "The Houthis: We caught a spy network of the USA and the Zionist entity whose members watched over sites from which missiles are launched and were instructed to sabotage them."}, {"id": "37e255ac-3df7-4b79-801e-f19571a9d132", "channel_id": 1560386984, "url": "", "date": "2024-05-06 13:21", "message": "Residents of eastern Rafah are evacuating to the Khan Yunis area following the instructions of the IDF."}, {"id": "f0c98317-172c-4f45-8e89-3e6f0f84dcdf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:19", "message": "The Palestinians report IDF attacks a few hours ago in the eastern Rafah area."}, {"id": "7ddbf0c7-52a3-487c-b69a-3f593bccbb9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:18", "message": "Lebanese channels are publishing documentation of some of the 15 attacks carried out by the IDF in the last hour 👆 in al-Lwaiza area in southern Lebanon."}, {"id": "592f2bbb-0769-41b8-9258-7a35aaf7800b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26757/", "date": "2024-05-06 13:17", "message": "Hezbollah accepted responsibility for a suicide drone attack in the Metula area."}, {"id": "b9d7a3c9-77f1-44fc-9cae-2cacd884bc71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26756/", "date": "2024-05-06 13:16", "message": "IDF Spokesperson: Following the sirens that sounded in northern Israel regarding a hostile aircraft infiltration, a UAV was identified crossing from Lebanon into the area of Metula in northern Israel.\n\nMoreover, a short while ago, IDF fighter jets struck approximately 15 military structures and terror infrastructure located in a military compound belonging to Hezbollah's Radwan Force in the area of Al-Lwaiza in southern Lebanon."}, {"id": "8463ee7a-bdb0-451c-b9f2-4b3db2412b5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26755/", "date": "2024-05-06 13:07", "message": "The IDF spokesperson announced the fall of a fighter from the Nahal Brigade.\n\nHe fell together with 3 others yesterday as a result of the rockets fired at Kerem Shalom.\n\nMay his memory be a blessing."}, {"id": "13c0854d-7d0a-44fc-b3c8-bf5ee70b8322", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26754/", "date": "2024-05-06 13:07", "message": "Senior Hamas official Musa Abu Marzouk, in an interview with MBC:\nWe were not asked to leave Qatar. We are in Qatar according to the will of the USA which requested it from Qatar after we left Jordan.\n\nAbu Marzouk added in the interview - our victory is around the corner and we will dedicate it to the Egyptian president and Arab leaders."}, {"id": "369c5f8c-e803-40e1-99f2-75410683d943", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Movement of displaced persons from east Rafah to the Moasi area in Khan Yunis."}, {"id": "a16ea0b1-75d6-4ebf-a26d-b8c8de6b4fd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Assassination of Hezbollah senior Iyad al-Saleh yesterday in Hasakah, Syria👆:\nThe moment the luggage exploded in his luxury car."}, {"id": "eb781347-d9b6-4bfc-aa80-b5d8f6b631b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26748/", "date": "2024-05-06 13:02", "message": "The Embassy of the United Arab Emirates in Tel Aviv expresses its sorrow and sympathy on the occasion of the Remembrance Day of the Holocaust and Heroism. We will not forget the horrors of the past and we will work for a better future."}, {"id": "fc4887f6-e15b-4d90-bc23-c59cf10b3215", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26747/", "date": "2024-05-06 13:00", "message": "The Palestinian cellular company Jawwal announced \"service malfunctions\", without specifying a specific region earlier today."}, {"id": "ed4b6156-e709-42d8-8372-0795e0f48f81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26746/", "date": "2024-05-06 12:58", "message": "Hezbollah: This morning at 09:00 we attacked the Nafah base in the Golan with dozens of Katyushas in response to the IDF attack 👆"}, {"id": "4a042146-3d59-4121-8f7c-c51ea1961fd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26745/", "date": "2024-05-06 12:52", "message": "The Lebanese Al Mayadeen from a source in the \"Palestinian Resistance\":\n\nIn light of recent events and Israel's threat of action in Rafah, Hamas is inclined to stop the negotiations now.\nThe movement emphasizes that the threat of action in Rafah does not constitute pressure on it in conducting the negotiations."}, {"id": "a3e729b3-35d3-4aab-adf7-763bbbb1300a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26741/", "date": "2024-05-06 12:51", "message": "Passenger traffic this morning at the Rafah crossing - the Egyptians cannot give up an industry worth millions of dollars a month for \"coordinating exit from Gaza\"."}, {"id": "5afbfd5d-b582-42d6-a0cc-09cdeb6c29c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26740/", "date": "2024-05-06 12:49", "message": "The public relations officer of the Rafah crossing Wa'el Abu Mahsan: Civilian movement is still possible at the Rafah crossing (there is a passage for passengers and there is a passage for trucks and goods - apparently the goods passage is the one that is currently blocked - AA)."}, {"id": "ca880a03-af0e-4fac-88d4-f43bbd0dc33f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26739/", "date": "2024-05-06 12:48", "message": "In the announcements distributed by the IDF, the residents of Rafah were warned not to approach the eastern and southern border fences (the southern fence is the border with Egypt - this message is to help alleviate the Egyptians' fears of mobs at the border -AA)."}, {"id": "8cc7c291-51c5-4243-89c9-153e443c91ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26738/", "date": "2024-05-06 12:46", "message": "This has far-reaching consequences in regards to the entry of goods into the Strip as this is the main artery that was used throughout the months of the war."}, {"id": "99aa39db-f337-466f-a8db-0af04a7a0c01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26737/", "date": "2024-05-06 12:45", "message": "Palestinian reports about the closure of the Rafah crossing with concrete structures by the Egyptians."}, {"id": "b9686c20-d17a-450f-8dd7-82d38c6a35a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26736/", "date": "2024-05-06 06:32", "message": "Pay attention - according to Palestinian channels, the Rafah crossing is included in the area subject to evacuation..."}, {"id": "020c15c3-9e16-44b6-bb6f-f5e02129229e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26735/", "date": "2024-05-06 06:31", "message": "The Palestinians report that the IDF dropped leaflets over Rafah in the south of the Gaza Strip stating that the humanitarian area from the Moasi area in Khan Yunis has been expanded to the Deir al-Balah area in the center of the Gaza Strip, as shown on the attached map - where you can see the size of the previous area and its significant expansion (more than 2 times larger)."}, {"id": "39b1d993-0e7c-4efd-be6e-fbac67e1ec94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26734/", "date": "2024-05-06 06:30", "message": "Now, after the official announcement to evacuate Rafah, it is time to remember senior Hamas official Osama Hamdan's remarks from a few days ago 👆:\n\n\"If Israel takes action in Rafah, we will stop the negotiations. We will not negotiate under fire.\""}, {"id": "194f4485-55bf-4482-8c29-8ef7a68fabe9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26733/", "date": "2024-05-06 05:41", "message": "Italy: Students at the University of Bologna set up a \"Gaza camp\" on campus."}, {"id": "3321de03-ea35-45c9-94ab-827124b2f3e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26731/", "date": "2024-05-06 05:41", "message": "Lebanon: Lebanese media reports that around 01:30 AM the IDF attacked a \"plastic factory\" in the A-Safri area in Baalbek, deep in Lebanese territory.\n\nAccording to Lebanese sources, three civilians were slightly injured in the attack."}, {"id": "884e5705-e325-4061-bb07-ba23f7704cb0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26729/", "date": "2024-05-06 05:35", "message": "Shiite militias in Iraq claim that they attacked a target in Eilat and another target \"in the territory of Palestine\" using suicide drones.\n\nIn this context, the IDF spokesman published the following message this morning:\n\nLast night, Israeli fighter jets successfully intercepted an unmanned aircraft that made its way to Israeli territory from the east.\n\nThe drone was being monitored by IDF forces, did not pose a threat and no alerts were activated in accordance with policy. There were no casualties and no damage was caused.\n\n##\nAccording to past experience in most cases that the militias in Iraq do not specify the target of the attack in their announcement, it's a sign that the drone or missile didn't reach its target."}, {"id": "642e5bcb-c41c-48d9-87d3-efc672c0009b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26726/", "date": "2024-05-06 05:26", "message": "Palestinian channels report that the IDF attacked 12 targets in the Rafah district last night, including several attacks in the eastern neighborhoods of A-Salam and Jenineh, which are currently under evacuation.\n\nAccording to the Palestinians, over 20 casualties were recorded as a result of these series of attacks.\n\nThe attack on the eastern neighborhoods of Rafah and and evacuation from the area may help reduce short-range rocket fire towards assembly areas, such as the one we saw yesterday in Kerem Shalom."}, {"id": "2b452c9e-e70f-45f2-8230-3b7082b5a543", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26725/", "date": "2024-05-06 05:07", "message": "The evacuation of Rafah has begun\n\nThe IDF spokesman in Arabic calls on the residents of the eastern neighborhoods of Rafah, including the neighborhoods of A-Salam and Janineh, to evacuate to the Khan Yunis area - as seen in the attached video."}, {"id": "c58d3791-9e14-4410-af4c-b48bbcd3a6bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26724/", "date": "2024-05-05 21:37", "message": "I have no grand words to write to you for Holocaust Day.\n\nJust this: be good to each other. Look for what unites us. This is the secret of our strength. Together we can do anything. Against all of our enemies. This week, between Holocaust Day and Memorial Day, write only good things. No hate, no loathing. And if it's difficult then you can not write anything at all. It will only do you and all of us good."}, {"id": "0607054d-a2e5-42d4-89ff-c30972c455e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "The IDF spokesperson announced the fall of three fighters from the Givati ​​Brigade and the Nahal Brigade in today's event at Kerem Shalom.\n\nMay their memories be a blessing."}, {"id": "8aa18201-4c43-4611-af98-0eeae6d91105", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "University of California, UCLA:\nPro-Hamas trash removal."}, {"id": "fd797f17-1eb5-49cb-88a1-67a8608546ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26719/", "date": "2024-05-05 21:31", "message": "To comment, follow this link"}, {"id": "0b3a4e46-39c3-4e13-b14c-6d5e75e1d9df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26718/", "date": "2024-05-05 21:31", "message": "Senior Hamas official, Musa Abu Marzouk:\n\n\"The leaders of the occupation have already admitted defeat to Hamas and only Netanyahu is still insisting.\n\nThe positions of the American government are related to the interests of elections and therefore the government makes contradictory statements.\n\nOur demands are to stop the war, withdraw the occupation, restore the Gaza Strip, lift the blockade and deal with prisoners.\n\nThe opposition insists that there be a permanent ceasefire.\n\nAs far as we are concerned, the American guarantees cannot be trusted. We aim to add Russia, Turkey and China as guarantors.\""}, {"id": "1ea2ebc5-6e23-42a6-b4b4-4657d26283e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26717/", "date": "2024-05-05 20:33", "message": "Most of the dead in the attack on the school were Hamas policemen.\nThese are the names of five of them: Mahmoud Mudar, Abd a-Rahman Dardasawi, Ibrahim Shchada, Hossein Kwidar and Yasser Dib."}, {"id": "f84e23d8-3d9b-4d5d-92ed-87452260af90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26716/", "date": "2024-05-05 19:11", "message": "Following this report here 👆\n\nIDF Spokesperson: The IDF and ISA struck a Hamas command and control center located  in an UNRWA complex in central Gaza which served as a staging ground for multiple attacks against IDF troops and humanitarian efforts\n\nFollowing precise IDF and ISA intelligence, IAF fighter jets struck a Hamas command and control center in the central Gaza Strip which served as central terrorist infrastructure. The strike was carefully planned and carried out using precise munition in order to minimize harm to uninvolved civilians. \n\nThe command and control center was used as a staging ground for multiple attacks on IDF troops located in Gaza's central corridor in recent weeks. Furthermore, the forward operations base was used to carry out attacks on humanitarian efforts, which aims to increase the distribution of humanitarian aid to Gazan civilians.\n\nIn addition, Hamas oversaw the supply of weapons to dozens of Hamas terrorists from inside the command and control center, including those located and operating inside underground terror tunnels. \n\nHamas intentionally positioned the command and control position within the vicinity of an active UNRWA location, jeopardizing the Gazan civilians taking refuge there.\n\nThe Hamas terrorist organization systematically exploits the civilian population and institutions as human shields for their terrorist activities against the State of Israel.\n\nAs a result of the strike, the Hamas’ command and control center located in the UNRWA complex is no longer operational."}, {"id": "3826c255-cae3-41cf-8ef2-bd68359cd2a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26715/", "date": "2024-05-05 17:36", "message": "IDF: Over the last few hours, approximately 40 launches were identified crossing from Lebanon into Israeli territory, a number of which were intercepted. No injuries were reported. In response, the IDF struck the sources of the fire. \n\nA short while ago, IAF fighter jets struck Hezbollah military structures and terrorist infrastructure in the areas of Markaba, Kfarkela, and Odaisseh in southern Lebanon. In addition, this morning (Sunday), IAF fighter jets struck a military site in the area of Meiss El Jabal in southern Lebanon.\n\nFurthermore, IDF artillery struck in order to remove a threat in the area of Chebaa in southern Lebanon."}, {"id": "ad97cadb-0b8d-47cd-a0da-69fcd57c58a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26712/", "date": "2024-05-05 17:36", "message": "Syrian sources report that Iyad al-Saleh, a senior Hezbollah official responsible for recruiting volunteers to fight in the Hasakah area, in northeastern Syria, was killed as a result of an explosive device planted in his vehicle.\nThe vehicle exploded on Alkachaa street in the city of Hasakah inside a security compound under the control of Assad forces."}, {"id": "8f84d2ca-1fa5-4f22-ac2d-26d2e2db6f46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26711/", "date": "2024-05-05 17:32", "message": "The military wing of Hamas publishes documentation of the launch of \"Rajum\" rockets towards Kerem Shalom earlier today."}, {"id": "7be4c82a-d645-441d-8de2-dcb2efe07241", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26710/", "date": "2024-05-05 17:31", "message": "The Palestinians report 6 deaths in the attack on a Hamas police container at the Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "4fd17a35-8dfa-4c9e-8e2a-2206d5367455", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26709/", "date": "2024-05-05 17:29", "message": "Hamas senior Osama Hamdan:\n\nThe operation (rocket attack this morning -AA) in Kerem Shalom is a message from Hamas's military arm to the occupation that the consequences of any adventure carried out by his army will be different from what he imagines."}, {"id": "58b25dcd-b01e-4220-a1ca-e1a6a75b5fb6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26708/", "date": "2024-05-05 17:28", "message": "Reuters: The head of the CIA left Qatar (Cairo) due to the fact that the talks regarding Gaza are facing collapse.\n\n##\nI wonder if he took the same flight as the Hamas delegation from Cairo to Doha..."}, {"id": "88afbfa8-1af3-4926-a5d0-ee0ab8f5e796", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26707/", "date": "2024-05-05 17:28", "message": "Documentation of the moments of the attack on the home of the Shatiwi family near the Rafah crossing (after an evacuation alert)."}, {"id": "38a9fdc5-b017-4725-b53e-1877d09ca66f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26706/", "date": "2024-05-05 17:25", "message": "The Palestinians report 6 deaths from among members of the Almasri and Elatar families in an attack on a house in the Yabna camp in Rafah earlier today (the house belongs to the Elatar family)."}, {"id": "cd8b17e6-4ea3-4e2c-8842-acb135e303a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26705/", "date": "2024-05-05 17:22", "message": "Hamas: We gave our answer to the proposal to the mediators."}, {"id": "e4df64b2-521b-46da-800e-629b5de2cf2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26704/", "date": "2024-05-05 17:18", "message": "Al Jazeera from a senior Hamas source:\nThe movement delegation left Cairo for consultations after two days of talks."}, {"id": "eaa06215-40a8-4478-bb10-e44963732aa0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26703/", "date": "2024-05-05 17:18", "message": "Several attacks in the last few hours in Rafah, usually on agricultural lands or houses that received an evacuation notice in advance. The Palestinians report one death.\nThe home of the Shatiwi family (the attached video) near the Rafah crossing was attacked."}, {"id": "e26ce3bc-d0b3-486f-bb79-988759ec1ec9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26702/", "date": "2024-05-05 13:48", "message": "Hezbollah in an official announcement:\n\nWe launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal in which civilians were killed and wounded.\n\n##\nIsraeli media report 65 rockets fired from southern Lebanon towards Israel in the last volley."}, {"id": "ac8ced5c-d43d-4303-891b-8c948b593520", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26701/", "date": "2024-05-05 13:25", "message": "A Gazan with a popular Facebook account:\n\nNetanyahu had two problems:\n\nThe first - he failed to find justification before the world for military action in Rafah.\nThe second - he could not find a justification for preventing the entry of goods into the Strip.\n\nHow did Hamas solve two problems for him at once?\nLaunch rockets from Rafah towards the crossing that brings in the goods..."}, {"id": "2bc1802b-d9f8-4a8c-90da-34c44eefef89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26700/", "date": "2024-05-05 12:59", "message": "The IDF: The Kerem Shalom crossing has been closed to truck crossing.\n\n##\nHamas bites the hand that feeds them and shoot at the place that brings them goods.\n\nThe Palestinians report air force attacks in the al-Salam neighborhood in East Rafah."}, {"id": "fc5d3ea2-7813-4e8c-b8e7-be13a2dc4562", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26699/", "date": "2024-05-05 12:57", "message": "Channels identified by Fatah:\n\nThe firing of Hamas from Rafah towards Kerem Shalom gave Israel justification for the action in Rafah, saved them, and gave them a way out in the eyes of the whole world. How stupid is Hamas."}, {"id": "e53e8d0b-dae3-4aef-9b83-e07c9d025fa8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26698/", "date": "2024-05-05 12:56", "message": "Israeli media reports on Israeli casualties in Kerem Shalom as a result of falling explosives.\n\nAt 13:41, the military wing of Hamas accepted responsibility for launching short-range rockets of the \"Rajum\" type with a diameter of 114 mm towards assembly areas in Kerem Shalom.\n\n##\nKerem Shalom is very close to Rafah."}, {"id": "ecb1143f-30bf-472d-b711-91acf14abfe3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26697/", "date": "2024-05-05 12:19", "message": "Hamas in an official announcement:\n\n\"We strongly condemn the decision of the criminal Netanyahu and his Nazi government to close the offices of the Al-Jazeera network.\""}, {"id": "37b206af-ea42-44f2-8300-8303f19fa291", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26696/", "date": "2024-05-05 11:30", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas:\n\nWe conducted negotiations in a positive and flexible spirit. The movement's priority is to stop the aggression. This is essential and logical.\nWhat does the agreement mean if a ceasefire is not its first stage?"}, {"id": "1304f3ee-d1d3-4d49-9054-29f84dab7277", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26695/", "date": "2024-05-05 11:10", "message": "From Israeli Prime Minister Netanyahu's statement, a short time ago:\n\n\"...Surrendering to the demands of Hamas would be a terrible defeat for the State of Israel.\nIt will be a huge victory for Hamas, for Iran, for the entire \"axis of evil\".\nIt will project a terrible weakness - both to our allies and to our enemies.\nAnd this weakness will only bring the next war closer, and it will push the next peace agreement further away. Because alliances are not made with the weak and defeated, alliances are made with the strong and victorious.\n\nTherefore, Israel will not agree to Hamas's demands, which mean surrender, and will continue fighting until all its goals are achieved.\"\n\n###\nNetanyahu announces in his voice publicly: the fighting will continue.\n\nNow we wait to see how Hamas reacts to this, and how this statement will affect the talks in Cairo."}, {"id": "03e13703-3e2d-4362-887d-aa8873debd53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26694/", "date": "2024-05-05 11:08", "message": "Lebanese channels: The number of civilians killed in the IDF attack in Meiss Ej Jabal in southern Lebanon has risen to four. The four are reportedly members of the same family (father, mother and their two children).\n\nHezbollah in an official announcement:\nWe attacked Kiryat Shmona with dozens of Katyusha and Flak type rockets, in response to the killing and wounding of the civilians in  Meiss Ej Jabal.\n\nIsrael's Magen David Adom reports that a 65-year-old man was lightly injured from the rocket fire, and that an ambulance was also damaged."}, {"id": "b3b50b4f-2373-42b1-b165-5d59ea93db72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26693/", "date": "2024-05-05 11:04", "message": "Al-Jazeera reports that its offices in Israel have just been closed:\n\nFinally, the Israeli government decided to shut down the Al-Jazeera's offices in Israel - a propaganda channel, owned by the rulers of Qatar, masquerading as a legitimate news network.\n\nGood riddance..."}, {"id": "1e5830d6-6a41-4fd7-b4ae-578499c3d58c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26692/", "date": "2024-05-05 11:01", "message": "Israel Police publishes CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n\nNo officers were injured in the incident, and neither was the Palestinian woman.\n\n##\nI wonder how this situation would've ended for the woman in any of the Arab or Western countries..."}, {"id": "0f2d7fab-d68f-4c18-a2bd-e592f1bd4df5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26691/", "date": "2024-05-05 08:32", "message": "Lebanese sources update that three people were killed in the latest attack on Meiss Ej Jabal 👆, and report that another person was injured."}, {"id": "59e3bc41-5e50-41a5-b3be-0962974dc37a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost."}, {"id": "a9f68a17-3a53-497d-9221-4c2b88563130", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago."}, {"id": "6cc2b233-180d-452c-8200-e0ba2c66a32a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning."}, {"id": "42e9ec44-5c53-4dd3-ab04-72096ee8e2f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this."}, {"id": "4d4596f7-255b-4d1b-91f5-d7e49070410a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile."}, {"id": "ef21f9a1-4071-47c7-acca-df419b86365c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle..."}, {"id": "c4396965-5e4d-4ce6-914b-c2cf9f2319ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26684/", "date": "2024-05-05 07:55", "message": "A senior Hamas official told the American CBS network about the negotiations in Cairo:\n\nNo progress was made in the current round of talks on Saturday.\nAnother round will be held on Sunday (today).\n\n###\nAccording to Al-Arabiya, Hamas requested an additional period of time to examine some of the clauses before giving its final answer to the proposal."}, {"id": "d00ee5c3-f4fa-4109-824c-b6414871d8e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Tzion Macales points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah..."}, {"id": "a1d88286-f05d-4ed1-9f54-229e983a3d50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations."}, {"id": "9551fe92-4214-4a1b-8bfd-cf2d90db7eb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26680/", "date": "2024-05-04 22:02", "message": "A photo that caught on among Gazans on Facebook... The Chief of Staff at a table on the beach of Gaza.\n\nA prominent Gazans asked: Where are the Al Jazeera experts who will give an interpretation of the picture?"}]