[{"id": "e7038a7f-5531-4283-b097-531d2c86e3eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32070/", "date": "2024-08-07 19:57", "message": "Iranian bloggers who are affiliated with the regime and are involved in the military field, attach greater importance than usual to the NOTAM message of the Egyptian Civil Aviation Authority regarding flight bans in Iranian skies between four and seven o'clock in the morning (Israel time) tomorrow."}, {"id": "65c431e9-bd30-4757-b3c5-1f54d221eeeb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32065/", "date": "2024-08-07 19:25", "message": "The Houthis are drowning: floods in Hodeidah\n\nLoss of life and great property damage following torrential rains that caused floods in the last day in Hodeidah province in Yemen, which is controlled by the Houthis.\n\nAccording to initial estimates, about 45 people were killed and many more are missing. Many houses were destroyed."}, {"id": "6479b344-e182-4407-8b6a-9e12156c0fc9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32064/", "date": "2024-08-07 18:42", "message": "Yesterday the Palestinian Ministry of Health in Gaza published information on approximately 32,000 of the approximately 39,000 dead in the Strip.\n\nAccording to the updated data, about 32.9% of the dead are children, 18.5% are women, about 8.6% are elderly and about 40% are men aged 18-59.\n\nI will mention in this context that in the last two weeks, the Palestinian Ministry of Health in Gaza admitted that it had updated the ages of some of the dead who had moved from the category of adults to the category of children....\nThey explain this \"miracle\" by saying that some of the \"men - children\" were killed a long time before they arrived at the hospital, where they were registered as dead over the age of 18. That is, according to them, those dead were killed shortly before the age of 18 and arrived at the hospital after they would have turned 18, so they should be registered as children in the updated database."}, {"id": "c7302a12-f845-45b5-a0a6-9d2570471464", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32063/", "date": "2024-08-07 18:15", "message": "The impact of Yahya Sinwar's appointment as Hamas Political Bureau Chief on the ongoing war\n\nAs someone who has closely followed Yahya Sinwar for many years, I believe Sinwar is far more competent than Ismail Haniyeh in every aspect. In my view, even in his previous role as the leader of Hamas in Gaza, Sinwar surpassed Haniyeh in skills and ambitions. Haniyeh was more of a symbolic leader than the actual \"President of Hamas.\" Sinwar has always been more dominant, sharper, more ambitious, saw further and aimed higher... perhaps too high. Sinwar believes that he can achieve things others think are imaginary or impossible - this is largely how, in collaboration with Mohammed Deif, the ambitious plan for the October 7th massacre was conceived. To implement such a plan, to think of it in the first place, one needs to be an extraordinary person, with sophisticated and exceptional thinking, great courage, insensitivity, and a certain degree of madness - all of which Sinwar possesses. Haniyeh, less so.\n\nLast night, I wrote that I think the move to appoint Sinwar as the head of Hamas's Political Bureau brings us one step closer to ending the war. Let me explain.\n\nFirst, one of the main goals of this move, in my view, is to relieve the pressure on Qatar. The Americans exerted significant pressure on the Qataris, who host the Hamas leadership abroad, to pressure Hamas into agreeing to a hostage deal. This current move neutralizes the American pressure on Qatar - the decision-making center has now entirely shifted to the Gaza Strip. This also eliminates the need for \"back and forth\" on important decisions regarding the war between Hamas leaders abroad and those inside the Gaza Strip. \n\nThe Gaza chapter of Hamas is now making the decisions, and the \"full responsibility\" lies on its shoulders. Effectively, Yahya Sinwar is the Gaza chapter, and he is now responsible for managing the war. To a large extent, the \"keys to ending the war\" lie within a small area, easily accessible to Israel and under constant physical Israeli pressure.\n\nIn my opinion, Hamas has taken an \"all in\" approach regarding the war and what is happening in Gaza, while isolating the territory (of the Gaza Strip). Gaza's fate is now in its own hands. I am convinced that Hamas leaders considered the realistic possibility of Yahya Sinwar being eliminated in Gaza when they unanimously decided to appoint him. \n\nPerhaps, in their eyes, such an event could allow them to embark on a new path, retreating from positions Hamas is currently stuck in. Positions that do not allow for the end of the fighting.\n\nThis could close the chapter of October 7th, a product of the Gaza Strip designed by Yahya Sinwar and Mohammed Deif, and could end in Gaza when those who conceived it meet their fate there. It would allow Hamas to place all of the responsibility onto the architects of the attack and change the course of the movement's future once they are both out of the picture. In such a case, Sinwar and Deif would take with them to the grave the responsibility for the events of October 7th, for better or worse, from Hamas's perspective. There is a poetic justice in this.\n\nThis dramatic change is a result of the assassination of Haniyeh in Tehran, which that could not have occurred in Qatar due to the American protection that Qatar enjoys. The cards have been reshuffled, and now there is an opportunity to break the deadlock."}, {"id": "f44a00ae-4952-4b67-98c0-c0ce6621646e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32062/", "date": "2024-08-07 17:51", "message": "Jordan's Minister of Information and Communications in an interview with the New York Times:\n\n\"We have informed Tehran that we will not allow the use of our airspace for any purpose.\""}, {"id": "6c949b9c-b1a1-4068-98a1-f318264ef763", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32061/", "date": "2024-08-07 17:06", "message": "Further to the publication here👆, the Lebanese journalist Dima Sadek continues to sting Nasrallah:\n\n(The war) is not so that we will pray in Jerusalem? 🤔\n\n##\n(On all the posters of the Hezbollah victims it is written that they are \"martyrs on the way to Jerusalem\"...)"}, {"id": "1fc138be-1834-41e9-8255-2cc5eea2cda3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 15:30", "message": "Hezbollah announces a death in its ranks:\n\nHassan Jeshi from the village of Jouaiyya \n\nHe was killed in an IDF attack this morning on his motorcycle 👆\n\nAccording to the IDF spokesman, he was a commander in the field of anti-tank missiles.\n\nNumber 401"}, {"id": "9f107ec7-7837-45c7-bfd1-42a82aa9c6d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 15:22", "message": "At Abu Hajab's funeral, there was a lot of shooting in the air by the Jenin terrorists, as usual.\nAt the end of the attached video, the participants shout that someone has been hurt...\n\nIt was Samer Satiti, who was wounded by the shooting at the funeral and... also died of his wounds..."}, {"id": "1d0286f5-d3d8-47e4-a89d-e59f126ca597", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72807/", "date": "2024-08-07 15:20", "message": "This is the terrorist Mohammad Abu Hajab from Jenin.\n\nHe was injured yesterday in the IDF drone attack in Jenin.\nThis morning he died of his wounds.\nAs befits a respected terrorist, a well-attended funeral was held for him today in Jenin 👇"}, {"id": "1fdd9826-dd2d-44a7-9120-63e9cee6b989", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32054/", "date": "2024-08-07 15:17", "message": "Northeast Syria: The Arab tribes are approaching al-Omar oil field, where American forces are located.\n\nThe rapid advance of the Arab tribes in Deir ez-Zur today, at the expense of the Kurds, should be very troubling to the Americans.\nThe Arab tribes are within touching distance of a strategic point - the Omar oil field (marked with a red circle on the map, inside the yellow area controlled, for the time being, by the Kurds, who are supported by the Americans).\nRed asterisks mark villages that, according to claims by Syrian sources, are from the Assad regime, and were captured this morning by the Arab tribes.\nThe attached video shows the refining facilities of the Omar oil field - documented by one of the Arab tribesmen.\n\nThe Americans should intervene."}, {"id": "0f6eb160-e566-4350-84f3-3bb4ca093c29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32051/", "date": "2024-08-07 15:13", "message": "The Ukrainian army launched an attack in Kursk, 15 km deep in Russia.\nThe Ukrainian vehicles are advancing with protective structures against drones."}, {"id": "ef1a8b47-7c2a-4ae0-92bb-5ea62bdcc189", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 15:11", "message": "Gazans in the central camps taking the fruits and vegetables from the supply trucks that make their way to their brothers in the north of the Gaza Strip."}, {"id": "5630fa98-bc4f-47eb-9046-c8a34884af5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32047/", "date": "2024-08-07 13:20", "message": "Jordan: A grandson was born to King Abdullah of Jordan from his son, the heir to the throne.\nThe crown prince and his wife left the hospital today after the birth."}, {"id": "c3992c44-f869-4798-b7d9-c242b2028c18", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72807/", "date": "2024-08-07 13:16", "message": "Hassan Jeshi and the hookah in better days..."}, {"id": "0cea6735-de9c-4cfd-a7db-0407871efeae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 13:16", "message": "IDF: The IAF struck in the area of Jouaiyya, southern Lebanon, and eliminated the Hezbollah terrorist Hassan Fares Jeshi, who operated as a commander in Hezbollah's anti-tank missile unit. \n\nFurthermore, earlier today, the IAF struck Hezbollah military structures in the area of Aitaroun. Moreover, IDF artillery struck areas in southern Lebanon in order to remove a threat."}, {"id": "033214cb-e614-4c95-b75e-515662536078", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 13:14", "message": "Lebanon: A video call on the Internet, between two Lebanese women, during which the air force planes break the speed of sound... the one on the left encounters it for the first time..."}, {"id": "8afc5924-dbf8-45f4-bae1-5baa0c4a0b26", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32041/", "date": "2024-08-07 12:28", "message": "IDF spokesman: A weapons warehouse in Nablus was destroyed.\n\nThis appears to be the headquarters of the Fatah movement in the Balata refugee camp in Nablus 👆"}, {"id": "3e5a9a35-1f83-427a-a355-e1a649529955", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32047/", "date": "2024-08-07 12:26", "message": "##\nBeyond that, I will note that Palestinian media and channels refer to all Israelis as rapists مغتصبون in the context of \"land occupation\" - the Israelis according to their ideology are raping the Palestinian lands - this is a deep-rooted expression in Palestinian society.\n\nThe towns and cities in Israel are often referred to as rapists مغتصبات - \"towns that rape the Palestinian land\"\n\nThe root of the word, غصب, has a significant place within several aspects of the Israeli-Palestinian conflict. It is important to internalize this and act from the understanding of how it is perceived on the other side."}, {"id": "a87718ba-2d43-4fb2-8258-6f5514aef450", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32060/", "date": "2024-08-07 12:26", "message": "The video that was leaked last night to Channel 12, with the accompanying text of the reporter, is resonating widely in Palestinian and Arab media and on various channels with the caption:\n\nجريمة مروعة أمام الكاميرات... جنود الاحتلال يغتصبون أسيراً فلسطينياً في سجن \"سديه تيمان\"\n\n\"A despicable crime before the eyes of the cameras... occupation soldiers rape a Palestinian prisoner in Sde Teiman prison.\"\n\n##\nThis, in my opinion, has far-reaching consequences for the Palestinian argument regarding the denial of the acts of rape committed by Hamas terrorists on October 7.\n\nI will explain: here Israel distributes visual documentation of what the reporter claims are acts of rape but does not distribute documentation of its claims regarding acts of rape by Hamas terrorists on October 7th.\nThis arms the deniers of the atrocities of October 7th.\n\nThis is how it is perceived..."}, {"id": "c3e20e0e-4c8d-489f-b6e9-3e2df291e5f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72788/", "date": "2024-08-07 12:07", "message": "The two dead in the Israeli drone attack in the village of Jouaiyya in southern Lebanon are: Muhammad Shoumar and Hassan Jeshi.\nAppear to be Hezbollah operatives."}, {"id": "fc8e8680-1a98-4263-81cf-3e64f83fceb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72796/", "date": "2024-08-07 11:24", "message": "American fighter jets fly over the skies of the battle zones between the Arab tribes and the Kurdish forces in Deir ez-Zur in northeastern Syria."}, {"id": "3fd80760-db23-46e7-9793-dcb255b9a3d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32035/", "date": "2024-08-07 11:24", "message": "Syria for advanced: Syrian sources report that this morning the Arab tribes in the Deir ez-Zur district in northeastern Syria launched an attack on villages, on the contact line, controlled by the Kurds supported by the US (the yellow area on the map is the area controlled by the Kurds).\nThe occupation of several villages on the line of contact and the approach of the Arab tribes to the areas where the US maintains military bases was reported.\nAccording to Syrian sources, the Americans are diverting forces from the base in the Shaddadi region to the area in order to help the Kurds and to keep away the danger of occupation by the Arab tribes in Deir ez-Zur."}, {"id": "6bce6c72-2c15-4ac3-a65f-0c82067f752b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32047/", "date": "2024-08-07 11:19", "message": "The Lebanese Ministry of Health: one dead and four injured in the Israeli drone attack in the village of Jouaiyya in southern Lebanon."}, {"id": "676780dc-eaed-431b-bded-52f17af5b4c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72784/", "date": "2024-08-07 11:18", "message": "Demolition of the illegal buildings in Umm Batin in the Negev has begun."}, {"id": "1b76b556-3bb6-4085-9aa3-7a8fffd94493", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32032/", "date": "2024-08-07 10:50", "message": "Lebanese channels report an attack on a vehicle by an Israeli drone a short time ago in the village of Jouaiyya in southern Lebanon."}, {"id": "a100b305-5ce0-4b4e-9228-b6e92380430f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32031/", "date": "2024-08-07 10:49", "message": "Lebanese channels claim that an American cargo plane that took off from the American airbase in Qatar landed with ammunition at the military airport in Nevatim."}, {"id": "ef165948-3282-4798-88b4-63fb00beb999", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32030/", "date": "2024-08-07 10:48", "message": "Two of the 6 members of the \"Squad\" were replaced, within the Democratic Party's primaries, by supporters of Israel."}, {"id": "54ee7909-79ae-433a-ad3f-435c7570faaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32029/", "date": "2024-08-07 10:47", "message": "Cori Bush, a member of the US Democratic Party's \"squad\" (an extreme group of anti-Israel Democratic congress memebers), lost today in the Missouri primary to Wesley Bell, who is supported by AIPAC."}, {"id": "a5c2858c-c28c-4e68-bd78-ba2ea21a7710", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32028/", "date": "2024-08-07 10:16", "message": "Further to this attack 👆 yesterday\n\nIDF Spokesperson: Hamas and Islamic Jihad Weapons Production Facility embedded in the Humanitarian Area in Deir al-Balah Struck by the IAF\n\nYesterday (Tuesday), following precise IDF and ISA intelligence, a Hamas and Islamic Jihad weapons production facility embedded inside the Humanitarian Area in Deir al Balah was struck by the IAF. Prior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence."}, {"id": "974e2ff4-64eb-42fa-8c6c-f79d9d6277c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32024/", "date": "2024-08-07 10:08", "message": "More of what is happening today in Umm Batin in the Negev..."}, {"id": "7e9addd0-6766-4c77-9066-c078d5c47cd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32023/", "date": "2024-08-07 10:05", "message": "Palestinian channels identified with Hamas report that the Palestinian Authority's security mechanisms neutralized explosive devices they located in the \"Al'ein\" refugee camp in Nablus."}, {"id": "a65a105e-7e7e-4b25-83bc-c7e4aeb62f2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32022/", "date": "2024-08-07 09:57", "message": "Lebanese channels report that Israeli fighter jets break the speed of sound over the skies of southern Lebanon.\n\nIt certainly bothers and scares the Lebanese - Nasrallah yesterday in his speech also addressed the issue of the intimidation it causes to the citizens of Lebanon."}, {"id": "fee1e921-9cbc-4574-a26d-cc283fe545dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32019/", "date": "2024-08-07 09:56", "message": "Acting Iranian Foreign Minister, landed a short time ago in Jeddah, Saudi Arabia, to participate in a special gathering of the Organization of Islamic Cooperation."}, {"id": "5791fbab-9527-4dc4-8cab-09a83644ad20", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32018/", "date": "2024-08-07 09:54", "message": "Acting Iranian Foreign Minister in a conversation with his British counterpart:\n\n\"The continued aggression of the Zionist entity on Lebanon and Palestine alongside the elimination of Haniyeh in Tehran is the only reason for the security upheaval in the region.\""}, {"id": "8acee745-4ceb-4bba-a466-d954e37add95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32017/", "date": "2024-08-07 09:42", "message": "The protests in Bangladesh\n\nFollowing the protests that led to the overthrow of the government and the exile of the Prime Minister of Bangladesh to India - rioters broke into the National Zoo of Bangladesh in an attempt to catch animals and take them home...\n\n##\nSome people steal from convenience stores, and then there are those who go straight to a zoo..."}, {"id": "36ac228a-aa82-4aa1-8e90-bc13ad97e9ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32017/", "date": "2024-08-07 09:42", "message": "IDF Spokesperson:\n\nThe IDF has located and destroyed the launch sites that were positioned near UNRWA humanitarian aid warehouses.\n\nThese sites were identified as the source of recent launches towards the Lachish area and the surrounding communities."}, {"id": "9614e3fe-0c5d-4f9d-b7dc-a74185982b76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32012/", "date": "2024-08-07 09:06", "message": "Additional photos from Umm Batin."}, {"id": "685c37db-65ea-455c-a789-1ffbadc94afa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32011/", "date": "2024-08-07 08:47", "message": "Umm Batin, southern Israel: Israeli police forces enter the Bedouin village ahead of the demolition of illegally-built houses."}, {"id": "54c577c1-3cea-4d20-ae8a-ba059dc8a885", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32010/", "date": "2024-08-07 08:45", "message": "A historical photo from a Hamas delegation visit to Tehran.\n\n\nIn the picture:\n1. Qasem Soleimani, commander of the Quds Force of the Iranian Revolutionary Guards, who was killed by the Trump administration in 2020.\n\n2. Ismail Haniyeh, former head of Hamas’s political bureau, who was killed in Tehran.\n\n3. Yahya Sinwar, the new head of Hamas’s political bureau.\n\n4. Rouhi Mushtah, a member of Hamas’s political bureau and Sinwar's right-hand man, who was reportedly killed in Gaza this week."}, {"id": "b032845e-7be9-413b-91c6-1c9e14368655", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32008/", "date": "2024-08-07 08:33", "message": "The Lebanese al-Akhbar newspaper, affiliated with the Shiite Axis, reports that Turkey and Egypt are negotiating a military procurement deal under which Turkey will supply Egypt with Turkish-made Bayraktar-type drones.\n\nThis report comes after the Turkish Foreign Minister's visit to Egypt and the Sinai Peninsula, as well as an anticipated visit by the Egyptian President to Turkey."}, {"id": "5cced404-5aed-4892-bef0-0afb86c138c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32005/", "date": "2024-08-07 07:11", "message": "It seems that there is also a lot of action on the Tehran-Moscow air line...\n\nThanks to follower S."}, {"id": "f70a1676-3f05-4236-9188-296b82d6cc9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32004/", "date": "2024-08-07 07:11", "message": "Member of Knesset Waleed Alhwashla from the Ra'am party came to support the residents of Umm Batin in the Negev, who are burning tires to prevent illegal building destruction operations that are planned for today."}, {"id": "8b0420da-71c6-4d69-b5e9-fa0dd04104db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32003/", "date": "2024-08-07 06:48", "message": "The Lebanese (Shiite) journalist, Dima Sadek (a prominent critic of Hezbollah) mocks a line from Nasrallah's speech yesterday in which he said: \"This is not the campaign to destroy Israel. Our goal is to prevent Israel from winning.\"\n\nDima writes: If after committing the genocide in Gaza, killing 50,000 Palestinians, killing Muhammad Deif, killing Haniyeh and the most important military commander in Hezbollah, attacking Tehran, attacking Dahieh and causing the evacuation of the residents of southern Lebanon, and this is still not the campaign to eliminate Israel, then when will this campaign start?\n\n##\nYou have to admit that the list of Israel's achievements looks really impressive when Dima describes it...\nThis certainly indicates the strength and achievements of Israel in the eyes of some of the spectators in the stands of the Middle East. Dima is saying here that the king of Lebanon is naked..."}, {"id": "501e7458-94dd-4871-8384-77a88b5042fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32002/", "date": "2024-08-07 05:57", "message": "Shortly after midnight, the IDF spokesman issued an evacuation notice in Arabic for Gazans who are in Beit Hanoun, Sheikh Zayed and Almanshiya in the northern Gaza Strip.\nThis follows the firing of rockets yesterday evening from the north of the Gaza Strip towards Ashkelon.\n\nIn the meantime, I have not come across photos and videos of population evacuations on social networks.\nIt seems that the effect of evacuation notices has worn off a bit, especially when it is not accompanied by significant military action."}, {"id": "7da4cc53-06db-4231-a358-eed30e589a8d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32000/", "date": "2024-08-07 05:56", "message": "Rabih Al-Anbusi \"the ghost\" of the Tubas Battalion (Islamic Jihad):\n\nHow it started\nHow it ended\n\nThe explanation courtesy of the IDF spokesman (yesterday evening):\n\nAn IDF force from Unit 636, which carried out a proactive activity near the settlement of Beka'ot in the Bekaa and Emekim Division, eliminated an armed terrorist who tried to carry out a shooting attack a short time ago. There are no casualties to our forces."}, {"id": "e900c331-2d53-46c4-a592-1d28c8366b6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32002/", "date": "2024-08-07 05:52", "message": "Hamas-identified channels publish satellite footage of the area near the Ibn Taymiyya mosque in the Brazil neighborhood of Rafah (south of the Gaza Strip) - before and after.\nThe pictures speak for themselves.\n\nمسحوها مسح."}, {"id": "39935e3f-fb69-4942-9fa0-c50e8d1d5fa2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32000/", "date": "2024-08-07 05:43", "message": "Yemen: Media outlets affiliated with the Shia axis report that American and British warplanes attacked Houthi targets in the Taizz district south of the capital Sana'a early in the morning."}, {"id": "779b38f8-dd4d-4847-8fac-3d31e398ed5f", "channel_id": 1560386984, "url": "", "date": "2024-08-07 05:42", "message": "Documentation of some of the landings of the American F22 planes in the British military field Lakenheath"}, {"id": "0b5daea5-cd5e-4e32-a0d8-eb5837dcf1ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31993/", "date": "2024-08-07 05:36", "message": "The US Airlift to the region continues\n\nReports of a large number of American cargo flights from the military base in Alaska towards the Middle East, apparently to the American air base in Qatar.\nForeign media also report on 12 American F-18 A fighter jets that arrived in \"one of the countries of the region\" in the past day.\n\nIn addition, 6 American F-22 aircraft were observed landing at a British military airport, as an intermediate stop before their arrival in the Middle East.\n\nimpressive."}, {"id": "3fcf080b-732b-4511-899d-e16ebdc19bab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31990/", "date": "2024-08-07 05:35", "message": "The Palestinians report that Israel blew up the headquarters of the Fatah movement in the Balata refugee camp in Nablus early this morning, after an operation in the camp."}, {"id": "42ed6510-2765-4c5e-88e0-f214b4defb64", "channel_id": 1560386984, "url": "", "date": "2024-08-07 05:24", "message": "Sidon, Lebanon: A motorcycle procession following the election of Sinwar as chairman of the political bureau of Hamas."}, {"id": "349023a8-37e7-470e-9fd0-07d2299765c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31987/", "date": "2024-08-07 05:24", "message": "Congratulations are pouring in from all over the Middle East on the occasion of the appointment of Yahya Sinwar, Abu Ibrahim, as the chairman of the political bureau of Hamas.\nHezbollah, the Islamic Jihad, the Palestinian factions and more and more all congratulate him on the occasion of the appointment.\n\nSinwar has not been seen in public since the outbreak of the war...\n\nIn the photos - Yahya Sinwar as a young man."}]