[{"id": "d336a347-cc2a-4acc-89bc-e87cfecde8f8", "channel_id": 1560386984, "url": "", "date": "2024-08-27 14:42", "message": "Israeli Channel 12 reporter Mohammad Majadleh writes on his Telegram channel in Arabic: \"The Israeli army is increasing its military activity in the area of the tunnel where Qaid (the abductee) was found, thinking that there are other Israeli abductees there.\"\n\n##\nIn his latest update, the IDF spokesman emphasized that no information about the operation should be disclosed because it could endanger additional abductees as well as the IDF forces currently operating in the field."}, {"id": "4a976cb6-b560-41cb-9c3c-162c80dede49", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33212/", "date": "2024-08-27 14:38", "message": "IDF spokesman:\n\nDocumentation of the rescue of Qaid Farhan from the Gaza Strip by IDF fighters"}, {"id": "664eedd2-4fde-4ecd-8749-db1bba4eea93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33211/", "date": "2024-08-27 14:33", "message": "Not surprisingly, Hamas completely ignores the release of Qaid Farhan Alkadi.\nThe channels associated with it do not mention anything about this explosive news except for one channel - \"a-Rasala\" which laconically reports that the Israeli army announced the release of a prisoner from Gaza.\n\nThe Lebanese Al Mayadeen channel, which is affiliated with the resistance axis, also ignores the incident.\n\n##\nThis indicates that Hamas and the axis of resistance are quite shocked by the event and have not yet formulated a response strategy for the media (perhaps they are in a meeting with a media consultant at this time 😁).\nUnofficial channels affiliated with the resistance axis try to downplay the incident and claim that the abductee escaped from Gaza alone without the help of the \"occupation army\"."}, {"id": "d29a848f-a7df-488f-93f4-a3e9476db62a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33210/", "date": "2024-08-27 14:31", "message": "Soroka Spokesperson :\nQaid Farhan Alkadi, 52 years old from Rahat who returned to Israel from Hamas captivity, was evacuated in the afternoon by helicopter to Soroka University Medical Center of the Clalit group.\n\nUpon his arrival, he underwent an initial medical examination at the Medical Center in order to assess his condition and in order to provide him with appropriate medical treatment.\nHe is fully conscious and in good general condition.\nHe has already met with a family member with great excitement.\n\nThese are sensitive moments for the family and we wish to preserve their privacy and dignity.\n\nWe are happy for his rescue and his return home and wish for the return of all the abductees.\n\nInbar Guter\nSoroka Spokesperson\n\nPhoto credit: Soroka Spokesperson"}, {"id": "208b3342-cc6a-4379-9152-06b7b1667236", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33209/", "date": "2024-08-27 12:58", "message": "A Gazan wrote about Qaid's release:\n\nعقبال شعب غزة  يهرب من خاطفيه\n\nMay the people of Gaza escape from their captors (referring to Hamas - AA).\n\nThere are also Gazans who are happy about the release because they believe that after the last of the Israeli abductees is released from the hands of Hamas, the war will end."}, {"id": "39d0cc65-41be-46fd-867a-d5d1ab4ee573", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33208/", "date": "2024-08-27 12:55", "message": "Sinwar continues to lose assets.\nThe IDF's military action brings results.\nAs far as Hamas is concerned, this is a great shame. On the one hand, Hamas insists on negotiations and does not budge, and on the other hand, its bargaining power is decreasing.\nIts military image here is damaged. Hamas struggles to keep its most valuable bargaining chips: live hostages.\n\nI am waiting to hear Qaid speak in the media, in the Arabic language, and share what he went through. It has a great value in terms of information and awareness.\n\nCelebrate life unapologetically, Qaid!\nالحمد لله على السلامة"}, {"id": "a638906f-8c50-406c-81d2-7c049931f84b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33207/", "date": "2024-08-27 12:32", "message": "Welcome back Qaid.\nIt's so good to have you home."}, {"id": "ca1ecfd8-fc21-4dc7-b915-dd4b71b7b98b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33206/", "date": "2024-08-27 12:30", "message": "Joint IDF and ISA Announcement:\n\nCleared for Publication: Today (Tuesday), the IDF and ISA rescued the hostage Qaid Farhan Alkadi, aged 52, from Rahat, who was abducted by the Hamas terror organization into the Gaza Strip on October 7th.\n\nQaid Farhan Alkadi was rescued by Shayetet 13, the 401st Brigade, Yahalom, and ISA forces under the command of the 162nd Division in a complex operation in the southern Gaza Strip.\n\nNo further details can be published due to considerations of the safety of our hostages, the security of our forces, and national security.\n\nHe is in a stable medical condition and is being transferred for medical checks at a hospital. His family has been updated with the details, and the IDF is accompanying them.\n\nIsraeli security forces will continue to operate with all means to bring home the hostages."}, {"id": "4db86a1c-215e-4908-a1d5-26da0551aa00", "channel_id": 1560386984, "url": "", "date": "2024-08-27 12:16", "message": "🇮🇱"}, {"id": "9c58f0c9-001e-4246-a871-82eb79b3a784", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74194/", "date": "2024-08-27 11:39", "message": "Additional documentation of the attack on the Salhi family home in Nuseirat."}, {"id": "a1bfe908-527b-43df-8a08-eba67a6b4e29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33200/", "date": "2024-08-27 11:34", "message": "A-Salhi family home 👆 in Nuseirat after the attack."}, {"id": "a503b284-239a-492f-9487-5abe9c8f71d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33199/", "date": "2024-08-27 11:07", "message": "The attack on the home of the Adel al-Salhi family in Nuseirat a short time ago following an evacuation warning."}, {"id": "332b851f-9d29-4ebc-8253-23ccd72fe8ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33198/", "date": "2024-08-27 10:20", "message": "According to Palestinian channels covering the Rafah area - large parts of the city have turned into ash and dirt, simply sandy areas without buildings (after the IDF destroyed them - AA)\n\nThis is what it says:\nمدينة رفح عبارة عن مدينة رملية في المحاور الاتية ( مخيم يبنا والشابورة ومحيط المحور والعبد جبر ومنطقة عوض الله ومخيم اسدود ومنقطة حي قشطة ومنطقة حي السلام\n\nTranslation: The city of Rafah is actually a \"city of sand\" (no buildings, only sand - AA) in the following directions: Yabna camp, a-Shaboura and its surroundings, al-Abd Jaber, Awadallah area, Ashdod \"camp\", Qishta neighborhood area, and a-Salem neighborhood area.\n\n##\nThe IDF's bulldozers in Rafah in the southern Gaza Strip are working with great vigor."}, {"id": "7867b40e-7770-4a59-b7b2-7a766efbec32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33196/", "date": "2024-08-27 10:19", "message": "Mark Zuckerberg's company Meta (Facebook, WhatsApp and Instagram), admits in an official letter that the Biden-Harris administration pressured it to censor content about Covid-19 and the issue of the laptop of Hunter Biden, the president's son (in which evidence of drug offenses and more was found)."}, {"id": "5a17bb0d-6579-4d46-9cf3-d5cd2e541be2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33195/", "date": "2024-08-27 10:13", "message": "A cartoon mocking Hezbollah's response to the elimination of its top commander Fuad Shukr:\n\nOn Nasrallah's scale, the chicken is equal to (or even heavier than) Shukr's head..."}, {"id": "077b9bbd-d916-4e68-9ae8-581c3afaefa9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33189/", "date": "2024-08-27 09:53", "message": "Jordan announces that it will send four trucks of prosthetics to a clinic in Khan Yunis for amputees in the Gaza Strip, whose number is estimated at 14 thousand - as a result of the ongoing war."}, {"id": "0bfdfa43-3d42-42b4-881a-507417dfa141", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33187/", "date": "2024-08-27 08:55", "message": "Channels identified with Hamas:\n\n مجموعة من المستوطنون يقيمون بؤرة استيطانية في منطقة الخان الأحمر بمدينة القدس المحتلة.\n\n\"A group of settlers established an outpost in the Khan Alahamar area in occupied Jerusalem\""}, {"id": "aa1f47d8-ba31-4913-8845-767f056e9ab2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33186/", "date": "2024-08-27 08:03", "message": "Lebanese sources: one seriously injured and two lightly wounded in an Israeli UAV attack in the area of al-Mjadel in ​​southern Lebanon.\nAnother injured in the IDF attack in Chihine in southern Lebanon."}, {"id": "e3bb65ad-6c08-4f25-af0a-1950d3b3ce95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33183/", "date": "2024-08-27 06:53", "message": "Trump presents a \"new purchase\" from the Democratic Party:\nTulsi Gabbard\n\n20 years in the Democratic Party, served in the US Army and the National Guard. Submitted a bid for a presidency to the Democratic Party in 2019 and gave it up in favor of Biden's candidacy.\nLeft the Democratic Party in 2022."}, {"id": "4a1129b0-a1ef-4784-8ce8-55f64cbe6d6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74194/", "date": "2024-08-27 06:33", "message": "US Joint Chiefs of Staff:\nThe chances of an all-out war in the region have decreased after the attack carried out by Hezbollah."}, {"id": "03183857-ef00-4e4a-990a-4179092bc00b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33206/", "date": "2024-08-27 06:33", "message": "Hezbollah released a video last night documenting the rocket fire it carried out on August 23 at the Ein Zeit base.\nIt can be seen that the launcher is buried in the ground, with a moving opening door that is covered with camouflaging material."}, {"id": "1d2f7589-72f0-4c67-88fa-b38fca492157", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74172/", "date": "2024-08-27 06:30", "message": "\"He wanted to pay off the debt to the residents of Gaza who were the reason for his release.\n\nHe was arrested twice. First time for ten days. He was released and after a week he was arrested again and then released in \"Tufan Al-Aqsa\" with some of the guys, some of whom have already become martyrs - his friends Tarek Daoud, Wael Masha.\nJibril decided that he would never surrender and never betray himself... When he left the house my father asked him, are you sure of the path you want to follow?\nJibril answered him: How did I get out of prison?\nHe said: You were released in the deal.\nHe answered him: Now I have to pay off my debt.\n\nAnd thank God, God accepted him and he was martyred.\nIt was long expected that he would be a martyr. We knew that a long time ago.\nWhen he was 10-11 years old, Jibril saw the Prophet Muhammad in a dream. The prophet took him to Al-Aqsa, fought alongside him (against the Jews. This is what his father also said in a separate video -AA) and told him that he would be a martyr.\nThe explanation was that he would be a martyr at the age of 18.\nAnd really, Jibril turned 18 on July 13.\nWe knew the martyrs would die.\nPraise be to God, we are proud of him, and our heads are lifted up because of it.\nHe (in his death) reserved for us an entrance to heaven. Our family has now had 70 of its people enter heaven.\nA thousand more will come like Jibril.\""}, {"id": "c1096086-213c-48bd-9eb7-6723a1a3f297", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74172/", "date": "2024-08-27 06:28", "message": "\"Jibril wanted to pay off his debt for those who brought about his release in the deal\"\n\nIn the attached video, we see the brother of the terrorist Jibril Jibril, a Hamas operative, who was released in the last deal in November (the minors and women deal with Hamas), explaining the \"debt\" that Jibril felt towards the one who brought about his release, the loyalty towards him, which motivated him to carry out attacks until he \"martyred.\" This was his mindset. This is expected to be the mindset of many of those who will be released (or have already been released in deals with Hamas). The release as part of a deal moves the released with tremendous motivation in a very specific direction.\nAsk the highly motivated freedman from the Shalit deal - Yahya Sinwar.\n\nBelow is a translation of the brother's words 👇"}, {"id": "8bbad476-7046-4f53-8409-3dda2db28a99", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74172/", "date": "2024-08-27 06:25", "message": "Jibril Jibril (in the middle) was a close friend of Wael Masha and Tarek Daoud:\nAll three were released in the last deal with Hamas.\nAll three subsequently joined the military wing of Hamas.\nAll three have carried out attacks against Israelis since they were released.\nAll three were eliminated by the IDF in the last month.\n\n👇👇👇"}, {"id": "6710a492-e07b-494a-b6e0-b941bafc7d32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33183/", "date": "2024-08-27 06:22", "message": "Last night's airstrike in Nur Shams in Tulkarm - these are the 5 terrorists who were killed - all of them military operatives.\nOn the upper left, circled in red, is Jibril Jibril, an operative of the military wing of Hamas, who was released in the last hostage deal with Hamas in November - I will expand on him immediately 👇"}]