[{"id": "74f69b6d-13f2-45ce-85f0-e798781390a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32458/", "date": "2024-08-15 09:43", "message": "The body of Ahmed Sheikh Khalil, the terrorist who was killed by the IDF tonight in a drone attack in the Balata refugee camp in Nablus, is wrapped in the flags of the Fatah movement, next to his M-16 rifle."}, {"id": "76680899-bd50-4d0f-9849-99882ad4f9bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32457/", "date": "2024-08-15 09:42", "message": "Palestinian channels published Israeli documentation of the new state of the Rafah crossing with the caption in Hebrew blurred... a few meters from the Egyptian flag."}, {"id": "cf1681c0-0edc-4c89-94cc-f7c6741440e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32456/", "date": "2024-08-15 08:38", "message": "The IDF spokesman in Arabic published a short time ago another evacuation notice for the residents of a-Satar neighborhood and the Qarara area west of the Salah al-Din axis in Khan Yunis in the southern Gaza Strip.\n\nAccording to the IDF spokesperson, the reason for the evacuation is Hamas rocket fire from this area."}, {"id": "948e5b2d-1de1-4bec-840d-c6126af63cf3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32455/", "date": "2024-08-15 08:37", "message": "New York: Anti-Israel protesters are celebrating the resignation of Nemat Shafik, president of Columbia University, over her performance during a protest against Israel on campus.\n\nShe lost on both sides:\nHamas supporters are outraged that the administration brought the police into the campus and suppressed the protest by force.\nSupporters of Israel are outraged that she allowed such an anti-Semitic protest to spread in the first place."}, {"id": "df636494-10d8-4163-b7ab-286f8383be83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32454/", "date": "2024-08-15 08:35", "message": "Even after the IDF spokesperson officially announced the assassination of Muhammad Deif, senior Hamas official Osama Hamdan claims yesterday that Muhammad Deif is safe and sound and that the announcement by the IDF spokesman was only intended to justify the great slaughter that Israel carried out in the attack."}, {"id": "5fdcc3a7-184f-4fb8-a6a9-eaa321d32b93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32453/", "date": "2024-08-15 07:32", "message": "The Lebanese government has approved the recruitment of 6,000 soldiers to the Lebanese army, of which 1,500 will be recruited in the first phase - in order to implement resolution 1701 (from the end of the Second Lebanon War, according to which the Lebanese army will be deployed in southern Lebanon and enforce the non-introduction of weapons into the region)."}, {"id": "df0c3902-b2a7-4f74-b904-5051cd827e4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32452/", "date": "2024-08-15 06:42", "message": "Optimism in Lebanon\n\nThe newspaper Al-Sharq Al-Awsat from Nabieh Berri, the speaker of the Lebanese parliament and the chairperson of the Shia Amal movement, after he met yesterday with the American envoy Amos Hochstein:\nThe situation today is better than it was yesterday."}, {"id": "c3ace36e-3de2-4c0d-8abd-eb18fb68ab57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32446/", "date": "2024-08-15 06:40", "message": "Today Israel allowed 11 Gazan children to go to Jordan for medical treatment."}, {"id": "c245aaa6-0619-4458-a396-e6655ea19a79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32445/", "date": "2024-08-15 06:39", "message": "In this context, I will mention Trump's promise number 18, if he is elected:\nDeporting Hamas supporters and making US colleges safe and patriotic."}, {"id": "944f4697-6589-4a07-a69b-acb62a72c30a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32444/", "date": "2024-08-15 06:37", "message": "Nemat Shafik, the president of Columbia University in New York resigned in the wake of the student protests in favor of Hamas and against Israel this year."}, {"id": "65a7b57e-193d-4df7-b798-abd9736d4b8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32443/", "date": "2024-08-15 06:34", "message": "Documentation of the terrorist Wael Masha👆, who was killed tonight in a UAV attack in the Balata refugee camp in Nablus, shortly after his release in a deal in November.\nMasha sings with great enthusiasm the praise of Muhammad Deif and the praise of the Izz ad-Din al-Qassam Brigades, the military arm of Hamas."}, {"id": "9f238f03-f1d5-4dad-83db-3f787b87dd71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32442/", "date": "2024-08-15 06:32", "message": "Wael Masha (circled in red), 18 years old, who was killed last night, is an operative of the military wing of Hamas, who was released in the hostage deal with Hamas last November.\nIn the picture here, next to him, appears his friend, the terrorist Tarek Daud (green circle), who was killed by a short-range shot in Qalqilya a few days ago after seriously wounding an Israeli in a shooting attack.\n\n##\nThe other side of the hostage release deal."}, {"id": "dc58d8ed-9be9-405a-91b7-3991d72e4092", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32440/", "date": "2024-08-15 06:32", "message": "Hezbollah reported two deaths in its ranks last night:\n\nHussein Sheitu\nMuhammad Badr al-Din\n\nThey were eliminated in the IDF attacks yesterday (when he was eliminated as such in an attack in the village of Balida and Badr al-Din was apparently eliminated in an attack in Marja'ion).\n\n411 deaths for Hezbollah since the beginning of the war (out of about 550 deaths in Lebanon since the beginning of the war according to the Lebanese Ministry of Health)."}, {"id": "ea6b41fa-2106-4ead-beb5-939184cc8963", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32438/", "date": "2024-08-15 06:30", "message": "In the early morning, the IDF killed two terrorists in the Balata refugee camp in Nablus in an aerial attack.\nThe names of the terrorists:\nWael Masha (right)\nAhmed Sheikh Khalil"}]