[{"id": "0a6e93ef-6702-484f-aaf6-284c4b6f88d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33072/", "date": "2024-08-25 14:58", "message": "A short time ago, the IDF spokesman in Arabic published an evacuation notice for the residents of a neighborhood in the center of Deir al-Balah, which is west of the Salah al-Din axis.\nIts residents are asked to move west.\n\nThis is the first time that these residents have received an evacuation notice."}, {"id": "a721d8cf-1c35-4701-876b-6c09c2ba4dcd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33071/", "date": "2024-08-25 14:35", "message": "The IDF announces the death of David Moshe Ben Shitrit, from the Navy's 914th Squadron.\n\nAccording to Israeli media, he was killed from fragments of an Iron Dome interceptor that struck his vessel during the Hezbollah attack.\n\nMay his memory be a blessing."}, {"id": "2922c1af-b312-4f29-bdd2-e414eb517349", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33070/", "date": "2024-08-25 14:19", "message": "Hezbollah’s reporter Ali Shoieb:\n\nAfter Hezbollah fulfilled its commitment and responded to the Israeli attack on the Dahiyeh area in Beirut, and after thwarting the objectives of the Israeli strikes on southern Lebanese villages by launching hundreds of rockets at enemy bases (according to Shoeib, Hezbollah thwarted the IDF’s preemptive strike), Hezbollah has returned to its usual role of supporting Gaza and attacked a technical facility in Kibbutz Manara.\n\n##\nIt’s interesting what Ali Shoieb is saying here. As Hezbollah's mouthpiece, he is the first to publicly announce \"Hezbollah's narrative\" - and now he is claiming that Hezbollah has already fulfilled its commitment regarding the assassination of its top commander, and is now returning to its \"regular role\" in the ongoing war. This contradicts Hezbollah's announcement this morning that its attack was just the first stage of the response to the assassination of Fuad Shukr. \n\nSo which one is it? In just a few moments we'll probably get an answer from Nasrallah on this."}, {"id": "31d07679-5788-49d4-81eb-68712221c765", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33069/", "date": "2024-08-25 14:10", "message": "A Syrian social media user joins in on mocking Hezbollah: \"Poultry prices in Israel are skyrocketing following Hezbollah's attack...\""}, {"id": "b313bec3-a626-4f70-9c64-918a0719f647", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33068/", "date": "2024-08-25 14:07", "message": "Reuters from a senior Hezbollah official:\n\nThe response to the assassination of Fuad Shukr was delayed due to political reasons, the most important of which is the ceasefire talks in Gaza.\n\nWe wanted to make sure that the response to the assassination would not result in an all-out war..."}, {"id": "b3bb996d-d154-45b6-b30d-69230e28802d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33067/", "date": "2024-08-25 13:47", "message": "Trump, on what's happening in the Middle East today:"}, {"id": "2b99c2b8-1633-4a29-aa8a-06facd6cbbf6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33065/", "date": "2024-08-25 13:03", "message": "CBS network from a senior American source: \"The attacks carried out by Hezbollah did not surprise the Biden administration.\""}, {"id": "614cc53c-2c51-4936-8db1-91e42e59be95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33064/", "date": "2024-08-25 12:11", "message": "Chairman of the Joint Chiefs of Staff, General Charles Q. Brown Jr., met today in Cairo with Egyptian President a-Sisi."}, {"id": "3a9c9295-2952-4314-8c98-f1a485efe08d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33062/", "date": "2024-08-25 12:03", "message": "Hezbollah announces two deaths in its ranks:\n\nKhader Souaid\nHamza Zaghlout\n\nBoth are residents of the village of Hariss in southern Lebanon. They were killed in an IDF attack this morning in a-Tiri\n\n432 dead for Hezbollah since the beginning of the war."}, {"id": "3c87162e-3205-4720-9c35-96678ff6bda9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33061/", "date": "2024-08-25 11:18", "message": "Hamas and the Islamic Jihad commend Hezbollah for the \"powerful response\" to the assassination of Fuad Shukr\n\nHamas in an official announcement: Congratulations to Hezbollah for the high-quality and strong response in the depth of the Zionist entity which is a slap in the face of the fascist occupation government...\n\nThe Islamic Jihad in a proclamation: Congratulate the brothers in Hezbollah for the attack in depth of the raping entity and the success in delivering the bold and courageous blows...\nThe enemy only understands the language of power."}, {"id": "ee2408ef-3e8a-42a1-beb9-a15eccdd1c74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33060/", "date": "2024-08-25 11:16", "message": "IDF Spokesman: \"We thwarted most of the attack that Hezbollah planned and intercepted most of the threats that were launched against the territory of the State of Israel.\""}, {"id": "beaee3c9-e5de-4d8b-b15e-5286d4eb1006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33059/", "date": "2024-08-25 10:38", "message": "More memes from social media mocking Hezbollah on its attack on Israel this morning:\n\nLeaders and military heads of the chickens held an urgent meeting today to figure out how to respond to Hezbollah's attack on the chicken coop.\n\nLet’s hope that both sides exercise restraint..."}, {"id": "3765b8e0-5178-4edc-a716-d3f2c6546299", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33058/", "date": "2024-08-25 10:27", "message": "Supporters of the Syrian opposition:\n\nBelow - Homs after Hezbollah's missiles\nAbove - Tel Aviv after Hezbollah's missiles"}, {"id": "fd0e5804-f596-4c9d-882f-cc4b286db0f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33057/", "date": "2024-08-25 09:57", "message": "IDF: It was decided that restrictions will be lifted in the areas of the Upper Galilee, specified communities in the southern Golan, the Lower Galilee, the Central Galilee, the Beit She'an Valley, the Valleys, the Haifa Bay, the Carmel, Wadi Ara, Menashe, Sharon, and Dan.\n\nIn specified areas of the confrontation line, the northern Golan, and specified communities in the southern Golan, partial activity will be permitted as detailed in the defensive guidelines."}, {"id": "e4780bce-9213-42c8-811b-70fd03f70220", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33056/", "date": "2024-08-25 08:17", "message": "The leader of the Dutch Party for Freedom Greet Wilders addresses this morning's exchange of fire between Israel and Hezbollah.\n\nhttps://x.com/geertwilderspvv/status/1827598071787647042?s=19"}, {"id": "1c6e620b-5391-4e91-85bb-ef8528c9d7d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33053/", "date": "2024-08-25 08:15", "message": "Lebanese channels claim that an Israeli drone crashed in Ain Tanta in northern Lebanon this morning."}, {"id": "44655587-ca00-4892-b6d0-f7908ae0d5a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33052/", "date": "2024-08-25 07:59", "message": "Elon Musk is calling on France to release Pavel Durov, the founder of Telegram."}, {"id": "19f9a9ec-5f29-4e82-99f5-75f51db38e50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33051/", "date": "2024-08-25 07:42", "message": "Lebanese Ministry of Health: Two people were killed in an IDF strike on the village of a-Tiri in southern Lebanon (a different strike from the one in al-Khiyam - AA)."}, {"id": "37beddc8-7784-4b30-a787-7fc4e9bdaf6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33050/", "date": "2024-08-25 07:41", "message": "A military operative from the Shiite Amal Movement, a resident of the village of al-Khiyam in southern Lebanon, was killed \"while fulfilling his jihadist duty.\"\n\n##\nHe may have been the one killed in the Israeli strike in al-Khiam earlier this morning."}, {"id": "7513e49b-2230-4ce1-9844-585215cbfca7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33049/", "date": "2024-08-25 07:40", "message": "Hezbollah’s Third Announcement Today:\n\nAll UAVs launched on time, crossed into Israeli territory, and hit their targets on multiple routes. The mission was successful.\n\nClaims by Israel of a pre-emptive attack are false and will be disproven in Secretary General Nasrallah’s speech later today.\n\n###\n\nNasrallah is expected to speak today at 6 PM (local time)."}, {"id": "d9b5136a-8198-416f-91f0-e766e2d61a8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33048/", "date": "2024-08-25 06:05", "message": "Lebanese sources: at least one dead in the Israeli drone strike on a vehicle in the al-Khiam area 👆"}, {"id": "fce9bdf4-368a-4533-a53a-a020596e9d31", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33046/", "date": "2024-08-25 05:52", "message": "Footage of the victims of the Hezbollah attack..."}, {"id": "73f93d23-df08-4be3-81ab-55f34b76a828", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33045/", "date": "2024-08-25 05:49", "message": "An example of what's happening online - mocking Hezbollah:\n\nحزب الله الإيراني انتقم لمقتل فؤاد شكري وهنية بضرب مزرعة دجاج إسرائيلية وسقوط عدد من الدجاجات.\n\nTranslation: Hezbollah has sought revenge for the deaths of Fuad Shukr and Haniyeh by attacking an Israeli chicken farm, resulting in the deaths of several chickens."}, {"id": "fa9202ff-65b9-4a3a-862b-26b939588e85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33044/", "date": "2024-08-25 05:39", "message": "The battle between Israel and Hezbollah is now moving to the virtual dimension - to social networks..."}, {"id": "188f6ab9-e2d9-4fc5-91dd-4e50d10eab28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33043/", "date": "2024-08-25 05:38", "message": "The Lebanese Al Mayadeen from \"reliable sources\":\n\n\"The response to the elimination of Fuad Shukr was carried out in a very precise and successful manner.\nWhat the occupation army said about thwarting Hezbollah's operation is a lie and propaganda to mislead the Israeli public.\"\n\n##\nNow the \"dance of glorifying the Hezbollah attack\" will begin between the mouthpieces and tweeters of the Shiite axis and the opponents of the axis, who will mock Hezbollah's feeble and weak response to the assassination of Fuad Shukr."}, {"id": "21cb7329-5490-4e88-ba25-c0fb5e84b569", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33042/", "date": "2024-08-25 05:24", "message": "Lebanese media reports on an attack on a vehicle by an Israeli UAV in the village of al-Khiam in southern Lebanon.\n\nAt the same time, Lebanese media reports on attacks in other villages in southern Lebanon."}, {"id": "23e7196c-f3e4-490c-9ed8-8ba1714202de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33041/", "date": "2024-08-25 05:23", "message": "The IDF, through the military reports: We hit thousands of Hezbollah launchers that were aimed at the north of the country and its center. 100 fighter jets participated in the attack.\nThe IDF thwarted the firing of thousands of rockets."}, {"id": "361a5728-a7c2-48ff-b7c8-e01abaaff3cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33040/", "date": "2024-08-25 05:22", "message": "Israeli interception of a UAV launched by Hezbollah this morning."}, {"id": "7f1ea30b-5a39-4a7f-8791-2fb2d7f73bd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33039/", "date": "2024-08-25 04:49", "message": "It can be said that Hezbollah's attack was quite limited in terms of damages so far. The Ben Gurion airport was closed for less than two hours.\nOn the other hand, it was worth taking down the Hezbollah Chief of Staff.\nMaybe it's time to strive for more than that (:"}, {"id": "7a410279-2e1c-41f6-8f72-c22ded2f3cf1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33038/", "date": "2024-08-25 04:45", "message": "The IDF spokesperson announced the fall of a soldier in the paratrooper brigade in the battle in the southern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "02f7fe67-25e1-4a52-8bf1-c8ebdbae2833", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33037/", "date": "2024-08-25 04:28", "message": "US Department of Defense:\n\nThe Minister of Defense spoke with his Israeli counterpart and emphasized to him the commitment of the US to defend Israel against attacks by Iran and its proxies."}, {"id": "119414b0-85c4-4022-9e1c-e51ffb4e7a93", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73992/", "date": "2024-08-25 04:28", "message": "France arrested Telegram founder Pavel Durov tonight\n\nDurov, who holds dual  French and Russian citizenship, was arrested after arriving in France on his private plane.\nHe is charged with crimes of supporting terrorism, child exploitation, drug trafficking, money laundering and fraud - this is against the background of Telegram's non-cooperation with the French authorities to prevent activities carried out through Telegram.\n\nThe punishment for the charges against him reach up to 20 years in prison in France.\n\nThe virtual currency Ton that Telegram promotes (and owns) reacted with a decrease of about 7%."}, {"id": "cfc54f73-2d09-4072-b75a-4d81807ceb09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33035/", "date": "2024-08-25 04:21", "message": "A few hours before the Hezbollah attack and the IDF's preemptive strike, the Al Mayadeen channel published the following from a \"source in the opposition\":\n\nThe meeting of the Hamas delegation in Cairo did not lead to significant progress.\nIsrael stuck to the decision to stay in the Philadelphi axis in the first phase.\nHamas adheres to the July 2 proposal and opposes an Israeli presence on the Philadelphi axis."}, {"id": "f57403c3-da51-42d5-a622-a11d5760ba90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33034/", "date": "2024-08-25 04:20", "message": "Hezbollah in an announcement on the nature of the attack this morning:\n\n1. The first phase of the attack, which included attacking IDF posts and equipment to facilitate the passage of the UAVs, was successfully completed. The UAVs crossed towards the target, as planned. \n\n2. 320 Katyusha rockets were launched at enemy bases. \n\n3. (Hezbollah lists 11 bases that were attacked - AA) \n\n4. The other details of the attack will be published in additional announcements."}, {"id": "08a970c7-57e6-4cb9-a78b-a9d0047d8632", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33033/", "date": "2024-08-25 04:19", "message": "IDF Spokesperson: Ben Gurion Airfield will reopen to air traffic at 07:00."}, {"id": "5a0ba348-f1e6-4719-af22-8e879e3c75da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33031/", "date": "2024-08-25 04:18", "message": "IDF attacks in Ein Qana and Rihan in southern Lebanon."}, {"id": "2a234ca7-301a-414a-adbc-e6f90207307f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33030/", "date": "2024-08-25 04:18", "message": "The White House: President Biden is following the events in Israel and Lebanon."}, {"id": "ec0bc2ce-2920-4710-97e9-48aeaa3d8cf4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33029/", "date": "2024-08-25 04:17", "message": "IDF: Following the situational assessment, it was determined that as of today (Sunday) at 06:00, life-saving changes will be made to the Home Front Command’s defensive guidelines.\n\nAs part of the changes, it was decided that in the areas of the northern Golan, the southern Golan, the confrontation line, the Upper Galilee, the Lower Galilee, the Central Galilee, the Beit She'an Valley, the Valleys, the Haifa bay, the Carmel, Wadi Ara, Menashe, Sharon, and Dan partial restrictions will be imposed.\n\nWe ask the public to follow the instructions of the Home Front Command regarding the situation and wait for additional instructions. \n\nThe instructions published on the official Home Front Command channels must be followed. The full instructions are updated on the National Emergency Portal and the Home Front Command app."}, {"id": "dfba6adf-959f-441b-bb20-e28f048857b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33028/", "date": "2024-08-25 04:16", "message": "Hezbollah has announced the beginning of its response following the assassination of its Chief of Staff\n\nHezbollah recently issued a statement declaring that this morning, on the fortieth day since the death of Imam Hussein bin Ali, the grandson of the Prophet Muhammad (a significant date in Shiite religious tradition), its operatives began their initial retaliation for the assassination of Hezbollah's Chief of Staff, Fuad Shukr.\n\nAccording to the statement, Hezbollah operatives targeted a high-value military objective using numerous drones; details of the target will be released later. This was in parallel with attacks on several IDF positions using a large number of rockets.\n\nA formal statement will be released upon the conclusion of the attacks.\n\n(Hezbollah's announcement was also prepared in advance)"}, {"id": "9ae5cb05-f68f-4136-adc7-6103a6a3c5c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33027/", "date": "2024-08-25 04:15", "message": "Defense Minister Gallant announced: adjustments made to the situation on the home front for 48 hours."}, {"id": "5edaf44a-8b1f-4f60-a973-2e83acaf890d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33026/", "date": "2024-08-25 04:14", "message": "Lebanese sources: Most of the Israeli attacks in southern Lebanon were in wooded and uninhabited areas, outside the villages."}, {"id": "11f316b4-c32c-4cc9-8c0a-5615edb60aef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33025/", "date": "2024-08-25 04:13", "message": "Additional footage from the wave of IDF attacks in southern Lebanon."}, {"id": "7d2e5f7b-1ad4-4653-9dcc-fc1ec0bd34fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33024/", "date": "2024-08-25 04:13", "message": "Ben Gurion Airport closed around 4:30AM for takeoffs and landings."}, {"id": "5e3fe01d-e74b-4457-a9b2-6274581a3312", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33023/", "date": "2024-08-25 04:13", "message": "Footage of IDF attacks in southern Lebanon\n\nThe Lebanese define them as \"Belt of Fire attacks\" - they use terminology that almost exclusively applied to attacks in the Gaza Strip to this day."}, {"id": "4671733a-f786-43f6-bdbd-170c927e2753", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33022/", "date": "2024-08-25 04:12", "message": "The Lebanese Al Mayadeen: The wave of attacks around 5AM lasted 20 minutes."}, {"id": "d083aa35-558e-4591-9a22-1fd28eb2fac0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33021/", "date": "2024-08-25 04:11", "message": "Lebanese sources report that the Air Force planes were spotted in the skies of Beirut around 5AM local time."}, {"id": "dd97573e-ee94-4b93-8ceb-b184f36b2e94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33020/", "date": "2024-08-25 04:10", "message": "The IDF spokesperson appeals to the citizens of southern Lebanon (Arabic subtitles) and asks them to stay away from the areas from which Hezbollah is attacking - to protect themselves.\n\n##\nYou can see that this is a pre-prepared video."}, {"id": "de7d473c-0208-4e0c-a67f-6483da87507b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33017/", "date": "2024-08-25 04:09", "message": "Lebanese sources report at least 40 attacks by the IDF around 5am in southern Lebanon - a preemptive attack, according to the IDF spokesperson."}, {"id": "32f521cf-39ac-428f-a599-febce67c013c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33016/", "date": "2024-08-25 04:07", "message": "IDF: \"The IDF identified the Hezbollah terrorist organization preparing to fire missiles and rockets toward Israeli territory. In response to these threats, the IDF is striking terror targets in Lebanon\"\n\nIsraeli Air Force fighter jets are currently striking targets belonging to the Hezbollah terrorist organization that posed an imminent threat to the citizens of the State of Israel.\n\nFollowing the strikes, and in accordance with the IDF Home Front Command’s situational assessment, life-saving guidelines for the public in certain areas of Israel will be published.\n\nAttached is an English statement by the IDF Spokesperson, RDML Daniel Hagari:\nhttps://bit.ly/3YUvfSl\n\nAttached are the full remarks of the IDF spokesperson, RDML Daniel Hagari:\n\n“A short while ago, the IDF identified the Hezbollah terrorist organization preparing to fire missiles and rockets toward Israeli territory.\n\n‌‏In a self-defense act to remove these threats, the IDF is striking terror targets in Lebanon, from which Hezbollah was planning to launch their attacks on Israeli civilians.\n\n‌‏This follows more than 6,700 rockets, missiles, and explosive UAVs fired by Hezbollah at Israeli families, homes, and communities since October 8th.\n\nHezbollah will soon fire rockets, and possibly missiles and UAVs, towards Israeli territory.\n‌‏We will shortly update the Home Front Command Defensive guidelines for those in Israel.\n\n‌‏From right next to the homes of Lebanese civilians in the South of Lebanon, we can see that Hezbollah is preparing to launch an extensive attack on Israel, while endangering the Lebanese civilians.\n‌‏We warn the civilians located in the areas where Hezbollah is operating, to move out of harm's way immediately for their own safety.\n\nHezbollah’s ongoing aggression risks dragging the people of Lebanon, the people of Israel- and the whole region- into a wider escalation.\n\n‌‏Israel will not tolerate Hezbollah’s attacks on our civilians.\n\n‌‏We are operating in self defense from Hezbollah - and any other enemy that joins in their attacks against us- and we are ready to do everything we need to defend the people of Israel.״"}]